[
    {
        "content": "quote: AMERICA made clear last week that it would attack Taliban forces in their Swat valley stronghold unless the Pakistan government stopped the militants’ advance towards Islamabad. A senior Pakistani official said the Obama administration intervened after Taliban forces expanded from Swat into the adjacent district of Buner, 60 miles from the capital. The Pakistani Taliban’s inroads raised international concern, particularly in Washington, where officials feared that the nuclear-armed country, which is pivotal to the US war against the Taliban in Afghanistan and against Al-Qaeda, was rapidly succumbing to Islamist extremists. “The implicit threat - if you don’t do it, we may have to - was always there,” said the Pakistani official. He said that under American pressure, Pakistan’s Inter-Services Intelligence (ISI) agency told the Taliban to withdraw from Buner on Friday. (....) +http://www.timesonline.co.uk/tol/news/world/asia/article6168940.ece \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090425, 
        "postID": 1, 
        "quote": "AMERICA made clear last week that it would attack Taliban forces in their Swat valley stronghold unless the Pakistan government stopped the militants’ advance towards Islamabad. A senior Pakistani official said the Obama administration intervened after Taliban forces expanded from Swat into the adjacent district of Buner, 60 miles from the capital. The Pakistani Taliban’s inroads raised international concern, particularly in Washington, where officials feared that the nuclear-armed country, which is pivotal to the US war against the Taliban in Afghanistan and against Al-Qaeda, was rapidly succumbing to Islamist extremists. “The implicit threat - if you don’t do it, we may have to - was always there,” said the Pakistani official. He said that under American pressure, Pakistan’s Inter-Services Intelligence (ISI) agency told the Taliban to withdraw from Buner on Friday. (....)", 
        "reply": " +http://www.timesonline.co.uk/tol/news/world/asia/article6168940.ece \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-25 14:47:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "NSNN"
    }, 
    {
        "content": "Now this is what I'm talking about, but the taliban are still there, they are still safe and secure in their strongholds...", 
        "intTime": 20090425, 
        "postID": 2, 
        "quote": "", 
        "reply": "Now this is what I'm talking about, but the taliban are still there, they are still safe and secure in their strongholds...", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-25 14:54:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "The last I read is the Buner area has been occupied by regular army. The Taliban, Told by the ISI the advancement towards Islamabad would not be healthy. Story says their departure is temporary. History has shown Pakistan has never had a civilian government last more than a few month before the military takes government reins. Musharaff came to power and most were against his rule. The end results the political turmoil returning with a vengeance. Bhutto was murder by the extremist so its only natural for them to sign deals with the murderers. Before that Bhutto and husband had been indicted in six countries for money laundering fraud and graft. It's hard to realize that only 20% of the population falls in the extremist catagory. Seems much heavier now . \"http://www.guardian.co.uk/commentisfree/2009/apr/24/pakistan-swat-valley-taliban Pakistan's Swat dream turns into a nightmareThe Taliban has failed to keep its side of the bargain in the Swat Valley – and Pakistan is facing criticism at home and abroad Comments It seemed like a good idea at the time. Rather than endlessly engage in inconclusive, on-off guerrilla warfare with Taliban insurgents, Pakistan's security forces cut a deal. The Islamists would have de facto local administrative control, including implementation of sharia law. In return, they would accept federal government authority, stop fighting, and lay down their arms. But February's deal in Swat has brought nothing but trouble, as its many domestic and foreign critics predicted. Tales of Taliban outrages against local people, including summary executions and the flogging of women for un-Islamist behaviour, gave the lie to claims that Swat's 1.5 million residents supported the militants' takeover. It quickly became clear that Taliban leaders would not keep their side of the bargain. No arms were decommissioned; instead local police and judges were hounded out. Speaking from Swat in a nationally televised address last week, Maulana Sufi Muhammad, a senior cleric, said the aim was to create a \"complete Islamic system\" for the north-west region and ultimately, the entire country. Specifically, Sufi Muhammad said appeals from sharia courts to state courts would not be allowed, despite earlier undertakings. \"All un-Islamic laws and customs will be abolished,\" he said, making it plain that he and other radicals such as the recently freed Maulana Abdul Aziz regarded Pakistan's western-style democratic constitution as illegitimate. \"The Qur'an says supporting an infidel system is a great sin.\" Taliban fighters are now increasingly using Swat as a base from which to extend their control, moving in force into Buner and Shangla districts and deploying ever closer to the capital, Islamabad. Paramilitary troops sent to Buner were repulsed with casualties this week. A Taliban withdrawal, announced today, is likely to be both tactical and temporary. Pakistan's president, Asif Ali Zardari, and his ministers now face a growing storm of criticism over an alleged abdication of leadership in North-West Frontier province and neighbouring Fata, the federally administered tribal areas bordering Afghanistan. But they continue to defend the Swat deal, arguing it may yet work, that it was their only viable option, and that it is similar to local alliances forged by the US in Afghanistan and Iraq. Maleeha Lodhi, a former senior Pakistan diplomat in London and Washington, said the pact was a disaster in both local security and human rights terms. But its wider ramifications were more troubling still. \"First and foremost it represents a retreat from Jinnah's Pakistan,\" she said in a recent commentary, referring to the country's founder, Muhammad Ali Jinnah. \"It is the very antithesis of [his] visions and ideals, the core of which were a modern, unified Muslim state, not one fragmented along obscurantist and sectarian lines.\" Lodhi said the deal betrayed the people of Swat and could mark a turning point in Pakistan's struggle against extremism. \"Rattled by more aggressive actions by militants, the political and security establishments caved in to the challenge ... The deal signalled weakness and bankruptcy on the part of the ruling elite that [has] chosen appeasement.\" Some analysts suggest the government is biding its time, waiting for the Islamists to over-reach – and that when it is plain to the public that they cannot be trusted or reasoned with, Islamabad will send the army to crush them. But others detect a lack of political will, a deep-set ambiguity about confronting groups that have served Pakistan's purposes in the past in Afghanistan and Kashmir, and also, perhaps, a failure of nerve. An increasingly harsh view is being taken in Washington, where Richard Holbrooke, Barack Obama's special representative, admitted this week that more attention was now focused on Pakistan than on the war in Afghanistan. Secretary of state Hillary Clinton, defence secretary Robert Gates, and the White House have all urged Zardari to get tough. US officials worry further that the militants' influence is spreading into the heartlands of Punjab, and that the Pashtun Taliban and their Arab jihadi associates are forming alliances with Punjabi extremists, such as Lashkar-e-Taiba, implicated in the attack on Sri Lanka's cricketers in Lahore in March. But the biggest western worry is that fracturing political authority and rising militancy in Pakistan will fatally undermine the linked war against the Taliban and al-Qaida in Afghanistan. Anger at US policy in general and at US aerial raids into north-western Pakistan, and potentially into Baluchistan in the south, have contributed mightily to this spreading, shared instability. Now the Swat debacle is bringing the nightmare of an escalating, widening, simultaneous two-country war steadily closer. For the US, Britain and their allies, the looming spectre is not one failed state but two\"", 
        "intTime": 20090425, 
        "postID": 3, 
        "quote": "", 
        "reply": "The last I read is the Buner area has been occupied by regular army. The Taliban, Told by the ISI the advancement towards Islamabad would not be healthy. Story says their departure is temporary. History has shown Pakistan has never had a civilian government last more than a few month before the military takes government reins. Musharaff came to power and most were against his rule. The end results the political turmoil returning with a vengeance. Bhutto was murder by the extremist so its only natural for them to sign deals with the murderers. Before that Bhutto and husband had been indicted in six countries for money laundering fraud and graft. It's hard to realize that only 20% of the population falls in the extremist catagory. Seems much heavier now . \"http://www.guardian.co.uk/commentisfree/2009/apr/24/pakistan-swat-valley-taliban Pakistan's Swat dream turns into a nightmareThe Taliban has failed to keep its side of the bargain in the Swat Valley – and Pakistan is facing criticism at home and abroad Comments It seemed like a good idea at the time. Rather than endlessly engage in inconclusive, on-off guerrilla warfare with Taliban insurgents, Pakistan's security forces cut a deal. The Islamists would have de facto local administrative control, including implementation of sharia law. In return, they would accept federal government authority, stop fighting, and lay down their arms. But February's deal in Swat has brought nothing but trouble, as its many domestic and foreign critics predicted. Tales of Taliban outrages against local people, including summary executions and the flogging of women for un-Islamist behaviour, gave the lie to claims that Swat's 1.5 million residents supported the militants' takeover. It quickly became clear that Taliban leaders would not keep their side of the bargain. No arms were decommissioned; instead local police and judges were hounded out. Speaking from Swat in a nationally televised address last week, Maulana Sufi Muhammad, a senior cleric, said the aim was to create a \"complete Islamic system\" for the north-west region and ultimately, the entire country. Specifically, Sufi Muhammad said appeals from sharia courts to state courts would not be allowed, despite earlier undertakings. \"All un-Islamic laws and customs will be abolished,\" he said, making it plain that he and other radicals such as the recently freed Maulana Abdul Aziz regarded Pakistan's western-style democratic constitution as illegitimate. \"The Qur'an says supporting an infidel system is a great sin.\" Taliban fighters are now increasingly using Swat as a base from which to extend their control, moving in force into Buner and Shangla districts and deploying ever closer to the capital, Islamabad. Paramilitary troops sent to Buner were repulsed with casualties this week. A Taliban withdrawal, announced today, is likely to be both tactical and temporary. Pakistan's president, Asif Ali Zardari, and his ministers now face a growing storm of criticism over an alleged abdication of leadership in North-West Frontier province and neighbouring Fata, the federally administered tribal areas bordering Afghanistan. But they continue to defend the Swat deal, arguing it may yet work, that it was their only viable option, and that it is similar to local alliances forged by the US in Afghanistan and Iraq. Maleeha Lodhi, a former senior Pakistan diplomat in London and Washington, said the pact was a disaster in both local security and human rights terms. But its wider ramifications were more troubling still. \"First and foremost it represents a retreat from Jinnah's Pakistan,\" she said in a recent commentary, referring to the country's founder, Muhammad Ali Jinnah. \"It is the very antithesis of [his] visions and ideals, the core of which were a modern, unified Muslim state, not one fragmented along obscurantist and sectarian lines.\" Lodhi said the deal betrayed the people of Swat and could mark a turning point in Pakistan's struggle against extremism. \"Rattled by more aggressive actions by militants, the political and security establishments caved in to the challenge ... The deal signalled weakness and bankruptcy on the part of the ruling elite that [has] chosen appeasement.\" Some analysts suggest the government is biding its time, waiting for the Islamists to over-reach – and that when it is plain to the public that they cannot be trusted or reasoned with, Islamabad will send the army to crush them. But others detect a lack of political will, a deep-set ambiguity about confronting groups that have served Pakistan's purposes in the past in Afghanistan and Kashmir, and also, perhaps, a failure of nerve. An increasingly harsh view is being taken in Washington, where Richard Holbrooke, Barack Obama's special representative, admitted this week that more attention was now focused on Pakistan than on the war in Afghanistan. Secretary of state Hillary Clinton, defence secretary Robert Gates, and the White House have all urged Zardari to get tough. US officials worry further that the militants' influence is spreading into the heartlands of Punjab, and that the Pashtun Taliban and their Arab jihadi associates are forming alliances with Punjabi extremists, such as Lashkar-e-Taiba, implicated in the attack on Sri Lanka's cricketers in Lahore in March. But the biggest western worry is that fracturing political authority and rising militancy in Pakistan will fatally undermine the linked war against the Taliban and al-Qaida in Afghanistan. Anger at US policy in general and at US aerial raids into north-western Pakistan, and potentially into Baluchistan in the south, have contributed mightily to this spreading, shared instability. Now the Swat debacle is bringing the nightmare of an escalating, widening, simultaneous two-country war steadily closer. For the US, Britain and their allies, the looming spectre is not one failed state but two\"", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-25 18:00:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: The last I read is the Buner area has been occupied by regular army. The Taliban, Told by the ISI the advancement towards Islamabad would not be healthy. Story says their departure is temporary. History has shown Pakistan has never had a civilian government last more than a few month before the military takes government reins. Musharaff came to power and most were against his rule. The end results the political turmoil returning with a vengeance. Bhutto was murder by the extremist so its only natural for them to sign deals with the murderers. Before that Bhutto and husband had been indicted in six countries for money laundering fraud and graft. It's hard to realize that only 20% of the population falls in the extremist catagory. Seems much heavier now . \"http://www.guardian.co.uk/commentisfree/2009/apr/24/pakistan-swat-valley-taliban One would think that of all people, the Pakistani's would be aware that to those with the Al Qaeda mentality, the only thing worse than an infidel, is an heretic. They would honor a deal with us quicker then they will honor a deal with Pakistan, and they wouldn't honor a deal with us for more than a few hours... Dave", 
        "intTime": 20090425, 
        "postID": 4, 
        "quote": "Originally posted by rayevinsonsr: The last I read is the Buner area has been occupied by regular army. The Taliban, Told by the ISI the advancement towards Islamabad would not be healthy. Story says their departure is temporary. History has shown Pakistan has never had a civilian government last more than a few month before the military takes government reins. Musharaff came to power and most were against his rule. The end results the political turmoil returning with a vengeance. Bhutto was murder by the extremist so its only natural for them to sign deals with the murderers. Before that Bhutto and husband had been indicted in six countries for money laundering fraud and graft. It's hard to realize that only 20% of the population falls in the extremist catagory. Seems much heavier now . \"http://www.guardian.co.uk/commentisfree/2009/apr/24/pakistan-swat-valley-taliban", 
        "reply": " One would think that of all people, the Pakistani's would be aware that to those with the Al Qaeda mentality, the only thing worse than an infidel, is an heretic. They would honor a deal with us quicker then they will honor a deal with Pakistan, and they wouldn't honor a deal with us for more than a few hours... Dave", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-25 18:30:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "Grachus"
    }, 
    {
        "content": "The ISI controls the Taliban, hence when they said leave Buner they did.", 
        "intTime": 20090425, 
        "postID": 5, 
        "quote": "", 
        "reply": "The ISI controls the Taliban, hence when they said leave Buner they did.", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-25 18:41:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "GeraldM"
    }, 
    {
        "content": ">http://www.nytimes.com/2009/04/26/world/asia/26buner.html?em The Taliban are taking advantage of Government inability to provide real security. But that doesn't mean that a couple of PAK Army brigades or a swarm of RPV's is going to help the situation either. The Taliban seem to have public support - unless they're forcing the locals out to cheer them.", 
        "intTime": 20090426, 
        "postID": 6, 
        "quote": "", 
        "reply": ">http://www.nytimes.com/2009/04/26/world/asia/26buner.html?em The Taliban are taking advantage of Government inability to provide real security. But that doesn't mean that a couple of PAK Army brigades or a swarm of RPV's is going to help the situation either. The Taliban seem to have public support - unless they're forcing the locals out to cheer them.", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-26 03:46:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by NSNN: [QUOTE]AMERICA made clear last week that it would attack Taliban forces in their Swat valley stronghold unless the Pakistan government stopped the militants’ advance towards Islamabad. Sounds like more strong and decisive leadership from President Obama. Walt", 
        "intTime": 20090426, 
        "postID": 7, 
        "quote": "Originally posted by NSNN: [QUOTE]AMERICA made clear last week that it would attack Taliban forces in their Swat valley stronghold unless the Pakistan government stopped the militants’ advance towards Islamabad.", 
        "reply": " Sounds like more strong and decisive leadership from President Obama. Walt", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-26 05:20:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by NSNN: [QUOTE]AMERICA made clear last week that it would attack Taliban forces in their Swat valley stronghold unless the Pakistan government stopped the militants’ advance towards Islamabad. Sounds like more strong and decisive leadership from President Obama. Walt ============================================= Seems to me that his promise to end all wars is down the tubes , he is going to send more young me to die like Bush did. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090426, 
        "postID": 8, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by NSNN: [QUOTE]AMERICA made clear last week that it would attack Taliban forces in their Swat valley stronghold unless the Pakistan government stopped the militants’ advance towards Islamabad. Sounds like more strong and decisive leadership from President Obama. Walt", 
        "reply": " ============================================= Seems to me that his promise to end all wars is down the tubes , he is going to send more young me to die like Bush did. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-26 07:06:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "EOCRon"
    }, 
    {
        "content": "quote: Originally posted by EOCRon: quote: Originally posted by WhiskeyPapa: quote: Originally posted by NSNN: [QUOTE]AMERICA made clear last week that it would attack Taliban forces in their Swat valley stronghold unless the Pakistan government stopped the militants’ advance towards Islamabad. Sounds like more strong and decisive leadership from President Obama. Walt ============================================= Seems to me that his promise to end all wars is down the tubes , he is going to send more young me to die like Bush did. I'll be waiting for your link to Obama promising to \"end all wars\".", 
        "intTime": 20090426, 
        "postID": 9, 
        "quote": "Originally posted by EOCRon: quote: Originally posted by WhiskeyPapa: quote: Originally posted by NSNN: [QUOTE]AMERICA made clear last week that it would attack Taliban forces in their Swat valley stronghold unless the Pakistan government stopped the militants’ advance towards Islamabad. Sounds like more strong and decisive leadership from President Obama. Walt ============================================= Seems to me that his promise to end all wars is down the tubes , he is going to send more young me to die like Bush did.", 
        "reply": " I'll be waiting for your link to Obama promising to \"end all wars\".", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-26 07:17:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by EOCRon: quote: Originally posted by WhiskeyPapa: quote: Originally posted by NSNN: [QUOTE]AMERICA made clear last week that it would attack Taliban forces in their Swat valley stronghold unless the Pakistan government stopped the militants’ advance towards Islamabad. Sounds like more strong and decisive leadership from President Obama. Walt ============================================= Seems to me that his promise to end all wars is down the tubes , he is going to send more young me to die like Bush did. A couple well-placed W-88 warheads would be able to do the trick just fine", 
        "intTime": 20090426, 
        "postID": 10, 
        "quote": "Originally posted by EOCRon: quote: Originally posted by WhiskeyPapa: quote: Originally posted by NSNN: [QUOTE]AMERICA made clear last week that it would attack Taliban forces in their Swat valley stronghold unless the Pakistan government stopped the militants’ advance towards Islamabad. Sounds like more strong and decisive leadership from President Obama. Walt ============================================= Seems to me that his promise to end all wars is down the tubes , he is going to send more young me to die like Bush did.", 
        "reply": " A couple well-placed W-88 warheads would be able to do the trick just fine", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-26 07:37:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by EOCRon: quote: Originally posted by WhiskeyPapa: quote: Originally posted by NSNN: [QUOTE]AMERICA made clear last week that it would attack Taliban forces in their Swat valley stronghold unless the Pakistan government stopped the militants’ advance towards Islamabad. Sounds like more strong and decisive leadership from President Obama. Walt ============================================= Seems to me that his promise to end all wars is down the tubes , he is going to send more young me to die like Bush did. A couple well-placed W-88 warheads would be able to do the trick just fine Yeah but, it just might pizz off some of those fine folks down wind, that have nukes... Respectfully, SUNLINER81", 
        "intTime": 20090426, 
        "postID": 11, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by EOCRon: quote: Originally posted by WhiskeyPapa: quote: Originally posted by NSNN: [QUOTE]AMERICA made clear last week that it would attack Taliban forces in their Swat valley stronghold unless the Pakistan government stopped the militants’ advance towards Islamabad. Sounds like more strong and decisive leadership from President Obama. Walt ============================================= Seems to me that his promise to end all wars is down the tubes , he is going to send more young me to die like Bush did. A couple well-placed W-88 warheads would be able to do the trick just fine", 
        "reply": " Yeah but, it just might pizz off some of those fine folks down wind, that have nukes... Respectfully, SUNLINER81", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-26 08:06:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "All Obama has to do is keep his promise to find a cure for Cancer on his watch and then keep the cure a very high Top Secret medical secret. He could use the treatment to bribe other countries to do things like stop Terror attacks against us, high gas prices, high corn prices, boarder crossings of Mexicans, importing drugs, etc. Just think of it? For example, Castro is dying of cancer. Obama says \"I can cure you but in return you have to sell my wife 40 aches of beach front property. Or how about telling China that it will give them the cure to erase all our debt we owe them. That will work.", 
        "intTime": 20090426, 
        "postID": 12, 
        "quote": "", 
        "reply": "All Obama has to do is keep his promise to find a cure for Cancer on his watch and then keep the cure a very high Top Secret medical secret. He could use the treatment to bribe other countries to do things like stop Terror attacks against us, high gas prices, high corn prices, boarder crossings of Mexicans, importing drugs, etc. Just think of it? For example, Castro is dying of cancer. Obama says \"I can cure you but in return you have to sell my wife 40 aches of beach front property. Or how about telling China that it will give them the cure to erase all our debt we owe them. That will work.", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-26 08:20:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by EOCRon: Seems to me that his promise to end all wars is down the tubes , he is going to send more young me to die like Bush did. He never promised the war in Afghanistan was going to end on his watch. Did he promise to end the war in Kosovo, too? Quit making up things.", 
        "intTime": 20090426, 
        "postID": 13, 
        "quote": "Originally posted by EOCRon: Seems to me that his promise to end all wars is down the tubes , he is going to send more young me to die like Bush did.", 
        "reply": " He never promised the war in Afghanistan was going to end on his watch. Did he promise to end the war in Kosovo, too? Quit making up things.", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-26 08:38:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by PhoenixDark: quote: Originally posted by EOCRon: quote: Originally posted by WhiskeyPapa: quote: Originally posted by NSNN: [QUOTE]AMERICA made clear last week that it would attack Taliban forces in their Swat valley stronghold unless the Pakistan government stopped the militants’ advance towards Islamabad. Sounds like more strong and decisive leadership from President Obama. Walt ============================================= Seems to me that his promise to end all wars is down the tubes , he is going to send more young me to die like Bush did. A couple well-placed W-88 warheads would be able to do the trick just fine Yeah but, it just might pizz off some of those fine folks down wind, that have nukes... Respectfully, SUNLINER81 I don't think the Israelis or Indians would mind seeing that section of Pakistan go up in a nuclear fireball - less headaches for them", 
        "intTime": 20090426, 
        "postID": 14, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by PhoenixDark: quote: Originally posted by EOCRon: quote: Originally posted by WhiskeyPapa: quote: Originally posted by NSNN: [QUOTE]AMERICA made clear last week that it would attack Taliban forces in their Swat valley stronghold unless the Pakistan government stopped the militants’ advance towards Islamabad. Sounds like more strong and decisive leadership from President Obama. Walt ============================================= Seems to me that his promise to end all wars is down the tubes , he is going to send more young me to die like Bush did. A couple well-placed W-88 warheads would be able to do the trick just fine Yeah but, it just might pizz off some of those fine folks down wind, that have nukes... Respectfully, SUNLINER81", 
        "reply": " I don't think the Israelis or Indians would mind seeing that section of Pakistan go up in a nuclear fireball - less headaches for them", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-26 08:52:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SUNLINER81: quote: Originally posted by PhoenixDark: quote: Originally posted by EOCRon: quote: Originally posted by WhiskeyPapa: quote: Originally posted by NSNN: [QUOTE]AMERICA made clear last week that it would attack Taliban forces in their Swat valley stronghold unless the Pakistan government stopped the militants’ advance towards Islamabad. Sounds like more strong and decisive leadership from President Obama. Walt ============================================= Seems to me that his promise to end all wars is down the tubes , he is going to send more young me to die like Bush did. A couple well-placed W-88 warheads would be able to do the trick just fine Yeah but, it just might pizz off some of those fine folks down wind, that have nukes... Respectfully, SUNLINER81 I don't think the Israelis or Indians would mind seeing that section of Pakistan go up in a nuclear fireball - less headaches for them Yeah but, nuclear fallout carries around the world... It would be kinda tough to American parents, when you explain to them that little Johnny and little Peggy, will not be able to drink milk, eat certain vegetables and fruits and will have to not go out and play at recess, due to the radio active nature of the atmosphere and that the soil that produces feed for the cows and food for us, has a high level of radiation... Respectfully, SUNLINER81", 
        "intTime": 20090426, 
        "postID": 15, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SUNLINER81: quote: Originally posted by PhoenixDark: quote: Originally posted by EOCRon: quote: Originally posted by WhiskeyPapa: quote: Originally posted by NSNN: [QUOTE]AMERICA made clear last week that it would attack Taliban forces in their Swat valley stronghold unless the Pakistan government stopped the militants’ advance towards Islamabad. Sounds like more strong and decisive leadership from President Obama. Walt ============================================= Seems to me that his promise to end all wars is down the tubes , he is going to send more young me to die like Bush did. A couple well-placed W-88 warheads would be able to do the trick just fine Yeah but, it just might pizz off some of those fine folks down wind, that have nukes... Respectfully, SUNLINER81 I don't think the Israelis or Indians would mind seeing that section of Pakistan go up in a nuclear fireball - less headaches for them", 
        "reply": " Yeah but, nuclear fallout carries around the world... It would be kinda tough to American parents, when you explain to them that little Johnny and little Peggy, will not be able to drink milk, eat certain vegetables and fruits and will have to not go out and play at recess, due to the radio active nature of the atmosphere and that the soil that produces feed for the cows and food for us, has a high level of radiation... Respectfully, SUNLINER81", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-26 09:08:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I hate to bring up \"ancient history\", but if George W. Bush hadn't diverted us into Iraq we would not have the Talaban problem. Prior to the Iraq diversion, we had the Talaban defeated and would have gotten bin Laden and his al Qaeda as well. Now the Talaban have had time to regroup, rearm and recruit. So, we are faced with a resourceful force holding a geographic area that is most for us difficult to attack and easy for them to defend. Additionally, most of the area under Talaban control is in Pakistan. So, let's give Pres. Obama and our military all the time necessary to deal with a most complex political and military problem.", 
        "intTime": 20090426, 
        "postID": 16, 
        "quote": "", 
        "reply": "I hate to bring up \"ancient history\", but if George W. Bush hadn't diverted us into Iraq we would not have the Talaban problem. Prior to the Iraq diversion, we had the Talaban defeated and would have gotten bin Laden and his al Qaeda as well. Now the Talaban have had time to regroup, rearm and recruit. So, we are faced with a resourceful force holding a geographic area that is most for us difficult to attack and easy for them to defend. Additionally, most of the area under Talaban control is in Pakistan. So, let's give Pres. Obama and our military all the time necessary to deal with a most complex political and military problem.", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-26 09:21:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "fnewt"
    }, 
    {
        "content": "quote: Originally posted by fnewt: I hate to bring up \"ancient history\", but if George W. Bush hadn't diverted us into Iraq we would not have the Talaban problem. Prior to the Iraq diversion, we had the Talaban defeated and would have gotten bin Laden and his al Qaeda as well. Now the Talaban have had time to regroup, rearm and recruit. So, we are faced with a resourceful force holding a geographic area that is most for us difficult to attack and easy for them to defend. Additionally, most of the area under Talaban control is in Pakistan. So, let's give Pres. Obama and our military all the time necessary to deal with a most complex political and military problem. Yes, everyone keeps telling us that history doesn't matter... Dave", 
        "intTime": 20090426, 
        "postID": 17, 
        "quote": "Originally posted by fnewt: I hate to bring up \"ancient history\", but if George W. Bush hadn't diverted us into Iraq we would not have the Talaban problem. Prior to the Iraq diversion, we had the Talaban defeated and would have gotten bin Laden and his al Qaeda as well. Now the Talaban have had time to regroup, rearm and recruit. So, we are faced with a resourceful force holding a geographic area that is most for us difficult to attack and easy for them to defend. Additionally, most of the area under Talaban control is in Pakistan. So, let's give Pres. Obama and our military all the time necessary to deal with a most complex political and military problem.", 
        "reply": " Yes, everyone keeps telling us that history doesn't matter... Dave", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-26 09:29:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by fnewt: I hate to bring up \"ancient history\", but if George W. Bush hadn't diverted us into Iraq we would not have the Talaban problem. Prior to the Iraq diversion, we had the Talaban defeated and would have gotten bin Laden and his al Qaeda as well. Now the Talaban have had time to regroup, rearm and recruit. So, we are faced with a resourceful force holding a geographic area that is most for us difficult to attack and easy for them to defend. Additionally, most of the area under Talaban control is in Pakistan. So, let's give Pres. Obama and our military all the time necessary to deal with a most complex political and military problem. First you don't that about Bush's decision... Second, they would have regrouped, rearmed and recruited from where they are in Pakistan... Bush can be blamed for many things but to blame the current condition of the Taliban is more a problem that can be laid at the feet of the Pakistanis, our ally[sp?]... Respectfully, SUNLINER81", 
        "intTime": 20090426, 
        "postID": 18, 
        "quote": "Originally posted by fnewt: I hate to bring up \"ancient history\", but if George W. Bush hadn't diverted us into Iraq we would not have the Talaban problem. Prior to the Iraq diversion, we had the Talaban defeated and would have gotten bin Laden and his al Qaeda as well. Now the Talaban have had time to regroup, rearm and recruit. So, we are faced with a resourceful force holding a geographic area that is most for us difficult to attack and easy for them to defend. Additionally, most of the area under Talaban control is in Pakistan. So, let's give Pres. Obama and our military all the time necessary to deal with a most complex political and military problem.", 
        "reply": " First you don't that about Bush's decision... Second, they would have regrouped, rearmed and recruited from where they are in Pakistan... Bush can be blamed for many things but to blame the current condition of the Taliban is more a problem that can be laid at the feet of the Pakistanis, our ally[sp?]... Respectfully, SUNLINER81", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-26 09:29:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by fnewt: I hate to bring up \"ancient history\", but if George W. Bush hadn't diverted us into Iraq we would not have the Talaban problem. Prior to the Iraq diversion, we had the Talaban defeated and would have gotten bin Laden and his al Qaeda as well. Now the Talaban have had time to regroup, rearm and recruit. So, we are faced with a resourceful force holding a geographic area that is most for us difficult to attack and easy for them to defend. Additionally, most of the area under Talaban control is in Pakistan. So, let's give Pres. Obama and our military all the time necessary to deal with a most complex political and military problem. Yes, everyone keeps telling us that history doesn't matter... Dave Whom would that be?... Respectfully, SUNLINER81", 
        "intTime": 20090426, 
        "postID": 19, 
        "quote": "Originally posted by Grachus: quote: Originally posted by fnewt: I hate to bring up \"ancient history\", but if George W. Bush hadn't diverted us into Iraq we would not have the Talaban problem. Prior to the Iraq diversion, we had the Talaban defeated and would have gotten bin Laden and his al Qaeda as well. Now the Talaban have had time to regroup, rearm and recruit. So, we are faced with a resourceful force holding a geographic area that is most for us difficult to attack and easy for them to defend. Additionally, most of the area under Talaban control is in Pakistan. So, let's give Pres. Obama and our military all the time necessary to deal with a most complex political and military problem. Yes, everyone keeps telling us that history doesn't matter... Dave", 
        "reply": " Whom would that be?... Respectfully, SUNLINER81", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-26 09:30:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "The trembling government of Zardari signed on for Sharia law in Swat Valley. Pandering to the Taliban much like Bhutto did in her first reign of power broker, she payed the consequences. Under Musharaff Swat underwent a transformation and two years of fighting, hundreds killed, thousands displaced. Under the new civilian leadership, Once the compromised was signed western convoys were attacked and the expansion of territory began. The morning papers state the Tali were notified of governments action heading their way is why they pull back. Saying scores of insurgence were killed in the process, but not to worry, they still retain the original agreement, Sharia law for Babar province and Swat. In other words the monster is back in the cage, temporarily. Which wildarse group will kill you is a question in Pakistan. Something like 17 terrorist groups are located there. A friend, a Shiite lives in Lahor, is under the threat everyday of his life for his sect. What a way to live. I don't think so.", 
        "intTime": 20090426, 
        "postID": 20, 
        "quote": "", 
        "reply": "The trembling government of Zardari signed on for Sharia law in Swat Valley. Pandering to the Taliban much like Bhutto did in her first reign of power broker, she payed the consequences. Under Musharaff Swat underwent a transformation and two years of fighting, hundreds killed, thousands displaced. Under the new civilian leadership, Once the compromised was signed western convoys were attacked and the expansion of territory began. The morning papers state the Tali were notified of governments action heading their way is why they pull back. Saying scores of insurgence were killed in the process, but not to worry, they still retain the original agreement, Sharia law for Babar province and Swat. In other words the monster is back in the cage, temporarily. Which wildarse group will kill you is a question in Pakistan. Something like 17 terrorist groups are located there. A friend, a Shiite lives in Lahor, is under the threat everyday of his life for his sect. What a way to live. I don't think so.", 
        "threadID": "672198221_6430077122001", 
        "time": "2009-04-26 09:33:00", 
        "title": "‘Stop the Taliban now – or we will’", 
        "userID": "rayevinsonsr"
    }
]