[
    {
        "content": "\"http://news.bbc.co.uk/2/hi/americas/8068467.stm\" quote: US President Barack Obama intends to nominate Sonia Sotomayor to serve on the Supreme Court, officials say. Ms Sotomayor, 54, an appeal court judge from New York, would be the first Hispanic to take the position. She would replace Justice David Souter, who announced his retirement from the top US court earlier this month. Let the fun begin", 
        "intTime": 20090526, 
        "postID": 1, 
        "quote": "US President Barack Obama intends to nominate Sonia Sotomayor to serve on the Supreme Court, officials say. Ms Sotomayor, 54, an appeal court judge from New York, would be the first Hispanic to take the position. She would replace Justice David Souter, who announced his retirement from the top US court earlier this month.", 
        "reply": "\"http://news.bbc.co.uk/2/hi/americas/8068467.stm\"  Let the fun begin", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 06:51:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "With her qualifications that I read in her bio, I see nothing wrong with his selection.", 
        "intTime": 20090526, 
        "postID": 2, 
        "quote": "", 
        "reply": "With her qualifications that I read in her bio, I see nothing wrong with his selection.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 07:24:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "She is highly qualified, the issue is whether she is going to rule based on facts rather than emotional appeals... Just because she is qualified doesn't me she isn't an activist judge...", 
        "intTime": 20090526, 
        "postID": 3, 
        "quote": "", 
        "reply": "She is highly qualified, the issue is whether she is going to rule based on facts rather than emotional appeals... Just because she is qualified doesn't me she isn't an activist judge...", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:28:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection. Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 4, 
        "quote": "Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection.", 
        "reply": " Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:32:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "L0A1"
    }, 
    {
        "content": "From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic.", 
        "intTime": 20090526, 
        "postID": 5, 
        "quote": "", 
        "reply": "From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:38:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 6, 
        "quote": "", 
        "reply": "I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:40:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection. Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her. I liked her comment about the Constitution when she was being question during her nomination for fed court judge, at that time, by a republican administration. If she was good enough then for the republicans then it should be OK now. It's just a step higher in the federal justice chain, the highest step. But if she starts craping on the Constitution and not follow it's laws, I'll think different but of course, it will be too late then.", 
        "intTime": 20090526, 
        "postID": 7, 
        "quote": "Originally posted by L0A1: quote: Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection. Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her.", 
        "reply": " I liked her comment about the Constitution when she was being question during her nomination for fed court judge, at that time, by a republican administration. If she was good enough then for the republicans then it should be OK now. It's just a step higher in the federal justice chain, the highest step. But if she starts craping on the Constitution and not follow it's laws, I'll think different but of course, it will be too late then.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:49:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet......", 
        "intTime": 20090526, 
        "postID": 8, 
        "quote": "", 
        "reply": "at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet......", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 11:13:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "corporalJT"
    }, 
    {
        "content": "I don't know enough about her to make an informed opinion.", 
        "intTime": 20090526, 
        "postID": 9, 
        "quote": "", 
        "reply": "I don't know enough about her to make an informed opinion.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:19:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic. And to think she did this while under Nixon, Carter, Clinton, Bush 1 & 2. Guess America does afford opportunity. I do hope that the opologizing will stop now about America's opportunities.", 
        "intTime": 20090526, 
        "postID": 10, 
        "quote": "Originally posted by Ol_Doc: From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic.", 
        "reply": " And to think she did this while under Nixon, Carter, Clinton, Bush 1 & 2. Guess America does afford opportunity. I do hope that the opologizing will stop now about America's opportunities.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:28:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out.", 
        "intTime": 20090526, 
        "postID": 11, 
        "quote": "", 
        "reply": "One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:29:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing.", 
        "intTime": 20090526, 
        "postID": 12, 
        "quote": "Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol", 
        "reply": " So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:30:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by corporalJT: at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet...... CHECK HER TAX RETURNS!!!!!!!", 
        "intTime": 20090526, 
        "postID": 13, 
        "quote": "Originally posted by corporalJT: at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet......", 
        "reply": " CHECK HER TAX RETURNS!!!!!!!", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:31:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing. Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\" \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 14, 
        "quote": "Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing.", 
        "reply": " Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\" \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:37:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out.", 
        "intTime": 20090526, 
        "postID": 15, 
        "quote": "", 
        "reply": "Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:11:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out. 80% overturn record. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 16, 
        "quote": "Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out.", 
        "reply": " 80% overturn record. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:13:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out. Let's see now...fear islamofascists, fear liberals, fear terrorists, fear socialists, fear communists, and now fear latinos, blacks and supreme court nominees!! Is there anything the right doesn't fear?", 
        "intTime": 20090526, 
        "postID": 17, 
        "quote": "Originally posted by Agent991: Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out.", 
        "reply": " Let's see now...fear islamofascists, fear liberals, fear terrorists, fear socialists, fear communists, and now fear latinos, blacks and supreme court nominees!! Is there anything the right doesn't fear?", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:15:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing. Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\" You can not be serious.....", 
        "intTime": 20090526, 
        "postID": 18, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing. Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\"", 
        "reply": " You can not be serious.....", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:15:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out. 80% overturn record. That would fall in the \"high\" catagory. Wow!", 
        "intTime": 20090526, 
        "postID": 19, 
        "quote": "Originally posted by L0A1: quote: Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out. 80% overturn record.", 
        "reply": " That would fall in the \"high\" catagory. Wow!", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:16:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "And the Dems are the Party of \"NO\" too. NO to drilling, to nuclear power, to shale oil extraction. NO to soft drinks, beer, cigarettes, to snack foods. NO to 'obesity'. NO to SUVs. NO TO FREE CHOICE and now NO TO CAPITALISM. With Sotomayor, now NO to the Constituition and YES to \"empathy\". And \"NO\" to a typical white male and especially NO to the Middle Class White Male. It will be Latinos and 'empathy' for the under-priviledged at your Tax Dollar and family-values. IMO!", 
        "intTime": 20090526, 
        "postID": 20, 
        "quote": "", 
        "reply": "And the Dems are the Party of \"NO\" too. NO to drilling, to nuclear power, to shale oil extraction. NO to soft drinks, beer, cigarettes, to snack foods. NO to 'obesity'. NO to SUVs. NO TO FREE CHOICE and now NO TO CAPITALISM. With Sotomayor, now NO to the Constituition and YES to \"empathy\". And \"NO\" to a typical white male and especially NO to the Middle Class White Male. It will be Latinos and 'empathy' for the under-priviledged at your Tax Dollar and family-values. IMO!", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:18:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Agent991"
    }, 
    {
        "content": "\"http://news.bbc.co.uk/2/hi/americas/8068467.stm\" quote: US President Barack Obama intends to nominate Sonia Sotomayor to serve on the Supreme Court, officials say. Ms Sotomayor, 54, an appeal court judge from New York, would be the first Hispanic to take the position. She would replace Justice David Souter, who announced his retirement from the top US court earlier this month. Let the fun begin", 
        "intTime": 20090526, 
        "postID": 21, 
        "quote": "US President Barack Obama intends to nominate Sonia Sotomayor to serve on the Supreme Court, officials say. Ms Sotomayor, 54, an appeal court judge from New York, would be the first Hispanic to take the position. She would replace Justice David Souter, who announced his retirement from the top US court earlier this month.", 
        "reply": "\"http://news.bbc.co.uk/2/hi/americas/8068467.stm\"  Let the fun begin", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 06:51:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "With her qualifications that I read in her bio, I see nothing wrong with his selection.", 
        "intTime": 20090526, 
        "postID": 22, 
        "quote": "", 
        "reply": "With her qualifications that I read in her bio, I see nothing wrong with his selection.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 07:24:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "She is highly qualified, the issue is whether she is going to rule based on facts rather than emotional appeals... Just because she is qualified doesn't me she isn't an activist judge...", 
        "intTime": 20090526, 
        "postID": 23, 
        "quote": "", 
        "reply": "She is highly qualified, the issue is whether she is going to rule based on facts rather than emotional appeals... Just because she is qualified doesn't me she isn't an activist judge...", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:28:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection. Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 24, 
        "quote": "Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection.", 
        "reply": " Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:32:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "L0A1"
    }, 
    {
        "content": "From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic.", 
        "intTime": 20090526, 
        "postID": 25, 
        "quote": "", 
        "reply": "From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:38:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 26, 
        "quote": "", 
        "reply": "I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:40:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection. Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her. I liked her comment about the Constitution when she was being question during her nomination for fed court judge, at that time, by a republican administration. If she was good enough then for the republicans then it should be OK now. It's just a step higher in the federal justice chain, the highest step. But if she starts craping on the Constitution and not follow it's laws, I'll think different but of course, it will be too late then.", 
        "intTime": 20090526, 
        "postID": 27, 
        "quote": "Originally posted by L0A1: quote: Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection. Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her.", 
        "reply": " I liked her comment about the Constitution when she was being question during her nomination for fed court judge, at that time, by a republican administration. If she was good enough then for the republicans then it should be OK now. It's just a step higher in the federal justice chain, the highest step. But if she starts craping on the Constitution and not follow it's laws, I'll think different but of course, it will be too late then.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:49:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet......", 
        "intTime": 20090526, 
        "postID": 28, 
        "quote": "", 
        "reply": "at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet......", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 11:13:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "corporalJT"
    }, 
    {
        "content": "I don't know enough about her to make an informed opinion.", 
        "intTime": 20090526, 
        "postID": 29, 
        "quote": "", 
        "reply": "I don't know enough about her to make an informed opinion.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:19:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic. And to think she did this while under Nixon, Carter, Clinton, Bush 1 & 2. Guess America does afford opportunity. I do hope that the opologizing will stop now about America's opportunities.", 
        "intTime": 20090526, 
        "postID": 30, 
        "quote": "Originally posted by Ol_Doc: From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic.", 
        "reply": " And to think she did this while under Nixon, Carter, Clinton, Bush 1 & 2. Guess America does afford opportunity. I do hope that the opologizing will stop now about America's opportunities.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:28:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out.", 
        "intTime": 20090526, 
        "postID": 31, 
        "quote": "", 
        "reply": "One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:29:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing.", 
        "intTime": 20090526, 
        "postID": 32, 
        "quote": "Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol", 
        "reply": " So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:30:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by corporalJT: at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet...... CHECK HER TAX RETURNS!!!!!!!", 
        "intTime": 20090526, 
        "postID": 33, 
        "quote": "Originally posted by corporalJT: at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet......", 
        "reply": " CHECK HER TAX RETURNS!!!!!!!", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:31:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing. Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\" \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 34, 
        "quote": "Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing.", 
        "reply": " Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\" \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:37:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out.", 
        "intTime": 20090526, 
        "postID": 35, 
        "quote": "", 
        "reply": "Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:11:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out. 80% overturn record. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 36, 
        "quote": "Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out.", 
        "reply": " 80% overturn record. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:13:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out. Let's see now...fear islamofascists, fear liberals, fear terrorists, fear socialists, fear communists, and now fear latinos, blacks and supreme court nominees!! Is there anything the right doesn't fear?", 
        "intTime": 20090526, 
        "postID": 37, 
        "quote": "Originally posted by Agent991: Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out.", 
        "reply": " Let's see now...fear islamofascists, fear liberals, fear terrorists, fear socialists, fear communists, and now fear latinos, blacks and supreme court nominees!! Is there anything the right doesn't fear?", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:15:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing. Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\" You can not be serious.....", 
        "intTime": 20090526, 
        "postID": 38, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing. Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\"", 
        "reply": " You can not be serious.....", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:15:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out. 80% overturn record. That would fall in the \"high\" catagory. Wow!", 
        "intTime": 20090526, 
        "postID": 39, 
        "quote": "Originally posted by L0A1: quote: Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out. 80% overturn record.", 
        "reply": " That would fall in the \"high\" catagory. Wow!", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:16:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "And the Dems are the Party of \"NO\" too. NO to drilling, to nuclear power, to shale oil extraction. NO to soft drinks, beer, cigarettes, to snack foods. NO to 'obesity'. NO to SUVs. NO TO FREE CHOICE and now NO TO CAPITALISM. With Sotomayor, now NO to the Constituition and YES to \"empathy\". And \"NO\" to a typical white male and especially NO to the Middle Class White Male. It will be Latinos and 'empathy' for the under-priviledged at your Tax Dollar and family-values. IMO!", 
        "intTime": 20090526, 
        "postID": 40, 
        "quote": "", 
        "reply": "And the Dems are the Party of \"NO\" too. NO to drilling, to nuclear power, to shale oil extraction. NO to soft drinks, beer, cigarettes, to snack foods. NO to 'obesity'. NO to SUVs. NO TO FREE CHOICE and now NO TO CAPITALISM. With Sotomayor, now NO to the Constituition and YES to \"empathy\". And \"NO\" to a typical white male and especially NO to the Middle Class White Male. It will be Latinos and 'empathy' for the under-priviledged at your Tax Dollar and family-values. IMO!", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:18:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Agent991"
    }, 
    {
        "content": "\"http://news.bbc.co.uk/2/hi/americas/8068467.stm\" quote: US President Barack Obama intends to nominate Sonia Sotomayor to serve on the Supreme Court, officials say. Ms Sotomayor, 54, an appeal court judge from New York, would be the first Hispanic to take the position. She would replace Justice David Souter, who announced his retirement from the top US court earlier this month. Let the fun begin", 
        "intTime": 20090526, 
        "postID": 41, 
        "quote": "US President Barack Obama intends to nominate Sonia Sotomayor to serve on the Supreme Court, officials say. Ms Sotomayor, 54, an appeal court judge from New York, would be the first Hispanic to take the position. She would replace Justice David Souter, who announced his retirement from the top US court earlier this month.", 
        "reply": "\"http://news.bbc.co.uk/2/hi/americas/8068467.stm\"  Let the fun begin", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 06:51:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "With her qualifications that I read in her bio, I see nothing wrong with his selection.", 
        "intTime": 20090526, 
        "postID": 42, 
        "quote": "", 
        "reply": "With her qualifications that I read in her bio, I see nothing wrong with his selection.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 07:24:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "She is highly qualified, the issue is whether she is going to rule based on facts rather than emotional appeals... Just because she is qualified doesn't me she isn't an activist judge...", 
        "intTime": 20090526, 
        "postID": 43, 
        "quote": "", 
        "reply": "She is highly qualified, the issue is whether she is going to rule based on facts rather than emotional appeals... Just because she is qualified doesn't me she isn't an activist judge...", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:28:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection. Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 44, 
        "quote": "Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection.", 
        "reply": " Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:32:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "L0A1"
    }, 
    {
        "content": "From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic.", 
        "intTime": 20090526, 
        "postID": 45, 
        "quote": "", 
        "reply": "From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:38:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 46, 
        "quote": "", 
        "reply": "I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:40:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection. Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her. I liked her comment about the Constitution when she was being question during her nomination for fed court judge, at that time, by a republican administration. If she was good enough then for the republicans then it should be OK now. It's just a step higher in the federal justice chain, the highest step. But if she starts craping on the Constitution and not follow it's laws, I'll think different but of course, it will be too late then.", 
        "intTime": 20090526, 
        "postID": 47, 
        "quote": "Originally posted by L0A1: quote: Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection. Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her.", 
        "reply": " I liked her comment about the Constitution when she was being question during her nomination for fed court judge, at that time, by a republican administration. If she was good enough then for the republicans then it should be OK now. It's just a step higher in the federal justice chain, the highest step. But if she starts craping on the Constitution and not follow it's laws, I'll think different but of course, it will be too late then.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:49:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet......", 
        "intTime": 20090526, 
        "postID": 48, 
        "quote": "", 
        "reply": "at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet......", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 11:13:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "corporalJT"
    }, 
    {
        "content": "I don't know enough about her to make an informed opinion.", 
        "intTime": 20090526, 
        "postID": 49, 
        "quote": "", 
        "reply": "I don't know enough about her to make an informed opinion.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:19:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic. And to think she did this while under Nixon, Carter, Clinton, Bush 1 & 2. Guess America does afford opportunity. I do hope that the opologizing will stop now about America's opportunities.", 
        "intTime": 20090526, 
        "postID": 50, 
        "quote": "Originally posted by Ol_Doc: From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic.", 
        "reply": " And to think she did this while under Nixon, Carter, Clinton, Bush 1 & 2. Guess America does afford opportunity. I do hope that the opologizing will stop now about America's opportunities.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:28:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out.", 
        "intTime": 20090526, 
        "postID": 51, 
        "quote": "", 
        "reply": "One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:29:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing.", 
        "intTime": 20090526, 
        "postID": 52, 
        "quote": "Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol", 
        "reply": " So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:30:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by corporalJT: at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet...... CHECK HER TAX RETURNS!!!!!!!", 
        "intTime": 20090526, 
        "postID": 53, 
        "quote": "Originally posted by corporalJT: at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet......", 
        "reply": " CHECK HER TAX RETURNS!!!!!!!", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:31:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing. Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\" \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 54, 
        "quote": "Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing.", 
        "reply": " Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\" \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:37:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out.", 
        "intTime": 20090526, 
        "postID": 55, 
        "quote": "", 
        "reply": "Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:11:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out. 80% overturn record. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 56, 
        "quote": "Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out.", 
        "reply": " 80% overturn record. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:13:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out. Let's see now...fear islamofascists, fear liberals, fear terrorists, fear socialists, fear communists, and now fear latinos, blacks and supreme court nominees!! Is there anything the right doesn't fear?", 
        "intTime": 20090526, 
        "postID": 57, 
        "quote": "Originally posted by Agent991: Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out.", 
        "reply": " Let's see now...fear islamofascists, fear liberals, fear terrorists, fear socialists, fear communists, and now fear latinos, blacks and supreme court nominees!! Is there anything the right doesn't fear?", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:15:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing. Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\" You can not be serious.....", 
        "intTime": 20090526, 
        "postID": 58, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing. Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\"", 
        "reply": " You can not be serious.....", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:15:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out. 80% overturn record. That would fall in the \"high\" catagory. Wow!", 
        "intTime": 20090526, 
        "postID": 59, 
        "quote": "Originally posted by L0A1: quote: Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out. 80% overturn record.", 
        "reply": " That would fall in the \"high\" catagory. Wow!", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:16:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "And the Dems are the Party of \"NO\" too. NO to drilling, to nuclear power, to shale oil extraction. NO to soft drinks, beer, cigarettes, to snack foods. NO to 'obesity'. NO to SUVs. NO TO FREE CHOICE and now NO TO CAPITALISM. With Sotomayor, now NO to the Constituition and YES to \"empathy\". And \"NO\" to a typical white male and especially NO to the Middle Class White Male. It will be Latinos and 'empathy' for the under-priviledged at your Tax Dollar and family-values. IMO!", 
        "intTime": 20090526, 
        "postID": 60, 
        "quote": "", 
        "reply": "And the Dems are the Party of \"NO\" too. NO to drilling, to nuclear power, to shale oil extraction. NO to soft drinks, beer, cigarettes, to snack foods. NO to 'obesity'. NO to SUVs. NO TO FREE CHOICE and now NO TO CAPITALISM. With Sotomayor, now NO to the Constituition and YES to \"empathy\". And \"NO\" to a typical white male and especially NO to the Middle Class White Male. It will be Latinos and 'empathy' for the under-priviledged at your Tax Dollar and family-values. IMO!", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:18:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Agent991"
    }, 
    {
        "content": "\"http://news.bbc.co.uk/2/hi/americas/8068467.stm\" quote: US President Barack Obama intends to nominate Sonia Sotomayor to serve on the Supreme Court, officials say. Ms Sotomayor, 54, an appeal court judge from New York, would be the first Hispanic to take the position. She would replace Justice David Souter, who announced his retirement from the top US court earlier this month. Let the fun begin", 
        "intTime": 20090526, 
        "postID": 61, 
        "quote": "US President Barack Obama intends to nominate Sonia Sotomayor to serve on the Supreme Court, officials say. Ms Sotomayor, 54, an appeal court judge from New York, would be the first Hispanic to take the position. She would replace Justice David Souter, who announced his retirement from the top US court earlier this month.", 
        "reply": "\"http://news.bbc.co.uk/2/hi/americas/8068467.stm\"  Let the fun begin", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 06:51:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "With her qualifications that I read in her bio, I see nothing wrong with his selection.", 
        "intTime": 20090526, 
        "postID": 62, 
        "quote": "", 
        "reply": "With her qualifications that I read in her bio, I see nothing wrong with his selection.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 07:24:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "She is highly qualified, the issue is whether she is going to rule based on facts rather than emotional appeals... Just because she is qualified doesn't me she isn't an activist judge...", 
        "intTime": 20090526, 
        "postID": 63, 
        "quote": "", 
        "reply": "She is highly qualified, the issue is whether she is going to rule based on facts rather than emotional appeals... Just because she is qualified doesn't me she isn't an activist judge...", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:28:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection. Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 64, 
        "quote": "Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection.", 
        "reply": " Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:32:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "L0A1"
    }, 
    {
        "content": "From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic.", 
        "intTime": 20090526, 
        "postID": 65, 
        "quote": "", 
        "reply": "From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:38:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 66, 
        "quote": "", 
        "reply": "I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:40:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection. Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her. I liked her comment about the Constitution when she was being question during her nomination for fed court judge, at that time, by a republican administration. If she was good enough then for the republicans then it should be OK now. It's just a step higher in the federal justice chain, the highest step. But if she starts craping on the Constitution and not follow it's laws, I'll think different but of course, it will be too late then.", 
        "intTime": 20090526, 
        "postID": 67, 
        "quote": "Originally posted by L0A1: quote: Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection. Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her.", 
        "reply": " I liked her comment about the Constitution when she was being question during her nomination for fed court judge, at that time, by a republican administration. If she was good enough then for the republicans then it should be OK now. It's just a step higher in the federal justice chain, the highest step. But if she starts craping on the Constitution and not follow it's laws, I'll think different but of course, it will be too late then.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:49:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet......", 
        "intTime": 20090526, 
        "postID": 68, 
        "quote": "", 
        "reply": "at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet......", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 11:13:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "corporalJT"
    }, 
    {
        "content": "I don't know enough about her to make an informed opinion.", 
        "intTime": 20090526, 
        "postID": 69, 
        "quote": "", 
        "reply": "I don't know enough about her to make an informed opinion.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:19:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic. And to think she did this while under Nixon, Carter, Clinton, Bush 1 & 2. Guess America does afford opportunity. I do hope that the opologizing will stop now about America's opportunities.", 
        "intTime": 20090526, 
        "postID": 70, 
        "quote": "Originally posted by Ol_Doc: From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic.", 
        "reply": " And to think she did this while under Nixon, Carter, Clinton, Bush 1 & 2. Guess America does afford opportunity. I do hope that the opologizing will stop now about America's opportunities.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:28:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out.", 
        "intTime": 20090526, 
        "postID": 71, 
        "quote": "", 
        "reply": "One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:29:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing.", 
        "intTime": 20090526, 
        "postID": 72, 
        "quote": "Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol", 
        "reply": " So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:30:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by corporalJT: at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet...... CHECK HER TAX RETURNS!!!!!!!", 
        "intTime": 20090526, 
        "postID": 73, 
        "quote": "Originally posted by corporalJT: at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet......", 
        "reply": " CHECK HER TAX RETURNS!!!!!!!", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:31:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing. Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\" \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 74, 
        "quote": "Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing.", 
        "reply": " Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\" \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:37:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out.", 
        "intTime": 20090526, 
        "postID": 75, 
        "quote": "", 
        "reply": "Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:11:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out. 80% overturn record. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 76, 
        "quote": "Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out.", 
        "reply": " 80% overturn record. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:13:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out. Let's see now...fear islamofascists, fear liberals, fear terrorists, fear socialists, fear communists, and now fear latinos, blacks and supreme court nominees!! Is there anything the right doesn't fear?", 
        "intTime": 20090526, 
        "postID": 77, 
        "quote": "Originally posted by Agent991: Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out.", 
        "reply": " Let's see now...fear islamofascists, fear liberals, fear terrorists, fear socialists, fear communists, and now fear latinos, blacks and supreme court nominees!! Is there anything the right doesn't fear?", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:15:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing. Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\" You can not be serious.....", 
        "intTime": 20090526, 
        "postID": 78, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing. Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\"", 
        "reply": " You can not be serious.....", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:15:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out. 80% overturn record. That would fall in the \"high\" catagory. Wow!", 
        "intTime": 20090526, 
        "postID": 79, 
        "quote": "Originally posted by L0A1: quote: Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out. 80% overturn record.", 
        "reply": " That would fall in the \"high\" catagory. Wow!", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:16:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "And the Dems are the Party of \"NO\" too. NO to drilling, to nuclear power, to shale oil extraction. NO to soft drinks, beer, cigarettes, to snack foods. NO to 'obesity'. NO to SUVs. NO TO FREE CHOICE and now NO TO CAPITALISM. With Sotomayor, now NO to the Constituition and YES to \"empathy\". And \"NO\" to a typical white male and especially NO to the Middle Class White Male. It will be Latinos and 'empathy' for the under-priviledged at your Tax Dollar and family-values. IMO!", 
        "intTime": 20090526, 
        "postID": 80, 
        "quote": "", 
        "reply": "And the Dems are the Party of \"NO\" too. NO to drilling, to nuclear power, to shale oil extraction. NO to soft drinks, beer, cigarettes, to snack foods. NO to 'obesity'. NO to SUVs. NO TO FREE CHOICE and now NO TO CAPITALISM. With Sotomayor, now NO to the Constituition and YES to \"empathy\". And \"NO\" to a typical white male and especially NO to the Middle Class White Male. It will be Latinos and 'empathy' for the under-priviledged at your Tax Dollar and family-values. IMO!", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:18:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Agent991"
    }, 
    {
        "content": "\"http://news.bbc.co.uk/2/hi/americas/8068467.stm\" quote: US President Barack Obama intends to nominate Sonia Sotomayor to serve on the Supreme Court, officials say. Ms Sotomayor, 54, an appeal court judge from New York, would be the first Hispanic to take the position. She would replace Justice David Souter, who announced his retirement from the top US court earlier this month. Let the fun begin", 
        "intTime": 20090526, 
        "postID": 81, 
        "quote": "US President Barack Obama intends to nominate Sonia Sotomayor to serve on the Supreme Court, officials say. Ms Sotomayor, 54, an appeal court judge from New York, would be the first Hispanic to take the position. She would replace Justice David Souter, who announced his retirement from the top US court earlier this month.", 
        "reply": "\"http://news.bbc.co.uk/2/hi/americas/8068467.stm\"  Let the fun begin", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 06:51:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "With her qualifications that I read in her bio, I see nothing wrong with his selection.", 
        "intTime": 20090526, 
        "postID": 82, 
        "quote": "", 
        "reply": "With her qualifications that I read in her bio, I see nothing wrong with his selection.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 07:24:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "She is highly qualified, the issue is whether she is going to rule based on facts rather than emotional appeals... Just because she is qualified doesn't me she isn't an activist judge...", 
        "intTime": 20090526, 
        "postID": 83, 
        "quote": "", 
        "reply": "She is highly qualified, the issue is whether she is going to rule based on facts rather than emotional appeals... Just because she is qualified doesn't me she isn't an activist judge...", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:28:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection. Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 84, 
        "quote": "Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection.", 
        "reply": " Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:32:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "L0A1"
    }, 
    {
        "content": "From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic.", 
        "intTime": 20090526, 
        "postID": 85, 
        "quote": "", 
        "reply": "From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:38:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 86, 
        "quote": "", 
        "reply": "I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:40:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection. Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her. I liked her comment about the Constitution when she was being question during her nomination for fed court judge, at that time, by a republican administration. If she was good enough then for the republicans then it should be OK now. It's just a step higher in the federal justice chain, the highest step. But if she starts craping on the Constitution and not follow it's laws, I'll think different but of course, it will be too late then.", 
        "intTime": 20090526, 
        "postID": 87, 
        "quote": "Originally posted by L0A1: quote: Originally posted by SignalSgtWilliams: With her qualifications that I read in her bio, I see nothing wrong with his selection. Her ruling on the 4 FireZFighters in Connecticutt was wrong. IMHO. She ruled that the test were unfair because not enough minorities passed it, this threw out the test that others qualified for and didn't get their promotions because of it. Other then that, I haven't seen anything elese wrong with her.", 
        "reply": " I liked her comment about the Constitution when she was being question during her nomination for fed court judge, at that time, by a republican administration. If she was good enough then for the republicans then it should be OK now. It's just a step higher in the federal justice chain, the highest step. But if she starts craping on the Constitution and not follow it's laws, I'll think different but of course, it will be too late then.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 08:49:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet......", 
        "intTime": 20090526, 
        "postID": 88, 
        "quote": "", 
        "reply": "at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet......", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 11:13:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "corporalJT"
    }, 
    {
        "content": "I don't know enough about her to make an informed opinion.", 
        "intTime": 20090526, 
        "postID": 89, 
        "quote": "", 
        "reply": "I don't know enough about her to make an informed opinion.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:19:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic. And to think she did this while under Nixon, Carter, Clinton, Bush 1 & 2. Guess America does afford opportunity. I do hope that the opologizing will stop now about America's opportunities.", 
        "intTime": 20090526, 
        "postID": 90, 
        "quote": "Originally posted by Ol_Doc: From what I have read and heard, she sounds like a good choice. More time behind the bench than any of the currently serving justices. Time as both a prosecutor and corporate law. A person who has risen to a high level of public service from humble beginnings. Sounds like the American dream to me. I hope it doesn’t get too political but I’m not optimistic.", 
        "reply": " And to think she did this while under Nixon, Carter, Clinton, Bush 1 & 2. Guess America does afford opportunity. I do hope that the opologizing will stop now about America's opportunities.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:28:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out.", 
        "intTime": 20090526, 
        "postID": 91, 
        "quote": "", 
        "reply": "One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:29:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing.", 
        "intTime": 20090526, 
        "postID": 92, 
        "quote": "Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol", 
        "reply": " So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:30:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by corporalJT: at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet...... CHECK HER TAX RETURNS!!!!!!!", 
        "intTime": 20090526, 
        "postID": 93, 
        "quote": "Originally posted by corporalJT: at least we dont have to witness Fienstien throwing \"GOOFBALL\" QUESTIONS at her like she normally does in these things.....for sure if there is anything like a \"skeleton\" in her closet,,,,it better come out now rather than during the confirmation proceeding,,,,,,,maybe, on the other hand, it might be better so we can see how she handles a HOT POTATOE,,,and how fast she thinks on her feet......", 
        "reply": " CHECK HER TAX RETURNS!!!!!!!", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:31:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing. Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\" \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090526, 
        "postID": 94, 
        "quote": "Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing.", 
        "reply": " Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\" \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 12:37:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out.", 
        "intTime": 20090526, 
        "postID": 95, 
        "quote": "", 
        "reply": "Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out.", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:11:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out. 80% overturn record. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 96, 
        "quote": "Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out.", 
        "reply": " 80% overturn record. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:13:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out. Let's see now...fear islamofascists, fear liberals, fear terrorists, fear socialists, fear communists, and now fear latinos, blacks and supreme court nominees!! Is there anything the right doesn't fear?", 
        "intTime": 20090526, 
        "postID": 97, 
        "quote": "Originally posted by Agent991: Unless you are a miniority such as Latino or Black, better watch for \"reverse discrimination\" and more power for Miniorities as evidenced by 'Ricci vs. DeStafano' in which Sotomayor slapped that case down in One Paragraph. (the reverse discrimination case) now before the Supreme Court. And by his pick of a Female Latino, HO has just ensured and garnered the Latino Vote. If you are a \"typical white male\"...watch out.", 
        "reply": " Let's see now...fear islamofascists, fear liberals, fear terrorists, fear socialists, fear communists, and now fear latinos, blacks and supreme court nominees!! Is there anything the right doesn't fear?", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:15:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing. Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\" You can not be serious.....", 
        "intTime": 20090526, 
        "postID": 98, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by sw614: quote: Originally posted by jack_flats: I think she will do just fine. Now we'll find out what the \"Party of NO\" has in store for her. lol So if the Republicans oppose her in any way that just maes them more \"Party of No\"? Like the democrats have never obstructed a thing. Not anything like Republican's have. Democrats are allowed to think for themselves, unlike their counterparts. Why you think it's the Party of \"NO.\"", 
        "reply": " You can not be serious.....", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:15:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out. 80% overturn record. That would fall in the \"high\" catagory. Wow!", 
        "intTime": 20090526, 
        "postID": 99, 
        "quote": "Originally posted by L0A1: quote: Originally posted by sw614: One thing that worries me about her is that she quoted to believe it is up to the court to set policy, not interpert it and has shown to rule on emotions, not facts and law. And she has a high rate of decisions overturned from what I hear. But this is just info I heard on the news driving in this morning. We'll see how things flesch out. 80% overturn record.", 
        "reply": " That would fall in the \"high\" catagory. Wow!", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:16:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "sw614"
    }, 
    {
        "content": "And the Dems are the Party of \"NO\" too. NO to drilling, to nuclear power, to shale oil extraction. NO to soft drinks, beer, cigarettes, to snack foods. NO to 'obesity'. NO to SUVs. NO TO FREE CHOICE and now NO TO CAPITALISM. With Sotomayor, now NO to the Constituition and YES to \"empathy\". And \"NO\" to a typical white male and especially NO to the Middle Class White Male. It will be Latinos and 'empathy' for the under-priviledged at your Tax Dollar and family-values. IMO!", 
        "intTime": 20090526, 
        "postID": 100, 
        "quote": "", 
        "reply": "And the Dems are the Party of \"NO\" too. NO to drilling, to nuclear power, to shale oil extraction. NO to soft drinks, beer, cigarettes, to snack foods. NO to 'obesity'. NO to SUVs. NO TO FREE CHOICE and now NO TO CAPITALISM. With Sotomayor, now NO to the Constituition and YES to \"empathy\". And \"NO\" to a typical white male and especially NO to the Middle Class White Male. It will be Latinos and 'empathy' for the under-priviledged at your Tax Dollar and family-values. IMO!", 
        "threadID": "672198221_6720003422001", 
        "time": "2009-05-26 13:18:00", 
        "title": "President Obama makes Supreme Court pick - Sonia Sotomayor", 
        "userID": "Agent991"
    }
]