[
    {
        "content": "quote: TITLE: Dodd: Administration pushed for language protecting bonuses (CNN) -- Senate Banking committee Chairman Christopher Dodd told CNN Wednesday that he was responsible for language added to the federal stimulus bill to make sure that already-existing contracts for bonuses at companies receiving federal bailout money were honored. Dodd acknowledged his role in the change after a Treasury Department official told CNN the administration pushed for the language. Both Dodd and the official, who asked not to be named, said it was because administration officials were afraid the government would face numerous lawsuits without the new language. Dodd, a Democrat, told CNN's Dana Bash and Wolf Blitzer that Obama administration officials pushed for the language to an amendment designed to limit bonuses and \"golden parachutes\" at those companies. \"The administration had expressed reservations,\" Dodd said. \"They asked for modifications. The alternative was losing the amendment entirely.\" On Tuesday, Dodd denied to CNN that he had anything to do with adding the language, which has been used by officials at bailed-out insurance giant AIG to justify paying millions of dollars in bonuses to executives after receiving federal money. He said Wednesday that the \"grandfather clause\" language \"seemed like innocent modifications\" at the time. <more> \"http://www.cnn.com/2009/POLITICS/03/18/aig.bonuses.congress/index.html\" It seems that Fox, Drudge, and Limbaugh, among others, were right on the money afterall. I can think of a few liberal web sites that have been castigating them for erroneous reporting based on Dodd's denial yesterday that must be feeling pretty embarassed about now. Dodd should resign. It would also appear that the Obama administration was far more involved in getting the exception added than anything we've heard would lead one to believe. I see now where the buck stops on this one ... and it isn't under former President Bush's picture. This message has been edited. Last edited by: I_M_Qwerty, Wed 18 March 2009 07:09 PM", 
        "intTime": 20090318, 
        "postID": 1, 
        "quote": "TITLE: Dodd: Administration pushed for language protecting bonuses (CNN) -- Senate Banking committee Chairman Christopher Dodd told CNN Wednesday that he was responsible for language added to the federal stimulus bill to make sure that already-existing contracts for bonuses at companies receiving federal bailout money were honored. Dodd acknowledged his role in the change after a Treasury Department official told CNN the administration pushed for the language. Both Dodd and the official, who asked not to be named, said it was because administration officials were afraid the government would face numerous lawsuits without the new language. Dodd, a Democrat, told CNN's Dana Bash and Wolf Blitzer that Obama administration officials pushed for the language to an amendment designed to limit bonuses and \"golden parachutes\" at those companies. \"The administration had expressed reservations,\" Dodd said. \"They asked for modifications. The alternative was losing the amendment entirely.\" On Tuesday, Dodd denied to CNN that he had anything to do with adding the language, which has been used by officials at bailed-out insurance giant AIG to justify paying millions of dollars in bonuses to executives after receiving federal money. He said Wednesday that the \"grandfather clause\" language \"seemed like innocent modifications\" at the time. <more> \"http://www.cnn.com/2009/POLITICS/03/18/aig.bonuses.congress/index.html\"", 
        "reply": " It seems that Fox, Drudge, and Limbaugh, among others, were right on the money afterall. I can think of a few liberal web sites that have been castigating them for erroneous reporting based on Dodd's denial yesterday that must be feeling pretty embarassed about now. Dodd should resign. It would also appear that the Obama administration was far more involved in getting the exception added than anything we've heard would lead one to believe. I see now where the buck stops on this one ... and it isn't under former President Bush's picture. This message has been edited. Last edited by: I_M_Qwerty, Wed 18 March 2009 07:09 PM", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 18:43:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "No surprises here, just another politician who cannot tell the truth about anything.", 
        "intTime": 20090318, 
        "postID": 2, 
        "quote": "", 
        "reply": "No surprises here, just another politician who cannot tell the truth about anything.", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 18:50:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: TITLE: Dodd: Administration pushed for language protecting bonuses (CNN) -- Senate Banking committee Chairman Christopher Dodd told CNN Wednesday that he was responsible for language added to the federal stimulus bill to make sure that already-existing contracts for bonuses at companies receiving federal bailout money were honored. Dodd acknowledged his role in the change after a Treasury Department official told CNN the administration pushed for the language. Both Dodd and the official, who asked not to be named, said it was because administration officials were afraid the government would face numerous lawsuits without the new language. Dodd, a Democrat, told CNN's Dana Bash and Wolf Blitzer that Obama administration officials pushed for the language to an amendment designed to limit bonuses and \"golden parachutes\" at those companies. \"The administration had expressed reservations,\" Dodd said. \"They asked for modifications. The alternative was losing the amendment entirely.\" On Tuesday, Dodd denied to CNN that he had anything to do with adding the language, which has been used by officials at bailed-out insurance giant AIG to justify paying millions of dollars in bonuses to executives after receiving federal money. He said Wednesday that the \"grandfather clause\" language \"seemed like innocent modifications\" at the time. <more> \"http://www.cnn.com/2009/POLITICS/03/18/aig.bonuses.congress/index.html\" It seems that Fox, Drudge, and Limbaugh, among others, were right on the money afterall. I can think of a few liberal web sites that have been castigating them for erroneous reporting based on Dodd's denial yesterday that must be feeling pretty embarassed about now. Dodd should resign. It would also appear that the Obama administration was far more involved in getting the exception added than anything we've heard would lead one to believe. I see now where the buck stops on this one ... and it isn't under former President Bush's picture. Saw a couple. I'm afraid I'm terrible remembering names, a young not so conservation lady by the Kiersten and the gentlemen ,a Washington Post columnist, both dress down the honorable Senator to his undershorts for lying. In fact the network had interrupted the exchange for the latest admittance from Dodd. Surprised at Mr. Krauthammer, a very conservation type, taking the position the Secretary of Treasury Tim Geithner had so much on his plate it was hard for him to focus on the bonuses were built in the bill that he helped write. His boss has advertised him being the only savior of our system does cloud a mind, and how all the hired help has been evading the treasury department as of late, making it even a larger task. All through the latest episode from the President to his advisors all have stated that the \"retention\" were to keep these people in place or the AIG would really be in trouble. You think? If I was King for the day, they would be the last folks I keep, along with the other 25 bonuses were paid to the people that have already left. Good riddance. Stock up on the Preparation H. More Bonuses are yet to come for those fine folks at Freddie and Fannie, another inept federal failure. Make no mistakes, the politicians are guilty of writing bad laws, taking restrictions off of good laws and getting into bed with crooks.", 
        "intTime": 20090318, 
        "postID": 3, 
        "quote": "Originally posted by I_M_Qwerty: quote: TITLE: Dodd: Administration pushed for language protecting bonuses (CNN) -- Senate Banking committee Chairman Christopher Dodd told CNN Wednesday that he was responsible for language added to the federal stimulus bill to make sure that already-existing contracts for bonuses at companies receiving federal bailout money were honored. Dodd acknowledged his role in the change after a Treasury Department official told CNN the administration pushed for the language. Both Dodd and the official, who asked not to be named, said it was because administration officials were afraid the government would face numerous lawsuits without the new language. Dodd, a Democrat, told CNN's Dana Bash and Wolf Blitzer that Obama administration officials pushed for the language to an amendment designed to limit bonuses and \"golden parachutes\" at those companies. \"The administration had expressed reservations,\" Dodd said. \"They asked for modifications. The alternative was losing the amendment entirely.\" On Tuesday, Dodd denied to CNN that he had anything to do with adding the language, which has been used by officials at bailed-out insurance giant AIG to justify paying millions of dollars in bonuses to executives after receiving federal money. He said Wednesday that the \"grandfather clause\" language \"seemed like innocent modifications\" at the time. <more> \"http://www.cnn.com/2009/POLITICS/03/18/aig.bonuses.congress/index.html\" It seems that Fox, Drudge, and Limbaugh, among others, were right on the money afterall. I can think of a few liberal web sites that have been castigating them for erroneous reporting based on Dodd's denial yesterday that must be feeling pretty embarassed about now. Dodd should resign. It would also appear that the Obama administration was far more involved in getting the exception added than anything we've heard would lead one to believe. I see now where the buck stops on this one ... and it isn't under former President Bush's picture.", 
        "reply": " Saw a couple. I'm afraid I'm terrible remembering names, a young not so conservation lady by the Kiersten and the gentlemen ,a Washington Post columnist, both dress down the honorable Senator to his undershorts for lying. In fact the network had interrupted the exchange for the latest admittance from Dodd. Surprised at Mr. Krauthammer, a very conservation type, taking the position the Secretary of Treasury Tim Geithner had so much on his plate it was hard for him to focus on the bonuses were built in the bill that he helped write. His boss has advertised him being the only savior of our system does cloud a mind, and how all the hired help has been evading the treasury department as of late, making it even a larger task. All through the latest episode from the President to his advisors all have stated that the \"retention\" were to keep these people in place or the AIG would really be in trouble. You think? If I was King for the day, they would be the last folks I keep, along with the other 25 bonuses were paid to the people that have already left. Good riddance. Stock up on the Preparation H. More Bonuses are yet to come for those fine folks at Freddie and Fannie, another inept federal failure. Make no mistakes, the politicians are guilty of writing bad laws, taking restrictions off of good laws and getting into bed with crooks.", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 19:11:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "What a mess! A lot of people have egg on their faces after this. AIG is going to be a dirty word for years to come.", 
        "intTime": 20090318, 
        "postID": 4, 
        "quote": "", 
        "reply": "What a mess! A lot of people have egg on their faces after this. AIG is going to be a dirty word for years to come.", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 19:11:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "Motive25"
    }, 
    {
        "content": "I am sure Obama must have a hand in it, as well. You must remember that the top 3 recipients of campaign contribution from AIG are as follows; 1. Dodd, 2. Obama and, 3. McCain. So, you cannot tell me that Obama didn't have a little feeling of pity for those AIG execs that would lose their bonuses. Come on, now.", 
        "intTime": 20090318, 
        "postID": 5, 
        "quote": "", 
        "reply": "I am sure Obama must have a hand in it, as well. You must remember that the top 3 recipients of campaign contribution from AIG are as follows; 1. Dodd, 2. Obama and, 3. McCain. So, you cannot tell me that Obama didn't have a little feeling of pity for those AIG execs that would lose their bonuses. Come on, now.", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 19:49:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: I am sure Obama must have a hand in it, as well. You must remember that the top 3 recipients of campaign contribution from AIG are as follows; 1. Dodd, 2. Obama and, 3. McCain. So, you cannot tell me that Obama didn't have a little feeling of pity for those AIG execs that would lose their bonuses. Come on, now. Perhaps he'll have enough to prevent Frank and Dodd from using them as crucifixes in place of themselves.", 
        "intTime": 20090318, 
        "postID": 6, 
        "quote": "Originally posted by 10tenths: I am sure Obama must have a hand in it, as well. You must remember that the top 3 recipients of campaign contribution from AIG are as follows; 1. Dodd, 2. Obama and, 3. McCain. So, you cannot tell me that Obama didn't have a little feeling of pity for those AIG execs that would lose their bonuses. Come on, now.", 
        "reply": " Perhaps he'll have enough to prevent Frank and Dodd from using them as crucifixes in place of themselves.", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 19:52:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "Any chance that Dodd will do the honorable thing and resign ASAP? Other than a snowball’s chance in hell… \"I’m a right wing, anti-illegal, pro-life, gun owning, straight, white, college educated, politically informed, conservative, Christian male. Liberals really hate me.\"", 
        "intTime": 20090318, 
        "postID": 7, 
        "quote": "", 
        "reply": "Any chance that Dodd will do the honorable thing and resign ASAP? Other than a snowball’s chance in hell… \"I’m a right wing, anti-illegal, pro-life, gun owning, straight, white, college educated, politically informed, conservative, Christian male. Liberals really hate me.\"", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 20:44:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "Yeah, probably the snowball's chance in hell thing would be more likely. When is Dodd up for reelection?", 
        "intTime": 20090318, 
        "postID": 8, 
        "quote": "", 
        "reply": "Yeah, probably the snowball's chance in hell thing would be more likely. When is Dodd up for reelection?", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 21:17:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Nothing anymore is a surprise when it involves this administration. At least 44% of american voters voted their conscience knowing the outcome. The outcome is now coming daily. MAN!!!!! what is still yet to come?", 
        "intTime": 20090318, 
        "postID": 9, 
        "quote": "", 
        "reply": "Nothing anymore is a surprise when it involves this administration. At least 44% of american voters voted their conscience knowing the outcome. The outcome is now coming daily. MAN!!!!! what is still yet to come?", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 21:27:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "liers and taxes and inflation, Oh my!!!", 
        "intTime": 20090318, 
        "postID": 10, 
        "quote": "", 
        "reply": "liers and taxes and inflation, Oh my!!!", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 22:06:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by Navy_Grunt: Any chance that Dodd will do the honorable thing and resign ASAP? Other than a snowball’s chance in hell… \"I’m a right wing, anti-illegal, pro-life, gun owning, straight, white, college educated, politically informed, conservative, Christian male. Liberals really hate me.\" Dodd Frank Geitner Peloser all need to resign a", 
        "intTime": 20090319, 
        "postID": 11, 
        "quote": "Originally posted by Navy_Grunt: Any chance that Dodd will do the honorable thing and resign ASAP? Other than a snowball’s chance in hell… \"I’m a right wing, anti-illegal, pro-life, gun owning, straight, white, college educated, politically informed, conservative, Christian male. Liberals really hate me.\"", 
        "reply": " Dodd Frank Geitner Peloser all need to resign a", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-19 05:31:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: Yeah, probably the snowball's chance in hell thing would be more likely. When is Dodd up for reelection? It doesn't matter they all just keep getting re-elected, even Murtha got re-elected after bashing Marines and in his own words his Racist District.", 
        "intTime": 20090319, 
        "postID": 12, 
        "quote": "Originally posted by 10tenths: Yeah, probably the snowball's chance in hell thing would be more likely. When is Dodd up for reelection?", 
        "reply": " It doesn't matter they all just keep getting re-elected, even Murtha got re-elected after bashing Marines and in his own words his Racist District.", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-19 06:51:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "carsleyt"
    }, 
    {
        "content": "Democratic Party Implosion in 5...4....3...2....", 
        "intTime": 20090319, 
        "postID": 13, 
        "quote": "", 
        "reply": "Democratic Party Implosion in 5...4....3...2....", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-19 06:52:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "carsleyt"
    }, 
    {
        "content": "LOL ... the lib web sites are in a bit of a tizzy today ... all that bashing of Fox, Drudge, and Limbaugh for being dishonest ... and it was their own boy who was the liar.", 
        "intTime": 20090319, 
        "postID": 14, 
        "quote": "", 
        "reply": "LOL ... the lib web sites are in a bit of a tizzy today ... all that bashing of Fox, Drudge, and Limbaugh for being dishonest ... and it was their own boy who was the liar.", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-19 08:54:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "I keep saying the lib voters are going to hate themselves for electing Obama, but then we will lead em back to happiness with another superb Republican President!", 
        "intTime": 20090319, 
        "postID": 15, 
        "quote": "", 
        "reply": "I keep saying the lib voters are going to hate themselves for electing Obama, but then we will lead em back to happiness with another superb Republican President!", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-19 09:40:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "EAG154"
    }, 
    {
        "content": "Oooh! Ooooh! Ooooh! Can I say it first?!? Can I say it first?!? (hand raised & waiving excitedly to get the teacher's attention) AIG-Gate!!!", 
        "intTime": 20090319, 
        "postID": 16, 
        "quote": "", 
        "reply": "Oooh! Ooooh! Ooooh! Can I say it first?!? Can I say it first?!? (hand raised & waiving excitedly to get the teacher's attention) AIG-Gate!!!", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-19 11:28:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: LOL ... the lib web sites are in a bit of a tizzy today ... all that bashing of Fox, Drudge, and Limbaugh for being dishonest ... and it was their own boy who was the liar. Koolaid Hole", 
        "intTime": 20090319, 
        "postID": 17, 
        "quote": "Originally posted by I_M_Qwerty: LOL ... the lib web sites are in a bit of a tizzy today ... all that bashing of Fox, Drudge, and Limbaugh for being dishonest ... and it was their own boy who was the liar.", 
        "reply": " Koolaid Hole", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-19 11:33:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by carsleyt: quote: Originally posted by 10tenths: Yeah, probably the snowball's chance in hell thing would be more likely. When is Dodd up for reelection? It doesn't matter they all just keep getting re-elected, even Murtha got re-elected after bashing Marines and in his own words his Racist District. There may be a light at the end of the tunnel. My relatives in CT have told me that the local papers have been attacking Dodd without mercy so he may have a hard time talking his way out of this one. Also, CT is a funny state - very dependent on both Wall Street and the defense industry so when both are down things tend get bad rather quickly. The only thing left will be the crack dealers coming out of NYC so there still may be a little cash flowing on the streets...", 
        "intTime": 20090319, 
        "postID": 18, 
        "quote": "Originally posted by carsleyt: quote: Originally posted by 10tenths: Yeah, probably the snowball's chance in hell thing would be more likely. When is Dodd up for reelection? It doesn't matter they all just keep getting re-elected, even Murtha got re-elected after bashing Marines and in his own words his Racist District.", 
        "reply": " There may be a light at the end of the tunnel. My relatives in CT have told me that the local papers have been attacking Dodd without mercy so he may have a hard time talking his way out of this one. Also, CT is a funny state - very dependent on both Wall Street and the defense industry so when both are down things tend get bad rather quickly. The only thing left will be the crack dealers coming out of NYC so there still may be a little cash flowing on the streets...", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-19 11:54:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Thank you for your political honesty Motive, you are on of few folks here that can admit a mess up. I mean that for both sides of the political spectrum. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090319, 
        "postID": 19, 
        "quote": "", 
        "reply": "Thank you for your political honesty Motive, you are on of few folks here that can admit a mess up. I mean that for both sides of the political spectrum. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-19 12:01:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by I_M_Qwerty: LOL ... the lib web sites are in a bit of a tizzy today ... all that bashing of Fox, Drudge, and Limbaugh for being dishonest ... and it was their own boy who was the liar. Koolaid Hole ........ Already past the future", 
        "intTime": 20090320, 
        "postID": 20, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by I_M_Qwerty: LOL ... the lib web sites are in a bit of a tizzy today ... all that bashing of Fox, Drudge, and Limbaugh for being dishonest ... and it was their own boy who was the liar. Koolaid Hole", 
        "reply": " ........ Already past the future", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-20 03:49:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: TITLE: Dodd: Administration pushed for language protecting bonuses (CNN) -- Senate Banking committee Chairman Christopher Dodd told CNN Wednesday that he was responsible for language added to the federal stimulus bill to make sure that already-existing contracts for bonuses at companies receiving federal bailout money were honored. Dodd acknowledged his role in the change after a Treasury Department official told CNN the administration pushed for the language. Both Dodd and the official, who asked not to be named, said it was because administration officials were afraid the government would face numerous lawsuits without the new language. Dodd, a Democrat, told CNN's Dana Bash and Wolf Blitzer that Obama administration officials pushed for the language to an amendment designed to limit bonuses and \"golden parachutes\" at those companies. \"The administration had expressed reservations,\" Dodd said. \"They asked for modifications. The alternative was losing the amendment entirely.\" On Tuesday, Dodd denied to CNN that he had anything to do with adding the language, which has been used by officials at bailed-out insurance giant AIG to justify paying millions of dollars in bonuses to executives after receiving federal money. He said Wednesday that the \"grandfather clause\" language \"seemed like innocent modifications\" at the time. <more> \"http://www.cnn.com/2009/POLITICS/03/18/aig.bonuses.congress/index.html\" It seems that Fox, Drudge, and Limbaugh, among others, were right on the money afterall. I can think of a few liberal web sites that have been castigating them for erroneous reporting based on Dodd's denial yesterday that must be feeling pretty embarassed about now. Dodd should resign. It would also appear that the Obama administration was far more involved in getting the exception added than anything we've heard would lead one to believe. I see now where the buck stops on this one ... and it isn't under former President Bush's picture. This message has been edited. Last edited by: I_M_Qwerty, Wed 18 March 2009 07:09 PM", 
        "intTime": 20090318, 
        "postID": 21, 
        "quote": "TITLE: Dodd: Administration pushed for language protecting bonuses (CNN) -- Senate Banking committee Chairman Christopher Dodd told CNN Wednesday that he was responsible for language added to the federal stimulus bill to make sure that already-existing contracts for bonuses at companies receiving federal bailout money were honored. Dodd acknowledged his role in the change after a Treasury Department official told CNN the administration pushed for the language. Both Dodd and the official, who asked not to be named, said it was because administration officials were afraid the government would face numerous lawsuits without the new language. Dodd, a Democrat, told CNN's Dana Bash and Wolf Blitzer that Obama administration officials pushed for the language to an amendment designed to limit bonuses and \"golden parachutes\" at those companies. \"The administration had expressed reservations,\" Dodd said. \"They asked for modifications. The alternative was losing the amendment entirely.\" On Tuesday, Dodd denied to CNN that he had anything to do with adding the language, which has been used by officials at bailed-out insurance giant AIG to justify paying millions of dollars in bonuses to executives after receiving federal money. He said Wednesday that the \"grandfather clause\" language \"seemed like innocent modifications\" at the time. <more> \"http://www.cnn.com/2009/POLITICS/03/18/aig.bonuses.congress/index.html\"", 
        "reply": " It seems that Fox, Drudge, and Limbaugh, among others, were right on the money afterall. I can think of a few liberal web sites that have been castigating them for erroneous reporting based on Dodd's denial yesterday that must be feeling pretty embarassed about now. Dodd should resign. It would also appear that the Obama administration was far more involved in getting the exception added than anything we've heard would lead one to believe. I see now where the buck stops on this one ... and it isn't under former President Bush's picture. This message has been edited. Last edited by: I_M_Qwerty, Wed 18 March 2009 07:09 PM", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 18:43:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "No surprises here, just another politician who cannot tell the truth about anything.", 
        "intTime": 20090318, 
        "postID": 22, 
        "quote": "", 
        "reply": "No surprises here, just another politician who cannot tell the truth about anything.", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 18:50:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: TITLE: Dodd: Administration pushed for language protecting bonuses (CNN) -- Senate Banking committee Chairman Christopher Dodd told CNN Wednesday that he was responsible for language added to the federal stimulus bill to make sure that already-existing contracts for bonuses at companies receiving federal bailout money were honored. Dodd acknowledged his role in the change after a Treasury Department official told CNN the administration pushed for the language. Both Dodd and the official, who asked not to be named, said it was because administration officials were afraid the government would face numerous lawsuits without the new language. Dodd, a Democrat, told CNN's Dana Bash and Wolf Blitzer that Obama administration officials pushed for the language to an amendment designed to limit bonuses and \"golden parachutes\" at those companies. \"The administration had expressed reservations,\" Dodd said. \"They asked for modifications. The alternative was losing the amendment entirely.\" On Tuesday, Dodd denied to CNN that he had anything to do with adding the language, which has been used by officials at bailed-out insurance giant AIG to justify paying millions of dollars in bonuses to executives after receiving federal money. He said Wednesday that the \"grandfather clause\" language \"seemed like innocent modifications\" at the time. <more> \"http://www.cnn.com/2009/POLITICS/03/18/aig.bonuses.congress/index.html\" It seems that Fox, Drudge, and Limbaugh, among others, were right on the money afterall. I can think of a few liberal web sites that have been castigating them for erroneous reporting based on Dodd's denial yesterday that must be feeling pretty embarassed about now. Dodd should resign. It would also appear that the Obama administration was far more involved in getting the exception added than anything we've heard would lead one to believe. I see now where the buck stops on this one ... and it isn't under former President Bush's picture. Saw a couple. I'm afraid I'm terrible remembering names, a young not so conservation lady by the Kiersten and the gentlemen ,a Washington Post columnist, both dress down the honorable Senator to his undershorts for lying. In fact the network had interrupted the exchange for the latest admittance from Dodd. Surprised at Mr. Krauthammer, a very conservation type, taking the position the Secretary of Treasury Tim Geithner had so much on his plate it was hard for him to focus on the bonuses were built in the bill that he helped write. His boss has advertised him being the only savior of our system does cloud a mind, and how all the hired help has been evading the treasury department as of late, making it even a larger task. All through the latest episode from the President to his advisors all have stated that the \"retention\" were to keep these people in place or the AIG would really be in trouble. You think? If I was King for the day, they would be the last folks I keep, along with the other 25 bonuses were paid to the people that have already left. Good riddance. Stock up on the Preparation H. More Bonuses are yet to come for those fine folks at Freddie and Fannie, another inept federal failure. Make no mistakes, the politicians are guilty of writing bad laws, taking restrictions off of good laws and getting into bed with crooks.", 
        "intTime": 20090318, 
        "postID": 23, 
        "quote": "Originally posted by I_M_Qwerty: quote: TITLE: Dodd: Administration pushed for language protecting bonuses (CNN) -- Senate Banking committee Chairman Christopher Dodd told CNN Wednesday that he was responsible for language added to the federal stimulus bill to make sure that already-existing contracts for bonuses at companies receiving federal bailout money were honored. Dodd acknowledged his role in the change after a Treasury Department official told CNN the administration pushed for the language. Both Dodd and the official, who asked not to be named, said it was because administration officials were afraid the government would face numerous lawsuits without the new language. Dodd, a Democrat, told CNN's Dana Bash and Wolf Blitzer that Obama administration officials pushed for the language to an amendment designed to limit bonuses and \"golden parachutes\" at those companies. \"The administration had expressed reservations,\" Dodd said. \"They asked for modifications. The alternative was losing the amendment entirely.\" On Tuesday, Dodd denied to CNN that he had anything to do with adding the language, which has been used by officials at bailed-out insurance giant AIG to justify paying millions of dollars in bonuses to executives after receiving federal money. He said Wednesday that the \"grandfather clause\" language \"seemed like innocent modifications\" at the time. <more> \"http://www.cnn.com/2009/POLITICS/03/18/aig.bonuses.congress/index.html\" It seems that Fox, Drudge, and Limbaugh, among others, were right on the money afterall. I can think of a few liberal web sites that have been castigating them for erroneous reporting based on Dodd's denial yesterday that must be feeling pretty embarassed about now. Dodd should resign. It would also appear that the Obama administration was far more involved in getting the exception added than anything we've heard would lead one to believe. I see now where the buck stops on this one ... and it isn't under former President Bush's picture.", 
        "reply": " Saw a couple. I'm afraid I'm terrible remembering names, a young not so conservation lady by the Kiersten and the gentlemen ,a Washington Post columnist, both dress down the honorable Senator to his undershorts for lying. In fact the network had interrupted the exchange for the latest admittance from Dodd. Surprised at Mr. Krauthammer, a very conservation type, taking the position the Secretary of Treasury Tim Geithner had so much on his plate it was hard for him to focus on the bonuses were built in the bill that he helped write. His boss has advertised him being the only savior of our system does cloud a mind, and how all the hired help has been evading the treasury department as of late, making it even a larger task. All through the latest episode from the President to his advisors all have stated that the \"retention\" were to keep these people in place or the AIG would really be in trouble. You think? If I was King for the day, they would be the last folks I keep, along with the other 25 bonuses were paid to the people that have already left. Good riddance. Stock up on the Preparation H. More Bonuses are yet to come for those fine folks at Freddie and Fannie, another inept federal failure. Make no mistakes, the politicians are guilty of writing bad laws, taking restrictions off of good laws and getting into bed with crooks.", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 19:11:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "What a mess! A lot of people have egg on their faces after this. AIG is going to be a dirty word for years to come.", 
        "intTime": 20090318, 
        "postID": 24, 
        "quote": "", 
        "reply": "What a mess! A lot of people have egg on their faces after this. AIG is going to be a dirty word for years to come.", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 19:11:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "Motive25"
    }, 
    {
        "content": "I am sure Obama must have a hand in it, as well. You must remember that the top 3 recipients of campaign contribution from AIG are as follows; 1. Dodd, 2. Obama and, 3. McCain. So, you cannot tell me that Obama didn't have a little feeling of pity for those AIG execs that would lose their bonuses. Come on, now.", 
        "intTime": 20090318, 
        "postID": 25, 
        "quote": "", 
        "reply": "I am sure Obama must have a hand in it, as well. You must remember that the top 3 recipients of campaign contribution from AIG are as follows; 1. Dodd, 2. Obama and, 3. McCain. So, you cannot tell me that Obama didn't have a little feeling of pity for those AIG execs that would lose their bonuses. Come on, now.", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 19:49:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: I am sure Obama must have a hand in it, as well. You must remember that the top 3 recipients of campaign contribution from AIG are as follows; 1. Dodd, 2. Obama and, 3. McCain. So, you cannot tell me that Obama didn't have a little feeling of pity for those AIG execs that would lose their bonuses. Come on, now. Perhaps he'll have enough to prevent Frank and Dodd from using them as crucifixes in place of themselves.", 
        "intTime": 20090318, 
        "postID": 26, 
        "quote": "Originally posted by 10tenths: I am sure Obama must have a hand in it, as well. You must remember that the top 3 recipients of campaign contribution from AIG are as follows; 1. Dodd, 2. Obama and, 3. McCain. So, you cannot tell me that Obama didn't have a little feeling of pity for those AIG execs that would lose their bonuses. Come on, now.", 
        "reply": " Perhaps he'll have enough to prevent Frank and Dodd from using them as crucifixes in place of themselves.", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 19:52:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "Any chance that Dodd will do the honorable thing and resign ASAP? Other than a snowball’s chance in hell… \"I’m a right wing, anti-illegal, pro-life, gun owning, straight, white, college educated, politically informed, conservative, Christian male. Liberals really hate me.\"", 
        "intTime": 20090318, 
        "postID": 27, 
        "quote": "", 
        "reply": "Any chance that Dodd will do the honorable thing and resign ASAP? Other than a snowball’s chance in hell… \"I’m a right wing, anti-illegal, pro-life, gun owning, straight, white, college educated, politically informed, conservative, Christian male. Liberals really hate me.\"", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 20:44:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "Yeah, probably the snowball's chance in hell thing would be more likely. When is Dodd up for reelection?", 
        "intTime": 20090318, 
        "postID": 28, 
        "quote": "", 
        "reply": "Yeah, probably the snowball's chance in hell thing would be more likely. When is Dodd up for reelection?", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 21:17:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Nothing anymore is a surprise when it involves this administration. At least 44% of american voters voted their conscience knowing the outcome. The outcome is now coming daily. MAN!!!!! what is still yet to come?", 
        "intTime": 20090318, 
        "postID": 29, 
        "quote": "", 
        "reply": "Nothing anymore is a surprise when it involves this administration. At least 44% of american voters voted their conscience knowing the outcome. The outcome is now coming daily. MAN!!!!! what is still yet to come?", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 21:27:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "liers and taxes and inflation, Oh my!!!", 
        "intTime": 20090318, 
        "postID": 30, 
        "quote": "", 
        "reply": "liers and taxes and inflation, Oh my!!!", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-18 22:06:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by Navy_Grunt: Any chance that Dodd will do the honorable thing and resign ASAP? Other than a snowball’s chance in hell… \"I’m a right wing, anti-illegal, pro-life, gun owning, straight, white, college educated, politically informed, conservative, Christian male. Liberals really hate me.\" Dodd Frank Geitner Peloser all need to resign a", 
        "intTime": 20090319, 
        "postID": 31, 
        "quote": "Originally posted by Navy_Grunt: Any chance that Dodd will do the honorable thing and resign ASAP? Other than a snowball’s chance in hell… \"I’m a right wing, anti-illegal, pro-life, gun owning, straight, white, college educated, politically informed, conservative, Christian male. Liberals really hate me.\"", 
        "reply": " Dodd Frank Geitner Peloser all need to resign a", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-19 05:31:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: Yeah, probably the snowball's chance in hell thing would be more likely. When is Dodd up for reelection? It doesn't matter they all just keep getting re-elected, even Murtha got re-elected after bashing Marines and in his own words his Racist District.", 
        "intTime": 20090319, 
        "postID": 32, 
        "quote": "Originally posted by 10tenths: Yeah, probably the snowball's chance in hell thing would be more likely. When is Dodd up for reelection?", 
        "reply": " It doesn't matter they all just keep getting re-elected, even Murtha got re-elected after bashing Marines and in his own words his Racist District.", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-19 06:51:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "carsleyt"
    }, 
    {
        "content": "Democratic Party Implosion in 5...4....3...2....", 
        "intTime": 20090319, 
        "postID": 33, 
        "quote": "", 
        "reply": "Democratic Party Implosion in 5...4....3...2....", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-19 06:52:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "carsleyt"
    }, 
    {
        "content": "LOL ... the lib web sites are in a bit of a tizzy today ... all that bashing of Fox, Drudge, and Limbaugh for being dishonest ... and it was their own boy who was the liar.", 
        "intTime": 20090319, 
        "postID": 34, 
        "quote": "", 
        "reply": "LOL ... the lib web sites are in a bit of a tizzy today ... all that bashing of Fox, Drudge, and Limbaugh for being dishonest ... and it was their own boy who was the liar.", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-19 08:54:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "I keep saying the lib voters are going to hate themselves for electing Obama, but then we will lead em back to happiness with another superb Republican President!", 
        "intTime": 20090319, 
        "postID": 35, 
        "quote": "", 
        "reply": "I keep saying the lib voters are going to hate themselves for electing Obama, but then we will lead em back to happiness with another superb Republican President!", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-19 09:40:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "EAG154"
    }, 
    {
        "content": "Oooh! Ooooh! Ooooh! Can I say it first?!? Can I say it first?!? (hand raised & waiving excitedly to get the teacher's attention) AIG-Gate!!!", 
        "intTime": 20090319, 
        "postID": 36, 
        "quote": "", 
        "reply": "Oooh! Ooooh! Ooooh! Can I say it first?!? Can I say it first?!? (hand raised & waiving excitedly to get the teacher's attention) AIG-Gate!!!", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-19 11:28:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: LOL ... the lib web sites are in a bit of a tizzy today ... all that bashing of Fox, Drudge, and Limbaugh for being dishonest ... and it was their own boy who was the liar. Koolaid Hole", 
        "intTime": 20090319, 
        "postID": 37, 
        "quote": "Originally posted by I_M_Qwerty: LOL ... the lib web sites are in a bit of a tizzy today ... all that bashing of Fox, Drudge, and Limbaugh for being dishonest ... and it was their own boy who was the liar.", 
        "reply": " Koolaid Hole", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-19 11:33:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by carsleyt: quote: Originally posted by 10tenths: Yeah, probably the snowball's chance in hell thing would be more likely. When is Dodd up for reelection? It doesn't matter they all just keep getting re-elected, even Murtha got re-elected after bashing Marines and in his own words his Racist District. There may be a light at the end of the tunnel. My relatives in CT have told me that the local papers have been attacking Dodd without mercy so he may have a hard time talking his way out of this one. Also, CT is a funny state - very dependent on both Wall Street and the defense industry so when both are down things tend get bad rather quickly. The only thing left will be the crack dealers coming out of NYC so there still may be a little cash flowing on the streets...", 
        "intTime": 20090319, 
        "postID": 38, 
        "quote": "Originally posted by carsleyt: quote: Originally posted by 10tenths: Yeah, probably the snowball's chance in hell thing would be more likely. When is Dodd up for reelection? It doesn't matter they all just keep getting re-elected, even Murtha got re-elected after bashing Marines and in his own words his Racist District.", 
        "reply": " There may be a light at the end of the tunnel. My relatives in CT have told me that the local papers have been attacking Dodd without mercy so he may have a hard time talking his way out of this one. Also, CT is a funny state - very dependent on both Wall Street and the defense industry so when both are down things tend get bad rather quickly. The only thing left will be the crack dealers coming out of NYC so there still may be a little cash flowing on the streets...", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-19 11:54:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Thank you for your political honesty Motive, you are on of few folks here that can admit a mess up. I mean that for both sides of the political spectrum. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090319, 
        "postID": 39, 
        "quote": "", 
        "reply": "Thank you for your political honesty Motive, you are on of few folks here that can admit a mess up. I mean that for both sides of the political spectrum. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-19 12:01:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by I_M_Qwerty: LOL ... the lib web sites are in a bit of a tizzy today ... all that bashing of Fox, Drudge, and Limbaugh for being dishonest ... and it was their own boy who was the liar. Koolaid Hole ........ Already past the future", 
        "intTime": 20090320, 
        "postID": 40, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by I_M_Qwerty: LOL ... the lib web sites are in a bit of a tizzy today ... all that bashing of Fox, Drudge, and Limbaugh for being dishonest ... and it was their own boy who was the liar. Koolaid Hole", 
        "reply": " ........ Already past the future", 
        "threadID": "672198221_2430062812001", 
        "time": "2009-03-20 03:49:00", 
        "title": "Dodd Lied, Recants, Now Blames Obama Administration", 
        "userID": "6486143"
    }
]