[
    {
        "content": "OLYMPIA, Wash. – Linda Fleming was diagnosed with terminal cancer and feared her last days would be filled with pain and ever-stronger doses of medication that would erode her mind. The 66-year-old woman with late-stage pancreatic cancer wanted to be clear-headed at death, so she became the first person to kill herself under Washington state's new assisted suicide law, known as \"death with dignity.\" ---http://news.yahoo.com/s/ap/20090523/ap_on_re_us/us_assisted_suicide---", 
        "intTime": 20090523, 
        "postID": 1, 
        "quote": "", 
        "reply": "OLYMPIA, Wash. – Linda Fleming was diagnosed with terminal cancer and feared her last days would be filled with pain and ever-stronger doses of medication that would erode her mind. The 66-year-old woman with late-stage pancreatic cancer wanted to be clear-headed at death, so she became the first person to kill herself under Washington state's new assisted suicide law, known as \"death with dignity.\" ---http://news.yahoo.com/s/ap/20090523/ap_on_re_us/us_assisted_suicide---", 
        "threadID": "672198221_5410050422001", 
        "time": "2009-05-23 01:40:00", 
        "title": "Wash. state woman 1st death under new assisted suicide law", 
        "userID": "world_king377"
    }, 
    {
        "content": "And may God, if there is a God, have mercy on her cancer-free, pain-free and perfect young soul. Otherwise, let's go the mall.", 
        "intTime": 20090523, 
        "postID": 2, 
        "quote": "", 
        "reply": "And may God, if there is a God, have mercy on her cancer-free, pain-free and perfect young soul. Otherwise, let's go the mall.", 
        "threadID": "672198221_5410050422001", 
        "time": "2009-05-23 02:53:00", 
        "title": "Wash. state woman 1st death under new assisted suicide law", 
        "userID": "AliBubba"
    }, 
    {
        "content": "I'm glad the people of Washington had the courage and maturity to pass the law allowing her to make this decision for herself! I'm always shocked when people who have the compassion to put a terminally ill pet to sleep feel somehow justified in demanding that a human be forced to suffer for months, even years, against their will because \"life is sacred.\" My Advanced Directive states: Should I ever come to the position that I’m being kept alive by artificial means, with no realistic hope of recovery to a decent quality of life, then DNR and flip the switch, pull the plug or whatever else is needed to stop artificial life support. I have 100% confidence in God that, should there be some unfathomable (to me anyway) reason He wants me to stay alive, it won’t matter one whit whether the ventilator is turned on or off. Then, when I’m done with my body, harvest as many of my organs as they can use to give to others and bury the rest in a plain biodegradable box, sans formaldehyde or any other chemicals that would be harmful to any bugs, worms or other critters that would feed on me. Let my rotting carcass give life & sustenance to the entire food chain. It's not copyrighted, so, should anyone so choose, feel free to copy it.", 
        "intTime": 20090523, 
        "postID": 3, 
        "quote": "", 
        "reply": "I'm glad the people of Washington had the courage and maturity to pass the law allowing her to make this decision for herself! I'm always shocked when people who have the compassion to put a terminally ill pet to sleep feel somehow justified in demanding that a human be forced to suffer for months, even years, against their will because \"life is sacred.\" My Advanced Directive states: Should I ever come to the position that I’m being kept alive by artificial means, with no realistic hope of recovery to a decent quality of life, then DNR and flip the switch, pull the plug or whatever else is needed to stop artificial life support. I have 100% confidence in God that, should there be some unfathomable (to me anyway) reason He wants me to stay alive, it won’t matter one whit whether the ventilator is turned on or off. Then, when I’m done with my body, harvest as many of my organs as they can use to give to others and bury the rest in a plain biodegradable box, sans formaldehyde or any other chemicals that would be harmful to any bugs, worms or other critters that would feed on me. Let my rotting carcass give life & sustenance to the entire food chain. It's not copyrighted, so, should anyone so choose, feel free to copy it.", 
        "threadID": "672198221_5410050422001", 
        "time": "2009-05-23 03:44:00", 
        "title": "Wash. state woman 1st death under new assisted suicide law", 
        "userID": "DaleU"
    }, 
    {
        "content": "quote: Originally posted by DaleU: I'm glad the people of Washington had the courage and maturity to pass the law allowing her to make this decision for herself! I'm always shocked when people who have the compassion to put a terminally ill pet to sleep feel somehow justified in demanding that a human be forced to suffer for months, even years, against their will because \"life is sacred.\" My Advanced Directive states: Should I ever come to the position that I’m being kept alive by artificial means, with no realistic hope of recovery to a decent quality of life, then DNR and flip the switch, pull the plug or whatever else is needed to stop artificial life support. I have 100% confidence in God that, should there be some unfathomable (to me anyway) reason He wants me to stay alive, it won’t matter one whit whether the ventilator is turned on or off. Then, when I’m done with my body, harvest as many of my organs as they can use to give to others and bury the rest in a plain biodegradable box, sans formaldehyde or any other chemicals that would be harmful to any bugs, worms or other critters that would feed on me. Let my rotting carcass give life & sustenance to the entire food chain. It's not copyrighted, so, should anyone so choose, feel free to copy it. Thanks Dale. Good thought!", 
        "intTime": 20090523, 
        "postID": 4, 
        "quote": "Originally posted by DaleU: I'm glad the people of Washington had the courage and maturity to pass the law allowing her to make this decision for herself! I'm always shocked when people who have the compassion to put a terminally ill pet to sleep feel somehow justified in demanding that a human be forced to suffer for months, even years, against their will because \"life is sacred.\" My Advanced Directive states: Should I ever come to the position that I’m being kept alive by artificial means, with no realistic hope of recovery to a decent quality of life, then DNR and flip the switch, pull the plug or whatever else is needed to stop artificial life support. I have 100% confidence in God that, should there be some unfathomable (to me anyway) reason He wants me to stay alive, it won’t matter one whit whether the ventilator is turned on or off. Then, when I’m done with my body, harvest as many of my organs as they can use to give to others and bury the rest in a plain biodegradable box, sans formaldehyde or any other chemicals that would be harmful to any bugs, worms or other critters that would feed on me. Let my rotting carcass give life & sustenance to the entire food chain. It's not copyrighted, so, should anyone so choose, feel free to copy it.", 
        "reply": " Thanks Dale. Good thought!", 
        "threadID": "672198221_5410050422001", 
        "time": "2009-05-23 05:28:00", 
        "title": "Wash. state woman 1st death under new assisted suicide law", 
        "userID": "AliBubba"
    }, 
    {
        "content": "I'm glad I live in Washington, and I hope that some day this option will be available in all fifty states.", 
        "intTime": 20090523, 
        "postID": 5, 
        "quote": "", 
        "reply": "I'm glad I live in Washington, and I hope that some day this option will be available in all fifty states.", 
        "threadID": "672198221_5410050422001", 
        "time": "2009-05-23 12:03:00", 
        "title": "Wash. state woman 1st death under new assisted suicide law", 
        "userID": "BPCR45_90"
    }
]