[
    {
        "content": "The White House's \"full support.\" The backing of Senate leadership. The promise to retain his rank. Pennsylvania Sen. Arlen Specter appeared to gain a new political world for leaving the party that brought him to national politics. One week later, that world is gone. Specter now stands alone. Stripped of his rank by Democrats. Scorned by Republicans. Specter's flash of strength has turned to weakness. That weakness was thrown into stark relief Wednesday night, as Rep. Joe Sestak said in an interview that he was \"very seriously\" considering challenging Specter in the Democratic primary. There was a renewed energy to Sestak, repeating the phrase \"very seriously\" as he drove from Washington DC to Pittsburgh. It was only last week that Sestak appeared blindsided. \"You know,\" Sestak told MSNBC's Chris Matthews Friday with a pang of resignation, \"I was thinking of getting in. And I haven't made my final decision.\" How quickly the winds have changed. Barack Obama was handed a political gift on his 100th day in office. A moderate Republican came to the White House to offer his Democratic allegiance and potentially an invincible legislative majority. Obama and Vice President Joe Biden received Specter publicly, courting live coverage on the cable networks. It was a celebration. President Obama told Specter he would campaign for him. Obama offered his \"full support,\" a pledge reiterated by top White House officials. Specter was to be no \"rubber stamp.\" But the exchange was implicit. On some big bills, perhaps health care, Specter could offer the scale-tipping 60th vote. Obama would avoid contentious procedural maneuvers. In return, Specter was to keep his veteran status and win the mighty Democratic leadership’s favor. Senate Majority Leader Harry Reid put it plainly to National Journal reporters on Friday. Specter, Reid said, \"will maintain his overall seniority in the Senate and its pretty clear that he's going to do that.\" Soon even that allegiance came into question. This week Specter told the New York Times that Republican Norm Coleman should be seated over his Democratic opponent Al Franken, in Minnesota's still disputed Senate race. \"Arlen,\" Reid asked Specter on the Senate floor. \"What's going on here?\" \"I forgot what team I was on,\" Specter replied. Tuesday night, the Senate voted to strip Specter of his seniority. Specter has served in the Senate for twenty nine years. The vote left him with the power of a freshman. Specter responded Wednesday morning with a written statement, again noting Reid's promise that \"I would have the same seniority as if I had been elected as a Democrat in 1980.\" Rest Here: \"http://www.realclearpolitics.com/articles/2009/05/07/dems_shun_specter_undercut_obama_and_reid_96381.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090507, 
        "postID": 1, 
        "quote": "", 
        "reply": "The White House's \"full support.\" The backing of Senate leadership. The promise to retain his rank. Pennsylvania Sen. Arlen Specter appeared to gain a new political world for leaving the party that brought him to national politics. One week later, that world is gone. Specter now stands alone. Stripped of his rank by Democrats. Scorned by Republicans. Specter's flash of strength has turned to weakness. That weakness was thrown into stark relief Wednesday night, as Rep. Joe Sestak said in an interview that he was \"very seriously\" considering challenging Specter in the Democratic primary. There was a renewed energy to Sestak, repeating the phrase \"very seriously\" as he drove from Washington DC to Pittsburgh. It was only last week that Sestak appeared blindsided. \"You know,\" Sestak told MSNBC's Chris Matthews Friday with a pang of resignation, \"I was thinking of getting in. And I haven't made my final decision.\" How quickly the winds have changed. Barack Obama was handed a political gift on his 100th day in office. A moderate Republican came to the White House to offer his Democratic allegiance and potentially an invincible legislative majority. Obama and Vice President Joe Biden received Specter publicly, courting live coverage on the cable networks. It was a celebration. President Obama told Specter he would campaign for him. Obama offered his \"full support,\" a pledge reiterated by top White House officials. Specter was to be no \"rubber stamp.\" But the exchange was implicit. On some big bills, perhaps health care, Specter could offer the scale-tipping 60th vote. Obama would avoid contentious procedural maneuvers. In return, Specter was to keep his veteran status and win the mighty Democratic leadership’s favor. Senate Majority Leader Harry Reid put it plainly to National Journal reporters on Friday. Specter, Reid said, \"will maintain his overall seniority in the Senate and its pretty clear that he's going to do that.\" Soon even that allegiance came into question. This week Specter told the New York Times that Republican Norm Coleman should be seated over his Democratic opponent Al Franken, in Minnesota's still disputed Senate race. \"Arlen,\" Reid asked Specter on the Senate floor. \"What's going on here?\" \"I forgot what team I was on,\" Specter replied. Tuesday night, the Senate voted to strip Specter of his seniority. Specter has served in the Senate for twenty nine years. The vote left him with the power of a freshman. Specter responded Wednesday morning with a written statement, again noting Reid's promise that \"I would have the same seniority as if I had been elected as a Democrat in 1980.\" Rest Here: \"http://www.realclearpolitics.com/articles/2009/05/07/dems_shun_specter_undercut_obama_and_reid_96381.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5100047222001", 
        "time": "2009-05-07 08:57:00", 
        "title": "Dems Shun Specter (stripped of title), Undercut Obama and Reid", 
        "userID": "Anbar7"
    }, 
    {
        "content": "A 29-year politician surprised at other politicians not able to keep their word? The shock, the horror..... Rep Spector knew what he was getting into now he has to live with it.", 
        "intTime": 20090507, 
        "postID": 2, 
        "quote": "", 
        "reply": "A 29-year politician surprised at other politicians not able to keep their word? The shock, the horror..... Rep Spector knew what he was getting into now he has to live with it.", 
        "threadID": "672198221_5100047222001", 
        "time": "2009-05-07 10:21:00", 
        "title": "Dems Shun Specter (stripped of title), Undercut Obama and Reid", 
        "userID": "sw614"
    }, 
    {
        "content": "I think they did the right thing. He may retain his overall Senate seniority, keep his office space, but he has only been a Dem for a week. The other members have worked for a long time to acheive their status within the Demacratic caucus. Specter work long to acheive his rank among the Republicians and he gave that up on his own.", 
        "intTime": 20090507, 
        "postID": 3, 
        "quote": "", 
        "reply": "I think they did the right thing. He may retain his overall Senate seniority, keep his office space, but he has only been a Dem for a week. The other members have worked for a long time to acheive their status within the Demacratic caucus. Specter work long to acheive his rank among the Republicians and he gave that up on his own.", 
        "threadID": "672198221_5100047222001", 
        "time": "2009-05-07 10:31:00", 
        "title": "Dems Shun Specter (stripped of title), Undercut Obama and Reid", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "quote: Originally posted by sgt_posty: I think they did the right thing. He may retain his overall Senate seniority, keep his office space, but he has only been a Dem for a week. The other members have worked for a long time to acheive their status within the Demacratic caucus. Specter work long to acheive his rank among the Republicians and he gave that up on his own. Aside from Dick Durbin, no politician wants to give up power. I wasn't surprised that he lost his senority and so it should be. You are correct that he has only been a dem for a week. Others worked hard to get where they are, why should they give up anything for a turn coat politican that can't be trusted by either party. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090507, 
        "postID": 4, 
        "quote": "Originally posted by sgt_posty: I think they did the right thing. He may retain his overall Senate seniority, keep his office space, but he has only been a Dem for a week. The other members have worked for a long time to acheive their status within the Demacratic caucus. Specter work long to acheive his rank among the Republicians and he gave that up on his own.", 
        "reply": " Aside from Dick Durbin, no politician wants to give up power. I wasn't surprised that he lost his senority and so it should be. You are correct that he has only been a dem for a week. Others worked hard to get where they are, why should they give up anything for a turn coat politican that can't be trusted by either party. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5100047222001", 
        "time": "2009-05-07 10:33:00", 
        "title": "Dems Shun Specter (stripped of title), Undercut Obama and Reid", 
        "userID": "L0A1"
    }, 
    {
        "content": "Soon even that allegiance came into question. This week Specter told the New York Times that Republican Norm Coleman should be seated over his Democratic opponent Al Franken, in Minnesota's still disputed Senate race. \"Arlen,\" Reid asked Specter on the Senate floor. \"What's going on here?\" \"I forgot what team I was on,\" Specter replied. That is the part that cracks me up. Another reason to have Terms. They just keep forgetting who they are for and what team they are on...ie the public's side. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090507, 
        "postID": 5, 
        "quote": "", 
        "reply": "Soon even that allegiance came into question. This week Specter told the New York Times that Republican Norm Coleman should be seated over his Democratic opponent Al Franken, in Minnesota's still disputed Senate race. \"Arlen,\" Reid asked Specter on the Senate floor. \"What's going on here?\" \"I forgot what team I was on,\" Specter replied. That is the part that cracks me up. Another reason to have Terms. They just keep forgetting who they are for and what team they are on...ie the public's side. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5100047222001", 
        "time": "2009-05-07 10:38:00", 
        "title": "Dems Shun Specter (stripped of title), Undercut Obama and Reid", 
        "userID": "Anbar7"
    }, 
    {
        "content": "I say, His means justifies his end......... I highly dislike guys like him that turncoat for their good and not the people who elected them in the first place. There should be a law that turncoat arses like him should be required to pay back all the campaign money that was given by republican voters for him to get elected as a Republican and over 29 years....that's alot of bucks. He'd of thought twice if he had that to do first.", 
        "intTime": 20090507, 
        "postID": 6, 
        "quote": "", 
        "reply": "I say, His means justifies his end......... I highly dislike guys like him that turncoat for their good and not the people who elected them in the first place. There should be a law that turncoat arses like him should be required to pay back all the campaign money that was given by republican voters for him to get elected as a Republican and over 29 years....that's alot of bucks. He'd of thought twice if he had that to do first.", 
        "threadID": "672198221_5100047222001", 
        "time": "2009-05-07 10:39:00", 
        "title": "Dems Shun Specter (stripped of title), Undercut Obama and Reid", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Soon even that allegiance came into question. This week Specter told the New York Times that Republican Norm Coleman should be seated over his Democratic opponent Al Franken, in Minnesota's still disputed Senate race. \"Arlen,\" Reid asked Specter on the Senate floor. \"What's going on here?\" \"I forgot what team I was on,\" Specter replied. That is the part that cracks me up. Another reason to have Terms. They just keep forgetting who they are for and what team they are on...ie the public's side. Funny as all hell!! LOL. I read about him saying that Coleman should be seated, this AFTER he switched sides. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090507, 
        "postID": 7, 
        "quote": "Originally posted by Anbar7: Soon even that allegiance came into question. This week Specter told the New York Times that Republican Norm Coleman should be seated over his Democratic opponent Al Franken, in Minnesota's still disputed Senate race. \"Arlen,\" Reid asked Specter on the Senate floor. \"What's going on here?\" \"I forgot what team I was on,\" Specter replied. That is the part that cracks me up. Another reason to have Terms. They just keep forgetting who they are for and what team they are on...ie the public's side.", 
        "reply": " Funny as all hell!! LOL. I read about him saying that Coleman should be seated, this AFTER he switched sides. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5100047222001", 
        "time": "2009-05-07 10:41:00", 
        "title": "Dems Shun Specter (stripped of title), Undercut Obama and Reid", 
        "userID": "L0A1"
    }, 
    {
        "content": "I can't wait to get back to Illinois to vote against Durbin, well as long as they don't run an even bigger fool against him. Hey LOA1 did I ever tell you that you have a unique last name?", 
        "intTime": 20090507, 
        "postID": 8, 
        "quote": "", 
        "reply": "I can't wait to get back to Illinois to vote against Durbin, well as long as they don't run an even bigger fool against him. Hey LOA1 did I ever tell you that you have a unique last name?", 
        "threadID": "672198221_5100047222001", 
        "time": "2009-05-07 10:43:00", 
        "title": "Dems Shun Specter (stripped of title), Undercut Obama and Reid", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "If Arlan had any balls or integrity he'd do the following. First he would quit the democrats. He would declair himself an independent. He would decline to \"caucas\" with neither party. But confrence with either party's LEADER to hear arguments concerning bills to be voted upon. LASTLY, he would anounce that he will not seek re-election (as he's not getting re elwected regardless) and spend the rest of his time VOTING his CONSIENCE and STICKING TO CONSTITUTIONAL voting in the best interests of the nation. Shy that, he's Benedict Arnold, and, if you recall, he earned nothing in speeking fees after he fled to England.", 
        "intTime": 20090507, 
        "postID": 9, 
        "quote": "", 
        "reply": "If Arlan had any balls or integrity he'd do the following. First he would quit the democrats. He would declair himself an independent. He would decline to \"caucas\" with neither party. But confrence with either party's LEADER to hear arguments concerning bills to be voted upon. LASTLY, he would anounce that he will not seek re-election (as he's not getting re elwected regardless) and spend the rest of his time VOTING his CONSIENCE and STICKING TO CONSTITUTIONAL voting in the best interests of the nation. Shy that, he's Benedict Arnold, and, if you recall, he earned nothing in speeking fees after he fled to England.", 
        "threadID": "672198221_5100047222001", 
        "time": "2009-05-07 10:47:00", 
        "title": "Dems Shun Specter (stripped of title), Undercut Obama and Reid", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by sgt_posty: I can't wait to get back to Illinois to vote against Durbin, well as long as they don't run an even bigger fool against him. Hey LOA1 did I ever tell you that you have a unique last name? My uncle's name is Dennis lol. Not a common last name though. I wouldn't doubt if we were distant relatives. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090507, 
        "postID": 10, 
        "quote": "Originally posted by sgt_posty: I can't wait to get back to Illinois to vote against Durbin, well as long as they don't run an even bigger fool against him. Hey LOA1 did I ever tell you that you have a unique last name?", 
        "reply": " My uncle's name is Dennis lol. Not a common last name though. I wouldn't doubt if we were distant relatives. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5100047222001", 
        "time": "2009-05-07 10:58:00", 
        "title": "Dems Shun Specter (stripped of title), Undercut Obama and Reid", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by sgt_posty: I can't wait to get back to Illinois to vote against Durbin, well as long as they don't run an even bigger fool against him. Hey LOA1 did I ever tell you that you have a unique last name? My uncle's name is Dennis lol. Not a common last name though. I wouldn't doubt if we were distant relatives. I've traced my line back to one of three large clusters back in England. Follow the coal mines from there through PA and we may very well be only a few generation apart. We now return you to your regularly scheduled topic.", 
        "intTime": 20090507, 
        "postID": 11, 
        "quote": "Originally posted by L0A1: quote: Originally posted by sgt_posty: I can't wait to get back to Illinois to vote against Durbin, well as long as they don't run an even bigger fool against him. Hey LOA1 did I ever tell you that you have a unique last name? My uncle's name is Dennis lol. Not a common last name though. I wouldn't doubt if we were distant relatives.", 
        "reply": " I've traced my line back to one of three large clusters back in England. Follow the coal mines from there through PA and we may very well be only a few generation apart. We now return you to your regularly scheduled topic.", 
        "threadID": "672198221_5100047222001", 
        "time": "2009-05-07 11:13:00", 
        "title": "Dems Shun Specter (stripped of title), Undercut Obama and Reid", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "Not a problem. he'll vote with the Democratic majority on all important issues. Not a problem at all. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090507, 
        "postID": 12, 
        "quote": "", 
        "reply": "Not a problem. he'll vote with the Democratic majority on all important issues. Not a problem at all. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_5100047222001", 
        "time": "2009-05-07 11:42:00", 
        "title": "Dems Shun Specter (stripped of title), Undercut Obama and Reid", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Actually, he started his career in Politics as a Democrat, even ran as Democrat on a republican ticket, and switched parties after he was elected. but this is certainly justice served in this case, for him to lose his political clout in the Senate. And I believe the only way they might even allow him to carry that clout again is IF he is to win re-election.", 
        "intTime": 20090507, 
        "postID": 13, 
        "quote": "", 
        "reply": "Actually, he started his career in Politics as a Democrat, even ran as Democrat on a republican ticket, and switched parties after he was elected. but this is certainly justice served in this case, for him to lose his political clout in the Senate. And I believe the only way they might even allow him to carry that clout again is IF he is to win re-election.", 
        "threadID": "672198221_5100047222001", 
        "time": "2009-05-07 12:18:00", 
        "title": "Dems Shun Specter (stripped of title), Undercut Obama and Reid", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by 3678131: Actually, he started his career in Politics as a Democrat, even ran as Democrat on a republican ticket, and switched parties after he was elected. but this is certainly justice served in this case, for him to lose his political clout in the Senate. And I believe the only way they might even allow him to carry that clout again is IF he is to win re-election. Compromises WILL be, and some even HAVE been made for Spector's situation in his new party. It does make good sense from the Democratic leadership point of view for him to suddenly be placed way ahead of his democratic colligues being that he's new to the Party, and Spector understands it. He's not going to be Republican again, that you can rest assured of. Welcome to the Party Senator Spector. The American people await your experience and wisdom. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090508, 
        "postID": 14, 
        "quote": "Originally posted by 3678131: Actually, he started his career in Politics as a Democrat, even ran as Democrat on a republican ticket, and switched parties after he was elected. but this is certainly justice served in this case, for him to lose his political clout in the Senate. And I believe the only way they might even allow him to carry that clout again is IF he is to win re-election.", 
        "reply": " Compromises WILL be, and some even HAVE been made for Spector's situation in his new party. It does make good sense from the Democratic leadership point of view for him to suddenly be placed way ahead of his democratic colligues being that he's new to the Party, and Spector understands it. He's not going to be Republican again, that you can rest assured of. Welcome to the Party Senator Spector. The American people await your experience and wisdom. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_5100047222001", 
        "time": "2009-05-08 15:59:00", 
        "title": "Dems Shun Specter (stripped of title), Undercut Obama and Reid", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Anbar7: Soon even that allegiance came into question. This week Specter told the New York Times that Republican Norm Coleman should be seated over his Democratic opponent Al Franken, in Minnesota's still disputed Senate race. \"Arlen,\" Reid asked Specter on the Senate floor. \"What's going on here?\" \"I forgot what team I was on,\" Specter replied. That is the part that cracks me up. Another reason to have Terms. They just keep forgetting who they are for and what team they are on...ie the public's side. Funny as all hell!! LOL. I read about him saying that Coleman should be seated, this AFTER he switched sides. LOL Just goes to prove the Democrats aren't lock-step and even allow their members of congress and the senate to think for themselves. Welcome to the Democratic Party Senator Spector. We look forward to you participation in the cause of right. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090508, 
        "postID": 15, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Anbar7: Soon even that allegiance came into question. This week Specter told the New York Times that Republican Norm Coleman should be seated over his Democratic opponent Al Franken, in Minnesota's still disputed Senate race. \"Arlen,\" Reid asked Specter on the Senate floor. \"What's going on here?\" \"I forgot what team I was on,\" Specter replied. That is the part that cracks me up. Another reason to have Terms. They just keep forgetting who they are for and what team they are on...ie the public's side. Funny as all hell!! LOL. I read about him saying that Coleman should be seated, this AFTER he switched sides. LOL", 
        "reply": " Just goes to prove the Democrats aren't lock-step and even allow their members of congress and the senate to think for themselves. Welcome to the Democratic Party Senator Spector. We look forward to you participation in the cause of right. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_5100047222001", 
        "time": "2009-05-08 16:02:00", 
        "title": "Dems Shun Specter (stripped of title), Undercut Obama and Reid", 
        "userID": "jack_flats"
    }, 
    {
        "content": "I'd like to see specter stripped down to his Bozo the clown underwear.", 
        "intTime": 20090508, 
        "postID": 16, 
        "quote": "", 
        "reply": "I'd like to see specter stripped down to his Bozo the clown underwear.", 
        "threadID": "672198221_5100047222001", 
        "time": "2009-05-08 16:36:00", 
        "title": "Dems Shun Specter (stripped of title), Undercut Obama and Reid", 
        "userID": "Duster6"
    }, 
    {
        "content": "A Specter/Obama, love affair! How sweet it is", 
        "intTime": 20090510, 
        "postID": 17, 
        "quote": "", 
        "reply": "A Specter/Obama, love affair! How sweet it is", 
        "threadID": "672198221_5100047222001", 
        "time": "2009-05-10 08:58:00", 
        "title": "Dems Shun Specter (stripped of title), Undercut Obama and Reid", 
        "userID": "EAG154"
    }
]