[
    {
        "content": "RACINE COUNTY — An important new gun-carry ruling has even gun rights advocates seeing imperfection in this state’s gun-carry laws. Tuesday gun rights advocates and top law enforcement officials here were asked to weigh in on Wisconsin Attorney General J.B. Van Hollen’s Monday memo. It stated that openly wearing a holstered gun is not grounds for a disorderly conduct charge. The case involved a West Allis man who was charged with disorderly conduct for openly carrying a gun on his property while planting a tree. The result of Van Hollen’s opinion is that one cannot legally carry a concealed weapon in this state — but bearing one in plain sight is within the law. That doesn’t mean all gun rights supporters are happy with the situation. “I don’t agree with the open carry,” said Jim Schunk, owner of Shooters Sports Center, 4900 6 Mile Road. “I believe you should have to go through a class and get a certification to be able to carry,” said Schunk, a former police officer. But Schunk said he thought Van Hollen’s ruling was sensible under current law. “I think it’s going to push our political system to take a second look at this,” he said. “We’ve got to regulate this somehow.” State Rep. Scott Gunderson, R-Waterford, pointed out that state law forbids concealing a weapon — but says nothing about carrying one openly. “It’s not addressed, so it can’t be illegal,” he said. He said concealed-carry law opponents may have induced the current state of affairs. Gunderson twice worked to pass a concealed-carry bill through the Legislature, but both times Gov. Jim Doyle vetoed it. “It just seems to me if we would have passed concealed carry law, I have a hard time believing we would be at this point today,” Gunderson said. “People are going to have to be a little careful what they wish for.” The sight of a firearm on someone else’s hip may be nerve-wracking for some people, and state Rep. Robin Vos, R-Caledonia commented, “That’s exactly why Wisconsin should allow concealed carry, like 48 other states.” Besides this state, only Illinois forbids carrying a concealed gun. Vos called Van Hollen’s opinion well-researched and well-thought out. Racine County Sheriff Bob Carlson said from now on, if a caller reports someone with a gun, dispatchers will be instructed to ask other questions such as: Is the person agitated, quarreling, or in a place posted against guns? And so on. “I want to avoid any kind of visceral leap toward making an arrest purely on the basis of carrying a firearm,” Carlson said. But he noted that the ruling pertains only to a holstered gun — not one in the hand. Similarly, it’s still illegal to have a gun lying on a car seat, for example. And pointing a gun at someone is “absolutely” illegal, Carlson pointed out. Racine Police Department spokesman Sgt. Bernie Kupper said the ruling will not prevent police from stopping and questioning a person with a firearm. “As long as it’s not accompanied by erratic behavior, they answer the questions truthfully, etc., they may be allowed to go on their way,” Kupper said. “It’s not a get-out-of-jail-free card,” he added. “We can still make investigative stops.” \"http://www.journaltimes.com/articles/2009/04/21/local_news/doc49ee4a286c67b468031272.txt\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090422, 
        "postID": 1, 
        "quote": "", 
        "reply": "RACINE COUNTY — An important new gun-carry ruling has even gun rights advocates seeing imperfection in this state’s gun-carry laws. Tuesday gun rights advocates and top law enforcement officials here were asked to weigh in on Wisconsin Attorney General J.B. Van Hollen’s Monday memo. It stated that openly wearing a holstered gun is not grounds for a disorderly conduct charge. The case involved a West Allis man who was charged with disorderly conduct for openly carrying a gun on his property while planting a tree. The result of Van Hollen’s opinion is that one cannot legally carry a concealed weapon in this state — but bearing one in plain sight is within the law. That doesn’t mean all gun rights supporters are happy with the situation. “I don’t agree with the open carry,” said Jim Schunk, owner of Shooters Sports Center, 4900 6 Mile Road. “I believe you should have to go through a class and get a certification to be able to carry,” said Schunk, a former police officer. But Schunk said he thought Van Hollen’s ruling was sensible under current law. “I think it’s going to push our political system to take a second look at this,” he said. “We’ve got to regulate this somehow.” State Rep. Scott Gunderson, R-Waterford, pointed out that state law forbids concealing a weapon — but says nothing about carrying one openly. “It’s not addressed, so it can’t be illegal,” he said. He said concealed-carry law opponents may have induced the current state of affairs. Gunderson twice worked to pass a concealed-carry bill through the Legislature, but both times Gov. Jim Doyle vetoed it. “It just seems to me if we would have passed concealed carry law, I have a hard time believing we would be at this point today,” Gunderson said. “People are going to have to be a little careful what they wish for.” The sight of a firearm on someone else’s hip may be nerve-wracking for some people, and state Rep. Robin Vos, R-Caledonia commented, “That’s exactly why Wisconsin should allow concealed carry, like 48 other states.” Besides this state, only Illinois forbids carrying a concealed gun. Vos called Van Hollen’s opinion well-researched and well-thought out. Racine County Sheriff Bob Carlson said from now on, if a caller reports someone with a gun, dispatchers will be instructed to ask other questions such as: Is the person agitated, quarreling, or in a place posted against guns? And so on. “I want to avoid any kind of visceral leap toward making an arrest purely on the basis of carrying a firearm,” Carlson said. But he noted that the ruling pertains only to a holstered gun — not one in the hand. Similarly, it’s still illegal to have a gun lying on a car seat, for example. And pointing a gun at someone is “absolutely” illegal, Carlson pointed out. Racine Police Department spokesman Sgt. Bernie Kupper said the ruling will not prevent police from stopping and questioning a person with a firearm. “As long as it’s not accompanied by erratic behavior, they answer the questions truthfully, etc., they may be allowed to go on their way,” Kupper said. “It’s not a get-out-of-jail-free card,” he added. “We can still make investigative stops.” \"http://www.journaltimes.com/articles/2009/04/21/local_news/doc49ee4a286c67b468031272.txt\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7620054122001", 
        "time": "2009-04-22 07:55:00", 
        "title": "Gun-carry ruling means open carry legal, concealed not", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Would those police have graduated from the Wyatt Earp school of leather slapping? Those 'stops' would be interesting to watch. Especially interesting the part about \"they MAY be allowed to go on their way.\" ie 'We wouldn't be stopping ya if ya were innocent.' That mentality could lead to some good oldtime gunfightin'. You're probably safer to leave your 'piece' at home.", 
        "intTime": 20090422, 
        "postID": 2, 
        "quote": "", 
        "reply": "Would those police have graduated from the Wyatt Earp school of leather slapping? Those 'stops' would be interesting to watch. Especially interesting the part about \"they MAY be allowed to go on their way.\" ie 'We wouldn't be stopping ya if ya were innocent.' That mentality could lead to some good oldtime gunfightin'. You're probably safer to leave your 'piece' at home.", 
        "threadID": "672198221_7620054122001", 
        "time": "2009-04-22 08:09:00", 
        "title": "Gun-carry ruling means open carry legal, concealed not", 
        "userID": "popsiq"
    }, 
    {
        "content": "on his own property??? wow the dems are getting real oppressive...", 
        "intTime": 20090422, 
        "postID": 3, 
        "quote": "", 
        "reply": "on his own property??? wow the dems are getting real oppressive...", 
        "threadID": "672198221_7620054122001", 
        "time": "2009-04-22 08:21:00", 
        "title": "Gun-carry ruling means open carry legal, concealed not", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: on his own property??? wow the dems are getting real oppressive... Was there something I missed in the article about the law enforcement officers who charged the West Allis man being democrats?", 
        "intTime": 20090422, 
        "postID": 4, 
        "quote": "Originally posted by outlaws93: on his own property??? wow the dems are getting real oppressive...", 
        "reply": " Was there something I missed in the article about the law enforcement officers who charged the West Allis man being democrats?", 
        "threadID": "672198221_7620054122001", 
        "time": "2009-04-22 08:30:00", 
        "title": "Gun-carry ruling means open carry legal, concealed not", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "yea i guess so... hahhaa", 
        "intTime": 20090422, 
        "postID": 5, 
        "quote": "", 
        "reply": "yea i guess so... hahhaa", 
        "threadID": "672198221_7620054122001", 
        "time": "2009-04-22 08:49:00", 
        "title": "Gun-carry ruling means open carry legal, concealed not", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Racine Police Department spokesman Sgt. Bernie Kupper said the ruling will not prevent police from stopping and questioning a person with a firearm. “As long as it’s not accompanied by erratic behavior, they answer the questions truthfully, etc., they may be allowed to go on their way,” Kupper said. “It’s not a get-out-of-jail-free card,” he added. “We can still make investigative stops.” How can they do that? If carrying a gun is legal stopping someone for that cause seems to be a pretty clear violation of the 4th Amendment.", 
        "intTime": 20090422, 
        "postID": 6, 
        "quote": "Racine Police Department spokesman Sgt. Bernie Kupper said the ruling will not prevent police from stopping and questioning a person with a firearm. “As long as it’s not accompanied by erratic behavior, they answer the questions truthfully, etc., they may be allowed to go on their way,” Kupper said. “It’s not a get-out-of-jail-free card,” he added. “We can still make investigative stops.”", 
        "reply": " How can they do that? If carrying a gun is legal stopping someone for that cause seems to be a pretty clear violation of the 4th Amendment.", 
        "threadID": "672198221_7620054122001", 
        "time": "2009-04-22 09:50:00", 
        "title": "Gun-carry ruling means open carry legal, concealed not", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Racine Police Department spokesman Sgt. Bernie Kupper said the ruling will not prevent police from stopping and questioning a person with a firearm. “As long as it’s not accompanied by erratic behavior, they answer the questions truthfully, etc., they may be allowed to go on their way,” Kupper said. “It’s not a get-out-of-jail-free card,” he added. “We can still make investigative stops.” How can they do that? If carrying a gun is legal stopping someone for that cause seems to be a pretty clear violation of the 4th Amendment. No, officers can stop anybody and ask them questions, they can't do searches and seizures though. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090422, 
        "postID": 7, 
        "quote": "Originally posted by nspreitler: quote: Racine Police Department spokesman Sgt. Bernie Kupper said the ruling will not prevent police from stopping and questioning a person with a firearm. “As long as it’s not accompanied by erratic behavior, they answer the questions truthfully, etc., they may be allowed to go on their way,” Kupper said. “It’s not a get-out-of-jail-free card,” he added. “We can still make investigative stops.” How can they do that? If carrying a gun is legal stopping someone for that cause seems to be a pretty clear violation of the 4th Amendment.", 
        "reply": " No, officers can stop anybody and ask them questions, they can't do searches and seizures though. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7620054122001", 
        "time": "2009-04-22 11:27:00", 
        "title": "Gun-carry ruling means open carry legal, concealed not", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Actually they need a reason and a whim is not one. Refer to \"Terry Stop\".", 
        "intTime": 20090422, 
        "postID": 8, 
        "quote": "", 
        "reply": "Actually they need a reason and a whim is not one. Refer to \"Terry Stop\".", 
        "threadID": "672198221_7620054122001", 
        "time": "2009-04-22 14:06:00", 
        "title": "Gun-carry ruling means open carry legal, concealed not", 
        "userID": "8404_8406_9"
    }, 
    {
        "content": "Lets go out and buy up all the bullets again before it's too late...", 
        "intTime": 20090422, 
        "postID": 9, 
        "quote": "", 
        "reply": "Lets go out and buy up all the bullets again before it's too late...", 
        "threadID": "672198221_7620054122001", 
        "time": "2009-04-22 14:13:00", 
        "title": "Gun-carry ruling means open carry legal, concealed not", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Sounds like a plan.", 
        "intTime": 20090422, 
        "postID": 10, 
        "quote": "", 
        "reply": "Sounds like a plan.", 
        "threadID": "672198221_7620054122001", 
        "time": "2009-04-22 14:21:00", 
        "title": "Gun-carry ruling means open carry legal, concealed not", 
        "userID": "8404_8406_9"
    }
]