[
    {
        "content": "\"Democrats show little appetite for gun control\" \"http://www.adn.com/news/politics/story/709722.html\"", 
        "intTime": 20090311, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"Democrats show little appetite for gun control\" \"http://www.adn.com/news/politics/story/709722.html\"", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 15:40:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Gun control groups are just loaded with Republicans - right?? Wandering and Wondering", 
        "intTime": 20090311, 
        "postID": 2, 
        "quote": "", 
        "reply": "Gun control groups are just loaded with Republicans - right?? Wandering and Wondering", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 15:45:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Gun control groups are just loaded with Republicans - right?? The Nixen appointed head of the Supreme Court said, \"The individuals right to own arms is the biggest fraud ever perpetrated on the Public.\" The Brady Bill was orchestrated by... But yes, overall, Democrats are more likely to be pro gun control than Republicans. On the other hand, their getting nervous about this position. BTW: The Supreme Court, by a unanimous vote refused to hear the appeal of New York City against gun manufacturers - We won another one on a suit orginally started by.... Rudolph Guilliani. Dave", 
        "intTime": 20090311, 
        "postID": 3, 
        "quote": "Originally posted by greywolfghost: Gun control groups are just loaded with Republicans - right??", 
        "reply": " The Nixen appointed head of the Supreme Court said, \"The individuals right to own arms is the biggest fraud ever perpetrated on the Public.\" The Brady Bill was orchestrated by... But yes, overall, Democrats are more likely to be pro gun control than Republicans. On the other hand, their getting nervous about this position. BTW: The Supreme Court, by a unanimous vote refused to hear the appeal of New York City against gun manufacturers - We won another one on a suit orginally started by.... Rudolph Guilliani. Dave", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 16:09:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Gun control groups are just loaded with Republicans - right?? Come on man that's like me saying no Democrats belong to the NRA.", 
        "intTime": 20090311, 
        "postID": 4, 
        "quote": "Originally posted by greywolfghost: Gun control groups are just loaded with Republicans - right??", 
        "reply": " Come on man that's like me saying no Democrats belong to the NRA.", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 16:12:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Both the Third Way's Bennett and Helmke said it may take another major gun crime, like the shootings at Columbine High School or Virginia Tech, to get Congress to act on more ambitious gun control initiatives here's an idea.. instead of attacking guns as the responsable parties, attack the responsable parties. like.. the HIGH cost of Psychiatric care, meds, therapy... uninvolved parents, lack of school discipline, bullies, and plain rotten people? why is it guns, the mindless tools that they are, who are responsible?", 
        "intTime": 20090311, 
        "postID": 5, 
        "quote": "Both the Third Way's Bennett and Helmke said it may take another major gun crime, like the shootings at Columbine High School or Virginia Tech, to get Congress to act on more ambitious gun control initiatives", 
        "reply": " here's an idea.. instead of attacking guns as the responsable parties, attack the responsable parties. like.. the HIGH cost of Psychiatric care, meds, therapy... uninvolved parents, lack of school discipline, bullies, and plain rotten people? why is it guns, the mindless tools that they are, who are responsible?", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 16:24:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: quote: Both the Third Way's Bennett and Helmke said it may take another major gun crime, like the shootings at Columbine High School or Virginia Tech, to get Congress to act on more ambitious gun control initiatives here's an idea.. instead of attacking guns as the responsable parties, attack the responsable parties. like.. the HIGH cost of Psychiatric care, meds, therapy... uninvolved parents, lack of school discipline, bullies, and plain rotten people? why is it guns, the mindless tools that they are, who are responsible? I agree. I'm all for guns. Goan buy me another hand gun soon. Punish the abusers. But once again, myth that dems are anti gun BUSTED.", 
        "intTime": 20090311, 
        "postID": 6, 
        "quote": "Originally posted by Elesso: quote: Both the Third Way's Bennett and Helmke said it may take another major gun crime, like the shootings at Columbine High School or Virginia Tech, to get Congress to act on more ambitious gun control initiatives here's an idea.. instead of attacking guns as the responsable parties, attack the responsable parties. like.. the HIGH cost of Psychiatric care, meds, therapy... uninvolved parents, lack of school discipline, bullies, and plain rotten people? why is it guns, the mindless tools that they are, who are responsible?", 
        "reply": " I agree. I'm all for guns. Goan buy me another hand gun soon. Punish the abusers. But once again, myth that dems are anti gun BUSTED.", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 16:27:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Pooo, dems are the one's that always start gun control initiatives!", 
        "intTime": 20090311, 
        "postID": 7, 
        "quote": "", 
        "reply": "Pooo, dems are the one's that always start gun control initiatives!", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 16:58:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Elesso: quote: Both the Third Way's Bennett and Helmke said it may take another major gun crime, like the shootings at Columbine High School or Virginia Tech, to get Congress to act on more ambitious gun control initiatives here's an idea.. instead of attacking guns as the responsable parties, attack the responsable parties. like.. the HIGH cost of Psychiatric care, meds, therapy... uninvolved parents, lack of school discipline, bullies, and plain rotten people? why is it guns, the mindless tools that they are, who are responsible? I agree. I'm all for guns. Goan buy me another hand gun soon. Punish the abusers. But once again, myth that dems are anti gun BUSTED. Ruger New Model BlackHawk .45 6\" barrel, baught one a couple monthe ago, I realy like it!", 
        "intTime": 20090311, 
        "postID": 8, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Elesso: quote: Both the Third Way's Bennett and Helmke said it may take another major gun crime, like the shootings at Columbine High School or Virginia Tech, to get Congress to act on more ambitious gun control initiatives here's an idea.. instead of attacking guns as the responsable parties, attack the responsable parties. like.. the HIGH cost of Psychiatric care, meds, therapy... uninvolved parents, lack of school discipline, bullies, and plain rotten people? why is it guns, the mindless tools that they are, who are responsible? I agree. I'm all for guns. Goan buy me another hand gun soon. Punish the abusers. But once again, myth that dems are anti gun BUSTED.", 
        "reply": " Ruger New Model BlackHawk .45 6\" barrel, baught one a couple monthe ago, I realy like it!", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 17:06:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "EAG154"
    }, 
    {
        "content": "Looks a little barrel heavy, how's that handle?", 
        "intTime": 20090311, 
        "postID": 9, 
        "quote": "", 
        "reply": "Looks a little barrel heavy, how's that handle?", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 17:21:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: Originally posted by EAG154: Ruger New Model BlackHawk .45 6\" barrel, baught one a couple monthe ago, I realy like it! oooohhhhh... me like-ee...", 
        "intTime": 20090311, 
        "postID": 10, 
        "quote": "Originally posted by EAG154: Ruger New Model BlackHawk .45 6\" barrel, baught one a couple monthe ago, I realy like it!", 
        "reply": " oooohhhhh... me like-ee...", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 17:21:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by JustanotherGI: Looks a little barrel heavy, how's that handle? a bit heavy but the feel is pretty good!", 
        "intTime": 20090312, 
        "postID": 11, 
        "quote": "Originally posted by JustanotherGI: Looks a little barrel heavy, how's that handle?", 
        "reply": " a bit heavy but the feel is pretty good!", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-12 10:01:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "EAG154"
    }, 
    {
        "content": "The CC Bill was voted down in Springfield Illinois yesterday by who else, democrat controlled Chicago. What people don't realize is what Illinoians have known for quite sometime, Chicago style politics and anti-rights politicians are now in charge of YOU!!!! wherever you live within the 50 US states. Get use to it, you had the ignorance to vote them in.", 
        "intTime": 20090312, 
        "postID": 12, 
        "quote": "", 
        "reply": "The CC Bill was voted down in Springfield Illinois yesterday by who else, democrat controlled Chicago. What people don't realize is what Illinoians have known for quite sometime, Chicago style politics and anti-rights politicians are now in charge of YOU!!!! wherever you live within the 50 US states. Get use to it, you had the ignorance to vote them in.", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-12 10:06:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "The Ruger looks good... Might have to check into it. My personal favorite wheelgun atm is my S&W 629, 6\" barrel, stainless, 44 mag, handles like a dream, full power loads for hours on end with minimal felt recoil, I love it. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 13, 
        "quote": "", 
        "reply": "The Ruger looks good... Might have to check into it. My personal favorite wheelgun atm is my S&W 629, 6\" barrel, stainless, 44 mag, handles like a dream, full power loads for hours on end with minimal felt recoil, I love it. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-12 12:22:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "Why is this \"Democrats out to take your guns,\" stuff still making the rounds when the most restrictive gun control legislation proposed right now is coming from 5 Republicans, and it is the Democrats who pigeon holed it? The only thing that is happening right now is that the Chicken Littles have started panic buying and driven the price of firearms through the roof, and the availability of ammunition and reloading supplies to critical low levels... And, the Dems don't have anything to do with it... I bought this IWI Desert Baby Eagle II last month for just over $575 including sales tax. Shot about 250 rounds through it so far. Most accurate .45 acp out of the box I have ever shot...including a Colt Goldcup Match.", 
        "intTime": 20090312, 
        "postID": 14, 
        "quote": "", 
        "reply": "Why is this \"Democrats out to take your guns,\" stuff still making the rounds when the most restrictive gun control legislation proposed right now is coming from 5 Republicans, and it is the Democrats who pigeon holed it? The only thing that is happening right now is that the Chicken Littles have started panic buying and driven the price of firearms through the roof, and the availability of ammunition and reloading supplies to critical low levels... And, the Dems don't have anything to do with it... I bought this IWI Desert Baby Eagle II last month for just over $575 including sales tax. Shot about 250 rounds through it so far. Most accurate .45 acp out of the box I have ever shot...including a Colt Goldcup Match.", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-12 16:24:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by skinman13: Why is this \"Democrats out to take your guns,\" stuff still making the rounds when the most restrictive gun control legislation proposed right now is coming from 5 Republicans, and it is the Democrats who pigeon holed it? The only thing that is happening right now is that the Chicken Littles have started panic buying and driven the price of firearms through the roof, and the availability of ammunition and reloading supplies to critical low levels... And, the Dems don't have anything to do with it... I bought this IWI Desert Baby Eagle II last month for just over $575 including sales tax. Shot about 250 rounds through it so far. Most accurate .45 acp out of the box I have ever shot...including a Colt Goldcup Match. Same reason that \"Republicans are for the troops\" myths abound despite 8 years of evidence. Most people would rather believe a convenient lie than change their opinions based on reality.", 
        "intTime": 20090313, 
        "postID": 15, 
        "quote": "Originally posted by skinman13: Why is this \"Democrats out to take your guns,\" stuff still making the rounds when the most restrictive gun control legislation proposed right now is coming from 5 Republicans, and it is the Democrats who pigeon holed it? The only thing that is happening right now is that the Chicken Littles have started panic buying and driven the price of firearms through the roof, and the availability of ammunition and reloading supplies to critical low levels... And, the Dems don't have anything to do with it... I bought this IWI Desert Baby Eagle II last month for just over $575 including sales tax. Shot about 250 rounds through it so far. Most accurate .45 acp out of the box I have ever shot...including a Colt Goldcup Match.", 
        "reply": " Same reason that \"Republicans are for the troops\" myths abound despite 8 years of evidence. Most people would rather believe a convenient lie than change their opinions based on reality.", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-13 10:18:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by crackerjacks61: quote: Originally posted by Elesso: quote: Both the Third Way's Bennett and Helmke said it may take another major gun crime, like the shootings at Columbine High School or Virginia Tech, to get Congress to act on more ambitious gun control initiatives here's an idea.. instead of attacking guns as the responsable parties, attack the responsable parties. like.. the HIGH cost of Psychiatric care, meds, therapy... uninvolved parents, lack of school discipline, bullies, and plain rotten people? why is it guns, the mindless tools that they are, who are responsible? I agree. I'm all for guns. Goan buy me another hand gun soon. Punish the abusers. But once again, myth that dems are anti gun BUSTED. Ruger New Model BlackHawk .45 6\" barrel, baught one a couple monthe ago, I realy like it! nice i have the .44mag version... well 2 of them one 7.5in the other 10.5in...", 
        "intTime": 20090313, 
        "postID": 16, 
        "quote": "Originally posted by EAG154: quote: Originally posted by crackerjacks61: quote: Originally posted by Elesso: quote: Both the Third Way's Bennett and Helmke said it may take another major gun crime, like the shootings at Columbine High School or Virginia Tech, to get Congress to act on more ambitious gun control initiatives here's an idea.. instead of attacking guns as the responsable parties, attack the responsable parties. like.. the HIGH cost of Psychiatric care, meds, therapy... uninvolved parents, lack of school discipline, bullies, and plain rotten people? why is it guns, the mindless tools that they are, who are responsible? I agree. I'm all for guns. Goan buy me another hand gun soon. Punish the abusers. But once again, myth that dems are anti gun BUSTED. Ruger New Model BlackHawk .45 6\" barrel, baught one a couple monthe ago, I realy like it!", 
        "reply": " nice i have the .44mag version... well 2 of them one 7.5in the other 10.5in...", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-13 10:26:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by JustanotherGI: Looks a little barrel heavy, how's that handle? naa now this bad boy is barrel heavy//..", 
        "intTime": 20090313, 
        "postID": 17, 
        "quote": "Originally posted by JustanotherGI: Looks a little barrel heavy, how's that handle?", 
        "reply": " naa now this bad boy is barrel heavy//..", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-13 10:28:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Same reason that \"Republicans are for the troops\" myths abound despite 8 years of evidence. Most people would rather believe a convenient lie than change their opinions based on reality. I had no idea the military hated Republicans so much. So if your Messiah tells you to round up all those 'bitter small town Americans', will you?", 
        "intTime": 20090313, 
        "postID": 18, 
        "quote": "Same reason that \"Republicans are for the troops\" myths abound despite 8 years of evidence. Most people would rather believe a convenient lie than change their opinions based on reality.", 
        "reply": " I had no idea the military hated Republicans so much. So if your Messiah tells you to round up all those 'bitter small town Americans', will you?", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-13 16:32:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "wowow22222"
    }, 
    {
        "content": "quote: Originally posted by wowow22222: quote: Same reason that \"Republicans are for the troops\" myths abound despite 8 years of evidence. Most people would rather believe a convenient lie than change their opinions based on reality. I had no idea the military hated Republicans so much. So if your Messiah tells you to round up all those 'bitter small town Americans', will you? There are all kinds of people in the military.", 
        "intTime": 20090313, 
        "postID": 19, 
        "quote": "Originally posted by wowow22222: quote: Same reason that \"Republicans are for the troops\" myths abound despite 8 years of evidence. Most people would rather believe a convenient lie than change their opinions based on reality. I had no idea the military hated Republicans so much. So if your Messiah tells you to round up all those 'bitter small town Americans', will you?", 
        "reply": " There are all kinds of people in the military.", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-13 17:25:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by wowow22222: quote: Same reason that \"Republicans are for the troops\" myths abound despite 8 years of evidence. Most people would rather believe a convenient lie than change their opinions based on reality. I had no idea the military hated Republicans so much. So if your Messiah tells you to round up all those 'bitter small town Americans', will you? Who's the Messiah? Dave", 
        "intTime": 20090313, 
        "postID": 20, 
        "quote": "Originally posted by wowow22222: quote: Same reason that \"Republicans are for the troops\" myths abound despite 8 years of evidence. Most people would rather believe a convenient lie than change their opinions based on reality. I had no idea the military hated Republicans so much. So if your Messiah tells you to round up all those 'bitter small town Americans', will you?", 
        "reply": " Who's the Messiah? Dave", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-13 17:29:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "Grachus"
    }, 
    {
        "content": "\"Democrats show little appetite for gun control\" \"http://www.adn.com/news/politics/story/709722.html\"", 
        "intTime": 20090311, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"Democrats show little appetite for gun control\" \"http://www.adn.com/news/politics/story/709722.html\"", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 15:40:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Gun control groups are just loaded with Republicans - right?? Wandering and Wondering", 
        "intTime": 20090311, 
        "postID": 22, 
        "quote": "", 
        "reply": "Gun control groups are just loaded with Republicans - right?? Wandering and Wondering", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 15:45:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Gun control groups are just loaded with Republicans - right?? The Nixen appointed head of the Supreme Court said, \"The individuals right to own arms is the biggest fraud ever perpetrated on the Public.\" The Brady Bill was orchestrated by... But yes, overall, Democrats are more likely to be pro gun control than Republicans. On the other hand, their getting nervous about this position. BTW: The Supreme Court, by a unanimous vote refused to hear the appeal of New York City against gun manufacturers - We won another one on a suit orginally started by.... Rudolph Guilliani. Dave", 
        "intTime": 20090311, 
        "postID": 23, 
        "quote": "Originally posted by greywolfghost: Gun control groups are just loaded with Republicans - right??", 
        "reply": " The Nixen appointed head of the Supreme Court said, \"The individuals right to own arms is the biggest fraud ever perpetrated on the Public.\" The Brady Bill was orchestrated by... But yes, overall, Democrats are more likely to be pro gun control than Republicans. On the other hand, their getting nervous about this position. BTW: The Supreme Court, by a unanimous vote refused to hear the appeal of New York City against gun manufacturers - We won another one on a suit orginally started by.... Rudolph Guilliani. Dave", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 16:09:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by greywolfghost: Gun control groups are just loaded with Republicans - right?? Come on man that's like me saying no Democrats belong to the NRA.", 
        "intTime": 20090311, 
        "postID": 24, 
        "quote": "Originally posted by greywolfghost: Gun control groups are just loaded with Republicans - right??", 
        "reply": " Come on man that's like me saying no Democrats belong to the NRA.", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 16:12:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Both the Third Way's Bennett and Helmke said it may take another major gun crime, like the shootings at Columbine High School or Virginia Tech, to get Congress to act on more ambitious gun control initiatives here's an idea.. instead of attacking guns as the responsable parties, attack the responsable parties. like.. the HIGH cost of Psychiatric care, meds, therapy... uninvolved parents, lack of school discipline, bullies, and plain rotten people? why is it guns, the mindless tools that they are, who are responsible?", 
        "intTime": 20090311, 
        "postID": 25, 
        "quote": "Both the Third Way's Bennett and Helmke said it may take another major gun crime, like the shootings at Columbine High School or Virginia Tech, to get Congress to act on more ambitious gun control initiatives", 
        "reply": " here's an idea.. instead of attacking guns as the responsable parties, attack the responsable parties. like.. the HIGH cost of Psychiatric care, meds, therapy... uninvolved parents, lack of school discipline, bullies, and plain rotten people? why is it guns, the mindless tools that they are, who are responsible?", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 16:24:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: quote: Both the Third Way's Bennett and Helmke said it may take another major gun crime, like the shootings at Columbine High School or Virginia Tech, to get Congress to act on more ambitious gun control initiatives here's an idea.. instead of attacking guns as the responsable parties, attack the responsable parties. like.. the HIGH cost of Psychiatric care, meds, therapy... uninvolved parents, lack of school discipline, bullies, and plain rotten people? why is it guns, the mindless tools that they are, who are responsible? I agree. I'm all for guns. Goan buy me another hand gun soon. Punish the abusers. But once again, myth that dems are anti gun BUSTED.", 
        "intTime": 20090311, 
        "postID": 26, 
        "quote": "Originally posted by Elesso: quote: Both the Third Way's Bennett and Helmke said it may take another major gun crime, like the shootings at Columbine High School or Virginia Tech, to get Congress to act on more ambitious gun control initiatives here's an idea.. instead of attacking guns as the responsable parties, attack the responsable parties. like.. the HIGH cost of Psychiatric care, meds, therapy... uninvolved parents, lack of school discipline, bullies, and plain rotten people? why is it guns, the mindless tools that they are, who are responsible?", 
        "reply": " I agree. I'm all for guns. Goan buy me another hand gun soon. Punish the abusers. But once again, myth that dems are anti gun BUSTED.", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 16:27:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Pooo, dems are the one's that always start gun control initiatives!", 
        "intTime": 20090311, 
        "postID": 27, 
        "quote": "", 
        "reply": "Pooo, dems are the one's that always start gun control initiatives!", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 16:58:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Elesso: quote: Both the Third Way's Bennett and Helmke said it may take another major gun crime, like the shootings at Columbine High School or Virginia Tech, to get Congress to act on more ambitious gun control initiatives here's an idea.. instead of attacking guns as the responsable parties, attack the responsable parties. like.. the HIGH cost of Psychiatric care, meds, therapy... uninvolved parents, lack of school discipline, bullies, and plain rotten people? why is it guns, the mindless tools that they are, who are responsible? I agree. I'm all for guns. Goan buy me another hand gun soon. Punish the abusers. But once again, myth that dems are anti gun BUSTED. Ruger New Model BlackHawk .45 6\" barrel, baught one a couple monthe ago, I realy like it!", 
        "intTime": 20090311, 
        "postID": 28, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Elesso: quote: Both the Third Way's Bennett and Helmke said it may take another major gun crime, like the shootings at Columbine High School or Virginia Tech, to get Congress to act on more ambitious gun control initiatives here's an idea.. instead of attacking guns as the responsable parties, attack the responsable parties. like.. the HIGH cost of Psychiatric care, meds, therapy... uninvolved parents, lack of school discipline, bullies, and plain rotten people? why is it guns, the mindless tools that they are, who are responsible? I agree. I'm all for guns. Goan buy me another hand gun soon. Punish the abusers. But once again, myth that dems are anti gun BUSTED.", 
        "reply": " Ruger New Model BlackHawk .45 6\" barrel, baught one a couple monthe ago, I realy like it!", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 17:06:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "EAG154"
    }, 
    {
        "content": "Looks a little barrel heavy, how's that handle?", 
        "intTime": 20090311, 
        "postID": 29, 
        "quote": "", 
        "reply": "Looks a little barrel heavy, how's that handle?", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 17:21:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: Originally posted by EAG154: Ruger New Model BlackHawk .45 6\" barrel, baught one a couple monthe ago, I realy like it! oooohhhhh... me like-ee...", 
        "intTime": 20090311, 
        "postID": 30, 
        "quote": "Originally posted by EAG154: Ruger New Model BlackHawk .45 6\" barrel, baught one a couple monthe ago, I realy like it!", 
        "reply": " oooohhhhh... me like-ee...", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-11 17:21:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by JustanotherGI: Looks a little barrel heavy, how's that handle? a bit heavy but the feel is pretty good!", 
        "intTime": 20090312, 
        "postID": 31, 
        "quote": "Originally posted by JustanotherGI: Looks a little barrel heavy, how's that handle?", 
        "reply": " a bit heavy but the feel is pretty good!", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-12 10:01:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "EAG154"
    }, 
    {
        "content": "The CC Bill was voted down in Springfield Illinois yesterday by who else, democrat controlled Chicago. What people don't realize is what Illinoians have known for quite sometime, Chicago style politics and anti-rights politicians are now in charge of YOU!!!! wherever you live within the 50 US states. Get use to it, you had the ignorance to vote them in.", 
        "intTime": 20090312, 
        "postID": 32, 
        "quote": "", 
        "reply": "The CC Bill was voted down in Springfield Illinois yesterday by who else, democrat controlled Chicago. What people don't realize is what Illinoians have known for quite sometime, Chicago style politics and anti-rights politicians are now in charge of YOU!!!! wherever you live within the 50 US states. Get use to it, you had the ignorance to vote them in.", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-12 10:06:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "The Ruger looks good... Might have to check into it. My personal favorite wheelgun atm is my S&W 629, 6\" barrel, stainless, 44 mag, handles like a dream, full power loads for hours on end with minimal felt recoil, I love it. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090312, 
        "postID": 33, 
        "quote": "", 
        "reply": "The Ruger looks good... Might have to check into it. My personal favorite wheelgun atm is my S&W 629, 6\" barrel, stainless, 44 mag, handles like a dream, full power loads for hours on end with minimal felt recoil, I love it. “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-12 12:22:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "Why is this \"Democrats out to take your guns,\" stuff still making the rounds when the most restrictive gun control legislation proposed right now is coming from 5 Republicans, and it is the Democrats who pigeon holed it? The only thing that is happening right now is that the Chicken Littles have started panic buying and driven the price of firearms through the roof, and the availability of ammunition and reloading supplies to critical low levels... And, the Dems don't have anything to do with it... I bought this IWI Desert Baby Eagle II last month for just over $575 including sales tax. Shot about 250 rounds through it so far. Most accurate .45 acp out of the box I have ever shot...including a Colt Goldcup Match.", 
        "intTime": 20090312, 
        "postID": 34, 
        "quote": "", 
        "reply": "Why is this \"Democrats out to take your guns,\" stuff still making the rounds when the most restrictive gun control legislation proposed right now is coming from 5 Republicans, and it is the Democrats who pigeon holed it? The only thing that is happening right now is that the Chicken Littles have started panic buying and driven the price of firearms through the roof, and the availability of ammunition and reloading supplies to critical low levels... And, the Dems don't have anything to do with it... I bought this IWI Desert Baby Eagle II last month for just over $575 including sales tax. Shot about 250 rounds through it so far. Most accurate .45 acp out of the box I have ever shot...including a Colt Goldcup Match.", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-12 16:24:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "skinman13"
    }, 
    {
        "content": "quote: Originally posted by skinman13: Why is this \"Democrats out to take your guns,\" stuff still making the rounds when the most restrictive gun control legislation proposed right now is coming from 5 Republicans, and it is the Democrats who pigeon holed it? The only thing that is happening right now is that the Chicken Littles have started panic buying and driven the price of firearms through the roof, and the availability of ammunition and reloading supplies to critical low levels... And, the Dems don't have anything to do with it... I bought this IWI Desert Baby Eagle II last month for just over $575 including sales tax. Shot about 250 rounds through it so far. Most accurate .45 acp out of the box I have ever shot...including a Colt Goldcup Match. Same reason that \"Republicans are for the troops\" myths abound despite 8 years of evidence. Most people would rather believe a convenient lie than change their opinions based on reality.", 
        "intTime": 20090313, 
        "postID": 35, 
        "quote": "Originally posted by skinman13: Why is this \"Democrats out to take your guns,\" stuff still making the rounds when the most restrictive gun control legislation proposed right now is coming from 5 Republicans, and it is the Democrats who pigeon holed it? The only thing that is happening right now is that the Chicken Littles have started panic buying and driven the price of firearms through the roof, and the availability of ammunition and reloading supplies to critical low levels... And, the Dems don't have anything to do with it... I bought this IWI Desert Baby Eagle II last month for just over $575 including sales tax. Shot about 250 rounds through it so far. Most accurate .45 acp out of the box I have ever shot...including a Colt Goldcup Match.", 
        "reply": " Same reason that \"Republicans are for the troops\" myths abound despite 8 years of evidence. Most people would rather believe a convenient lie than change their opinions based on reality.", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-13 10:18:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by crackerjacks61: quote: Originally posted by Elesso: quote: Both the Third Way's Bennett and Helmke said it may take another major gun crime, like the shootings at Columbine High School or Virginia Tech, to get Congress to act on more ambitious gun control initiatives here's an idea.. instead of attacking guns as the responsable parties, attack the responsable parties. like.. the HIGH cost of Psychiatric care, meds, therapy... uninvolved parents, lack of school discipline, bullies, and plain rotten people? why is it guns, the mindless tools that they are, who are responsible? I agree. I'm all for guns. Goan buy me another hand gun soon. Punish the abusers. But once again, myth that dems are anti gun BUSTED. Ruger New Model BlackHawk .45 6\" barrel, baught one a couple monthe ago, I realy like it! nice i have the .44mag version... well 2 of them one 7.5in the other 10.5in...", 
        "intTime": 20090313, 
        "postID": 36, 
        "quote": "Originally posted by EAG154: quote: Originally posted by crackerjacks61: quote: Originally posted by Elesso: quote: Both the Third Way's Bennett and Helmke said it may take another major gun crime, like the shootings at Columbine High School or Virginia Tech, to get Congress to act on more ambitious gun control initiatives here's an idea.. instead of attacking guns as the responsable parties, attack the responsable parties. like.. the HIGH cost of Psychiatric care, meds, therapy... uninvolved parents, lack of school discipline, bullies, and plain rotten people? why is it guns, the mindless tools that they are, who are responsible? I agree. I'm all for guns. Goan buy me another hand gun soon. Punish the abusers. But once again, myth that dems are anti gun BUSTED. Ruger New Model BlackHawk .45 6\" barrel, baught one a couple monthe ago, I realy like it!", 
        "reply": " nice i have the .44mag version... well 2 of them one 7.5in the other 10.5in...", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-13 10:26:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by JustanotherGI: Looks a little barrel heavy, how's that handle? naa now this bad boy is barrel heavy//..", 
        "intTime": 20090313, 
        "postID": 37, 
        "quote": "Originally posted by JustanotherGI: Looks a little barrel heavy, how's that handle?", 
        "reply": " naa now this bad boy is barrel heavy//..", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-13 10:28:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Same reason that \"Republicans are for the troops\" myths abound despite 8 years of evidence. Most people would rather believe a convenient lie than change their opinions based on reality. I had no idea the military hated Republicans so much. So if your Messiah tells you to round up all those 'bitter small town Americans', will you?", 
        "intTime": 20090313, 
        "postID": 38, 
        "quote": "Same reason that \"Republicans are for the troops\" myths abound despite 8 years of evidence. Most people would rather believe a convenient lie than change their opinions based on reality.", 
        "reply": " I had no idea the military hated Republicans so much. So if your Messiah tells you to round up all those 'bitter small town Americans', will you?", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-13 16:32:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "wowow22222"
    }, 
    {
        "content": "quote: Originally posted by wowow22222: quote: Same reason that \"Republicans are for the troops\" myths abound despite 8 years of evidence. Most people would rather believe a convenient lie than change their opinions based on reality. I had no idea the military hated Republicans so much. So if your Messiah tells you to round up all those 'bitter small town Americans', will you? There are all kinds of people in the military.", 
        "intTime": 20090313, 
        "postID": 39, 
        "quote": "Originally posted by wowow22222: quote: Same reason that \"Republicans are for the troops\" myths abound despite 8 years of evidence. Most people would rather believe a convenient lie than change their opinions based on reality. I had no idea the military hated Republicans so much. So if your Messiah tells you to round up all those 'bitter small town Americans', will you?", 
        "reply": " There are all kinds of people in the military.", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-13 17:25:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "Philhelm"
    }, 
    {
        "content": "quote: Originally posted by wowow22222: quote: Same reason that \"Republicans are for the troops\" myths abound despite 8 years of evidence. Most people would rather believe a convenient lie than change their opinions based on reality. I had no idea the military hated Republicans so much. So if your Messiah tells you to round up all those 'bitter small town Americans', will you? Who's the Messiah? Dave", 
        "intTime": 20090313, 
        "postID": 40, 
        "quote": "Originally posted by wowow22222: quote: Same reason that \"Republicans are for the troops\" myths abound despite 8 years of evidence. Most people would rather believe a convenient lie than change their opinions based on reality. I had no idea the military hated Republicans so much. So if your Messiah tells you to round up all those 'bitter small town Americans', will you?", 
        "reply": " Who's the Messiah? Dave", 
        "threadID": "672198221_5250085712001", 
        "time": "2009-03-13 17:29:00", 
        "title": "Democrats Out To Take Your Guns Myth BUSTED", 
        "userID": "Grachus"
    }
]