[
    {
        "content": "quote: BAGHDAD - Iraq's government has recorded 87,215 of its citizens killed since 2005 in violence ranging from catastrophic bombings to execution-style slayings, according to government statistics obtained by The Associated Press that break open one of the most closely guarded secrets of the war. Combined with tallies based on hospital sources and media reports since the beginning of the war and an in-depth review of available evidence by The Associated Press, the figures show that more than 110,600 Iraqis have died in violence since the 2003 U.S.-led invasion. The number is a minimum count of violent deaths. The official who provided the data to the AP, on condition of anonymity because of its sensitivity, estimated the actual number of deaths at 10 to 20 percent higher because of thousands who are still missing and civilians who were buried in the chaos of war without official records. The Health Ministry has tallied death certificates since 2005, and late that year the United Nations began using them - along with hospital and morgue figures - to publicly release casualty counts. But by early 2007, when sectarian violence was putting political pressure on the U.S. and Iraqi governments, the Iraqi numbers disappeared. The United Nations \"repeatedly asked for that cooperation\" to resume but never received a response, U.N. associate spokesman Farhan Haq said Thursday. The data obtained by the AP measure only violent deaths - people killed in attacks such as the shootings, bombings, mortar attacks and beheadings that have ravaged Iraq. It excluded indirect factors such as damage to infrastructure, health care and stress that caused thousands more to die. Authoritative statistics for 2003 and 2004 do not exist. But Iraq Body Count, a private, British-based group, has tallied civilian deaths from media reports and other sources since the war's start. The AP reviewed the Iraq Body Count analysis and confirmed its conclusions by sifting the data and consulting experts. The AP also interviewed experts involved with previous studies, prominent Iraq analysts and provincial and medical officials to determine that the new tally was credible. The AP also added its own tabulation of deaths since Feb. 28, the last date in the Health Ministry count. The three figures add up to more than 110,600 Iraqis who have died in the war. That total generally coincides with the trends reported by reputable surveys, which have been compiled either by tallying deaths reported by international journalists, or by surveying samplings of Iraqi households and extrapolating the numbers. Iraq Body Count's estimate of deaths since the start of the war, excluding police and soldiers, is a range - between 91,466 and 99,861. The numbers show just how traumatic the war has been for Iraq. In a nation of 29 million people, the deaths represent 0.38 percent of the population. Proportionally, that would be like the United States losing 1.2 million people to violence in the four-year period; about 17,000 people are murdered every year in the U.S. Security has improved since the worst years, but almost every person in Iraq has been touched by the violence. \"We have lost everything,\" said Badriya Abbas Jabbar, 54. A 2007 truck bombing targeting a market near her Baghdad home killed three granddaughters, a son and a niece. North of the capital in the city of Baqouba, a mother shrouded in black calls to her three sons from her doorstep. She calls out as if they were alive, but they were killed in April 2007, when Shiite Muslim militiamen barged into their auto parts store and gunned them down because they were Sunni. The Health Ministry figures indicate such violence was tremendously deadly. Of the 87,215 deaths, 59,957 came in 2006 and 2007, when sectarian attacks soared and death squads roamed the streets. The period was marked by catastrophic bombings and execution-style killings. Quantifying the loss has always been difficult. Records were not always compiled centrally, and the brutal insurgency sharply limited on-the-scene reporting. The U.S. military never shared its data. Note that the accurate numbers for 2003 & 2004 are still unknown! Mil.com \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090424, 
        "postID": 1, 
        "quote": "BAGHDAD - Iraq's government has recorded 87,215 of its citizens killed since 2005 in violence ranging from catastrophic bombings to execution-style slayings, according to government statistics obtained by The Associated Press that break open one of the most closely guarded secrets of the war. Combined with tallies based on hospital sources and media reports since the beginning of the war and an in-depth review of available evidence by The Associated Press, the figures show that more than 110,600 Iraqis have died in violence since the 2003 U.S.-led invasion. The number is a minimum count of violent deaths. The official who provided the data to the AP, on condition of anonymity because of its sensitivity, estimated the actual number of deaths at 10 to 20 percent higher because of thousands who are still missing and civilians who were buried in the chaos of war without official records. The Health Ministry has tallied death certificates since 2005, and late that year the United Nations began using them - along with hospital and morgue figures - to publicly release casualty counts. But by early 2007, when sectarian violence was putting political pressure on the U.S. and Iraqi governments, the Iraqi numbers disappeared. The United Nations \"repeatedly asked for that cooperation\" to resume but never received a response, U.N. associate spokesman Farhan Haq said Thursday. The data obtained by the AP measure only violent deaths - people killed in attacks such as the shootings, bombings, mortar attacks and beheadings that have ravaged Iraq. It excluded indirect factors such as damage to infrastructure, health care and stress that caused thousands more to die. Authoritative statistics for 2003 and 2004 do not exist. But Iraq Body Count, a private, British-based group, has tallied civilian deaths from media reports and other sources since the war's start. The AP reviewed the Iraq Body Count analysis and confirmed its conclusions by sifting the data and consulting experts. The AP also interviewed experts involved with previous studies, prominent Iraq analysts and provincial and medical officials to determine that the new tally was credible. The AP also added its own tabulation of deaths since Feb. 28, the last date in the Health Ministry count. The three figures add up to more than 110,600 Iraqis who have died in the war. That total generally coincides with the trends reported by reputable surveys, which have been compiled either by tallying deaths reported by international journalists, or by surveying samplings of Iraqi households and extrapolating the numbers. Iraq Body Count's estimate of deaths since the start of the war, excluding police and soldiers, is a range - between 91,466 and 99,861. The numbers show just how traumatic the war has been for Iraq. In a nation of 29 million people, the deaths represent 0.38 percent of the population. Proportionally, that would be like the United States losing 1.2 million people to violence in the four-year period; about 17,000 people are murdered every year in the U.S. Security has improved since the worst years, but almost every person in Iraq has been touched by the violence. \"We have lost everything,\" said Badriya Abbas Jabbar, 54. A 2007 truck bombing targeting a market near her Baghdad home killed three granddaughters, a son and a niece. North of the capital in the city of Baqouba, a mother shrouded in black calls to her three sons from her doorstep. She calls out as if they were alive, but they were killed in April 2007, when Shiite Muslim militiamen barged into their auto parts store and gunned them down because they were Sunni. The Health Ministry figures indicate such violence was tremendously deadly. Of the 87,215 deaths, 59,957 came in 2006 and 2007, when sectarian attacks soared and death squads roamed the streets. The period was marked by catastrophic bombings and execution-style killings. Quantifying the loss has always been difficult. Records were not always compiled centrally, and the brutal insurgency sharply limited on-the-scene reporting. The U.S. military never shared its data.", 
        "reply": " Note that the accurate numbers for 2003 & 2004 are still unknown! Mil.com \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5500056122001", 
        "time": "2009-04-24 07:50:00", 
        "title": "Tally: 87,215 Iraqis Dead Since 2005", 
        "userID": "NSNN"
    }, 
    {
        "content": "Yes, 2003 and 2004 stil a mystery, but I would guess the overall number, given what we do know, is significantly less than the hundreds of thousands or million plus as some have stated. Regardless, still a lot of people.", 
        "intTime": 20090424, 
        "postID": 2, 
        "quote": "", 
        "reply": "Yes, 2003 and 2004 stil a mystery, but I would guess the overall number, given what we do know, is significantly less than the hundreds of thousands or million plus as some have stated. Regardless, still a lot of people.", 
        "threadID": "672198221_5500056122001", 
        "time": "2009-04-24 10:54:00", 
        "title": "Tally: 87,215 Iraqis Dead Since 2005", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: Yes, 2003 and 2004 stil a mystery, but I would guess the overall number, given what we do know, is significantly less than the hundreds of thousands or million plus as some have stated. Regardless, still a lot of people. I'm surprised they came up with a whole number and not just an estimate. Don't forget the 2 million or so displaced.", 
        "intTime": 20090424, 
        "postID": 3, 
        "quote": "Originally posted by sw614: Yes, 2003 and 2004 stil a mystery, but I would guess the overall number, given what we do know, is significantly less than the hundreds of thousands or million plus as some have stated. Regardless, still a lot of people.", 
        "reply": " I'm surprised they came up with a whole number and not just an estimate. Don't forget the 2 million or so displaced.", 
        "threadID": "672198221_5500056122001", 
        "time": "2009-04-24 14:17:00", 
        "title": "Tally: 87,215 Iraqis Dead Since 2005", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Too bad the Iraqis were too stupid to enjoy the hard fought fruits of freedom, and resorted to killing each other over ethnic disputes. Oh well, what can you do?", 
        "intTime": 20090424, 
        "postID": 4, 
        "quote": "", 
        "reply": "Too bad the Iraqis were too stupid to enjoy the hard fought fruits of freedom, and resorted to killing each other over ethnic disputes. Oh well, what can you do?", 
        "threadID": "672198221_5500056122001", 
        "time": "2009-04-24 14:21:00", 
        "title": "Tally: 87,215 Iraqis Dead Since 2005", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Too bad the Iraqis were too stupid to enjoy the hard fought fruits of freedom, and resorted to killing each other over ethnic disputes. Oh well, what can you do? Anyone who wasn't an idiot knew this was exactly what would happen when we removed Saddam. All the signs were there. I was so happy to be stuck in the middle of it. I'm really glad we could use our military to get involved in something as stupid as a 1,000 year old religious dispute.", 
        "intTime": 20090424, 
        "postID": 5, 
        "quote": "Originally posted by Irwin_R_Schyster: Too bad the Iraqis were too stupid to enjoy the hard fought fruits of freedom, and resorted to killing each other over ethnic disputes. Oh well, what can you do?", 
        "reply": " Anyone who wasn't an idiot knew this was exactly what would happen when we removed Saddam. All the signs were there. I was so happy to be stuck in the middle of it. I'm really glad we could use our military to get involved in something as stupid as a 1,000 year old religious dispute.", 
        "threadID": "672198221_5500056122001", 
        "time": "2009-04-24 14:38:00", 
        "title": "Tally: 87,215 Iraqis Dead Since 2005", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Irwin_R_Schyster: Too bad the Iraqis were too stupid to enjoy the hard fought fruits of freedom, and resorted to killing each other over ethnic disputes. Oh well, what can you do? Anyone who wasn't an idiot knew this was exactly what would happen when we removed Saddam. All the signs were there. I was so happy to be stuck in the middle of it. I'm really glad we could use our military to get involved in something as stupid as a 1,000 year old religious dispute. Yeah I know what you mean, When I was in Mosul, Al Qaim, and Al Asad I recall the countless times we would go marauding through towns and threatening the people to kill themselves or we would... No one made those idiots butcher themselves, so I coud give a RATS ASS how many of them died because the VAST, VAST majority of them died due to their own stupid differences...", 
        "intTime": 20090424, 
        "postID": 6, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Irwin_R_Schyster: Too bad the Iraqis were too stupid to enjoy the hard fought fruits of freedom, and resorted to killing each other over ethnic disputes. Oh well, what can you do? Anyone who wasn't an idiot knew this was exactly what would happen when we removed Saddam. All the signs were there. I was so happy to be stuck in the middle of it. I'm really glad we could use our military to get involved in something as stupid as a 1,000 year old religious dispute.", 
        "reply": " Yeah I know what you mean, When I was in Mosul, Al Qaim, and Al Asad I recall the countless times we would go marauding through towns and threatening the people to kill themselves or we would... No one made those idiots butcher themselves, so I coud give a RATS ASS how many of them died because the VAST, VAST majority of them died due to their own stupid differences...", 
        "threadID": "672198221_5500056122001", 
        "time": "2009-04-24 14:45:00", 
        "title": "Tally: 87,215 Iraqis Dead Since 2005", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Freedom is not free! Instead of Americans dying for Iraqi's freedom, the Iraqi's should be fighting for their own freedom. These people remind me of the Vietnamese. They were content to sit around home and let the Americans do the fighting and dying. Whenever we would drive through a village we would see members of the Vietnamese Army laying in their hammocks and not doing anything.", 
        "intTime": 20090425, 
        "postID": 7, 
        "quote": "", 
        "reply": "Freedom is not free! Instead of Americans dying for Iraqi's freedom, the Iraqi's should be fighting for their own freedom. These people remind me of the Vietnamese. They were content to sit around home and let the Americans do the fighting and dying. Whenever we would drive through a village we would see members of the Vietnamese Army laying in their hammocks and not doing anything.", 
        "threadID": "672198221_5500056122001", 
        "time": "2009-04-25 07:38:00", 
        "title": "Tally: 87,215 Iraqis Dead Since 2005", 
        "userID": "Vanir97"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Yeah I know what you mean, When I was in Mosul, Al Qaim, and Al Asad I recall the countless times we would go marauding through towns and threatening the people to kill themselves or we would... Did you ever stop and talk to one of them so they could tell you how much they didn't trust each other, would never live near one another, and wanted to kill the others? Obviously not. Next time, when you're walking the streets with your head in the clouds talk to a person or two. The Iraqis have no problem telling us how much they dispise and don't trust one another. quote: Originally posted by Irwin_R_Schyster: No one made those idiots butcher themselves, so I coud give a RATS ASS how many of them died because the VAST, VAST majority of them died due to their own stupid differences... Agreed. I could care less, too. It's just that fact that it became our job to stop it and it costs the lives of thousands of our Soldiers that bothers me, that's all.", 
        "intTime": 20090426, 
        "postID": 8, 
        "quote": "Originally posted by Irwin_R_Schyster: Yeah I know what you mean, When I was in Mosul, Al Qaim, and Al Asad I recall the countless times we would go marauding through towns and threatening the people to kill themselves or we would...", 
        "reply": " Did you ever stop and talk to one of them so they could tell you how much they didn't trust each other, would never live near one another, and wanted to kill the others? Obviously not. Next time, when you're walking the streets with your head in the clouds talk to a person or two. The Iraqis have no problem telling us how much they dispise and don't trust one another. quote: Originally posted by Irwin_R_Schyster: No one made those idiots butcher themselves, so I coud give a RATS ASS how many of them died because the VAST, VAST majority of them died due to their own stupid differences... Agreed. I could care less, too. It's just that fact that it became our job to stop it and it costs the lives of thousands of our Soldiers that bothers me, that's all.", 
        "threadID": "672198221_5500056122001", 
        "time": "2009-04-26 06:16:00", 
        "title": "Tally: 87,215 Iraqis Dead Since 2005", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by Vanir97: Freedom is not free! Instead of Americans dying for Iraqi's freedom, the Iraqi's should be fighting for their own freedom. These people remind me of the Vietnamese. They were content to sit around home and let the Americans do the fighting and dying. Whenever we would drive through a village we would see members of the Vietnamese Army laying in their hammocks and not doing anything. And we did the right thing leaving Vietnam and letting it implode on its own. Nothing changed with the exception that we saved the lives of thousands more Americans and billions of dollars. Our mission was to defeat Hussien, which we did. We created Al Queda in Iraq through our own incompetence, then allowed it to grow through negligence, now we are trying to keep it from re-emerging, which is near impossible since these people will always hate each other.", 
        "intTime": 20090426, 
        "postID": 9, 
        "quote": "Originally posted by Vanir97: Freedom is not free! Instead of Americans dying for Iraqi's freedom, the Iraqi's should be fighting for their own freedom. These people remind me of the Vietnamese. They were content to sit around home and let the Americans do the fighting and dying. Whenever we would drive through a village we would see members of the Vietnamese Army laying in their hammocks and not doing anything.", 
        "reply": " And we did the right thing leaving Vietnam and letting it implode on its own. Nothing changed with the exception that we saved the lives of thousands more Americans and billions of dollars. Our mission was to defeat Hussien, which we did. We created Al Queda in Iraq through our own incompetence, then allowed it to grow through negligence, now we are trying to keep it from re-emerging, which is near impossible since these people will always hate each other.", 
        "threadID": "672198221_5500056122001", 
        "time": "2009-04-26 06:24:00", 
        "title": "Tally: 87,215 Iraqis Dead Since 2005", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Vanir97: Freedom is not free! Instead of Americans dying for Iraqi's freedom, the Iraqi's should be fighting for their own freedom. These people remind me of the Vietnamese. They were content to sit around home and let the Americans do the fighting and dying. Whenever we would drive through a village we would see members of the Vietnamese Army laying in their hammocks and not doing anything. And we did the right thing leaving Vietnam and letting it implode on its own. Nothing changed with the exception that we saved the lives of thousands more Americans and billions of dollars. Our mission was to defeat Hussien, which we did. We created Al Queda in Iraq through our own incompetence, then allowed it to grow through negligence, now we are trying to keep it from re-emerging, which is near impossible since these people will always hate each other. They may 'hate' each other, but both sides still blame that on America. The middle east and south Asia are something else that America will have to deal with down the road. Like Vietnam, thety have been killing each other, but that ramped up along with American presence. They still, and will, remember, until some atonement is made. You can't make messes - kill millions or hundreds or tens of thousands and walk away from them unaffected.", 
        "intTime": 20090427, 
        "postID": 10, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Vanir97: Freedom is not free! Instead of Americans dying for Iraqi's freedom, the Iraqi's should be fighting for their own freedom. These people remind me of the Vietnamese. They were content to sit around home and let the Americans do the fighting and dying. Whenever we would drive through a village we would see members of the Vietnamese Army laying in their hammocks and not doing anything. And we did the right thing leaving Vietnam and letting it implode on its own. Nothing changed with the exception that we saved the lives of thousands more Americans and billions of dollars. Our mission was to defeat Hussien, which we did. We created Al Queda in Iraq through our own incompetence, then allowed it to grow through negligence, now we are trying to keep it from re-emerging, which is near impossible since these people will always hate each other.", 
        "reply": " They may 'hate' each other, but both sides still blame that on America. The middle east and south Asia are something else that America will have to deal with down the road. Like Vietnam, thety have been killing each other, but that ramped up along with American presence. They still, and will, remember, until some atonement is made. You can't make messes - kill millions or hundreds or tens of thousands and walk away from them unaffected.", 
        "threadID": "672198221_5500056122001", 
        "time": "2009-04-27 12:30:00", 
        "title": "Tally: 87,215 Iraqis Dead Since 2005", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Too bad the Iraqis were too stupid to enjoy the hard fought fruits of freedom, and resorted to killing each other over ethnic disputes. Oh well, what can you do? The 87 000 dead Iraqis would have preferred a hard fought case of haemorroids to any 'freedom' you think they've gotten. \"Oh well what can you do?\" Shoot yourself first.", 
        "intTime": 20090427, 
        "postID": 11, 
        "quote": "Originally posted by Irwin_R_Schyster: Too bad the Iraqis were too stupid to enjoy the hard fought fruits of freedom, and resorted to killing each other over ethnic disputes. Oh well, what can you do?", 
        "reply": " The 87 000 dead Iraqis would have preferred a hard fought case of haemorroids to any 'freedom' you think they've gotten. \"Oh well what can you do?\" Shoot yourself first.", 
        "threadID": "672198221_5500056122001", 
        "time": "2009-04-27 12:47:00", 
        "title": "Tally: 87,215 Iraqis Dead Since 2005", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Irwin_R_Schyster: Too bad the Iraqis were too stupid to enjoy the hard fought fruits of freedom, and resorted to killing each other over ethnic disputes. Oh well, what can you do? Anyone who wasn't an idiot knew this was exactly what would happen when we removed Saddam. All the signs were there. I was so happy to be stuck in the middle of it. I'm really glad we could use our military to get involved in something as stupid as a 1,000 year old religious dispute. It went on during his reighn, the diffference was HE EXECUTED THEM ALL BE THE HUNDREDS OF THOUSANDS. Try again. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090427, 
        "postID": 12, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Irwin_R_Schyster: Too bad the Iraqis were too stupid to enjoy the hard fought fruits of freedom, and resorted to killing each other over ethnic disputes. Oh well, what can you do? Anyone who wasn't an idiot knew this was exactly what would happen when we removed Saddam. All the signs were there. I was so happy to be stuck in the middle of it. I'm really glad we could use our military to get involved in something as stupid as a 1,000 year old religious dispute.", 
        "reply": " It went on during his reighn, the diffference was HE EXECUTED THEM ALL BE THE HUNDREDS OF THOUSANDS. Try again. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5500056122001", 
        "time": "2009-04-27 13:04:00", 
        "title": "Tally: 87,215 Iraqis Dead Since 2005", 
        "userID": "L0A1"
    }, 
    {
        "content": "When we got there Sadam had already put 3 million Iraqis in mass graves. The Iraqis have an opportunity now but I'm not holding my breath! Religious factions in that part of the world have been killing each other for thousands of years!", 
        "intTime": 20090427, 
        "postID": 13, 
        "quote": "", 
        "reply": "When we got there Sadam had already put 3 million Iraqis in mass graves. The Iraqis have an opportunity now but I'm not holding my breath! Religious factions in that part of the world have been killing each other for thousands of years!", 
        "threadID": "672198221_5500056122001", 
        "time": "2009-04-27 15:17:00", 
        "title": "Tally: 87,215 Iraqis Dead Since 2005", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: When we got there Sadam had already put 3 million Iraqis in mass graves. I find that number hard to believe in a country with a population of 22-23 Million. That would effected each and every iraqi in some form or another and more than likely someone would have taken him out for killing a family member.", 
        "intTime": 20090427, 
        "postID": 14, 
        "quote": "Originally posted by EAG154: When we got there Sadam had already put 3 million Iraqis in mass graves.", 
        "reply": " I find that number hard to believe in a country with a population of 22-23 Million. That would effected each and every iraqi in some form or another and more than likely someone would have taken him out for killing a family member.", 
        "threadID": "672198221_5500056122001", 
        "time": "2009-04-27 15:37:00", 
        "title": "Tally: 87,215 Iraqis Dead Since 2005", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by EAG154: When we got there Sadam had already put 3 million Iraqis in mass graves. The Iraqis have an opportunity now but I'm not holding my breath! Religious factions in that part of the world have been killing each other for thousands of years! ....and they will continue to kill each other until there are none left. Which, BTW, is fine with me. It's when they start killing outside their own asylum that others need to step in. The one unsolvable factor in most of these places is the absolute ignorance of the people. Education doesn't even seem to offer much of an answer either. How many of the Tin Pot dictators of the world have been educated in American or European schools, only to go back home and head up a bloody coup? Some people will never become civilized.", 
        "intTime": 20090427, 
        "postID": 15, 
        "quote": "Originally posted by EAG154: When we got there Sadam had already put 3 million Iraqis in mass graves. The Iraqis have an opportunity now but I'm not holding my breath! Religious factions in that part of the world have been killing each other for thousands of years!", 
        "reply": " ....and they will continue to kill each other until there are none left. Which, BTW, is fine with me. It's when they start killing outside their own asylum that others need to step in. The one unsolvable factor in most of these places is the absolute ignorance of the people. Education doesn't even seem to offer much of an answer either. How many of the Tin Pot dictators of the world have been educated in American or European schools, only to go back home and head up a bloody coup? Some people will never become civilized.", 
        "threadID": "672198221_5500056122001", 
        "time": "2009-04-27 16:13:00", 
        "title": "Tally: 87,215 Iraqis Dead Since 2005", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by EAG154: When we got there Sadam had already put 3 million Iraqis in mass graves. The Iraqis have an opportunity now but I'm not holding my breath! Religious factions in that part of the world have been killing each other for thousands of years! ....and they will continue to kill each other until there are none left. Which, BTW, is fine with me. It's when they start killing outside their own asylum that others need to step in. The one unsolvable factor in most of these places is the absolute ignorance of the people. Education doesn't even seem to offer much of an answer either. How many of the Tin Pot dictators of the world have been educated in American or European schools, only to go back home and head up a bloody coup? Some people will never become civilized. Various totals by different associations. One outfit (Lancet) showed 100,000 dead and a year later 601,000. It's hard to imagine a half of million in one year. Source Iraqi deaths March 2003 to... Iraq Family Health Survey 151,000 violent deaths. June 2006 Lancet survey 601,027 violent deaths out of 654,965 excess deaths. June 2006 Opinion Research Business survey 1,033,000 violent deaths as a result of the conflict. August 2007 Iraq Body Count 91,059 – 99,431 violent civilian deaths as a result of the conflict. February 2009", 
        "intTime": 20090427, 
        "postID": 16, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by EAG154: When we got there Sadam had already put 3 million Iraqis in mass graves. The Iraqis have an opportunity now but I'm not holding my breath! Religious factions in that part of the world have been killing each other for thousands of years! ....and they will continue to kill each other until there are none left. Which, BTW, is fine with me. It's when they start killing outside their own asylum that others need to step in. The one unsolvable factor in most of these places is the absolute ignorance of the people. Education doesn't even seem to offer much of an answer either. How many of the Tin Pot dictators of the world have been educated in American or European schools, only to go back home and head up a bloody coup? Some people will never become civilized.", 
        "reply": " Various totals by different associations. One outfit (Lancet) showed 100,000 dead and a year later 601,000. It's hard to imagine a half of million in one year. Source Iraqi deaths March 2003 to... Iraq Family Health Survey 151,000 violent deaths. June 2006 Lancet survey 601,027 violent deaths out of 654,965 excess deaths. June 2006 Opinion Research Business survey 1,033,000 violent deaths as a result of the conflict. August 2007 Iraq Body Count 91,059 – 99,431 violent civilian deaths as a result of the conflict. February 2009", 
        "threadID": "672198221_5500056122001", 
        "time": "2009-04-27 19:01:00", 
        "title": "Tally: 87,215 Iraqis Dead Since 2005", 
        "userID": "rayevinsonsr"
    }
]