[
    {
        "content": "Former Air Force Secretary Mike Wynne argues below that Defense Secretary Gates’ acquisition decisions last week reflect that the United States is focused so intently on “becoming the armed custodians in two nations, Afghanistan and Iraq” that the country is engaging in a “strategic drawdown.” The F-22 Decision in Perspective On December 3, 2008 (only four days from the anniversary of Pearl Harbor), President-elect Obama argued that as President he “would maintain the strongest military on earth.” The decisions announced last week by Secretary Gates undercut the President’s strategic objective. Instead, the decisions re-enforce the ability of the ability of the US to manage occupation, not to ensure the ability of the United States to protect its global interests. Although the F-22 termination has received significant press, the real issue is that the decisions affecting the power projection forces set in motion a process of reducing the President’s options to protect U.S. interests. The F-22 termination is bundled with a group of decisions – putting on hold amphibious capabilities, next-generation destroyers, pushing the carrier modernization to the right, delaying the bomber modernization, undercutting missile defense and opening up a significant fighter gap – which further reduce the ability of the US to maintain a strategic lead in the development and production of power projection forces for the US and allied forces. We are now entering a period of strategic pause in which others can enhance their ability to undercut the capabilities of the existing power projection forces, while not fearing breakout capabilities delivered by the United States and a general process of further weakening the ability of the US to produce power projection forces The symbolism was stark: the North Koreans launch missiles in our direction, and we respond with a strategic drawdown. I am sure the North Koreans fear the MRAP fleet as a deterrent force; and the Iranians are cringing in their boots about the threat from stability forces. In other words, the F-22 termination is a symbolic decision that forecasts a different approach to our international involvement in the future. The waning of independent action and the rise of consensus action is upon us. The question of it becoming reality becomes the sort of issue that America never debated in the past 70 years. The larger argument that we should be having is how to expand and not contract the sovereign options we offer to the president. Our national interests are being reduced to becoming the armed custodians in two nations, Afghanistan and Iraq. It is our inherent strength in deterrent or global engagement forces that allows us to engage in wars of our choosing; sapping this strength limits our choices or bring to us the agony of a war not of our choosing. More here: \"http://www.dodbuzz.com/2009/04/13/gates-cuts-leading-to-strategic-drawdown-wynne/\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090416, 
        "postID": 1, 
        "quote": "", 
        "reply": "Former Air Force Secretary Mike Wynne argues below that Defense Secretary Gates’ acquisition decisions last week reflect that the United States is focused so intently on “becoming the armed custodians in two nations, Afghanistan and Iraq” that the country is engaging in a “strategic drawdown.” The F-22 Decision in Perspective On December 3, 2008 (only four days from the anniversary of Pearl Harbor), President-elect Obama argued that as President he “would maintain the strongest military on earth.” The decisions announced last week by Secretary Gates undercut the President’s strategic objective. Instead, the decisions re-enforce the ability of the ability of the US to manage occupation, not to ensure the ability of the United States to protect its global interests. Although the F-22 termination has received significant press, the real issue is that the decisions affecting the power projection forces set in motion a process of reducing the President’s options to protect U.S. interests. The F-22 termination is bundled with a group of decisions – putting on hold amphibious capabilities, next-generation destroyers, pushing the carrier modernization to the right, delaying the bomber modernization, undercutting missile defense and opening up a significant fighter gap – which further reduce the ability of the US to maintain a strategic lead in the development and production of power projection forces for the US and allied forces. We are now entering a period of strategic pause in which others can enhance their ability to undercut the capabilities of the existing power projection forces, while not fearing breakout capabilities delivered by the United States and a general process of further weakening the ability of the US to produce power projection forces The symbolism was stark: the North Koreans launch missiles in our direction, and we respond with a strategic drawdown. I am sure the North Koreans fear the MRAP fleet as a deterrent force; and the Iranians are cringing in their boots about the threat from stability forces. In other words, the F-22 termination is a symbolic decision that forecasts a different approach to our international involvement in the future. The waning of independent action and the rise of consensus action is upon us. The question of it becoming reality becomes the sort of issue that America never debated in the past 70 years. The larger argument that we should be having is how to expand and not contract the sovereign options we offer to the president. Our national interests are being reduced to becoming the armed custodians in two nations, Afghanistan and Iraq. It is our inherent strength in deterrent or global engagement forces that allows us to engage in wars of our choosing; sapping this strength limits our choices or bring to us the agony of a war not of our choosing. More here: \"http://www.dodbuzz.com/2009/04/13/gates-cuts-leading-to-strategic-drawdown-wynne/\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4880098022001", 
        "time": "2009-04-16 07:34:00", 
        "title": "Gates Cuts Leading to ‘Strategic Drawdown'?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Former Air Force Secretary Mike Wynne argues below that Defense Secretary Gates’ acquisition decisions last week reflect that the United States is focused so intently on “becoming the armed custodians in two nations, Afghanistan and Iraq” that the country is engaging in a “strategic drawdown.” The F-22 Decision in Perspective On December 3, 2008 (only four days from the anniversary of Pearl Harbor), President-elect Obama argued that as President he “would maintain the strongest military on earth.” The decisions announced last week by Secretary Gates undercut the President’s strategic objective. Instead, the decisions re-enforce the ability of the ability of the US to manage occupation, not to ensure the ability of the United States to protect its global interests. Although the F-22 termination has received significant press, the real issue is that the decisions affecting the power projection forces set in motion a process of reducing the President’s options to protect U.S. interests. The F-22 termination is bundled with a group of decisions – putting on hold amphibious capabilities, next-generation destroyers, pushing the carrier modernization to the right, delaying the bomber modernization, undercutting missile defense and opening up a significant fighter gap – which further reduce the ability of the US to maintain a strategic lead in the development and production of power projection forces for the US and allied forces. We are now entering a period of strategic pause in which others can enhance their ability to undercut the capabilities of the existing power projection forces, while not fearing breakout capabilities delivered by the United States and a general process of further weakening the ability of the US to produce power projection forces The symbolism was stark: the North Koreans launch missiles in our direction, and we respond with a strategic drawdown. I am sure the North Koreans fear the MRAP fleet as a deterrent force; and the Iranians are cringing in their boots about the threat from stability forces. In other words, the F-22 termination is a symbolic decision that forecasts a different approach to our international involvement in the future. The waning of independent action and the rise of consensus action is upon us. The question of it becoming reality becomes the sort of issue that America never debated in the past 70 years. The larger argument that we should be having is how to expand and not contract the sovereign options we offer to the president. Our national interests are being reduced to becoming the armed custodians in two nations, Afghanistan and Iraq. It is our inherent strength in deterrent or global engagement forces that allows us to engage in wars of our choosing; sapping this strength limits our choices or bring to us the agony of a war not of our choosing. More here: \"http://www.dodbuzz.com/2009/04/13/gates-cuts-leading-to-strategic-drawdown-wynne/\" I must admit, I agree much more with Wynne than with Secretary Gates. His whole \"next-war-itis\" thinking will cause us to stagnate. Where does he think the weapons used in ODS, Afghanistan and OIF came from?", 
        "intTime": 20090416, 
        "postID": 2, 
        "quote": "Originally posted by Anbar7: Former Air Force Secretary Mike Wynne argues below that Defense Secretary Gates’ acquisition decisions last week reflect that the United States is focused so intently on “becoming the armed custodians in two nations, Afghanistan and Iraq” that the country is engaging in a “strategic drawdown.” The F-22 Decision in Perspective On December 3, 2008 (only four days from the anniversary of Pearl Harbor), President-elect Obama argued that as President he “would maintain the strongest military on earth.” The decisions announced last week by Secretary Gates undercut the President’s strategic objective. Instead, the decisions re-enforce the ability of the ability of the US to manage occupation, not to ensure the ability of the United States to protect its global interests. Although the F-22 termination has received significant press, the real issue is that the decisions affecting the power projection forces set in motion a process of reducing the President’s options to protect U.S. interests. The F-22 termination is bundled with a group of decisions – putting on hold amphibious capabilities, next-generation destroyers, pushing the carrier modernization to the right, delaying the bomber modernization, undercutting missile defense and opening up a significant fighter gap – which further reduce the ability of the US to maintain a strategic lead in the development and production of power projection forces for the US and allied forces. We are now entering a period of strategic pause in which others can enhance their ability to undercut the capabilities of the existing power projection forces, while not fearing breakout capabilities delivered by the United States and a general process of further weakening the ability of the US to produce power projection forces The symbolism was stark: the North Koreans launch missiles in our direction, and we respond with a strategic drawdown. I am sure the North Koreans fear the MRAP fleet as a deterrent force; and the Iranians are cringing in their boots about the threat from stability forces. In other words, the F-22 termination is a symbolic decision that forecasts a different approach to our international involvement in the future. The waning of independent action and the rise of consensus action is upon us. The question of it becoming reality becomes the sort of issue that America never debated in the past 70 years. The larger argument that we should be having is how to expand and not contract the sovereign options we offer to the president. Our national interests are being reduced to becoming the armed custodians in two nations, Afghanistan and Iraq. It is our inherent strength in deterrent or global engagement forces that allows us to engage in wars of our choosing; sapping this strength limits our choices or bring to us the agony of a war not of our choosing. More here: \"http://www.dodbuzz.com/2009/04/13/gates-cuts-leading-to-strategic-drawdown-wynne/\"", 
        "reply": " I must admit, I agree much more with Wynne than with Secretary Gates. His whole \"next-war-itis\" thinking will cause us to stagnate. Where does he think the weapons used in ODS, Afghanistan and OIF came from?", 
        "threadID": "672198221_4880098022001", 
        "time": "2009-04-16 08:49:00", 
        "title": "Gates Cuts Leading to ‘Strategic Drawdown'?", 
        "userID": "sw614"
    }, 
    {
        "content": "++http://www.esquire.com/the-side/richardson-report/robert-gates-new-defense-budget-041409 This is a good report from the opposite side of the issue: \"When Bob Gates took over as Secretary of Defense at the end of 2006, he stated unequivocally that one of his primary goals would be to improve America's ability to perform in post-war environments — to better fight an insurgency, really. Cognizant that our military might in conventional, big-war capabilities was driving all of our real-time opponents toward pronouncedly asymmetrical, small-wars strategies, Gates decided to end — finally, stemming from the days well before Donald Rumsfeld — the Defense Department's institutional bias against preparing for such \"low-intensity\" scenarios. Low intensity, he understands, has become the all-too-intense norm of modern warfare. When it came to selling that paradigm shift, Gates didn't need to convince the military itself — the ascendant Army and Marine corps have suffered enough casualties to have learned it the hard way. And quite honestly, Gates needn't worry about the defense industry's willingness to follow the money, because Lockheed Martin and L-3 have been snatching up enough blue-chip companies to prove they can spot the Pentagon's future funding spigots. Turns out you can find Gates's biggest antagonists in the halls of Congress, where the battle cry of \"Jobs, jobs, jobs!\" echoes the military's growing embrace of funding for the manpower that'll keep this counter-insurgency movement as successful as it's become. So even amidst all this fighting and dying — neither of which is likely to slow down any time soon — the American military's newest struggle seems to come down to one question: whose economic stabilization package matters more?... ...Gates understands this nuance of modern warfare, too. So he wants to create a home for today's warfighters — the Dances with Wolves guys who get stuck manning those tiny forts in southern Afghanistan. He wants the Pentagon to stop looking down upon them, to stop haphazardly welding so-called \"hillbilly\" armor onto vehicles that lacked such basic protection. He wants America to stop casually trading their lives in the here-and-now fight against real insurgencies for theoretical casualties in dreamed-up, there-and-then fights against, I dunno, the Chinese or something. He wants, ultimately, to show them the money. In response to his \"radical\" vision, Gates is preparing for the Know Nothings — those same national-security figureheads who have long sung his praises from the Capitol — to put him through the meat grinder. He will be dubbed, with all appropriate indirectness, \"naïve\" and \"reckless.\" His opponents, all of whom fear that the loss of home-district defense jobs will ultimately end their congressional careers, will suddenly accuse Gates of disregarding this or that \"disturbing trend.\" Try not to laugh out loud when you spot these security neophytes on TV, spouting absolute nonsense fed to them by staffers smarted-up by Google searches. Most pointedly, Gates will be rhetorically indicted for putting \"America's sons and daughters at risk\" — not today's version, mind you, but some mythical future cohort of starship troopers armed with over-engineered combat systems that we can't possibly afford to buy, much less maintain...\" I do take issue with some of Mr. Wynne's arguments: \"...opening up a significant fighter gap...\" This is downright untrue, since even without a single F-22, we already have the world's premier Air Force. Of coure the fleet is aging, thus the new F-22's. Whenever anyone brings up a \"gap\" it's like a bright flashing light that signals, \"this guy isn't telling the truth\" (exhibit A, Kennedy's criticism of the Eisenhower \"missile gap\", you know, the one that didn't exist). \"...the North Koreans launch missiles in our direction, and we respond with a strategic drawdown. I am sure the North Koreans fear the MRAP fleet as a deterrent force; and the Iranians are cringing in their boots about the threat from stability forces.\" What Mr. Wynne calls a \"response to the NK threat\" was of course nothing of the sort. It was a response to the wars we are currently fighting, the ones that have cost more American lives than any conflict in the past 40 years. Being an Air Force guy, perhaps Mr. Wynne doesn't quite understand what it means to roll around in a humvee with scrap metal welded to it while insurgents try to detonate 155 rounds along the road. I do. Those insurgents pose more of a threat to American lives than do the North Koreans. Mr. Wynne also seems to forget that we have enough nuclear weapons to instantly make North Korea nothing more than a fuzzy memory. THAT is the deterrent, not the MRAP and certainly not the F-22 or any other project that Gates has proposed cuts for. Mr. Wynne's omission of our vast nuclear arsenal got me thinking: How could an Air Force general make such a point about, \"It is our inherent strength in deterrent or global engagement forces that allows us to engage in wars of our choosing...\" without mentioning the actual deterrent? Well this might have something to do with it: \"Michael W. Wynne (born September 4, 1944) is an American business executive and was the 21st United States Secretary of the Air Force. Secretary of Defense Robert Gates asked for and received his resignation (and that of Chief of Staff T. Michael Moseley) on June 5, 2008, in the wake of the 2007 United States Air Force nuclear weapons incident and the mistaken shipment of Minuteman III parts to Taiwan in 2006, followed by an investigation by and a critical report from Admiral Kirkland H. Donald regarding the Minuteman incident.\" It seems there was also some animosity between Gates and Wynne, who later claimed that he was forced out for disagreeing with Gates on the F-22. Look, we all know that America needs to maintain it's superior military edge. But in a bad economic time, with two wars of insurgency, big projects will take hits and what money is left needs to be focused on the people who are in danger. Add to that the fact that we've been fighting mostly small-scale and insurgent wars for the past 50 or so years. Factor in the fact that live in a more globalized world, where our economy depends on China and Russia and vice-versa. And don't forget that two major nuclear powers have never duked it out in a direct war. MAD still applies. This message has been edited. Last edited by: foxred03, Thu 16 April 2009 10:14 AM", 
        "intTime": 20090416, 
        "postID": 3, 
        "quote": "", 
        "reply": "++http://www.esquire.com/the-side/richardson-report/robert-gates-new-defense-budget-041409 This is a good report from the opposite side of the issue: \"When Bob Gates took over as Secretary of Defense at the end of 2006, he stated unequivocally that one of his primary goals would be to improve America's ability to perform in post-war environments — to better fight an insurgency, really. Cognizant that our military might in conventional, big-war capabilities was driving all of our real-time opponents toward pronouncedly asymmetrical, small-wars strategies, Gates decided to end — finally, stemming from the days well before Donald Rumsfeld — the Defense Department's institutional bias against preparing for such \"low-intensity\" scenarios. Low intensity, he understands, has become the all-too-intense norm of modern warfare. When it came to selling that paradigm shift, Gates didn't need to convince the military itself — the ascendant Army and Marine corps have suffered enough casualties to have learned it the hard way. And quite honestly, Gates needn't worry about the defense industry's willingness to follow the money, because Lockheed Martin and L-3 have been snatching up enough blue-chip companies to prove they can spot the Pentagon's future funding spigots. Turns out you can find Gates's biggest antagonists in the halls of Congress, where the battle cry of \"Jobs, jobs, jobs!\" echoes the military's growing embrace of funding for the manpower that'll keep this counter-insurgency movement as successful as it's become. So even amidst all this fighting and dying — neither of which is likely to slow down any time soon — the American military's newest struggle seems to come down to one question: whose economic stabilization package matters more?... ...Gates understands this nuance of modern warfare, too. So he wants to create a home for today's warfighters — the Dances with Wolves guys who get stuck manning those tiny forts in southern Afghanistan. He wants the Pentagon to stop looking down upon them, to stop haphazardly welding so-called \"hillbilly\" armor onto vehicles that lacked such basic protection. He wants America to stop casually trading their lives in the here-and-now fight against real insurgencies for theoretical casualties in dreamed-up, there-and-then fights against, I dunno, the Chinese or something. He wants, ultimately, to show them the money. In response to his \"radical\" vision, Gates is preparing for the Know Nothings — those same national-security figureheads who have long sung his praises from the Capitol — to put him through the meat grinder. He will be dubbed, with all appropriate indirectness, \"naïve\" and \"reckless.\" His opponents, all of whom fear that the loss of home-district defense jobs will ultimately end their congressional careers, will suddenly accuse Gates of disregarding this or that \"disturbing trend.\" Try not to laugh out loud when you spot these security neophytes on TV, spouting absolute nonsense fed to them by staffers smarted-up by Google searches. Most pointedly, Gates will be rhetorically indicted for putting \"America's sons and daughters at risk\" — not today's version, mind you, but some mythical future cohort of starship troopers armed with over-engineered combat systems that we can't possibly afford to buy, much less maintain...\" I do take issue with some of Mr. Wynne's arguments: \"...opening up a significant fighter gap...\" This is downright untrue, since even without a single F-22, we already have the world's premier Air Force. Of coure the fleet is aging, thus the new F-22's. Whenever anyone brings up a \"gap\" it's like a bright flashing light that signals, \"this guy isn't telling the truth\" (exhibit A, Kennedy's criticism of the Eisenhower \"missile gap\", you know, the one that didn't exist). \"...the North Koreans launch missiles in our direction, and we respond with a strategic drawdown. I am sure the North Koreans fear the MRAP fleet as a deterrent force; and the Iranians are cringing in their boots about the threat from stability forces.\" What Mr. Wynne calls a \"response to the NK threat\" was of course nothing of the sort. It was a response to the wars we are currently fighting, the ones that have cost more American lives than any conflict in the past 40 years. Being an Air Force guy, perhaps Mr. Wynne doesn't quite understand what it means to roll around in a humvee with scrap metal welded to it while insurgents try to detonate 155 rounds along the road. I do. Those insurgents pose more of a threat to American lives than do the North Koreans. Mr. Wynne also seems to forget that we have enough nuclear weapons to instantly make North Korea nothing more than a fuzzy memory. THAT is the deterrent, not the MRAP and certainly not the F-22 or any other project that Gates has proposed cuts for. Mr. Wynne's omission of our vast nuclear arsenal got me thinking: How could an Air Force general make such a point about, \"It is our inherent strength in deterrent or global engagement forces that allows us to engage in wars of our choosing...\" without mentioning the actual deterrent? Well this might have something to do with it: \"Michael W. Wynne (born September 4, 1944) is an American business executive and was the 21st United States Secretary of the Air Force. Secretary of Defense Robert Gates asked for and received his resignation (and that of Chief of Staff T. Michael Moseley) on June 5, 2008, in the wake of the 2007 United States Air Force nuclear weapons incident and the mistaken shipment of Minuteman III parts to Taiwan in 2006, followed by an investigation by and a critical report from Admiral Kirkland H. Donald regarding the Minuteman incident.\" It seems there was also some animosity between Gates and Wynne, who later claimed that he was forced out for disagreeing with Gates on the F-22. Look, we all know that America needs to maintain it's superior military edge. But in a bad economic time, with two wars of insurgency, big projects will take hits and what money is left needs to be focused on the people who are in danger. Add to that the fact that we've been fighting mostly small-scale and insurgent wars for the past 50 or so years. Factor in the fact that live in a more globalized world, where our economy depends on China and Russia and vice-versa. And don't forget that two major nuclear powers have never duked it out in a direct war. MAD still applies. This message has been edited. Last edited by: foxred03, Thu 16 April 2009 10:14 AM", 
        "threadID": "672198221_4880098022001", 
        "time": "2009-04-16 09:52:00", 
        "title": "Gates Cuts Leading to ‘Strategic Drawdown'?", 
        "userID": "foxred03"
    }, 
    {
        "content": "'Armed Custodians\" an apt phrase if one considers Iraq to be some sort of prison and the Iraqis all 'perps' to greater or lesser extents. Gives a new meaning to 'guarding the ramparts of freedom'. On the other hand 'custodians' repair things and keep them in good repair, that can hardly be said about Iraq (or Afghanistan) where the destruct button is still the BIG one on the main console. Last week 57 Iraqis died and 297 were wounded in various breaches of the 'custody' - including 29 of the explosive kind. One executed police chief's body was recovered. 7 American service personnel died and 5 were reported injured. The USAF reported flying 150 armed 'custodianship' missions over Iraq. Most Iraqis might prefer to skip the strategy and get on with the drawdown, the delay is just getting them killed and maimed. This message has been edited. Last edited by: popsiq, Thu 16 April 2009 10:43 AM", 
        "intTime": 20090416, 
        "postID": 4, 
        "quote": "", 
        "reply": "'Armed Custodians\" an apt phrase if one considers Iraq to be some sort of prison and the Iraqis all 'perps' to greater or lesser extents. Gives a new meaning to 'guarding the ramparts of freedom'. On the other hand 'custodians' repair things and keep them in good repair, that can hardly be said about Iraq (or Afghanistan) where the destruct button is still the BIG one on the main console. Last week 57 Iraqis died and 297 were wounded in various breaches of the 'custody' - including 29 of the explosive kind. One executed police chief's body was recovered. 7 American service personnel died and 5 were reported injured. The USAF reported flying 150 armed 'custodianship' missions over Iraq. Most Iraqis might prefer to skip the strategy and get on with the drawdown, the delay is just getting them killed and maimed. This message has been edited. Last edited by: popsiq, Thu 16 April 2009 10:43 AM", 
        "threadID": "672198221_4880098022001", 
        "time": "2009-04-16 10:22:00", 
        "title": "Gates Cuts Leading to ‘Strategic Drawdown'?", 
        "userID": "popsiq"
    }
]