[
    {
        "content": "Well, I don't know how well this is going to help our current administration, but this guy is a scumbag. quote: NEW YORK -- Prosecutors played a voicemail recording of Hillary Rodham Clinton praising a former top Democratic fundraiser on the opening day of a criminal trial to show how he used his connection to powerful politicians to dupe investors in a $20 million fraud. Hong Kong-born Norman Hsu, 58, is charged with making illegal campaign contributions by breaking rules limiting the amount any single individual or group can donate. In the message played in court Tuesday, then-Senator Clinton said Hsu's hard work nearly left her speechless. \"I've never seen anybody who has been more loyal and more effective and really just having greater success supporting someone than you,\" she told him. \"Everywhere I go, you're there. If you're not, you're sending people to be part of my events. You know, we're going to win this campaign, Norman, because you single-handedly are going to make that happen.\" After Hsu's 2007 arrest, Clinton returned more than $800,000 to donors whose contributions were linked to him. He was accused of raising more than $1.2 million for Clinton and other Democratic candidates. His donations became an embarrassment for Clinton's presidential campaign last year. Assistant U.S. Attorney Rua Kelly told the jury in Manhattan that Hsu persuaded others to make thousands of dollars in donations in their names to major Democratic candidates with the understanding that he would reimburse them. One witness, Suzanne Raffaelli, testified that Hsu directed her to make tens of thousands of dollars in donations, including $3,000 in March 2005 to Hope Fund Inc. and $2,500 again in February 2006. She was asked if she knew who the donation was destined for. \"I know now. It is Obama,\" she testified. The testimony came after several other investors recounted how Hsu wowed them by showing off his political connections. Nicole Chorvat, a health care consultant, said she met President Barack Obama, Hillary Clinton, President Bill Clinton, Sen. John Kerry, Sen. Ted Kennedy and Rep. Patrick Kennedy at fundraisers she attended with Hsu. \"They always praised him,\" she said of the politicians she met. She identified herself in a photograph posing with Obama and Hsu at a fancy Beverly Hills, California, restaurant in 2006, before Obama became president. Chorvat said she invested $220,000 with Hsu. \"Here you have these top politicians who are well known, smart, powerful and to have them say wonderful things about him and, you know, talk about how great he is and wonderful, it makes you believe that,\" she said. \"There wasn't one person that said a bad word about him.\" Another investor, Yau Cheng, said she was so impressed that she enticed more than 100 others to join a special fund to invest with Hsu. She said they lost $22 million. She said she later saw photographs at Hsu's apartment of him with numerous famous politicians. Hsu's trial comes just days after he pleaded guilty to 10 counts of wire and mail fraud, admitting that he cheated investors of at least $20 million in a pyramid scheme in which he paid off early investors with the proceeds he collected from later investors. His lawyer, Alan Seidler, tried to use that plea to cast his client, sitting in court in his blue prison uniform, in a more sympathetic light. Seidler said the campaign contributions were made willingly by investors eager to impress Hsu \"because they were greedy and frankly dumb.\" \"These people were blinded by greed,\" Seidler told the jury \"http://www.foxnews.com/politics/2009/05/13/trial-prosecutors-play-tape-clinton-praising-hsu/\" Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090513, 
        "postID": 1, 
        "quote": "NEW YORK -- Prosecutors played a voicemail recording of Hillary Rodham Clinton praising a former top Democratic fundraiser on the opening day of a criminal trial to show how he used his connection to powerful politicians to dupe investors in a $20 million fraud. Hong Kong-born Norman Hsu, 58, is charged with making illegal campaign contributions by breaking rules limiting the amount any single individual or group can donate. In the message played in court Tuesday, then-Senator Clinton said Hsu's hard work nearly left her speechless. \"I've never seen anybody who has been more loyal and more effective and really just having greater success supporting someone than you,\" she told him. \"Everywhere I go, you're there. If you're not, you're sending people to be part of my events. You know, we're going to win this campaign, Norman, because you single-handedly are going to make that happen.\" After Hsu's 2007 arrest, Clinton returned more than $800,000 to donors whose contributions were linked to him. He was accused of raising more than $1.2 million for Clinton and other Democratic candidates. His donations became an embarrassment for Clinton's presidential campaign last year. Assistant U.S. Attorney Rua Kelly told the jury in Manhattan that Hsu persuaded others to make thousands of dollars in donations in their names to major Democratic candidates with the understanding that he would reimburse them. One witness, Suzanne Raffaelli, testified that Hsu directed her to make tens of thousands of dollars in donations, including $3,000 in March 2005 to Hope Fund Inc. and $2,500 again in February 2006. She was asked if she knew who the donation was destined for. \"I know now. It is Obama,\" she testified. The testimony came after several other investors recounted how Hsu wowed them by showing off his political connections. Nicole Chorvat, a health care consultant, said she met President Barack Obama, Hillary Clinton, President Bill Clinton, Sen. John Kerry, Sen. Ted Kennedy and Rep. Patrick Kennedy at fundraisers she attended with Hsu. \"They always praised him,\" she said of the politicians she met. She identified herself in a photograph posing with Obama and Hsu at a fancy Beverly Hills, California, restaurant in 2006, before Obama became president. Chorvat said she invested $220,000 with Hsu. \"Here you have these top politicians who are well known, smart, powerful and to have them say wonderful things about him and, you know, talk about how great he is and wonderful, it makes you believe that,\" she said. \"There wasn't one person that said a bad word about him.\" Another investor, Yau Cheng, said she was so impressed that she enticed more than 100 others to join a special fund to invest with Hsu. She said they lost $22 million. She said she later saw photographs at Hsu's apartment of him with numerous famous politicians. Hsu's trial comes just days after he pleaded guilty to 10 counts of wire and mail fraud, admitting that he cheated investors of at least $20 million in a pyramid scheme in which he paid off early investors with the proceeds he collected from later investors. His lawyer, Alan Seidler, tried to use that plea to cast his client, sitting in court in his blue prison uniform, in a more sympathetic light. Seidler said the campaign contributions were made willingly by investors eager to impress Hsu \"because they were greedy and frankly dumb.\" \"These people were blinded by greed,\" Seidler told the jury", 
        "reply": "Well, I don't know how well this is going to help our current administration, but this guy is a scumbag.  \"http://www.foxnews.com/politics/2009/05/13/trial-prosecutors-play-tape-clinton-praising-hsu/\" Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_1230022322001", 
        "time": "2009-05-13 11:12:00", 
        "title": "Prosecutors Play Tape of Clinton Praising Hsu", 
        "userID": "L0A1"
    }, 
    {
        "content": "dO YOU really expect discussion of Dem. curruption here? Not these days!", 
        "intTime": 20090513, 
        "postID": 2, 
        "quote": "", 
        "reply": "dO YOU really expect discussion of Dem. curruption here? Not these days!", 
        "threadID": "672198221_1230022322001", 
        "time": "2009-05-13 12:30:00", 
        "title": "Prosecutors Play Tape of Clinton Praising Hsu", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: dO YOU really expect discussion of Dem. curruption here? Not these days! This is a whopper though. Even a partisan hack has to condemn this. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090513, 
        "postID": 3, 
        "quote": "Originally posted by peter3_1: dO YOU really expect discussion of Dem. curruption here? Not these days!", 
        "reply": " This is a whopper though. Even a partisan hack has to condemn this. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_1230022322001", 
        "time": "2009-05-13 13:19:00", 
        "title": "Prosecutors Play Tape of Clinton Praising Hsu", 
        "userID": "L0A1"
    }, 
    {
        "content": "wow. Speaking of partisan hacks, never too busy being \"outraged\" by the Obama administration to get in a good word against Hillary, eh?", 
        "intTime": 20090513, 
        "postID": 4, 
        "quote": "", 
        "reply": "wow. Speaking of partisan hacks, never too busy being \"outraged\" by the Obama administration to get in a good word against Hillary, eh?", 
        "threadID": "672198221_1230022322001", 
        "time": "2009-05-13 13:22:00", 
        "title": "Prosecutors Play Tape of Clinton Praising Hsu", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "LOA1, need one say more? Isn't she Sec' of State? Appointed by Mr. Obama? Or am I missing something?", 
        "intTime": 20090513, 
        "postID": 5, 
        "quote": "", 
        "reply": "LOA1, need one say more? Isn't she Sec' of State? Appointed by Mr. Obama? Or am I missing something?", 
        "threadID": "672198221_1230022322001", 
        "time": "2009-05-13 13:28:00", 
        "title": "Prosecutors Play Tape of Clinton Praising Hsu", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: wow. Speaking of partisan hacks, never too busy being \"outraged\" by the Obama administration to get in a good word against Hillary, eh? Are you calling me a partisan hack? If so, your ignorance is showing. I am not in any party and I have posted many POSITIVE things about Obama. So since you can't defend this corruption, you choose to make an OFF TOPIC comment trying to insult me, which I may remind you is a violation of the TOS. If you don't have a constructive post. DON'T POST. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090513, 
        "postID": 6, 
        "quote": "Originally posted by Frank_A_Valdez: wow. Speaking of partisan hacks, never too busy being \"outraged\" by the Obama administration to get in a good word against Hillary, eh?", 
        "reply": " Are you calling me a partisan hack? If so, your ignorance is showing. I am not in any party and I have posted many POSITIVE things about Obama. So since you can't defend this corruption, you choose to make an OFF TOPIC comment trying to insult me, which I may remind you is a violation of the TOS. If you don't have a constructive post. DON'T POST. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_1230022322001", 
        "time": "2009-05-13 13:28:00", 
        "title": "Prosecutors Play Tape of Clinton Praising Hsu", 
        "userID": "L0A1"
    }, 
    {
        "content": "whoa. I don't know why you feel personally attacked every time I post, LOA1, but I'm sincerely sorry you feel that way! BTW, I was commenting on the story (as per the TOS) and not on you.", 
        "intTime": 20090513, 
        "postID": 7, 
        "quote": "", 
        "reply": "whoa. I don't know why you feel personally attacked every time I post, LOA1, but I'm sincerely sorry you feel that way! BTW, I was commenting on the story (as per the TOS) and not on you.", 
        "threadID": "672198221_1230022322001", 
        "time": "2009-05-13 13:40:00", 
        "title": "Prosecutors Play Tape of Clinton Praising Hsu", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: whoa. I don't know why you feel personally attacked every time I post, LOA1, but I'm sincerely sorry you feel that way! BTW, I was commenting on the story (as per the TOS) and not on you. Maybe I misread your type, if so my bad. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090513, 
        "postID": 8, 
        "quote": "Originally posted by Frank_A_Valdez: whoa. I don't know why you feel personally attacked every time I post, LOA1, but I'm sincerely sorry you feel that way! BTW, I was commenting on the story (as per the TOS) and not on you.", 
        "reply": " Maybe I misread your type, if so my bad. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_1230022322001", 
        "time": "2009-05-13 15:17:00", 
        "title": "Prosecutors Play Tape of Clinton Praising Hsu", 
        "userID": "L0A1"
    }
]