[
    {
        "content": "Main thread discussion below: \"defiant North Korea test-fires two more missiles\" thread at the \"North Korea: heating up\" forum section of military.com Please scroll to the latest post on the last page for the latest updates. This message has been edited. Last edited by: Canuck_Centaur, Wed 10 June 2009 06:38 AM", 
        "intTime": 20090526, 
        "postID": 1, 
        "quote": "", 
        "reply": "Main thread discussion below: \"defiant North Korea test-fires two more missiles\" thread at the \"North Korea: heating up\" forum section of military.com Please scroll to the latest post on the last page for the latest updates. This message has been edited. Last edited by: Canuck_Centaur, Wed 10 June 2009 06:38 AM", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 07:09:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left!", 
        "intTime": 20090526, 
        "postID": 2, 
        "quote": "", 
        "reply": "So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left!", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 07:13:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 3, 
        "quote": "", 
        "reply": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 07:17:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "From what I understand, some of these missile launches are over Japanese air space. I think I would have a problem with Canada launching TEST MISSILES (may work, may not) over PA.", 
        "intTime": 20090526, 
        "postID": 4, 
        "quote": "", 
        "reply": "From what I understand, some of these missile launches are over Japanese air space. I think I would have a problem with Canada launching TEST MISSILES (may work, may not) over PA.", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:02:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 5, 
        "quote": "Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left!", 
        "reply": " Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:14:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 6, 
        "quote": "Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws.", 
        "reply": " What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:16:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 7, 
        "quote": "Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it.", 
        "reply": " I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:38:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one……. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 8, 
        "quote": "Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off.", 
        "reply": " I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one……. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:59:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one……. Oh I agree with you there, but even before Obama took office our Government has been doing JUST that with the UN. Either Enforce the resolution or don't bother. That;s what makes the UN impotent. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 9, 
        "quote": "Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one…….", 
        "reply": " Oh I agree with you there, but even before Obama took office our Government has been doing JUST that with the UN. Either Enforce the resolution or don't bother. That;s what makes the UN impotent. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 10:28:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "L0A1"
    }, 
    {
        "content": "Them rockets were 'warblers'. They whistled a new tune \"Hymn to the Glorious Earth-shaking Motherland and to the Leader Who Believes He Is the Soul of the Late Dear Roy Orbison-san\". Listeners in Kyoto reported they sounded like a combination of 'Some Enchanted Evening'and 'In Dreams'. You have to admit those commies can put on a good show, eh?", 
        "intTime": 20090526, 
        "postID": 10, 
        "quote": "", 
        "reply": "Them rockets were 'warblers'. They whistled a new tune \"Hymn to the Glorious Earth-shaking Motherland and to the Leader Who Believes He Is the Soul of the Late Dear Roy Orbison-san\". Listeners in Kyoto reported they sounded like a combination of 'Some Enchanted Evening'and 'In Dreams'. You have to admit those commies can put on a good show, eh?", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 20:33:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "AliBubba"
    }, 
    {
        "content": "Just heard on the TV Morning News that Kim/North Korea has proclaimed that it is no longer bound by the Armistice Treaty signed back in 1953 to end the Korean War - - Hear we go!!! Wandering and Wondering", 
        "intTime": 20090527, 
        "postID": 11, 
        "quote": "", 
        "reply": "Just heard on the TV Morning News that Kim/North Korea has proclaimed that it is no longer bound by the Armistice Treaty signed back in 1953 to end the Korean War - - Hear we go!!! Wandering and Wondering", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 03:37:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 12, 
        "quote": "", 
        "reply": "I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. \"The World's Finest\"", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 04:37:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090527, 
        "postID": 13, 
        "quote": "Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric.", 
        "reply": " WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 05:23:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "Why should North Korea care what the UN thinks?? Heck they have watched Iran snub their nose at the UN for years and NOTHING happen except they get sanctions against them. Those sanctions mean absolutely nothing when you need so called 'international support' to act on anything than speaking out against it. But even then, many within the international community ignore the sanctions and continue to support those leaders anyway.. People want to stick their heads in the sand and believe they are bluffing--but I doubt they are. They can call on Iran, Russia, Venezuela and many others to side with them..", 
        "intTime": 20090527, 
        "postID": 14, 
        "quote": "", 
        "reply": "Why should North Korea care what the UN thinks?? Heck they have watched Iran snub their nose at the UN for years and NOTHING happen except they get sanctions against them. Those sanctions mean absolutely nothing when you need so called 'international support' to act on anything than speaking out against it. But even then, many within the international community ignore the sanctions and continue to support those leaders anyway.. People want to stick their heads in the sand and believe they are bluffing--but I doubt they are. They can call on Iran, Russia, Venezuela and many others to side with them..", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 06:05:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive underground nuclear test, launched a half-dozen missiles, and is now threatening to attack S. Korea. Big difference, my friend. \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 15, 
        "quote": "Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984", 
        "reply": " Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive underground nuclear test, launched a half-dozen missiles, and is now threatening to attack S. Korea. Big difference, my friend. \"The World's Finest\"", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 06:38:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Jong Il has basically nothing to lose and everything to gain by using a couple of his new toys and putting the rest on the auction block to his buddies in iran, etc. we should be very concerned at this point and yet we have heard nothing from the UN or the CINC that would stop this nonsense from escalating. On the bright side,Israel will wipe Iran off the map in a hot minute or two..one less thing for us to have to do, right?", 
        "intTime": 20090527, 
        "postID": 16, 
        "quote": "", 
        "reply": "Jong Il has basically nothing to lose and everything to gain by using a couple of his new toys and putting the rest on the auction block to his buddies in iran, etc. we should be very concerned at this point and yet we have heard nothing from the UN or the CINC that would stop this nonsense from escalating. On the bright side,Israel will wipe Iran off the map in a hot minute or two..one less thing for us to have to do, right?", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 06:43:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive LOLunderground nuclear test, launched a half-dozen missiles two missles, but nice try, and is now threatening to attack S. Korea. show me where they threatened to attack S.K.! Big difference, my friend. Dubya's response was the same (grave concern & condemning) after the first underground test in 2006 & long range missile test(s).....my \"friend\", or did you forget about those? But I guess now you expect Obama to order a full scale invasion (just so you can condemn him for it). quote: Bush condemns North Korea's 'provocative' test By Steve Holland WASHINGTON (Reuters) - President George W. Bush, facing a new election-year foreign policy crisis, condemned North Korea's reported nuclear test on Monday and vowed the United States will respect security commitments in Asia. Speaking about 12 hours after the news broke of North Korea's nuclear test, Bush said he talked by phone with the leaders of China, South Korea, Japan and Russia and all agreed it was unacceptable and deserved an immediate response from the U.N. Security Council +http://thestar.com.my/news/story.asp?file=/2006/10/10/worldupdates/2006-10-09T211009Z_01_NOOTR_RTRJONC_0_-271471-2&sec=Worldupdates quote: July 5, 2006 · Calling North Korea's missile tests a provocative act, President Bush and Secretary of State Condoleezza Rice pledge that the United States will rely on six-party talks to deal with the issue. Over the past 24 hours, Pyongyang has gotten the world's attention, as North Korea launched up to seven missiles into the Sea of Japan. One of the missiles was reportedly a long-range type that could potentially reach Alaska. +http://www.npr.org/templates/story/story.php?storyId=5536133 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090527, 
        "postID": 17, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive LOLunderground nuclear test, launched a half-dozen missiles two missles, but nice try, and is now threatening to attack S. Korea. show me where they threatened to attack S.K.! Big difference, my friend.", 
        "reply": " Dubya's response was the same (grave concern & condemning) after the first underground test in 2006 & long range missile test(s).....my \"friend\", or did you forget about those? But I guess now you expect Obama to order a full scale invasion (just so you can condemn him for it). quote: Bush condemns North Korea's 'provocative' test By Steve Holland WASHINGTON (Reuters) - President George W. Bush, facing a new election-year foreign policy crisis, condemned North Korea's reported nuclear test on Monday and vowed the United States will respect security commitments in Asia. Speaking about 12 hours after the news broke of North Korea's nuclear test, Bush said he talked by phone with the leaders of China, South Korea, Japan and Russia and all agreed it was unacceptable and deserved an immediate response from the U.N. Security Council +http://thestar.com.my/news/story.asp?file=/2006/10/10/worldupdates/2006-10-09T211009Z_01_NOOTR_RTRJONC_0_-271471-2&sec=Worldupdates quote: July 5, 2006 · Calling North Korea's missile tests a provocative act, President Bush and Secretary of State Condoleezza Rice pledge that the United States will rely on six-party talks to deal with the issue. Over the past 24 hours, Pyongyang has gotten the world's attention, as North Korea launched up to seven missiles into the Sea of Japan. One of the missiles was reportedly a long-range type that could potentially reach Alaska. +http://www.npr.org/templates/story/story.php?storyId=5536133 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:02:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "have you even watched the news today? jong il said the treaty if null and void and has THREATENED TO ATTACK THE SOUTH....not sure what part of that doesn't sound like,uh...well,a threat...", 
        "intTime": 20090527, 
        "postID": 18, 
        "quote": "", 
        "reply": "have you even watched the news today? jong il said the treaty if null and void and has THREATENED TO ATTACK THE SOUTH....not sure what part of that doesn't sound like,uh...well,a threat...", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:05:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "oh, an obama did order a full scale invasion i would definitely not condemn him for it..after i was able to re-hinge my jaw from amazement, i would get to it.", 
        "intTime": 20090527, 
        "postID": 19, 
        "quote": "", 
        "reply": "oh, an obama did order a full scale invasion i would definitely not condemn him for it..after i was able to re-hinge my jaw from amazement, i would get to it.", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:06:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "that should have read..and if, not \"an\"", 
        "intTime": 20090527, 
        "postID": 20, 
        "quote": "", 
        "reply": "that should have read..and if, not \"an\"", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:07:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "Main thread discussion below: \"defiant North Korea test-fires two more missiles\" thread at the \"North Korea: heating up\" forum section of military.com Please scroll to the latest post on the last page for the latest updates. This message has been edited. Last edited by: Canuck_Centaur, Wed 10 June 2009 06:38 AM", 
        "intTime": 20090526, 
        "postID": 21, 
        "quote": "", 
        "reply": "Main thread discussion below: \"defiant North Korea test-fires two more missiles\" thread at the \"North Korea: heating up\" forum section of military.com Please scroll to the latest post on the last page for the latest updates. This message has been edited. Last edited by: Canuck_Centaur, Wed 10 June 2009 06:38 AM", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 07:09:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left!", 
        "intTime": 20090526, 
        "postID": 22, 
        "quote": "", 
        "reply": "So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left!", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 07:13:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 23, 
        "quote": "", 
        "reply": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 07:17:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "From what I understand, some of these missile launches are over Japanese air space. I think I would have a problem with Canada launching TEST MISSILES (may work, may not) over PA.", 
        "intTime": 20090526, 
        "postID": 24, 
        "quote": "", 
        "reply": "From what I understand, some of these missile launches are over Japanese air space. I think I would have a problem with Canada launching TEST MISSILES (may work, may not) over PA.", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:02:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 25, 
        "quote": "Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left!", 
        "reply": " Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:14:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 26, 
        "quote": "Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws.", 
        "reply": " What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:16:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 27, 
        "quote": "Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it.", 
        "reply": " I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:38:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one……. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 28, 
        "quote": "Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off.", 
        "reply": " I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one……. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:59:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one……. Oh I agree with you there, but even before Obama took office our Government has been doing JUST that with the UN. Either Enforce the resolution or don't bother. That;s what makes the UN impotent. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 29, 
        "quote": "Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one…….", 
        "reply": " Oh I agree with you there, but even before Obama took office our Government has been doing JUST that with the UN. Either Enforce the resolution or don't bother. That;s what makes the UN impotent. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 10:28:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "L0A1"
    }, 
    {
        "content": "Them rockets were 'warblers'. They whistled a new tune \"Hymn to the Glorious Earth-shaking Motherland and to the Leader Who Believes He Is the Soul of the Late Dear Roy Orbison-san\". Listeners in Kyoto reported they sounded like a combination of 'Some Enchanted Evening'and 'In Dreams'. You have to admit those commies can put on a good show, eh?", 
        "intTime": 20090526, 
        "postID": 30, 
        "quote": "", 
        "reply": "Them rockets were 'warblers'. They whistled a new tune \"Hymn to the Glorious Earth-shaking Motherland and to the Leader Who Believes He Is the Soul of the Late Dear Roy Orbison-san\". Listeners in Kyoto reported they sounded like a combination of 'Some Enchanted Evening'and 'In Dreams'. You have to admit those commies can put on a good show, eh?", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 20:33:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "AliBubba"
    }, 
    {
        "content": "Just heard on the TV Morning News that Kim/North Korea has proclaimed that it is no longer bound by the Armistice Treaty signed back in 1953 to end the Korean War - - Hear we go!!! Wandering and Wondering", 
        "intTime": 20090527, 
        "postID": 31, 
        "quote": "", 
        "reply": "Just heard on the TV Morning News that Kim/North Korea has proclaimed that it is no longer bound by the Armistice Treaty signed back in 1953 to end the Korean War - - Hear we go!!! Wandering and Wondering", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 03:37:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 32, 
        "quote": "", 
        "reply": "I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. \"The World's Finest\"", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 04:37:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090527, 
        "postID": 33, 
        "quote": "Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric.", 
        "reply": " WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 05:23:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "Why should North Korea care what the UN thinks?? Heck they have watched Iran snub their nose at the UN for years and NOTHING happen except they get sanctions against them. Those sanctions mean absolutely nothing when you need so called 'international support' to act on anything than speaking out against it. But even then, many within the international community ignore the sanctions and continue to support those leaders anyway.. People want to stick their heads in the sand and believe they are bluffing--but I doubt they are. They can call on Iran, Russia, Venezuela and many others to side with them..", 
        "intTime": 20090527, 
        "postID": 34, 
        "quote": "", 
        "reply": "Why should North Korea care what the UN thinks?? Heck they have watched Iran snub their nose at the UN for years and NOTHING happen except they get sanctions against them. Those sanctions mean absolutely nothing when you need so called 'international support' to act on anything than speaking out against it. But even then, many within the international community ignore the sanctions and continue to support those leaders anyway.. People want to stick their heads in the sand and believe they are bluffing--but I doubt they are. They can call on Iran, Russia, Venezuela and many others to side with them..", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 06:05:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive underground nuclear test, launched a half-dozen missiles, and is now threatening to attack S. Korea. Big difference, my friend. \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 35, 
        "quote": "Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984", 
        "reply": " Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive underground nuclear test, launched a half-dozen missiles, and is now threatening to attack S. Korea. Big difference, my friend. \"The World's Finest\"", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 06:38:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Jong Il has basically nothing to lose and everything to gain by using a couple of his new toys and putting the rest on the auction block to his buddies in iran, etc. we should be very concerned at this point and yet we have heard nothing from the UN or the CINC that would stop this nonsense from escalating. On the bright side,Israel will wipe Iran off the map in a hot minute or two..one less thing for us to have to do, right?", 
        "intTime": 20090527, 
        "postID": 36, 
        "quote": "", 
        "reply": "Jong Il has basically nothing to lose and everything to gain by using a couple of his new toys and putting the rest on the auction block to his buddies in iran, etc. we should be very concerned at this point and yet we have heard nothing from the UN or the CINC that would stop this nonsense from escalating. On the bright side,Israel will wipe Iran off the map in a hot minute or two..one less thing for us to have to do, right?", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 06:43:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive LOLunderground nuclear test, launched a half-dozen missiles two missles, but nice try, and is now threatening to attack S. Korea. show me where they threatened to attack S.K.! Big difference, my friend. Dubya's response was the same (grave concern & condemning) after the first underground test in 2006 & long range missile test(s).....my \"friend\", or did you forget about those? But I guess now you expect Obama to order a full scale invasion (just so you can condemn him for it). quote: Bush condemns North Korea's 'provocative' test By Steve Holland WASHINGTON (Reuters) - President George W. Bush, facing a new election-year foreign policy crisis, condemned North Korea's reported nuclear test on Monday and vowed the United States will respect security commitments in Asia. Speaking about 12 hours after the news broke of North Korea's nuclear test, Bush said he talked by phone with the leaders of China, South Korea, Japan and Russia and all agreed it was unacceptable and deserved an immediate response from the U.N. Security Council +http://thestar.com.my/news/story.asp?file=/2006/10/10/worldupdates/2006-10-09T211009Z_01_NOOTR_RTRJONC_0_-271471-2&sec=Worldupdates quote: July 5, 2006 · Calling North Korea's missile tests a provocative act, President Bush and Secretary of State Condoleezza Rice pledge that the United States will rely on six-party talks to deal with the issue. Over the past 24 hours, Pyongyang has gotten the world's attention, as North Korea launched up to seven missiles into the Sea of Japan. One of the missiles was reportedly a long-range type that could potentially reach Alaska. +http://www.npr.org/templates/story/story.php?storyId=5536133 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090527, 
        "postID": 37, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive LOLunderground nuclear test, launched a half-dozen missiles two missles, but nice try, and is now threatening to attack S. Korea. show me where they threatened to attack S.K.! Big difference, my friend.", 
        "reply": " Dubya's response was the same (grave concern & condemning) after the first underground test in 2006 & long range missile test(s).....my \"friend\", or did you forget about those? But I guess now you expect Obama to order a full scale invasion (just so you can condemn him for it). quote: Bush condemns North Korea's 'provocative' test By Steve Holland WASHINGTON (Reuters) - President George W. Bush, facing a new election-year foreign policy crisis, condemned North Korea's reported nuclear test on Monday and vowed the United States will respect security commitments in Asia. Speaking about 12 hours after the news broke of North Korea's nuclear test, Bush said he talked by phone with the leaders of China, South Korea, Japan and Russia and all agreed it was unacceptable and deserved an immediate response from the U.N. Security Council +http://thestar.com.my/news/story.asp?file=/2006/10/10/worldupdates/2006-10-09T211009Z_01_NOOTR_RTRJONC_0_-271471-2&sec=Worldupdates quote: July 5, 2006 · Calling North Korea's missile tests a provocative act, President Bush and Secretary of State Condoleezza Rice pledge that the United States will rely on six-party talks to deal with the issue. Over the past 24 hours, Pyongyang has gotten the world's attention, as North Korea launched up to seven missiles into the Sea of Japan. One of the missiles was reportedly a long-range type that could potentially reach Alaska. +http://www.npr.org/templates/story/story.php?storyId=5536133 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:02:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "have you even watched the news today? jong il said the treaty if null and void and has THREATENED TO ATTACK THE SOUTH....not sure what part of that doesn't sound like,uh...well,a threat...", 
        "intTime": 20090527, 
        "postID": 38, 
        "quote": "", 
        "reply": "have you even watched the news today? jong il said the treaty if null and void and has THREATENED TO ATTACK THE SOUTH....not sure what part of that doesn't sound like,uh...well,a threat...", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:05:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "oh, an obama did order a full scale invasion i would definitely not condemn him for it..after i was able to re-hinge my jaw from amazement, i would get to it.", 
        "intTime": 20090527, 
        "postID": 39, 
        "quote": "", 
        "reply": "oh, an obama did order a full scale invasion i would definitely not condemn him for it..after i was able to re-hinge my jaw from amazement, i would get to it.", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:06:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "that should have read..and if, not \"an\"", 
        "intTime": 20090527, 
        "postID": 40, 
        "quote": "", 
        "reply": "that should have read..and if, not \"an\"", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:07:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "Main thread discussion below: \"defiant North Korea test-fires two more missiles\" thread at the \"North Korea: heating up\" forum section of military.com Please scroll to the latest post on the last page for the latest updates. This message has been edited. Last edited by: Canuck_Centaur, Wed 10 June 2009 06:38 AM", 
        "intTime": 20090526, 
        "postID": 41, 
        "quote": "", 
        "reply": "Main thread discussion below: \"defiant North Korea test-fires two more missiles\" thread at the \"North Korea: heating up\" forum section of military.com Please scroll to the latest post on the last page for the latest updates. This message has been edited. Last edited by: Canuck_Centaur, Wed 10 June 2009 06:38 AM", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 07:09:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left!", 
        "intTime": 20090526, 
        "postID": 42, 
        "quote": "", 
        "reply": "So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left!", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 07:13:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 43, 
        "quote": "", 
        "reply": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 07:17:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "From what I understand, some of these missile launches are over Japanese air space. I think I would have a problem with Canada launching TEST MISSILES (may work, may not) over PA.", 
        "intTime": 20090526, 
        "postID": 44, 
        "quote": "", 
        "reply": "From what I understand, some of these missile launches are over Japanese air space. I think I would have a problem with Canada launching TEST MISSILES (may work, may not) over PA.", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:02:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 45, 
        "quote": "Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left!", 
        "reply": " Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:14:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 46, 
        "quote": "Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws.", 
        "reply": " What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:16:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 47, 
        "quote": "Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it.", 
        "reply": " I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:38:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one……. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 48, 
        "quote": "Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off.", 
        "reply": " I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one……. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:59:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one……. Oh I agree with you there, but even before Obama took office our Government has been doing JUST that with the UN. Either Enforce the resolution or don't bother. That;s what makes the UN impotent. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 49, 
        "quote": "Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one…….", 
        "reply": " Oh I agree with you there, but even before Obama took office our Government has been doing JUST that with the UN. Either Enforce the resolution or don't bother. That;s what makes the UN impotent. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 10:28:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "L0A1"
    }, 
    {
        "content": "Them rockets were 'warblers'. They whistled a new tune \"Hymn to the Glorious Earth-shaking Motherland and to the Leader Who Believes He Is the Soul of the Late Dear Roy Orbison-san\". Listeners in Kyoto reported they sounded like a combination of 'Some Enchanted Evening'and 'In Dreams'. You have to admit those commies can put on a good show, eh?", 
        "intTime": 20090526, 
        "postID": 50, 
        "quote": "", 
        "reply": "Them rockets were 'warblers'. They whistled a new tune \"Hymn to the Glorious Earth-shaking Motherland and to the Leader Who Believes He Is the Soul of the Late Dear Roy Orbison-san\". Listeners in Kyoto reported they sounded like a combination of 'Some Enchanted Evening'and 'In Dreams'. You have to admit those commies can put on a good show, eh?", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 20:33:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "AliBubba"
    }, 
    {
        "content": "Just heard on the TV Morning News that Kim/North Korea has proclaimed that it is no longer bound by the Armistice Treaty signed back in 1953 to end the Korean War - - Hear we go!!! Wandering and Wondering", 
        "intTime": 20090527, 
        "postID": 51, 
        "quote": "", 
        "reply": "Just heard on the TV Morning News that Kim/North Korea has proclaimed that it is no longer bound by the Armistice Treaty signed back in 1953 to end the Korean War - - Hear we go!!! Wandering and Wondering", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 03:37:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 52, 
        "quote": "", 
        "reply": "I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. \"The World's Finest\"", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 04:37:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090527, 
        "postID": 53, 
        "quote": "Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric.", 
        "reply": " WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 05:23:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "Why should North Korea care what the UN thinks?? Heck they have watched Iran snub their nose at the UN for years and NOTHING happen except they get sanctions against them. Those sanctions mean absolutely nothing when you need so called 'international support' to act on anything than speaking out against it. But even then, many within the international community ignore the sanctions and continue to support those leaders anyway.. People want to stick their heads in the sand and believe they are bluffing--but I doubt they are. They can call on Iran, Russia, Venezuela and many others to side with them..", 
        "intTime": 20090527, 
        "postID": 54, 
        "quote": "", 
        "reply": "Why should North Korea care what the UN thinks?? Heck they have watched Iran snub their nose at the UN for years and NOTHING happen except they get sanctions against them. Those sanctions mean absolutely nothing when you need so called 'international support' to act on anything than speaking out against it. But even then, many within the international community ignore the sanctions and continue to support those leaders anyway.. People want to stick their heads in the sand and believe they are bluffing--but I doubt they are. They can call on Iran, Russia, Venezuela and many others to side with them..", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 06:05:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive underground nuclear test, launched a half-dozen missiles, and is now threatening to attack S. Korea. Big difference, my friend. \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 55, 
        "quote": "Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984", 
        "reply": " Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive underground nuclear test, launched a half-dozen missiles, and is now threatening to attack S. Korea. Big difference, my friend. \"The World's Finest\"", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 06:38:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Jong Il has basically nothing to lose and everything to gain by using a couple of his new toys and putting the rest on the auction block to his buddies in iran, etc. we should be very concerned at this point and yet we have heard nothing from the UN or the CINC that would stop this nonsense from escalating. On the bright side,Israel will wipe Iran off the map in a hot minute or two..one less thing for us to have to do, right?", 
        "intTime": 20090527, 
        "postID": 56, 
        "quote": "", 
        "reply": "Jong Il has basically nothing to lose and everything to gain by using a couple of his new toys and putting the rest on the auction block to his buddies in iran, etc. we should be very concerned at this point and yet we have heard nothing from the UN or the CINC that would stop this nonsense from escalating. On the bright side,Israel will wipe Iran off the map in a hot minute or two..one less thing for us to have to do, right?", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 06:43:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive LOLunderground nuclear test, launched a half-dozen missiles two missles, but nice try, and is now threatening to attack S. Korea. show me where they threatened to attack S.K.! Big difference, my friend. Dubya's response was the same (grave concern & condemning) after the first underground test in 2006 & long range missile test(s).....my \"friend\", or did you forget about those? But I guess now you expect Obama to order a full scale invasion (just so you can condemn him for it). quote: Bush condemns North Korea's 'provocative' test By Steve Holland WASHINGTON (Reuters) - President George W. Bush, facing a new election-year foreign policy crisis, condemned North Korea's reported nuclear test on Monday and vowed the United States will respect security commitments in Asia. Speaking about 12 hours after the news broke of North Korea's nuclear test, Bush said he talked by phone with the leaders of China, South Korea, Japan and Russia and all agreed it was unacceptable and deserved an immediate response from the U.N. Security Council +http://thestar.com.my/news/story.asp?file=/2006/10/10/worldupdates/2006-10-09T211009Z_01_NOOTR_RTRJONC_0_-271471-2&sec=Worldupdates quote: July 5, 2006 · Calling North Korea's missile tests a provocative act, President Bush and Secretary of State Condoleezza Rice pledge that the United States will rely on six-party talks to deal with the issue. Over the past 24 hours, Pyongyang has gotten the world's attention, as North Korea launched up to seven missiles into the Sea of Japan. One of the missiles was reportedly a long-range type that could potentially reach Alaska. +http://www.npr.org/templates/story/story.php?storyId=5536133 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090527, 
        "postID": 57, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive LOLunderground nuclear test, launched a half-dozen missiles two missles, but nice try, and is now threatening to attack S. Korea. show me where they threatened to attack S.K.! Big difference, my friend.", 
        "reply": " Dubya's response was the same (grave concern & condemning) after the first underground test in 2006 & long range missile test(s).....my \"friend\", or did you forget about those? But I guess now you expect Obama to order a full scale invasion (just so you can condemn him for it). quote: Bush condemns North Korea's 'provocative' test By Steve Holland WASHINGTON (Reuters) - President George W. Bush, facing a new election-year foreign policy crisis, condemned North Korea's reported nuclear test on Monday and vowed the United States will respect security commitments in Asia. Speaking about 12 hours after the news broke of North Korea's nuclear test, Bush said he talked by phone with the leaders of China, South Korea, Japan and Russia and all agreed it was unacceptable and deserved an immediate response from the U.N. Security Council +http://thestar.com.my/news/story.asp?file=/2006/10/10/worldupdates/2006-10-09T211009Z_01_NOOTR_RTRJONC_0_-271471-2&sec=Worldupdates quote: July 5, 2006 · Calling North Korea's missile tests a provocative act, President Bush and Secretary of State Condoleezza Rice pledge that the United States will rely on six-party talks to deal with the issue. Over the past 24 hours, Pyongyang has gotten the world's attention, as North Korea launched up to seven missiles into the Sea of Japan. One of the missiles was reportedly a long-range type that could potentially reach Alaska. +http://www.npr.org/templates/story/story.php?storyId=5536133 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:02:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "have you even watched the news today? jong il said the treaty if null and void and has THREATENED TO ATTACK THE SOUTH....not sure what part of that doesn't sound like,uh...well,a threat...", 
        "intTime": 20090527, 
        "postID": 58, 
        "quote": "", 
        "reply": "have you even watched the news today? jong il said the treaty if null and void and has THREATENED TO ATTACK THE SOUTH....not sure what part of that doesn't sound like,uh...well,a threat...", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:05:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "oh, an obama did order a full scale invasion i would definitely not condemn him for it..after i was able to re-hinge my jaw from amazement, i would get to it.", 
        "intTime": 20090527, 
        "postID": 59, 
        "quote": "", 
        "reply": "oh, an obama did order a full scale invasion i would definitely not condemn him for it..after i was able to re-hinge my jaw from amazement, i would get to it.", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:06:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "that should have read..and if, not \"an\"", 
        "intTime": 20090527, 
        "postID": 60, 
        "quote": "", 
        "reply": "that should have read..and if, not \"an\"", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:07:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "Main thread discussion below: \"defiant North Korea test-fires two more missiles\" thread at the \"North Korea: heating up\" forum section of military.com Please scroll to the latest post on the last page for the latest updates. This message has been edited. Last edited by: Canuck_Centaur, Wed 10 June 2009 06:38 AM", 
        "intTime": 20090526, 
        "postID": 61, 
        "quote": "", 
        "reply": "Main thread discussion below: \"defiant North Korea test-fires two more missiles\" thread at the \"North Korea: heating up\" forum section of military.com Please scroll to the latest post on the last page for the latest updates. This message has been edited. Last edited by: Canuck_Centaur, Wed 10 June 2009 06:38 AM", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 07:09:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left!", 
        "intTime": 20090526, 
        "postID": 62, 
        "quote": "", 
        "reply": "So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left!", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 07:13:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 63, 
        "quote": "", 
        "reply": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 07:17:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "From what I understand, some of these missile launches are over Japanese air space. I think I would have a problem with Canada launching TEST MISSILES (may work, may not) over PA.", 
        "intTime": 20090526, 
        "postID": 64, 
        "quote": "", 
        "reply": "From what I understand, some of these missile launches are over Japanese air space. I think I would have a problem with Canada launching TEST MISSILES (may work, may not) over PA.", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:02:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 65, 
        "quote": "Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left!", 
        "reply": " Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:14:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 66, 
        "quote": "Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws.", 
        "reply": " What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:16:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 67, 
        "quote": "Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it.", 
        "reply": " I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:38:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one……. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 68, 
        "quote": "Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off.", 
        "reply": " I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one……. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:59:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one……. Oh I agree with you there, but even before Obama took office our Government has been doing JUST that with the UN. Either Enforce the resolution or don't bother. That;s what makes the UN impotent. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 69, 
        "quote": "Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one…….", 
        "reply": " Oh I agree with you there, but even before Obama took office our Government has been doing JUST that with the UN. Either Enforce the resolution or don't bother. That;s what makes the UN impotent. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 10:28:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "L0A1"
    }, 
    {
        "content": "Them rockets were 'warblers'. They whistled a new tune \"Hymn to the Glorious Earth-shaking Motherland and to the Leader Who Believes He Is the Soul of the Late Dear Roy Orbison-san\". Listeners in Kyoto reported they sounded like a combination of 'Some Enchanted Evening'and 'In Dreams'. You have to admit those commies can put on a good show, eh?", 
        "intTime": 20090526, 
        "postID": 70, 
        "quote": "", 
        "reply": "Them rockets were 'warblers'. They whistled a new tune \"Hymn to the Glorious Earth-shaking Motherland and to the Leader Who Believes He Is the Soul of the Late Dear Roy Orbison-san\". Listeners in Kyoto reported they sounded like a combination of 'Some Enchanted Evening'and 'In Dreams'. You have to admit those commies can put on a good show, eh?", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 20:33:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "AliBubba"
    }, 
    {
        "content": "Just heard on the TV Morning News that Kim/North Korea has proclaimed that it is no longer bound by the Armistice Treaty signed back in 1953 to end the Korean War - - Hear we go!!! Wandering and Wondering", 
        "intTime": 20090527, 
        "postID": 71, 
        "quote": "", 
        "reply": "Just heard on the TV Morning News that Kim/North Korea has proclaimed that it is no longer bound by the Armistice Treaty signed back in 1953 to end the Korean War - - Hear we go!!! Wandering and Wondering", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 03:37:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 72, 
        "quote": "", 
        "reply": "I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. \"The World's Finest\"", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 04:37:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090527, 
        "postID": 73, 
        "quote": "Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric.", 
        "reply": " WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 05:23:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "Why should North Korea care what the UN thinks?? Heck they have watched Iran snub their nose at the UN for years and NOTHING happen except they get sanctions against them. Those sanctions mean absolutely nothing when you need so called 'international support' to act on anything than speaking out against it. But even then, many within the international community ignore the sanctions and continue to support those leaders anyway.. People want to stick their heads in the sand and believe they are bluffing--but I doubt they are. They can call on Iran, Russia, Venezuela and many others to side with them..", 
        "intTime": 20090527, 
        "postID": 74, 
        "quote": "", 
        "reply": "Why should North Korea care what the UN thinks?? Heck they have watched Iran snub their nose at the UN for years and NOTHING happen except they get sanctions against them. Those sanctions mean absolutely nothing when you need so called 'international support' to act on anything than speaking out against it. But even then, many within the international community ignore the sanctions and continue to support those leaders anyway.. People want to stick their heads in the sand and believe they are bluffing--but I doubt they are. They can call on Iran, Russia, Venezuela and many others to side with them..", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 06:05:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive underground nuclear test, launched a half-dozen missiles, and is now threatening to attack S. Korea. Big difference, my friend. \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 75, 
        "quote": "Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984", 
        "reply": " Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive underground nuclear test, launched a half-dozen missiles, and is now threatening to attack S. Korea. Big difference, my friend. \"The World's Finest\"", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 06:38:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Jong Il has basically nothing to lose and everything to gain by using a couple of his new toys and putting the rest on the auction block to his buddies in iran, etc. we should be very concerned at this point and yet we have heard nothing from the UN or the CINC that would stop this nonsense from escalating. On the bright side,Israel will wipe Iran off the map in a hot minute or two..one less thing for us to have to do, right?", 
        "intTime": 20090527, 
        "postID": 76, 
        "quote": "", 
        "reply": "Jong Il has basically nothing to lose and everything to gain by using a couple of his new toys and putting the rest on the auction block to his buddies in iran, etc. we should be very concerned at this point and yet we have heard nothing from the UN or the CINC that would stop this nonsense from escalating. On the bright side,Israel will wipe Iran off the map in a hot minute or two..one less thing for us to have to do, right?", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 06:43:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive LOLunderground nuclear test, launched a half-dozen missiles two missles, but nice try, and is now threatening to attack S. Korea. show me where they threatened to attack S.K.! Big difference, my friend. Dubya's response was the same (grave concern & condemning) after the first underground test in 2006 & long range missile test(s).....my \"friend\", or did you forget about those? But I guess now you expect Obama to order a full scale invasion (just so you can condemn him for it). quote: Bush condemns North Korea's 'provocative' test By Steve Holland WASHINGTON (Reuters) - President George W. Bush, facing a new election-year foreign policy crisis, condemned North Korea's reported nuclear test on Monday and vowed the United States will respect security commitments in Asia. Speaking about 12 hours after the news broke of North Korea's nuclear test, Bush said he talked by phone with the leaders of China, South Korea, Japan and Russia and all agreed it was unacceptable and deserved an immediate response from the U.N. Security Council +http://thestar.com.my/news/story.asp?file=/2006/10/10/worldupdates/2006-10-09T211009Z_01_NOOTR_RTRJONC_0_-271471-2&sec=Worldupdates quote: July 5, 2006 · Calling North Korea's missile tests a provocative act, President Bush and Secretary of State Condoleezza Rice pledge that the United States will rely on six-party talks to deal with the issue. Over the past 24 hours, Pyongyang has gotten the world's attention, as North Korea launched up to seven missiles into the Sea of Japan. One of the missiles was reportedly a long-range type that could potentially reach Alaska. +http://www.npr.org/templates/story/story.php?storyId=5536133 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090527, 
        "postID": 77, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive LOLunderground nuclear test, launched a half-dozen missiles two missles, but nice try, and is now threatening to attack S. Korea. show me where they threatened to attack S.K.! Big difference, my friend.", 
        "reply": " Dubya's response was the same (grave concern & condemning) after the first underground test in 2006 & long range missile test(s).....my \"friend\", or did you forget about those? But I guess now you expect Obama to order a full scale invasion (just so you can condemn him for it). quote: Bush condemns North Korea's 'provocative' test By Steve Holland WASHINGTON (Reuters) - President George W. Bush, facing a new election-year foreign policy crisis, condemned North Korea's reported nuclear test on Monday and vowed the United States will respect security commitments in Asia. Speaking about 12 hours after the news broke of North Korea's nuclear test, Bush said he talked by phone with the leaders of China, South Korea, Japan and Russia and all agreed it was unacceptable and deserved an immediate response from the U.N. Security Council +http://thestar.com.my/news/story.asp?file=/2006/10/10/worldupdates/2006-10-09T211009Z_01_NOOTR_RTRJONC_0_-271471-2&sec=Worldupdates quote: July 5, 2006 · Calling North Korea's missile tests a provocative act, President Bush and Secretary of State Condoleezza Rice pledge that the United States will rely on six-party talks to deal with the issue. Over the past 24 hours, Pyongyang has gotten the world's attention, as North Korea launched up to seven missiles into the Sea of Japan. One of the missiles was reportedly a long-range type that could potentially reach Alaska. +http://www.npr.org/templates/story/story.php?storyId=5536133 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:02:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "have you even watched the news today? jong il said the treaty if null and void and has THREATENED TO ATTACK THE SOUTH....not sure what part of that doesn't sound like,uh...well,a threat...", 
        "intTime": 20090527, 
        "postID": 78, 
        "quote": "", 
        "reply": "have you even watched the news today? jong il said the treaty if null and void and has THREATENED TO ATTACK THE SOUTH....not sure what part of that doesn't sound like,uh...well,a threat...", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:05:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "oh, an obama did order a full scale invasion i would definitely not condemn him for it..after i was able to re-hinge my jaw from amazement, i would get to it.", 
        "intTime": 20090527, 
        "postID": 79, 
        "quote": "", 
        "reply": "oh, an obama did order a full scale invasion i would definitely not condemn him for it..after i was able to re-hinge my jaw from amazement, i would get to it.", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:06:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "that should have read..and if, not \"an\"", 
        "intTime": 20090527, 
        "postID": 80, 
        "quote": "", 
        "reply": "that should have read..and if, not \"an\"", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:07:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "Main thread discussion below: \"defiant North Korea test-fires two more missiles\" thread at the \"North Korea: heating up\" forum section of military.com Please scroll to the latest post on the last page for the latest updates. This message has been edited. Last edited by: Canuck_Centaur, Wed 10 June 2009 06:38 AM", 
        "intTime": 20090526, 
        "postID": 81, 
        "quote": "", 
        "reply": "Main thread discussion below: \"defiant North Korea test-fires two more missiles\" thread at the \"North Korea: heating up\" forum section of military.com Please scroll to the latest post on the last page for the latest updates. This message has been edited. Last edited by: Canuck_Centaur, Wed 10 June 2009 06:38 AM", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 07:09:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left!", 
        "intTime": 20090526, 
        "postID": 82, 
        "quote": "", 
        "reply": "So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left!", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 07:13:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 83, 
        "quote": "", 
        "reply": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 07:17:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "From what I understand, some of these missile launches are over Japanese air space. I think I would have a problem with Canada launching TEST MISSILES (may work, may not) over PA.", 
        "intTime": 20090526, 
        "postID": 84, 
        "quote": "", 
        "reply": "From what I understand, some of these missile launches are over Japanese air space. I think I would have a problem with Canada launching TEST MISSILES (may work, may not) over PA.", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:02:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 85, 
        "quote": "Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left!", 
        "reply": " Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:14:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 86, 
        "quote": "Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws.", 
        "reply": " What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:16:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 87, 
        "quote": "Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it.", 
        "reply": " I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:38:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one……. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 88, 
        "quote": "Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off.", 
        "reply": " I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one……. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:59:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one……. Oh I agree with you there, but even before Obama took office our Government has been doing JUST that with the UN. Either Enforce the resolution or don't bother. That;s what makes the UN impotent. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 89, 
        "quote": "Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one…….", 
        "reply": " Oh I agree with you there, but even before Obama took office our Government has been doing JUST that with the UN. Either Enforce the resolution or don't bother. That;s what makes the UN impotent. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 10:28:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "L0A1"
    }, 
    {
        "content": "Them rockets were 'warblers'. They whistled a new tune \"Hymn to the Glorious Earth-shaking Motherland and to the Leader Who Believes He Is the Soul of the Late Dear Roy Orbison-san\". Listeners in Kyoto reported they sounded like a combination of 'Some Enchanted Evening'and 'In Dreams'. You have to admit those commies can put on a good show, eh?", 
        "intTime": 20090526, 
        "postID": 90, 
        "quote": "", 
        "reply": "Them rockets were 'warblers'. They whistled a new tune \"Hymn to the Glorious Earth-shaking Motherland and to the Leader Who Believes He Is the Soul of the Late Dear Roy Orbison-san\". Listeners in Kyoto reported they sounded like a combination of 'Some Enchanted Evening'and 'In Dreams'. You have to admit those commies can put on a good show, eh?", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 20:33:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "AliBubba"
    }, 
    {
        "content": "Just heard on the TV Morning News that Kim/North Korea has proclaimed that it is no longer bound by the Armistice Treaty signed back in 1953 to end the Korean War - - Hear we go!!! Wandering and Wondering", 
        "intTime": 20090527, 
        "postID": 91, 
        "quote": "", 
        "reply": "Just heard on the TV Morning News that Kim/North Korea has proclaimed that it is no longer bound by the Armistice Treaty signed back in 1953 to end the Korean War - - Hear we go!!! Wandering and Wondering", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 03:37:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 92, 
        "quote": "", 
        "reply": "I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. \"The World's Finest\"", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 04:37:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090527, 
        "postID": 93, 
        "quote": "Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric.", 
        "reply": " WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 05:23:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "Why should North Korea care what the UN thinks?? Heck they have watched Iran snub their nose at the UN for years and NOTHING happen except they get sanctions against them. Those sanctions mean absolutely nothing when you need so called 'international support' to act on anything than speaking out against it. But even then, many within the international community ignore the sanctions and continue to support those leaders anyway.. People want to stick their heads in the sand and believe they are bluffing--but I doubt they are. They can call on Iran, Russia, Venezuela and many others to side with them..", 
        "intTime": 20090527, 
        "postID": 94, 
        "quote": "", 
        "reply": "Why should North Korea care what the UN thinks?? Heck they have watched Iran snub their nose at the UN for years and NOTHING happen except they get sanctions against them. Those sanctions mean absolutely nothing when you need so called 'international support' to act on anything than speaking out against it. But even then, many within the international community ignore the sanctions and continue to support those leaders anyway.. People want to stick their heads in the sand and believe they are bluffing--but I doubt they are. They can call on Iran, Russia, Venezuela and many others to side with them..", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 06:05:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive underground nuclear test, launched a half-dozen missiles, and is now threatening to attack S. Korea. Big difference, my friend. \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 95, 
        "quote": "Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984", 
        "reply": " Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive underground nuclear test, launched a half-dozen missiles, and is now threatening to attack S. Korea. Big difference, my friend. \"The World's Finest\"", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 06:38:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Jong Il has basically nothing to lose and everything to gain by using a couple of his new toys and putting the rest on the auction block to his buddies in iran, etc. we should be very concerned at this point and yet we have heard nothing from the UN or the CINC that would stop this nonsense from escalating. On the bright side,Israel will wipe Iran off the map in a hot minute or two..one less thing for us to have to do, right?", 
        "intTime": 20090527, 
        "postID": 96, 
        "quote": "", 
        "reply": "Jong Il has basically nothing to lose and everything to gain by using a couple of his new toys and putting the rest on the auction block to his buddies in iran, etc. we should be very concerned at this point and yet we have heard nothing from the UN or the CINC that would stop this nonsense from escalating. On the bright side,Israel will wipe Iran off the map in a hot minute or two..one less thing for us to have to do, right?", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 06:43:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive LOLunderground nuclear test, launched a half-dozen missiles two missles, but nice try, and is now threatening to attack S. Korea. show me where they threatened to attack S.K.! Big difference, my friend. Dubya's response was the same (grave concern & condemning) after the first underground test in 2006 & long range missile test(s).....my \"friend\", or did you forget about those? But I guess now you expect Obama to order a full scale invasion (just so you can condemn him for it). quote: Bush condemns North Korea's 'provocative' test By Steve Holland WASHINGTON (Reuters) - President George W. Bush, facing a new election-year foreign policy crisis, condemned North Korea's reported nuclear test on Monday and vowed the United States will respect security commitments in Asia. Speaking about 12 hours after the news broke of North Korea's nuclear test, Bush said he talked by phone with the leaders of China, South Korea, Japan and Russia and all agreed it was unacceptable and deserved an immediate response from the U.N. Security Council +http://thestar.com.my/news/story.asp?file=/2006/10/10/worldupdates/2006-10-09T211009Z_01_NOOTR_RTRJONC_0_-271471-2&sec=Worldupdates quote: July 5, 2006 · Calling North Korea's missile tests a provocative act, President Bush and Secretary of State Condoleezza Rice pledge that the United States will rely on six-party talks to deal with the issue. Over the past 24 hours, Pyongyang has gotten the world's attention, as North Korea launched up to seven missiles into the Sea of Japan. One of the missiles was reportedly a long-range type that could potentially reach Alaska. +http://www.npr.org/templates/story/story.php?storyId=5536133 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090527, 
        "postID": 97, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive LOLunderground nuclear test, launched a half-dozen missiles two missles, but nice try, and is now threatening to attack S. Korea. show me where they threatened to attack S.K.! Big difference, my friend.", 
        "reply": " Dubya's response was the same (grave concern & condemning) after the first underground test in 2006 & long range missile test(s).....my \"friend\", or did you forget about those? But I guess now you expect Obama to order a full scale invasion (just so you can condemn him for it). quote: Bush condemns North Korea's 'provocative' test By Steve Holland WASHINGTON (Reuters) - President George W. Bush, facing a new election-year foreign policy crisis, condemned North Korea's reported nuclear test on Monday and vowed the United States will respect security commitments in Asia. Speaking about 12 hours after the news broke of North Korea's nuclear test, Bush said he talked by phone with the leaders of China, South Korea, Japan and Russia and all agreed it was unacceptable and deserved an immediate response from the U.N. Security Council +http://thestar.com.my/news/story.asp?file=/2006/10/10/worldupdates/2006-10-09T211009Z_01_NOOTR_RTRJONC_0_-271471-2&sec=Worldupdates quote: July 5, 2006 · Calling North Korea's missile tests a provocative act, President Bush and Secretary of State Condoleezza Rice pledge that the United States will rely on six-party talks to deal with the issue. Over the past 24 hours, Pyongyang has gotten the world's attention, as North Korea launched up to seven missiles into the Sea of Japan. One of the missiles was reportedly a long-range type that could potentially reach Alaska. +http://www.npr.org/templates/story/story.php?storyId=5536133 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:02:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "have you even watched the news today? jong il said the treaty if null and void and has THREATENED TO ATTACK THE SOUTH....not sure what part of that doesn't sound like,uh...well,a threat...", 
        "intTime": 20090527, 
        "postID": 98, 
        "quote": "", 
        "reply": "have you even watched the news today? jong il said the treaty if null and void and has THREATENED TO ATTACK THE SOUTH....not sure what part of that doesn't sound like,uh...well,a threat...", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:05:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "oh, an obama did order a full scale invasion i would definitely not condemn him for it..after i was able to re-hinge my jaw from amazement, i would get to it.", 
        "intTime": 20090527, 
        "postID": 99, 
        "quote": "", 
        "reply": "oh, an obama did order a full scale invasion i would definitely not condemn him for it..after i was able to re-hinge my jaw from amazement, i would get to it.", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:06:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "that should have read..and if, not \"an\"", 
        "intTime": 20090527, 
        "postID": 100, 
        "quote": "", 
        "reply": "that should have read..and if, not \"an\"", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:07:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "Main thread discussion below: \"defiant North Korea test-fires two more missiles\" thread at the \"North Korea: heating up\" forum section of military.com Please scroll to the latest post on the last page for the latest updates. This message has been edited. Last edited by: Canuck_Centaur, Wed 10 June 2009 06:38 AM", 
        "intTime": 20090526, 
        "postID": 101, 
        "quote": "", 
        "reply": "Main thread discussion below: \"defiant North Korea test-fires two more missiles\" thread at the \"North Korea: heating up\" forum section of military.com Please scroll to the latest post on the last page for the latest updates. This message has been edited. Last edited by: Canuck_Centaur, Wed 10 June 2009 06:38 AM", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 07:09:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left!", 
        "intTime": 20090526, 
        "postID": 102, 
        "quote": "", 
        "reply": "So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left!", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 07:13:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 103, 
        "quote": "", 
        "reply": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 07:17:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "From what I understand, some of these missile launches are over Japanese air space. I think I would have a problem with Canada launching TEST MISSILES (may work, may not) over PA.", 
        "intTime": 20090526, 
        "postID": 104, 
        "quote": "", 
        "reply": "From what I understand, some of these missile launches are over Japanese air space. I think I would have a problem with Canada launching TEST MISSILES (may work, may not) over PA.", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:02:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 105, 
        "quote": "Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left!", 
        "reply": " Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:14:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 106, 
        "quote": "Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws.", 
        "reply": " What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:16:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 107, 
        "quote": "Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it.", 
        "reply": " I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:38:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one……. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090526, 
        "postID": 108, 
        "quote": "Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off.", 
        "reply": " I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one……. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 09:59:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one……. Oh I agree with you there, but even before Obama took office our Government has been doing JUST that with the UN. Either Enforce the resolution or don't bother. That;s what makes the UN impotent. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 109, 
        "quote": "Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by NSNN: quote: Originally posted by L0A1: quote: Originally posted by mrmixitup: So what? Did they land in another country? Did they kill anyone? Let them launch all the missles they want. If they launch enough aimlessly into the air they won't have any left! Are you for or against international law? If you are for it, then you should be critical of these test since they violate UN laws. What UN law? Also, seriously? Now all of the sudden we are concerned with UN laws? I guess only when others (not part of the exclusive club) break it. I am all for getting out of the UN, I find it useless, but there are many on here that quote them as THE LAW of the land. That was the reason I asked the question. The UN has Resolutions on them now against missle testing of ANY sort. They violated that resolution and will keep doing it until something bad happens. Which may not be long off. I don’t support getting out of UN, but we either abide by all international laws/resolutions or none at all! We can’t cite one resolution as a cause for war, while at the same time breaking another one…….", 
        "reply": " Oh I agree with you there, but even before Obama took office our Government has been doing JUST that with the UN. Either Enforce the resolution or don't bother. That;s what makes the UN impotent. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 10:28:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "L0A1"
    }, 
    {
        "content": "Them rockets were 'warblers'. They whistled a new tune \"Hymn to the Glorious Earth-shaking Motherland and to the Leader Who Believes He Is the Soul of the Late Dear Roy Orbison-san\". Listeners in Kyoto reported they sounded like a combination of 'Some Enchanted Evening'and 'In Dreams'. You have to admit those commies can put on a good show, eh?", 
        "intTime": 20090526, 
        "postID": 110, 
        "quote": "", 
        "reply": "Them rockets were 'warblers'. They whistled a new tune \"Hymn to the Glorious Earth-shaking Motherland and to the Leader Who Believes He Is the Soul of the Late Dear Roy Orbison-san\". Listeners in Kyoto reported they sounded like a combination of 'Some Enchanted Evening'and 'In Dreams'. You have to admit those commies can put on a good show, eh?", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-26 20:33:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "AliBubba"
    }, 
    {
        "content": "Just heard on the TV Morning News that Kim/North Korea has proclaimed that it is no longer bound by the Armistice Treaty signed back in 1953 to end the Korean War - - Hear we go!!! Wandering and Wondering", 
        "intTime": 20090527, 
        "postID": 111, 
        "quote": "", 
        "reply": "Just heard on the TV Morning News that Kim/North Korea has proclaimed that it is no longer bound by the Armistice Treaty signed back in 1953 to end the Korean War - - Hear we go!!! Wandering and Wondering", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 03:37:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 112, 
        "quote": "", 
        "reply": "I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. \"The World's Finest\"", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 04:37:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090527, 
        "postID": 113, 
        "quote": "Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric.", 
        "reply": " WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 05:23:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "Why should North Korea care what the UN thinks?? Heck they have watched Iran snub their nose at the UN for years and NOTHING happen except they get sanctions against them. Those sanctions mean absolutely nothing when you need so called 'international support' to act on anything than speaking out against it. But even then, many within the international community ignore the sanctions and continue to support those leaders anyway.. People want to stick their heads in the sand and believe they are bluffing--but I doubt they are. They can call on Iran, Russia, Venezuela and many others to side with them..", 
        "intTime": 20090527, 
        "postID": 114, 
        "quote": "", 
        "reply": "Why should North Korea care what the UN thinks?? Heck they have watched Iran snub their nose at the UN for years and NOTHING happen except they get sanctions against them. Those sanctions mean absolutely nothing when you need so called 'international support' to act on anything than speaking out against it. But even then, many within the international community ignore the sanctions and continue to support those leaders anyway.. People want to stick their heads in the sand and believe they are bluffing--but I doubt they are. They can call on Iran, Russia, Venezuela and many others to side with them..", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 06:05:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive underground nuclear test, launched a half-dozen missiles, and is now threatening to attack S. Korea. Big difference, my friend. \"The World's Finest\"", 
        "intTime": 20090527, 
        "postID": 115, 
        "quote": "Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984", 
        "reply": " Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive underground nuclear test, launched a half-dozen missiles, and is now threatening to attack S. Korea. Big difference, my friend. \"The World's Finest\"", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 06:38:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Jong Il has basically nothing to lose and everything to gain by using a couple of his new toys and putting the rest on the auction block to his buddies in iran, etc. we should be very concerned at this point and yet we have heard nothing from the UN or the CINC that would stop this nonsense from escalating. On the bright side,Israel will wipe Iran off the map in a hot minute or two..one less thing for us to have to do, right?", 
        "intTime": 20090527, 
        "postID": 116, 
        "quote": "", 
        "reply": "Jong Il has basically nothing to lose and everything to gain by using a couple of his new toys and putting the rest on the auction block to his buddies in iran, etc. we should be very concerned at this point and yet we have heard nothing from the UN or the CINC that would stop this nonsense from escalating. On the bright side,Israel will wipe Iran off the map in a hot minute or two..one less thing for us to have to do, right?", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 06:43:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive LOLunderground nuclear test, launched a half-dozen missiles two missles, but nice try, and is now threatening to attack S. Korea. show me where they threatened to attack S.K.! Big difference, my friend. Dubya's response was the same (grave concern & condemning) after the first underground test in 2006 & long range missile test(s).....my \"friend\", or did you forget about those? But I guess now you expect Obama to order a full scale invasion (just so you can condemn him for it). quote: Bush condemns North Korea's 'provocative' test By Steve Holland WASHINGTON (Reuters) - President George W. Bush, facing a new election-year foreign policy crisis, condemned North Korea's reported nuclear test on Monday and vowed the United States will respect security commitments in Asia. Speaking about 12 hours after the news broke of North Korea's nuclear test, Bush said he talked by phone with the leaders of China, South Korea, Japan and Russia and all agreed it was unacceptable and deserved an immediate response from the U.N. Security Council +http://thestar.com.my/news/story.asp?file=/2006/10/10/worldupdates/2006-10-09T211009Z_01_NOOTR_RTRJONC_0_-271471-2&sec=Worldupdates quote: July 5, 2006 · Calling North Korea's missile tests a provocative act, President Bush and Secretary of State Condoleezza Rice pledge that the United States will rely on six-party talks to deal with the issue. Over the past 24 hours, Pyongyang has gotten the world's attention, as North Korea launched up to seven missiles into the Sea of Japan. One of the missiles was reportedly a long-range type that could potentially reach Alaska. +http://www.npr.org/templates/story/story.php?storyId=5536133 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090527, 
        "postID": 117, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by NSNN: quote: Originally posted by Kegler300: I'm still waiting for Obama to respond to that little ******-bellied dicator with something other than meaningless rhetoric. WASHINGTON, June 21, 2006 – President Bush today condemned North Korea's planned missile test launch and said North Korea needs to live up to its commitments to be accepted in the world community. +http://www.defenselink.mil/news/newsarticle.aspx?id=15984 Hmmm, that seemed appropriate for a \"planned\" singular launch of a missile. In the past week, though, N. Korean has conducted a massive LOLunderground nuclear test, launched a half-dozen missiles two missles, but nice try, and is now threatening to attack S. Korea. show me where they threatened to attack S.K.! Big difference, my friend.", 
        "reply": " Dubya's response was the same (grave concern & condemning) after the first underground test in 2006 & long range missile test(s).....my \"friend\", or did you forget about those? But I guess now you expect Obama to order a full scale invasion (just so you can condemn him for it). quote: Bush condemns North Korea's 'provocative' test By Steve Holland WASHINGTON (Reuters) - President George W. Bush, facing a new election-year foreign policy crisis, condemned North Korea's reported nuclear test on Monday and vowed the United States will respect security commitments in Asia. Speaking about 12 hours after the news broke of North Korea's nuclear test, Bush said he talked by phone with the leaders of China, South Korea, Japan and Russia and all agreed it was unacceptable and deserved an immediate response from the U.N. Security Council +http://thestar.com.my/news/story.asp?file=/2006/10/10/worldupdates/2006-10-09T211009Z_01_NOOTR_RTRJONC_0_-271471-2&sec=Worldupdates quote: July 5, 2006 · Calling North Korea's missile tests a provocative act, President Bush and Secretary of State Condoleezza Rice pledge that the United States will rely on six-party talks to deal with the issue. Over the past 24 hours, Pyongyang has gotten the world's attention, as North Korea launched up to seven missiles into the Sea of Japan. One of the missiles was reportedly a long-range type that could potentially reach Alaska. +http://www.npr.org/templates/story/story.php?storyId=5536133 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:02:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "NSNN"
    }, 
    {
        "content": "have you even watched the news today? jong il said the treaty if null and void and has THREATENED TO ATTACK THE SOUTH....not sure what part of that doesn't sound like,uh...well,a threat...", 
        "intTime": 20090527, 
        "postID": 118, 
        "quote": "", 
        "reply": "have you even watched the news today? jong il said the treaty if null and void and has THREATENED TO ATTACK THE SOUTH....not sure what part of that doesn't sound like,uh...well,a threat...", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:05:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "oh, an obama did order a full scale invasion i would definitely not condemn him for it..after i was able to re-hinge my jaw from amazement, i would get to it.", 
        "intTime": 20090527, 
        "postID": 119, 
        "quote": "", 
        "reply": "oh, an obama did order a full scale invasion i would definitely not condemn him for it..after i was able to re-hinge my jaw from amazement, i would get to it.", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:06:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }, 
    {
        "content": "that should have read..and if, not \"an\"", 
        "intTime": 20090527, 
        "postID": 120, 
        "quote": "", 
        "reply": "that should have read..and if, not \"an\"", 
        "threadID": "672198221_5330003422001", 
        "time": "2009-05-27 07:07:00", 
        "title": "Update: article on how \"2nd Korean War\" would start, and be conducted", 
        "userID": "FieldDoc8404"
    }
]