[
    {
        "content": "Obama Says U.S. Long-Term Debt Load Unsustainable May 14 (Bloomberg) -- President Barack Obama, calling current deficit spending “unsustainable,” warned of skyrocketing interest rates for consumers if the U.S. continues to finance government by borrowing from other countries. “We can’t keep on just borrowing from China,” Obama said at a town-hall meeting in Rio Rancho, New Mexico, outside Albuquerque. “We have to pay interest on that debt, and that means we are mortgaging our children’s future with more and more debt.” ----WOE----WAIT---WHATS THIS ?---- What, did one of Obama's daughter's have a long heart to heart with President dad? Hello, KNOCK KNOCK - is ANYONE HOME... Your 100-freaking days late now bub... Should-a told Nancy to cut back on those fancy EAR-MARKS - TOO LATE BABY NOW - ITs TOO LATE..call Babbs maybe her and her Bollywood friends will have a US Bailout Concert... The Legacy of THE ONE - bankrupted the richest country in the history the world - ALL with 100-DAYS... ---back--to--the--article--- Holders of U.S. debt will eventually “get tired” of buying it, causing interest rates on everything from auto loans to home mortgages to increase, Obama said. “It will have a dampening effect on our economy.” Earlier this week, the Obama administration revised its own budget estimates and raised the projected deficit for this year to a record $1.84 trillion, up 5 percent from the February estimate. The revision for the 2010 fiscal year estimated the deficit at $1.26 trillion, up 7.4 percent from the February figure. The White House Office of Management and Budget also projected next year’s budget will end up at $3.59 trillion, compared with the $3.55 trillion it estimated previously. Two weeks ago, the president proposed $17 billion in budget cuts, with plans to eliminate or reduce 121 federal programs. Republicans ridiculed the amount, saying that it represented one-half of 1 percent of the entire budget. They noted that Obama is seeking an $81 billion increase in other spending. ----end snip ---- Well, well, well, - it looks as though Obama finally got himself a calculator with enough ZEROS to keep up with his DEFICIT… Bummer is – too late now. That’s what happens when you send a rookie to do VETERANS JOB. GM, Chrysler, and others are PACKING UP. They thought they were invincible – they figured he we can make the republicans pay the taxes so we can pay our constituents free-checks. Yep, sure can until the republicans decide to pull their companies and go somewhere else. Hey, we are still going to buy a car – radio – stereo – big TVs – blue jeans & cheeseburgers, right… well, if we can afford it that is – but it doesn’t matter if it’s made here or elsewhere – if we want it – we’ll buy it. Bummer is – we won’t have the money to do it. Inflation is coming – high interest rates are coming – 15-20% mortgage rates – Happy Meals for 45-bucks… Maybe Obama was thinking ahead when he talked about negotiations with Cuba. We just might need a few pointers from them on how to survive the coming Obamocrat era… Look at the Brightside – he can only tax 100% - and let’s face – that really won’t be that much more than we’ll be paying anyway… What cha think about that snack tax – how about the soda tax – fuel tax – oh did you hear about the energy tax – yea that one is gonna sting – probably DOUBLE the average electric bill – oh and there’s been talk about a “MILAGE tax”… them damn Democrats – they are creative when it comes to finding ways to steal our money… So, what-cha think is that enough change for ya in his first 4-5 months… I bet he’s just getting warmed up… ...I hope they have more variety than potato soup everyday. Change you can believe in... you bet your butt you'll believe it... and it's gonna hurt... If you gott'em smokem cuz you be able to afford shortly...! This message has been edited. Last edited by: GlassOnion, Fri 15 May 2009 09:52 AM", 
        "intTime": 20090515, 
        "postID": 1, 
        "quote": "", 
        "reply": "Obama Says U.S. Long-Term Debt Load Unsustainable May 14 (Bloomberg) -- President Barack Obama, calling current deficit spending “unsustainable,” warned of skyrocketing interest rates for consumers if the U.S. continues to finance government by borrowing from other countries. “We can’t keep on just borrowing from China,” Obama said at a town-hall meeting in Rio Rancho, New Mexico, outside Albuquerque. “We have to pay interest on that debt, and that means we are mortgaging our children’s future with more and more debt.” ----WOE----WAIT---WHATS THIS ?---- What, did one of Obama's daughter's have a long heart to heart with President dad? Hello, KNOCK KNOCK - is ANYONE HOME... Your 100-freaking days late now bub... Should-a told Nancy to cut back on those fancy EAR-MARKS - TOO LATE BABY NOW - ITs TOO LATE..call Babbs maybe her and her Bollywood friends will have a US Bailout Concert... The Legacy of THE ONE - bankrupted the richest country in the history the world - ALL with 100-DAYS... ---back--to--the--article--- Holders of U.S. debt will eventually “get tired” of buying it, causing interest rates on everything from auto loans to home mortgages to increase, Obama said. “It will have a dampening effect on our economy.” Earlier this week, the Obama administration revised its own budget estimates and raised the projected deficit for this year to a record $1.84 trillion, up 5 percent from the February estimate. The revision for the 2010 fiscal year estimated the deficit at $1.26 trillion, up 7.4 percent from the February figure. The White House Office of Management and Budget also projected next year’s budget will end up at $3.59 trillion, compared with the $3.55 trillion it estimated previously. Two weeks ago, the president proposed $17 billion in budget cuts, with plans to eliminate or reduce 121 federal programs. Republicans ridiculed the amount, saying that it represented one-half of 1 percent of the entire budget. They noted that Obama is seeking an $81 billion increase in other spending. ----end snip ---- Well, well, well, - it looks as though Obama finally got himself a calculator with enough ZEROS to keep up with his DEFICIT… Bummer is – too late now. That’s what happens when you send a rookie to do VETERANS JOB. GM, Chrysler, and others are PACKING UP. They thought they were invincible – they figured he we can make the republicans pay the taxes so we can pay our constituents free-checks. Yep, sure can until the republicans decide to pull their companies and go somewhere else. Hey, we are still going to buy a car – radio – stereo – big TVs – blue jeans & cheeseburgers, right… well, if we can afford it that is – but it doesn’t matter if it’s made here or elsewhere – if we want it – we’ll buy it. Bummer is – we won’t have the money to do it. Inflation is coming – high interest rates are coming – 15-20% mortgage rates – Happy Meals for 45-bucks… Maybe Obama was thinking ahead when he talked about negotiations with Cuba. We just might need a few pointers from them on how to survive the coming Obamocrat era… Look at the Brightside – he can only tax 100% - and let’s face – that really won’t be that much more than we’ll be paying anyway… What cha think about that snack tax – how about the soda tax – fuel tax – oh did you hear about the energy tax – yea that one is gonna sting – probably DOUBLE the average electric bill – oh and there’s been talk about a “MILAGE tax”… them damn Democrats – they are creative when it comes to finding ways to steal our money… So, what-cha think is that enough change for ya in his first 4-5 months… I bet he’s just getting warmed up… ...I hope they have more variety than potato soup everyday. Change you can believe in... you bet your butt you'll believe it... and it's gonna hurt... If you gott'em smokem cuz you be able to afford shortly...! This message has been edited. Last edited by: GlassOnion, Fri 15 May 2009 09:52 AM", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 09:20:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "LOL....but but but Obama was going to buy my house and pay for my children's college...this is just some made up story to make him look bad. He is helping us and we won't have to pay taxes.. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090515, 
        "postID": 2, 
        "quote": "", 
        "reply": "LOL....but but but Obama was going to buy my house and pay for my children's college...this is just some made up story to make him look bad. He is helping us and we won't have to pay taxes.. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 09:22:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "Anbar7"
    }, 
    {
        "content": "I guess the POTUS finally broke out his old college economic books and found that the practice of Keynesian Economic theory almost always ends with hyper-inflation. Is this where I get to say \"I told you so\" or should I wait until hyper-inflation actually hits?", 
        "intTime": 20090515, 
        "postID": 3, 
        "quote": "", 
        "reply": "I guess the POTUS finally broke out his old college economic books and found that the practice of Keynesian Economic theory almost always ends with hyper-inflation. Is this where I get to say \"I told you so\" or should I wait until hyper-inflation actually hits?", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 09:28:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: I guess the POTUS finally broke out his old college economic books and found that the practice of Keynesian Economic theory almost always ends with hyper-inflation. Is this where I get to say \"I told you so\" or should I wait until hyper-inflation actually hits? I think Michelle went shopping and her CC was denied...? Ya know, she is a pretty First Lady - but I bet she can get REALLY Pi$$ed...", 
        "intTime": 20090515, 
        "postID": 4, 
        "quote": "Originally posted by stec74: I guess the POTUS finally broke out his old college economic books and found that the practice of Keynesian Economic theory almost always ends with hyper-inflation. Is this where I get to say \"I told you so\" or should I wait until hyper-inflation actually hits?", 
        "reply": " I think Michelle went shopping and her CC was denied...? Ya know, she is a pretty First Lady - but I bet she can get REALLY Pi$$ed...", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 09:31:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "glassonion has a hot link to a commercial on his post. See call Babs.", 
        "intTime": 20090515, 
        "postID": 5, 
        "quote": "", 
        "reply": "glassonion has a hot link to a commercial on his post. See call Babs.", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 09:36:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "FIST101CAV"
    }, 
    {
        "content": "quote: Originally posted by FIST101CAV: glassonion has a hot link to a commercial on his post. See call Babs. How do them things get in the text? It isn't in my word processor and I just attempted to delete the thing - re-wrote the section and it appeared again... what's up with that..?", 
        "intTime": 20090515, 
        "postID": 6, 
        "quote": "Originally posted by FIST101CAV: glassonion has a hot link to a commercial on his post. See call Babs.", 
        "reply": " How do them things get in the text? It isn't in my word processor and I just attempted to delete the thing - re-wrote the section and it appeared again... what's up with that..?", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 09:53:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "quote: Originally posted by GlassOnion: quote: Originally posted by FIST101CAV: glassonion has a hot link to a commercial on his post. See call Babs. How do them things get in the text? It isn't in my word processor and I just attempted to delete the thing - re-wrote the section and it appeared again... what's up with that..? Someone is trying to point out to you that Mr. Bush raised the debt from 5 to ten trillion dollars and no one complained at all... Dave", 
        "intTime": 20090515, 
        "postID": 7, 
        "quote": "Originally posted by GlassOnion: quote: Originally posted by FIST101CAV: glassonion has a hot link to a commercial on his post. See call Babs. How do them things get in the text? It isn't in my word processor and I just attempted to delete the thing - re-wrote the section and it appeared again... what's up with that..?", 
        "reply": " Someone is trying to point out to you that Mr. Bush raised the debt from 5 to ten trillion dollars and no one complained at all... Dave", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 10:20:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by GlassOnion: quote: Originally posted by FIST101CAV: glassonion has a hot link to a commercial on his post. See call Babs. How do them things get in the text? It isn't in my word processor and I just attempted to delete the thing - re-wrote the section and it appeared again... what's up with that..? I have no idea. Kinda messed up.", 
        "intTime": 20090515, 
        "postID": 8, 
        "quote": "Originally posted by GlassOnion: quote: Originally posted by FIST101CAV: glassonion has a hot link to a commercial on his post. See call Babs. How do them things get in the text? It isn't in my word processor and I just attempted to delete the thing - re-wrote the section and it appeared again... what's up with that..?", 
        "reply": " I have no idea. Kinda messed up.", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 10:35:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "FIST101CAV"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: quote: Originally posted by FIST101CAV: glassonion has a hot link to a commercial on his post. See call Babs. How do them things get in the text? It isn't in my word processor and I just attempted to delete the thing - re-wrote the section and it appeared again... what's up with that..? Someone is trying to point out to you that Mr. Bush raised the debt from 5 to ten trillion dollars and no one complained at all... Dave Nothing to do with that at all.", 
        "intTime": 20090515, 
        "postID": 9, 
        "quote": "Originally posted by Grachus: quote: Originally posted by GlassOnion: quote: Originally posted by FIST101CAV: glassonion has a hot link to a commercial on his post. See call Babs. How do them things get in the text? It isn't in my word processor and I just attempted to delete the thing - re-wrote the section and it appeared again... what's up with that..? Someone is trying to point out to you that Mr. Bush raised the debt from 5 to ten trillion dollars and no one complained at all... Dave", 
        "reply": " Nothing to do with that at all.", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 10:36:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "FIST101CAV"
    }, 
    {
        "content": "quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: quote: Originally posted by FIST101CAV: glassonion has a hot link to a commercial on his post. See call Babs. How do them things get in the text? It isn't in my word processor and I just attempted to delete the thing - re-wrote the section and it appeared again... what's up with that..? Someone is trying to point out to you that Mr. Bush raised the debt from 5 to ten trillion dollars and no one complained at all... Dave Nothing to do with that at all. I'm glad responded - man, I was looking all over for it... but the part about \"call\" babbs- I went back - deleted the text - and rewrote and that puppy still came back... it must be something generic on the server for advertising or something... I can't get it off of it..", 
        "intTime": 20090515, 
        "postID": 10, 
        "quote": "Originally posted by FIST101CAV: quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: quote: Originally posted by FIST101CAV: glassonion has a hot link to a commercial on his post. See call Babs. How do them things get in the text? It isn't in my word processor and I just attempted to delete the thing - re-wrote the section and it appeared again... what's up with that..? Someone is trying to point out to you that Mr. Bush raised the debt from 5 to ten trillion dollars and no one complained at all... Dave Nothing to do with that at all.", 
        "reply": " I'm glad responded - man, I was looking all over for it... but the part about \"call\" babbs- I went back - deleted the text - and rewrote and that puppy still came back... it must be something generic on the server for advertising or something... I can't get it off of it..", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 10:42:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: quote: Originally posted by FIST101CAV: glassonion has a hot link to a commercial on his post. See call Babs. How do them things get in the text? It isn't in my word processor and I just attempted to delete the thing - re-wrote the section and it appeared again... what's up with that..? Someone is trying to point out to you that Mr. Bush raised the debt from 5 to ten trillion dollars and no one complained at all... Dave Nothing to do with that at all. These Bush and Obama sudden and gigantic expenditures are supposed to be one shot deals. Will they work? I have my doubts - Nevertheless we DO have to spend a lot of money to dig our way out of the hole created by failed economic policies. My problem is not with the amount of money, but where the money is going. A good way to judge Obama and his policies will be to first see if they work, and then to see what next years budget is going to look like. Mr. Bush wacked on three four hundred billion a year, without any complaints at all. Dave", 
        "intTime": 20090515, 
        "postID": 11, 
        "quote": "Originally posted by FIST101CAV: quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: quote: Originally posted by FIST101CAV: glassonion has a hot link to a commercial on his post. See call Babs. How do them things get in the text? It isn't in my word processor and I just attempted to delete the thing - re-wrote the section and it appeared again... what's up with that..? Someone is trying to point out to you that Mr. Bush raised the debt from 5 to ten trillion dollars and no one complained at all... Dave Nothing to do with that at all.", 
        "reply": " These Bush and Obama sudden and gigantic expenditures are supposed to be one shot deals. Will they work? I have my doubts - Nevertheless we DO have to spend a lot of money to dig our way out of the hole created by failed economic policies. My problem is not with the amount of money, but where the money is going. A good way to judge Obama and his policies will be to first see if they work, and then to see what next years budget is going to look like. Mr. Bush wacked on three four hundred billion a year, without any complaints at all. Dave", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 10:45:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "Grachus"
    }, 
    {
        "content": "I can see Obama's relection campaign slogan now. \"Change you can believe.... but this time its for real!\"", 
        "intTime": 20090515, 
        "postID": 12, 
        "quote": "", 
        "reply": "I can see Obama's relection campaign slogan now. \"Change you can believe.... but this time its for real!\"", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 11:07:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by Grachus: These Bush and Obama sudden and gigantic expenditures are supposed to be one shot deals. Will they work? I have my doubts - Nevertheless we DO have to spend a lot of money to dig our way out of the hole created by failed economic policies. My problem is not with the amount of money, but where the money is going. A good way to judge Obama and his policies will be to first see if they work, and then to see what next years budget is going to look like. Mr. Bush wacked on three four hundred billion a year, without any complaints at all. Dave Actually, that’s the problem – HE DID… his 2009 projections are already being readjusted BY HIM. The deficit will go 5% from what they just reported in February – which was probably calculated in Dec or early Jan at best. Again that is THIS year – and it’s only MAY… Those calculations were made PRIOR to GM & Chrysler dropping 3500 dealerships – several parts manufacturers have pulled out and gone to Mexico – rumor is GM is going to Mexico or at least a large part of the manufacturing – and it does not include the umpteen other companies pulling out. Unemployment will steadily climb – and it is climbing faster than they ever thought it would. This thing is slipping out from under his control and it won’t be too long before it can even be pulled back. The projection for 2010 projected deficit was just adjusted by an additional 7.4%. These are HUGE numbers… Earlier this week, the Obama administration revised its own budget estimates and raised the projected deficit for this year to a record $1.84 trillion, up 5 percent from the February estimate. The revision for the 2010 fiscal year estimated the deficit at $1.26 trillion, up 7.4 percent from the February figure. The White House Office of Management and Budget also projected next year’s budget will end up at $3.59 trillion, compared with the $3.55 trillion it estimated previously. So, that means his projections will be adjusted again – and it is going the WRONG way! The issue is – NO ONE will be working so the FED cannot generate any taxes. They’ve strangled the Golden Goose that produced the Golden Eggs. With these size deficits – a freaking splinter can be catastrophic. He is borrowing 150-Billion dollars per MONTH – to PAY the interest payment to China. This is PRIME TIME work for the US – and Unemployment is still climbing – GM – Chrysler taking a dump – and I guarantee the layoffs from the Chrysler shut down have not hit yet. We will be pushing 10-12% unemployment by the end of summer. He cannot borrow money THEN SPEND IT ON EAR MARKS. If you remortgage your house to pay off the credit cards – but go buy new cars instead – chances are you’ll LOSE BOTH. THAT is what the democrats have done. Check this little tidbit out… below… China's yuan 'set to usurp US dollar' as world's reserve currency The Chinese yuan is preparing to overtake the US dollar as the world's reserve currency, economist Nouriel Roubini has warned. Professor Roubini, of New York University's Stern business school, believes that while such a major change is some way off, the Chinese government is laying the ground for the yuan's ascendance. Known as \"Dr Doom\" for his negative stance, Prof Roubini argues that China is better placed than the US to provide a reserve currency for the 21st century because it has a large current account surplus, focused government and few of the economic worries the US faces. In a column in the New York Times, Prof Roubini warns that with the proposal for a new international reserve currency via the International Monetary Fund, Beijing has already begun to take steps to usurp the greenback. China will soon want to see the yuan included in the International Monetary Fund's special drawing rights \"basket\", he warns, as well as seeing it \"used as a means of payment in bilateral trade.\" Prof Roubini's warning followed the US government's latest economic data that showed producer prices in April experienced their biggest year-on-year drop since 1950, falling 3.7pc. The number of Americans claiming unemployment benefit for the first time rose by 32,000 to 637,000 in the week to May 9. The increase meant the total number of people claiming benefits stood at to 6.56m, a record high for the 15th consecutive week in a row. ------end-snip--------- This is SERIOUS and he is not going to have any ability to do anything about it. They screwed up BIG TIME. They should have paid-off the mortgages in foreclosure. It would have ticked off folks but that would have kept our money IN THE SYSTEM. Those folks would suddenly have a spendable income again. They could BUY CARS – and other manufactured goods… The banks would have been forced to deal with their own problems with their freaking money. The Fed could have created some sort of deeds for those properties to work things through – but they didn’t do that – THEY WENT SHOPPING. If anyone thinks being a freaking road and remodeling government buildings is going SAVE this economy – they need to change the brand of dope they smoke… He better get in front of this thing or we will collapse and it will not be pretty… I am all for giving him the chance but thus far - he BLOWING that chance and doing it in PRESIDENTIAL STYLE! I don't believe most of DC does not even believe or understand what they have done. This is monumental - it is going to LEAVE A MARK - a NASTY MARK.", 
        "intTime": 20090515, 
        "postID": 13, 
        "quote": "Originally posted by Grachus: These Bush and Obama sudden and gigantic expenditures are supposed to be one shot deals. Will they work? I have my doubts - Nevertheless we DO have to spend a lot of money to dig our way out of the hole created by failed economic policies. My problem is not with the amount of money, but where the money is going. A good way to judge Obama and his policies will be to first see if they work, and then to see what next years budget is going to look like. Mr. Bush wacked on three four hundred billion a year, without any complaints at all. Dave", 
        "reply": " Actually, that’s the problem – HE DID… his 2009 projections are already being readjusted BY HIM. The deficit will go 5% from what they just reported in February – which was probably calculated in Dec or early Jan at best. Again that is THIS year – and it’s only MAY… Those calculations were made PRIOR to GM & Chrysler dropping 3500 dealerships – several parts manufacturers have pulled out and gone to Mexico – rumor is GM is going to Mexico or at least a large part of the manufacturing – and it does not include the umpteen other companies pulling out. Unemployment will steadily climb – and it is climbing faster than they ever thought it would. This thing is slipping out from under his control and it won’t be too long before it can even be pulled back. The projection for 2010 projected deficit was just adjusted by an additional 7.4%. These are HUGE numbers… Earlier this week, the Obama administration revised its own budget estimates and raised the projected deficit for this year to a record $1.84 trillion, up 5 percent from the February estimate. The revision for the 2010 fiscal year estimated the deficit at $1.26 trillion, up 7.4 percent from the February figure. The White House Office of Management and Budget also projected next year’s budget will end up at $3.59 trillion, compared with the $3.55 trillion it estimated previously. So, that means his projections will be adjusted again – and it is going the WRONG way! The issue is – NO ONE will be working so the FED cannot generate any taxes. They’ve strangled the Golden Goose that produced the Golden Eggs. With these size deficits – a freaking splinter can be catastrophic. He is borrowing 150-Billion dollars per MONTH – to PAY the interest payment to China. This is PRIME TIME work for the US – and Unemployment is still climbing – GM – Chrysler taking a dump – and I guarantee the layoffs from the Chrysler shut down have not hit yet. We will be pushing 10-12% unemployment by the end of summer. He cannot borrow money THEN SPEND IT ON EAR MARKS. If you remortgage your house to pay off the credit cards – but go buy new cars instead – chances are you’ll LOSE BOTH. THAT is what the democrats have done. Check this little tidbit out… below… China's yuan 'set to usurp US dollar' as world's reserve currency The Chinese yuan is preparing to overtake the US dollar as the world's reserve currency, economist Nouriel Roubini has warned. Professor Roubini, of New York University's Stern business school, believes that while such a major change is some way off, the Chinese government is laying the ground for the yuan's ascendance. Known as \"Dr Doom\" for his negative stance, Prof Roubini argues that China is better placed than the US to provide a reserve currency for the 21st century because it has a large current account surplus, focused government and few of the economic worries the US faces. In a column in the New York Times, Prof Roubini warns that with the proposal for a new international reserve currency via the International Monetary Fund, Beijing has already begun to take steps to usurp the greenback. China will soon want to see the yuan included in the International Monetary Fund's special drawing rights \"basket\", he warns, as well as seeing it \"used as a means of payment in bilateral trade.\" Prof Roubini's warning followed the US government's latest economic data that showed producer prices in April experienced their biggest year-on-year drop since 1950, falling 3.7pc. The number of Americans claiming unemployment benefit for the first time rose by 32,000 to 637,000 in the week to May 9. The increase meant the total number of people claiming benefits stood at to 6.56m, a record high for the 15th consecutive week in a row. ------end-snip--------- This is SERIOUS and he is not going to have any ability to do anything about it. They screwed up BIG TIME. They should have paid-off the mortgages in foreclosure. It would have ticked off folks but that would have kept our money IN THE SYSTEM. Those folks would suddenly have a spendable income again. They could BUY CARS – and other manufactured goods… The banks would have been forced to deal with their own problems with their freaking money. The Fed could have created some sort of deeds for those properties to work things through – but they didn’t do that – THEY WENT SHOPPING. If anyone thinks being a freaking road and remodeling government buildings is going SAVE this economy – they need to change the brand of dope they smoke… He better get in front of this thing or we will collapse and it will not be pretty… I am all for giving him the chance but thus far - he BLOWING that chance and doing it in PRESIDENTIAL STYLE! I don't believe most of DC does not even believe or understand what they have done. This is monumental - it is going to LEAVE A MARK - a NASTY MARK.", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 11:15:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: quote: Originally posted by FIST101CAV: glassonion has a hot link to a commercial on his post. See call Babs. How do them things get in the text? It isn't in my word processor and I just attempted to delete the thing - re-wrote the section and it appeared again... what's up with that..? Someone is trying to point out to you that Mr. Bush raised the debt from 5 to ten trillion dollars and no one complained at all... Dave Nothing to do with that at all. These Bush and Obama sudden and gigantic expenditures are supposed to be one shot deals. Will they work? I have my doubts - Nevertheless we DO have to spend a lot of money to dig our way out of the hole created by failed economic policies. My problem is not with the amount of money, but where the money is going. A good way to judge Obama and his policies will be to first see if they work, and then to see what next years budget is going to look like. Mr. Bush wacked on three four hundred billion a year, without any complaints at all. Dave Nobody complained? Senator Gregg R-NH on the 2008 Budget proposal: quote: \"At some point somebody's got to stand up here and stop talking and actually show some leadership on the long-term issue,\" Gregg said. \"Humpty Dumpty could balance this budget over the next four years, but it's the next 15 to 20 years when we actually bankrupt our children.\" Tom Tancredo R-CO said: quote: American conservatives have watched dumbfounded as their Congress -- their Republican Congress -- and the Republican White House engineered the largest expansion of the federal government in modern history, David Keene, President of the American Conservative Union said: quote: The biggest problem people have with Bush's conservatism is that to him, it seems it's not a question of how much you spend, it's where you spend it. Traditional conservatives would say that's wrongheaded, because no matter what you spend it on, public spending restricts individual freedom in favor of government. Mike Pence R-IND said: quote: I think most House conservatives believe no budget is better than a bad budget That is just a few, look around and you will find many other true Conservative Republicans who were against Bush's massive budgets.", 
        "intTime": 20090515, 
        "postID": 14, 
        "quote": "Originally posted by Grachus: quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: quote: Originally posted by FIST101CAV: glassonion has a hot link to a commercial on his post. See call Babs. How do them things get in the text? It isn't in my word processor and I just attempted to delete the thing - re-wrote the section and it appeared again... what's up with that..? Someone is trying to point out to you that Mr. Bush raised the debt from 5 to ten trillion dollars and no one complained at all... Dave Nothing to do with that at all. These Bush and Obama sudden and gigantic expenditures are supposed to be one shot deals. Will they work? I have my doubts - Nevertheless we DO have to spend a lot of money to dig our way out of the hole created by failed economic policies. My problem is not with the amount of money, but where the money is going. A good way to judge Obama and his policies will be to first see if they work, and then to see what next years budget is going to look like. Mr. Bush wacked on three four hundred billion a year, without any complaints at all. Dave", 
        "reply": " Nobody complained? Senator Gregg R-NH on the 2008 Budget proposal: quote: \"At some point somebody's got to stand up here and stop talking and actually show some leadership on the long-term issue,\" Gregg said. \"Humpty Dumpty could balance this budget over the next four years, but it's the next 15 to 20 years when we actually bankrupt our children.\" Tom Tancredo R-CO said: quote: American conservatives have watched dumbfounded as their Congress -- their Republican Congress -- and the Republican White House engineered the largest expansion of the federal government in modern history, David Keene, President of the American Conservative Union said: quote: The biggest problem people have with Bush's conservatism is that to him, it seems it's not a question of how much you spend, it's where you spend it. Traditional conservatives would say that's wrongheaded, because no matter what you spend it on, public spending restricts individual freedom in favor of government. Mike Pence R-IND said: quote: I think most House conservatives believe no budget is better than a bad budget That is just a few, look around and you will find many other true Conservative Republicans who were against Bush's massive budgets.", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 11:19:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: quote: Originally posted by FIST101CAV: glassonion has a hot link to a commercial on his post. See call Babs. How do them things get in the text? It isn't in my word processor and I just attempted to delete the thing - re-wrote the section and it appeared again... what's up with that..? Someone is trying to point out to you that Mr. Bush raised the debt from 5 to ten trillion dollars and no one complained at all... Dave Nothing to do with that at all. These Bush and Obama sudden and gigantic expenditures are supposed to be one shot deals. Will they work? I have my doubts - Nevertheless we DO have to spend a lot of money to dig our way out of the hole created by failed economic policies. My problem is not with the amount of money, but where the money is going. A good way to judge Obama and his policies will be to first see if they work, and then to see what next years budget is going to look like. Mr. Bush wacked on three four hundred billion a year, without any complaints at all. Dave Nobody complained? Senator Gregg R-NH on the 2008 Budget proposal: quote: \"At some point somebody's got to stand up here and stop talking and actually show some leadership on the long-term issue,\" Gregg said. \"Humpty Dumpty could balance this budget over the next four years, but it's the next 15 to 20 years when we actually bankrupt our children.\" Tom Tancredo R-CO said: quote: American conservatives have watched dumbfounded as their Congress -- their Republican Congress -- and the Republican White House engineered the largest expansion of the federal government in modern history, David Keene, President of the American Conservative Union said: quote: The biggest problem people have with Bush's conservatism is that to him, it seems it's not a question of how much you spend, it's where you spend it. Traditional conservatives would say that's wrongheaded, because no matter what you spend it on, public spending restricts individual freedom in favor of government. Mike Pence R-IND said: quote: I think most House conservatives believe no budget is better than a bad budget That is just a few, look around and you will find many other true Conservative Republicans who were against Bush's massive budgets. this is true. Just because Bush helped to put us in a debt doesn't mean that Obama can do it also. If he is going to preach change, maybe he should try it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090515, 
        "postID": 15, 
        "quote": "Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by FIST101CAV: quote: Originally posted by Grachus: quote: Originally posted by GlassOnion: quote: Originally posted by FIST101CAV: glassonion has a hot link to a commercial on his post. See call Babs. How do them things get in the text? It isn't in my word processor and I just attempted to delete the thing - re-wrote the section and it appeared again... what's up with that..? Someone is trying to point out to you that Mr. Bush raised the debt from 5 to ten trillion dollars and no one complained at all... Dave Nothing to do with that at all. These Bush and Obama sudden and gigantic expenditures are supposed to be one shot deals. Will they work? I have my doubts - Nevertheless we DO have to spend a lot of money to dig our way out of the hole created by failed economic policies. My problem is not with the amount of money, but where the money is going. A good way to judge Obama and his policies will be to first see if they work, and then to see what next years budget is going to look like. Mr. Bush wacked on three four hundred billion a year, without any complaints at all. Dave Nobody complained? Senator Gregg R-NH on the 2008 Budget proposal: quote: \"At some point somebody's got to stand up here and stop talking and actually show some leadership on the long-term issue,\" Gregg said. \"Humpty Dumpty could balance this budget over the next four years, but it's the next 15 to 20 years when we actually bankrupt our children.\" Tom Tancredo R-CO said: quote: American conservatives have watched dumbfounded as their Congress -- their Republican Congress -- and the Republican White House engineered the largest expansion of the federal government in modern history, David Keene, President of the American Conservative Union said: quote: The biggest problem people have with Bush's conservatism is that to him, it seems it's not a question of how much you spend, it's where you spend it. Traditional conservatives would say that's wrongheaded, because no matter what you spend it on, public spending restricts individual freedom in favor of government. Mike Pence R-IND said: quote: I think most House conservatives believe no budget is better than a bad budget That is just a few, look around and you will find many other true Conservative Republicans who were against Bush's massive budgets.", 
        "reply": " this is true. Just because Bush helped to put us in a debt doesn't mean that Obama can do it also. If he is going to preach change, maybe he should try it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 11:27:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "Anbar7"
    }, 
    {
        "content": "...as for complaining - Bush did it - Obama did it... They better quit their freaking whining because it does NOT matter anymore. China doesn't CARE nor do the international banking system - if our credit rating is dropped - we are in trouble. And I bet China & Russia, not to mention a few others - WOULD LOVE TO SEE that happen. This serious and it only gets MORE serious. Obama is getting nervous and he's only talking about 7-10% of the fed budget. Within the next 5 years - that TRILLION DOLLAR BS they just borrowed will hit us at over 50% of the Fed Budget... 50% - that's impossible and that is just to PAY THE INTEREST! Worse, that's if we do NOTHING to save SSC - Medicare - and the BS already hanging out there that our wonderful congress has ignore while point fingers and to luncheons 4-5 times PER WEEK. Most of these senators only work 2-3 days per week. The rest of that time is with their friends the LOBByests - no-kidding... THEY DIDN'T have time to read the TRILLION dollar deficit but they had time to meet with their crony friends... this is BAD NEWS...", 
        "intTime": 20090515, 
        "postID": 16, 
        "quote": "", 
        "reply": "...as for complaining - Bush did it - Obama did it... They better quit their freaking whining because it does NOT matter anymore. China doesn't CARE nor do the international banking system - if our credit rating is dropped - we are in trouble. And I bet China & Russia, not to mention a few others - WOULD LOVE TO SEE that happen. This serious and it only gets MORE serious. Obama is getting nervous and he's only talking about 7-10% of the fed budget. Within the next 5 years - that TRILLION DOLLAR BS they just borrowed will hit us at over 50% of the Fed Budget... 50% - that's impossible and that is just to PAY THE INTEREST! Worse, that's if we do NOTHING to save SSC - Medicare - and the BS already hanging out there that our wonderful congress has ignore while point fingers and to luncheons 4-5 times PER WEEK. Most of these senators only work 2-3 days per week. The rest of that time is with their friends the LOBByests - no-kidding... THEY DIDN'T have time to read the TRILLION dollar deficit but they had time to meet with their crony friends... this is BAD NEWS...", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 11:29:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "Why weren't the republican's objecting when George Bush was bankrupting the country, leaving nothing more than a huge mess in his wake? Were they to intimidated by Cheney and Rush Limbaugh too? I would imagine so. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090515, 
        "postID": 17, 
        "quote": "", 
        "reply": "Why weren't the republican's objecting when George Bush was bankrupting the country, leaving nothing more than a huge mess in his wake? Were they to intimidated by Cheney and Rush Limbaugh too? I would imagine so. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 12:42:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Why weren't the republican's objecting when George Bush was bankrupting the country, leaving nothing more than a huge mess in his wake? Were they to intimidated by Cheney and Rush Limbaugh too? I would imagine so. Keep looking back - the wall isn't too far off now... Hope - the democrats message - HOPE NO-ONE FINDS OUT...! I think Obama is starting to get the real picture - we'll see. By the time this over - hell, he'll be blaming George Washington for helping start this mess... keep looking back - the train is rolling and tracks leading to socialism's land of milk & honey - well, those folks got laid off - so it isn't finished... This will be like landing the spaceshuttle without parachutes or breaks... it's going to leave a mark...and it's going to hurt...", 
        "intTime": 20090515, 
        "postID": 18, 
        "quote": "Originally posted by jack_flats: Why weren't the republican's objecting when George Bush was bankrupting the country, leaving nothing more than a huge mess in his wake? Were they to intimidated by Cheney and Rush Limbaugh too? I would imagine so.", 
        "reply": " Keep looking back - the wall isn't too far off now... Hope - the democrats message - HOPE NO-ONE FINDS OUT...! I think Obama is starting to get the real picture - we'll see. By the time this over - hell, he'll be blaming George Washington for helping start this mess... keep looking back - the train is rolling and tracks leading to socialism's land of milk & honey - well, those folks got laid off - so it isn't finished... This will be like landing the spaceshuttle without parachutes or breaks... it's going to leave a mark...and it's going to hurt...", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 14:23:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "GlassOnion"
    }, 
    {
        "content": "and this is really new news to anyone? This has been coming. Even before Obama took office, the cards were already dealt when the 1st dollar of the 1st bailout hit the streets.", 
        "intTime": 20090515, 
        "postID": 19, 
        "quote": "", 
        "reply": "and this is really new news to anyone? This has been coming. Even before Obama took office, the cards were already dealt when the 1st dollar of the 1st bailout hit the streets.", 
        "threadID": "672198221_1600083322001", 
        "time": "2009-05-15 14:29:00", 
        "title": "BAD NEWS – OBAMOCRATS! – INFLATION DOMINATION – THIS IS GONNA HURT!", 
        "userID": "crackerjacks61"
    }
]