[
    {
        "content": "The number of Medal of Honor recipients from the wars in Iraq and Afghanistan can be counted on one hand. Each of the five acted spontaneously and heroically to save the lives of comrades. Each exemplified the medal’s criteria of “gallantry and intrepidity at the risk of one’s own life above and beyond the call of duty.” And each was killed in action or died from wounds received in action. From World War I through Vietnam, the rate of Medal of Honor recipients per 100,000 service members stayed between 2.3 (Korea) and 2.9 (World War II). But since the terrorist attacks of Sept. 11, 2001, only five Medals of Honor have been awarded, a rate of 0.1 per 100,000 — one in a million. A similar disparity occurs on the second tier of valor awards: Distinguished Service Cross, Navy Cross and Air Force Cross. Throughout the 20th century, the rate of service cross recipients per 100,000 troops ranged from a low of 19 in Korea to a high of 167 in World War I. But for the post-9/11 wars, it’s only one per 100,000. Why? More here: \"http://marinetimes.com/news/2009/03/military_medal_of_honor_032509w/\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 1, 
        "quote": "", 
        "reply": "The number of Medal of Honor recipients from the wars in Iraq and Afghanistan can be counted on one hand. Each of the five acted spontaneously and heroically to save the lives of comrades. Each exemplified the medal’s criteria of “gallantry and intrepidity at the risk of one’s own life above and beyond the call of duty.” And each was killed in action or died from wounds received in action. From World War I through Vietnam, the rate of Medal of Honor recipients per 100,000 service members stayed between 2.3 (Korea) and 2.9 (World War II). But since the terrorist attacks of Sept. 11, 2001, only five Medals of Honor have been awarded, a rate of 0.1 per 100,000 — one in a million. A similar disparity occurs on the second tier of valor awards: Distinguished Service Cross, Navy Cross and Air Force Cross. Throughout the 20th century, the rate of service cross recipients per 100,000 troops ranged from a low of 19 in Korea to a high of 167 in World War I. But for the post-9/11 wars, it’s only one per 100,000. Why? More here: \"http://marinetimes.com/news/2009/03/military_medal_of_honor_032509w/\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:10:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Though I too wonder why more MOH's aren't being given, I just have to say that in my opinion, anyone who served over there or is there now are heroes in my book. Don", 
        "intTime": 20090331, 
        "postID": 2, 
        "quote": "", 
        "reply": "Though I too wonder why more MOH's aren't being given, I just have to say that in my opinion, anyone who served over there or is there now are heroes in my book. Don", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:21:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Though I too wonder why more MOH's aren't being given, I just have to say that in my opinion, anyone who served over there or is there now are heroes in my book. Don This is true and I agree with you. Yet, it still makes you wonder why now do you have to die to recieve the MOH. When if you did the same thing, but did not die you do not receive it but you will get the second highest medal. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 3, 
        "quote": "Originally posted by 21yrsUSCGUSCS: Though I too wonder why more MOH's aren't being given, I just have to say that in my opinion, anyone who served over there or is there now are heroes in my book. Don", 
        "reply": " This is true and I agree with you. Yet, it still makes you wonder why now do you have to die to recieve the MOH. When if you did the same thing, but did not die you do not receive it but you will get the second highest medal. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:24:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "How many Iwo Jima’s, Okinawa’s, Tarawa’s, Guadalcanal’s, Battle of the Bulge’s, Normandy’s, Belleau Wood’s, etc Battles have been fought in Iraq and Afghanistan? This may partially explain the lack of MOH’s", 
        "intTime": 20090331, 
        "postID": 4, 
        "quote": "", 
        "reply": "How many Iwo Jima’s, Okinawa’s, Tarawa’s, Guadalcanal’s, Battle of the Bulge’s, Normandy’s, Belleau Wood’s, etc Battles have been fought in Iraq and Afghanistan? This may partially explain the lack of MOH’s", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:44:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "xnavycg"
    }, 
    {
        "content": "Two possible reasons come to my mind: It appears that \"posthumous\" has become an \"unofficial official\" criteria for being awarded the MOH. Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. OTOH, the opportunities for posthumous award have also declined because of our superb battlefield medical care. Second, given the nature of the conflicts in Iraq and A-stan, the general lack of prolonged, close combat against a conventional enemy that normally produces the vast majority of MOH nominations, is probably a factor also. Just my .01 worth.", 
        "intTime": 20090331, 
        "postID": 5, 
        "quote": "", 
        "reply": "Two possible reasons come to my mind: It appears that \"posthumous\" has become an \"unofficial official\" criteria for being awarded the MOH. Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. OTOH, the opportunities for posthumous award have also declined because of our superb battlefield medical care. Second, given the nature of the conflicts in Iraq and A-stan, the general lack of prolonged, close combat against a conventional enemy that normally produces the vast majority of MOH nominations, is probably a factor also. Just my .01 worth.", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:45:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: How many Iwo Jima’s, Okinawa’s, Tarawa’s, Guadalcanal’s, Battle of the Bulge’s, Normandy’s, Belleau Wood’s, etc Battles have been fought in Iraq and Afghanistan? This may partially explain the lack of MOH’s How many beaches and islands are in Iraq and A-Stan that may partially explain your response. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 6, 
        "quote": "Originally posted by xnavycg: How many Iwo Jima’s, Okinawa’s, Tarawa’s, Guadalcanal’s, Battle of the Bulge’s, Normandy’s, Belleau Wood’s, etc Battles have been fought in Iraq and Afghanistan? This may partially explain the lack of MOH’s", 
        "reply": " How many beaches and islands are in Iraq and A-Stan that may partially explain your response. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:53:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Two possible reasons come to my mind: It appears that \"posthumous\" has become an \"unofficial official\" criteria for being awarded the MOH. Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. OTOH, the opportunities for posthumous award have also declined because of our superb battlefield medical care. Second, given the nature of the conflicts in Iraq and A-stan, the general lack of prolonged, close combat against a conventional enemy that normally produces the vast majority of MOH nominations, is probably a factor also. Just my .01 worth. True, but one has to jump on a grendae to earn a MOH. Just because they cleared a trench full of enemy and didn't die, does that mean they are not worthy of a MOH? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 7, 
        "quote": "Originally posted by Motive25: Two possible reasons come to my mind: It appears that \"posthumous\" has become an \"unofficial official\" criteria for being awarded the MOH. Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. OTOH, the opportunities for posthumous award have also declined because of our superb battlefield medical care. Second, given the nature of the conflicts in Iraq and A-stan, the general lack of prolonged, close combat against a conventional enemy that normally produces the vast majority of MOH nominations, is probably a factor also. Just my .01 worth.", 
        "reply": " True, but one has to jump on a grendae to earn a MOH. Just because they cleared a trench full of enemy and didn't die, does that mean they are not worthy of a MOH? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:55:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090331, 
        "postID": 8, 
        "quote": "", 
        "reply": "Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:10:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Motive25: Two possible reasons come to my mind: It appears that \"posthumous\" has become an \"unofficial official\" criteria for being awarded the MOH. Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. OTOH, the opportunities for posthumous award have also declined because of our superb battlefield medical care. Second, given the nature of the conflicts in Iraq and A-stan, the general lack of prolonged, close combat against a conventional enemy that normally produces the vast majority of MOH nominations, is probably a factor also. Just my .01 worth. True, but one has to jump on a grendae to earn a MOH. Just because they cleared a trench full of enemy and didn't die, does that mean they are not worthy of a MOH? I personally wouldn't say they're not worthy, but that appears to be the standard now- you have to die, and since we are saving more wounded than ever before, the chances of being awarded the MOH are going down.", 
        "intTime": 20090331, 
        "postID": 9, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Motive25: Two possible reasons come to my mind: It appears that \"posthumous\" has become an \"unofficial official\" criteria for being awarded the MOH. Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. OTOH, the opportunities for posthumous award have also declined because of our superb battlefield medical care. Second, given the nature of the conflicts in Iraq and A-stan, the general lack of prolonged, close combat against a conventional enemy that normally produces the vast majority of MOH nominations, is probably a factor also. Just my .01 worth. True, but one has to jump on a grendae to earn a MOH. Just because they cleared a trench full of enemy and didn't die, does that mean they are not worthy of a MOH?", 
        "reply": " I personally wouldn't say they're not worthy, but that appears to be the standard now- you have to die, and since we are saving more wounded than ever before, the chances of being awarded the MOH are going down.", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:20:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Motive25"
    }, 
    {
        "content": "well really moh's shouldnt be handed out a lot.. they should be withheld for heroic acts that are above and beyond the call of duty.... i fully support not giving them out too much it kind of dismissive the value of them if given out too much...", 
        "intTime": 20090331, 
        "postID": 10, 
        "quote": "", 
        "reply": "well really moh's shouldnt be handed out a lot.. they should be withheld for heroic acts that are above and beyond the call of duty.... i fully support not giving them out too much it kind of dismissive the value of them if given out too much...", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:20:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 11, 
        "quote": "Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent.", 
        "reply": " Why is that Jack? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:21:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. Not challenging but would be interested in links to any examples you might have. The only \"downgrade\" that I am aware of that attracted significant attention was that of Peralta ... and there the issue was whether his action was a conscious sacrifice of himself. He got the Navy Cross. Assuming the validity of the reason given for downgrading the award, that same reason would seem to apply as well for not awarding the Navy Cross ... so I've never fully understood that one.", 
        "intTime": 20090331, 
        "postID": 12, 
        "quote": "Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question.", 
        "reply": " Not challenging but would be interested in links to any examples you might have. The only \"downgrade\" that I am aware of that attracted significant attention was that of Peralta ... and there the issue was whether his action was a conscious sacrifice of himself. He got the Navy Cross. Assuming the validity of the reason given for downgrading the award, that same reason would seem to apply as well for not awarding the Navy Cross ... so I've never fully understood that one.", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:22:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack? Beats me ... Perhaps the military should redefine the parameters for it, whatever that would be. I agree, some very heroic acts are going on there, and so few MOH's. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090331, 
        "postID": 13, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack?", 
        "reply": " Beats me ... Perhaps the military should redefine the parameters for it, whatever that would be. I agree, some very heroic acts are going on there, and so few MOH's. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:23:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: well really moh's shouldnt be handed out a lot.. they should be withheld for heroic acts that are above and beyond the call of duty.... i fully support not giving them out too much it kind of dismissive the value of them if given out too much... I agree, but there are heroic acts, but they live to tell about it and they only get a Navy cross or distingued service medal for it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 14, 
        "quote": "Originally posted by outlaws93: well really moh's shouldnt be handed out a lot.. they should be withheld for heroic acts that are above and beyond the call of duty.... i fully support not giving them out too much it kind of dismissive the value of them if given out too much...", 
        "reply": " I agree, but there are heroic acts, but they live to tell about it and they only get a Navy cross or distingued service medal for it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:24:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: How many Iwo Jima’s, Okinawa’s, Tarawa’s, Guadalcanal’s, Battle of the Bulge’s, Normandy’s, Belleau Wood’s, etc Battles have been fought in Iraq and Afghanistan? This may partially explain the lack of MOH’s There has been one \"Fallujah\" since the intitial high intensity combat. I think your reason is probably spot on.", 
        "intTime": 20090331, 
        "postID": 15, 
        "quote": "Originally posted by xnavycg: How many Iwo Jima’s, Okinawa’s, Tarawa’s, Guadalcanal’s, Battle of the Bulge’s, Normandy’s, Belleau Wood’s, etc Battles have been fought in Iraq and Afghanistan? This may partially explain the lack of MOH’s", 
        "reply": " There has been one \"Fallujah\" since the intitial high intensity combat. I think your reason is probably spot on.", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:28:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "There were MoHs awarded in 'Nam. There were even MoHs given for Mogadishu. There are several individuals whose actions would warrant an MoH (the Marine Kasal would be at the top of my list, following the Airman Rhyner). Maybe it's a matter of having enlisted guys walking around that officers would have to salute. I don't know...", 
        "intTime": 20090331, 
        "postID": 16, 
        "quote": "", 
        "reply": "There were MoHs awarded in 'Nam. There were even MoHs given for Mogadishu. There are several individuals whose actions would warrant an MoH (the Marine Kasal would be at the top of my list, following the Airman Rhyner). Maybe it's a matter of having enlisted guys walking around that officers would have to salute. I don't know...", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:37:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by outlaws93: well really moh's shouldnt be handed out a lot.. they should be withheld for heroic acts that are above and beyond the call of duty.... i fully support not giving them out too much it kind of dismissive the value of them if given out too much... I agree, but there are heroic acts, but they live to tell about it and they only get a Navy cross or distingued service medal for it. only a navy cross???", 
        "intTime": 20090331, 
        "postID": 17, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by outlaws93: well really moh's shouldnt be handed out a lot.. they should be withheld for heroic acts that are above and beyond the call of duty.... i fully support not giving them out too much it kind of dismissive the value of them if given out too much... I agree, but there are heroic acts, but they live to tell about it and they only get a Navy cross or distingued service medal for it.", 
        "reply": " only a navy cross???", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:40:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "One possible reason for the apparent disparity in numbers is that Iraq, and to a slightly lesser degree, Afghanistan, have tended to be very small unit operations ... squad, team, section, etc. That pushes award preparation to a lower level ... and makes validation more difficult. It would be interesting to see an analysis similar to that in the opening comment that compares nominations for the award rather than the numbers of awards actually given. My guess would be that percentage wise, far fewer nominations have been initiated for Iraq/Afghanistan than were initiated for other wars.", 
        "intTime": 20090331, 
        "postID": 18, 
        "quote": "", 
        "reply": "One possible reason for the apparent disparity in numbers is that Iraq, and to a slightly lesser degree, Afghanistan, have tended to be very small unit operations ... squad, team, section, etc. That pushes award preparation to a lower level ... and makes validation more difficult. It would be interesting to see an analysis similar to that in the opening comment that compares nominations for the award rather than the numbers of awards actually given. My guess would be that percentage wise, far fewer nominations have been initiated for Iraq/Afghanistan than were initiated for other wars.", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:43:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack? Anbar, it's not just the MOH. There has been a pattern in recent years to downgrade awards. It's always been done to some extent but it's gotten much worse over the last 10 years. I work with a guy who was hit by a RPG, blew his leg off but he kept returning fire till he ran out of ammo and passed out from blood loss. His suppressive fire while bleeding profusely saved a number of his Joes and he was put in for the Bronze Star. Believe it or not it was downgraded to an AAM with V device. There is no justice.", 
        "intTime": 20090331, 
        "postID": 19, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack?", 
        "reply": " Anbar, it's not just the MOH. There has been a pattern in recent years to downgrade awards. It's always been done to some extent but it's gotten much worse over the last 10 years. I work with a guy who was hit by a RPG, blew his leg off but he kept returning fire till he ran out of ammo and passed out from blood loss. His suppressive fire while bleeding profusely saved a number of his Joes and he was put in for the Bronze Star. Believe it or not it was downgraded to an AAM with V device. There is no justice.", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:51:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack? Anbar, it's not just the MOH. There has been a pattern in recent years to downgrade awards. It's always been done to some extent but it's gotten much worse over the last 10 years. I work with a guy who was hit by a RPG, blew his leg off but he kept returning fire till he ran out of ammo and passed out from blood loss. His suppressive fire while bleeding profusely saved a number of his Joes and he was put in for the Bronze Star. Believe it or not it was downgraded to an AAM with V device. There is no justice. But the problem is that it is being downgraded by some people who have never served. What makes them think they can decide how medal are awarded. And is it because they are enlisted and not officers....I don't think that is the case. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 20, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack? Anbar, it's not just the MOH. There has been a pattern in recent years to downgrade awards. It's always been done to some extent but it's gotten much worse over the last 10 years. I work with a guy who was hit by a RPG, blew his leg off but he kept returning fire till he ran out of ammo and passed out from blood loss. His suppressive fire while bleeding profusely saved a number of his Joes and he was put in for the Bronze Star. Believe it or not it was downgraded to an AAM with V device. There is no justice.", 
        "reply": " But the problem is that it is being downgraded by some people who have never served. What makes them think they can decide how medal are awarded. And is it because they are enlisted and not officers....I don't think that is the case. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 11:10:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "The number of Medal of Honor recipients from the wars in Iraq and Afghanistan can be counted on one hand. Each of the five acted spontaneously and heroically to save the lives of comrades. Each exemplified the medal’s criteria of “gallantry and intrepidity at the risk of one’s own life above and beyond the call of duty.” And each was killed in action or died from wounds received in action. From World War I through Vietnam, the rate of Medal of Honor recipients per 100,000 service members stayed between 2.3 (Korea) and 2.9 (World War II). But since the terrorist attacks of Sept. 11, 2001, only five Medals of Honor have been awarded, a rate of 0.1 per 100,000 — one in a million. A similar disparity occurs on the second tier of valor awards: Distinguished Service Cross, Navy Cross and Air Force Cross. Throughout the 20th century, the rate of service cross recipients per 100,000 troops ranged from a low of 19 in Korea to a high of 167 in World War I. But for the post-9/11 wars, it’s only one per 100,000. Why? More here: \"http://marinetimes.com/news/2009/03/military_medal_of_honor_032509w/\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 21, 
        "quote": "", 
        "reply": "The number of Medal of Honor recipients from the wars in Iraq and Afghanistan can be counted on one hand. Each of the five acted spontaneously and heroically to save the lives of comrades. Each exemplified the medal’s criteria of “gallantry and intrepidity at the risk of one’s own life above and beyond the call of duty.” And each was killed in action or died from wounds received in action. From World War I through Vietnam, the rate of Medal of Honor recipients per 100,000 service members stayed between 2.3 (Korea) and 2.9 (World War II). But since the terrorist attacks of Sept. 11, 2001, only five Medals of Honor have been awarded, a rate of 0.1 per 100,000 — one in a million. A similar disparity occurs on the second tier of valor awards: Distinguished Service Cross, Navy Cross and Air Force Cross. Throughout the 20th century, the rate of service cross recipients per 100,000 troops ranged from a low of 19 in Korea to a high of 167 in World War I. But for the post-9/11 wars, it’s only one per 100,000. Why? More here: \"http://marinetimes.com/news/2009/03/military_medal_of_honor_032509w/\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:10:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Though I too wonder why more MOH's aren't being given, I just have to say that in my opinion, anyone who served over there or is there now are heroes in my book. Don", 
        "intTime": 20090331, 
        "postID": 22, 
        "quote": "", 
        "reply": "Though I too wonder why more MOH's aren't being given, I just have to say that in my opinion, anyone who served over there or is there now are heroes in my book. Don", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:21:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Though I too wonder why more MOH's aren't being given, I just have to say that in my opinion, anyone who served over there or is there now are heroes in my book. Don This is true and I agree with you. Yet, it still makes you wonder why now do you have to die to recieve the MOH. When if you did the same thing, but did not die you do not receive it but you will get the second highest medal. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 23, 
        "quote": "Originally posted by 21yrsUSCGUSCS: Though I too wonder why more MOH's aren't being given, I just have to say that in my opinion, anyone who served over there or is there now are heroes in my book. Don", 
        "reply": " This is true and I agree with you. Yet, it still makes you wonder why now do you have to die to recieve the MOH. When if you did the same thing, but did not die you do not receive it but you will get the second highest medal. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:24:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "How many Iwo Jima’s, Okinawa’s, Tarawa’s, Guadalcanal’s, Battle of the Bulge’s, Normandy’s, Belleau Wood’s, etc Battles have been fought in Iraq and Afghanistan? This may partially explain the lack of MOH’s", 
        "intTime": 20090331, 
        "postID": 24, 
        "quote": "", 
        "reply": "How many Iwo Jima’s, Okinawa’s, Tarawa’s, Guadalcanal’s, Battle of the Bulge’s, Normandy’s, Belleau Wood’s, etc Battles have been fought in Iraq and Afghanistan? This may partially explain the lack of MOH’s", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:44:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "xnavycg"
    }, 
    {
        "content": "Two possible reasons come to my mind: It appears that \"posthumous\" has become an \"unofficial official\" criteria for being awarded the MOH. Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. OTOH, the opportunities for posthumous award have also declined because of our superb battlefield medical care. Second, given the nature of the conflicts in Iraq and A-stan, the general lack of prolonged, close combat against a conventional enemy that normally produces the vast majority of MOH nominations, is probably a factor also. Just my .01 worth.", 
        "intTime": 20090331, 
        "postID": 25, 
        "quote": "", 
        "reply": "Two possible reasons come to my mind: It appears that \"posthumous\" has become an \"unofficial official\" criteria for being awarded the MOH. Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. OTOH, the opportunities for posthumous award have also declined because of our superb battlefield medical care. Second, given the nature of the conflicts in Iraq and A-stan, the general lack of prolonged, close combat against a conventional enemy that normally produces the vast majority of MOH nominations, is probably a factor also. Just my .01 worth.", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:45:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: How many Iwo Jima’s, Okinawa’s, Tarawa’s, Guadalcanal’s, Battle of the Bulge’s, Normandy’s, Belleau Wood’s, etc Battles have been fought in Iraq and Afghanistan? This may partially explain the lack of MOH’s How many beaches and islands are in Iraq and A-Stan that may partially explain your response. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 26, 
        "quote": "Originally posted by xnavycg: How many Iwo Jima’s, Okinawa’s, Tarawa’s, Guadalcanal’s, Battle of the Bulge’s, Normandy’s, Belleau Wood’s, etc Battles have been fought in Iraq and Afghanistan? This may partially explain the lack of MOH’s", 
        "reply": " How many beaches and islands are in Iraq and A-Stan that may partially explain your response. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:53:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Two possible reasons come to my mind: It appears that \"posthumous\" has become an \"unofficial official\" criteria for being awarded the MOH. Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. OTOH, the opportunities for posthumous award have also declined because of our superb battlefield medical care. Second, given the nature of the conflicts in Iraq and A-stan, the general lack of prolonged, close combat against a conventional enemy that normally produces the vast majority of MOH nominations, is probably a factor also. Just my .01 worth. True, but one has to jump on a grendae to earn a MOH. Just because they cleared a trench full of enemy and didn't die, does that mean they are not worthy of a MOH? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 27, 
        "quote": "Originally posted by Motive25: Two possible reasons come to my mind: It appears that \"posthumous\" has become an \"unofficial official\" criteria for being awarded the MOH. Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. OTOH, the opportunities for posthumous award have also declined because of our superb battlefield medical care. Second, given the nature of the conflicts in Iraq and A-stan, the general lack of prolonged, close combat against a conventional enemy that normally produces the vast majority of MOH nominations, is probably a factor also. Just my .01 worth.", 
        "reply": " True, but one has to jump on a grendae to earn a MOH. Just because they cleared a trench full of enemy and didn't die, does that mean they are not worthy of a MOH? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:55:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090331, 
        "postID": 28, 
        "quote": "", 
        "reply": "Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:10:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Motive25: Two possible reasons come to my mind: It appears that \"posthumous\" has become an \"unofficial official\" criteria for being awarded the MOH. Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. OTOH, the opportunities for posthumous award have also declined because of our superb battlefield medical care. Second, given the nature of the conflicts in Iraq and A-stan, the general lack of prolonged, close combat against a conventional enemy that normally produces the vast majority of MOH nominations, is probably a factor also. Just my .01 worth. True, but one has to jump on a grendae to earn a MOH. Just because they cleared a trench full of enemy and didn't die, does that mean they are not worthy of a MOH? I personally wouldn't say they're not worthy, but that appears to be the standard now- you have to die, and since we are saving more wounded than ever before, the chances of being awarded the MOH are going down.", 
        "intTime": 20090331, 
        "postID": 29, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Motive25: Two possible reasons come to my mind: It appears that \"posthumous\" has become an \"unofficial official\" criteria for being awarded the MOH. Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. OTOH, the opportunities for posthumous award have also declined because of our superb battlefield medical care. Second, given the nature of the conflicts in Iraq and A-stan, the general lack of prolonged, close combat against a conventional enemy that normally produces the vast majority of MOH nominations, is probably a factor also. Just my .01 worth. True, but one has to jump on a grendae to earn a MOH. Just because they cleared a trench full of enemy and didn't die, does that mean they are not worthy of a MOH?", 
        "reply": " I personally wouldn't say they're not worthy, but that appears to be the standard now- you have to die, and since we are saving more wounded than ever before, the chances of being awarded the MOH are going down.", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:20:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Motive25"
    }, 
    {
        "content": "well really moh's shouldnt be handed out a lot.. they should be withheld for heroic acts that are above and beyond the call of duty.... i fully support not giving them out too much it kind of dismissive the value of them if given out too much...", 
        "intTime": 20090331, 
        "postID": 30, 
        "quote": "", 
        "reply": "well really moh's shouldnt be handed out a lot.. they should be withheld for heroic acts that are above and beyond the call of duty.... i fully support not giving them out too much it kind of dismissive the value of them if given out too much...", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:20:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 31, 
        "quote": "Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent.", 
        "reply": " Why is that Jack? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:21:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. Not challenging but would be interested in links to any examples you might have. The only \"downgrade\" that I am aware of that attracted significant attention was that of Peralta ... and there the issue was whether his action was a conscious sacrifice of himself. He got the Navy Cross. Assuming the validity of the reason given for downgrading the award, that same reason would seem to apply as well for not awarding the Navy Cross ... so I've never fully understood that one.", 
        "intTime": 20090331, 
        "postID": 32, 
        "quote": "Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question.", 
        "reply": " Not challenging but would be interested in links to any examples you might have. The only \"downgrade\" that I am aware of that attracted significant attention was that of Peralta ... and there the issue was whether his action was a conscious sacrifice of himself. He got the Navy Cross. Assuming the validity of the reason given for downgrading the award, that same reason would seem to apply as well for not awarding the Navy Cross ... so I've never fully understood that one.", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:22:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack? Beats me ... Perhaps the military should redefine the parameters for it, whatever that would be. I agree, some very heroic acts are going on there, and so few MOH's. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090331, 
        "postID": 33, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack?", 
        "reply": " Beats me ... Perhaps the military should redefine the parameters for it, whatever that would be. I agree, some very heroic acts are going on there, and so few MOH's. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:23:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: well really moh's shouldnt be handed out a lot.. they should be withheld for heroic acts that are above and beyond the call of duty.... i fully support not giving them out too much it kind of dismissive the value of them if given out too much... I agree, but there are heroic acts, but they live to tell about it and they only get a Navy cross or distingued service medal for it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 34, 
        "quote": "Originally posted by outlaws93: well really moh's shouldnt be handed out a lot.. they should be withheld for heroic acts that are above and beyond the call of duty.... i fully support not giving them out too much it kind of dismissive the value of them if given out too much...", 
        "reply": " I agree, but there are heroic acts, but they live to tell about it and they only get a Navy cross or distingued service medal for it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:24:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: How many Iwo Jima’s, Okinawa’s, Tarawa’s, Guadalcanal’s, Battle of the Bulge’s, Normandy’s, Belleau Wood’s, etc Battles have been fought in Iraq and Afghanistan? This may partially explain the lack of MOH’s There has been one \"Fallujah\" since the intitial high intensity combat. I think your reason is probably spot on.", 
        "intTime": 20090331, 
        "postID": 35, 
        "quote": "Originally posted by xnavycg: How many Iwo Jima’s, Okinawa’s, Tarawa’s, Guadalcanal’s, Battle of the Bulge’s, Normandy’s, Belleau Wood’s, etc Battles have been fought in Iraq and Afghanistan? This may partially explain the lack of MOH’s", 
        "reply": " There has been one \"Fallujah\" since the intitial high intensity combat. I think your reason is probably spot on.", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:28:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "There were MoHs awarded in 'Nam. There were even MoHs given for Mogadishu. There are several individuals whose actions would warrant an MoH (the Marine Kasal would be at the top of my list, following the Airman Rhyner). Maybe it's a matter of having enlisted guys walking around that officers would have to salute. I don't know...", 
        "intTime": 20090331, 
        "postID": 36, 
        "quote": "", 
        "reply": "There were MoHs awarded in 'Nam. There were even MoHs given for Mogadishu. There are several individuals whose actions would warrant an MoH (the Marine Kasal would be at the top of my list, following the Airman Rhyner). Maybe it's a matter of having enlisted guys walking around that officers would have to salute. I don't know...", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:37:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by outlaws93: well really moh's shouldnt be handed out a lot.. they should be withheld for heroic acts that are above and beyond the call of duty.... i fully support not giving them out too much it kind of dismissive the value of them if given out too much... I agree, but there are heroic acts, but they live to tell about it and they only get a Navy cross or distingued service medal for it. only a navy cross???", 
        "intTime": 20090331, 
        "postID": 37, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by outlaws93: well really moh's shouldnt be handed out a lot.. they should be withheld for heroic acts that are above and beyond the call of duty.... i fully support not giving them out too much it kind of dismissive the value of them if given out too much... I agree, but there are heroic acts, but they live to tell about it and they only get a Navy cross or distingued service medal for it.", 
        "reply": " only a navy cross???", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:40:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "One possible reason for the apparent disparity in numbers is that Iraq, and to a slightly lesser degree, Afghanistan, have tended to be very small unit operations ... squad, team, section, etc. That pushes award preparation to a lower level ... and makes validation more difficult. It would be interesting to see an analysis similar to that in the opening comment that compares nominations for the award rather than the numbers of awards actually given. My guess would be that percentage wise, far fewer nominations have been initiated for Iraq/Afghanistan than were initiated for other wars.", 
        "intTime": 20090331, 
        "postID": 38, 
        "quote": "", 
        "reply": "One possible reason for the apparent disparity in numbers is that Iraq, and to a slightly lesser degree, Afghanistan, have tended to be very small unit operations ... squad, team, section, etc. That pushes award preparation to a lower level ... and makes validation more difficult. It would be interesting to see an analysis similar to that in the opening comment that compares nominations for the award rather than the numbers of awards actually given. My guess would be that percentage wise, far fewer nominations have been initiated for Iraq/Afghanistan than were initiated for other wars.", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:43:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack? Anbar, it's not just the MOH. There has been a pattern in recent years to downgrade awards. It's always been done to some extent but it's gotten much worse over the last 10 years. I work with a guy who was hit by a RPG, blew his leg off but he kept returning fire till he ran out of ammo and passed out from blood loss. His suppressive fire while bleeding profusely saved a number of his Joes and he was put in for the Bronze Star. Believe it or not it was downgraded to an AAM with V device. There is no justice.", 
        "intTime": 20090331, 
        "postID": 39, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack?", 
        "reply": " Anbar, it's not just the MOH. There has been a pattern in recent years to downgrade awards. It's always been done to some extent but it's gotten much worse over the last 10 years. I work with a guy who was hit by a RPG, blew his leg off but he kept returning fire till he ran out of ammo and passed out from blood loss. His suppressive fire while bleeding profusely saved a number of his Joes and he was put in for the Bronze Star. Believe it or not it was downgraded to an AAM with V device. There is no justice.", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:51:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack? Anbar, it's not just the MOH. There has been a pattern in recent years to downgrade awards. It's always been done to some extent but it's gotten much worse over the last 10 years. I work with a guy who was hit by a RPG, blew his leg off but he kept returning fire till he ran out of ammo and passed out from blood loss. His suppressive fire while bleeding profusely saved a number of his Joes and he was put in for the Bronze Star. Believe it or not it was downgraded to an AAM with V device. There is no justice. But the problem is that it is being downgraded by some people who have never served. What makes them think they can decide how medal are awarded. And is it because they are enlisted and not officers....I don't think that is the case. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 40, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack? Anbar, it's not just the MOH. There has been a pattern in recent years to downgrade awards. It's always been done to some extent but it's gotten much worse over the last 10 years. I work with a guy who was hit by a RPG, blew his leg off but he kept returning fire till he ran out of ammo and passed out from blood loss. His suppressive fire while bleeding profusely saved a number of his Joes and he was put in for the Bronze Star. Believe it or not it was downgraded to an AAM with V device. There is no justice.", 
        "reply": " But the problem is that it is being downgraded by some people who have never served. What makes them think they can decide how medal are awarded. And is it because they are enlisted and not officers....I don't think that is the case. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 11:10:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "The number of Medal of Honor recipients from the wars in Iraq and Afghanistan can be counted on one hand. Each of the five acted spontaneously and heroically to save the lives of comrades. Each exemplified the medal’s criteria of “gallantry and intrepidity at the risk of one’s own life above and beyond the call of duty.” And each was killed in action or died from wounds received in action. From World War I through Vietnam, the rate of Medal of Honor recipients per 100,000 service members stayed between 2.3 (Korea) and 2.9 (World War II). But since the terrorist attacks of Sept. 11, 2001, only five Medals of Honor have been awarded, a rate of 0.1 per 100,000 — one in a million. A similar disparity occurs on the second tier of valor awards: Distinguished Service Cross, Navy Cross and Air Force Cross. Throughout the 20th century, the rate of service cross recipients per 100,000 troops ranged from a low of 19 in Korea to a high of 167 in World War I. But for the post-9/11 wars, it’s only one per 100,000. Why? More here: \"http://marinetimes.com/news/2009/03/military_medal_of_honor_032509w/\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 41, 
        "quote": "", 
        "reply": "The number of Medal of Honor recipients from the wars in Iraq and Afghanistan can be counted on one hand. Each of the five acted spontaneously and heroically to save the lives of comrades. Each exemplified the medal’s criteria of “gallantry and intrepidity at the risk of one’s own life above and beyond the call of duty.” And each was killed in action or died from wounds received in action. From World War I through Vietnam, the rate of Medal of Honor recipients per 100,000 service members stayed between 2.3 (Korea) and 2.9 (World War II). But since the terrorist attacks of Sept. 11, 2001, only five Medals of Honor have been awarded, a rate of 0.1 per 100,000 — one in a million. A similar disparity occurs on the second tier of valor awards: Distinguished Service Cross, Navy Cross and Air Force Cross. Throughout the 20th century, the rate of service cross recipients per 100,000 troops ranged from a low of 19 in Korea to a high of 167 in World War I. But for the post-9/11 wars, it’s only one per 100,000. Why? More here: \"http://marinetimes.com/news/2009/03/military_medal_of_honor_032509w/\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:10:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Though I too wonder why more MOH's aren't being given, I just have to say that in my opinion, anyone who served over there or is there now are heroes in my book. Don", 
        "intTime": 20090331, 
        "postID": 42, 
        "quote": "", 
        "reply": "Though I too wonder why more MOH's aren't being given, I just have to say that in my opinion, anyone who served over there or is there now are heroes in my book. Don", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:21:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Though I too wonder why more MOH's aren't being given, I just have to say that in my opinion, anyone who served over there or is there now are heroes in my book. Don This is true and I agree with you. Yet, it still makes you wonder why now do you have to die to recieve the MOH. When if you did the same thing, but did not die you do not receive it but you will get the second highest medal. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 43, 
        "quote": "Originally posted by 21yrsUSCGUSCS: Though I too wonder why more MOH's aren't being given, I just have to say that in my opinion, anyone who served over there or is there now are heroes in my book. Don", 
        "reply": " This is true and I agree with you. Yet, it still makes you wonder why now do you have to die to recieve the MOH. When if you did the same thing, but did not die you do not receive it but you will get the second highest medal. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:24:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "How many Iwo Jima’s, Okinawa’s, Tarawa’s, Guadalcanal’s, Battle of the Bulge’s, Normandy’s, Belleau Wood’s, etc Battles have been fought in Iraq and Afghanistan? This may partially explain the lack of MOH’s", 
        "intTime": 20090331, 
        "postID": 44, 
        "quote": "", 
        "reply": "How many Iwo Jima’s, Okinawa’s, Tarawa’s, Guadalcanal’s, Battle of the Bulge’s, Normandy’s, Belleau Wood’s, etc Battles have been fought in Iraq and Afghanistan? This may partially explain the lack of MOH’s", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:44:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "xnavycg"
    }, 
    {
        "content": "Two possible reasons come to my mind: It appears that \"posthumous\" has become an \"unofficial official\" criteria for being awarded the MOH. Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. OTOH, the opportunities for posthumous award have also declined because of our superb battlefield medical care. Second, given the nature of the conflicts in Iraq and A-stan, the general lack of prolonged, close combat against a conventional enemy that normally produces the vast majority of MOH nominations, is probably a factor also. Just my .01 worth.", 
        "intTime": 20090331, 
        "postID": 45, 
        "quote": "", 
        "reply": "Two possible reasons come to my mind: It appears that \"posthumous\" has become an \"unofficial official\" criteria for being awarded the MOH. Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. OTOH, the opportunities for posthumous award have also declined because of our superb battlefield medical care. Second, given the nature of the conflicts in Iraq and A-stan, the general lack of prolonged, close combat against a conventional enemy that normally produces the vast majority of MOH nominations, is probably a factor also. Just my .01 worth.", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:45:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: How many Iwo Jima’s, Okinawa’s, Tarawa’s, Guadalcanal’s, Battle of the Bulge’s, Normandy’s, Belleau Wood’s, etc Battles have been fought in Iraq and Afghanistan? This may partially explain the lack of MOH’s How many beaches and islands are in Iraq and A-Stan that may partially explain your response. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 46, 
        "quote": "Originally posted by xnavycg: How many Iwo Jima’s, Okinawa’s, Tarawa’s, Guadalcanal’s, Battle of the Bulge’s, Normandy’s, Belleau Wood’s, etc Battles have been fought in Iraq and Afghanistan? This may partially explain the lack of MOH’s", 
        "reply": " How many beaches and islands are in Iraq and A-Stan that may partially explain your response. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:53:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Two possible reasons come to my mind: It appears that \"posthumous\" has become an \"unofficial official\" criteria for being awarded the MOH. Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. OTOH, the opportunities for posthumous award have also declined because of our superb battlefield medical care. Second, given the nature of the conflicts in Iraq and A-stan, the general lack of prolonged, close combat against a conventional enemy that normally produces the vast majority of MOH nominations, is probably a factor also. Just my .01 worth. True, but one has to jump on a grendae to earn a MOH. Just because they cleared a trench full of enemy and didn't die, does that mean they are not worthy of a MOH? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 47, 
        "quote": "Originally posted by Motive25: Two possible reasons come to my mind: It appears that \"posthumous\" has become an \"unofficial official\" criteria for being awarded the MOH. Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. OTOH, the opportunities for posthumous award have also declined because of our superb battlefield medical care. Second, given the nature of the conflicts in Iraq and A-stan, the general lack of prolonged, close combat against a conventional enemy that normally produces the vast majority of MOH nominations, is probably a factor also. Just my .01 worth.", 
        "reply": " True, but one has to jump on a grendae to earn a MOH. Just because they cleared a trench full of enemy and didn't die, does that mean they are not worthy of a MOH? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 07:55:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090331, 
        "postID": 48, 
        "quote": "", 
        "reply": "Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:10:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Motive25: Two possible reasons come to my mind: It appears that \"posthumous\" has become an \"unofficial official\" criteria for being awarded the MOH. Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. OTOH, the opportunities for posthumous award have also declined because of our superb battlefield medical care. Second, given the nature of the conflicts in Iraq and A-stan, the general lack of prolonged, close combat against a conventional enemy that normally produces the vast majority of MOH nominations, is probably a factor also. Just my .01 worth. True, but one has to jump on a grendae to earn a MOH. Just because they cleared a trench full of enemy and didn't die, does that mean they are not worthy of a MOH? I personally wouldn't say they're not worthy, but that appears to be the standard now- you have to die, and since we are saving more wounded than ever before, the chances of being awarded the MOH are going down.", 
        "intTime": 20090331, 
        "postID": 49, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Motive25: Two possible reasons come to my mind: It appears that \"posthumous\" has become an \"unofficial official\" criteria for being awarded the MOH. Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. OTOH, the opportunities for posthumous award have also declined because of our superb battlefield medical care. Second, given the nature of the conflicts in Iraq and A-stan, the general lack of prolonged, close combat against a conventional enemy that normally produces the vast majority of MOH nominations, is probably a factor also. Just my .01 worth. True, but one has to jump on a grendae to earn a MOH. Just because they cleared a trench full of enemy and didn't die, does that mean they are not worthy of a MOH?", 
        "reply": " I personally wouldn't say they're not worthy, but that appears to be the standard now- you have to die, and since we are saving more wounded than ever before, the chances of being awarded the MOH are going down.", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:20:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Motive25"
    }, 
    {
        "content": "well really moh's shouldnt be handed out a lot.. they should be withheld for heroic acts that are above and beyond the call of duty.... i fully support not giving them out too much it kind of dismissive the value of them if given out too much...", 
        "intTime": 20090331, 
        "postID": 50, 
        "quote": "", 
        "reply": "well really moh's shouldnt be handed out a lot.. they should be withheld for heroic acts that are above and beyond the call of duty.... i fully support not giving them out too much it kind of dismissive the value of them if given out too much...", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:20:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 51, 
        "quote": "Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent.", 
        "reply": " Why is that Jack? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:21:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question. Not challenging but would be interested in links to any examples you might have. The only \"downgrade\" that I am aware of that attracted significant attention was that of Peralta ... and there the issue was whether his action was a conscious sacrifice of himself. He got the Navy Cross. Assuming the validity of the reason given for downgrading the award, that same reason would seem to apply as well for not awarding the Navy Cross ... so I've never fully understood that one.", 
        "intTime": 20090331, 
        "postID": 52, 
        "quote": "Why that is, I don't know, but I seem to recall a couple of cases of individuals having their MOH nominations downgraded apparently because they lived through the event in question.", 
        "reply": " Not challenging but would be interested in links to any examples you might have. The only \"downgrade\" that I am aware of that attracted significant attention was that of Peralta ... and there the issue was whether his action was a conscious sacrifice of himself. He got the Navy Cross. Assuming the validity of the reason given for downgrading the award, that same reason would seem to apply as well for not awarding the Navy Cross ... so I've never fully understood that one.", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:22:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack? Beats me ... Perhaps the military should redefine the parameters for it, whatever that would be. I agree, some very heroic acts are going on there, and so few MOH's. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090331, 
        "postID": 53, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack?", 
        "reply": " Beats me ... Perhaps the military should redefine the parameters for it, whatever that would be. I agree, some very heroic acts are going on there, and so few MOH's. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:23:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: well really moh's shouldnt be handed out a lot.. they should be withheld for heroic acts that are above and beyond the call of duty.... i fully support not giving them out too much it kind of dismissive the value of them if given out too much... I agree, but there are heroic acts, but they live to tell about it and they only get a Navy cross or distingued service medal for it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 54, 
        "quote": "Originally posted by outlaws93: well really moh's shouldnt be handed out a lot.. they should be withheld for heroic acts that are above and beyond the call of duty.... i fully support not giving them out too much it kind of dismissive the value of them if given out too much...", 
        "reply": " I agree, but there are heroic acts, but they live to tell about it and they only get a Navy cross or distingued service medal for it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:24:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: How many Iwo Jima’s, Okinawa’s, Tarawa’s, Guadalcanal’s, Battle of the Bulge’s, Normandy’s, Belleau Wood’s, etc Battles have been fought in Iraq and Afghanistan? This may partially explain the lack of MOH’s There has been one \"Fallujah\" since the intitial high intensity combat. I think your reason is probably spot on.", 
        "intTime": 20090331, 
        "postID": 55, 
        "quote": "Originally posted by xnavycg: How many Iwo Jima’s, Okinawa’s, Tarawa’s, Guadalcanal’s, Battle of the Bulge’s, Normandy’s, Belleau Wood’s, etc Battles have been fought in Iraq and Afghanistan? This may partially explain the lack of MOH’s", 
        "reply": " There has been one \"Fallujah\" since the intitial high intensity combat. I think your reason is probably spot on.", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:28:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "M1Lase_n_Blaze"
    }, 
    {
        "content": "There were MoHs awarded in 'Nam. There were even MoHs given for Mogadishu. There are several individuals whose actions would warrant an MoH (the Marine Kasal would be at the top of my list, following the Airman Rhyner). Maybe it's a matter of having enlisted guys walking around that officers would have to salute. I don't know...", 
        "intTime": 20090331, 
        "postID": 56, 
        "quote": "", 
        "reply": "There were MoHs awarded in 'Nam. There were even MoHs given for Mogadishu. There are several individuals whose actions would warrant an MoH (the Marine Kasal would be at the top of my list, following the Airman Rhyner). Maybe it's a matter of having enlisted guys walking around that officers would have to salute. I don't know...", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:37:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by outlaws93: well really moh's shouldnt be handed out a lot.. they should be withheld for heroic acts that are above and beyond the call of duty.... i fully support not giving them out too much it kind of dismissive the value of them if given out too much... I agree, but there are heroic acts, but they live to tell about it and they only get a Navy cross or distingued service medal for it. only a navy cross???", 
        "intTime": 20090331, 
        "postID": 57, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by outlaws93: well really moh's shouldnt be handed out a lot.. they should be withheld for heroic acts that are above and beyond the call of duty.... i fully support not giving them out too much it kind of dismissive the value of them if given out too much... I agree, but there are heroic acts, but they live to tell about it and they only get a Navy cross or distingued service medal for it.", 
        "reply": " only a navy cross???", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:40:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "One possible reason for the apparent disparity in numbers is that Iraq, and to a slightly lesser degree, Afghanistan, have tended to be very small unit operations ... squad, team, section, etc. That pushes award preparation to a lower level ... and makes validation more difficult. It would be interesting to see an analysis similar to that in the opening comment that compares nominations for the award rather than the numbers of awards actually given. My guess would be that percentage wise, far fewer nominations have been initiated for Iraq/Afghanistan than were initiated for other wars.", 
        "intTime": 20090331, 
        "postID": 58, 
        "quote": "", 
        "reply": "One possible reason for the apparent disparity in numbers is that Iraq, and to a slightly lesser degree, Afghanistan, have tended to be very small unit operations ... squad, team, section, etc. That pushes award preparation to a lower level ... and makes validation more difficult. It would be interesting to see an analysis similar to that in the opening comment that compares nominations for the award rather than the numbers of awards actually given. My guess would be that percentage wise, far fewer nominations have been initiated for Iraq/Afghanistan than were initiated for other wars.", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:43:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack? Anbar, it's not just the MOH. There has been a pattern in recent years to downgrade awards. It's always been done to some extent but it's gotten much worse over the last 10 years. I work with a guy who was hit by a RPG, blew his leg off but he kept returning fire till he ran out of ammo and passed out from blood loss. His suppressive fire while bleeding profusely saved a number of his Joes and he was put in for the Bronze Star. Believe it or not it was downgraded to an AAM with V device. There is no justice.", 
        "intTime": 20090331, 
        "postID": 59, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack?", 
        "reply": " Anbar, it's not just the MOH. There has been a pattern in recent years to downgrade awards. It's always been done to some extent but it's gotten much worse over the last 10 years. I work with a guy who was hit by a RPG, blew his leg off but he kept returning fire till he ran out of ammo and passed out from blood loss. His suppressive fire while bleeding profusely saved a number of his Joes and he was put in for the Bronze Star. Believe it or not it was downgraded to an AAM with V device. There is no justice.", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 08:51:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack? Anbar, it's not just the MOH. There has been a pattern in recent years to downgrade awards. It's always been done to some extent but it's gotten much worse over the last 10 years. I work with a guy who was hit by a RPG, blew his leg off but he kept returning fire till he ran out of ammo and passed out from blood loss. His suppressive fire while bleeding profusely saved a number of his Joes and he was put in for the Bronze Star. Believe it or not it was downgraded to an AAM with V device. There is no justice. But the problem is that it is being downgraded by some people who have never served. What makes them think they can decide how medal are awarded. And is it because they are enlisted and not officers....I don't think that is the case. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 60, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by jack_flats: Apparently Iraq isn't the kind of war that one would associate with a conventional type war where MOH's are more prevalent. Why is that Jack? Anbar, it's not just the MOH. There has been a pattern in recent years to downgrade awards. It's always been done to some extent but it's gotten much worse over the last 10 years. I work with a guy who was hit by a RPG, blew his leg off but he kept returning fire till he ran out of ammo and passed out from blood loss. His suppressive fire while bleeding profusely saved a number of his Joes and he was put in for the Bronze Star. Believe it or not it was downgraded to an AAM with V device. There is no justice.", 
        "reply": " But the problem is that it is being downgraded by some people who have never served. What makes them think they can decide how medal are awarded. And is it because they are enlisted and not officers....I don't think that is the case. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3290024912001", 
        "time": "2009-03-31 11:10:00", 
        "title": "Why have Iraq and Afghanistan produced only 5 Medal of Honor recipients, none living?", 
        "userID": "Anbar7"
    }
]