[
    {
        "content": "http://www.military.com/news/article/iraq-wants-gis-out-of-cities-by-july.html As usual Iraq remains off the front page because there's nothing 'out of the ordinary' to report. The past (Abu Gharib), and the future, (withdrawals) are news, but the run-of-the-mill violence doesn't warrant attention. Last week 168 Iraqis were killed in more than 40 shooting or bombing incidents. A few were reputed to be 'terrorists'; the greater part were police, soldiers and civilians. In addition to the dead, more than 327 were wounded. US forces were in the 'hot seat' for killing of the wife of a tribal leader during a raid, and a patrol running over an Iraqi man and leaving the scene. US forces were also being sued by the family of a Hungarian man killed last year. One inidentified corpse was found. 23 Iraqis were reported arrested for security reasons. US forces reported the deaths of 4 personnel in Iraq and the wounding of 8. The USAF flew a reported total of 161 tactical missions for Operation Iraqi Freedom. On-going problems in the Iraqi oil industry due to political issues were reported by business sources.", 
        "intTime": 20090428, 
        "postID": 1, 
        "quote": "", 
        "reply": "http://www.military.com/news/article/iraq-wants-gis-out-of-cities-by-july.html As usual Iraq remains off the front page because there's nothing 'out of the ordinary' to report. The past (Abu Gharib), and the future, (withdrawals) are news, but the run-of-the-mill violence doesn't warrant attention. Last week 168 Iraqis were killed in more than 40 shooting or bombing incidents. A few were reputed to be 'terrorists'; the greater part were police, soldiers and civilians. In addition to the dead, more than 327 were wounded. US forces were in the 'hot seat' for killing of the wife of a tribal leader during a raid, and a patrol running over an Iraqi man and leaving the scene. US forces were also being sued by the family of a Hungarian man killed last year. One inidentified corpse was found. 23 Iraqis were reported arrested for security reasons. US forces reported the deaths of 4 personnel in Iraq and the wounding of 8. The USAF flew a reported total of 161 tactical missions for Operation Iraqi Freedom. On-going problems in the Iraqi oil industry due to political issues were reported by business sources.", 
        "threadID": "672198221_7280059122001", 
        "time": "2009-04-28 07:50:00", 
        "title": "All Quiet in Iraq", 
        "userID": "popsiq"
    }, 
    {
        "content": "During the closing months of the 2008 Presidential election, you could see on the faces of the Republican candidates that they were this close to pulling a mission accomplished all over again. McCain was straining to prevent himself from claiming we've won in Iraq.", 
        "intTime": 20090428, 
        "postID": 2, 
        "quote": "", 
        "reply": "During the closing months of the 2008 Presidential election, you could see on the faces of the Republican candidates that they were this close to pulling a mission accomplished all over again. McCain was straining to prevent himself from claiming we've won in Iraq.", 
        "threadID": "672198221_7280059122001", 
        "time": "2009-04-28 08:42:00", 
        "title": "All Quiet in Iraq", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: During the closing months of the 2008 Presidential election, you could see on the faces of the Republican candidates that they were this close to pulling a mission accomplished all over again. McCain was straining to prevent himself from claiming we've won in Iraq. We did win in Iraq. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090428, 
        "postID": 3, 
        "quote": "Originally posted by mrmixitup: During the closing months of the 2008 Presidential election, you could see on the faces of the Republican candidates that they were this close to pulling a mission accomplished all over again. McCain was straining to prevent himself from claiming we've won in Iraq.", 
        "reply": " We did win in Iraq. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7280059122001", 
        "time": "2009-04-28 10:38:00", 
        "title": "All Quiet in Iraq", 
        "userID": "Anbar7"
    }, 
    {
        "content": "You must have missed your quarterly payment to the newspaper, my headlines have been full of Iraqi. A drought has caused salination, lack of agrilculture and the marsh Arabs are suffering. The prices of oil is hurting the Baghdad government, Russia has made bids to explore for more. They failed to recognize the Baath party (again) sending talks back of reconciliation in a tailspin and of course the badarse American's are again beating up the Iranian representitives in the south. Americans will not be asked to return to the populated area's. I would recommend a change in selection of media.", 
        "intTime": 20090428, 
        "postID": 4, 
        "quote": "", 
        "reply": "You must have missed your quarterly payment to the newspaper, my headlines have been full of Iraqi. A drought has caused salination, lack of agrilculture and the marsh Arabs are suffering. The prices of oil is hurting the Baghdad government, Russia has made bids to explore for more. They failed to recognize the Baath party (again) sending talks back of reconciliation in a tailspin and of course the badarse American's are again beating up the Iranian representitives in the south. Americans will not be asked to return to the populated area's. I would recommend a change in selection of media.", 
        "threadID": "672198221_7280059122001", 
        "time": "2009-04-28 13:33:00", 
        "title": "All Quiet in Iraq", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mrmixitup: During the closing months of the 2008 Presidential election, you could see on the faces of the Republican candidates that they were this close to pulling a mission accomplished all over again. McCain was straining to prevent himself from claiming we've won in Iraq. We did win in Iraq. Yup so lets bring everyone home from Iraq. it's over.", 
        "intTime": 20090428, 
        "postID": 5, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mrmixitup: During the closing months of the 2008 Presidential election, you could see on the faces of the Republican candidates that they were this close to pulling a mission accomplished all over again. McCain was straining to prevent himself from claiming we've won in Iraq. We did win in Iraq.", 
        "reply": " Yup so lets bring everyone home from Iraq. it's over.", 
        "threadID": "672198221_7280059122001", 
        "time": "2009-04-28 15:18:00", 
        "title": "All Quiet in Iraq", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Anbar7: quote: Originally posted by mrmixitup: During the closing months of the 2008 Presidential election, you could see on the faces of the Republican candidates that they were this close to pulling a mission accomplished all over again. McCain was straining to prevent himself from claiming we've won in Iraq. We did win in Iraq. Yup so lets bring everyone home from Iraq. it's over. Iraq is far from over. While the world see little fighting. They have gone underground and started building up for the next round. Its like a base ball game you hit the ball and you start running but while your running will you notice the left fielder getting in to place to catch the ball. they are that left fielder and there pretty much waiting and building up.", 
        "intTime": 20090429, 
        "postID": 6, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Anbar7: quote: Originally posted by mrmixitup: During the closing months of the 2008 Presidential election, you could see on the faces of the Republican candidates that they were this close to pulling a mission accomplished all over again. McCain was straining to prevent himself from claiming we've won in Iraq. We did win in Iraq. Yup so lets bring everyone home from Iraq. it's over.", 
        "reply": " Iraq is far from over. While the world see little fighting. They have gone underground and started building up for the next round. Its like a base ball game you hit the ball and you start running but while your running will you notice the left fielder getting in to place to catch the ball. they are that left fielder and there pretty much waiting and building up.", 
        "threadID": "672198221_7280059122001", 
        "time": "2009-04-29 00:29:00", 
        "title": "All Quiet in Iraq", 
        "userID": "world_king377"
    }
]