[
    {
        "content": "quote: NAIROBI, Kenya – Three flawless shots. Three pirates killed. Bracing themselves on a rolling warship in choppy seas, U.S. Navy snipers took down a trio of Somali pirates with single shots, freeing the American sea captain being held at gunpoint, a Navy commander said Monday. Angry pirates vowed retaliation for the deaths, raising fears for the safety of some 230 foreign sailors still held hostage in more than a dozen ships anchored off the coast of lawless Somalia. \"From now on, if we capture foreign ships and their respective countries try to attack us, we will kill them (the hostages),\" Jamac Habeb, a 30-year-old pirate, told The Associated Press from one of Somalia's piracy hubs, Eyl. \"(U.S. forces have) become our No. 1 enemy.\" Sunday's nighttime operation was a victory for the world's most powerful military, but few experts believed it would quell a rising tide of attacks in one of the world's busiest shipping lanes. The stunning resolution to a five-day standoff came after pirates had agreed to let the USS Bainbridge tow their powerless lifeboat out of rough water. A fourth pirate surrendered after boarding the Bainbridge earlier Sunday and could face life in a U.S. prison. He had been seeking medical attention for a wound to his hand, military officials said. Interviewed from Bahrain, U.S. Naval Forces Central Command chief Vice Adm. Bill Gortney said the takedown happened shortly after sailors on the Bainbridge saw the hostage-takers \"with their heads and shoulders exposed.\" U.S. Defense officials said snipers got the go-ahead to fire after one pirate held an AK-47 close to Capt. Richard Phillips' back. Two other pirates popped their heads up out of the lifeboat, giving snipers three clear targets, one official said. The military officials asked not to be named because they were not authorized to publicly discuss the case. The Navy released images from an unmanned drone that showed snipers positioning themselves on the fantail of the USS Bainbridge. They fired simultaneously. \"(They are) extremely, extremely well-trained,\" Gortney told NBC's \"Today\" show, saying the shooting was ordered by the captain of the Bainbridge. The SEALS arrived on the scene by parachuting from their aircraft into the sea, and were picked up by the Bainbridge, a senior U.S. official said. He said negotiations with the pirates had been \"going up and down.\" The official, asking not to be identified because he, too, was not authorized to discuss this on the record, said the pirates were \"becoming increasingly agitated in the rough waters; they weren't getting what they wanted.\" Just as it was getting dark, pirates fired a tracer bullet \"toward the Bainbridge,\" further heightening tensions, the official said. News of Phillips' rescue caused his crew in Kenya to break into wild cheers and brought tears to the eyes of those in Phillips' hometown of Underhill, Vermont, half a world away from the Indian Ocean drama. It was not immediately known when or how Phillips would return home. President Barack Obama called Phillips' courage \"a model for all Americans\" and said he was pleased with the rescue, but added the United States still needed help from other countries to deal with piracy. Sunday's blow to the pirates' lucrative activities is unlikely to stop them, simply because of the size of the vast area — 1.1 million square miles — stretching from the Gulf of Aden and the coast of Somalia. But it could raises tensions in an already lawless area. \"This could escalate violence in this part of the world, no question about it,\" said Gortney. A Somali pirate agreed. \"Every country will be treated the way it treats us. In the future, America will be the one mourning and crying,\" Abdullahi Lami, one of the pirates holding a Greek ship anchored in the Somali town of Gaan, told The Associated Press on Monday. \"We will retaliate (for) the killings of our men.\" Later Monday, six mortar shells were fired toward the airport in the Somali capital of Mogadishu as a plane carrying a U.S. congressman took off, an airport employee at the control tower said. New Jersey Democrat Donald Payne had met with Somalia's president and prime minister for a one-day visit to discuss piracy and security issues. The airport staffer said Payne's plane took off safely and none of the mortar shells landed in the airport. He refused to give his full name because he was not authorized to speak to the media. The U.S.-flagged Maersk Alabama had put up a fight Wednesday when pirates boarded the ship, surprising the invaders. Until then, Somali pirates had become used to meeting no resistance once they boarded a ship in search of million-dollar ransoms. Ship owners often do not arm their crews, in many cases because of the cargo. A Saudi supertanker hijacked last year carried 2 million barrels of oil, and a gunshot could have triggered an explosion. As dramatic as each hijacking is, Somali pirates still have only attacked a small fraction of the 20,000 ships that pass through the Gulf of Aden each year. Going around Africa to bypass the pirate-infested gulf can rack up massive costs and add up to two weeks to the voyage. The pirates still hold about a dozen ships with more than 200 crew members, according to the piracy watchdog International Maritime Bureau. Vilma de Guzman's husband is one of 23 Filipino sailors held hostage since Nov. 10 on the chemical tanker MT Stolt Strength. She feared Phillips' rescue may endanger the lives of other hostages. \"The pirates might vent their anger on them,\" she said Monday. \"Those released are lucky, but what about those who remain captive?\" She also criticized world media for focusing so much on the U.S. captain but giving little attention to other hostages. Phillips' 17,000-ton ship docked Saturday with 19 crew in Mombasa, Kenya, and crew there they expected to stay for several days before returning home. Chief mate Shane Murphy said spoke to Phillips by telephone Monday. \"He's absolutely elated and he could not be prouder of us for doing everything we were trained to do,\" Murphy said. In Vermont, Maersk spokeswoman Alison McColl choked up as she stood outside the Phillips' family home and read their statement. \"Andrea and Richard have spoken. I think you can all imagine their joy, and what a happy moment that was for them. They're all just so happy and relieved. \"Andrea wanted me to tell the nation that all of your prayers and good wishes have paid off because Captain Phillips is safe,\" she said. The American ship had been carrying food aid bound for Rwanda, Somalia and Uganda when the ordeal began Wednesday hundreds of miles (kilometers) off Somalia's eastern coast. As the pirates clambered aboard and shot in the air, Phillips told his crew to lock themselves in a cabin and surrendered himself to safeguard his men. Phillips was then taken hostage in an enclosed lifeboat that was soon shadowed by three U.S. warships and a helicopter. Phillips jumped out of the lifeboat Friday to try to swim to freedom but was recaptured when a pirate fired into the water, according to U.S. Defense Department officials. Kenya's foreign minister said his country had not received any request from the United States yet to try the fourth captured pirate but would \"consider it on its own merit.\" On Friday, French navy commandos stormed a pirate-held sailboat, the Tanit, in a shootout at sea that killed two pirates and one French hostage and freed four French citizens. Retaliate???? Really? C'mon...how many pirates will we have to dispatch before they figure out their pushing a bad position", 
        "intTime": 20090413, 
        "postID": 1, 
        "quote": "NAIROBI, Kenya – Three flawless shots. Three pirates killed. Bracing themselves on a rolling warship in choppy seas, U.S. Navy snipers took down a trio of Somali pirates with single shots, freeing the American sea captain being held at gunpoint, a Navy commander said Monday. Angry pirates vowed retaliation for the deaths, raising fears for the safety of some 230 foreign sailors still held hostage in more than a dozen ships anchored off the coast of lawless Somalia. \"From now on, if we capture foreign ships and their respective countries try to attack us, we will kill them (the hostages),\" Jamac Habeb, a 30-year-old pirate, told The Associated Press from one of Somalia's piracy hubs, Eyl. \"(U.S. forces have) become our No. 1 enemy.\" Sunday's nighttime operation was a victory for the world's most powerful military, but few experts believed it would quell a rising tide of attacks in one of the world's busiest shipping lanes. The stunning resolution to a five-day standoff came after pirates had agreed to let the USS Bainbridge tow their powerless lifeboat out of rough water. A fourth pirate surrendered after boarding the Bainbridge earlier Sunday and could face life in a U.S. prison. He had been seeking medical attention for a wound to his hand, military officials said. Interviewed from Bahrain, U.S. Naval Forces Central Command chief Vice Adm. Bill Gortney said the takedown happened shortly after sailors on the Bainbridge saw the hostage-takers \"with their heads and shoulders exposed.\" U.S. Defense officials said snipers got the go-ahead to fire after one pirate held an AK-47 close to Capt. Richard Phillips' back. Two other pirates popped their heads up out of the lifeboat, giving snipers three clear targets, one official said. The military officials asked not to be named because they were not authorized to publicly discuss the case. The Navy released images from an unmanned drone that showed snipers positioning themselves on the fantail of the USS Bainbridge. They fired simultaneously. \"(They are) extremely, extremely well-trained,\" Gortney told NBC's \"Today\" show, saying the shooting was ordered by the captain of the Bainbridge. The SEALS arrived on the scene by parachuting from their aircraft into the sea, and were picked up by the Bainbridge, a senior U.S. official said. He said negotiations with the pirates had been \"going up and down.\" The official, asking not to be identified because he, too, was not authorized to discuss this on the record, said the pirates were \"becoming increasingly agitated in the rough waters; they weren't getting what they wanted.\" Just as it was getting dark, pirates fired a tracer bullet \"toward the Bainbridge,\" further heightening tensions, the official said. News of Phillips' rescue caused his crew in Kenya to break into wild cheers and brought tears to the eyes of those in Phillips' hometown of Underhill, Vermont, half a world away from the Indian Ocean drama. It was not immediately known when or how Phillips would return home. President Barack Obama called Phillips' courage \"a model for all Americans\" and said he was pleased with the rescue, but added the United States still needed help from other countries to deal with piracy. Sunday's blow to the pirates' lucrative activities is unlikely to stop them, simply because of the size of the vast area — 1.1 million square miles — stretching from the Gulf of Aden and the coast of Somalia. But it could raises tensions in an already lawless area. \"This could escalate violence in this part of the world, no question about it,\" said Gortney. A Somali pirate agreed. \"Every country will be treated the way it treats us. In the future, America will be the one mourning and crying,\" Abdullahi Lami, one of the pirates holding a Greek ship anchored in the Somali town of Gaan, told The Associated Press on Monday. \"We will retaliate (for) the killings of our men.\" Later Monday, six mortar shells were fired toward the airport in the Somali capital of Mogadishu as a plane carrying a U.S. congressman took off, an airport employee at the control tower said. New Jersey Democrat Donald Payne had met with Somalia's president and prime minister for a one-day visit to discuss piracy and security issues. The airport staffer said Payne's plane took off safely and none of the mortar shells landed in the airport. He refused to give his full name because he was not authorized to speak to the media. The U.S.-flagged Maersk Alabama had put up a fight Wednesday when pirates boarded the ship, surprising the invaders. Until then, Somali pirates had become used to meeting no resistance once they boarded a ship in search of million-dollar ransoms. Ship owners often do not arm their crews, in many cases because of the cargo. A Saudi supertanker hijacked last year carried 2 million barrels of oil, and a gunshot could have triggered an explosion. As dramatic as each hijacking is, Somali pirates still have only attacked a small fraction of the 20,000 ships that pass through the Gulf of Aden each year. Going around Africa to bypass the pirate-infested gulf can rack up massive costs and add up to two weeks to the voyage. The pirates still hold about a dozen ships with more than 200 crew members, according to the piracy watchdog International Maritime Bureau. Vilma de Guzman's husband is one of 23 Filipino sailors held hostage since Nov. 10 on the chemical tanker MT Stolt Strength. She feared Phillips' rescue may endanger the lives of other hostages. \"The pirates might vent their anger on them,\" she said Monday. \"Those released are lucky, but what about those who remain captive?\" She also criticized world media for focusing so much on the U.S. captain but giving little attention to other hostages. Phillips' 17,000-ton ship docked Saturday with 19 crew in Mombasa, Kenya, and crew there they expected to stay for several days before returning home. Chief mate Shane Murphy said spoke to Phillips by telephone Monday. \"He's absolutely elated and he could not be prouder of us for doing everything we were trained to do,\" Murphy said. In Vermont, Maersk spokeswoman Alison McColl choked up as she stood outside the Phillips' family home and read their statement. \"Andrea and Richard have spoken. I think you can all imagine their joy, and what a happy moment that was for them. They're all just so happy and relieved. \"Andrea wanted me to tell the nation that all of your prayers and good wishes have paid off because Captain Phillips is safe,\" she said. The American ship had been carrying food aid bound for Rwanda, Somalia and Uganda when the ordeal began Wednesday hundreds of miles (kilometers) off Somalia's eastern coast. As the pirates clambered aboard and shot in the air, Phillips told his crew to lock themselves in a cabin and surrendered himself to safeguard his men. Phillips was then taken hostage in an enclosed lifeboat that was soon shadowed by three U.S. warships and a helicopter. Phillips jumped out of the lifeboat Friday to try to swim to freedom but was recaptured when a pirate fired into the water, according to U.S. Defense Department officials. Kenya's foreign minister said his country had not received any request from the United States yet to try the fourth captured pirate but would \"consider it on its own merit.\" On Friday, French navy commandos stormed a pirate-held sailboat, the Tanit, in a shootout at sea that killed two pirates and one French hostage and freed four French citizens.", 
        "reply": " Retaliate???? Really? C'mon...how many pirates will we have to dispatch before they figure out their pushing a bad position", 
        "threadID": "672198221_3700006022001", 
        "time": "2009-04-13 08:52:00", 
        "title": "Somali pirates vow to retaliate", 
        "userID": "CombatNAC"
    }, 
    {
        "content": "All I hear is blah blah blah from this guy. The level of piracy was prosperous when they were just hijacking a small number of ships and the insurance companies didn't mind. But by taking this American hostage, they have definitely screwed up and bitten off more than they can chew. Why don't people know a good thing when they see it???? Idiots! They're totally screwed now.", 
        "intTime": 20090413, 
        "postID": 2, 
        "quote": "", 
        "reply": "All I hear is blah blah blah from this guy. The level of piracy was prosperous when they were just hijacking a small number of ships and the insurance companies didn't mind. But by taking this American hostage, they have definitely screwed up and bitten off more than they can chew. Why don't people know a good thing when they see it???? Idiots! They're totally screwed now.", 
        "threadID": "672198221_3700006022001", 
        "time": "2009-04-13 09:00:00", 
        "title": "Somali pirates vow to retaliate", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: All I hear is blah blah blah from this guy. The level of piracy was prosperous when they were just hijacking a small number of ships and the insurance companies didn't mind. But by taking this American hostage, they have definitely screwed up and bitten off more than they can chew. Why don't people know a good thing when they see it???? Idiots! They're totally screwed now. And I agree with that. They have bitten off more than they can chew. I wonder what they will do next. Will this become a war on pirates or will we just go about our daily business until another U.S. ship is hijacked? Maybe we up patrolling the waters or maybe we stay away from the area for awhile or maybe we will start to pressure the Somalia government. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090413, 
        "postID": 3, 
        "quote": "Originally posted by mrmixitup: All I hear is blah blah blah from this guy. The level of piracy was prosperous when they were just hijacking a small number of ships and the insurance companies didn't mind. But by taking this American hostage, they have definitely screwed up and bitten off more than they can chew. Why don't people know a good thing when they see it???? Idiots! They're totally screwed now.", 
        "reply": " And I agree with that. They have bitten off more than they can chew. I wonder what they will do next. Will this become a war on pirates or will we just go about our daily business until another U.S. ship is hijacked? Maybe we up patrolling the waters or maybe we stay away from the area for awhile or maybe we will start to pressure the Somalia government. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3700006022001", 
        "time": "2009-04-13 09:07:00", 
        "title": "Somali pirates vow to retaliate", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: And I agree with that. They have bitten off more than they can chew. I wonder what they will do next. Will this become a war on pirates or will we just go about our daily business until another U.S. ship is hijacked? Maybe we up patrolling the waters or maybe we stay away from the area for awhile or maybe we will start to pressure the Somalia government. They've totally ruined a good thing. Not only that, but they've likely compromised their ability to hijack anything at all in the near future. They've put themselves all over the papers and news, and have brought global attention to their antics. Unbeleiveable.", 
        "intTime": 20090413, 
        "postID": 4, 
        "quote": "Originally posted by Anbar7: And I agree with that. They have bitten off more than they can chew. I wonder what they will do next. Will this become a war on pirates or will we just go about our daily business until another U.S. ship is hijacked? Maybe we up patrolling the waters or maybe we stay away from the area for awhile or maybe we will start to pressure the Somalia government.", 
        "reply": " They've totally ruined a good thing. Not only that, but they've likely compromised their ability to hijack anything at all in the near future. They've put themselves all over the papers and news, and have brought global attention to their antics. Unbeleiveable.", 
        "threadID": "672198221_3700006022001", 
        "time": "2009-04-13 09:34:00", 
        "title": "Somali pirates vow to retaliate", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "I really wouldn't worry all that much about pirates attacking US flagged shipping. The risks are very low to the crews and very high to the pirates", 
        "intTime": 20090413, 
        "postID": 5, 
        "quote": "", 
        "reply": "I really wouldn't worry all that much about pirates attacking US flagged shipping. The risks are very low to the crews and very high to the pirates", 
        "threadID": "672198221_3700006022001", 
        "time": "2009-04-13 09:37:00", 
        "title": "Somali pirates vow to retaliate", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: I really wouldn't worry all that much about pirates attacking US flagged shipping. The risks are very low to the crews and very high to the pirates Exactly!! Why even attack a U.S. flagged ship? They were doing fine attacking Saudi and UAE ships! And then taking the Captain hostage??! Stupid stupid stupid stupid stupid!", 
        "intTime": 20090413, 
        "postID": 6, 
        "quote": "Originally posted by ArtMarsh: I really wouldn't worry all that much about pirates attacking US flagged shipping. The risks are very low to the crews and very high to the pirates", 
        "reply": " Exactly!! Why even attack a U.S. flagged ship? They were doing fine attacking Saudi and UAE ships! And then taking the Captain hostage??! Stupid stupid stupid stupid stupid!", 
        "threadID": "672198221_3700006022001", 
        "time": "2009-04-13 09:49:00", 
        "title": "Somali pirates vow to retaliate", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Anbar7: And I agree with that. They have bitten off more than they can chew. I wonder what they will do next. Will this become a war on pirates or will we just go about our daily business until another U.S. ship is hijacked? Maybe we up patrolling the waters or maybe we stay away from the area for awhile or maybe we will start to pressure the Somalia government. They've totally ruined a good thing. Not only that, but they've likely compromised their ability to hijack anything at all in the near future. They've put themselves all over the papers and news, and have brought global attention to their antics. Unbeleiveable. Maybe that is what they wanted to happen. You steal candy long enough you eventually want to go after the big stuff. It backfired, but maybe having their name out there is all they really wanted. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090413, 
        "postID": 7, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Anbar7: And I agree with that. They have bitten off more than they can chew. I wonder what they will do next. Will this become a war on pirates or will we just go about our daily business until another U.S. ship is hijacked? Maybe we up patrolling the waters or maybe we stay away from the area for awhile or maybe we will start to pressure the Somalia government. They've totally ruined a good thing. Not only that, but they've likely compromised their ability to hijack anything at all in the near future. They've put themselves all over the papers and news, and have brought global attention to their antics. Unbeleiveable.", 
        "reply": " Maybe that is what they wanted to happen. You steal candy long enough you eventually want to go after the big stuff. It backfired, but maybe having their name out there is all they really wanted. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3700006022001", 
        "time": "2009-04-13 09:54:00", 
        "title": "Somali pirates vow to retaliate", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Maybe that is what they wanted to happen. You steal candy long enough you eventually want to go after the big stuff. It backfired, but maybe having their name out there is all they really wanted. No. They weren't terrorists. They have no cause. They are however, the crappiest Pirates ever. They could have turned thier gaggle into a well organized group, capable of hijacking only select vessels from countries willing to pay without a hassle. Instead they go right after an American ship and hijack their Captain with absolutely no plan of success from doing so.", 
        "intTime": 20090413, 
        "postID": 8, 
        "quote": "Originally posted by Anbar7: Maybe that is what they wanted to happen. You steal candy long enough you eventually want to go after the big stuff. It backfired, but maybe having their name out there is all they really wanted.", 
        "reply": " No. They weren't terrorists. They have no cause. They are however, the crappiest Pirates ever. They could have turned thier gaggle into a well organized group, capable of hijacking only select vessels from countries willing to pay without a hassle. Instead they go right after an American ship and hijack their Captain with absolutely no plan of success from doing so.", 
        "threadID": "672198221_3700006022001", 
        "time": "2009-04-13 10:00:00", 
        "title": "Somali pirates vow to retaliate", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by ArtMarsh: I really wouldn't worry all that much about pirates attacking US flagged shipping. The risks are very low to the crews and very high to the pirates Exactly!! Why even attack a U.S. flagged ship? They were doing fine attacking Saudi and UAE ships! And then taking the Captain hostage??! Stupid stupid stupid stupid stupid! Huh? The pirates have shown no sophistication whatsoever. They grab the first ship that they run across it would appear. What makes their false bravado claims even more unintelligent is the fact they have no clue as to why ships are US Flagged (registered) in the first place. It is very, very expensive for a company to have a US Registered vessel. The primary reason for US Flagging is to be able to have US Government shipping contracts. The second most prevalent reason is that vessel is part of our US Navy’s RESERVE fleet. USNR vessels (incl (MARAD) MSC, NDRF, NFAF, RRF (of which I have been aboard very many)) These are ALL USN vessels when activated or under contract. As such Supercargo can and does often include ARMED members of the US military. Are you getting a picture of just how rough a time any pirate would have at this point.", 
        "intTime": 20090413, 
        "postID": 9, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by ArtMarsh: I really wouldn't worry all that much about pirates attacking US flagged shipping. The risks are very low to the crews and very high to the pirates Exactly!! Why even attack a U.S. flagged ship? They were doing fine attacking Saudi and UAE ships! And then taking the Captain hostage??! Stupid stupid stupid stupid stupid!", 
        "reply": " Huh? The pirates have shown no sophistication whatsoever. They grab the first ship that they run across it would appear. What makes their false bravado claims even more unintelligent is the fact they have no clue as to why ships are US Flagged (registered) in the first place. It is very, very expensive for a company to have a US Registered vessel. The primary reason for US Flagging is to be able to have US Government shipping contracts. The second most prevalent reason is that vessel is part of our US Navy’s RESERVE fleet. USNR vessels (incl (MARAD) MSC, NDRF, NFAF, RRF (of which I have been aboard very many)) These are ALL USN vessels when activated or under contract. As such Supercargo can and does often include ARMED members of the US military. Are you getting a picture of just how rough a time any pirate would have at this point.", 
        "threadID": "672198221_3700006022001", 
        "time": "2009-04-13 10:38:00", 
        "title": "Somali pirates vow to retaliate", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "I think as they are captured they need to have a nice nylon necktie placed around their neck, snuged up nice and comfy, they hung about 80 ft off the deck, after about a week let the fish eat, Not sure if that would be right to poison all those fish or not but maybe some bad fish will eat-em then we will have killed two bad boys with one rope, one bad piret, and maybe a badboy fish. JMO D.J.", 
        "intTime": 20090413, 
        "postID": 10, 
        "quote": "", 
        "reply": "I think as they are captured they need to have a nice nylon necktie placed around their neck, snuged up nice and comfy, they hung about 80 ft off the deck, after about a week let the fish eat, Not sure if that would be right to poison all those fish or not but maybe some bad fish will eat-em then we will have killed two bad boys with one rope, one bad piret, and maybe a badboy fish. JMO D.J.", 
        "threadID": "672198221_3700006022001", 
        "time": "2009-04-13 16:33:00", 
        "title": "Somali pirates vow to retaliate", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "Let them retaliate. We will turn our high speed water hoses on them. Any way you all want to know how stupid these pirates are? They think that they can take on the US, France, Germany and other nations with AK-47's and RPG's. Haaaa haa, Hee, heee.", 
        "intTime": 20090413, 
        "postID": 11, 
        "quote": "", 
        "reply": "Let them retaliate. We will turn our high speed water hoses on them. Any way you all want to know how stupid these pirates are? They think that they can take on the US, France, Germany and other nations with AK-47's and RPG's. Haaaa haa, Hee, heee.", 
        "threadID": "672198221_3700006022001", 
        "time": "2009-04-13 16:43:00", 
        "title": "Somali pirates vow to retaliate", 
        "userID": "Duster6"
    }
]