[
    {
        "content": "Medical journal says Pope distorting condom facts \"http://uk.reuters.com/article/homepageCrisis/idUKLR110752._CH_.2420\" quote: The Lancet in an editorial called on the Pope to retract the comments made last week, saying anything less would be an immense disservice to the public and health advocates fighting to contain the disease. \"When any influential person, be it a religious or political leader, makes a false scientific statement that could be devastating to the health of millions of people, they should retract or correct the public record,\" the editorial said. \"By saying that condoms exacerbate the problem of HIV/AIDS, the Pope has publicly distorted scientific evidence to promote Catholic doctrine on the issue.\" Should the Pope admit to making a mistake (I will not say a deliberate distortion of the facts) by claiming that condoms make the AIDS problem worse? Is Lancet right when it says that such false claims (claims that science shows are false) by Government or Religous leaders can cause a lot of harm?", 
        "intTime": 20090327, 
        "postID": 1, 
        "quote": "The Lancet in an editorial called on the Pope to retract the comments made last week, saying anything less would be an immense disservice to the public and health advocates fighting to contain the disease. \"When any influential person, be it a religious or political leader, makes a false scientific statement that could be devastating to the health of millions of people, they should retract or correct the public record,\" the editorial said. \"By saying that condoms exacerbate the problem of HIV/AIDS, the Pope has publicly distorted scientific evidence to promote Catholic doctrine on the issue.\"", 
        "reply": "Medical journal says Pope distorting condom facts \"http://uk.reuters.com/article/homepageCrisis/idUKLR110752._CH_.2420\"  Should the Pope admit to making a mistake (I will not say a deliberate distortion of the facts) by claiming that condoms make the AIDS problem worse? Is Lancet right when it says that such false claims (claims that science shows are false) by Government or Religous leaders can cause a lot of harm?", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-27 08:11:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: Medical journal says Pope distorting condom facts \"http://uk.reuters.com/article/homepageCrisis/idUKLR110752._CH_.2420\" quote: The Lancet in an editorial called on the Pope to retract the comments made last week, saying anything less would be an immense disservice to the public and health advocates fighting to contain the disease. \"When any influential person, be it a religious or political leader, makes a false scientific statement that could be devastating to the health of millions of people, they should retract or correct the public record,\" the editorial said. \"By saying that condoms exacerbate the problem of HIV/AIDS, the Pope has publicly distorted scientific evidence to promote Catholic doctrine on the issue.\" Should the Pope admit to making a mistake (I will not say a deliberate distortion of the facts) by claiming that condoms make the AIDS problem worse? Is Lancet right when it says that such false claims (claims that science shows are false) by Government or Religous leaders can cause a lot of harm? You mean to say that the Nazi sympathizer lied? I can't believe it.", 
        "intTime": 20090327, 
        "postID": 2, 
        "quote": "Originally posted by rayld2: Medical journal says Pope distorting condom facts \"http://uk.reuters.com/article/homepageCrisis/idUKLR110752._CH_.2420\" quote: The Lancet in an editorial called on the Pope to retract the comments made last week, saying anything less would be an immense disservice to the public and health advocates fighting to contain the disease. \"When any influential person, be it a religious or political leader, makes a false scientific statement that could be devastating to the health of millions of people, they should retract or correct the public record,\" the editorial said. \"By saying that condoms exacerbate the problem of HIV/AIDS, the Pope has publicly distorted scientific evidence to promote Catholic doctrine on the issue.\" Should the Pope admit to making a mistake (I will not say a deliberate distortion of the facts) by claiming that condoms make the AIDS problem worse? Is Lancet right when it says that such false claims (claims that science shows are false) by Government or Religous leaders can cause a lot of harm?", 
        "reply": " You mean to say that the Nazi sympathizer lied? I can't believe it.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-27 19:01:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "thorin001"
    }, 
    {
        "content": "I guess it's safe to say that the Pope doesn't use a condom while engaging his Alter boys.", 
        "intTime": 20090327, 
        "postID": 3, 
        "quote": "", 
        "reply": "I guess it's safe to say that the Pope doesn't use a condom while engaging his Alter boys.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-27 19:15:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "badmac933"
    }, 
    {
        "content": "quote: Originally posted by badmac933: I guess it's safe to say that the Pope doesn't use a condom while engaging his Alter boys. That's harsh. Even I wasn't going to go there.", 
        "intTime": 20090327, 
        "postID": 4, 
        "quote": "Originally posted by badmac933: I guess it's safe to say that the Pope doesn't use a condom while engaging his Alter boys.", 
        "reply": " That's harsh. Even I wasn't going to go there.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-27 19:22:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "thorin001"
    }, 
    {
        "content": "Vulgar references aside, yes - the Pope is wrong to have said this. Not only wrong, but irresponsible to his flock. And yes, Lancet is correct when it asserts that scientifically incorrect public statements made by government or religious leaders can, indeed, cause a lot of harm. I was raised high-church Episcopalian, but married Catholic, raised my children in the Church, and feel more comfortable there than in an Episcopal church these days. But I never officially converted, and probably never will, because of issues like this, the Church's position on birth control (I can understand the opposition to abortion, though I do not agree), and the Church's view of the status of women in the Church and in the secular world. Most priests are NOT pedophiles. Most evangelists are NOT closet homosexuals or drug addicts. Very few Germans are Nazis or Nazi-sympathizers. To stoop to such broad-brush insults only exposes one's own lack of intelligence and innate prejudices. Grow up, badmac and thorin.", 
        "intTime": 20090328, 
        "postID": 5, 
        "quote": "", 
        "reply": "Vulgar references aside, yes - the Pope is wrong to have said this. Not only wrong, but irresponsible to his flock. And yes, Lancet is correct when it asserts that scientifically incorrect public statements made by government or religious leaders can, indeed, cause a lot of harm. I was raised high-church Episcopalian, but married Catholic, raised my children in the Church, and feel more comfortable there than in an Episcopal church these days. But I never officially converted, and probably never will, because of issues like this, the Church's position on birth control (I can understand the opposition to abortion, though I do not agree), and the Church's view of the status of women in the Church and in the secular world. Most priests are NOT pedophiles. Most evangelists are NOT closet homosexuals or drug addicts. Very few Germans are Nazis or Nazi-sympathizers. To stoop to such broad-brush insults only exposes one's own lack of intelligence and innate prejudices. Grow up, badmac and thorin.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-28 03:42:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: Vulgar references aside, yes - the Pope is wrong to have said this. Not only wrong, but irresponsible to his flock. And yes, Lancet is correct when it asserts that scientifically incorrect public statements made by government or religious leaders can, indeed, cause a lot of harm. I was raised high-church Episcopalian, but married Catholic, raised my children in the Church, and feel more comfortable there than in an Episcopal church these days. But I never officially converted, and probably never will, because of issues like this, the Church's position on birth control (I can understand the opposition to abortion, though I do not agree), and the Church's view of the status of women in the Church and in the secular world. Most priests are NOT pedophiles. Most evangelists are NOT closet homosexuals or drug addicts. Very few Germans are Nazis or Nazi-sympathizers. To stoop to such broad-brush insults only exposes one's own lack of intelligence and innate prejudices. Grow up, badmac and thorin. I wasn't refering to Germans in general, or even to Catholics in general. I was refering specifically to the guy currently wearing the pope hat. Check his record, he earned the lable of Nazi-sympathizer.", 
        "intTime": 20090328, 
        "postID": 6, 
        "quote": "Originally posted by Cider33_Alpha: Vulgar references aside, yes - the Pope is wrong to have said this. Not only wrong, but irresponsible to his flock. And yes, Lancet is correct when it asserts that scientifically incorrect public statements made by government or religious leaders can, indeed, cause a lot of harm. I was raised high-church Episcopalian, but married Catholic, raised my children in the Church, and feel more comfortable there than in an Episcopal church these days. But I never officially converted, and probably never will, because of issues like this, the Church's position on birth control (I can understand the opposition to abortion, though I do not agree), and the Church's view of the status of women in the Church and in the secular world. Most priests are NOT pedophiles. Most evangelists are NOT closet homosexuals or drug addicts. Very few Germans are Nazis or Nazi-sympathizers. To stoop to such broad-brush insults only exposes one's own lack of intelligence and innate prejudices. Grow up, badmac and thorin.", 
        "reply": " I wasn't refering to Germans in general, or even to Catholics in general. I was refering specifically to the guy currently wearing the pope hat. Check his record, he earned the lable of Nazi-sympathizer.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-28 07:38:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by thorin001: quote: Originally posted by Cider33_Alpha: Vulgar references aside, yes - the Pope is wrong to have said this. Not only wrong, but irresponsible to his flock. And yes, Lancet is correct when it asserts that scientifically incorrect public statements made by government or religious leaders can, indeed, cause a lot of harm. I was raised high-church Episcopalian, but married Catholic, raised my children in the Church, and feel more comfortable there than in an Episcopal church these days. But I never officially converted, and probably never will, because of issues like this, the Church's position on birth control (I can understand the opposition to abortion, though I do not agree), and the Church's view of the status of women in the Church and in the secular world. Most priests are NOT pedophiles. Most evangelists are NOT closet homosexuals or drug addicts. Very few Germans are Nazis or Nazi-sympathizers. To stoop to such broad-brush insults only exposes one's own lack of intelligence and innate prejudices. Grow up, badmac and thorin. I wasn't refering to Germans in general, or even to Catholics in general. I was refering specifically to the guy currently wearing the pope hat. Check his record, he earned the lable of Nazi-sympathizer. When the issue involved is the lives of millions of people and a well known religious authority says a major preventitive measure, \"makes thing worse,\" it becomes almost criminal. Dave", 
        "intTime": 20090328, 
        "postID": 7, 
        "quote": "Originally posted by thorin001: quote: Originally posted by Cider33_Alpha: Vulgar references aside, yes - the Pope is wrong to have said this. Not only wrong, but irresponsible to his flock. And yes, Lancet is correct when it asserts that scientifically incorrect public statements made by government or religious leaders can, indeed, cause a lot of harm. I was raised high-church Episcopalian, but married Catholic, raised my children in the Church, and feel more comfortable there than in an Episcopal church these days. But I never officially converted, and probably never will, because of issues like this, the Church's position on birth control (I can understand the opposition to abortion, though I do not agree), and the Church's view of the status of women in the Church and in the secular world. Most priests are NOT pedophiles. Most evangelists are NOT closet homosexuals or drug addicts. Very few Germans are Nazis or Nazi-sympathizers. To stoop to such broad-brush insults only exposes one's own lack of intelligence and innate prejudices. Grow up, badmac and thorin. I wasn't refering to Germans in general, or even to Catholics in general. I was refering specifically to the guy currently wearing the pope hat. Check his record, he earned the lable of Nazi-sympathizer.", 
        "reply": " When the issue involved is the lives of millions of people and a well known religious authority says a major preventitive measure, \"makes thing worse,\" it becomes almost criminal. Dave", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-28 09:36:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: When the issue involved is the lives of millions of people and a well known religious authority says a major preventitive measure, \"makes thing worse,\" it becomes almost criminal. Can you explain then why the 'seat belts' and 'air bags' in automobiles has not significantly lowered traffic fatalities.", 
        "intTime": 20090328, 
        "postID": 8, 
        "quote": "When the issue involved is the lives of millions of people and a well known religious authority says a major preventitive measure, \"makes thing worse,\" it becomes almost criminal.", 
        "reply": " Can you explain then why the 'seat belts' and 'air bags' in automobiles has not significantly lowered traffic fatalities.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-28 16:52:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "54D_Zippo"
    }, 
    {
        "content": "quote: Can you explain then why the 'seat belts' and 'air bags' in automobiles has not significantly lowered traffic fatalities. Because some 50% isn't significant?", 
        "intTime": 20090328, 
        "postID": 9, 
        "quote": "Can you explain then why the 'seat belts' and 'air bags' in automobiles has not significantly lowered traffic fatalities.", 
        "reply": " Because some 50% isn't significant?", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-28 17:29:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "quote: Originally posted by 2nd_freedomfighter: quote: Can you explain then why the 'seat belts' and 'air bags' in automobiles has not significantly lowered traffic fatalities. Because some 50% isn't significant? Condoms lower the risk of contracting AIDS. Every study made on the subject shows this in stark and bleak terms. The Pope has a right to his moral feelings and opinions - He does NOT have a right to make up facts. Dave", 
        "intTime": 20090328, 
        "postID": 10, 
        "quote": "Originally posted by 2nd_freedomfighter: quote: Can you explain then why the 'seat belts' and 'air bags' in automobiles has not significantly lowered traffic fatalities. Because some 50% isn't significant?", 
        "reply": " Condoms lower the risk of contracting AIDS. Every study made on the subject shows this in stark and bleak terms. The Pope has a right to his moral feelings and opinions - He does NOT have a right to make up facts. Dave", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-28 17:33:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "Grachus"
    }, 
    {
        "content": "Africa is being decimated by the spread of AIDS. Whatever methods available should be used to remediate this epidemic. All officials, religious or political, have a moral obligation to do whatever they can to alleviate human suffering. To frustrate or otherwise interpose objection to recognized methodologies for remediation is itself immoral in my opinion. Abstinence may satisfy the Pope's moral qualms but it is an unrealistic solution to the sexual urges of many, if not most, of the people of the world. Even the leader of the Catholic Church should face reality in the face of the scourge of AIDS.", 
        "intTime": 20090328, 
        "postID": 11, 
        "quote": "", 
        "reply": "Africa is being decimated by the spread of AIDS. Whatever methods available should be used to remediate this epidemic. All officials, religious or political, have a moral obligation to do whatever they can to alleviate human suffering. To frustrate or otherwise interpose objection to recognized methodologies for remediation is itself immoral in my opinion. Abstinence may satisfy the Pope's moral qualms but it is an unrealistic solution to the sexual urges of many, if not most, of the people of the world. Even the leader of the Catholic Church should face reality in the face of the scourge of AIDS.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-28 18:45:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "fnewt"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Condoms lower the risk of contracting AIDS. Every study made on the subject shows this in stark and bleak terms. The Pope has a right to his moral feelings and opinions - He does NOT have a right to make up facts. Dave Agreed, He should Apologize...but He won't...as Pope he's God's representative here on earth he is infallible...just ask him, he'll tell ya.", 
        "intTime": 20090328, 
        "postID": 12, 
        "quote": "Originally posted by Grachus: Condoms lower the risk of contracting AIDS. Every study made on the subject shows this in stark and bleak terms. The Pope has a right to his moral feelings and opinions - He does NOT have a right to make up facts. Dave", 
        "reply": " Agreed, He should Apologize...but He won't...as Pope he's God's representative here on earth he is infallible...just ask him, he'll tell ya.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-28 19:49:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "CombatNAC"
    }, 
    {
        "content": "quote: Africa is being decimated by the spread of AIDS. Whatever methods available should be used to remediate this epidemic. Are the African Rapists going to use condoms if provided? Are 'Aids' victims going to worry about giving 'Aids' to another. You people ignore facts: Condoms are provided throughout the US and how has it reduced teen pregnancies or disease? quote: Abstinence may satisfy the Pope's moral qualms but it is an unrealistic solution to the sexual urges of many, if not most, of the people of the world. Even the leader of the Catholic Church should face reality in the face of the scourge of AIDS. The reality is that people no longer take responsibility for their actions and our narcissistic society promotes this irresponsibility by providing a 'bandaid' to cover misbehavior rather than treat the disease. To make it simple for you that are so quick to comdemn the Pope; if one partner has Aids and a condom is used then it is \"SAFE\" to have sex? Who would willingly risk it?", 
        "intTime": 20090329, 
        "postID": 13, 
        "quote": "Africa is being decimated by the spread of AIDS. Whatever methods available should be used to remediate this epidemic.", 
        "reply": " Are the African Rapists going to use condoms if provided? Are 'Aids' victims going to worry about giving 'Aids' to another. You people ignore facts: Condoms are provided throughout the US and how has it reduced teen pregnancies or disease? quote: Abstinence may satisfy the Pope's moral qualms but it is an unrealistic solution to the sexual urges of many, if not most, of the people of the world. Even the leader of the Catholic Church should face reality in the face of the scourge of AIDS. The reality is that people no longer take responsibility for their actions and our narcissistic society promotes this irresponsibility by providing a 'bandaid' to cover misbehavior rather than treat the disease. To make it simple for you that are so quick to comdemn the Pope; if one partner has Aids and a condom is used then it is \"SAFE\" to have sex? Who would willingly risk it?", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-29 12:01:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "54D_Zippo"
    }, 
    {
        "content": "quote: Originally posted by 54D_Zippo: quote: Africa is being decimated by the spread of AIDS. Whatever methods available should be used to remediate this epidemic. Are the African Rapists going to use condoms if provided? Are 'Aids' victims going to worry about giving 'Aids' to another. You people ignore facts: Condoms are provided throughout the US and how has it reduced teen pregnancies or disease? quote: Abstinence may satisfy the Pope's moral qualms but it is an unrealistic solution to the sexual urges of many, if not most, of the people of the world. Even the leader of the Catholic Church should face reality in the face of the scourge of AIDS. The reality is that people no longer take responsibility for their actions and our narcissistic society promotes this irresponsibility by providing a 'bandaid' to cover misbehavior rather than treat the disease. To make it simple for you that are so quick to comdemn the Pope; if one partner has Aids and a condom is used then it is \"SAFE\" to have sex? Who would willingly risk it? A rather strange post. Has anyone claimed that condems cure aids? \"Will rapists use condoms?\" Does the above mean something? \"Are 'Aids' victims going to worry about giving Aids' to another?\" Most will, some wont. If I had aids, you can bet your bottom dollar I would worry about this. Sex is a natural act. Not all the laws, not all the religions, nothing has ever stopped people from having sex. Without wishing to badmouth the majority of Catholic Priests and Nuns, plenty of them have sex as well. Based on the numbers here, condoms will save the lives of millions of people - You can sprout about morality, abstinance, whatever comes into your mind - But this is a Fact. As I said, YOU are entitled to your morality, you are even entitled to swear off sex, with or without a condom - But you are NOT entitled to make up your own \"facts,\" and neither is the Pope. Dave", 
        "intTime": 20090329, 
        "postID": 14, 
        "quote": "Originally posted by 54D_Zippo: quote: Africa is being decimated by the spread of AIDS. Whatever methods available should be used to remediate this epidemic. Are the African Rapists going to use condoms if provided? Are 'Aids' victims going to worry about giving 'Aids' to another. You people ignore facts: Condoms are provided throughout the US and how has it reduced teen pregnancies or disease? quote: Abstinence may satisfy the Pope's moral qualms but it is an unrealistic solution to the sexual urges of many, if not most, of the people of the world. Even the leader of the Catholic Church should face reality in the face of the scourge of AIDS. The reality is that people no longer take responsibility for their actions and our narcissistic society promotes this irresponsibility by providing a 'bandaid' to cover misbehavior rather than treat the disease. To make it simple for you that are so quick to comdemn the Pope; if one partner has Aids and a condom is used then it is \"SAFE\" to have sex? Who would willingly risk it?", 
        "reply": " A rather strange post. Has anyone claimed that condems cure aids? \"Will rapists use condoms?\" Does the above mean something? \"Are 'Aids' victims going to worry about giving Aids' to another?\" Most will, some wont. If I had aids, you can bet your bottom dollar I would worry about this. Sex is a natural act. Not all the laws, not all the religions, nothing has ever stopped people from having sex. Without wishing to badmouth the majority of Catholic Priests and Nuns, plenty of them have sex as well. Based on the numbers here, condoms will save the lives of millions of people - You can sprout about morality, abstinance, whatever comes into your mind - But this is a Fact. As I said, YOU are entitled to your morality, you are even entitled to swear off sex, with or without a condom - But you are NOT entitled to make up your own \"facts,\" and neither is the Pope. Dave", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-29 13:00:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: A rather strange post. Has anyone claimed that condems cure aids? Not to my knowledge and neither did I! quote: But you are NOT entitled to make up your own \"facts,\" and neither is the Pope. Where are the \"FACTS\" that say supplying Africans or anyone for that matter with condoms will save \"millions of lives\"? How many lives will be lost with the False Sense of Security that they are safe because they used a condom. Check the \"African Statistics\" or world stats and you will see a considerable number of Aids victims did not get the disease from consentual sex. I apologize for thinking that common sense could overcome your 'hatred' for (the Pope, Catholics, Religion, or whatever doesn't meet your personal fancy). quote: Without wishing to badmouth the majority of Catholic Priests and Nuns, plenty of them have sex as well. What does that have to do with anything in the topic except your desire to 'badmouth' Catholics. quote: Sex is a natural act. Not all the laws, not all the religions, nothing has ever stopped people from having sex. ... And not all the condoms in the world are going to 'STOP' the spread of STD's! You are so intent in finding fault that you pick an idea \"out of context\" to the message so that you can put it and its author down. You can not legislate nor medically prescibe responsibility!", 
        "intTime": 20090329, 
        "postID": 15, 
        "quote": "A rather strange post. Has anyone claimed that condems cure aids?", 
        "reply": " Not to my knowledge and neither did I! quote: But you are NOT entitled to make up your own \"facts,\" and neither is the Pope. Where are the \"FACTS\" that say supplying Africans or anyone for that matter with condoms will save \"millions of lives\"? How many lives will be lost with the False Sense of Security that they are safe because they used a condom. Check the \"African Statistics\" or world stats and you will see a considerable number of Aids victims did not get the disease from consentual sex. I apologize for thinking that common sense could overcome your 'hatred' for (the Pope, Catholics, Religion, or whatever doesn't meet your personal fancy). quote: Without wishing to badmouth the majority of Catholic Priests and Nuns, plenty of them have sex as well. What does that have to do with anything in the topic except your desire to 'badmouth' Catholics. quote: Sex is a natural act. Not all the laws, not all the religions, nothing has ever stopped people from having sex. ... And not all the condoms in the world are going to 'STOP' the spread of STD's! You are so intent in finding fault that you pick an idea \"out of context\" to the message so that you can put it and its author down. You can not legislate nor medically prescibe responsibility!", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-29 21:00:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "54D_Zippo"
    }, 
    {
        "content": "CombatNAC: the Pope is \"infallible\" in areas of religious doctrine. He is not considered infallible - by himself, the Church or anyone else - as infallible on matters outside that narrow area, including medical science. 54D_Zippo: I don't know where you're getting your \"facts\" that condoms don't prevent pregnancy or the spread of STDs, including HIV/AIDS. Fact is, they DO. My last job, prior to returning to active duty, was as director of student health services at a public university. The majority of students we saw were for birth control or STD related issues. Many students came in for the \"morning after pill\" because they neglected to use a condom or it broke. Those who came in for STD testing also volunteered the information that they had had unprotected sex. We did NOT see students who routinely used condoms (we had a large jar full of 'em in the hallway, free for the taking) - except as noted in the event of condom breakage. That's just a small snapshot of what is found on a much wider scale throughout this country and around the world. Do some research - try looking on \"http://www.cdc.gov\" and drill down to the information on STDs and pregnancy. It's pretty plain to see that condoms ARE effective in reducing the incidence of both pregnancy and STDs, to include HIV/AIDS.", 
        "intTime": 20090330, 
        "postID": 16, 
        "quote": "", 
        "reply": "CombatNAC: the Pope is \"infallible\" in areas of religious doctrine. He is not considered infallible - by himself, the Church or anyone else - as infallible on matters outside that narrow area, including medical science. 54D_Zippo: I don't know where you're getting your \"facts\" that condoms don't prevent pregnancy or the spread of STDs, including HIV/AIDS. Fact is, they DO. My last job, prior to returning to active duty, was as director of student health services at a public university. The majority of students we saw were for birth control or STD related issues. Many students came in for the \"morning after pill\" because they neglected to use a condom or it broke. Those who came in for STD testing also volunteered the information that they had had unprotected sex. We did NOT see students who routinely used condoms (we had a large jar full of 'em in the hallway, free for the taking) - except as noted in the event of condom breakage. That's just a small snapshot of what is found on a much wider scale throughout this country and around the world. Do some research - try looking on \"http://www.cdc.gov\" and drill down to the information on STDs and pregnancy. It's pretty plain to see that condoms ARE effective in reducing the incidence of both pregnancy and STDs, to include HIV/AIDS.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-30 05:25:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: 54D_Zippo: I don't know where you're getting your \"facts\" that condoms don't prevent pregnancy or the spread of STDs, including HIV/AIDS. Fact is, they DO. My last job, prior to returning to active duty, was as director of student health services at a public university. The majority of students we saw were for birth control or STD related issues. Never said that \"they don't\" but rather that they are not 100% effective even when used. They are a \"False Sense of Security\". An umbrella is pretty effective against getting wet in a rainstorm. My point and the Pope's point is that the best method to avoid 'AIDS' it to abstain or have a monogomous relationship with a virgin/cherry boy. I suggest you read my last paragraph and reread it as you are more intent on finding fault than trying to understand the content. I am from a family of nurses, even married one. I taught school for over 20 years. I have witnessed the horrors of AIDS and other STDs by seemingly responsible individuals who took precautions such as 'condoms' and 'non-insertion' sex acts that still became infected. Find fault if you like but my responsible behavior and that of the Pope's and many others make it unlikely that we will ever be infected with AIDS or any other STD.", 
        "intTime": 20090330, 
        "postID": 17, 
        "quote": "54D_Zippo: I don't know where you're getting your \"facts\" that condoms don't prevent pregnancy or the spread of STDs, including HIV/AIDS. Fact is, they DO. My last job, prior to returning to active duty, was as director of student health services at a public university. The majority of students we saw were for birth control or STD related issues.", 
        "reply": " Never said that \"they don't\" but rather that they are not 100% effective even when used. They are a \"False Sense of Security\". An umbrella is pretty effective against getting wet in a rainstorm. My point and the Pope's point is that the best method to avoid 'AIDS' it to abstain or have a monogomous relationship with a virgin/cherry boy. I suggest you read my last paragraph and reread it as you are more intent on finding fault than trying to understand the content. I am from a family of nurses, even married one. I taught school for over 20 years. I have witnessed the horrors of AIDS and other STDs by seemingly responsible individuals who took precautions such as 'condoms' and 'non-insertion' sex acts that still became infected. Find fault if you like but my responsible behavior and that of the Pope's and many others make it unlikely that we will ever be infected with AIDS or any other STD.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-30 23:38:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "54D_Zippo"
    }, 
    {
        "content": "Of course abstinence or a monogamous relationship (for life) is the only guaranteed way to avoid STDs, and only abstinence guarantees no pregnancy. No medication, vaccine or device is 100% safe or 100% effective 100% of the time. It's stupid to even suggest such a thing. My beef with what the Pope has said is that he is ignoring the best (and cheapest) deterrent in the battles against HIV/AIDS and unwanted pregnancy outside of abstinence or monogamy. Your umbrella analogy is a good one - it's not 100% effective, but it's better to have one in a storm than not have one, no?", 
        "intTime": 20090331, 
        "postID": 18, 
        "quote": "", 
        "reply": "Of course abstinence or a monogamous relationship (for life) is the only guaranteed way to avoid STDs, and only abstinence guarantees no pregnancy. No medication, vaccine or device is 100% safe or 100% effective 100% of the time. It's stupid to even suggest such a thing. My beef with what the Pope has said is that he is ignoring the best (and cheapest) deterrent in the battles against HIV/AIDS and unwanted pregnancy outside of abstinence or monogamy. Your umbrella analogy is a good one - it's not 100% effective, but it's better to have one in a storm than not have one, no?", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-31 00:50:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "Yo! Let's DO get our facts straight here. First of all, let's learn WHY HIV/AIDS is the plague it is in Africa. It all starts with poverty, lack of education, superstition and no health care. HIV arose out of Africa, probably from monkies but no one knows for sure. Africa is devastatingly poor and plagued with famine, draught, floods, wars, diseases, etc. It's common for the men in a village to seek employment elsewhere. When they do, they engage in sex with other women and become infected. When they go home, they infect their wives. Because there is no medical care, the women have no access to anti-viral drugs during pregnancy and nursing - which they do for at least 3 years. Thus the mothers infect their babies. Remember, this is also a country that has all sorts of rituals and rites of man and womanhood - circumciscion, (male and female), tatoos, scarring, piercings, etc. that are done in the village by one of their own. The young teens can get infected that way. Some tribes also demand proof of fertility prior to a marriage so early sexual activity is encouraged. In others, there are no restrictions on sex at all - that is their socialtal norm. Then, of course, there are the mass rapes being carried out in the regions at war. In those areas, almost every single feamale, no what age - even infants - have been raped and many multiple times. What truly sad is many African women DO try to get their husbands to use condoms when they come home after having been working in the city but instead the husbands beat them sensless for asking. Then give them HIV anyway and leave them when they get sick. Then when he leaves, she has to hope his family doesn't try to kill her to get their dowery back. So for places like Africa, the condom can be a life-saver. You see, the women in those countries don't have the right to say \"No\". If they do they get beaten, raped and/or killed - and if the man has HIV/AIDS, she's dead anyway. Now, someone seems to feel that people (teens) having easy access to condoms (birth control) has done nothing to reduce teen pregnancy or STDs. Well, that depends on whose statistics you're looking at, my friend. If you look at Scandinavia where kids are taught sex education at an early age because they believe sex and sexuality are natural, have birth control available over the counter and don't mind teens having sex then you'll see they have the lowest teen pregnancy and STD rate on the planet. The US has the highest in the western world. In 2001, Tommy Thompson, Sec. HEW for Bush, released a study that proved comprehensive sex education for teen and easy access to birth control for DID NOT increase sexual activity among that age group. In fact, the study (UW) showed that teenage girls who had birth control available to them were more likely to REFRAIN from sexual activity! But despite this, federal funding for any clinic that even mentioned the word \"abortion\" was withdrawn - worldwide - thus during the Bush years, easy access to contraception such as condoms dried up and I have no doubt the number haven't changed much over the past 8 years. And, if states would get serious about enforcing the Statutory Rape laws I think you'd see a huge number of pregnancies go down. Don't you even wonder for a minute about all the 14, 15 year-old pregnant girls you see? Guess what? Bettcha most of the FOBs are (well-)over 18. The other thing that has been proven to lower the HIV risk is circumcision. You ready to join THAT band-wagon?", 
        "intTime": 20090331, 
        "postID": 19, 
        "quote": "", 
        "reply": "Yo! Let's DO get our facts straight here. First of all, let's learn WHY HIV/AIDS is the plague it is in Africa. It all starts with poverty, lack of education, superstition and no health care. HIV arose out of Africa, probably from monkies but no one knows for sure. Africa is devastatingly poor and plagued with famine, draught, floods, wars, diseases, etc. It's common for the men in a village to seek employment elsewhere. When they do, they engage in sex with other women and become infected. When they go home, they infect their wives. Because there is no medical care, the women have no access to anti-viral drugs during pregnancy and nursing - which they do for at least 3 years. Thus the mothers infect their babies. Remember, this is also a country that has all sorts of rituals and rites of man and womanhood - circumciscion, (male and female), tatoos, scarring, piercings, etc. that are done in the village by one of their own. The young teens can get infected that way. Some tribes also demand proof of fertility prior to a marriage so early sexual activity is encouraged. In others, there are no restrictions on sex at all - that is their socialtal norm. Then, of course, there are the mass rapes being carried out in the regions at war. In those areas, almost every single feamale, no what age - even infants - have been raped and many multiple times. What truly sad is many African women DO try to get their husbands to use condoms when they come home after having been working in the city but instead the husbands beat them sensless for asking. Then give them HIV anyway and leave them when they get sick. Then when he leaves, she has to hope his family doesn't try to kill her to get their dowery back. So for places like Africa, the condom can be a life-saver. You see, the women in those countries don't have the right to say \"No\". If they do they get beaten, raped and/or killed - and if the man has HIV/AIDS, she's dead anyway. Now, someone seems to feel that people (teens) having easy access to condoms (birth control) has done nothing to reduce teen pregnancy or STDs. Well, that depends on whose statistics you're looking at, my friend. If you look at Scandinavia where kids are taught sex education at an early age because they believe sex and sexuality are natural, have birth control available over the counter and don't mind teens having sex then you'll see they have the lowest teen pregnancy and STD rate on the planet. The US has the highest in the western world. In 2001, Tommy Thompson, Sec. HEW for Bush, released a study that proved comprehensive sex education for teen and easy access to birth control for DID NOT increase sexual activity among that age group. In fact, the study (UW) showed that teenage girls who had birth control available to them were more likely to REFRAIN from sexual activity! But despite this, federal funding for any clinic that even mentioned the word \"abortion\" was withdrawn - worldwide - thus during the Bush years, easy access to contraception such as condoms dried up and I have no doubt the number haven't changed much over the past 8 years. And, if states would get serious about enforcing the Statutory Rape laws I think you'd see a huge number of pregnancies go down. Don't you even wonder for a minute about all the 14, 15 year-old pregnant girls you see? Guess what? Bettcha most of the FOBs are (well-)over 18. The other thing that has been proven to lower the HIV risk is circumcision. You ready to join THAT band-wagon?", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-31 02:19:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "entmjzi"
    }, 
    {
        "content": "Bagging It Up for the Pope The Pope's gonna be ****ed: The International Women's Health Coalition is selling condoms challenging the pontiff's recent declaration that they \"increase the problem\" of AIDS. According to the feminist blog Akimbo, the condoms -- adorned with a picture of Pope Benedict XVI and a message above his image declaring, \"I said no!\" -- the rubbers are selling like hot cakes in France. Spain countered the pope's anti-condom statement in March by sending millions of condoms to AIDS-ravaged Africa. From The Advocate", 
        "intTime": 20090404, 
        "postID": 20, 
        "quote": "", 
        "reply": "Bagging It Up for the Pope The Pope's gonna be ****ed: The International Women's Health Coalition is selling condoms challenging the pontiff's recent declaration that they \"increase the problem\" of AIDS. According to the feminist blog Akimbo, the condoms -- adorned with a picture of Pope Benedict XVI and a message above his image declaring, \"I said no!\" -- the rubbers are selling like hot cakes in France. Spain countered the pope's anti-condom statement in March by sending millions of condoms to AIDS-ravaged Africa. From The Advocate", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-04-04 00:59:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Medical journal says Pope distorting condom facts \"http://uk.reuters.com/article/homepageCrisis/idUKLR110752._CH_.2420\" quote: The Lancet in an editorial called on the Pope to retract the comments made last week, saying anything less would be an immense disservice to the public and health advocates fighting to contain the disease. \"When any influential person, be it a religious or political leader, makes a false scientific statement that could be devastating to the health of millions of people, they should retract or correct the public record,\" the editorial said. \"By saying that condoms exacerbate the problem of HIV/AIDS, the Pope has publicly distorted scientific evidence to promote Catholic doctrine on the issue.\" Should the Pope admit to making a mistake (I will not say a deliberate distortion of the facts) by claiming that condoms make the AIDS problem worse? Is Lancet right when it says that such false claims (claims that science shows are false) by Government or Religous leaders can cause a lot of harm?", 
        "intTime": 20090327, 
        "postID": 21, 
        "quote": "The Lancet in an editorial called on the Pope to retract the comments made last week, saying anything less would be an immense disservice to the public and health advocates fighting to contain the disease. \"When any influential person, be it a religious or political leader, makes a false scientific statement that could be devastating to the health of millions of people, they should retract or correct the public record,\" the editorial said. \"By saying that condoms exacerbate the problem of HIV/AIDS, the Pope has publicly distorted scientific evidence to promote Catholic doctrine on the issue.\"", 
        "reply": "Medical journal says Pope distorting condom facts \"http://uk.reuters.com/article/homepageCrisis/idUKLR110752._CH_.2420\"  Should the Pope admit to making a mistake (I will not say a deliberate distortion of the facts) by claiming that condoms make the AIDS problem worse? Is Lancet right when it says that such false claims (claims that science shows are false) by Government or Religous leaders can cause a lot of harm?", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-27 08:11:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: Medical journal says Pope distorting condom facts \"http://uk.reuters.com/article/homepageCrisis/idUKLR110752._CH_.2420\" quote: The Lancet in an editorial called on the Pope to retract the comments made last week, saying anything less would be an immense disservice to the public and health advocates fighting to contain the disease. \"When any influential person, be it a religious or political leader, makes a false scientific statement that could be devastating to the health of millions of people, they should retract or correct the public record,\" the editorial said. \"By saying that condoms exacerbate the problem of HIV/AIDS, the Pope has publicly distorted scientific evidence to promote Catholic doctrine on the issue.\" Should the Pope admit to making a mistake (I will not say a deliberate distortion of the facts) by claiming that condoms make the AIDS problem worse? Is Lancet right when it says that such false claims (claims that science shows are false) by Government or Religous leaders can cause a lot of harm? You mean to say that the Nazi sympathizer lied? I can't believe it.", 
        "intTime": 20090327, 
        "postID": 22, 
        "quote": "Originally posted by rayld2: Medical journal says Pope distorting condom facts \"http://uk.reuters.com/article/homepageCrisis/idUKLR110752._CH_.2420\" quote: The Lancet in an editorial called on the Pope to retract the comments made last week, saying anything less would be an immense disservice to the public and health advocates fighting to contain the disease. \"When any influential person, be it a religious or political leader, makes a false scientific statement that could be devastating to the health of millions of people, they should retract or correct the public record,\" the editorial said. \"By saying that condoms exacerbate the problem of HIV/AIDS, the Pope has publicly distorted scientific evidence to promote Catholic doctrine on the issue.\" Should the Pope admit to making a mistake (I will not say a deliberate distortion of the facts) by claiming that condoms make the AIDS problem worse? Is Lancet right when it says that such false claims (claims that science shows are false) by Government or Religous leaders can cause a lot of harm?", 
        "reply": " You mean to say that the Nazi sympathizer lied? I can't believe it.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-27 19:01:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "thorin001"
    }, 
    {
        "content": "I guess it's safe to say that the Pope doesn't use a condom while engaging his Alter boys.", 
        "intTime": 20090327, 
        "postID": 23, 
        "quote": "", 
        "reply": "I guess it's safe to say that the Pope doesn't use a condom while engaging his Alter boys.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-27 19:15:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "badmac933"
    }, 
    {
        "content": "quote: Originally posted by badmac933: I guess it's safe to say that the Pope doesn't use a condom while engaging his Alter boys. That's harsh. Even I wasn't going to go there.", 
        "intTime": 20090327, 
        "postID": 24, 
        "quote": "Originally posted by badmac933: I guess it's safe to say that the Pope doesn't use a condom while engaging his Alter boys.", 
        "reply": " That's harsh. Even I wasn't going to go there.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-27 19:22:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "thorin001"
    }, 
    {
        "content": "Vulgar references aside, yes - the Pope is wrong to have said this. Not only wrong, but irresponsible to his flock. And yes, Lancet is correct when it asserts that scientifically incorrect public statements made by government or religious leaders can, indeed, cause a lot of harm. I was raised high-church Episcopalian, but married Catholic, raised my children in the Church, and feel more comfortable there than in an Episcopal church these days. But I never officially converted, and probably never will, because of issues like this, the Church's position on birth control (I can understand the opposition to abortion, though I do not agree), and the Church's view of the status of women in the Church and in the secular world. Most priests are NOT pedophiles. Most evangelists are NOT closet homosexuals or drug addicts. Very few Germans are Nazis or Nazi-sympathizers. To stoop to such broad-brush insults only exposes one's own lack of intelligence and innate prejudices. Grow up, badmac and thorin.", 
        "intTime": 20090328, 
        "postID": 25, 
        "quote": "", 
        "reply": "Vulgar references aside, yes - the Pope is wrong to have said this. Not only wrong, but irresponsible to his flock. And yes, Lancet is correct when it asserts that scientifically incorrect public statements made by government or religious leaders can, indeed, cause a lot of harm. I was raised high-church Episcopalian, but married Catholic, raised my children in the Church, and feel more comfortable there than in an Episcopal church these days. But I never officially converted, and probably never will, because of issues like this, the Church's position on birth control (I can understand the opposition to abortion, though I do not agree), and the Church's view of the status of women in the Church and in the secular world. Most priests are NOT pedophiles. Most evangelists are NOT closet homosexuals or drug addicts. Very few Germans are Nazis or Nazi-sympathizers. To stoop to such broad-brush insults only exposes one's own lack of intelligence and innate prejudices. Grow up, badmac and thorin.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-28 03:42:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: Vulgar references aside, yes - the Pope is wrong to have said this. Not only wrong, but irresponsible to his flock. And yes, Lancet is correct when it asserts that scientifically incorrect public statements made by government or religious leaders can, indeed, cause a lot of harm. I was raised high-church Episcopalian, but married Catholic, raised my children in the Church, and feel more comfortable there than in an Episcopal church these days. But I never officially converted, and probably never will, because of issues like this, the Church's position on birth control (I can understand the opposition to abortion, though I do not agree), and the Church's view of the status of women in the Church and in the secular world. Most priests are NOT pedophiles. Most evangelists are NOT closet homosexuals or drug addicts. Very few Germans are Nazis or Nazi-sympathizers. To stoop to such broad-brush insults only exposes one's own lack of intelligence and innate prejudices. Grow up, badmac and thorin. I wasn't refering to Germans in general, or even to Catholics in general. I was refering specifically to the guy currently wearing the pope hat. Check his record, he earned the lable of Nazi-sympathizer.", 
        "intTime": 20090328, 
        "postID": 26, 
        "quote": "Originally posted by Cider33_Alpha: Vulgar references aside, yes - the Pope is wrong to have said this. Not only wrong, but irresponsible to his flock. And yes, Lancet is correct when it asserts that scientifically incorrect public statements made by government or religious leaders can, indeed, cause a lot of harm. I was raised high-church Episcopalian, but married Catholic, raised my children in the Church, and feel more comfortable there than in an Episcopal church these days. But I never officially converted, and probably never will, because of issues like this, the Church's position on birth control (I can understand the opposition to abortion, though I do not agree), and the Church's view of the status of women in the Church and in the secular world. Most priests are NOT pedophiles. Most evangelists are NOT closet homosexuals or drug addicts. Very few Germans are Nazis or Nazi-sympathizers. To stoop to such broad-brush insults only exposes one's own lack of intelligence and innate prejudices. Grow up, badmac and thorin.", 
        "reply": " I wasn't refering to Germans in general, or even to Catholics in general. I was refering specifically to the guy currently wearing the pope hat. Check his record, he earned the lable of Nazi-sympathizer.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-28 07:38:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "thorin001"
    }, 
    {
        "content": "quote: Originally posted by thorin001: quote: Originally posted by Cider33_Alpha: Vulgar references aside, yes - the Pope is wrong to have said this. Not only wrong, but irresponsible to his flock. And yes, Lancet is correct when it asserts that scientifically incorrect public statements made by government or religious leaders can, indeed, cause a lot of harm. I was raised high-church Episcopalian, but married Catholic, raised my children in the Church, and feel more comfortable there than in an Episcopal church these days. But I never officially converted, and probably never will, because of issues like this, the Church's position on birth control (I can understand the opposition to abortion, though I do not agree), and the Church's view of the status of women in the Church and in the secular world. Most priests are NOT pedophiles. Most evangelists are NOT closet homosexuals or drug addicts. Very few Germans are Nazis or Nazi-sympathizers. To stoop to such broad-brush insults only exposes one's own lack of intelligence and innate prejudices. Grow up, badmac and thorin. I wasn't refering to Germans in general, or even to Catholics in general. I was refering specifically to the guy currently wearing the pope hat. Check his record, he earned the lable of Nazi-sympathizer. When the issue involved is the lives of millions of people and a well known religious authority says a major preventitive measure, \"makes thing worse,\" it becomes almost criminal. Dave", 
        "intTime": 20090328, 
        "postID": 27, 
        "quote": "Originally posted by thorin001: quote: Originally posted by Cider33_Alpha: Vulgar references aside, yes - the Pope is wrong to have said this. Not only wrong, but irresponsible to his flock. And yes, Lancet is correct when it asserts that scientifically incorrect public statements made by government or religious leaders can, indeed, cause a lot of harm. I was raised high-church Episcopalian, but married Catholic, raised my children in the Church, and feel more comfortable there than in an Episcopal church these days. But I never officially converted, and probably never will, because of issues like this, the Church's position on birth control (I can understand the opposition to abortion, though I do not agree), and the Church's view of the status of women in the Church and in the secular world. Most priests are NOT pedophiles. Most evangelists are NOT closet homosexuals or drug addicts. Very few Germans are Nazis or Nazi-sympathizers. To stoop to such broad-brush insults only exposes one's own lack of intelligence and innate prejudices. Grow up, badmac and thorin. I wasn't refering to Germans in general, or even to Catholics in general. I was refering specifically to the guy currently wearing the pope hat. Check his record, he earned the lable of Nazi-sympathizer.", 
        "reply": " When the issue involved is the lives of millions of people and a well known religious authority says a major preventitive measure, \"makes thing worse,\" it becomes almost criminal. Dave", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-28 09:36:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: When the issue involved is the lives of millions of people and a well known religious authority says a major preventitive measure, \"makes thing worse,\" it becomes almost criminal. Can you explain then why the 'seat belts' and 'air bags' in automobiles has not significantly lowered traffic fatalities.", 
        "intTime": 20090328, 
        "postID": 28, 
        "quote": "When the issue involved is the lives of millions of people and a well known religious authority says a major preventitive measure, \"makes thing worse,\" it becomes almost criminal.", 
        "reply": " Can you explain then why the 'seat belts' and 'air bags' in automobiles has not significantly lowered traffic fatalities.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-28 16:52:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "54D_Zippo"
    }, 
    {
        "content": "quote: Can you explain then why the 'seat belts' and 'air bags' in automobiles has not significantly lowered traffic fatalities. Because some 50% isn't significant?", 
        "intTime": 20090328, 
        "postID": 29, 
        "quote": "Can you explain then why the 'seat belts' and 'air bags' in automobiles has not significantly lowered traffic fatalities.", 
        "reply": " Because some 50% isn't significant?", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-28 17:29:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "quote: Originally posted by 2nd_freedomfighter: quote: Can you explain then why the 'seat belts' and 'air bags' in automobiles has not significantly lowered traffic fatalities. Because some 50% isn't significant? Condoms lower the risk of contracting AIDS. Every study made on the subject shows this in stark and bleak terms. The Pope has a right to his moral feelings and opinions - He does NOT have a right to make up facts. Dave", 
        "intTime": 20090328, 
        "postID": 30, 
        "quote": "Originally posted by 2nd_freedomfighter: quote: Can you explain then why the 'seat belts' and 'air bags' in automobiles has not significantly lowered traffic fatalities. Because some 50% isn't significant?", 
        "reply": " Condoms lower the risk of contracting AIDS. Every study made on the subject shows this in stark and bleak terms. The Pope has a right to his moral feelings and opinions - He does NOT have a right to make up facts. Dave", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-28 17:33:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "Grachus"
    }, 
    {
        "content": "Africa is being decimated by the spread of AIDS. Whatever methods available should be used to remediate this epidemic. All officials, religious or political, have a moral obligation to do whatever they can to alleviate human suffering. To frustrate or otherwise interpose objection to recognized methodologies for remediation is itself immoral in my opinion. Abstinence may satisfy the Pope's moral qualms but it is an unrealistic solution to the sexual urges of many, if not most, of the people of the world. Even the leader of the Catholic Church should face reality in the face of the scourge of AIDS.", 
        "intTime": 20090328, 
        "postID": 31, 
        "quote": "", 
        "reply": "Africa is being decimated by the spread of AIDS. Whatever methods available should be used to remediate this epidemic. All officials, religious or political, have a moral obligation to do whatever they can to alleviate human suffering. To frustrate or otherwise interpose objection to recognized methodologies for remediation is itself immoral in my opinion. Abstinence may satisfy the Pope's moral qualms but it is an unrealistic solution to the sexual urges of many, if not most, of the people of the world. Even the leader of the Catholic Church should face reality in the face of the scourge of AIDS.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-28 18:45:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "fnewt"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Condoms lower the risk of contracting AIDS. Every study made on the subject shows this in stark and bleak terms. The Pope has a right to his moral feelings and opinions - He does NOT have a right to make up facts. Dave Agreed, He should Apologize...but He won't...as Pope he's God's representative here on earth he is infallible...just ask him, he'll tell ya.", 
        "intTime": 20090328, 
        "postID": 32, 
        "quote": "Originally posted by Grachus: Condoms lower the risk of contracting AIDS. Every study made on the subject shows this in stark and bleak terms. The Pope has a right to his moral feelings and opinions - He does NOT have a right to make up facts. Dave", 
        "reply": " Agreed, He should Apologize...but He won't...as Pope he's God's representative here on earth he is infallible...just ask him, he'll tell ya.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-28 19:49:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "CombatNAC"
    }, 
    {
        "content": "quote: Africa is being decimated by the spread of AIDS. Whatever methods available should be used to remediate this epidemic. Are the African Rapists going to use condoms if provided? Are 'Aids' victims going to worry about giving 'Aids' to another. You people ignore facts: Condoms are provided throughout the US and how has it reduced teen pregnancies or disease? quote: Abstinence may satisfy the Pope's moral qualms but it is an unrealistic solution to the sexual urges of many, if not most, of the people of the world. Even the leader of the Catholic Church should face reality in the face of the scourge of AIDS. The reality is that people no longer take responsibility for their actions and our narcissistic society promotes this irresponsibility by providing a 'bandaid' to cover misbehavior rather than treat the disease. To make it simple for you that are so quick to comdemn the Pope; if one partner has Aids and a condom is used then it is \"SAFE\" to have sex? Who would willingly risk it?", 
        "intTime": 20090329, 
        "postID": 33, 
        "quote": "Africa is being decimated by the spread of AIDS. Whatever methods available should be used to remediate this epidemic.", 
        "reply": " Are the African Rapists going to use condoms if provided? Are 'Aids' victims going to worry about giving 'Aids' to another. You people ignore facts: Condoms are provided throughout the US and how has it reduced teen pregnancies or disease? quote: Abstinence may satisfy the Pope's moral qualms but it is an unrealistic solution to the sexual urges of many, if not most, of the people of the world. Even the leader of the Catholic Church should face reality in the face of the scourge of AIDS. The reality is that people no longer take responsibility for their actions and our narcissistic society promotes this irresponsibility by providing a 'bandaid' to cover misbehavior rather than treat the disease. To make it simple for you that are so quick to comdemn the Pope; if one partner has Aids and a condom is used then it is \"SAFE\" to have sex? Who would willingly risk it?", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-29 12:01:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "54D_Zippo"
    }, 
    {
        "content": "quote: Originally posted by 54D_Zippo: quote: Africa is being decimated by the spread of AIDS. Whatever methods available should be used to remediate this epidemic. Are the African Rapists going to use condoms if provided? Are 'Aids' victims going to worry about giving 'Aids' to another. You people ignore facts: Condoms are provided throughout the US and how has it reduced teen pregnancies or disease? quote: Abstinence may satisfy the Pope's moral qualms but it is an unrealistic solution to the sexual urges of many, if not most, of the people of the world. Even the leader of the Catholic Church should face reality in the face of the scourge of AIDS. The reality is that people no longer take responsibility for their actions and our narcissistic society promotes this irresponsibility by providing a 'bandaid' to cover misbehavior rather than treat the disease. To make it simple for you that are so quick to comdemn the Pope; if one partner has Aids and a condom is used then it is \"SAFE\" to have sex? Who would willingly risk it? A rather strange post. Has anyone claimed that condems cure aids? \"Will rapists use condoms?\" Does the above mean something? \"Are 'Aids' victims going to worry about giving Aids' to another?\" Most will, some wont. If I had aids, you can bet your bottom dollar I would worry about this. Sex is a natural act. Not all the laws, not all the religions, nothing has ever stopped people from having sex. Without wishing to badmouth the majority of Catholic Priests and Nuns, plenty of them have sex as well. Based on the numbers here, condoms will save the lives of millions of people - You can sprout about morality, abstinance, whatever comes into your mind - But this is a Fact. As I said, YOU are entitled to your morality, you are even entitled to swear off sex, with or without a condom - But you are NOT entitled to make up your own \"facts,\" and neither is the Pope. Dave", 
        "intTime": 20090329, 
        "postID": 34, 
        "quote": "Originally posted by 54D_Zippo: quote: Africa is being decimated by the spread of AIDS. Whatever methods available should be used to remediate this epidemic. Are the African Rapists going to use condoms if provided? Are 'Aids' victims going to worry about giving 'Aids' to another. You people ignore facts: Condoms are provided throughout the US and how has it reduced teen pregnancies or disease? quote: Abstinence may satisfy the Pope's moral qualms but it is an unrealistic solution to the sexual urges of many, if not most, of the people of the world. Even the leader of the Catholic Church should face reality in the face of the scourge of AIDS. The reality is that people no longer take responsibility for their actions and our narcissistic society promotes this irresponsibility by providing a 'bandaid' to cover misbehavior rather than treat the disease. To make it simple for you that are so quick to comdemn the Pope; if one partner has Aids and a condom is used then it is \"SAFE\" to have sex? Who would willingly risk it?", 
        "reply": " A rather strange post. Has anyone claimed that condems cure aids? \"Will rapists use condoms?\" Does the above mean something? \"Are 'Aids' victims going to worry about giving Aids' to another?\" Most will, some wont. If I had aids, you can bet your bottom dollar I would worry about this. Sex is a natural act. Not all the laws, not all the religions, nothing has ever stopped people from having sex. Without wishing to badmouth the majority of Catholic Priests and Nuns, plenty of them have sex as well. Based on the numbers here, condoms will save the lives of millions of people - You can sprout about morality, abstinance, whatever comes into your mind - But this is a Fact. As I said, YOU are entitled to your morality, you are even entitled to swear off sex, with or without a condom - But you are NOT entitled to make up your own \"facts,\" and neither is the Pope. Dave", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-29 13:00:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: A rather strange post. Has anyone claimed that condems cure aids? Not to my knowledge and neither did I! quote: But you are NOT entitled to make up your own \"facts,\" and neither is the Pope. Where are the \"FACTS\" that say supplying Africans or anyone for that matter with condoms will save \"millions of lives\"? How many lives will be lost with the False Sense of Security that they are safe because they used a condom. Check the \"African Statistics\" or world stats and you will see a considerable number of Aids victims did not get the disease from consentual sex. I apologize for thinking that common sense could overcome your 'hatred' for (the Pope, Catholics, Religion, or whatever doesn't meet your personal fancy). quote: Without wishing to badmouth the majority of Catholic Priests and Nuns, plenty of them have sex as well. What does that have to do with anything in the topic except your desire to 'badmouth' Catholics. quote: Sex is a natural act. Not all the laws, not all the religions, nothing has ever stopped people from having sex. ... And not all the condoms in the world are going to 'STOP' the spread of STD's! You are so intent in finding fault that you pick an idea \"out of context\" to the message so that you can put it and its author down. You can not legislate nor medically prescibe responsibility!", 
        "intTime": 20090329, 
        "postID": 35, 
        "quote": "A rather strange post. Has anyone claimed that condems cure aids?", 
        "reply": " Not to my knowledge and neither did I! quote: But you are NOT entitled to make up your own \"facts,\" and neither is the Pope. Where are the \"FACTS\" that say supplying Africans or anyone for that matter with condoms will save \"millions of lives\"? How many lives will be lost with the False Sense of Security that they are safe because they used a condom. Check the \"African Statistics\" or world stats and you will see a considerable number of Aids victims did not get the disease from consentual sex. I apologize for thinking that common sense could overcome your 'hatred' for (the Pope, Catholics, Religion, or whatever doesn't meet your personal fancy). quote: Without wishing to badmouth the majority of Catholic Priests and Nuns, plenty of them have sex as well. What does that have to do with anything in the topic except your desire to 'badmouth' Catholics. quote: Sex is a natural act. Not all the laws, not all the religions, nothing has ever stopped people from having sex. ... And not all the condoms in the world are going to 'STOP' the spread of STD's! You are so intent in finding fault that you pick an idea \"out of context\" to the message so that you can put it and its author down. You can not legislate nor medically prescibe responsibility!", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-29 21:00:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "54D_Zippo"
    }, 
    {
        "content": "CombatNAC: the Pope is \"infallible\" in areas of religious doctrine. He is not considered infallible - by himself, the Church or anyone else - as infallible on matters outside that narrow area, including medical science. 54D_Zippo: I don't know where you're getting your \"facts\" that condoms don't prevent pregnancy or the spread of STDs, including HIV/AIDS. Fact is, they DO. My last job, prior to returning to active duty, was as director of student health services at a public university. The majority of students we saw were for birth control or STD related issues. Many students came in for the \"morning after pill\" because they neglected to use a condom or it broke. Those who came in for STD testing also volunteered the information that they had had unprotected sex. We did NOT see students who routinely used condoms (we had a large jar full of 'em in the hallway, free for the taking) - except as noted in the event of condom breakage. That's just a small snapshot of what is found on a much wider scale throughout this country and around the world. Do some research - try looking on \"http://www.cdc.gov\" and drill down to the information on STDs and pregnancy. It's pretty plain to see that condoms ARE effective in reducing the incidence of both pregnancy and STDs, to include HIV/AIDS.", 
        "intTime": 20090330, 
        "postID": 36, 
        "quote": "", 
        "reply": "CombatNAC: the Pope is \"infallible\" in areas of religious doctrine. He is not considered infallible - by himself, the Church or anyone else - as infallible on matters outside that narrow area, including medical science. 54D_Zippo: I don't know where you're getting your \"facts\" that condoms don't prevent pregnancy or the spread of STDs, including HIV/AIDS. Fact is, they DO. My last job, prior to returning to active duty, was as director of student health services at a public university. The majority of students we saw were for birth control or STD related issues. Many students came in for the \"morning after pill\" because they neglected to use a condom or it broke. Those who came in for STD testing also volunteered the information that they had had unprotected sex. We did NOT see students who routinely used condoms (we had a large jar full of 'em in the hallway, free for the taking) - except as noted in the event of condom breakage. That's just a small snapshot of what is found on a much wider scale throughout this country and around the world. Do some research - try looking on \"http://www.cdc.gov\" and drill down to the information on STDs and pregnancy. It's pretty plain to see that condoms ARE effective in reducing the incidence of both pregnancy and STDs, to include HIV/AIDS.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-30 05:25:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: 54D_Zippo: I don't know where you're getting your \"facts\" that condoms don't prevent pregnancy or the spread of STDs, including HIV/AIDS. Fact is, they DO. My last job, prior to returning to active duty, was as director of student health services at a public university. The majority of students we saw were for birth control or STD related issues. Never said that \"they don't\" but rather that they are not 100% effective even when used. They are a \"False Sense of Security\". An umbrella is pretty effective against getting wet in a rainstorm. My point and the Pope's point is that the best method to avoid 'AIDS' it to abstain or have a monogomous relationship with a virgin/cherry boy. I suggest you read my last paragraph and reread it as you are more intent on finding fault than trying to understand the content. I am from a family of nurses, even married one. I taught school for over 20 years. I have witnessed the horrors of AIDS and other STDs by seemingly responsible individuals who took precautions such as 'condoms' and 'non-insertion' sex acts that still became infected. Find fault if you like but my responsible behavior and that of the Pope's and many others make it unlikely that we will ever be infected with AIDS or any other STD.", 
        "intTime": 20090330, 
        "postID": 37, 
        "quote": "54D_Zippo: I don't know where you're getting your \"facts\" that condoms don't prevent pregnancy or the spread of STDs, including HIV/AIDS. Fact is, they DO. My last job, prior to returning to active duty, was as director of student health services at a public university. The majority of students we saw were for birth control or STD related issues.", 
        "reply": " Never said that \"they don't\" but rather that they are not 100% effective even when used. They are a \"False Sense of Security\". An umbrella is pretty effective against getting wet in a rainstorm. My point and the Pope's point is that the best method to avoid 'AIDS' it to abstain or have a monogomous relationship with a virgin/cherry boy. I suggest you read my last paragraph and reread it as you are more intent on finding fault than trying to understand the content. I am from a family of nurses, even married one. I taught school for over 20 years. I have witnessed the horrors of AIDS and other STDs by seemingly responsible individuals who took precautions such as 'condoms' and 'non-insertion' sex acts that still became infected. Find fault if you like but my responsible behavior and that of the Pope's and many others make it unlikely that we will ever be infected with AIDS or any other STD.", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-30 23:38:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "54D_Zippo"
    }, 
    {
        "content": "Of course abstinence or a monogamous relationship (for life) is the only guaranteed way to avoid STDs, and only abstinence guarantees no pregnancy. No medication, vaccine or device is 100% safe or 100% effective 100% of the time. It's stupid to even suggest such a thing. My beef with what the Pope has said is that he is ignoring the best (and cheapest) deterrent in the battles against HIV/AIDS and unwanted pregnancy outside of abstinence or monogamy. Your umbrella analogy is a good one - it's not 100% effective, but it's better to have one in a storm than not have one, no?", 
        "intTime": 20090331, 
        "postID": 38, 
        "quote": "", 
        "reply": "Of course abstinence or a monogamous relationship (for life) is the only guaranteed way to avoid STDs, and only abstinence guarantees no pregnancy. No medication, vaccine or device is 100% safe or 100% effective 100% of the time. It's stupid to even suggest such a thing. My beef with what the Pope has said is that he is ignoring the best (and cheapest) deterrent in the battles against HIV/AIDS and unwanted pregnancy outside of abstinence or monogamy. Your umbrella analogy is a good one - it's not 100% effective, but it's better to have one in a storm than not have one, no?", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-31 00:50:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "Yo! Let's DO get our facts straight here. First of all, let's learn WHY HIV/AIDS is the plague it is in Africa. It all starts with poverty, lack of education, superstition and no health care. HIV arose out of Africa, probably from monkies but no one knows for sure. Africa is devastatingly poor and plagued with famine, draught, floods, wars, diseases, etc. It's common for the men in a village to seek employment elsewhere. When they do, they engage in sex with other women and become infected. When they go home, they infect their wives. Because there is no medical care, the women have no access to anti-viral drugs during pregnancy and nursing - which they do for at least 3 years. Thus the mothers infect their babies. Remember, this is also a country that has all sorts of rituals and rites of man and womanhood - circumciscion, (male and female), tatoos, scarring, piercings, etc. that are done in the village by one of their own. The young teens can get infected that way. Some tribes also demand proof of fertility prior to a marriage so early sexual activity is encouraged. In others, there are no restrictions on sex at all - that is their socialtal norm. Then, of course, there are the mass rapes being carried out in the regions at war. In those areas, almost every single feamale, no what age - even infants - have been raped and many multiple times. What truly sad is many African women DO try to get their husbands to use condoms when they come home after having been working in the city but instead the husbands beat them sensless for asking. Then give them HIV anyway and leave them when they get sick. Then when he leaves, she has to hope his family doesn't try to kill her to get their dowery back. So for places like Africa, the condom can be a life-saver. You see, the women in those countries don't have the right to say \"No\". If they do they get beaten, raped and/or killed - and if the man has HIV/AIDS, she's dead anyway. Now, someone seems to feel that people (teens) having easy access to condoms (birth control) has done nothing to reduce teen pregnancy or STDs. Well, that depends on whose statistics you're looking at, my friend. If you look at Scandinavia where kids are taught sex education at an early age because they believe sex and sexuality are natural, have birth control available over the counter and don't mind teens having sex then you'll see they have the lowest teen pregnancy and STD rate on the planet. The US has the highest in the western world. In 2001, Tommy Thompson, Sec. HEW for Bush, released a study that proved comprehensive sex education for teen and easy access to birth control for DID NOT increase sexual activity among that age group. In fact, the study (UW) showed that teenage girls who had birth control available to them were more likely to REFRAIN from sexual activity! But despite this, federal funding for any clinic that even mentioned the word \"abortion\" was withdrawn - worldwide - thus during the Bush years, easy access to contraception such as condoms dried up and I have no doubt the number haven't changed much over the past 8 years. And, if states would get serious about enforcing the Statutory Rape laws I think you'd see a huge number of pregnancies go down. Don't you even wonder for a minute about all the 14, 15 year-old pregnant girls you see? Guess what? Bettcha most of the FOBs are (well-)over 18. The other thing that has been proven to lower the HIV risk is circumcision. You ready to join THAT band-wagon?", 
        "intTime": 20090331, 
        "postID": 39, 
        "quote": "", 
        "reply": "Yo! Let's DO get our facts straight here. First of all, let's learn WHY HIV/AIDS is the plague it is in Africa. It all starts with poverty, lack of education, superstition and no health care. HIV arose out of Africa, probably from monkies but no one knows for sure. Africa is devastatingly poor and plagued with famine, draught, floods, wars, diseases, etc. It's common for the men in a village to seek employment elsewhere. When they do, they engage in sex with other women and become infected. When they go home, they infect their wives. Because there is no medical care, the women have no access to anti-viral drugs during pregnancy and nursing - which they do for at least 3 years. Thus the mothers infect their babies. Remember, this is also a country that has all sorts of rituals and rites of man and womanhood - circumciscion, (male and female), tatoos, scarring, piercings, etc. that are done in the village by one of their own. The young teens can get infected that way. Some tribes also demand proof of fertility prior to a marriage so early sexual activity is encouraged. In others, there are no restrictions on sex at all - that is their socialtal norm. Then, of course, there are the mass rapes being carried out in the regions at war. In those areas, almost every single feamale, no what age - even infants - have been raped and many multiple times. What truly sad is many African women DO try to get their husbands to use condoms when they come home after having been working in the city but instead the husbands beat them sensless for asking. Then give them HIV anyway and leave them when they get sick. Then when he leaves, she has to hope his family doesn't try to kill her to get their dowery back. So for places like Africa, the condom can be a life-saver. You see, the women in those countries don't have the right to say \"No\". If they do they get beaten, raped and/or killed - and if the man has HIV/AIDS, she's dead anyway. Now, someone seems to feel that people (teens) having easy access to condoms (birth control) has done nothing to reduce teen pregnancy or STDs. Well, that depends on whose statistics you're looking at, my friend. If you look at Scandinavia where kids are taught sex education at an early age because they believe sex and sexuality are natural, have birth control available over the counter and don't mind teens having sex then you'll see they have the lowest teen pregnancy and STD rate on the planet. The US has the highest in the western world. In 2001, Tommy Thompson, Sec. HEW for Bush, released a study that proved comprehensive sex education for teen and easy access to birth control for DID NOT increase sexual activity among that age group. In fact, the study (UW) showed that teenage girls who had birth control available to them were more likely to REFRAIN from sexual activity! But despite this, federal funding for any clinic that even mentioned the word \"abortion\" was withdrawn - worldwide - thus during the Bush years, easy access to contraception such as condoms dried up and I have no doubt the number haven't changed much over the past 8 years. And, if states would get serious about enforcing the Statutory Rape laws I think you'd see a huge number of pregnancies go down. Don't you even wonder for a minute about all the 14, 15 year-old pregnant girls you see? Guess what? Bettcha most of the FOBs are (well-)over 18. The other thing that has been proven to lower the HIV risk is circumcision. You ready to join THAT band-wagon?", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-03-31 02:19:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "entmjzi"
    }, 
    {
        "content": "Bagging It Up for the Pope The Pope's gonna be ****ed: The International Women's Health Coalition is selling condoms challenging the pontiff's recent declaration that they \"increase the problem\" of AIDS. According to the feminist blog Akimbo, the condoms -- adorned with a picture of Pope Benedict XVI and a message above his image declaring, \"I said no!\" -- the rubbers are selling like hot cakes in France. Spain countered the pope's anti-condom statement in March by sending millions of condoms to AIDS-ravaged Africa. From The Advocate", 
        "intTime": 20090404, 
        "postID": 40, 
        "quote": "", 
        "reply": "Bagging It Up for the Pope The Pope's gonna be ****ed: The International Women's Health Coalition is selling condoms challenging the pontiff's recent declaration that they \"increase the problem\" of AIDS. According to the feminist blog Akimbo, the condoms -- adorned with a picture of Pope Benedict XVI and a message above his image declaring, \"I said no!\" -- the rubbers are selling like hot cakes in France. Spain countered the pope's anti-condom statement in March by sending millions of condoms to AIDS-ravaged Africa. From The Advocate", 
        "threadID": "672198221_1920080912001", 
        "time": "2009-04-04 00:59:00", 
        "title": "Medical journal says Pope distorting condom facts", 
        "userID": "IHAWKER"
    }
]