[
    {
        "content": "++http://www.foxnews.com/politics/2009/05/20/report-shows-air-quality-improved-during-bush-administration/++ Air quality improved during the past 10 years--more quickly under Bush than under Clinton. Obviously, significant progress does not really require the Cap and Tax crap set up to line the pockets of the global warming hypocrites. The typical American family does not need a multi-thousand dollar increase in their effective annual taxes to assuage the consciences of those who worship Mother Earth or wish to sucker fools.",
        "intTime": 20090520,
        "postID": 1,
        "quote": "",
        "reply": "++http://www.foxnews.com/politics/2009/05/20/report-shows-air-quality-improved-during-bush-administration/++ Air quality improved during the past 10 years--more quickly under Bush than under Clinton. Obviously, significant progress does not really require the Cap and Tax crap set up to line the pockets of the global warming hypocrites. The typical American family does not need a multi-thousand dollar increase in their effective annual taxes to assuage the consciences of those who worship Mother Earth or wish to sucker fools.",
        "threadID": "672198221_8560057322001",
        "time": "2009-05-20 09:09:00",
        "title": "Air Quality Improves Much; Environut Control-Freak \"Cap and Tax\" Seems Extraneous",
        "userID": "RRR52"
    },
    {
        "content": "quote: Originally posted by RRR52: ++http://www.foxnews.com/politics/2009/05/20/report-shows-air-quality-improved-during-bush-administration/++ Air quality improved during the past 10 years--more quickly under Bush than under Clinton. Obviously, significant progress does not really require the Cap and Tax crap set up to line the pockets of the global warming hypocrites. The typical American family does not need a multi-thousand dollar increase in their effective annual taxes to assuage the consciences of those who worship Mother Earth or wish to sucker fools. Improvement under laws passed during both Repub and Demo admins prior to the Bush admin is a completely separate issue from if Cap and Trade is the best or even a good way to get MORE improvement. For example most people would see it as an improvement if because a cop car drove by 2 or 3 time a day robbery on the block they live in went from 10 a year to 5 but that would have nothing to do with if having a Cop standing full time on the street corner would be an effective way to reduce the crime rate even more.",
        "intTime": 20090520,
        "postID": 2,
        "quote": "Originally posted by RRR52: ++http://www.foxnews.com/politics/2009/05/20/report-shows-air-quality-improved-during-bush-administration/++ Air quality improved during the past 10 years--more quickly under Bush than under Clinton. Obviously, significant progress does not really require the Cap and Tax crap set up to line the pockets of the global warming hypocrites. The typical American family does not need a multi-thousand dollar increase in their effective annual taxes to assuage the consciences of those who worship Mother Earth or wish to sucker fools.",
        "reply": " Improvement under laws passed during both Repub and Demo admins prior to the Bush admin is a completely separate issue from if Cap and Trade is the best or even a good way to get MORE improvement. For example most people would see it as an improvement if because a cop car drove by 2 or 3 time a day robbery on the block they live in went from 10 a year to 5 but that would have nothing to do with if having a Cop standing full time on the street corner would be an effective way to reduce the crime rate even more.",
        "threadID": "672198221_8560057322001",
        "time": "2009-05-20 12:09:00",
        "title": "Air Quality Improves Much; Environut Control-Freak \"Cap and Tax\" Seems Extraneous",
        "userID": "rayld2"
    }
]