[
    {
        "content": "I just stumpled over this news article regarding a new US Goverment pilot project. According to this news article you can now join the army and become a US citizen in 6 months. Join the army and become a US citizen in 6 months", 
        "intTime": 20090318, 
        "postID": 5, 
        "quote": "", 
        "reply": "I just stumpled over this news article regarding a new US Goverment pilot project. According to this news article you can now join the army and become a US citizen in 6 months. Join the army and become a US citizen in 6 months", 
        "threadID": "672198221_7560091512001", 
        "time": "2009-03-18 07:14:00", 
        "title": "US military now willing to recruit non-greencard foreigners for linguist/medic. jobs", 
        "userID": "DVLottery"
    }, 
    {
        "content": "Just to note: The DADT policy has caused the loss of a disproportionate number of linguists. Removal of the DADT policy would help keep qualified AMERICAN troops on duty in vital roles. Additionally, just from what I've seen, and the people I know, a lot of the gay personnel serving right now are in the medical field - both officer and enlisted. Medics, nurses, and doctors. So, while that hasn't been as big of a news story as the linguists who are being fired, I'll bet it's a factor. I just find it amusing that the jobs that they're specifically recruiting NON-AMERICANS to fill are the jobs from which the DADT policy is discharging personnel.", 
        "intTime": 20090318, 
        "postID": 6, 
        "quote": "", 
        "reply": "Just to note: The DADT policy has caused the loss of a disproportionate number of linguists. Removal of the DADT policy would help keep qualified AMERICAN troops on duty in vital roles. Additionally, just from what I've seen, and the people I know, a lot of the gay personnel serving right now are in the medical field - both officer and enlisted. Medics, nurses, and doctors. So, while that hasn't been as big of a news story as the linguists who are being fired, I'll bet it's a factor. I just find it amusing that the jobs that they're specifically recruiting NON-AMERICANS to fill are the jobs from which the DADT policy is discharging personnel.", 
        "threadID": "672198221_7560091512001", 
        "time": "2009-03-18 07:34:00", 
        "title": "US military now willing to recruit non-greencard foreigners for linguist/medic. jobs", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Does anybody know when applying proccess start?", 
        "intTime": 20090318, 
        "postID": 7, 
        "quote": "", 
        "reply": "Does anybody know when applying proccess start?", 
        "threadID": "672198221_7560091512001", 
        "time": "2009-03-18 10:24:00", 
        "title": "US military now willing to recruit non-greencard foreigners for linguist/medic. jobs", 
        "userID": "Archer12078"
    }, 
    {
        "content": "quote: Originally posted by Archer12078: Do anybody know when applying proccess start? Medics and linguists need to know basic spelling and grammar. Start there. This message has been edited. Last edited by: Whirled_Peas, Wed 18 March 2009 10:50 AM", 
        "intTime": 20090318, 
        "postID": 8, 
        "quote": "Originally posted by Archer12078: Do anybody know when applying proccess start?", 
        "reply": " Medics and linguists need to know basic spelling and grammar. Start there. This message has been edited. Last edited by: Whirled_Peas, Wed 18 March 2009 10:50 AM", 
        "threadID": "672198221_7560091512001", 
        "time": "2009-03-18 10:28:00", 
        "title": "US military now willing to recruit non-greencard foreigners for linguist/medic. jobs", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by Archer12078: Do anybody know when applying proccess start? Medics and linguists need to know how basic spelling and grammar works. Start there. LoL, there ya go. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090318, 
        "postID": 9, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by Archer12078: Do anybody know when applying proccess start? Medics and linguists need to know how basic spelling and grammar works. Start there.", 
        "reply": " LoL, there ya go. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7560091512001", 
        "time": "2009-03-18 10:34:00", 
        "title": "US military now willing to recruit non-greencard foreigners for linguist/medic. jobs", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Whirled_Peas: quote: Originally posted by Archer12078: Do anybody know when applying proccess start? Medics and linguists need to know how basic spelling and grammar works. Start there. LoL, there ya go. *whoops* That's what I get for starting to type one sentence, getting a phone call halfway through, and then typing the rest when I hang up before checking it.", 
        "intTime": 20090318, 
        "postID": 10, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Whirled_Peas: quote: Originally posted by Archer12078: Do anybody know when applying proccess start? Medics and linguists need to know how basic spelling and grammar works. Start there. LoL, there ya go.", 
        "reply": " *whoops* That's what I get for starting to type one sentence, getting a phone call halfway through, and then typing the rest when I hang up before checking it.", 
        "threadID": "672198221_7560091512001", 
        "time": "2009-03-18 10:52:00", 
        "title": "US military now willing to recruit non-greencard foreigners for linguist/medic. jobs", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "Sorry, you are right. I just didn't pay attention.", 
        "intTime": 20090318, 
        "postID": 11, 
        "quote": "", 
        "reply": "Sorry, you are right. I just didn't pay attention.", 
        "threadID": "672198221_7560091512001", 
        "time": "2009-03-18 10:54:00", 
        "title": "US military now willing to recruit non-greencard foreigners for linguist/medic. jobs", 
        "userID": "Archer12078"
    }, 
    {
        "content": "Uhh they already do that", 
        "intTime": 20090318, 
        "postID": 12, 
        "quote": "", 
        "reply": "Uhh they already do that", 
        "threadID": "672198221_7560091512001", 
        "time": "2009-03-18 14:23:00", 
        "title": "US military now willing to recruit non-greencard foreigners for linguist/medic. jobs", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "If we would just let Japan or China buy our country and run it we wouldn't have to worry all the time about these things.", 
        "intTime": 20090318, 
        "postID": 13, 
        "quote": "", 
        "reply": "If we would just let Japan or China buy our country and run it we wouldn't have to worry all the time about these things.", 
        "threadID": "672198221_7560091512001", 
        "time": "2009-03-18 14:47:00", 
        "title": "US military now willing to recruit non-greencard foreigners for linguist/medic. jobs", 
        "userID": "Duster6"
    }, 
    {
        "content": "Look, you can train all the U.S. soldiers you want in languages, we won't be as good as native linguists in the short amount of time they had to train us. (Really, they need to recruit kids aged 12 to 14 into language schools with the understanding they would work for \"unspecified government agencies,\" and give those who enlist 100% tuition for all remaining education, and maybe 50% for those students who volunteer for other agencies, or something.) And there really aren't enough medical specialists, especially NURSES in the entire country. The CIVILIAN sector relies on visa hires to man hospitals. And we are are in direct competition with the civilian sector. If folks are willing to serve in the military, they deserve the first chance at citizenship, as they've already done more than 98% of actual citizens have done for this country.", 
        "intTime": 20090318, 
        "postID": 14, 
        "quote": "", 
        "reply": "Look, you can train all the U.S. soldiers you want in languages, we won't be as good as native linguists in the short amount of time they had to train us. (Really, they need to recruit kids aged 12 to 14 into language schools with the understanding they would work for \"unspecified government agencies,\" and give those who enlist 100% tuition for all remaining education, and maybe 50% for those students who volunteer for other agencies, or something.) And there really aren't enough medical specialists, especially NURSES in the entire country. The CIVILIAN sector relies on visa hires to man hospitals. And we are are in direct competition with the civilian sector. If folks are willing to serve in the military, they deserve the first chance at citizenship, as they've already done more than 98% of actual citizens have done for this country.", 
        "threadID": "672198221_7560091512001", 
        "time": "2009-03-18 15:17:00", 
        "title": "US military now willing to recruit non-greencard foreigners for linguist/medic. jobs", 
        "userID": "Ruanne"
    }, 
    {
        "content": "The MAVNI pilot program already started back on 02/23/09 to those that have submitted their interest and basic information through www.goarmy.com (To find the form, type in \"MAVNI\" in the search area). The first step would be to register via the goarmy web page. Once the form is submitted, the webpage will provide you with telephone numbers that you may call to ask questions. They \"may\" then also call you back for a telephone interview (My understanding is that this is some sort of a pre-screening). Another method would be to directly call and discuss the program with an Army Recruiter in NYC. Note: Eventually you may end up traveling to NYC (possibly several times)at your own expense to get through all the \"special\" interviews and testing, etc. for this program. That is even before your visit(s)to the MEPS in NYC for the ASVAB & Medical exams and more interviews, etc. As far as I know, only the Army has started the recruiting for this program. Initially the recruitment of the \"language\" specialists will be limited to those in New York City, and then \"possibly\" expanded to the rest of the country later this year. As it stated in the DOD announcement about the MAVNI program back in December, the \"Non-immigrant\" visa holder must have been present in the US for at least the past 2 years (with no departures out of the country of greater than 90 days). They do check with the Department of Homeland Security/Immigration to verify your legal status here and how long you have been in the US before any further processing/testing takes place. From what I understand, for this program, there are also \"additional\" exams that be passed in both the foreign language you claim you know as well as an english language exam. Low scores in any and you are disqualified. Then there are then the \"regular\" interviews, medical exams, background checks, finger printing that all \"potential\" enlistees go thru. Based on not being a US Citizen (yet), and that it is then likely than your parents are not either, it is very unlikely that you would be allowed into a MOS's that requires a security clearance, so your choices of MOS's will be somewhat limited. Be aware that if you get through the interviews and background checks for further consideration, that when you later take the ASVAB, you will need to score a minimum of 50 to remain eligible (No waivers). In addition to all the above: Although you may be granted some form of \"conditional\" US Citizenship within the first 6-12 months on active duty, if you then fail to complete your mandatory 4 years on active duty in a acceptable manner, followed by additional years in the Reserves/IRR, that in all probability, the conditional citizenship will be revoked if you leave the military early or in less than a Honorable discharge. FYI: Don't bother applying if you don't meet ALL the basic requirements for the program as outlined in the MAVNI announcement....there are no waivers. In response to \"Ruanne\": I believe I read a quote somewhere from a high ranking military officer saying that the military services has found it easier to take an immigrant, or a potential one(who already fluently knows the foreign language and culture), and train him/her into a quality US Soldier, than it is to take a soldier and train him/her to be fluent in many of the specific foreign languages and cultures that they are looking for. (That is not a exact quote as I cannot currently find that article that I was reading, but it's out there somewhere on the internet). NOTE: I certainly mean absolutely no disrespect to the many fine Americans who have put forth the effort to become fluent in a foreign language and have served, or are currently serving, in the US Military!", 
        "intTime": 20090318, 
        "postID": 15, 
        "quote": "", 
        "reply": "The MAVNI pilot program already started back on 02/23/09 to those that have submitted their interest and basic information through www.goarmy.com (To find the form, type in \"MAVNI\" in the search area). The first step would be to register via the goarmy web page. Once the form is submitted, the webpage will provide you with telephone numbers that you may call to ask questions. They \"may\" then also call you back for a telephone interview (My understanding is that this is some sort of a pre-screening). Another method would be to directly call and discuss the program with an Army Recruiter in NYC. Note: Eventually you may end up traveling to NYC (possibly several times)at your own expense to get through all the \"special\" interviews and testing, etc. for this program. That is even before your visit(s)to the MEPS in NYC for the ASVAB & Medical exams and more interviews, etc. As far as I know, only the Army has started the recruiting for this program. Initially the recruitment of the \"language\" specialists will be limited to those in New York City, and then \"possibly\" expanded to the rest of the country later this year. As it stated in the DOD announcement about the MAVNI program back in December, the \"Non-immigrant\" visa holder must have been present in the US for at least the past 2 years (with no departures out of the country of greater than 90 days). They do check with the Department of Homeland Security/Immigration to verify your legal status here and how long you have been in the US before any further processing/testing takes place. From what I understand, for this program, there are also \"additional\" exams that be passed in both the foreign language you claim you know as well as an english language exam. Low scores in any and you are disqualified. Then there are then the \"regular\" interviews, medical exams, background checks, finger printing that all \"potential\" enlistees go thru. Based on not being a US Citizen (yet), and that it is then likely than your parents are not either, it is very unlikely that you would be allowed into a MOS's that requires a security clearance, so your choices of MOS's will be somewhat limited. Be aware that if you get through the interviews and background checks for further consideration, that when you later take the ASVAB, you will need to score a minimum of 50 to remain eligible (No waivers). In addition to all the above: Although you may be granted some form of \"conditional\" US Citizenship within the first 6-12 months on active duty, if you then fail to complete your mandatory 4 years on active duty in a acceptable manner, followed by additional years in the Reserves/IRR, that in all probability, the conditional citizenship will be revoked if you leave the military early or in less than a Honorable discharge. FYI: Don't bother applying if you don't meet ALL the basic requirements for the program as outlined in the MAVNI announcement....there are no waivers. In response to \"Ruanne\": I believe I read a quote somewhere from a high ranking military officer saying that the military services has found it easier to take an immigrant, or a potential one(who already fluently knows the foreign language and culture), and train him/her into a quality US Soldier, than it is to take a soldier and train him/her to be fluent in many of the specific foreign languages and cultures that they are looking for. (That is not a exact quote as I cannot currently find that article that I was reading, but it's out there somewhere on the internet). NOTE: I certainly mean absolutely no disrespect to the many fine Americans who have put forth the effort to become fluent in a foreign language and have served, or are currently serving, in the US Military!", 
        "threadID": "672198221_7560091512001", 
        "time": "2009-03-18 17:02:00", 
        "title": "US military now willing to recruit non-greencard foreigners for linguist/medic. jobs", 
        "userID": "rlhyatt"
    }, 
    {
        "content": "It's true, you can make any reasonably fit and willing person into a decent, or even good soldier. It's extra bonus if your recruit is a native speaker of Arabic or Pashtu or Urdu. It's a lot harder to turn a non-native speaker into a fluent linguist AND soldier. There's the issue of aptitude, only a certain percentage of volunteers meet the enlistment requirements AND demonstrate high aptitude on the language aptitude battery. The next hurdle is training time, for original qualification and then for maintenance. Arabic and Korean courses are typically 18 months long. Not every student passes this course in the first place. Then, a soldier reports to his or her unit, whose major role is combat deployments. The need for language maintenance can get lost among the need for everyone to qualify on weapons, medical training, keep all equipment and vehicles maintained, etc. It's a constant struggle to find time for regular language maintenance in the schedule. Highly motivated soldiers, and soldiers in units who make language quals a priority, can achieve and maintain fluency. Everyone else tends to lose skill in their language over time. Take it from me, I can't currently string together a coherent sentence in Arabic. I still understand it, but I really need to work on speaking and reading. Since I'm currently unemployed, so I can take some time now. I'm hoping my new Guard unit can me a Refresher Course slot.", 
        "intTime": 20090319, 
        "postID": 16, 
        "quote": "", 
        "reply": "It's true, you can make any reasonably fit and willing person into a decent, or even good soldier. It's extra bonus if your recruit is a native speaker of Arabic or Pashtu or Urdu. It's a lot harder to turn a non-native speaker into a fluent linguist AND soldier. There's the issue of aptitude, only a certain percentage of volunteers meet the enlistment requirements AND demonstrate high aptitude on the language aptitude battery. The next hurdle is training time, for original qualification and then for maintenance. Arabic and Korean courses are typically 18 months long. Not every student passes this course in the first place. Then, a soldier reports to his or her unit, whose major role is combat deployments. The need for language maintenance can get lost among the need for everyone to qualify on weapons, medical training, keep all equipment and vehicles maintained, etc. It's a constant struggle to find time for regular language maintenance in the schedule. Highly motivated soldiers, and soldiers in units who make language quals a priority, can achieve and maintain fluency. Everyone else tends to lose skill in their language over time. Take it from me, I can't currently string together a coherent sentence in Arabic. I still understand it, but I really need to work on speaking and reading. Since I'm currently unemployed, so I can take some time now. I'm hoping my new Guard unit can me a Refresher Course slot.", 
        "threadID": "672198221_7560091512001", 
        "time": "2009-03-19 06:59:00", 
        "title": "US military now willing to recruit non-greencard foreigners for linguist/medic. jobs", 
        "userID": "Ruanne"
    }, 
    {
        "content": "quote: Originally posted by helez: Many good men have be recruited not just for the military service, but as AMERICAN CITIZENS by enlisting for citizenship. Agood policy. Why would they risk anything to be US citizens, all they have to do is keep sneaking across the border and wait on the next SHAMNESTY while getting free medical and social services???? They don't come here to be AMERICANS anymore, they just want all the free stuff. Why should they bleed when they know we will, and they can sit back and enjoy all the benifits.", 
        "intTime": 20090319, 
        "postID": 17, 
        "quote": "Originally posted by helez: Many good men have be recruited not just for the military service, but as AMERICAN CITIZENS by enlisting for citizenship. Agood policy.", 
        "reply": " Why would they risk anything to be US citizens, all they have to do is keep sneaking across the border and wait on the next SHAMNESTY while getting free medical and social services???? They don't come here to be AMERICANS anymore, they just want all the free stuff. Why should they bleed when they know we will, and they can sit back and enjoy all the benifits.", 
        "threadID": "672198221_7560091512001", 
        "time": "2009-03-19 07:07:00", 
        "title": "US military now willing to recruit non-greencard foreigners for linguist/medic. jobs", 
        "userID": "carsleyt"
    }, 
    {
        "content": "quote: Originally posted by carsleyt: quote: Originally posted by helez: Many good men have be recruited not just for the military service, but as AMERICAN CITIZENS by enlisting for citizenship. Agood policy. Why would they risk anything to be US citizens, all they have to do is keep sneaking across the border and wait on the next SHAMNESTY while getting free medical and social services???? They don't come here to be AMERICANS anymore, they just want all the free stuff. Why should they bleed when they know we will, and they can sit back and enjoy all the benifits. Because believe it or not, plenty of non-Americans have a sense of honor. More than most Americans actually (I'm obviously not counting military servicemembers, we still understand the concept.) For every illegal immigrant in the U.S. there are many more who are in this country legally and temporarily (student visas, tourist visas, business visas) and many MANY more who can only look longingly at our borders, knowing that their chances of getting a Green Card are next to nothing. It costs hundreds of dollars, a lot on a third world income, and even then, only a tiny number are permitted to become permanent legal residents. Believe you me, there will be a fair number of non-citizens stepping forward for this chance to become Americans. It kind of makes you think...", 
        "intTime": 20090319, 
        "postID": 18, 
        "quote": "Originally posted by carsleyt: quote: Originally posted by helez: Many good men have be recruited not just for the military service, but as AMERICAN CITIZENS by enlisting for citizenship. Agood policy. Why would they risk anything to be US citizens, all they have to do is keep sneaking across the border and wait on the next SHAMNESTY while getting free medical and social services???? They don't come here to be AMERICANS anymore, they just want all the free stuff. Why should they bleed when they know we will, and they can sit back and enjoy all the benifits.", 
        "reply": " Because believe it or not, plenty of non-Americans have a sense of honor. More than most Americans actually (I'm obviously not counting military servicemembers, we still understand the concept.) For every illegal immigrant in the U.S. there are many more who are in this country legally and temporarily (student visas, tourist visas, business visas) and many MANY more who can only look longingly at our borders, knowing that their chances of getting a Green Card are next to nothing. It costs hundreds of dollars, a lot on a third world income, and even then, only a tiny number are permitted to become permanent legal residents. Believe you me, there will be a fair number of non-citizens stepping forward for this chance to become Americans. It kind of makes you think...", 
        "threadID": "672198221_7560091512001", 
        "time": "2009-03-19 08:36:00", 
        "title": "US military now willing to recruit non-greencard foreigners for linguist/medic. jobs", 
        "userID": "Ruanne"
    }, 
    {
        "content": "A few points to be made: To quote the DOD: Non-citizens have served in the military since the Revolutionary War. Today, about 29,000 non-citizens serve in uniform, and about 8,000 legal permanent resident aliens (green card holders) enlist each year. According to data from the Department of Defense, more than 65,000 immigrants (non-US citizens and naturalized citizens) were serving on active duty in the US Armed Forces as of February 2008. Since September 2001, US Citizenship and Immigration Services (USCIS) has naturalized more than 37,250 foreign-born members of the US Armed Forces and granted posthumous citizenship to 111 service members. <-- It certainly doesn't sound like these men and women were \"sneaking across the border and waiting on the free medical and social services\" or that \"they don't come here to be AMERICANS anymore, they just want all the free stuff\". The ONLY non-citizens/non-immigrant visa holders that are even considered for the MAVNI Program are those that have been here in the United States LEGALLY for 2 or more years with proper Visas issued by the US Government. Those trying to enlist through the MAVNI program are being throughly screened by both the Military and the Department of Homeland Security. Any applicants that have fallen \"out-of-status\" with their Visa or even overstayed their permitted stay in the US by 1 day are disqualified. Furthermore, no one with a criminal record is eligible under the MAVNI program and they are not permitted to apply for the “conduct waivers” that are sometimes available to US citizens. <-- I agree with the DOD, why not recruit the best of those legal non-immigrants with the background, talents and skills that the US Military has a need for, and that the DOD has determined to be \"Vital to National Interests\". I also suggest that a few people here also need to keep in mind that unless you are pure Native American (American Indian), it is very likely that your ancestors also immigrated to this country at some point in time. The vast majority of immigrants that I have met, and have worked along side with over the years, are hard working and are not here seeking anything free, just an opportunity to work for a better future. Most, just like our ancestors, came here to work hard to simply try to provide a better life for themselves and their family. <-- No, I do not support illegal immigration, but I do support those legal immigrants/non-immigrants here having every opportunity to become US Citizens. If they are willing to join and honorably serve in the US military, and possibly give their life while in the service of this country, I say by all means, grant them US Citizenship.", 
        "intTime": 20090319, 
        "postID": 19, 
        "quote": "", 
        "reply": "A few points to be made: To quote the DOD: Non-citizens have served in the military since the Revolutionary War. Today, about 29,000 non-citizens serve in uniform, and about 8,000 legal permanent resident aliens (green card holders) enlist each year. According to data from the Department of Defense, more than 65,000 immigrants (non-US citizens and naturalized citizens) were serving on active duty in the US Armed Forces as of February 2008. Since September 2001, US Citizenship and Immigration Services (USCIS) has naturalized more than 37,250 foreign-born members of the US Armed Forces and granted posthumous citizenship to 111 service members. <-- It certainly doesn't sound like these men and women were \"sneaking across the border and waiting on the free medical and social services\" or that \"they don't come here to be AMERICANS anymore, they just want all the free stuff\". The ONLY non-citizens/non-immigrant visa holders that are even considered for the MAVNI Program are those that have been here in the United States LEGALLY for 2 or more years with proper Visas issued by the US Government. Those trying to enlist through the MAVNI program are being throughly screened by both the Military and the Department of Homeland Security. Any applicants that have fallen \"out-of-status\" with their Visa or even overstayed their permitted stay in the US by 1 day are disqualified. Furthermore, no one with a criminal record is eligible under the MAVNI program and they are not permitted to apply for the “conduct waivers” that are sometimes available to US citizens. <-- I agree with the DOD, why not recruit the best of those legal non-immigrants with the background, talents and skills that the US Military has a need for, and that the DOD has determined to be \"Vital to National Interests\". I also suggest that a few people here also need to keep in mind that unless you are pure Native American (American Indian), it is very likely that your ancestors also immigrated to this country at some point in time. The vast majority of immigrants that I have met, and have worked along side with over the years, are hard working and are not here seeking anything free, just an opportunity to work for a better future. Most, just like our ancestors, came here to work hard to simply try to provide a better life for themselves and their family. <-- No, I do not support illegal immigration, but I do support those legal immigrants/non-immigrants here having every opportunity to become US Citizens. If they are willing to join and honorably serve in the US military, and possibly give their life while in the service of this country, I say by all means, grant them US Citizenship.", 
        "threadID": "672198221_7560091512001", 
        "time": "2009-03-19 16:59:00", 
        "title": "US military now willing to recruit non-greencard foreigners for linguist/medic. jobs", 
        "userID": "rlhyatt"
    }
]