[
    {
        "content": "quote: Battered by recriminations over waterboarding and other harsh techniques sanctioned by the Bush administration, the CIA is girding itself for more public scrutiny and is questioning whether agency personnel can conduct interrogations effectively under rules set out for the U.S. military, according to senior intelligence officials. Harsh interrogations were only one part of its clandestine activities against Al Qaeda and other enemies, and agency members are worried that other operations in Afghanistan and Pakistan will come under review, the officials said. The agency’s defensiveness in part reflects a conviction that it is being forced to take the blame for actions approved by elected officials that have since fallen into disfavor. (Washington Post, May 19, 2009, Pg. 3) \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090520, 
        "postID": 1, 
        "quote": "Battered by recriminations over waterboarding and other harsh techniques sanctioned by the Bush administration, the CIA is girding itself for more public scrutiny and is questioning whether agency personnel can conduct interrogations effectively under rules set out for the U.S. military, according to senior intelligence officials. Harsh interrogations were only one part of its clandestine activities against Al Qaeda and other enemies, and agency members are worried that other operations in Afghanistan and Pakistan will come under review, the officials said. The agency’s defensiveness in part reflects a conviction that it is being forced to take the blame for actions approved by elected officials that have since fallen into disfavor. (Washington Post, May 19, 2009, Pg. 3)", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2390027322001", 
        "time": "2009-05-20 05:59:00", 
        "title": "Amid Queries, CIA Worries About Future", 
        "userID": "NSNN"
    }
]