[
    {
        "content": "From the article: ++http://www.washingtonpost.com/wp-dyn/content/article/2009/02/12/AR2009021203504.html quote: Originally posted in the Article(Page 1): BAGHDAD, Feb. 13 -- Iraqi interpreters working with the U.S. military in Baghdad are again allowed to hide their identity during certain missions, after a Pentagon decision to grant battalion commanders the discretion to disregard an earlier policy banning interpreters from wearing masks. Adm. Michael Mullen, the chairman of the Joint Chiefs of Staff, disclosed the reversal last month in a letter to Sen. Ron Wyden (D-Ore.). But several interpreters and American soldiers in Baghdad said they were unaware that battalion commanders can waive the mask ban for \"high-risk\" missions. \"It's clear that the situation in Iraq is so fluid that it would be nearly impossible to make that kind of judgment with certainty,\" Wyden said in a statement, referring to the flexibility the new policy gives commanders. \"That's a big chance to take with the lives of people who are risking their lives to help our troops and our country.\" After the military instituted the mask ban in September, some officers said the new policy reflected an overly optimistic assessment of the security situation. Violence in Iraq has dropped markedly in recent months, but bombings and assassinations continue to occur daily. On Thursday, five people were killed in an explosion near a revered mosque in Karbala, south of Baghdad. Battalion commanders, who oversee between 500 and 800 soldiers, cannot delegate the lifting of the ban to junior officers. Wyden, as well as soldiers and interpreters, said they remain concerned that any restrictions preventing interpreters from shielding their identities put them at risk. Some American soldiers, who often refer to interpreters as \"terps,\" say they enforce the ban laxly or not at all. \"Telling a terp that his country is safe when he doesn't feel it's safe is as pretentious as it gets,\" said an Army captain in Baghdad, who spoke on the condition of anonymity because he was criticizing his superiors. \"The terp-mask thing is just the latest disconnect between what happens on the ground and what people want to be happening on the ground. We're in full-on dress rehearsal now. I think we're in such a hurry to get out of here, we're wanting this place to be safer than it really is.\" Kirk Johnson, the director of the List Project to Resettle Iraqi Allies, an organization that helps Iraqis who worked for the U.S. government, said the new policy does not protect interpreters. \"If you're an Iraqi interpreter working alongside our soldiers, there's no such thing as a high-risk mission,\" he said. \"Every mission is high risk. I don't comprehend how people who are not on the front lines are pushing a policy that doesn't seem to resonate with anyone who is indeed on the front lines.\" In a Jan. 7 letter to Wyden, Mullen said the mask ban was put in place in an effort to foster trust between American soldiers and Iraqis in Baghdad. \"Given the improved security environment, concealment of identities engenders a perception of mistrust among some elements of the population,\" Mullen wrote. Mullen added that the military is not aware of recent incidents in which interpreters were targeted after their identities became known. More than 300 interpreters working with U.S. troops have been killed since 2003, and some have been tortured by extremists who see them as traitors. What a load of crap. Want to hide your face? Good, we don't need you. There are plenty of well qualified interpreters that aren't afraid of people seeing them. Oh, and as far as the ones that do wear masks, EVERYONE STILL KNOWS WHAT THEY DO because Iraqis can't keep their mouths shut about anything and tell their whole family and everyone that wants to hear it that they work for the Americans.",
        "intTime": 20090512,
        "postID": 1,
        "quote": "Originally posted in the Article(Page 1): BAGHDAD, Feb. 13 -- Iraqi interpreters working with the U.S. military in Baghdad are again allowed to hide their identity during certain missions, after a Pentagon decision to grant battalion commanders the discretion to disregard an earlier policy banning interpreters from wearing masks. Adm. Michael Mullen, the chairman of the Joint Chiefs of Staff, disclosed the reversal last month in a letter to Sen. Ron Wyden (D-Ore.). But several interpreters and American soldiers in Baghdad said they were unaware that battalion commanders can waive the mask ban for \"high-risk\" missions. \"It's clear that the situation in Iraq is so fluid that it would be nearly impossible to make that kind of judgment with certainty,\" Wyden said in a statement, referring to the flexibility the new policy gives commanders. \"That's a big chance to take with the lives of people who are risking their lives to help our troops and our country.\" After the military instituted the mask ban in September, some officers said the new policy reflected an overly optimistic assessment of the security situation. Violence in Iraq has dropped markedly in recent months, but bombings and assassinations continue to occur daily. On Thursday, five people were killed in an explosion near a revered mosque in Karbala, south of Baghdad. Battalion commanders, who oversee between 500 and 800 soldiers, cannot delegate the lifting of the ban to junior officers. Wyden, as well as soldiers and interpreters, said they remain concerned that any restrictions preventing interpreters from shielding their identities put them at risk. Some American soldiers, who often refer to interpreters as \"terps,\" say they enforce the ban laxly or not at all. \"Telling a terp that his country is safe when he doesn't feel it's safe is as pretentious as it gets,\" said an Army captain in Baghdad, who spoke on the condition of anonymity because he was criticizing his superiors. \"The terp-mask thing is just the latest disconnect between what happens on the ground and what people want to be happening on the ground. We're in full-on dress rehearsal now. I think we're in such a hurry to get out of here, we're wanting this place to be safer than it really is.\" Kirk Johnson, the director of the List Project to Resettle Iraqi Allies, an organization that helps Iraqis who worked for the U.S. government, said the new policy does not protect interpreters. \"If you're an Iraqi interpreter working alongside our soldiers, there's no such thing as a high-risk mission,\" he said. \"Every mission is high risk. I don't comprehend how people who are not on the front lines are pushing a policy that doesn't seem to resonate with anyone who is indeed on the front lines.\" In a Jan. 7 letter to Wyden, Mullen said the mask ban was put in place in an effort to foster trust between American soldiers and Iraqis in Baghdad. \"Given the improved security environment, concealment of identities engenders a perception of mistrust among some elements of the population,\" Mullen wrote. Mullen added that the military is not aware of recent incidents in which interpreters were targeted after their identities became known. More than 300 interpreters working with U.S. troops have been killed since 2003, and some have been tortured by extremists who see them as traitors.",
        "reply": "From the article: ++http://www.washingtonpost.com/wp-dyn/content/article/2009/02/12/AR2009021203504.html  What a load of crap. Want to hide your face? Good, we don't need you. There are plenty of well qualified interpreters that aren't afraid of people seeing them. Oh, and as far as the ones that do wear masks, EVERYONE STILL KNOWS WHAT THEY DO because Iraqis can't keep their mouths shut about anything and tell their whole family and everyone that wants to hear it that they work for the Americans.",
        "threadID": "672198221_9840011322001",
        "time": "2009-05-12 07:45:00",
        "title": "Pentagon Backtracks on Iraqi Interpreter Mask Policy",
        "userID": "mrmixitup"
    }
]