[
    {
        "content": "Note to insurgents: hit the treadmill. The Marines are about to get a few steps quicker. Reacting to injuries caused by over weighted body armor and security improvements in some combat zones, the Marine Corps is adjusting the way it equips Leathernecks in the field with personal protective equipment. The service is shifting the decision making down the chain of command and instituting a graduated armor scale in the coming weeks for the promise of a lighter load to reduce injuries and hopefully quicken the feet of Marines in the field. The first move, effective immediately, will push control to lieutenant colonels in deciding what amount of personal protective equipment Marines will wear for a given mission. \"Recognizing that body armor is modular and scalable, [we'll] try and leverage that by empowering our commanders … to make the appropriate decision with regards to what composition of body armor their Marines will wear,\" said Maj. Tom Wood, infantry advocate for the plans, policies and operations branch of Marine Corps headquarters in Washington. More here: http://www.military.com/news/article/April-2009/corps-t...ml?col=1186032366495 \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090423, 
        "postID": 1, 
        "quote": "", 
        "reply": "Note to insurgents: hit the treadmill. The Marines are about to get a few steps quicker. Reacting to injuries caused by over weighted body armor and security improvements in some combat zones, the Marine Corps is adjusting the way it equips Leathernecks in the field with personal protective equipment. The service is shifting the decision making down the chain of command and instituting a graduated armor scale in the coming weeks for the promise of a lighter load to reduce injuries and hopefully quicken the feet of Marines in the field. The first move, effective immediately, will push control to lieutenant colonels in deciding what amount of personal protective equipment Marines will wear for a given mission. \"Recognizing that body armor is modular and scalable, [we'll] try and leverage that by empowering our commanders … to make the appropriate decision with regards to what composition of body armor their Marines will wear,\" said Maj. Tom Wood, infantry advocate for the plans, policies and operations branch of Marine Corps headquarters in Washington. More here: http://www.military.com/news/article/April-2009/corps-t...ml?col=1186032366495 \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3890045122001", 
        "time": "2009-04-23 10:42:00", 
        "title": "Corps to Reduce Armor for Deployed Troops", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Having spent many hours in the various body armors from Bosnia to Iraq (and just about everything in between), I can tell you that the current model seriously restricts movement. It may be the best armor money can buy, but people who can't move can't fight effectively. I'm glad the Marines are taking action and with any luck, the Army will follow suit.", 
        "intTime": 20090423, 
        "postID": 2, 
        "quote": "", 
        "reply": "Having spent many hours in the various body armors from Bosnia to Iraq (and just about everything in between), I can tell you that the current model seriously restricts movement. It may be the best armor money can buy, but people who can't move can't fight effectively. I'm glad the Marines are taking action and with any luck, the Army will follow suit.", 
        "threadID": "672198221_3890045122001", 
        "time": "2009-04-23 10:58:00", 
        "title": "Corps to Reduce Armor for Deployed Troops", 
        "userID": "AKinNC"
    }, 
    {
        "content": "quote: Originally posted by AKinNC: Having spent many hours in the various body armors from Bosnia to Iraq (and just about everything in between), I can tell you that the current model seriously restricts movement. It may be the best armor money can buy, but people who can't move can't fight effectively. I'm glad the Marines are taking action and with any luck, the Army will follow suit. That ain't no joke. That sheit was heavy. It will be good to be lighter and faster. Maybe we won't get stuck in places either. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090423, 
        "postID": 3, 
        "quote": "Originally posted by AKinNC: Having spent many hours in the various body armors from Bosnia to Iraq (and just about everything in between), I can tell you that the current model seriously restricts movement. It may be the best armor money can buy, but people who can't move can't fight effectively. I'm glad the Marines are taking action and with any luck, the Army will follow suit.", 
        "reply": " That ain't no joke. That sheit was heavy. It will be good to be lighter and faster. Maybe we won't get stuck in places either. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3890045122001", 
        "time": "2009-04-23 11:50:00", 
        "title": "Corps to Reduce Armor for Deployed Troops", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Speaking of getting stuck, if the Army would just get rid of the Velcro ...", 
        "intTime": 20090423, 
        "postID": 4, 
        "quote": "", 
        "reply": "Speaking of getting stuck, if the Army would just get rid of the Velcro ...", 
        "threadID": "672198221_3890045122001", 
        "time": "2009-04-23 12:34:00", 
        "title": "Corps to Reduce Armor for Deployed Troops", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by AKinNC: Having spent many hours in the various body armors from Bosnia to Iraq (and just about everything in between), I can tell you that the current model seriously restricts movement. It may be the best armor money can buy, but people who can't move can't fight effectively. I'm glad the Marines are taking action and with any luck, the Army will follow suit. That ain't no joke. That sheit was heavy. It will be good to be lighter and faster. Maybe we won't get stuck in places either. It rubbed the back of my arm often, was glad to have it, but still got sore a couple of times. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090423, 
        "postID": 5, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by AKinNC: Having spent many hours in the various body armors from Bosnia to Iraq (and just about everything in between), I can tell you that the current model seriously restricts movement. It may be the best armor money can buy, but people who can't move can't fight effectively. I'm glad the Marines are taking action and with any luck, the Army will follow suit. That ain't no joke. That sheit was heavy. It will be good to be lighter and faster. Maybe we won't get stuck in places either.", 
        "reply": " It rubbed the back of my arm often, was glad to have it, but still got sore a couple of times. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3890045122001", 
        "time": "2009-04-23 12:57:00", 
        "title": "Corps to Reduce Armor for Deployed Troops", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: Speaking of getting stuck, if the Army would just get rid of the Velcro ... Won't happen, everything has to be soldier proof in the army, you should know that. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090423, 
        "postID": 6, 
        "quote": "Originally posted by Cider33_Alpha: Speaking of getting stuck, if the Army would just get rid of the Velcro ...", 
        "reply": " Won't happen, everything has to be soldier proof in the army, you should know that. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3890045122001", 
        "time": "2009-04-23 12:58:00", 
        "title": "Corps to Reduce Armor for Deployed Troops", 
        "userID": "L0A1"
    }, 
    {
        "content": "Wouldn`t that mean that the troops are acting on there own , decideing for themselves, thinking like a troop,rank or medic should......never gonna happen !! They`re stuck with the leash laws !!", 
        "intTime": 20090423, 
        "postID": 7, 
        "quote": "", 
        "reply": "Wouldn`t that mean that the troops are acting on there own , decideing for themselves, thinking like a troop,rank or medic should......never gonna happen !! They`re stuck with the leash laws !!", 
        "threadID": "672198221_3890045122001", 
        "time": "2009-04-23 14:55:00", 
        "title": "Corps to Reduce Armor for Deployed Troops", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "I've seen a number of reports that talk about how Taliban/AQ fighters would literally outrun our guys who were chasing them. They were wearing sneakers and carrying really light loads and we were carrying the full array of armor and other kit.", 
        "intTime": 20090423, 
        "postID": 8, 
        "quote": "", 
        "reply": "I've seen a number of reports that talk about how Taliban/AQ fighters would literally outrun our guys who were chasing them. They were wearing sneakers and carrying really light loads and we were carrying the full array of armor and other kit.", 
        "threadID": "672198221_3890045122001", 
        "time": "2009-04-23 19:29:00", 
        "title": "Corps to Reduce Armor for Deployed Troops", 
        "userID": "Motive25"
    }, 
    {
        "content": "This is a great move and one that is long overdue. The same thing happened in Vietnam, our overloaded troops floundered while the enemy danced around us.", 
        "intTime": 20090423, 
        "postID": 9, 
        "quote": "", 
        "reply": "This is a great move and one that is long overdue. The same thing happened in Vietnam, our overloaded troops floundered while the enemy danced around us.", 
        "threadID": "672198221_3890045122001", 
        "time": "2009-04-23 20:50:00", 
        "title": "Corps to Reduce Armor for Deployed Troops", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: This is a great move and one that is long overdue. The same thing happened in Vietnam, our overloaded troops floundered while the enemy danced around us. Yup. Hard to keep up with just sandals and an AK. The Vietnamese were tough.", 
        "intTime": 20090424, 
        "postID": 10, 
        "quote": "Originally posted by foxred03: This is a great move and one that is long overdue. The same thing happened in Vietnam, our overloaded troops floundered while the enemy danced around us.", 
        "reply": " Yup. Hard to keep up with just sandals and an AK. The Vietnamese were tough.", 
        "threadID": "672198221_3890045122001", 
        "time": "2009-04-24 16:58:00", 
        "title": "Corps to Reduce Armor for Deployed Troops", 
        "userID": "mrmixitup"
    }
]