[
    {
        "content": "Senate Finance Committee Chairman Max Baucus (D-Mont.) and Ranking Member Chuck Grassley (R-Iowa) have released tax policy options for financing reform of America's health care system. \"Reforming the system will likely require an upfront investment, but I’m confident it will pay dividends in the future for our health, our economic competitiveness, and our federal budget,” he said, adding: \"The bottom line is that we can’t afford not to act.\" Exclusion for Employer-Provided Health Insurance – Under current law, employer-provided health insurance is not counted as income for tax purposes and the amount of health care benefits that are counted as tax free is unlimited. This tax-free status encourages employers to offer “Cadillac plans,” or overly generous health care plans that promote the overuse of health care services and drive up healthcare costs. Moreover, the plans are subsidized by taxpayers as a result of being tax free. The policy options explore five changes to make the exclusion more equitable and efficient. These options include capping the exclusion based on the value of health insurance policy or the income level of the employee eligible for the exclusion. A third option would be to cap the exclusion based on both the value of the health insurance policy and income level. Another option would be to convert the employer-provided health insurance exclusion to an individual tax deduction or credit. The options also consider whether to grandfather in existing plans so that benefits provided under existing collective bargaining agreements are not limited. Health Savings Accounts (HSAs) – Individuals enrolled in high-deductible health insurance plans can set up Health Savings Accounts to withdraw from for qualified medical expenses without paying taxes. Likewise, contributions made to HSAs by individuals and employers are not considered income for tax purposes and earnings on HSAs accumulate tax free as the balances rollover from year to year. The policy options explore three ways to modify HSAs. The first option would restrict HSA contributions to the lesser of the individual’s deductible or the statutory limit. The second option would increase the penalty for withdrawing from an HSA for non-medical expenses from 10% to 20%. The third option would require certification from the employer or from an independent third party that HSA withdrawals were made for medical expenses. Flexible Spending Accounts (FSAs) – Similar to HSAs, FSAs allow individuals and their employers to contribute an unlimited amount of tax free income to a Flexible Spending Account. Employees can withdraw from their FSA to pay out-of-pocket medical expenses besides premiums. But unlike HSAs, FSAs do not roll over from year to year and operate on a “use-it-or-lose-it” principle. The policy options explore limiting the amount that can be contributed to an FSA or eliminating FSAs altogether. Qualified Medical Expenses – Under current law there is no standard definition for what qualifies as a medical expense for HSAs, FSAs, or itemized medical expense tax deductions. The policy option would apply a standard definition of qualified medical expenses across the board. Itemized Deduction for Medical Expenses – Under current law, a taxpayer that itemizes deductions may take a deduction for medical expenses – including insurance premiums and out of pocket medical costs – in excess of 7.5% of adjusted gross income. According to the Congressional Research Service, only 6% of all tax returns take the medical expense deduction. The policy options examine elimination the itemized deduction for medical expenses or raising the 7.5% floor for claiming deductions. The policy options also looked into reducing the 25% special deduction for certain non-profit organizations, modifying the student tax exemption, scrapping the employer payroll tax exemption for state and local government employees, and modifying the rules pertaining to non-profit hospitals. In addition, the Committee examined the possibility of creating ‘lifestyle’ taxes (perhaps better known as ‘sin taxes’) including increased taxation on alcoholic beverages and imposing excise tax on sugar-sweetened drinks. \"http://www.tax-news.com/asp/story/Senate_Explores_US_Healthcare_Reform_Tax_Options_xxxx36867.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090520,
        "postID": 1,
        "quote": "",
        "reply": "Senate Finance Committee Chairman Max Baucus (D-Mont.) and Ranking Member Chuck Grassley (R-Iowa) have released tax policy options for financing reform of America's health care system. \"Reforming the system will likely require an upfront investment, but I’m confident it will pay dividends in the future for our health, our economic competitiveness, and our federal budget,” he said, adding: \"The bottom line is that we can’t afford not to act.\" Exclusion for Employer-Provided Health Insurance – Under current law, employer-provided health insurance is not counted as income for tax purposes and the amount of health care benefits that are counted as tax free is unlimited. This tax-free status encourages employers to offer “Cadillac plans,” or overly generous health care plans that promote the overuse of health care services and drive up healthcare costs. Moreover, the plans are subsidized by taxpayers as a result of being tax free. The policy options explore five changes to make the exclusion more equitable and efficient. These options include capping the exclusion based on the value of health insurance policy or the income level of the employee eligible for the exclusion. A third option would be to cap the exclusion based on both the value of the health insurance policy and income level. Another option would be to convert the employer-provided health insurance exclusion to an individual tax deduction or credit. The options also consider whether to grandfather in existing plans so that benefits provided under existing collective bargaining agreements are not limited. Health Savings Accounts (HSAs) – Individuals enrolled in high-deductible health insurance plans can set up Health Savings Accounts to withdraw from for qualified medical expenses without paying taxes. Likewise, contributions made to HSAs by individuals and employers are not considered income for tax purposes and earnings on HSAs accumulate tax free as the balances rollover from year to year. The policy options explore three ways to modify HSAs. The first option would restrict HSA contributions to the lesser of the individual’s deductible or the statutory limit. The second option would increase the penalty for withdrawing from an HSA for non-medical expenses from 10% to 20%. The third option would require certification from the employer or from an independent third party that HSA withdrawals were made for medical expenses. Flexible Spending Accounts (FSAs) – Similar to HSAs, FSAs allow individuals and their employers to contribute an unlimited amount of tax free income to a Flexible Spending Account. Employees can withdraw from their FSA to pay out-of-pocket medical expenses besides premiums. But unlike HSAs, FSAs do not roll over from year to year and operate on a “use-it-or-lose-it” principle. The policy options explore limiting the amount that can be contributed to an FSA or eliminating FSAs altogether. Qualified Medical Expenses – Under current law there is no standard definition for what qualifies as a medical expense for HSAs, FSAs, or itemized medical expense tax deductions. The policy option would apply a standard definition of qualified medical expenses across the board. Itemized Deduction for Medical Expenses – Under current law, a taxpayer that itemizes deductions may take a deduction for medical expenses – including insurance premiums and out of pocket medical costs – in excess of 7.5% of adjusted gross income. According to the Congressional Research Service, only 6% of all tax returns take the medical expense deduction. The policy options examine elimination the itemized deduction for medical expenses or raising the 7.5% floor for claiming deductions. The policy options also looked into reducing the 25% special deduction for certain non-profit organizations, modifying the student tax exemption, scrapping the employer payroll tax exemption for state and local government employees, and modifying the rules pertaining to non-profit hospitals. In addition, the Committee examined the possibility of creating ‘lifestyle’ taxes (perhaps better known as ‘sin taxes’) including increased taxation on alcoholic beverages and imposing excise tax on sugar-sweetened drinks. \"http://www.tax-news.com/asp/story/Senate_Explores_US_Healthcare_Reform_Tax_Options_xxxx36867.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9050077322001",
        "time": "2009-05-20 12:23:00",
        "title": "Senate Explores US Healthcare Reform Tax Options",
        "userID": "Anbar7"
    },
    {
        "content": "Should a healthcare tax be implemented? Or a lifestyle tax? Is there anything out there that is off limits to taxation or is Congress going to try and tax everything? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090520,
        "postID": 2,
        "quote": "",
        "reply": "Should a healthcare tax be implemented? Or a lifestyle tax? Is there anything out there that is off limits to taxation or is Congress going to try and tax everything? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9050077322001",
        "time": "2009-05-20 12:24:00",
        "title": "Senate Explores US Healthcare Reform Tax Options",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by Anbar7: Should a healthcare tax be implemented? Or a lifestyle tax? Is there anything out there that is off limits to taxation or is Congress going to try and tax everything? Should a health care tax be implemented? NO! Should a lifestyle tax be implemented? NO! Unless it is the Fairtax, that is a true lifestyle tax. Is there anything off limits? NO! Will they try and tax everything? YES! Cap and trade will increase the cost of almost everything American's buy.",
        "intTime": 20090520,
        "postID": 3,
        "quote": "Originally posted by Anbar7: Should a healthcare tax be implemented? Or a lifestyle tax? Is there anything out there that is off limits to taxation or is Congress going to try and tax everything?",
        "reply": " Should a health care tax be implemented? NO! Should a lifestyle tax be implemented? NO! Unless it is the Fairtax, that is a true lifestyle tax. Is there anything off limits? NO! Will they try and tax everything? YES! Cap and trade will increase the cost of almost everything American's buy.",
        "threadID": "672198221_9050077322001",
        "time": "2009-05-20 12:56:00",
        "title": "Senate Explores US Healthcare Reform Tax Options",
        "userID": "stec74"
    },
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Anbar7: Should a healthcare tax be implemented? Or a lifestyle tax? Is there anything out there that is off limits to taxation or is Congress going to try and tax everything? Should a health care tax be implemented? NO! Should a lifestyle tax be implemented? NO! Unless it is the Fairtax, that is a true lifestyle tax. Is there anything off limits? NO! Will they try and tax everything? YES! Cap and trade will increase the cost of almost everything American's buy. So then, how in the hell does this help us out? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090520,
        "postID": 4,
        "quote": "Originally posted by stec74: quote: Originally posted by Anbar7: Should a healthcare tax be implemented? Or a lifestyle tax? Is there anything out there that is off limits to taxation or is Congress going to try and tax everything? Should a health care tax be implemented? NO! Should a lifestyle tax be implemented? NO! Unless it is the Fairtax, that is a true lifestyle tax. Is there anything off limits? NO! Will they try and tax everything? YES! Cap and trade will increase the cost of almost everything American's buy.",
        "reply": " So then, how in the hell does this help us out? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9050077322001",
        "time": "2009-05-20 13:06:00",
        "title": "Senate Explores US Healthcare Reform Tax Options",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by stec74: quote: Originally posted by Anbar7: Should a healthcare tax be implemented? Or a lifestyle tax? Is there anything out there that is off limits to taxation or is Congress going to try and tax everything? Should a health care tax be implemented? NO! Should a lifestyle tax be implemented? NO! Unless it is the Fairtax, that is a true lifestyle tax. Is there anything off limits? NO! Will they try and tax everything? YES! Cap and trade will increase the cost of almost everything American's buy. So then, how in the hell does this help us out? I'm still unsure how this will make our rates go down. Instead of paying a higher deductable/premium we'll be paying higher taxes. All this does is allow a crack head from going to the emergency room to get treatment to a doctors office. They'll still pay jack squat.",
        "intTime": 20090520,
        "postID": 5,
        "quote": "Originally posted by Anbar7: quote: Originally posted by stec74: quote: Originally posted by Anbar7: Should a healthcare tax be implemented? Or a lifestyle tax? Is there anything out there that is off limits to taxation or is Congress going to try and tax everything? Should a health care tax be implemented? NO! Should a lifestyle tax be implemented? NO! Unless it is the Fairtax, that is a true lifestyle tax. Is there anything off limits? NO! Will they try and tax everything? YES! Cap and trade will increase the cost of almost everything American's buy. So then, how in the hell does this help us out?",
        "reply": " I'm still unsure how this will make our rates go down. Instead of paying a higher deductable/premium we'll be paying higher taxes. All this does is allow a crack head from going to the emergency room to get treatment to a doctors office. They'll still pay jack squat.",
        "threadID": "672198221_9050077322001",
        "time": "2009-05-20 13:17:00",
        "title": "Senate Explores US Healthcare Reform Tax Options",
        "userID": "NickBrand"
    }
]