[
    {
        "content": "quote: Lately, we've heard and read much about torture memos, waterboarding and insects in a box. It has been the occasion for somber reflection on our past and serious deliberation about our future. This is as it should be. It was Arizona Sen. John McCain, in talking about torture, who rightly reminded us that \"it's not about who they are. It's about who we are.\" But perhaps we also should remember that there was a human being strapped to that board. His name is Zayn al Abidin Mohamed Hussein, known to the world as Abu Zubaydah. He was arrested in Pakistan in March 2002. Because the Bush administration believed him to be a senior Al Qaeda operative, his detention and interrogation produced a fistful of firsts. As far as we can tell, he is the only prisoner in U.S. history whose interrogation was the subject of debate and direct authorization within the White House, and the first to disappear into a secret CIA \"black site.\" He was the first prisoner in the \"war on terror\" to experience the full gamut of ancient techniques adapted by the communists in Korea and, 50 years later, approved by the Justice Department in Washington. He was the first prisoner to have his interrogations captured on videotape -- a practice the CIA ended in late 2002. Two years later, the agency destroyed 90 videotapes of Abu Zubaydah's interrogations, which resulted in a criminal investigation of government officials connected with the program. Many questions about his interrogation remain unanswered, but two legs of the three-legged stool are firmly in place. First, they beat him. As authorized by the Justice Department and confirmed by the Red Cross, they wrapped a collar around his neck and smashed him over and over against a wall. They forced his body into a tiny, pitch-dark box and left him for hours. They stripped him naked and suspended him from hooks in the ceiling. They kept him awake for days. And they strapped him to an inverted board and poured water over his covered nose and mouth to \"produce the sensation of suffocation and incipient panic.\" Eighty-three times. I leave it to others to debate whether we should call this torture. I am content with the self-evident truth that it was wrong. Second, his treatment was motivated by the bane of our post-9/11 world: rotten intel. The beat him because they believed he was evil. Not long after his arrest, President Bush described him as \"one of the top three leaders\" in Al Qaeda and \"Al Qaeda's chief of operations.\" In fact, the CIA brass at Langley, Va., ordered his interrogators to keep at it long after the latter warned that he had been wrung dry. But Abu Zubaydah, we now understand, was nothing like what the president believed. He was never Al Qaeda. The journalist Ron Suskind was the first to ask the right questions. In his 2006 book, \"The One Percent Doctrine,\" he described Abu Zubaydah as a minor logistics man, a travel agent. Later and more detailed reporting in the Washington Post, quoting Justice Department officials, said he provided \"above-ground support. ... To make him the mastermind of anything is ridiculous.\" More recently, the New York Times, relying on current and former intelligence officers, said the initial assessment was \"highly inflated\" and reflected \"a profound misunderstanding\" of Abu Zubaydah. Far from a leader, he was \"a personnel clerk.\" So two legs of the stool are fixed: They tormented a clerk. But there is a third leg that should not be left out. No one can pass unscathed through an ordeal like this. Abu Zubaydah paid with his mind. Partly as a result of injuries he suffered while he was fighting the communists in Afghanistan, partly as a result of how those injuries were exacerbated by the CIA and partly as a result of his extended isolation, Abu Zubaydah's mental grasp is slipping away. Today, he suffers blinding headaches and has permanent brain damage. He has an excruciating sensitivity to sounds, hearing what others do not. The slightest noise drives him nearly insane. In the last two years alone, he has experienced about 200 seizures. But physical pain is a passing thing. The enduring torment is the taunting reminder that darkness encroaches. Already, he cannot picture his mother's face or recall his father's name. Gradually, his past, like his future, eludes him. McCain was right: It's about who we are. And we are not people who do this to another human being. +http://www.latimes.com/news/opinion/la-oe-margulies30-2009apr30,0,3309097.story \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 1, 
        "quote": "Lately, we've heard and read much about torture memos, waterboarding and insects in a box. It has been the occasion for somber reflection on our past and serious deliberation about our future. This is as it should be. It was Arizona Sen. John McCain, in talking about torture, who rightly reminded us that \"it's not about who they are. It's about who we are.\" But perhaps we also should remember that there was a human being strapped to that board. His name is Zayn al Abidin Mohamed Hussein, known to the world as Abu Zubaydah. He was arrested in Pakistan in March 2002. Because the Bush administration believed him to be a senior Al Qaeda operative, his detention and interrogation produced a fistful of firsts. As far as we can tell, he is the only prisoner in U.S. history whose interrogation was the subject of debate and direct authorization within the White House, and the first to disappear into a secret CIA \"black site.\" He was the first prisoner in the \"war on terror\" to experience the full gamut of ancient techniques adapted by the communists in Korea and, 50 years later, approved by the Justice Department in Washington. He was the first prisoner to have his interrogations captured on videotape -- a practice the CIA ended in late 2002. Two years later, the agency destroyed 90 videotapes of Abu Zubaydah's interrogations, which resulted in a criminal investigation of government officials connected with the program. Many questions about his interrogation remain unanswered, but two legs of the three-legged stool are firmly in place. First, they beat him. As authorized by the Justice Department and confirmed by the Red Cross, they wrapped a collar around his neck and smashed him over and over against a wall. They forced his body into a tiny, pitch-dark box and left him for hours. They stripped him naked and suspended him from hooks in the ceiling. They kept him awake for days. And they strapped him to an inverted board and poured water over his covered nose and mouth to \"produce the sensation of suffocation and incipient panic.\" Eighty-three times. I leave it to others to debate whether we should call this torture. I am content with the self-evident truth that it was wrong. Second, his treatment was motivated by the bane of our post-9/11 world: rotten intel. The beat him because they believed he was evil. Not long after his arrest, President Bush described him as \"one of the top three leaders\" in Al Qaeda and \"Al Qaeda's chief of operations.\" In fact, the CIA brass at Langley, Va., ordered his interrogators to keep at it long after the latter warned that he had been wrung dry. But Abu Zubaydah, we now understand, was nothing like what the president believed. He was never Al Qaeda. The journalist Ron Suskind was the first to ask the right questions. In his 2006 book, \"The One Percent Doctrine,\" he described Abu Zubaydah as a minor logistics man, a travel agent. Later and more detailed reporting in the Washington Post, quoting Justice Department officials, said he provided \"above-ground support. ... To make him the mastermind of anything is ridiculous.\" More recently, the New York Times, relying on current and former intelligence officers, said the initial assessment was \"highly inflated\" and reflected \"a profound misunderstanding\" of Abu Zubaydah. Far from a leader, he was \"a personnel clerk.\" So two legs of the stool are fixed: They tormented a clerk. But there is a third leg that should not be left out. No one can pass unscathed through an ordeal like this. Abu Zubaydah paid with his mind. Partly as a result of injuries he suffered while he was fighting the communists in Afghanistan, partly as a result of how those injuries were exacerbated by the CIA and partly as a result of his extended isolation, Abu Zubaydah's mental grasp is slipping away. Today, he suffers blinding headaches and has permanent brain damage. He has an excruciating sensitivity to sounds, hearing what others do not. The slightest noise drives him nearly insane. In the last two years alone, he has experienced about 200 seizures. But physical pain is a passing thing. The enduring torment is the taunting reminder that darkness encroaches. Already, he cannot picture his mother's face or recall his father's name. Gradually, his past, like his future, eludes him. McCain was right: It's about who we are. And we are not people who do this to another human being.", 
        "reply": " +http://www.latimes.com/news/opinion/la-oe-margulies30-2009apr30,0,3309097.story \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 06:06:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "NSNN"
    }, 
    {
        "content": "My heart FREAKIN' BLEEDS..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090430, 
        "postID": 2, 
        "quote": "", 
        "reply": "My heart FREAKIN' BLEEDS..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:31:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "Awwwww.. the poor jihadi.", 
        "intTime": 20090430, 
        "postID": 3, 
        "quote": "", 
        "reply": "Awwwww.. the poor jihadi.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:34:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "We are Americans. If someone deserves death, we hang them or we shoot them - We do NOT sit around a table and disect them like frogs. You think this guy is as bad as Ted Bundy? John Wayne Gacy, who raped and murdered 40 odd kids in Chicago? Screw this guy - should have been shot - But it's American who are the ones doing THIS bit of disecting. You bet, you don't do this to a human being without getting covered in schit. quote: “We are America! I don’t give a rats azz if it helps! We do not *******g torture!” Shepherd Smith Dave", 
        "intTime": 20090430, 
        "postID": 4, 
        "quote": "“We are America! I don’t give a rats azz if it helps! We do not *******g torture!” Shepherd Smith", 
        "reply": "We are Americans. If someone deserves death, we hang them or we shoot them - We do NOT sit around a table and disect them like frogs. You think this guy is as bad as Ted Bundy? John Wayne Gacy, who raped and murdered 40 odd kids in Chicago? Screw this guy - should have been shot - But it's American who are the ones doing THIS bit of disecting. You bet, you don't do this to a human being without getting covered in schit.  Dave", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:40:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "Grachus"
    }, 
    {
        "content": "There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "intTime": 20090430, 
        "postID": 5, 
        "quote": "", 
        "reply": "There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:51:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "I say lets water board Shepherd Smith!!!! He now makes 7 million a yr for screaming in N.O. after the hurracane..(sp). Blaming it all on Bush, while the Mayor and Goveror sat silent and did nothing.", 
        "intTime": 20090430, 
        "postID": 6, 
        "quote": "", 
        "reply": "I say lets water board Shepherd Smith!!!! He now makes 7 million a yr for screaming in N.O. after the hurracane..(sp). Blaming it all on Bush, while the Mayor and Goveror sat silent and did nothing.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "dman1948"
    }, 
    {
        "content": "I think I am going to go vomit.", 
        "intTime": 20090430, 
        "postID": 7, 
        "quote": "", 
        "reply": "I think I am going to go vomit.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 14:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by sgt_posty: There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me. Well, we can agree on one thing, he gets so sympathy from me either... I think the lousy SIERRA OSCAR BRAVO should have been shot!... The thing is, this is about us, we are not animals like them, killing in the name of a god... We are way better than they are and torturing the scum is wrong... It IS about US, NOT about THEM... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 8, 
        "quote": "Originally posted by sgt_posty: There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "reply": " Well, we can agree on one thing, he gets so sympathy from me either... I think the lousy SIERRA OSCAR BRAVO should have been shot!... The thing is, this is about us, we are not animals like them, killing in the name of a god... We are way better than they are and torturing the scum is wrong... It IS about US, NOT about THEM... Respectfully, SUNLINER81", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 15:05:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "intTime": 20090430, 
        "postID": 9, 
        "quote": "", 
        "reply": "Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 17:48:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "ACR26"
    }, 
    {
        "content": "On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "intTime": 20090430, 
        "postID": 10, 
        "quote": "", 
        "reply": "On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:04:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math? Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 07:02 PM", 
        "intTime": 20090430, 
        "postID": 11, 
        "quote": "Originally posted by ACR26: Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "reply": " Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 07:02 PM", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:41:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden. All kinds of people on here keep trying to give all kinds of analogies, so o.k., here's one... A little kid is kidnapped and is put in a box with limited air... The police have the kidnapper in custody and he just laughs at them and says that there isn't a thing that you can do to make him talk... YOU get a hold of this used scum sack and you break out your razor sharp K-bar and slowly start to skin this jackzz alive, eventually he talks and the kid is rescued alive... They take the scum to the hospital but, he dies... Not only is the kid rescued but, you are arrested and the charge is murder... The kid is rescued and you are charged with murder, you admit it and they lock you up and throw away the key... But, you keep saying the kid was rescued, I saved that kid, I got the guy to talk... You still go to jail for twenty-five to life for murder and you can't understand why... Do you see the point now?... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 12, 
        "quote": "Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "reply": " All kinds of people on here keep trying to give all kinds of analogies, so o.k., here's one... A little kid is kidnapped and is put in a box with limited air... The police have the kidnapper in custody and he just laughs at them and says that there isn't a thing that you can do to make him talk... YOU get a hold of this used scum sack and you break out your razor sharp K-bar and slowly start to skin this jackzz alive, eventually he talks and the kid is rescued alive... They take the scum to the hospital but, he dies... Not only is the kid rescued but, you are arrested and the charge is murder... The kid is rescued and you are charged with murder, you admit it and they lock you up and throw away the key... But, you keep saying the kid was rescued, I saved that kid, I got the guy to talk... You still go to jail for twenty-five to life for murder and you can't understand why... Do you see the point now?... Respectfully, SUNLINER81", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:48:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "intTime": 20090430, 
        "postID": 13, 
        "quote": "", 
        "reply": "And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 19:42:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed. These puke bags are told if captured to ALWAYS make up stuff if and when they are released. It is part of the psychological game the terrorists plays. They know that weak minded liberals will always fall for the bleeding heart story and it plays into their plans. You can treat them like a royal dignitary and they will still say they were beaten and tortured. If ANYONE says they were treated badly at GITMO then they are a GOD DAMNED LIAR. The detainees there were treated much better than American citizens are in US prisons. The food they received was often better than the troops guarding them. As rayevinsonsr pointed out, this swine dung \"clerk\" gave up some really big fish and info that led to the discovery of the LAX plot.", 
        "intTime": 20090430, 
        "postID": 14, 
        "quote": "Originally posted by peter3_1: And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "reply": " These puke bags are told if captured to ALWAYS make up stuff if and when they are released. It is part of the psychological game the terrorists plays. They know that weak minded liberals will always fall for the bleeding heart story and it plays into their plans. You can treat them like a royal dignitary and they will still say they were beaten and tortured. If ANYONE says they were treated badly at GITMO then they are a GOD DAMNED LIAR. The detainees there were treated much better than American citizens are in US prisons. The food they received was often better than the troops guarding them. As rayevinsonsr pointed out, this swine dung \"clerk\" gave up some really big fish and info that led to the discovery of the LAX plot.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 20:20:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. Where there is nothing specifically mentioned there is no treaty requirement. The GC was very specific and the issue that allowed Bush and lawyers to conduct EI was that fact. If the type of \"combatants\" are not specifically mentioned then there is no treaty in respect to the persons at issue. Ol Abu should do the world a favor and check himself out.", 
        "intTime": 20090430, 
        "postID": 15, 
        "quote": "Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81", 
        "reply": " Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. Where there is nothing specifically mentioned there is no treaty requirement. The GC was very specific and the issue that allowed Bush and lawyers to conduct EI was that fact. If the type of \"combatants\" are not specifically mentioned then there is no treaty in respect to the persons at issue. Ol Abu should do the world a favor and check himself out.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 20:25:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by NSNN: McCain was right: It's about who we are. And we are not people who do this to another human being. McCain is a traitor and a terrorist sympathizer!! What does he know about torture!?!?!", 
        "intTime": 20090501, 
        "postID": 16, 
        "quote": "Originally posted by NSNN: McCain was right: It's about who we are. And we are not people who do this to another human being.", 
        "reply": " McCain is a traitor and a terrorist sympathizer!! What does he know about torture!?!?!", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 01:14:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. If they're not combatants then they're common criminals.", 
        "intTime": 20090501, 
        "postID": 17, 
        "quote": "Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types.", 
        "reply": " If they're not combatants then they're common criminals.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 01:40:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090501, 
        "postID": 18, 
        "quote": "Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 05:46:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "NSNN"
    }, 
    {
        "content": "When you think you're right, anything is possible. Ask Adolf.", 
        "intTime": 20090501, 
        "postID": 19, 
        "quote": "", 
        "reply": "When you think you're right, anything is possible. Ask Adolf.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 07:36:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due. We are the guys that saved the rest of the world on a number occasions, that has the mettle and audacity to cope with a situation that provides leadership. But above all, it save(s) American lives with whatever degree of torture, arrogance or meanness, you want to attach. If we have utilized the weapons and manpower that has killed hundreds of thousands of people in the past within days, this insisting waterboarding is going to bring the end of the world is preposterous! Saying that you would hurt someone for doing it ridiculous!", 
        "intTime": 20090501, 
        "postID": 20, 
        "quote": "Originally posted by NSNN: quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due.", 
        "reply": " We are the guys that saved the rest of the world on a number occasions, that has the mettle and audacity to cope with a situation that provides leadership. But above all, it save(s) American lives with whatever degree of torture, arrogance or meanness, you want to attach. If we have utilized the weapons and manpower that has killed hundreds of thousands of people in the past within days, this insisting waterboarding is going to bring the end of the world is preposterous! Saying that you would hurt someone for doing it ridiculous!", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 10:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Lately, we've heard and read much about torture memos, waterboarding and insects in a box. It has been the occasion for somber reflection on our past and serious deliberation about our future. This is as it should be. It was Arizona Sen. John McCain, in talking about torture, who rightly reminded us that \"it's not about who they are. It's about who we are.\" But perhaps we also should remember that there was a human being strapped to that board. His name is Zayn al Abidin Mohamed Hussein, known to the world as Abu Zubaydah. He was arrested in Pakistan in March 2002. Because the Bush administration believed him to be a senior Al Qaeda operative, his detention and interrogation produced a fistful of firsts. As far as we can tell, he is the only prisoner in U.S. history whose interrogation was the subject of debate and direct authorization within the White House, and the first to disappear into a secret CIA \"black site.\" He was the first prisoner in the \"war on terror\" to experience the full gamut of ancient techniques adapted by the communists in Korea and, 50 years later, approved by the Justice Department in Washington. He was the first prisoner to have his interrogations captured on videotape -- a practice the CIA ended in late 2002. Two years later, the agency destroyed 90 videotapes of Abu Zubaydah's interrogations, which resulted in a criminal investigation of government officials connected with the program. Many questions about his interrogation remain unanswered, but two legs of the three-legged stool are firmly in place. First, they beat him. As authorized by the Justice Department and confirmed by the Red Cross, they wrapped a collar around his neck and smashed him over and over against a wall. They forced his body into a tiny, pitch-dark box and left him for hours. They stripped him naked and suspended him from hooks in the ceiling. They kept him awake for days. And they strapped him to an inverted board and poured water over his covered nose and mouth to \"produce the sensation of suffocation and incipient panic.\" Eighty-three times. I leave it to others to debate whether we should call this torture. I am content with the self-evident truth that it was wrong. Second, his treatment was motivated by the bane of our post-9/11 world: rotten intel. The beat him because they believed he was evil. Not long after his arrest, President Bush described him as \"one of the top three leaders\" in Al Qaeda and \"Al Qaeda's chief of operations.\" In fact, the CIA brass at Langley, Va., ordered his interrogators to keep at it long after the latter warned that he had been wrung dry. But Abu Zubaydah, we now understand, was nothing like what the president believed. He was never Al Qaeda. The journalist Ron Suskind was the first to ask the right questions. In his 2006 book, \"The One Percent Doctrine,\" he described Abu Zubaydah as a minor logistics man, a travel agent. Later and more detailed reporting in the Washington Post, quoting Justice Department officials, said he provided \"above-ground support. ... To make him the mastermind of anything is ridiculous.\" More recently, the New York Times, relying on current and former intelligence officers, said the initial assessment was \"highly inflated\" and reflected \"a profound misunderstanding\" of Abu Zubaydah. Far from a leader, he was \"a personnel clerk.\" So two legs of the stool are fixed: They tormented a clerk. But there is a third leg that should not be left out. No one can pass unscathed through an ordeal like this. Abu Zubaydah paid with his mind. Partly as a result of injuries he suffered while he was fighting the communists in Afghanistan, partly as a result of how those injuries were exacerbated by the CIA and partly as a result of his extended isolation, Abu Zubaydah's mental grasp is slipping away. Today, he suffers blinding headaches and has permanent brain damage. He has an excruciating sensitivity to sounds, hearing what others do not. The slightest noise drives him nearly insane. In the last two years alone, he has experienced about 200 seizures. But physical pain is a passing thing. The enduring torment is the taunting reminder that darkness encroaches. Already, he cannot picture his mother's face or recall his father's name. Gradually, his past, like his future, eludes him. McCain was right: It's about who we are. And we are not people who do this to another human being. +http://www.latimes.com/news/opinion/la-oe-margulies30-2009apr30,0,3309097.story \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 21, 
        "quote": "Lately, we've heard and read much about torture memos, waterboarding and insects in a box. It has been the occasion for somber reflection on our past and serious deliberation about our future. This is as it should be. It was Arizona Sen. John McCain, in talking about torture, who rightly reminded us that \"it's not about who they are. It's about who we are.\" But perhaps we also should remember that there was a human being strapped to that board. His name is Zayn al Abidin Mohamed Hussein, known to the world as Abu Zubaydah. He was arrested in Pakistan in March 2002. Because the Bush administration believed him to be a senior Al Qaeda operative, his detention and interrogation produced a fistful of firsts. As far as we can tell, he is the only prisoner in U.S. history whose interrogation was the subject of debate and direct authorization within the White House, and the first to disappear into a secret CIA \"black site.\" He was the first prisoner in the \"war on terror\" to experience the full gamut of ancient techniques adapted by the communists in Korea and, 50 years later, approved by the Justice Department in Washington. He was the first prisoner to have his interrogations captured on videotape -- a practice the CIA ended in late 2002. Two years later, the agency destroyed 90 videotapes of Abu Zubaydah's interrogations, which resulted in a criminal investigation of government officials connected with the program. Many questions about his interrogation remain unanswered, but two legs of the three-legged stool are firmly in place. First, they beat him. As authorized by the Justice Department and confirmed by the Red Cross, they wrapped a collar around his neck and smashed him over and over against a wall. They forced his body into a tiny, pitch-dark box and left him for hours. They stripped him naked and suspended him from hooks in the ceiling. They kept him awake for days. And they strapped him to an inverted board and poured water over his covered nose and mouth to \"produce the sensation of suffocation and incipient panic.\" Eighty-three times. I leave it to others to debate whether we should call this torture. I am content with the self-evident truth that it was wrong. Second, his treatment was motivated by the bane of our post-9/11 world: rotten intel. The beat him because they believed he was evil. Not long after his arrest, President Bush described him as \"one of the top three leaders\" in Al Qaeda and \"Al Qaeda's chief of operations.\" In fact, the CIA brass at Langley, Va., ordered his interrogators to keep at it long after the latter warned that he had been wrung dry. But Abu Zubaydah, we now understand, was nothing like what the president believed. He was never Al Qaeda. The journalist Ron Suskind was the first to ask the right questions. In his 2006 book, \"The One Percent Doctrine,\" he described Abu Zubaydah as a minor logistics man, a travel agent. Later and more detailed reporting in the Washington Post, quoting Justice Department officials, said he provided \"above-ground support. ... To make him the mastermind of anything is ridiculous.\" More recently, the New York Times, relying on current and former intelligence officers, said the initial assessment was \"highly inflated\" and reflected \"a profound misunderstanding\" of Abu Zubaydah. Far from a leader, he was \"a personnel clerk.\" So two legs of the stool are fixed: They tormented a clerk. But there is a third leg that should not be left out. No one can pass unscathed through an ordeal like this. Abu Zubaydah paid with his mind. Partly as a result of injuries he suffered while he was fighting the communists in Afghanistan, partly as a result of how those injuries were exacerbated by the CIA and partly as a result of his extended isolation, Abu Zubaydah's mental grasp is slipping away. Today, he suffers blinding headaches and has permanent brain damage. He has an excruciating sensitivity to sounds, hearing what others do not. The slightest noise drives him nearly insane. In the last two years alone, he has experienced about 200 seizures. But physical pain is a passing thing. The enduring torment is the taunting reminder that darkness encroaches. Already, he cannot picture his mother's face or recall his father's name. Gradually, his past, like his future, eludes him. McCain was right: It's about who we are. And we are not people who do this to another human being.", 
        "reply": " +http://www.latimes.com/news/opinion/la-oe-margulies30-2009apr30,0,3309097.story \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 06:06:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "NSNN"
    }, 
    {
        "content": "My heart FREAKIN' BLEEDS..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090430, 
        "postID": 22, 
        "quote": "", 
        "reply": "My heart FREAKIN' BLEEDS..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:31:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "Awwwww.. the poor jihadi.", 
        "intTime": 20090430, 
        "postID": 23, 
        "quote": "", 
        "reply": "Awwwww.. the poor jihadi.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:34:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "We are Americans. If someone deserves death, we hang them or we shoot them - We do NOT sit around a table and disect them like frogs. You think this guy is as bad as Ted Bundy? John Wayne Gacy, who raped and murdered 40 odd kids in Chicago? Screw this guy - should have been shot - But it's American who are the ones doing THIS bit of disecting. You bet, you don't do this to a human being without getting covered in schit. quote: “We are America! I don’t give a rats azz if it helps! We do not *******g torture!” Shepherd Smith Dave", 
        "intTime": 20090430, 
        "postID": 24, 
        "quote": "“We are America! I don’t give a rats azz if it helps! We do not *******g torture!” Shepherd Smith", 
        "reply": "We are Americans. If someone deserves death, we hang them or we shoot them - We do NOT sit around a table and disect them like frogs. You think this guy is as bad as Ted Bundy? John Wayne Gacy, who raped and murdered 40 odd kids in Chicago? Screw this guy - should have been shot - But it's American who are the ones doing THIS bit of disecting. You bet, you don't do this to a human being without getting covered in schit.  Dave", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:40:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "Grachus"
    }, 
    {
        "content": "There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "intTime": 20090430, 
        "postID": 25, 
        "quote": "", 
        "reply": "There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:51:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "I say lets water board Shepherd Smith!!!! He now makes 7 million a yr for screaming in N.O. after the hurracane..(sp). Blaming it all on Bush, while the Mayor and Goveror sat silent and did nothing.", 
        "intTime": 20090430, 
        "postID": 26, 
        "quote": "", 
        "reply": "I say lets water board Shepherd Smith!!!! He now makes 7 million a yr for screaming in N.O. after the hurracane..(sp). Blaming it all on Bush, while the Mayor and Goveror sat silent and did nothing.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "dman1948"
    }, 
    {
        "content": "I think I am going to go vomit.", 
        "intTime": 20090430, 
        "postID": 27, 
        "quote": "", 
        "reply": "I think I am going to go vomit.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 14:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by sgt_posty: There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me. Well, we can agree on one thing, he gets so sympathy from me either... I think the lousy SIERRA OSCAR BRAVO should have been shot!... The thing is, this is about us, we are not animals like them, killing in the name of a god... We are way better than they are and torturing the scum is wrong... It IS about US, NOT about THEM... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 28, 
        "quote": "Originally posted by sgt_posty: There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "reply": " Well, we can agree on one thing, he gets so sympathy from me either... I think the lousy SIERRA OSCAR BRAVO should have been shot!... The thing is, this is about us, we are not animals like them, killing in the name of a god... We are way better than they are and torturing the scum is wrong... It IS about US, NOT about THEM... Respectfully, SUNLINER81", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 15:05:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "intTime": 20090430, 
        "postID": 29, 
        "quote": "", 
        "reply": "Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 17:48:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "ACR26"
    }, 
    {
        "content": "On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "intTime": 20090430, 
        "postID": 30, 
        "quote": "", 
        "reply": "On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:04:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math? Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 07:02 PM", 
        "intTime": 20090430, 
        "postID": 31, 
        "quote": "Originally posted by ACR26: Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "reply": " Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 07:02 PM", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:41:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden. All kinds of people on here keep trying to give all kinds of analogies, so o.k., here's one... A little kid is kidnapped and is put in a box with limited air... The police have the kidnapper in custody and he just laughs at them and says that there isn't a thing that you can do to make him talk... YOU get a hold of this used scum sack and you break out your razor sharp K-bar and slowly start to skin this jackzz alive, eventually he talks and the kid is rescued alive... They take the scum to the hospital but, he dies... Not only is the kid rescued but, you are arrested and the charge is murder... The kid is rescued and you are charged with murder, you admit it and they lock you up and throw away the key... But, you keep saying the kid was rescued, I saved that kid, I got the guy to talk... You still go to jail for twenty-five to life for murder and you can't understand why... Do you see the point now?... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 32, 
        "quote": "Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "reply": " All kinds of people on here keep trying to give all kinds of analogies, so o.k., here's one... A little kid is kidnapped and is put in a box with limited air... The police have the kidnapper in custody and he just laughs at them and says that there isn't a thing that you can do to make him talk... YOU get a hold of this used scum sack and you break out your razor sharp K-bar and slowly start to skin this jackzz alive, eventually he talks and the kid is rescued alive... They take the scum to the hospital but, he dies... Not only is the kid rescued but, you are arrested and the charge is murder... The kid is rescued and you are charged with murder, you admit it and they lock you up and throw away the key... But, you keep saying the kid was rescued, I saved that kid, I got the guy to talk... You still go to jail for twenty-five to life for murder and you can't understand why... Do you see the point now?... Respectfully, SUNLINER81", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:48:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "intTime": 20090430, 
        "postID": 33, 
        "quote": "", 
        "reply": "And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 19:42:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed. These puke bags are told if captured to ALWAYS make up stuff if and when they are released. It is part of the psychological game the terrorists plays. They know that weak minded liberals will always fall for the bleeding heart story and it plays into their plans. You can treat them like a royal dignitary and they will still say they were beaten and tortured. If ANYONE says they were treated badly at GITMO then they are a GOD DAMNED LIAR. The detainees there were treated much better than American citizens are in US prisons. The food they received was often better than the troops guarding them. As rayevinsonsr pointed out, this swine dung \"clerk\" gave up some really big fish and info that led to the discovery of the LAX plot.", 
        "intTime": 20090430, 
        "postID": 34, 
        "quote": "Originally posted by peter3_1: And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "reply": " These puke bags are told if captured to ALWAYS make up stuff if and when they are released. It is part of the psychological game the terrorists plays. They know that weak minded liberals will always fall for the bleeding heart story and it plays into their plans. You can treat them like a royal dignitary and they will still say they were beaten and tortured. If ANYONE says they were treated badly at GITMO then they are a GOD DAMNED LIAR. The detainees there were treated much better than American citizens are in US prisons. The food they received was often better than the troops guarding them. As rayevinsonsr pointed out, this swine dung \"clerk\" gave up some really big fish and info that led to the discovery of the LAX plot.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 20:20:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. Where there is nothing specifically mentioned there is no treaty requirement. The GC was very specific and the issue that allowed Bush and lawyers to conduct EI was that fact. If the type of \"combatants\" are not specifically mentioned then there is no treaty in respect to the persons at issue. Ol Abu should do the world a favor and check himself out.", 
        "intTime": 20090430, 
        "postID": 35, 
        "quote": "Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81", 
        "reply": " Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. Where there is nothing specifically mentioned there is no treaty requirement. The GC was very specific and the issue that allowed Bush and lawyers to conduct EI was that fact. If the type of \"combatants\" are not specifically mentioned then there is no treaty in respect to the persons at issue. Ol Abu should do the world a favor and check himself out.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 20:25:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by NSNN: McCain was right: It's about who we are. And we are not people who do this to another human being. McCain is a traitor and a terrorist sympathizer!! What does he know about torture!?!?!", 
        "intTime": 20090501, 
        "postID": 36, 
        "quote": "Originally posted by NSNN: McCain was right: It's about who we are. And we are not people who do this to another human being.", 
        "reply": " McCain is a traitor and a terrorist sympathizer!! What does he know about torture!?!?!", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 01:14:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. If they're not combatants then they're common criminals.", 
        "intTime": 20090501, 
        "postID": 37, 
        "quote": "Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types.", 
        "reply": " If they're not combatants then they're common criminals.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 01:40:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090501, 
        "postID": 38, 
        "quote": "Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 05:46:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "NSNN"
    }, 
    {
        "content": "When you think you're right, anything is possible. Ask Adolf.", 
        "intTime": 20090501, 
        "postID": 39, 
        "quote": "", 
        "reply": "When you think you're right, anything is possible. Ask Adolf.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 07:36:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due. We are the guys that saved the rest of the world on a number occasions, that has the mettle and audacity to cope with a situation that provides leadership. But above all, it save(s) American lives with whatever degree of torture, arrogance or meanness, you want to attach. If we have utilized the weapons and manpower that has killed hundreds of thousands of people in the past within days, this insisting waterboarding is going to bring the end of the world is preposterous! Saying that you would hurt someone for doing it ridiculous!", 
        "intTime": 20090501, 
        "postID": 40, 
        "quote": "Originally posted by NSNN: quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due.", 
        "reply": " We are the guys that saved the rest of the world on a number occasions, that has the mettle and audacity to cope with a situation that provides leadership. But above all, it save(s) American lives with whatever degree of torture, arrogance or meanness, you want to attach. If we have utilized the weapons and manpower that has killed hundreds of thousands of people in the past within days, this insisting waterboarding is going to bring the end of the world is preposterous! Saying that you would hurt someone for doing it ridiculous!", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 10:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Lately, we've heard and read much about torture memos, waterboarding and insects in a box. It has been the occasion for somber reflection on our past and serious deliberation about our future. This is as it should be. It was Arizona Sen. John McCain, in talking about torture, who rightly reminded us that \"it's not about who they are. It's about who we are.\" But perhaps we also should remember that there was a human being strapped to that board. His name is Zayn al Abidin Mohamed Hussein, known to the world as Abu Zubaydah. He was arrested in Pakistan in March 2002. Because the Bush administration believed him to be a senior Al Qaeda operative, his detention and interrogation produced a fistful of firsts. As far as we can tell, he is the only prisoner in U.S. history whose interrogation was the subject of debate and direct authorization within the White House, and the first to disappear into a secret CIA \"black site.\" He was the first prisoner in the \"war on terror\" to experience the full gamut of ancient techniques adapted by the communists in Korea and, 50 years later, approved by the Justice Department in Washington. He was the first prisoner to have his interrogations captured on videotape -- a practice the CIA ended in late 2002. Two years later, the agency destroyed 90 videotapes of Abu Zubaydah's interrogations, which resulted in a criminal investigation of government officials connected with the program. Many questions about his interrogation remain unanswered, but two legs of the three-legged stool are firmly in place. First, they beat him. As authorized by the Justice Department and confirmed by the Red Cross, they wrapped a collar around his neck and smashed him over and over against a wall. They forced his body into a tiny, pitch-dark box and left him for hours. They stripped him naked and suspended him from hooks in the ceiling. They kept him awake for days. And they strapped him to an inverted board and poured water over his covered nose and mouth to \"produce the sensation of suffocation and incipient panic.\" Eighty-three times. I leave it to others to debate whether we should call this torture. I am content with the self-evident truth that it was wrong. Second, his treatment was motivated by the bane of our post-9/11 world: rotten intel. The beat him because they believed he was evil. Not long after his arrest, President Bush described him as \"one of the top three leaders\" in Al Qaeda and \"Al Qaeda's chief of operations.\" In fact, the CIA brass at Langley, Va., ordered his interrogators to keep at it long after the latter warned that he had been wrung dry. But Abu Zubaydah, we now understand, was nothing like what the president believed. He was never Al Qaeda. The journalist Ron Suskind was the first to ask the right questions. In his 2006 book, \"The One Percent Doctrine,\" he described Abu Zubaydah as a minor logistics man, a travel agent. Later and more detailed reporting in the Washington Post, quoting Justice Department officials, said he provided \"above-ground support. ... To make him the mastermind of anything is ridiculous.\" More recently, the New York Times, relying on current and former intelligence officers, said the initial assessment was \"highly inflated\" and reflected \"a profound misunderstanding\" of Abu Zubaydah. Far from a leader, he was \"a personnel clerk.\" So two legs of the stool are fixed: They tormented a clerk. But there is a third leg that should not be left out. No one can pass unscathed through an ordeal like this. Abu Zubaydah paid with his mind. Partly as a result of injuries he suffered while he was fighting the communists in Afghanistan, partly as a result of how those injuries were exacerbated by the CIA and partly as a result of his extended isolation, Abu Zubaydah's mental grasp is slipping away. Today, he suffers blinding headaches and has permanent brain damage. He has an excruciating sensitivity to sounds, hearing what others do not. The slightest noise drives him nearly insane. In the last two years alone, he has experienced about 200 seizures. But physical pain is a passing thing. The enduring torment is the taunting reminder that darkness encroaches. Already, he cannot picture his mother's face or recall his father's name. Gradually, his past, like his future, eludes him. McCain was right: It's about who we are. And we are not people who do this to another human being. +http://www.latimes.com/news/opinion/la-oe-margulies30-2009apr30,0,3309097.story \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 41, 
        "quote": "Lately, we've heard and read much about torture memos, waterboarding and insects in a box. It has been the occasion for somber reflection on our past and serious deliberation about our future. This is as it should be. It was Arizona Sen. John McCain, in talking about torture, who rightly reminded us that \"it's not about who they are. It's about who we are.\" But perhaps we also should remember that there was a human being strapped to that board. His name is Zayn al Abidin Mohamed Hussein, known to the world as Abu Zubaydah. He was arrested in Pakistan in March 2002. Because the Bush administration believed him to be a senior Al Qaeda operative, his detention and interrogation produced a fistful of firsts. As far as we can tell, he is the only prisoner in U.S. history whose interrogation was the subject of debate and direct authorization within the White House, and the first to disappear into a secret CIA \"black site.\" He was the first prisoner in the \"war on terror\" to experience the full gamut of ancient techniques adapted by the communists in Korea and, 50 years later, approved by the Justice Department in Washington. He was the first prisoner to have his interrogations captured on videotape -- a practice the CIA ended in late 2002. Two years later, the agency destroyed 90 videotapes of Abu Zubaydah's interrogations, which resulted in a criminal investigation of government officials connected with the program. Many questions about his interrogation remain unanswered, but two legs of the three-legged stool are firmly in place. First, they beat him. As authorized by the Justice Department and confirmed by the Red Cross, they wrapped a collar around his neck and smashed him over and over against a wall. They forced his body into a tiny, pitch-dark box and left him for hours. They stripped him naked and suspended him from hooks in the ceiling. They kept him awake for days. And they strapped him to an inverted board and poured water over his covered nose and mouth to \"produce the sensation of suffocation and incipient panic.\" Eighty-three times. I leave it to others to debate whether we should call this torture. I am content with the self-evident truth that it was wrong. Second, his treatment was motivated by the bane of our post-9/11 world: rotten intel. The beat him because they believed he was evil. Not long after his arrest, President Bush described him as \"one of the top three leaders\" in Al Qaeda and \"Al Qaeda's chief of operations.\" In fact, the CIA brass at Langley, Va., ordered his interrogators to keep at it long after the latter warned that he had been wrung dry. But Abu Zubaydah, we now understand, was nothing like what the president believed. He was never Al Qaeda. The journalist Ron Suskind was the first to ask the right questions. In his 2006 book, \"The One Percent Doctrine,\" he described Abu Zubaydah as a minor logistics man, a travel agent. Later and more detailed reporting in the Washington Post, quoting Justice Department officials, said he provided \"above-ground support. ... To make him the mastermind of anything is ridiculous.\" More recently, the New York Times, relying on current and former intelligence officers, said the initial assessment was \"highly inflated\" and reflected \"a profound misunderstanding\" of Abu Zubaydah. Far from a leader, he was \"a personnel clerk.\" So two legs of the stool are fixed: They tormented a clerk. But there is a third leg that should not be left out. No one can pass unscathed through an ordeal like this. Abu Zubaydah paid with his mind. Partly as a result of injuries he suffered while he was fighting the communists in Afghanistan, partly as a result of how those injuries were exacerbated by the CIA and partly as a result of his extended isolation, Abu Zubaydah's mental grasp is slipping away. Today, he suffers blinding headaches and has permanent brain damage. He has an excruciating sensitivity to sounds, hearing what others do not. The slightest noise drives him nearly insane. In the last two years alone, he has experienced about 200 seizures. But physical pain is a passing thing. The enduring torment is the taunting reminder that darkness encroaches. Already, he cannot picture his mother's face or recall his father's name. Gradually, his past, like his future, eludes him. McCain was right: It's about who we are. And we are not people who do this to another human being.", 
        "reply": " +http://www.latimes.com/news/opinion/la-oe-margulies30-2009apr30,0,3309097.story \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 06:06:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "NSNN"
    }, 
    {
        "content": "My heart FREAKIN' BLEEDS..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090430, 
        "postID": 42, 
        "quote": "", 
        "reply": "My heart FREAKIN' BLEEDS..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:31:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "Awwwww.. the poor jihadi.", 
        "intTime": 20090430, 
        "postID": 43, 
        "quote": "", 
        "reply": "Awwwww.. the poor jihadi.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:34:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "We are Americans. If someone deserves death, we hang them or we shoot them - We do NOT sit around a table and disect them like frogs. You think this guy is as bad as Ted Bundy? John Wayne Gacy, who raped and murdered 40 odd kids in Chicago? Screw this guy - should have been shot - But it's American who are the ones doing THIS bit of disecting. You bet, you don't do this to a human being without getting covered in schit. quote: “We are America! I don’t give a rats azz if it helps! We do not *******g torture!” Shepherd Smith Dave", 
        "intTime": 20090430, 
        "postID": 44, 
        "quote": "“We are America! I don’t give a rats azz if it helps! We do not *******g torture!” Shepherd Smith", 
        "reply": "We are Americans. If someone deserves death, we hang them or we shoot them - We do NOT sit around a table and disect them like frogs. You think this guy is as bad as Ted Bundy? John Wayne Gacy, who raped and murdered 40 odd kids in Chicago? Screw this guy - should have been shot - But it's American who are the ones doing THIS bit of disecting. You bet, you don't do this to a human being without getting covered in schit.  Dave", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:40:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "Grachus"
    }, 
    {
        "content": "There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "intTime": 20090430, 
        "postID": 45, 
        "quote": "", 
        "reply": "There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:51:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "I say lets water board Shepherd Smith!!!! He now makes 7 million a yr for screaming in N.O. after the hurracane..(sp). Blaming it all on Bush, while the Mayor and Goveror sat silent and did nothing.", 
        "intTime": 20090430, 
        "postID": 46, 
        "quote": "", 
        "reply": "I say lets water board Shepherd Smith!!!! He now makes 7 million a yr for screaming in N.O. after the hurracane..(sp). Blaming it all on Bush, while the Mayor and Goveror sat silent and did nothing.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "dman1948"
    }, 
    {
        "content": "I think I am going to go vomit.", 
        "intTime": 20090430, 
        "postID": 47, 
        "quote": "", 
        "reply": "I think I am going to go vomit.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 14:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by sgt_posty: There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me. Well, we can agree on one thing, he gets so sympathy from me either... I think the lousy SIERRA OSCAR BRAVO should have been shot!... The thing is, this is about us, we are not animals like them, killing in the name of a god... We are way better than they are and torturing the scum is wrong... It IS about US, NOT about THEM... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 48, 
        "quote": "Originally posted by sgt_posty: There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "reply": " Well, we can agree on one thing, he gets so sympathy from me either... I think the lousy SIERRA OSCAR BRAVO should have been shot!... The thing is, this is about us, we are not animals like them, killing in the name of a god... We are way better than they are and torturing the scum is wrong... It IS about US, NOT about THEM... Respectfully, SUNLINER81", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 15:05:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "intTime": 20090430, 
        "postID": 49, 
        "quote": "", 
        "reply": "Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 17:48:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "ACR26"
    }, 
    {
        "content": "On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "intTime": 20090430, 
        "postID": 50, 
        "quote": "", 
        "reply": "On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:04:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math? Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 07:02 PM", 
        "intTime": 20090430, 
        "postID": 51, 
        "quote": "Originally posted by ACR26: Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "reply": " Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 07:02 PM", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:41:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden. All kinds of people on here keep trying to give all kinds of analogies, so o.k., here's one... A little kid is kidnapped and is put in a box with limited air... The police have the kidnapper in custody and he just laughs at them and says that there isn't a thing that you can do to make him talk... YOU get a hold of this used scum sack and you break out your razor sharp K-bar and slowly start to skin this jackzz alive, eventually he talks and the kid is rescued alive... They take the scum to the hospital but, he dies... Not only is the kid rescued but, you are arrested and the charge is murder... The kid is rescued and you are charged with murder, you admit it and they lock you up and throw away the key... But, you keep saying the kid was rescued, I saved that kid, I got the guy to talk... You still go to jail for twenty-five to life for murder and you can't understand why... Do you see the point now?... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 52, 
        "quote": "Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "reply": " All kinds of people on here keep trying to give all kinds of analogies, so o.k., here's one... A little kid is kidnapped and is put in a box with limited air... The police have the kidnapper in custody and he just laughs at them and says that there isn't a thing that you can do to make him talk... YOU get a hold of this used scum sack and you break out your razor sharp K-bar and slowly start to skin this jackzz alive, eventually he talks and the kid is rescued alive... They take the scum to the hospital but, he dies... Not only is the kid rescued but, you are arrested and the charge is murder... The kid is rescued and you are charged with murder, you admit it and they lock you up and throw away the key... But, you keep saying the kid was rescued, I saved that kid, I got the guy to talk... You still go to jail for twenty-five to life for murder and you can't understand why... Do you see the point now?... Respectfully, SUNLINER81", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:48:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "intTime": 20090430, 
        "postID": 53, 
        "quote": "", 
        "reply": "And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 19:42:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed. These puke bags are told if captured to ALWAYS make up stuff if and when they are released. It is part of the psychological game the terrorists plays. They know that weak minded liberals will always fall for the bleeding heart story and it plays into their plans. You can treat them like a royal dignitary and they will still say they were beaten and tortured. If ANYONE says they were treated badly at GITMO then they are a GOD DAMNED LIAR. The detainees there were treated much better than American citizens are in US prisons. The food they received was often better than the troops guarding them. As rayevinsonsr pointed out, this swine dung \"clerk\" gave up some really big fish and info that led to the discovery of the LAX plot.", 
        "intTime": 20090430, 
        "postID": 54, 
        "quote": "Originally posted by peter3_1: And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "reply": " These puke bags are told if captured to ALWAYS make up stuff if and when they are released. It is part of the psychological game the terrorists plays. They know that weak minded liberals will always fall for the bleeding heart story and it plays into their plans. You can treat them like a royal dignitary and they will still say they were beaten and tortured. If ANYONE says they were treated badly at GITMO then they are a GOD DAMNED LIAR. The detainees there were treated much better than American citizens are in US prisons. The food they received was often better than the troops guarding them. As rayevinsonsr pointed out, this swine dung \"clerk\" gave up some really big fish and info that led to the discovery of the LAX plot.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 20:20:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. Where there is nothing specifically mentioned there is no treaty requirement. The GC was very specific and the issue that allowed Bush and lawyers to conduct EI was that fact. If the type of \"combatants\" are not specifically mentioned then there is no treaty in respect to the persons at issue. Ol Abu should do the world a favor and check himself out.", 
        "intTime": 20090430, 
        "postID": 55, 
        "quote": "Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81", 
        "reply": " Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. Where there is nothing specifically mentioned there is no treaty requirement. The GC was very specific and the issue that allowed Bush and lawyers to conduct EI was that fact. If the type of \"combatants\" are not specifically mentioned then there is no treaty in respect to the persons at issue. Ol Abu should do the world a favor and check himself out.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 20:25:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by NSNN: McCain was right: It's about who we are. And we are not people who do this to another human being. McCain is a traitor and a terrorist sympathizer!! What does he know about torture!?!?!", 
        "intTime": 20090501, 
        "postID": 56, 
        "quote": "Originally posted by NSNN: McCain was right: It's about who we are. And we are not people who do this to another human being.", 
        "reply": " McCain is a traitor and a terrorist sympathizer!! What does he know about torture!?!?!", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 01:14:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. If they're not combatants then they're common criminals.", 
        "intTime": 20090501, 
        "postID": 57, 
        "quote": "Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types.", 
        "reply": " If they're not combatants then they're common criminals.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 01:40:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090501, 
        "postID": 58, 
        "quote": "Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 05:46:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "NSNN"
    }, 
    {
        "content": "When you think you're right, anything is possible. Ask Adolf.", 
        "intTime": 20090501, 
        "postID": 59, 
        "quote": "", 
        "reply": "When you think you're right, anything is possible. Ask Adolf.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 07:36:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due. We are the guys that saved the rest of the world on a number occasions, that has the mettle and audacity to cope with a situation that provides leadership. But above all, it save(s) American lives with whatever degree of torture, arrogance or meanness, you want to attach. If we have utilized the weapons and manpower that has killed hundreds of thousands of people in the past within days, this insisting waterboarding is going to bring the end of the world is preposterous! Saying that you would hurt someone for doing it ridiculous!", 
        "intTime": 20090501, 
        "postID": 60, 
        "quote": "Originally posted by NSNN: quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due.", 
        "reply": " We are the guys that saved the rest of the world on a number occasions, that has the mettle and audacity to cope with a situation that provides leadership. But above all, it save(s) American lives with whatever degree of torture, arrogance or meanness, you want to attach. If we have utilized the weapons and manpower that has killed hundreds of thousands of people in the past within days, this insisting waterboarding is going to bring the end of the world is preposterous! Saying that you would hurt someone for doing it ridiculous!", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 10:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Lately, we've heard and read much about torture memos, waterboarding and insects in a box. It has been the occasion for somber reflection on our past and serious deliberation about our future. This is as it should be. It was Arizona Sen. John McCain, in talking about torture, who rightly reminded us that \"it's not about who they are. It's about who we are.\" But perhaps we also should remember that there was a human being strapped to that board. His name is Zayn al Abidin Mohamed Hussein, known to the world as Abu Zubaydah. He was arrested in Pakistan in March 2002. Because the Bush administration believed him to be a senior Al Qaeda operative, his detention and interrogation produced a fistful of firsts. As far as we can tell, he is the only prisoner in U.S. history whose interrogation was the subject of debate and direct authorization within the White House, and the first to disappear into a secret CIA \"black site.\" He was the first prisoner in the \"war on terror\" to experience the full gamut of ancient techniques adapted by the communists in Korea and, 50 years later, approved by the Justice Department in Washington. He was the first prisoner to have his interrogations captured on videotape -- a practice the CIA ended in late 2002. Two years later, the agency destroyed 90 videotapes of Abu Zubaydah's interrogations, which resulted in a criminal investigation of government officials connected with the program. Many questions about his interrogation remain unanswered, but two legs of the three-legged stool are firmly in place. First, they beat him. As authorized by the Justice Department and confirmed by the Red Cross, they wrapped a collar around his neck and smashed him over and over against a wall. They forced his body into a tiny, pitch-dark box and left him for hours. They stripped him naked and suspended him from hooks in the ceiling. They kept him awake for days. And they strapped him to an inverted board and poured water over his covered nose and mouth to \"produce the sensation of suffocation and incipient panic.\" Eighty-three times. I leave it to others to debate whether we should call this torture. I am content with the self-evident truth that it was wrong. Second, his treatment was motivated by the bane of our post-9/11 world: rotten intel. The beat him because they believed he was evil. Not long after his arrest, President Bush described him as \"one of the top three leaders\" in Al Qaeda and \"Al Qaeda's chief of operations.\" In fact, the CIA brass at Langley, Va., ordered his interrogators to keep at it long after the latter warned that he had been wrung dry. But Abu Zubaydah, we now understand, was nothing like what the president believed. He was never Al Qaeda. The journalist Ron Suskind was the first to ask the right questions. In his 2006 book, \"The One Percent Doctrine,\" he described Abu Zubaydah as a minor logistics man, a travel agent. Later and more detailed reporting in the Washington Post, quoting Justice Department officials, said he provided \"above-ground support. ... To make him the mastermind of anything is ridiculous.\" More recently, the New York Times, relying on current and former intelligence officers, said the initial assessment was \"highly inflated\" and reflected \"a profound misunderstanding\" of Abu Zubaydah. Far from a leader, he was \"a personnel clerk.\" So two legs of the stool are fixed: They tormented a clerk. But there is a third leg that should not be left out. No one can pass unscathed through an ordeal like this. Abu Zubaydah paid with his mind. Partly as a result of injuries he suffered while he was fighting the communists in Afghanistan, partly as a result of how those injuries were exacerbated by the CIA and partly as a result of his extended isolation, Abu Zubaydah's mental grasp is slipping away. Today, he suffers blinding headaches and has permanent brain damage. He has an excruciating sensitivity to sounds, hearing what others do not. The slightest noise drives him nearly insane. In the last two years alone, he has experienced about 200 seizures. But physical pain is a passing thing. The enduring torment is the taunting reminder that darkness encroaches. Already, he cannot picture his mother's face or recall his father's name. Gradually, his past, like his future, eludes him. McCain was right: It's about who we are. And we are not people who do this to another human being. +http://www.latimes.com/news/opinion/la-oe-margulies30-2009apr30,0,3309097.story \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 61, 
        "quote": "Lately, we've heard and read much about torture memos, waterboarding and insects in a box. It has been the occasion for somber reflection on our past and serious deliberation about our future. This is as it should be. It was Arizona Sen. John McCain, in talking about torture, who rightly reminded us that \"it's not about who they are. It's about who we are.\" But perhaps we also should remember that there was a human being strapped to that board. His name is Zayn al Abidin Mohamed Hussein, known to the world as Abu Zubaydah. He was arrested in Pakistan in March 2002. Because the Bush administration believed him to be a senior Al Qaeda operative, his detention and interrogation produced a fistful of firsts. As far as we can tell, he is the only prisoner in U.S. history whose interrogation was the subject of debate and direct authorization within the White House, and the first to disappear into a secret CIA \"black site.\" He was the first prisoner in the \"war on terror\" to experience the full gamut of ancient techniques adapted by the communists in Korea and, 50 years later, approved by the Justice Department in Washington. He was the first prisoner to have his interrogations captured on videotape -- a practice the CIA ended in late 2002. Two years later, the agency destroyed 90 videotapes of Abu Zubaydah's interrogations, which resulted in a criminal investigation of government officials connected with the program. Many questions about his interrogation remain unanswered, but two legs of the three-legged stool are firmly in place. First, they beat him. As authorized by the Justice Department and confirmed by the Red Cross, they wrapped a collar around his neck and smashed him over and over against a wall. They forced his body into a tiny, pitch-dark box and left him for hours. They stripped him naked and suspended him from hooks in the ceiling. They kept him awake for days. And they strapped him to an inverted board and poured water over his covered nose and mouth to \"produce the sensation of suffocation and incipient panic.\" Eighty-three times. I leave it to others to debate whether we should call this torture. I am content with the self-evident truth that it was wrong. Second, his treatment was motivated by the bane of our post-9/11 world: rotten intel. The beat him because they believed he was evil. Not long after his arrest, President Bush described him as \"one of the top three leaders\" in Al Qaeda and \"Al Qaeda's chief of operations.\" In fact, the CIA brass at Langley, Va., ordered his interrogators to keep at it long after the latter warned that he had been wrung dry. But Abu Zubaydah, we now understand, was nothing like what the president believed. He was never Al Qaeda. The journalist Ron Suskind was the first to ask the right questions. In his 2006 book, \"The One Percent Doctrine,\" he described Abu Zubaydah as a minor logistics man, a travel agent. Later and more detailed reporting in the Washington Post, quoting Justice Department officials, said he provided \"above-ground support. ... To make him the mastermind of anything is ridiculous.\" More recently, the New York Times, relying on current and former intelligence officers, said the initial assessment was \"highly inflated\" and reflected \"a profound misunderstanding\" of Abu Zubaydah. Far from a leader, he was \"a personnel clerk.\" So two legs of the stool are fixed: They tormented a clerk. But there is a third leg that should not be left out. No one can pass unscathed through an ordeal like this. Abu Zubaydah paid with his mind. Partly as a result of injuries he suffered while he was fighting the communists in Afghanistan, partly as a result of how those injuries were exacerbated by the CIA and partly as a result of his extended isolation, Abu Zubaydah's mental grasp is slipping away. Today, he suffers blinding headaches and has permanent brain damage. He has an excruciating sensitivity to sounds, hearing what others do not. The slightest noise drives him nearly insane. In the last two years alone, he has experienced about 200 seizures. But physical pain is a passing thing. The enduring torment is the taunting reminder that darkness encroaches. Already, he cannot picture his mother's face or recall his father's name. Gradually, his past, like his future, eludes him. McCain was right: It's about who we are. And we are not people who do this to another human being.", 
        "reply": " +http://www.latimes.com/news/opinion/la-oe-margulies30-2009apr30,0,3309097.story \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 06:06:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "NSNN"
    }, 
    {
        "content": "My heart FREAKIN' BLEEDS..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090430, 
        "postID": 62, 
        "quote": "", 
        "reply": "My heart FREAKIN' BLEEDS..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:31:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "Awwwww.. the poor jihadi.", 
        "intTime": 20090430, 
        "postID": 63, 
        "quote": "", 
        "reply": "Awwwww.. the poor jihadi.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:34:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "We are Americans. If someone deserves death, we hang them or we shoot them - We do NOT sit around a table and disect them like frogs. You think this guy is as bad as Ted Bundy? John Wayne Gacy, who raped and murdered 40 odd kids in Chicago? Screw this guy - should have been shot - But it's American who are the ones doing THIS bit of disecting. You bet, you don't do this to a human being without getting covered in schit. quote: “We are America! I don’t give a rats azz if it helps! We do not *******g torture!” Shepherd Smith Dave", 
        "intTime": 20090430, 
        "postID": 64, 
        "quote": "“We are America! I don’t give a rats azz if it helps! We do not *******g torture!” Shepherd Smith", 
        "reply": "We are Americans. If someone deserves death, we hang them or we shoot them - We do NOT sit around a table and disect them like frogs. You think this guy is as bad as Ted Bundy? John Wayne Gacy, who raped and murdered 40 odd kids in Chicago? Screw this guy - should have been shot - But it's American who are the ones doing THIS bit of disecting. You bet, you don't do this to a human being without getting covered in schit.  Dave", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:40:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "Grachus"
    }, 
    {
        "content": "There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "intTime": 20090430, 
        "postID": 65, 
        "quote": "", 
        "reply": "There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:51:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "I say lets water board Shepherd Smith!!!! He now makes 7 million a yr for screaming in N.O. after the hurracane..(sp). Blaming it all on Bush, while the Mayor and Goveror sat silent and did nothing.", 
        "intTime": 20090430, 
        "postID": 66, 
        "quote": "", 
        "reply": "I say lets water board Shepherd Smith!!!! He now makes 7 million a yr for screaming in N.O. after the hurracane..(sp). Blaming it all on Bush, while the Mayor and Goveror sat silent and did nothing.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "dman1948"
    }, 
    {
        "content": "I think I am going to go vomit.", 
        "intTime": 20090430, 
        "postID": 67, 
        "quote": "", 
        "reply": "I think I am going to go vomit.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 14:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by sgt_posty: There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me. Well, we can agree on one thing, he gets so sympathy from me either... I think the lousy SIERRA OSCAR BRAVO should have been shot!... The thing is, this is about us, we are not animals like them, killing in the name of a god... We are way better than they are and torturing the scum is wrong... It IS about US, NOT about THEM... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 68, 
        "quote": "Originally posted by sgt_posty: There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "reply": " Well, we can agree on one thing, he gets so sympathy from me either... I think the lousy SIERRA OSCAR BRAVO should have been shot!... The thing is, this is about us, we are not animals like them, killing in the name of a god... We are way better than they are and torturing the scum is wrong... It IS about US, NOT about THEM... Respectfully, SUNLINER81", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 15:05:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "intTime": 20090430, 
        "postID": 69, 
        "quote": "", 
        "reply": "Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 17:48:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "ACR26"
    }, 
    {
        "content": "On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "intTime": 20090430, 
        "postID": 70, 
        "quote": "", 
        "reply": "On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:04:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math? Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 07:02 PM", 
        "intTime": 20090430, 
        "postID": 71, 
        "quote": "Originally posted by ACR26: Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "reply": " Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 07:02 PM", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:41:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden. All kinds of people on here keep trying to give all kinds of analogies, so o.k., here's one... A little kid is kidnapped and is put in a box with limited air... The police have the kidnapper in custody and he just laughs at them and says that there isn't a thing that you can do to make him talk... YOU get a hold of this used scum sack and you break out your razor sharp K-bar and slowly start to skin this jackzz alive, eventually he talks and the kid is rescued alive... They take the scum to the hospital but, he dies... Not only is the kid rescued but, you are arrested and the charge is murder... The kid is rescued and you are charged with murder, you admit it and they lock you up and throw away the key... But, you keep saying the kid was rescued, I saved that kid, I got the guy to talk... You still go to jail for twenty-five to life for murder and you can't understand why... Do you see the point now?... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 72, 
        "quote": "Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "reply": " All kinds of people on here keep trying to give all kinds of analogies, so o.k., here's one... A little kid is kidnapped and is put in a box with limited air... The police have the kidnapper in custody and he just laughs at them and says that there isn't a thing that you can do to make him talk... YOU get a hold of this used scum sack and you break out your razor sharp K-bar and slowly start to skin this jackzz alive, eventually he talks and the kid is rescued alive... They take the scum to the hospital but, he dies... Not only is the kid rescued but, you are arrested and the charge is murder... The kid is rescued and you are charged with murder, you admit it and they lock you up and throw away the key... But, you keep saying the kid was rescued, I saved that kid, I got the guy to talk... You still go to jail for twenty-five to life for murder and you can't understand why... Do you see the point now?... Respectfully, SUNLINER81", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:48:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "intTime": 20090430, 
        "postID": 73, 
        "quote": "", 
        "reply": "And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 19:42:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed. These puke bags are told if captured to ALWAYS make up stuff if and when they are released. It is part of the psychological game the terrorists plays. They know that weak minded liberals will always fall for the bleeding heart story and it plays into their plans. You can treat them like a royal dignitary and they will still say they were beaten and tortured. If ANYONE says they were treated badly at GITMO then they are a GOD DAMNED LIAR. The detainees there were treated much better than American citizens are in US prisons. The food they received was often better than the troops guarding them. As rayevinsonsr pointed out, this swine dung \"clerk\" gave up some really big fish and info that led to the discovery of the LAX plot.", 
        "intTime": 20090430, 
        "postID": 74, 
        "quote": "Originally posted by peter3_1: And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "reply": " These puke bags are told if captured to ALWAYS make up stuff if and when they are released. It is part of the psychological game the terrorists plays. They know that weak minded liberals will always fall for the bleeding heart story and it plays into their plans. You can treat them like a royal dignitary and they will still say they were beaten and tortured. If ANYONE says they were treated badly at GITMO then they are a GOD DAMNED LIAR. The detainees there were treated much better than American citizens are in US prisons. The food they received was often better than the troops guarding them. As rayevinsonsr pointed out, this swine dung \"clerk\" gave up some really big fish and info that led to the discovery of the LAX plot.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 20:20:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. Where there is nothing specifically mentioned there is no treaty requirement. The GC was very specific and the issue that allowed Bush and lawyers to conduct EI was that fact. If the type of \"combatants\" are not specifically mentioned then there is no treaty in respect to the persons at issue. Ol Abu should do the world a favor and check himself out.", 
        "intTime": 20090430, 
        "postID": 75, 
        "quote": "Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81", 
        "reply": " Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. Where there is nothing specifically mentioned there is no treaty requirement. The GC was very specific and the issue that allowed Bush and lawyers to conduct EI was that fact. If the type of \"combatants\" are not specifically mentioned then there is no treaty in respect to the persons at issue. Ol Abu should do the world a favor and check himself out.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 20:25:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by NSNN: McCain was right: It's about who we are. And we are not people who do this to another human being. McCain is a traitor and a terrorist sympathizer!! What does he know about torture!?!?!", 
        "intTime": 20090501, 
        "postID": 76, 
        "quote": "Originally posted by NSNN: McCain was right: It's about who we are. And we are not people who do this to another human being.", 
        "reply": " McCain is a traitor and a terrorist sympathizer!! What does he know about torture!?!?!", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 01:14:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. If they're not combatants then they're common criminals.", 
        "intTime": 20090501, 
        "postID": 77, 
        "quote": "Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types.", 
        "reply": " If they're not combatants then they're common criminals.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 01:40:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090501, 
        "postID": 78, 
        "quote": "Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 05:46:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "NSNN"
    }, 
    {
        "content": "When you think you're right, anything is possible. Ask Adolf.", 
        "intTime": 20090501, 
        "postID": 79, 
        "quote": "", 
        "reply": "When you think you're right, anything is possible. Ask Adolf.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 07:36:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due. We are the guys that saved the rest of the world on a number occasions, that has the mettle and audacity to cope with a situation that provides leadership. But above all, it save(s) American lives with whatever degree of torture, arrogance or meanness, you want to attach. If we have utilized the weapons and manpower that has killed hundreds of thousands of people in the past within days, this insisting waterboarding is going to bring the end of the world is preposterous! Saying that you would hurt someone for doing it ridiculous!", 
        "intTime": 20090501, 
        "postID": 80, 
        "quote": "Originally posted by NSNN: quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due.", 
        "reply": " We are the guys that saved the rest of the world on a number occasions, that has the mettle and audacity to cope with a situation that provides leadership. But above all, it save(s) American lives with whatever degree of torture, arrogance or meanness, you want to attach. If we have utilized the weapons and manpower that has killed hundreds of thousands of people in the past within days, this insisting waterboarding is going to bring the end of the world is preposterous! Saying that you would hurt someone for doing it ridiculous!", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 10:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Lately, we've heard and read much about torture memos, waterboarding and insects in a box. It has been the occasion for somber reflection on our past and serious deliberation about our future. This is as it should be. It was Arizona Sen. John McCain, in talking about torture, who rightly reminded us that \"it's not about who they are. It's about who we are.\" But perhaps we also should remember that there was a human being strapped to that board. His name is Zayn al Abidin Mohamed Hussein, known to the world as Abu Zubaydah. He was arrested in Pakistan in March 2002. Because the Bush administration believed him to be a senior Al Qaeda operative, his detention and interrogation produced a fistful of firsts. As far as we can tell, he is the only prisoner in U.S. history whose interrogation was the subject of debate and direct authorization within the White House, and the first to disappear into a secret CIA \"black site.\" He was the first prisoner in the \"war on terror\" to experience the full gamut of ancient techniques adapted by the communists in Korea and, 50 years later, approved by the Justice Department in Washington. He was the first prisoner to have his interrogations captured on videotape -- a practice the CIA ended in late 2002. Two years later, the agency destroyed 90 videotapes of Abu Zubaydah's interrogations, which resulted in a criminal investigation of government officials connected with the program. Many questions about his interrogation remain unanswered, but two legs of the three-legged stool are firmly in place. First, they beat him. As authorized by the Justice Department and confirmed by the Red Cross, they wrapped a collar around his neck and smashed him over and over against a wall. They forced his body into a tiny, pitch-dark box and left him for hours. They stripped him naked and suspended him from hooks in the ceiling. They kept him awake for days. And they strapped him to an inverted board and poured water over his covered nose and mouth to \"produce the sensation of suffocation and incipient panic.\" Eighty-three times. I leave it to others to debate whether we should call this torture. I am content with the self-evident truth that it was wrong. Second, his treatment was motivated by the bane of our post-9/11 world: rotten intel. The beat him because they believed he was evil. Not long after his arrest, President Bush described him as \"one of the top three leaders\" in Al Qaeda and \"Al Qaeda's chief of operations.\" In fact, the CIA brass at Langley, Va., ordered his interrogators to keep at it long after the latter warned that he had been wrung dry. But Abu Zubaydah, we now understand, was nothing like what the president believed. He was never Al Qaeda. The journalist Ron Suskind was the first to ask the right questions. In his 2006 book, \"The One Percent Doctrine,\" he described Abu Zubaydah as a minor logistics man, a travel agent. Later and more detailed reporting in the Washington Post, quoting Justice Department officials, said he provided \"above-ground support. ... To make him the mastermind of anything is ridiculous.\" More recently, the New York Times, relying on current and former intelligence officers, said the initial assessment was \"highly inflated\" and reflected \"a profound misunderstanding\" of Abu Zubaydah. Far from a leader, he was \"a personnel clerk.\" So two legs of the stool are fixed: They tormented a clerk. But there is a third leg that should not be left out. No one can pass unscathed through an ordeal like this. Abu Zubaydah paid with his mind. Partly as a result of injuries he suffered while he was fighting the communists in Afghanistan, partly as a result of how those injuries were exacerbated by the CIA and partly as a result of his extended isolation, Abu Zubaydah's mental grasp is slipping away. Today, he suffers blinding headaches and has permanent brain damage. He has an excruciating sensitivity to sounds, hearing what others do not. The slightest noise drives him nearly insane. In the last two years alone, he has experienced about 200 seizures. But physical pain is a passing thing. The enduring torment is the taunting reminder that darkness encroaches. Already, he cannot picture his mother's face or recall his father's name. Gradually, his past, like his future, eludes him. McCain was right: It's about who we are. And we are not people who do this to another human being. +http://www.latimes.com/news/opinion/la-oe-margulies30-2009apr30,0,3309097.story \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 81, 
        "quote": "Lately, we've heard and read much about torture memos, waterboarding and insects in a box. It has been the occasion for somber reflection on our past and serious deliberation about our future. This is as it should be. It was Arizona Sen. John McCain, in talking about torture, who rightly reminded us that \"it's not about who they are. It's about who we are.\" But perhaps we also should remember that there was a human being strapped to that board. His name is Zayn al Abidin Mohamed Hussein, known to the world as Abu Zubaydah. He was arrested in Pakistan in March 2002. Because the Bush administration believed him to be a senior Al Qaeda operative, his detention and interrogation produced a fistful of firsts. As far as we can tell, he is the only prisoner in U.S. history whose interrogation was the subject of debate and direct authorization within the White House, and the first to disappear into a secret CIA \"black site.\" He was the first prisoner in the \"war on terror\" to experience the full gamut of ancient techniques adapted by the communists in Korea and, 50 years later, approved by the Justice Department in Washington. He was the first prisoner to have his interrogations captured on videotape -- a practice the CIA ended in late 2002. Two years later, the agency destroyed 90 videotapes of Abu Zubaydah's interrogations, which resulted in a criminal investigation of government officials connected with the program. Many questions about his interrogation remain unanswered, but two legs of the three-legged stool are firmly in place. First, they beat him. As authorized by the Justice Department and confirmed by the Red Cross, they wrapped a collar around his neck and smashed him over and over against a wall. They forced his body into a tiny, pitch-dark box and left him for hours. They stripped him naked and suspended him from hooks in the ceiling. They kept him awake for days. And they strapped him to an inverted board and poured water over his covered nose and mouth to \"produce the sensation of suffocation and incipient panic.\" Eighty-three times. I leave it to others to debate whether we should call this torture. I am content with the self-evident truth that it was wrong. Second, his treatment was motivated by the bane of our post-9/11 world: rotten intel. The beat him because they believed he was evil. Not long after his arrest, President Bush described him as \"one of the top three leaders\" in Al Qaeda and \"Al Qaeda's chief of operations.\" In fact, the CIA brass at Langley, Va., ordered his interrogators to keep at it long after the latter warned that he had been wrung dry. But Abu Zubaydah, we now understand, was nothing like what the president believed. He was never Al Qaeda. The journalist Ron Suskind was the first to ask the right questions. In his 2006 book, \"The One Percent Doctrine,\" he described Abu Zubaydah as a minor logistics man, a travel agent. Later and more detailed reporting in the Washington Post, quoting Justice Department officials, said he provided \"above-ground support. ... To make him the mastermind of anything is ridiculous.\" More recently, the New York Times, relying on current and former intelligence officers, said the initial assessment was \"highly inflated\" and reflected \"a profound misunderstanding\" of Abu Zubaydah. Far from a leader, he was \"a personnel clerk.\" So two legs of the stool are fixed: They tormented a clerk. But there is a third leg that should not be left out. No one can pass unscathed through an ordeal like this. Abu Zubaydah paid with his mind. Partly as a result of injuries he suffered while he was fighting the communists in Afghanistan, partly as a result of how those injuries were exacerbated by the CIA and partly as a result of his extended isolation, Abu Zubaydah's mental grasp is slipping away. Today, he suffers blinding headaches and has permanent brain damage. He has an excruciating sensitivity to sounds, hearing what others do not. The slightest noise drives him nearly insane. In the last two years alone, he has experienced about 200 seizures. But physical pain is a passing thing. The enduring torment is the taunting reminder that darkness encroaches. Already, he cannot picture his mother's face or recall his father's name. Gradually, his past, like his future, eludes him. McCain was right: It's about who we are. And we are not people who do this to another human being.", 
        "reply": " +http://www.latimes.com/news/opinion/la-oe-margulies30-2009apr30,0,3309097.story \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 06:06:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "NSNN"
    }, 
    {
        "content": "My heart FREAKIN' BLEEDS..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090430, 
        "postID": 82, 
        "quote": "", 
        "reply": "My heart FREAKIN' BLEEDS..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:31:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "Awwwww.. the poor jihadi.", 
        "intTime": 20090430, 
        "postID": 83, 
        "quote": "", 
        "reply": "Awwwww.. the poor jihadi.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:34:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "We are Americans. If someone deserves death, we hang them or we shoot them - We do NOT sit around a table and disect them like frogs. You think this guy is as bad as Ted Bundy? John Wayne Gacy, who raped and murdered 40 odd kids in Chicago? Screw this guy - should have been shot - But it's American who are the ones doing THIS bit of disecting. You bet, you don't do this to a human being without getting covered in schit. quote: “We are America! I don’t give a rats azz if it helps! We do not *******g torture!” Shepherd Smith Dave", 
        "intTime": 20090430, 
        "postID": 84, 
        "quote": "“We are America! I don’t give a rats azz if it helps! We do not *******g torture!” Shepherd Smith", 
        "reply": "We are Americans. If someone deserves death, we hang them or we shoot them - We do NOT sit around a table and disect them like frogs. You think this guy is as bad as Ted Bundy? John Wayne Gacy, who raped and murdered 40 odd kids in Chicago? Screw this guy - should have been shot - But it's American who are the ones doing THIS bit of disecting. You bet, you don't do this to a human being without getting covered in schit.  Dave", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:40:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "Grachus"
    }, 
    {
        "content": "There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "intTime": 20090430, 
        "postID": 85, 
        "quote": "", 
        "reply": "There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:51:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "I say lets water board Shepherd Smith!!!! He now makes 7 million a yr for screaming in N.O. after the hurracane..(sp). Blaming it all on Bush, while the Mayor and Goveror sat silent and did nothing.", 
        "intTime": 20090430, 
        "postID": 86, 
        "quote": "", 
        "reply": "I say lets water board Shepherd Smith!!!! He now makes 7 million a yr for screaming in N.O. after the hurracane..(sp). Blaming it all on Bush, while the Mayor and Goveror sat silent and did nothing.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "dman1948"
    }, 
    {
        "content": "I think I am going to go vomit.", 
        "intTime": 20090430, 
        "postID": 87, 
        "quote": "", 
        "reply": "I think I am going to go vomit.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 14:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by sgt_posty: There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me. Well, we can agree on one thing, he gets so sympathy from me either... I think the lousy SIERRA OSCAR BRAVO should have been shot!... The thing is, this is about us, we are not animals like them, killing in the name of a god... We are way better than they are and torturing the scum is wrong... It IS about US, NOT about THEM... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 88, 
        "quote": "Originally posted by sgt_posty: There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "reply": " Well, we can agree on one thing, he gets so sympathy from me either... I think the lousy SIERRA OSCAR BRAVO should have been shot!... The thing is, this is about us, we are not animals like them, killing in the name of a god... We are way better than they are and torturing the scum is wrong... It IS about US, NOT about THEM... Respectfully, SUNLINER81", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 15:05:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "intTime": 20090430, 
        "postID": 89, 
        "quote": "", 
        "reply": "Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 17:48:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "ACR26"
    }, 
    {
        "content": "On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "intTime": 20090430, 
        "postID": 90, 
        "quote": "", 
        "reply": "On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:04:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math? Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 07:02 PM", 
        "intTime": 20090430, 
        "postID": 91, 
        "quote": "Originally posted by ACR26: Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "reply": " Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 07:02 PM", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:41:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden. All kinds of people on here keep trying to give all kinds of analogies, so o.k., here's one... A little kid is kidnapped and is put in a box with limited air... The police have the kidnapper in custody and he just laughs at them and says that there isn't a thing that you can do to make him talk... YOU get a hold of this used scum sack and you break out your razor sharp K-bar and slowly start to skin this jackzz alive, eventually he talks and the kid is rescued alive... They take the scum to the hospital but, he dies... Not only is the kid rescued but, you are arrested and the charge is murder... The kid is rescued and you are charged with murder, you admit it and they lock you up and throw away the key... But, you keep saying the kid was rescued, I saved that kid, I got the guy to talk... You still go to jail for twenty-five to life for murder and you can't understand why... Do you see the point now?... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 92, 
        "quote": "Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "reply": " All kinds of people on here keep trying to give all kinds of analogies, so o.k., here's one... A little kid is kidnapped and is put in a box with limited air... The police have the kidnapper in custody and he just laughs at them and says that there isn't a thing that you can do to make him talk... YOU get a hold of this used scum sack and you break out your razor sharp K-bar and slowly start to skin this jackzz alive, eventually he talks and the kid is rescued alive... They take the scum to the hospital but, he dies... Not only is the kid rescued but, you are arrested and the charge is murder... The kid is rescued and you are charged with murder, you admit it and they lock you up and throw away the key... But, you keep saying the kid was rescued, I saved that kid, I got the guy to talk... You still go to jail for twenty-five to life for murder and you can't understand why... Do you see the point now?... Respectfully, SUNLINER81", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:48:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "intTime": 20090430, 
        "postID": 93, 
        "quote": "", 
        "reply": "And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 19:42:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed. These puke bags are told if captured to ALWAYS make up stuff if and when they are released. It is part of the psychological game the terrorists plays. They know that weak minded liberals will always fall for the bleeding heart story and it plays into their plans. You can treat them like a royal dignitary and they will still say they were beaten and tortured. If ANYONE says they were treated badly at GITMO then they are a GOD DAMNED LIAR. The detainees there were treated much better than American citizens are in US prisons. The food they received was often better than the troops guarding them. As rayevinsonsr pointed out, this swine dung \"clerk\" gave up some really big fish and info that led to the discovery of the LAX plot.", 
        "intTime": 20090430, 
        "postID": 94, 
        "quote": "Originally posted by peter3_1: And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "reply": " These puke bags are told if captured to ALWAYS make up stuff if and when they are released. It is part of the psychological game the terrorists plays. They know that weak minded liberals will always fall for the bleeding heart story and it plays into their plans. You can treat them like a royal dignitary and they will still say they were beaten and tortured. If ANYONE says they were treated badly at GITMO then they are a GOD DAMNED LIAR. The detainees there were treated much better than American citizens are in US prisons. The food they received was often better than the troops guarding them. As rayevinsonsr pointed out, this swine dung \"clerk\" gave up some really big fish and info that led to the discovery of the LAX plot.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 20:20:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. Where there is nothing specifically mentioned there is no treaty requirement. The GC was very specific and the issue that allowed Bush and lawyers to conduct EI was that fact. If the type of \"combatants\" are not specifically mentioned then there is no treaty in respect to the persons at issue. Ol Abu should do the world a favor and check himself out.", 
        "intTime": 20090430, 
        "postID": 95, 
        "quote": "Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81", 
        "reply": " Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. Where there is nothing specifically mentioned there is no treaty requirement. The GC was very specific and the issue that allowed Bush and lawyers to conduct EI was that fact. If the type of \"combatants\" are not specifically mentioned then there is no treaty in respect to the persons at issue. Ol Abu should do the world a favor and check himself out.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 20:25:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by NSNN: McCain was right: It's about who we are. And we are not people who do this to another human being. McCain is a traitor and a terrorist sympathizer!! What does he know about torture!?!?!", 
        "intTime": 20090501, 
        "postID": 96, 
        "quote": "Originally posted by NSNN: McCain was right: It's about who we are. And we are not people who do this to another human being.", 
        "reply": " McCain is a traitor and a terrorist sympathizer!! What does he know about torture!?!?!", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 01:14:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. If they're not combatants then they're common criminals.", 
        "intTime": 20090501, 
        "postID": 97, 
        "quote": "Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types.", 
        "reply": " If they're not combatants then they're common criminals.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 01:40:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090501, 
        "postID": 98, 
        "quote": "Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 05:46:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "NSNN"
    }, 
    {
        "content": "When you think you're right, anything is possible. Ask Adolf.", 
        "intTime": 20090501, 
        "postID": 99, 
        "quote": "", 
        "reply": "When you think you're right, anything is possible. Ask Adolf.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 07:36:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due. We are the guys that saved the rest of the world on a number occasions, that has the mettle and audacity to cope with a situation that provides leadership. But above all, it save(s) American lives with whatever degree of torture, arrogance or meanness, you want to attach. If we have utilized the weapons and manpower that has killed hundreds of thousands of people in the past within days, this insisting waterboarding is going to bring the end of the world is preposterous! Saying that you would hurt someone for doing it ridiculous!", 
        "intTime": 20090501, 
        "postID": 100, 
        "quote": "Originally posted by NSNN: quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due.", 
        "reply": " We are the guys that saved the rest of the world on a number occasions, that has the mettle and audacity to cope with a situation that provides leadership. But above all, it save(s) American lives with whatever degree of torture, arrogance or meanness, you want to attach. If we have utilized the weapons and manpower that has killed hundreds of thousands of people in the past within days, this insisting waterboarding is going to bring the end of the world is preposterous! Saying that you would hurt someone for doing it ridiculous!", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 10:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Lately, we've heard and read much about torture memos, waterboarding and insects in a box. It has been the occasion for somber reflection on our past and serious deliberation about our future. This is as it should be. It was Arizona Sen. John McCain, in talking about torture, who rightly reminded us that \"it's not about who they are. It's about who we are.\" But perhaps we also should remember that there was a human being strapped to that board. His name is Zayn al Abidin Mohamed Hussein, known to the world as Abu Zubaydah. He was arrested in Pakistan in March 2002. Because the Bush administration believed him to be a senior Al Qaeda operative, his detention and interrogation produced a fistful of firsts. As far as we can tell, he is the only prisoner in U.S. history whose interrogation was the subject of debate and direct authorization within the White House, and the first to disappear into a secret CIA \"black site.\" He was the first prisoner in the \"war on terror\" to experience the full gamut of ancient techniques adapted by the communists in Korea and, 50 years later, approved by the Justice Department in Washington. He was the first prisoner to have his interrogations captured on videotape -- a practice the CIA ended in late 2002. Two years later, the agency destroyed 90 videotapes of Abu Zubaydah's interrogations, which resulted in a criminal investigation of government officials connected with the program. Many questions about his interrogation remain unanswered, but two legs of the three-legged stool are firmly in place. First, they beat him. As authorized by the Justice Department and confirmed by the Red Cross, they wrapped a collar around his neck and smashed him over and over against a wall. They forced his body into a tiny, pitch-dark box and left him for hours. They stripped him naked and suspended him from hooks in the ceiling. They kept him awake for days. And they strapped him to an inverted board and poured water over his covered nose and mouth to \"produce the sensation of suffocation and incipient panic.\" Eighty-three times. I leave it to others to debate whether we should call this torture. I am content with the self-evident truth that it was wrong. Second, his treatment was motivated by the bane of our post-9/11 world: rotten intel. The beat him because they believed he was evil. Not long after his arrest, President Bush described him as \"one of the top three leaders\" in Al Qaeda and \"Al Qaeda's chief of operations.\" In fact, the CIA brass at Langley, Va., ordered his interrogators to keep at it long after the latter warned that he had been wrung dry. But Abu Zubaydah, we now understand, was nothing like what the president believed. He was never Al Qaeda. The journalist Ron Suskind was the first to ask the right questions. In his 2006 book, \"The One Percent Doctrine,\" he described Abu Zubaydah as a minor logistics man, a travel agent. Later and more detailed reporting in the Washington Post, quoting Justice Department officials, said he provided \"above-ground support. ... To make him the mastermind of anything is ridiculous.\" More recently, the New York Times, relying on current and former intelligence officers, said the initial assessment was \"highly inflated\" and reflected \"a profound misunderstanding\" of Abu Zubaydah. Far from a leader, he was \"a personnel clerk.\" So two legs of the stool are fixed: They tormented a clerk. But there is a third leg that should not be left out. No one can pass unscathed through an ordeal like this. Abu Zubaydah paid with his mind. Partly as a result of injuries he suffered while he was fighting the communists in Afghanistan, partly as a result of how those injuries were exacerbated by the CIA and partly as a result of his extended isolation, Abu Zubaydah's mental grasp is slipping away. Today, he suffers blinding headaches and has permanent brain damage. He has an excruciating sensitivity to sounds, hearing what others do not. The slightest noise drives him nearly insane. In the last two years alone, he has experienced about 200 seizures. But physical pain is a passing thing. The enduring torment is the taunting reminder that darkness encroaches. Already, he cannot picture his mother's face or recall his father's name. Gradually, his past, like his future, eludes him. McCain was right: It's about who we are. And we are not people who do this to another human being. +http://www.latimes.com/news/opinion/la-oe-margulies30-2009apr30,0,3309097.story \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 101, 
        "quote": "Lately, we've heard and read much about torture memos, waterboarding and insects in a box. It has been the occasion for somber reflection on our past and serious deliberation about our future. This is as it should be. It was Arizona Sen. John McCain, in talking about torture, who rightly reminded us that \"it's not about who they are. It's about who we are.\" But perhaps we also should remember that there was a human being strapped to that board. His name is Zayn al Abidin Mohamed Hussein, known to the world as Abu Zubaydah. He was arrested in Pakistan in March 2002. Because the Bush administration believed him to be a senior Al Qaeda operative, his detention and interrogation produced a fistful of firsts. As far as we can tell, he is the only prisoner in U.S. history whose interrogation was the subject of debate and direct authorization within the White House, and the first to disappear into a secret CIA \"black site.\" He was the first prisoner in the \"war on terror\" to experience the full gamut of ancient techniques adapted by the communists in Korea and, 50 years later, approved by the Justice Department in Washington. He was the first prisoner to have his interrogations captured on videotape -- a practice the CIA ended in late 2002. Two years later, the agency destroyed 90 videotapes of Abu Zubaydah's interrogations, which resulted in a criminal investigation of government officials connected with the program. Many questions about his interrogation remain unanswered, but two legs of the three-legged stool are firmly in place. First, they beat him. As authorized by the Justice Department and confirmed by the Red Cross, they wrapped a collar around his neck and smashed him over and over against a wall. They forced his body into a tiny, pitch-dark box and left him for hours. They stripped him naked and suspended him from hooks in the ceiling. They kept him awake for days. And they strapped him to an inverted board and poured water over his covered nose and mouth to \"produce the sensation of suffocation and incipient panic.\" Eighty-three times. I leave it to others to debate whether we should call this torture. I am content with the self-evident truth that it was wrong. Second, his treatment was motivated by the bane of our post-9/11 world: rotten intel. The beat him because they believed he was evil. Not long after his arrest, President Bush described him as \"one of the top three leaders\" in Al Qaeda and \"Al Qaeda's chief of operations.\" In fact, the CIA brass at Langley, Va., ordered his interrogators to keep at it long after the latter warned that he had been wrung dry. But Abu Zubaydah, we now understand, was nothing like what the president believed. He was never Al Qaeda. The journalist Ron Suskind was the first to ask the right questions. In his 2006 book, \"The One Percent Doctrine,\" he described Abu Zubaydah as a minor logistics man, a travel agent. Later and more detailed reporting in the Washington Post, quoting Justice Department officials, said he provided \"above-ground support. ... To make him the mastermind of anything is ridiculous.\" More recently, the New York Times, relying on current and former intelligence officers, said the initial assessment was \"highly inflated\" and reflected \"a profound misunderstanding\" of Abu Zubaydah. Far from a leader, he was \"a personnel clerk.\" So two legs of the stool are fixed: They tormented a clerk. But there is a third leg that should not be left out. No one can pass unscathed through an ordeal like this. Abu Zubaydah paid with his mind. Partly as a result of injuries he suffered while he was fighting the communists in Afghanistan, partly as a result of how those injuries were exacerbated by the CIA and partly as a result of his extended isolation, Abu Zubaydah's mental grasp is slipping away. Today, he suffers blinding headaches and has permanent brain damage. He has an excruciating sensitivity to sounds, hearing what others do not. The slightest noise drives him nearly insane. In the last two years alone, he has experienced about 200 seizures. But physical pain is a passing thing. The enduring torment is the taunting reminder that darkness encroaches. Already, he cannot picture his mother's face or recall his father's name. Gradually, his past, like his future, eludes him. McCain was right: It's about who we are. And we are not people who do this to another human being.", 
        "reply": " +http://www.latimes.com/news/opinion/la-oe-margulies30-2009apr30,0,3309097.story \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 06:06:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "NSNN"
    }, 
    {
        "content": "My heart FREAKIN' BLEEDS..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090430, 
        "postID": 102, 
        "quote": "", 
        "reply": "My heart FREAKIN' BLEEDS..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:31:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "Awwwww.. the poor jihadi.", 
        "intTime": 20090430, 
        "postID": 103, 
        "quote": "", 
        "reply": "Awwwww.. the poor jihadi.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:34:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "We are Americans. If someone deserves death, we hang them or we shoot them - We do NOT sit around a table and disect them like frogs. You think this guy is as bad as Ted Bundy? John Wayne Gacy, who raped and murdered 40 odd kids in Chicago? Screw this guy - should have been shot - But it's American who are the ones doing THIS bit of disecting. You bet, you don't do this to a human being without getting covered in schit. quote: “We are America! I don’t give a rats azz if it helps! We do not *******g torture!” Shepherd Smith Dave", 
        "intTime": 20090430, 
        "postID": 104, 
        "quote": "“We are America! I don’t give a rats azz if it helps! We do not *******g torture!” Shepherd Smith", 
        "reply": "We are Americans. If someone deserves death, we hang them or we shoot them - We do NOT sit around a table and disect them like frogs. You think this guy is as bad as Ted Bundy? John Wayne Gacy, who raped and murdered 40 odd kids in Chicago? Screw this guy - should have been shot - But it's American who are the ones doing THIS bit of disecting. You bet, you don't do this to a human being without getting covered in schit.  Dave", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:40:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "Grachus"
    }, 
    {
        "content": "There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "intTime": 20090430, 
        "postID": 105, 
        "quote": "", 
        "reply": "There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:51:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "I say lets water board Shepherd Smith!!!! He now makes 7 million a yr for screaming in N.O. after the hurracane..(sp). Blaming it all on Bush, while the Mayor and Goveror sat silent and did nothing.", 
        "intTime": 20090430, 
        "postID": 106, 
        "quote": "", 
        "reply": "I say lets water board Shepherd Smith!!!! He now makes 7 million a yr for screaming in N.O. after the hurracane..(sp). Blaming it all on Bush, while the Mayor and Goveror sat silent and did nothing.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "dman1948"
    }, 
    {
        "content": "I think I am going to go vomit.", 
        "intTime": 20090430, 
        "postID": 107, 
        "quote": "", 
        "reply": "I think I am going to go vomit.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 14:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by sgt_posty: There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me. Well, we can agree on one thing, he gets so sympathy from me either... I think the lousy SIERRA OSCAR BRAVO should have been shot!... The thing is, this is about us, we are not animals like them, killing in the name of a god... We are way better than they are and torturing the scum is wrong... It IS about US, NOT about THEM... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 108, 
        "quote": "Originally posted by sgt_posty: There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "reply": " Well, we can agree on one thing, he gets so sympathy from me either... I think the lousy SIERRA OSCAR BRAVO should have been shot!... The thing is, this is about us, we are not animals like them, killing in the name of a god... We are way better than they are and torturing the scum is wrong... It IS about US, NOT about THEM... Respectfully, SUNLINER81", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 15:05:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "intTime": 20090430, 
        "postID": 109, 
        "quote": "", 
        "reply": "Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 17:48:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "ACR26"
    }, 
    {
        "content": "On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "intTime": 20090430, 
        "postID": 110, 
        "quote": "", 
        "reply": "On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:04:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math? Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 07:02 PM", 
        "intTime": 20090430, 
        "postID": 111, 
        "quote": "Originally posted by ACR26: Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "reply": " Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 07:02 PM", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:41:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden. All kinds of people on here keep trying to give all kinds of analogies, so o.k., here's one... A little kid is kidnapped and is put in a box with limited air... The police have the kidnapper in custody and he just laughs at them and says that there isn't a thing that you can do to make him talk... YOU get a hold of this used scum sack and you break out your razor sharp K-bar and slowly start to skin this jackzz alive, eventually he talks and the kid is rescued alive... They take the scum to the hospital but, he dies... Not only is the kid rescued but, you are arrested and the charge is murder... The kid is rescued and you are charged with murder, you admit it and they lock you up and throw away the key... But, you keep saying the kid was rescued, I saved that kid, I got the guy to talk... You still go to jail for twenty-five to life for murder and you can't understand why... Do you see the point now?... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 112, 
        "quote": "Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "reply": " All kinds of people on here keep trying to give all kinds of analogies, so o.k., here's one... A little kid is kidnapped and is put in a box with limited air... The police have the kidnapper in custody and he just laughs at them and says that there isn't a thing that you can do to make him talk... YOU get a hold of this used scum sack and you break out your razor sharp K-bar and slowly start to skin this jackzz alive, eventually he talks and the kid is rescued alive... They take the scum to the hospital but, he dies... Not only is the kid rescued but, you are arrested and the charge is murder... The kid is rescued and you are charged with murder, you admit it and they lock you up and throw away the key... But, you keep saying the kid was rescued, I saved that kid, I got the guy to talk... You still go to jail for twenty-five to life for murder and you can't understand why... Do you see the point now?... Respectfully, SUNLINER81", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:48:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "intTime": 20090430, 
        "postID": 113, 
        "quote": "", 
        "reply": "And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 19:42:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed. These puke bags are told if captured to ALWAYS make up stuff if and when they are released. It is part of the psychological game the terrorists plays. They know that weak minded liberals will always fall for the bleeding heart story and it plays into their plans. You can treat them like a royal dignitary and they will still say they were beaten and tortured. If ANYONE says they were treated badly at GITMO then they are a GOD DAMNED LIAR. The detainees there were treated much better than American citizens are in US prisons. The food they received was often better than the troops guarding them. As rayevinsonsr pointed out, this swine dung \"clerk\" gave up some really big fish and info that led to the discovery of the LAX plot.", 
        "intTime": 20090430, 
        "postID": 114, 
        "quote": "Originally posted by peter3_1: And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "reply": " These puke bags are told if captured to ALWAYS make up stuff if and when they are released. It is part of the psychological game the terrorists plays. They know that weak minded liberals will always fall for the bleeding heart story and it plays into their plans. You can treat them like a royal dignitary and they will still say they were beaten and tortured. If ANYONE says they were treated badly at GITMO then they are a GOD DAMNED LIAR. The detainees there were treated much better than American citizens are in US prisons. The food they received was often better than the troops guarding them. As rayevinsonsr pointed out, this swine dung \"clerk\" gave up some really big fish and info that led to the discovery of the LAX plot.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 20:20:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. Where there is nothing specifically mentioned there is no treaty requirement. The GC was very specific and the issue that allowed Bush and lawyers to conduct EI was that fact. If the type of \"combatants\" are not specifically mentioned then there is no treaty in respect to the persons at issue. Ol Abu should do the world a favor and check himself out.", 
        "intTime": 20090430, 
        "postID": 115, 
        "quote": "Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81", 
        "reply": " Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. Where there is nothing specifically mentioned there is no treaty requirement. The GC was very specific and the issue that allowed Bush and lawyers to conduct EI was that fact. If the type of \"combatants\" are not specifically mentioned then there is no treaty in respect to the persons at issue. Ol Abu should do the world a favor and check himself out.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 20:25:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by NSNN: McCain was right: It's about who we are. And we are not people who do this to another human being. McCain is a traitor and a terrorist sympathizer!! What does he know about torture!?!?!", 
        "intTime": 20090501, 
        "postID": 116, 
        "quote": "Originally posted by NSNN: McCain was right: It's about who we are. And we are not people who do this to another human being.", 
        "reply": " McCain is a traitor and a terrorist sympathizer!! What does he know about torture!?!?!", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 01:14:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. If they're not combatants then they're common criminals.", 
        "intTime": 20090501, 
        "postID": 117, 
        "quote": "Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types.", 
        "reply": " If they're not combatants then they're common criminals.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 01:40:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090501, 
        "postID": 118, 
        "quote": "Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 05:46:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "NSNN"
    }, 
    {
        "content": "When you think you're right, anything is possible. Ask Adolf.", 
        "intTime": 20090501, 
        "postID": 119, 
        "quote": "", 
        "reply": "When you think you're right, anything is possible. Ask Adolf.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 07:36:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due. We are the guys that saved the rest of the world on a number occasions, that has the mettle and audacity to cope with a situation that provides leadership. But above all, it save(s) American lives with whatever degree of torture, arrogance or meanness, you want to attach. If we have utilized the weapons and manpower that has killed hundreds of thousands of people in the past within days, this insisting waterboarding is going to bring the end of the world is preposterous! Saying that you would hurt someone for doing it ridiculous!", 
        "intTime": 20090501, 
        "postID": 120, 
        "quote": "Originally posted by NSNN: quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due.", 
        "reply": " We are the guys that saved the rest of the world on a number occasions, that has the mettle and audacity to cope with a situation that provides leadership. But above all, it save(s) American lives with whatever degree of torture, arrogance or meanness, you want to attach. If we have utilized the weapons and manpower that has killed hundreds of thousands of people in the past within days, this insisting waterboarding is going to bring the end of the world is preposterous! Saying that you would hurt someone for doing it ridiculous!", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 10:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Lately, we've heard and read much about torture memos, waterboarding and insects in a box. It has been the occasion for somber reflection on our past and serious deliberation about our future. This is as it should be. It was Arizona Sen. John McCain, in talking about torture, who rightly reminded us that \"it's not about who they are. It's about who we are.\" But perhaps we also should remember that there was a human being strapped to that board. His name is Zayn al Abidin Mohamed Hussein, known to the world as Abu Zubaydah. He was arrested in Pakistan in March 2002. Because the Bush administration believed him to be a senior Al Qaeda operative, his detention and interrogation produced a fistful of firsts. As far as we can tell, he is the only prisoner in U.S. history whose interrogation was the subject of debate and direct authorization within the White House, and the first to disappear into a secret CIA \"black site.\" He was the first prisoner in the \"war on terror\" to experience the full gamut of ancient techniques adapted by the communists in Korea and, 50 years later, approved by the Justice Department in Washington. He was the first prisoner to have his interrogations captured on videotape -- a practice the CIA ended in late 2002. Two years later, the agency destroyed 90 videotapes of Abu Zubaydah's interrogations, which resulted in a criminal investigation of government officials connected with the program. Many questions about his interrogation remain unanswered, but two legs of the three-legged stool are firmly in place. First, they beat him. As authorized by the Justice Department and confirmed by the Red Cross, they wrapped a collar around his neck and smashed him over and over against a wall. They forced his body into a tiny, pitch-dark box and left him for hours. They stripped him naked and suspended him from hooks in the ceiling. They kept him awake for days. And they strapped him to an inverted board and poured water over his covered nose and mouth to \"produce the sensation of suffocation and incipient panic.\" Eighty-three times. I leave it to others to debate whether we should call this torture. I am content with the self-evident truth that it was wrong. Second, his treatment was motivated by the bane of our post-9/11 world: rotten intel. The beat him because they believed he was evil. Not long after his arrest, President Bush described him as \"one of the top three leaders\" in Al Qaeda and \"Al Qaeda's chief of operations.\" In fact, the CIA brass at Langley, Va., ordered his interrogators to keep at it long after the latter warned that he had been wrung dry. But Abu Zubaydah, we now understand, was nothing like what the president believed. He was never Al Qaeda. The journalist Ron Suskind was the first to ask the right questions. In his 2006 book, \"The One Percent Doctrine,\" he described Abu Zubaydah as a minor logistics man, a travel agent. Later and more detailed reporting in the Washington Post, quoting Justice Department officials, said he provided \"above-ground support. ... To make him the mastermind of anything is ridiculous.\" More recently, the New York Times, relying on current and former intelligence officers, said the initial assessment was \"highly inflated\" and reflected \"a profound misunderstanding\" of Abu Zubaydah. Far from a leader, he was \"a personnel clerk.\" So two legs of the stool are fixed: They tormented a clerk. But there is a third leg that should not be left out. No one can pass unscathed through an ordeal like this. Abu Zubaydah paid with his mind. Partly as a result of injuries he suffered while he was fighting the communists in Afghanistan, partly as a result of how those injuries were exacerbated by the CIA and partly as a result of his extended isolation, Abu Zubaydah's mental grasp is slipping away. Today, he suffers blinding headaches and has permanent brain damage. He has an excruciating sensitivity to sounds, hearing what others do not. The slightest noise drives him nearly insane. In the last two years alone, he has experienced about 200 seizures. But physical pain is a passing thing. The enduring torment is the taunting reminder that darkness encroaches. Already, he cannot picture his mother's face or recall his father's name. Gradually, his past, like his future, eludes him. McCain was right: It's about who we are. And we are not people who do this to another human being. +http://www.latimes.com/news/opinion/la-oe-margulies30-2009apr30,0,3309097.story \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 121, 
        "quote": "Lately, we've heard and read much about torture memos, waterboarding and insects in a box. It has been the occasion for somber reflection on our past and serious deliberation about our future. This is as it should be. It was Arizona Sen. John McCain, in talking about torture, who rightly reminded us that \"it's not about who they are. It's about who we are.\" But perhaps we also should remember that there was a human being strapped to that board. His name is Zayn al Abidin Mohamed Hussein, known to the world as Abu Zubaydah. He was arrested in Pakistan in March 2002. Because the Bush administration believed him to be a senior Al Qaeda operative, his detention and interrogation produced a fistful of firsts. As far as we can tell, he is the only prisoner in U.S. history whose interrogation was the subject of debate and direct authorization within the White House, and the first to disappear into a secret CIA \"black site.\" He was the first prisoner in the \"war on terror\" to experience the full gamut of ancient techniques adapted by the communists in Korea and, 50 years later, approved by the Justice Department in Washington. He was the first prisoner to have his interrogations captured on videotape -- a practice the CIA ended in late 2002. Two years later, the agency destroyed 90 videotapes of Abu Zubaydah's interrogations, which resulted in a criminal investigation of government officials connected with the program. Many questions about his interrogation remain unanswered, but two legs of the three-legged stool are firmly in place. First, they beat him. As authorized by the Justice Department and confirmed by the Red Cross, they wrapped a collar around his neck and smashed him over and over against a wall. They forced his body into a tiny, pitch-dark box and left him for hours. They stripped him naked and suspended him from hooks in the ceiling. They kept him awake for days. And they strapped him to an inverted board and poured water over his covered nose and mouth to \"produce the sensation of suffocation and incipient panic.\" Eighty-three times. I leave it to others to debate whether we should call this torture. I am content with the self-evident truth that it was wrong. Second, his treatment was motivated by the bane of our post-9/11 world: rotten intel. The beat him because they believed he was evil. Not long after his arrest, President Bush described him as \"one of the top three leaders\" in Al Qaeda and \"Al Qaeda's chief of operations.\" In fact, the CIA brass at Langley, Va., ordered his interrogators to keep at it long after the latter warned that he had been wrung dry. But Abu Zubaydah, we now understand, was nothing like what the president believed. He was never Al Qaeda. The journalist Ron Suskind was the first to ask the right questions. In his 2006 book, \"The One Percent Doctrine,\" he described Abu Zubaydah as a minor logistics man, a travel agent. Later and more detailed reporting in the Washington Post, quoting Justice Department officials, said he provided \"above-ground support. ... To make him the mastermind of anything is ridiculous.\" More recently, the New York Times, relying on current and former intelligence officers, said the initial assessment was \"highly inflated\" and reflected \"a profound misunderstanding\" of Abu Zubaydah. Far from a leader, he was \"a personnel clerk.\" So two legs of the stool are fixed: They tormented a clerk. But there is a third leg that should not be left out. No one can pass unscathed through an ordeal like this. Abu Zubaydah paid with his mind. Partly as a result of injuries he suffered while he was fighting the communists in Afghanistan, partly as a result of how those injuries were exacerbated by the CIA and partly as a result of his extended isolation, Abu Zubaydah's mental grasp is slipping away. Today, he suffers blinding headaches and has permanent brain damage. He has an excruciating sensitivity to sounds, hearing what others do not. The slightest noise drives him nearly insane. In the last two years alone, he has experienced about 200 seizures. But physical pain is a passing thing. The enduring torment is the taunting reminder that darkness encroaches. Already, he cannot picture his mother's face or recall his father's name. Gradually, his past, like his future, eludes him. McCain was right: It's about who we are. And we are not people who do this to another human being.", 
        "reply": " +http://www.latimes.com/news/opinion/la-oe-margulies30-2009apr30,0,3309097.story \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 06:06:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "NSNN"
    }, 
    {
        "content": "My heart FREAKIN' BLEEDS..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090430, 
        "postID": 122, 
        "quote": "", 
        "reply": "My heart FREAKIN' BLEEDS..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:31:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "Awwwww.. the poor jihadi.", 
        "intTime": 20090430, 
        "postID": 123, 
        "quote": "", 
        "reply": "Awwwww.. the poor jihadi.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:34:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "We are Americans. If someone deserves death, we hang them or we shoot them - We do NOT sit around a table and disect them like frogs. You think this guy is as bad as Ted Bundy? John Wayne Gacy, who raped and murdered 40 odd kids in Chicago? Screw this guy - should have been shot - But it's American who are the ones doing THIS bit of disecting. You bet, you don't do this to a human being without getting covered in schit. quote: “We are America! I don’t give a rats azz if it helps! We do not *******g torture!” Shepherd Smith Dave", 
        "intTime": 20090430, 
        "postID": 124, 
        "quote": "“We are America! I don’t give a rats azz if it helps! We do not *******g torture!” Shepherd Smith", 
        "reply": "We are Americans. If someone deserves death, we hang them or we shoot them - We do NOT sit around a table and disect them like frogs. You think this guy is as bad as Ted Bundy? John Wayne Gacy, who raped and murdered 40 odd kids in Chicago? Screw this guy - should have been shot - But it's American who are the ones doing THIS bit of disecting. You bet, you don't do this to a human being without getting covered in schit.  Dave", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:40:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "Grachus"
    }, 
    {
        "content": "There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "intTime": 20090430, 
        "postID": 125, 
        "quote": "", 
        "reply": "There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:51:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "I say lets water board Shepherd Smith!!!! He now makes 7 million a yr for screaming in N.O. after the hurracane..(sp). Blaming it all on Bush, while the Mayor and Goveror sat silent and did nothing.", 
        "intTime": 20090430, 
        "postID": 126, 
        "quote": "", 
        "reply": "I say lets water board Shepherd Smith!!!! He now makes 7 million a yr for screaming in N.O. after the hurracane..(sp). Blaming it all on Bush, while the Mayor and Goveror sat silent and did nothing.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "dman1948"
    }, 
    {
        "content": "I think I am going to go vomit.", 
        "intTime": 20090430, 
        "postID": 127, 
        "quote": "", 
        "reply": "I think I am going to go vomit.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 14:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by sgt_posty: There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me. Well, we can agree on one thing, he gets so sympathy from me either... I think the lousy SIERRA OSCAR BRAVO should have been shot!... The thing is, this is about us, we are not animals like them, killing in the name of a god... We are way better than they are and torturing the scum is wrong... It IS about US, NOT about THEM... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 128, 
        "quote": "Originally posted by sgt_posty: There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "reply": " Well, we can agree on one thing, he gets so sympathy from me either... I think the lousy SIERRA OSCAR BRAVO should have been shot!... The thing is, this is about us, we are not animals like them, killing in the name of a god... We are way better than they are and torturing the scum is wrong... It IS about US, NOT about THEM... Respectfully, SUNLINER81", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 15:05:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "intTime": 20090430, 
        "postID": 129, 
        "quote": "", 
        "reply": "Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 17:48:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "ACR26"
    }, 
    {
        "content": "On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "intTime": 20090430, 
        "postID": 130, 
        "quote": "", 
        "reply": "On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:04:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math? Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 07:02 PM", 
        "intTime": 20090430, 
        "postID": 131, 
        "quote": "Originally posted by ACR26: Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "reply": " Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 07:02 PM", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:41:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden. All kinds of people on here keep trying to give all kinds of analogies, so o.k., here's one... A little kid is kidnapped and is put in a box with limited air... The police have the kidnapper in custody and he just laughs at them and says that there isn't a thing that you can do to make him talk... YOU get a hold of this used scum sack and you break out your razor sharp K-bar and slowly start to skin this jackzz alive, eventually he talks and the kid is rescued alive... They take the scum to the hospital but, he dies... Not only is the kid rescued but, you are arrested and the charge is murder... The kid is rescued and you are charged with murder, you admit it and they lock you up and throw away the key... But, you keep saying the kid was rescued, I saved that kid, I got the guy to talk... You still go to jail for twenty-five to life for murder and you can't understand why... Do you see the point now?... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 132, 
        "quote": "Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "reply": " All kinds of people on here keep trying to give all kinds of analogies, so o.k., here's one... A little kid is kidnapped and is put in a box with limited air... The police have the kidnapper in custody and he just laughs at them and says that there isn't a thing that you can do to make him talk... YOU get a hold of this used scum sack and you break out your razor sharp K-bar and slowly start to skin this jackzz alive, eventually he talks and the kid is rescued alive... They take the scum to the hospital but, he dies... Not only is the kid rescued but, you are arrested and the charge is murder... The kid is rescued and you are charged with murder, you admit it and they lock you up and throw away the key... But, you keep saying the kid was rescued, I saved that kid, I got the guy to talk... You still go to jail for twenty-five to life for murder and you can't understand why... Do you see the point now?... Respectfully, SUNLINER81", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:48:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "intTime": 20090430, 
        "postID": 133, 
        "quote": "", 
        "reply": "And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 19:42:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed. These puke bags are told if captured to ALWAYS make up stuff if and when they are released. It is part of the psychological game the terrorists plays. They know that weak minded liberals will always fall for the bleeding heart story and it plays into their plans. You can treat them like a royal dignitary and they will still say they were beaten and tortured. If ANYONE says they were treated badly at GITMO then they are a GOD DAMNED LIAR. The detainees there were treated much better than American citizens are in US prisons. The food they received was often better than the troops guarding them. As rayevinsonsr pointed out, this swine dung \"clerk\" gave up some really big fish and info that led to the discovery of the LAX plot.", 
        "intTime": 20090430, 
        "postID": 134, 
        "quote": "Originally posted by peter3_1: And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "reply": " These puke bags are told if captured to ALWAYS make up stuff if and when they are released. It is part of the psychological game the terrorists plays. They know that weak minded liberals will always fall for the bleeding heart story and it plays into their plans. You can treat them like a royal dignitary and they will still say they were beaten and tortured. If ANYONE says they were treated badly at GITMO then they are a GOD DAMNED LIAR. The detainees there were treated much better than American citizens are in US prisons. The food they received was often better than the troops guarding them. As rayevinsonsr pointed out, this swine dung \"clerk\" gave up some really big fish and info that led to the discovery of the LAX plot.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 20:20:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. Where there is nothing specifically mentioned there is no treaty requirement. The GC was very specific and the issue that allowed Bush and lawyers to conduct EI was that fact. If the type of \"combatants\" are not specifically mentioned then there is no treaty in respect to the persons at issue. Ol Abu should do the world a favor and check himself out.", 
        "intTime": 20090430, 
        "postID": 135, 
        "quote": "Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81", 
        "reply": " Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. Where there is nothing specifically mentioned there is no treaty requirement. The GC was very specific and the issue that allowed Bush and lawyers to conduct EI was that fact. If the type of \"combatants\" are not specifically mentioned then there is no treaty in respect to the persons at issue. Ol Abu should do the world a favor and check himself out.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 20:25:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by NSNN: McCain was right: It's about who we are. And we are not people who do this to another human being. McCain is a traitor and a terrorist sympathizer!! What does he know about torture!?!?!", 
        "intTime": 20090501, 
        "postID": 136, 
        "quote": "Originally posted by NSNN: McCain was right: It's about who we are. And we are not people who do this to another human being.", 
        "reply": " McCain is a traitor and a terrorist sympathizer!! What does he know about torture!?!?!", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 01:14:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. If they're not combatants then they're common criminals.", 
        "intTime": 20090501, 
        "postID": 137, 
        "quote": "Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types.", 
        "reply": " If they're not combatants then they're common criminals.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 01:40:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090501, 
        "postID": 138, 
        "quote": "Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 05:46:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "NSNN"
    }, 
    {
        "content": "When you think you're right, anything is possible. Ask Adolf.", 
        "intTime": 20090501, 
        "postID": 139, 
        "quote": "", 
        "reply": "When you think you're right, anything is possible. Ask Adolf.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 07:36:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due. We are the guys that saved the rest of the world on a number occasions, that has the mettle and audacity to cope with a situation that provides leadership. But above all, it save(s) American lives with whatever degree of torture, arrogance or meanness, you want to attach. If we have utilized the weapons and manpower that has killed hundreds of thousands of people in the past within days, this insisting waterboarding is going to bring the end of the world is preposterous! Saying that you would hurt someone for doing it ridiculous!", 
        "intTime": 20090501, 
        "postID": 140, 
        "quote": "Originally posted by NSNN: quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due.", 
        "reply": " We are the guys that saved the rest of the world on a number occasions, that has the mettle and audacity to cope with a situation that provides leadership. But above all, it save(s) American lives with whatever degree of torture, arrogance or meanness, you want to attach. If we have utilized the weapons and manpower that has killed hundreds of thousands of people in the past within days, this insisting waterboarding is going to bring the end of the world is preposterous! Saying that you would hurt someone for doing it ridiculous!", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 10:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Lately, we've heard and read much about torture memos, waterboarding and insects in a box. It has been the occasion for somber reflection on our past and serious deliberation about our future. This is as it should be. It was Arizona Sen. John McCain, in talking about torture, who rightly reminded us that \"it's not about who they are. It's about who we are.\" But perhaps we also should remember that there was a human being strapped to that board. His name is Zayn al Abidin Mohamed Hussein, known to the world as Abu Zubaydah. He was arrested in Pakistan in March 2002. Because the Bush administration believed him to be a senior Al Qaeda operative, his detention and interrogation produced a fistful of firsts. As far as we can tell, he is the only prisoner in U.S. history whose interrogation was the subject of debate and direct authorization within the White House, and the first to disappear into a secret CIA \"black site.\" He was the first prisoner in the \"war on terror\" to experience the full gamut of ancient techniques adapted by the communists in Korea and, 50 years later, approved by the Justice Department in Washington. He was the first prisoner to have his interrogations captured on videotape -- a practice the CIA ended in late 2002. Two years later, the agency destroyed 90 videotapes of Abu Zubaydah's interrogations, which resulted in a criminal investigation of government officials connected with the program. Many questions about his interrogation remain unanswered, but two legs of the three-legged stool are firmly in place. First, they beat him. As authorized by the Justice Department and confirmed by the Red Cross, they wrapped a collar around his neck and smashed him over and over against a wall. They forced his body into a tiny, pitch-dark box and left him for hours. They stripped him naked and suspended him from hooks in the ceiling. They kept him awake for days. And they strapped him to an inverted board and poured water over his covered nose and mouth to \"produce the sensation of suffocation and incipient panic.\" Eighty-three times. I leave it to others to debate whether we should call this torture. I am content with the self-evident truth that it was wrong. Second, his treatment was motivated by the bane of our post-9/11 world: rotten intel. The beat him because they believed he was evil. Not long after his arrest, President Bush described him as \"one of the top three leaders\" in Al Qaeda and \"Al Qaeda's chief of operations.\" In fact, the CIA brass at Langley, Va., ordered his interrogators to keep at it long after the latter warned that he had been wrung dry. But Abu Zubaydah, we now understand, was nothing like what the president believed. He was never Al Qaeda. The journalist Ron Suskind was the first to ask the right questions. In his 2006 book, \"The One Percent Doctrine,\" he described Abu Zubaydah as a minor logistics man, a travel agent. Later and more detailed reporting in the Washington Post, quoting Justice Department officials, said he provided \"above-ground support. ... To make him the mastermind of anything is ridiculous.\" More recently, the New York Times, relying on current and former intelligence officers, said the initial assessment was \"highly inflated\" and reflected \"a profound misunderstanding\" of Abu Zubaydah. Far from a leader, he was \"a personnel clerk.\" So two legs of the stool are fixed: They tormented a clerk. But there is a third leg that should not be left out. No one can pass unscathed through an ordeal like this. Abu Zubaydah paid with his mind. Partly as a result of injuries he suffered while he was fighting the communists in Afghanistan, partly as a result of how those injuries were exacerbated by the CIA and partly as a result of his extended isolation, Abu Zubaydah's mental grasp is slipping away. Today, he suffers blinding headaches and has permanent brain damage. He has an excruciating sensitivity to sounds, hearing what others do not. The slightest noise drives him nearly insane. In the last two years alone, he has experienced about 200 seizures. But physical pain is a passing thing. The enduring torment is the taunting reminder that darkness encroaches. Already, he cannot picture his mother's face or recall his father's name. Gradually, his past, like his future, eludes him. McCain was right: It's about who we are. And we are not people who do this to another human being. +http://www.latimes.com/news/opinion/la-oe-margulies30-2009apr30,0,3309097.story \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 141, 
        "quote": "Lately, we've heard and read much about torture memos, waterboarding and insects in a box. It has been the occasion for somber reflection on our past and serious deliberation about our future. This is as it should be. It was Arizona Sen. John McCain, in talking about torture, who rightly reminded us that \"it's not about who they are. It's about who we are.\" But perhaps we also should remember that there was a human being strapped to that board. His name is Zayn al Abidin Mohamed Hussein, known to the world as Abu Zubaydah. He was arrested in Pakistan in March 2002. Because the Bush administration believed him to be a senior Al Qaeda operative, his detention and interrogation produced a fistful of firsts. As far as we can tell, he is the only prisoner in U.S. history whose interrogation was the subject of debate and direct authorization within the White House, and the first to disappear into a secret CIA \"black site.\" He was the first prisoner in the \"war on terror\" to experience the full gamut of ancient techniques adapted by the communists in Korea and, 50 years later, approved by the Justice Department in Washington. He was the first prisoner to have his interrogations captured on videotape -- a practice the CIA ended in late 2002. Two years later, the agency destroyed 90 videotapes of Abu Zubaydah's interrogations, which resulted in a criminal investigation of government officials connected with the program. Many questions about his interrogation remain unanswered, but two legs of the three-legged stool are firmly in place. First, they beat him. As authorized by the Justice Department and confirmed by the Red Cross, they wrapped a collar around his neck and smashed him over and over against a wall. They forced his body into a tiny, pitch-dark box and left him for hours. They stripped him naked and suspended him from hooks in the ceiling. They kept him awake for days. And they strapped him to an inverted board and poured water over his covered nose and mouth to \"produce the sensation of suffocation and incipient panic.\" Eighty-three times. I leave it to others to debate whether we should call this torture. I am content with the self-evident truth that it was wrong. Second, his treatment was motivated by the bane of our post-9/11 world: rotten intel. The beat him because they believed he was evil. Not long after his arrest, President Bush described him as \"one of the top three leaders\" in Al Qaeda and \"Al Qaeda's chief of operations.\" In fact, the CIA brass at Langley, Va., ordered his interrogators to keep at it long after the latter warned that he had been wrung dry. But Abu Zubaydah, we now understand, was nothing like what the president believed. He was never Al Qaeda. The journalist Ron Suskind was the first to ask the right questions. In his 2006 book, \"The One Percent Doctrine,\" he described Abu Zubaydah as a minor logistics man, a travel agent. Later and more detailed reporting in the Washington Post, quoting Justice Department officials, said he provided \"above-ground support. ... To make him the mastermind of anything is ridiculous.\" More recently, the New York Times, relying on current and former intelligence officers, said the initial assessment was \"highly inflated\" and reflected \"a profound misunderstanding\" of Abu Zubaydah. Far from a leader, he was \"a personnel clerk.\" So two legs of the stool are fixed: They tormented a clerk. But there is a third leg that should not be left out. No one can pass unscathed through an ordeal like this. Abu Zubaydah paid with his mind. Partly as a result of injuries he suffered while he was fighting the communists in Afghanistan, partly as a result of how those injuries were exacerbated by the CIA and partly as a result of his extended isolation, Abu Zubaydah's mental grasp is slipping away. Today, he suffers blinding headaches and has permanent brain damage. He has an excruciating sensitivity to sounds, hearing what others do not. The slightest noise drives him nearly insane. In the last two years alone, he has experienced about 200 seizures. But physical pain is a passing thing. The enduring torment is the taunting reminder that darkness encroaches. Already, he cannot picture his mother's face or recall his father's name. Gradually, his past, like his future, eludes him. McCain was right: It's about who we are. And we are not people who do this to another human being.", 
        "reply": " +http://www.latimes.com/news/opinion/la-oe-margulies30-2009apr30,0,3309097.story \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 06:06:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "NSNN"
    }, 
    {
        "content": "My heart FREAKIN' BLEEDS..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090430, 
        "postID": 142, 
        "quote": "", 
        "reply": "My heart FREAKIN' BLEEDS..... Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:31:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "Awwwww.. the poor jihadi.", 
        "intTime": 20090430, 
        "postID": 143, 
        "quote": "", 
        "reply": "Awwwww.. the poor jihadi.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:34:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "We are Americans. If someone deserves death, we hang them or we shoot them - We do NOT sit around a table and disect them like frogs. You think this guy is as bad as Ted Bundy? John Wayne Gacy, who raped and murdered 40 odd kids in Chicago? Screw this guy - should have been shot - But it's American who are the ones doing THIS bit of disecting. You bet, you don't do this to a human being without getting covered in schit. quote: “We are America! I don’t give a rats azz if it helps! We do not *******g torture!” Shepherd Smith Dave", 
        "intTime": 20090430, 
        "postID": 144, 
        "quote": "“We are America! I don’t give a rats azz if it helps! We do not *******g torture!” Shepherd Smith", 
        "reply": "We are Americans. If someone deserves death, we hang them or we shoot them - We do NOT sit around a table and disect them like frogs. You think this guy is as bad as Ted Bundy? John Wayne Gacy, who raped and murdered 40 odd kids in Chicago? Screw this guy - should have been shot - But it's American who are the ones doing THIS bit of disecting. You bet, you don't do this to a human being without getting covered in schit.  Dave", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:40:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "Grachus"
    }, 
    {
        "content": "There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "intTime": 20090430, 
        "postID": 145, 
        "quote": "", 
        "reply": "There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:51:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "I say lets water board Shepherd Smith!!!! He now makes 7 million a yr for screaming in N.O. after the hurracane..(sp). Blaming it all on Bush, while the Mayor and Goveror sat silent and did nothing.", 
        "intTime": 20090430, 
        "postID": 146, 
        "quote": "", 
        "reply": "I say lets water board Shepherd Smith!!!! He now makes 7 million a yr for screaming in N.O. after the hurracane..(sp). Blaming it all on Bush, while the Mayor and Goveror sat silent and did nothing.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 11:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "dman1948"
    }, 
    {
        "content": "I think I am going to go vomit.", 
        "intTime": 20090430, 
        "postID": 147, 
        "quote": "", 
        "reply": "I think I am going to go vomit.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 14:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by sgt_posty: There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me. Well, we can agree on one thing, he gets so sympathy from me either... I think the lousy SIERRA OSCAR BRAVO should have been shot!... The thing is, this is about us, we are not animals like them, killing in the name of a god... We are way better than they are and torturing the scum is wrong... It IS about US, NOT about THEM... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 148, 
        "quote": "Originally posted by sgt_posty: There are just some people in this world, that no matter what happens to them, will ever garner an iota of sympathy from me.", 
        "reply": " Well, we can agree on one thing, he gets so sympathy from me either... I think the lousy SIERRA OSCAR BRAVO should have been shot!... The thing is, this is about us, we are not animals like them, killing in the name of a god... We are way better than they are and torturing the scum is wrong... It IS about US, NOT about THEM... Respectfully, SUNLINER81", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 15:05:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "intTime": 20090430, 
        "postID": 149, 
        "quote": "", 
        "reply": "Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 17:48:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "ACR26"
    }, 
    {
        "content": "On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "intTime": 20090430, 
        "postID": 150, 
        "quote": "", 
        "reply": "On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:04:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math? Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 07:02 PM", 
        "intTime": 20090430, 
        "postID": 151, 
        "quote": "Originally posted by ACR26: Yeah but I think my main disagreement is what is defined as torture. Is it possible that the next administration may have a repeat of this one saying...\"if you did ANYTHING more than provide food and shelter then that is torture.\"? Fuzzy Math?", 
        "reply": " Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 30 April 2009 07:02 PM", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:41:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden. All kinds of people on here keep trying to give all kinds of analogies, so o.k., here's one... A little kid is kidnapped and is put in a box with limited air... The police have the kidnapper in custody and he just laughs at them and says that there isn't a thing that you can do to make him talk... YOU get a hold of this used scum sack and you break out your razor sharp K-bar and slowly start to skin this jackzz alive, eventually he talks and the kid is rescued alive... They take the scum to the hospital but, he dies... Not only is the kid rescued but, you are arrested and the charge is murder... The kid is rescued and you are charged with murder, you admit it and they lock you up and throw away the key... But, you keep saying the kid was rescued, I saved that kid, I got the guy to talk... You still go to jail for twenty-five to life for murder and you can't understand why... Do you see the point now?... Respectfully, SUNLINER81", 
        "intTime": 20090430, 
        "postID": 152, 
        "quote": "Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. NSNN did you vote for McCain? You seem to have a attachment all of a sudden.", 
        "reply": " All kinds of people on here keep trying to give all kinds of analogies, so o.k., here's one... A little kid is kidnapped and is put in a box with limited air... The police have the kidnapper in custody and he just laughs at them and says that there isn't a thing that you can do to make him talk... YOU get a hold of this used scum sack and you break out your razor sharp K-bar and slowly start to skin this jackzz alive, eventually he talks and the kid is rescued alive... They take the scum to the hospital but, he dies... Not only is the kid rescued but, you are arrested and the charge is murder... The kid is rescued and you are charged with murder, you admit it and they lock you up and throw away the key... But, you keep saying the kid was rescued, I saved that kid, I got the guy to talk... You still go to jail for twenty-five to life for murder and you can't understand why... Do you see the point now?... Respectfully, SUNLINER81", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 18:48:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "intTime": 20090430, 
        "postID": 153, 
        "quote": "", 
        "reply": "And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 19:42:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed. These puke bags are told if captured to ALWAYS make up stuff if and when they are released. It is part of the psychological game the terrorists plays. They know that weak minded liberals will always fall for the bleeding heart story and it plays into their plans. You can treat them like a royal dignitary and they will still say they were beaten and tortured. If ANYONE says they were treated badly at GITMO then they are a GOD DAMNED LIAR. The detainees there were treated much better than American citizens are in US prisons. The food they received was often better than the troops guarding them. As rayevinsonsr pointed out, this swine dung \"clerk\" gave up some really big fish and info that led to the discovery of the LAX plot.", 
        "intTime": 20090430, 
        "postID": 154, 
        "quote": "Originally posted by peter3_1: And you believe Abu's garbage story because....? He's LYING about his treatment. That's what the ENEMY does, they're trained in it. Yet you suck up this fecal matter as if it was \"Cherry Garcia\"! We're in trouble, indeed.", 
        "reply": " These puke bags are told if captured to ALWAYS make up stuff if and when they are released. It is part of the psychological game the terrorists plays. They know that weak minded liberals will always fall for the bleeding heart story and it plays into their plans. You can treat them like a royal dignitary and they will still say they were beaten and tortured. If ANYONE says they were treated badly at GITMO then they are a GOD DAMNED LIAR. The detainees there were treated much better than American citizens are in US prisons. The food they received was often better than the troops guarding them. As rayevinsonsr pointed out, this swine dung \"clerk\" gave up some really big fish and info that led to the discovery of the LAX plot.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 20:20:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81 Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. Where there is nothing specifically mentioned there is no treaty requirement. The GC was very specific and the issue that allowed Bush and lawyers to conduct EI was that fact. If the type of \"combatants\" are not specifically mentioned then there is no treaty in respect to the persons at issue. Ol Abu should do the world a favor and check himself out.", 
        "intTime": 20090430, 
        "postID": 155, 
        "quote": "Actually, it is laid out in the international treaty that we are signatories to... Yes, waterboarding, is listed as torture in that treaty... That's the sad and sorry thing, those that advised President Bush knew that... If they didn't, then they were guilty of malpractice as lawyers... IMHO... Respectfully, SUNLINER81 ADDED NOTE: The Geneva convention mentions anything that causes physical or mental harm to the prisoner, is torture... Since most of the \"pro torture\" types, say that it is a psychological enhancement, then by that means, it fits the definition of torture... Also Senator John S. McCain III stated that water boarding is torture and he was water boarded at the hands of the North Vietnamese, should he not know?... Respectfully, SUNLINER81", 
        "reply": " Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. Where there is nothing specifically mentioned there is no treaty requirement. The GC was very specific and the issue that allowed Bush and lawyers to conduct EI was that fact. If the type of \"combatants\" are not specifically mentioned then there is no treaty in respect to the persons at issue. Ol Abu should do the world a favor and check himself out.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-04-30 20:25:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by NSNN: McCain was right: It's about who we are. And we are not people who do this to another human being. McCain is a traitor and a terrorist sympathizer!! What does he know about torture!?!?!", 
        "intTime": 20090501, 
        "postID": 156, 
        "quote": "Originally posted by NSNN: McCain was right: It's about who we are. And we are not people who do this to another human being.", 
        "reply": " McCain is a traitor and a terrorist sympathizer!! What does he know about torture!?!?!", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 01:14:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types. If they're not combatants then they're common criminals.", 
        "intTime": 20090501, 
        "postID": 157, 
        "quote": "Oh, but SUnny, therin lies the rub, there is nothing in the \"conventions\" that deals with AQ and Taliban types.", 
        "reply": " If they're not combatants then they're common criminals.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 01:40:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090501, 
        "postID": 158, 
        "quote": "Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 05:46:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "NSNN"
    }, 
    {
        "content": "When you think you're right, anything is possible. Ask Adolf.", 
        "intTime": 20090501, 
        "postID": 159, 
        "quote": "", 
        "reply": "When you think you're right, anything is possible. Ask Adolf.", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 07:36:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due. We are the guys that saved the rest of the world on a number occasions, that has the mettle and audacity to cope with a situation that provides leadership. But above all, it save(s) American lives with whatever degree of torture, arrogance or meanness, you want to attach. If we have utilized the weapons and manpower that has killed hundreds of thousands of people in the past within days, this insisting waterboarding is going to bring the end of the world is preposterous! Saying that you would hurt someone for doing it ridiculous!", 
        "intTime": 20090501, 
        "postID": 160, 
        "quote": "Originally posted by NSNN: quote: Originally posted by rayevinsonsr: On top of everything he knew the secret handshake. The plot gets thick when someone that's suppose to have intelligence supports the scum of the earth and then wants the other guys to feel guilty for the bad guy getting caught. The list of his accomplished mayhem is long and his plans were more of the same. This goat feces gave up Khalid Sheikh Mohammed and a dozen just like him. How? Waterboarding, that's how. Either recognize them for what they have done or at least acquaint yourself to it. \"it's not about who they are. It's about who we are.\" Yeah, the Bush administration believed him to be senior AQ, and so did every other nation this side of hades. Which one is it? We give a rat ass about what other nations know/think or not? NSNN did you vote for McCain? You seem to have a attachment all of a sudden. Don’t know what “attachment” you’re talking about, but I give credit where credit is due.", 
        "reply": " We are the guys that saved the rest of the world on a number occasions, that has the mettle and audacity to cope with a situation that provides leadership. But above all, it save(s) American lives with whatever degree of torture, arrogance or meanness, you want to attach. If we have utilized the weapons and manpower that has killed hundreds of thousands of people in the past within days, this insisting waterboarding is going to bring the end of the world is preposterous! Saying that you would hurt someone for doing it ridiculous!", 
        "threadID": "672198221_1090031222001", 
        "time": "2009-05-01 10:54:00", 
        "title": "Abu Zubaydah's suffering", 
        "userID": "rayevinsonsr"
    }
]