[
    {
        "content": "\"http://www.jsonline.com/news/statepolitics/43995077.html\" To help pay for health care.. I guess if they can tax soda and cigarettes they can tax beer too..it's only fair.. Maybe they should tax the whiskey and wine those lawmakers drink as well??? This message has been edited. Last edited by: 3678131, Sat 23 May 2009 10:17 PM", 
        "intTime": 20090523, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.jsonline.com/news/statepolitics/43995077.html\" To help pay for health care.. I guess if they can tax soda and cigarettes they can tax beer too..it's only fair.. Maybe they should tax the whiskey and wine those lawmakers drink as well??? This message has been edited. Last edited by: 3678131, Sat 23 May 2009 10:17 PM", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-23 22:00:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "3678131"
    }, 
    {
        "content": "Good! I am they tax the heck out of beer, wine, alcohol and liquors as well!.", 
        "intTime": 20090524, 
        "postID": 2, 
        "quote": "", 
        "reply": "Good! I am they tax the heck out of beer, wine, alcohol and liquors as well!.", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 03:35:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "How do you all like the change and hope now?", 
        "intTime": 20090524, 
        "postID": 3, 
        "quote": "", 
        "reply": "How do you all like the change and hope now?", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 04:07:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by 3678131: \"http://www.jsonline.com/news/statepolitics/43995077.html\" To help pay for health care.. I guess if they can tax soda and cigarettes they can tax beer too..it's only fair.. Maybe they should tax the whiskey and wine those lawmakers drink as well??? aaaaaaahhhhhhhhhhHHHHHHHHggggggggggggggGGGGGGGGHgre They never takeaway my Delerium Tremens beer. They're gonna have to pry it out of my cold lifeless hands! Oh, wait, you say they're just gonna tax it a bit more? Never mind... Dave", 
        "intTime": 20090524, 
        "postID": 4, 
        "quote": "Originally posted by 3678131: \"http://www.jsonline.com/news/statepolitics/43995077.html\" To help pay for health care.. I guess if they can tax soda and cigarettes they can tax beer too..it's only fair.. Maybe they should tax the whiskey and wine those lawmakers drink as well???", 
        "reply": " aaaaaaahhhhhhhhhhHHHHHHHHggggggggggggggGGGGGGGGHgre They never takeaway my Delerium Tremens beer. They're gonna have to pry it out of my cold lifeless hands! Oh, wait, you say they're just gonna tax it a bit more? Never mind... Dave", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 09:35:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "Grachus"
    }, 
    {
        "content": "Toilet paper would be a good one to add all kinds of tax to also. Nobody will stop using it either, just like beer, smokes and whatever else none of us would give up no matter what the cost. You gotta wipe your azz, no gettin out of that.", 
        "intTime": 20090524, 
        "postID": 5, 
        "quote": "", 
        "reply": "Toilet paper would be a good one to add all kinds of tax to also. Nobody will stop using it either, just like beer, smokes and whatever else none of us would give up no matter what the cost. You gotta wipe your azz, no gettin out of that.", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 09:41:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Man what is going on with our country We started a revolution for a lot less. I put up a pole barn in my back yard to hold some tools and atv ect. Just a simple metal structure with metal panel sides. Got it set up by construction company then gov regulators came cost tripled and they wont even sign off on it to use until the landscaping is done! On top of that they tell me I am only allowed to put \"farm\" equipment in it. **** has more regulation on it them my old house! Its a freaking pole barn. I am becoming very disenfranchised with the government and that saddens me greatly. Before you know it children will own their life pay before they are born and everyone will be paying 70% income tax with taxes on every product. Still the people in government will still not be paying taxes still stay in office.", 
        "intTime": 20090524, 
        "postID": 6, 
        "quote": "", 
        "reply": "Man what is going on with our country We started a revolution for a lot less. I put up a pole barn in my back yard to hold some tools and atv ect. Just a simple metal structure with metal panel sides. Got it set up by construction company then gov regulators came cost tripled and they wont even sign off on it to use until the landscaping is done! On top of that they tell me I am only allowed to put \"farm\" equipment in it. **** has more regulation on it them my old house! Its a freaking pole barn. I am becoming very disenfranchised with the government and that saddens me greatly. Before you know it children will own their life pay before they are born and everyone will be paying 70% income tax with taxes on every product. Still the people in government will still not be paying taxes still stay in office.", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 10:09:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "jcm28"
    }, 
    {
        "content": "And this is suppose to help the economy? If a person had to have these things, they can grow their own tobacco and make their own beer. Isn't the point to encourage people to spend money?", 
        "intTime": 20090524, 
        "postID": 7, 
        "quote": "", 
        "reply": "And this is suppose to help the economy? If a person had to have these things, they can grow their own tobacco and make their own beer. Isn't the point to encourage people to spend money?", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 10:42:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Did you people read the same article I did? quote: Madison - The last time Wisconsin's beer tax was raised, Neil Armstrong was walking on the moon. But now's the time for another increase, Rep. Terese Berceau (D-Madison) said Wednesday. She's asking lawmakers to consider supporting a bill to take the beer tax from $2 a barrel of beer to $10 a barrel, which means an increase of about 2 1/2 cents a bottle. \"Wisconsin has a drinking problem of national renown that is killing people and ruining lives, and government in Wisconsin has been an enabler,\" Berceau said at a Capitol news conference with co-sponsor Sen. Fred Risser (D-Madison), law enforcement and health care professionals. Risser noted that he's the only state legislator who was in office in 1969, when the last beer tax increase became law. The proposal is unlikely to become law. Gov. Jim Doyle opposes it, and similar proposals in the past have died for lack of support. Wisconsin's tax is the country's third lowest, and the state has one of the highest rates of binge drinking and drunken driving crashes, supporters said. The state also has high alcohol-related health care costs, they said. Now is the wrong time to even consider such a tax increase, said Scott Stenger, lobbyist for the Tavern League of Wisconsin, which opposes the beer tax increase. Taverns are seeing a significant decline in business because of the ongoing financial slump, he said. The proposed beer tax increase would bring in about $40 million in new revenue a year, according to figures on Berceau's Web site. The new funds would go toward increased drunken driving enforcement and alcohol abuse prevention and treatment.", 
        "intTime": 20090524, 
        "postID": 8, 
        "quote": "Madison - The last time Wisconsin's beer tax was raised, Neil Armstrong was walking on the moon. But now's the time for another increase, Rep. Terese Berceau (D-Madison) said Wednesday. She's asking lawmakers to consider supporting a bill to take the beer tax from $2 a barrel of beer to $10 a barrel, which means an increase of about 2 1/2 cents a bottle. \"Wisconsin has a drinking problem of national renown that is killing people and ruining lives, and government in Wisconsin has been an enabler,\" Berceau said at a Capitol news conference with co-sponsor Sen. Fred Risser (D-Madison), law enforcement and health care professionals. Risser noted that he's the only state legislator who was in office in 1969, when the last beer tax increase became law. The proposal is unlikely to become law. Gov. Jim Doyle opposes it, and similar proposals in the past have died for lack of support. Wisconsin's tax is the country's third lowest, and the state has one of the highest rates of binge drinking and drunken driving crashes, supporters said. The state also has high alcohol-related health care costs, they said. Now is the wrong time to even consider such a tax increase, said Scott Stenger, lobbyist for the Tavern League of Wisconsin, which opposes the beer tax increase. Taverns are seeing a significant decline in business because of the ongoing financial slump, he said. The proposed beer tax increase would bring in about $40 million in new revenue a year, according to figures on Berceau's Web site. The new funds would go toward increased drunken driving enforcement and alcohol abuse prevention and treatment.", 
        "reply": "Did you people read the same article I did? ", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 10:56:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "Esample1"
    }, 
    {
        "content": "Man, if you REALLY want to increase state revenue, tax GOLF. Leave us drunken smokers alone. We did our time. Hit the doctors and lawyers with the taxes and let us work, come home, and drink and smoke ourselves to death. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090524, 
        "postID": 9, 
        "quote": "", 
        "reply": "Man, if you REALLY want to increase state revenue, tax GOLF. Leave us drunken smokers alone. We did our time. Hit the doctors and lawyers with the taxes and let us work, come home, and drink and smoke ourselves to death. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 12:10:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "\"http://www.dailytribune.com/articles/2009/05/24/news/doc4a18c885867e7277344073.txt\" quote: WASHINGTON — A federal soda pop tax. Higher levies on beer, wine and hard liquor. Taxing some health insurance benefits. Those are among the options the Senate is considering to pay for revamping health care. quote: Potential revenue raisers also include doing away with flexible spending accounts, limiting the income tax deduction for out-of-pocket medical costs, and charging upper income seniors more for their Medicare drug plans. quote: Rep. Charles Rangel, chairman of the tax-writing House Ways and Means Committee, said Congress “absolutely” has the will to raise taxes to pay for health care reform.", 
        "intTime": 20090524, 
        "postID": 10, 
        "quote": "WASHINGTON — A federal soda pop tax. Higher levies on beer, wine and hard liquor. Taxing some health insurance benefits. Those are among the options the Senate is considering to pay for revamping health care.", 
        "reply": "\"http://www.dailytribune.com/articles/2009/05/24/news/doc4a18c885867e7277344073.txt\"  quote: Potential revenue raisers also include doing away with flexible spending accounts, limiting the income tax deduction for out-of-pocket medical costs, and charging upper income seniors more for their Medicare drug plans. quote: Rep. Charles Rangel, chairman of the tax-writing House Ways and Means Committee, said Congress “absolutely” has the will to raise taxes to pay for health care reform.", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 12:50:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "3678131"
    }, 
    {
        "content": "Wonder if prohibition will return. Most assuredly there will be some form of bootlegging with this. Are all the vices going to be taxed?", 
        "intTime": 20090524, 
        "postID": 11, 
        "quote": "", 
        "reply": "Wonder if prohibition will return. Most assuredly there will be some form of bootlegging with this. Are all the vices going to be taxed?", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 13:23:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "quote: Originally posted by charlie_echo: Wonder if prohibition will return. Most assuredly there will be some form of bootlegging with this. Are all the vices going to be taxed? Anyone who wants to can make all the booze they want as long as they don't sell it. I've made my own beer. Probalem is that it's a lot of work... But if they raise the cost of booze past a certain point, they I'll screw them out of the money by making my own. On the other hand, I don't mind paying 50 cents or a dollar more for my beer, if in exchange I get health care. Dave", 
        "intTime": 20090524, 
        "postID": 12, 
        "quote": "Originally posted by charlie_echo: Wonder if prohibition will return. Most assuredly there will be some form of bootlegging with this. Are all the vices going to be taxed?", 
        "reply": " Anyone who wants to can make all the booze they want as long as they don't sell it. I've made my own beer. Probalem is that it's a lot of work... But if they raise the cost of booze past a certain point, they I'll screw them out of the money by making my own. On the other hand, I don't mind paying 50 cents or a dollar more for my beer, if in exchange I get health care. Dave", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 13:33:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Duster6: How do you all like the change and hope now? I wish I could have lived in your day sir, this tax and spend, hippie tree hugging, flower child liberal bull crap is ruining this nation.. These liberal idiots want to align the cost of beer with that of their starbucks latte...", 
        "intTime": 20090524, 
        "postID": 13, 
        "quote": "Originally posted by Duster6: How do you all like the change and hope now?", 
        "reply": " I wish I could have lived in your day sir, this tax and spend, hippie tree hugging, flower child liberal bull crap is ruining this nation.. These liberal idiots want to align the cost of beer with that of their starbucks latte...", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 13:58:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Home Breweries. I'm no legal expert, but I do believe the public is allowed to brew so many gallons of beer in their own home, for their own consumption, without being taxed.", 
        "intTime": 20090524, 
        "postID": 14, 
        "quote": "", 
        "reply": "Home Breweries. I'm no legal expert, but I do believe the public is allowed to brew so many gallons of beer in their own home, for their own consumption, without being taxed.", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 16:14:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "Applejack sound pretty good right about now!", 
        "intTime": 20090524, 
        "postID": 15, 
        "quote": "", 
        "reply": "Applejack sound pretty good right about now!", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 16:22:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "quote: Originally posted by charlie_echo: Applejack sound pretty good right about now! LOL...for what, your lawn mower??", 
        "intTime": 20090524, 
        "postID": 16, 
        "quote": "Originally posted by charlie_echo: Applejack sound pretty good right about now!", 
        "reply": " LOL...for what, your lawn mower??", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 16:32:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: Home Breweries. I'm no legal expert, but I do believe the public is allowed to brew so many gallons of beer in their own home, for their own consumption, without being taxed. My beer was pretty damn good. Of course, you're supposed to wait 90 days to let it age, and this too was a problem... Dave", 
        "intTime": 20090524, 
        "postID": 17, 
        "quote": "Originally posted by fishnfanatic: Home Breweries. I'm no legal expert, but I do believe the public is allowed to brew so many gallons of beer in their own home, for their own consumption, without being taxed.", 
        "reply": " My beer was pretty damn good. Of course, you're supposed to wait 90 days to let it age, and this too was a problem... Dave", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 16:35:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by charlie_echo: Applejack sound pretty good right about now! LOL...for what, your lawn mower?? Oh, no sir, my nana and momma could make it just right. When we were kids, the highpoint of the family gatherings, was getting to have a cup before bed. I know now it let us sleep good and the grown-ups could go on visiting. Still tickles me to this day to know that.", 
        "intTime": 20090524, 
        "postID": 18, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by charlie_echo: Applejack sound pretty good right about now! LOL...for what, your lawn mower??", 
        "reply": " Oh, no sir, my nana and momma could make it just right. When we were kids, the highpoint of the family gatherings, was getting to have a cup before bed. I know now it let us sleep good and the grown-ups could go on visiting. Still tickles me to this day to know that.", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 16:38:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "We must stand up and fight. We must storm the steps of the Capital. Tar and Feather those in politics who are dishonest. (which is 81% of them). I strongly believe the next terror attack in this country will be from a fed up American. Why should Al-Qaeda even want to hit us again when all they have to do is wait us out because we are doing a very good job of destroying ourselves.", 
        "intTime": 20090524, 
        "postID": 19, 
        "quote": "", 
        "reply": "We must stand up and fight. We must storm the steps of the Capital. Tar and Feather those in politics who are dishonest. (which is 81% of them). I strongly believe the next terror attack in this country will be from a fed up American. Why should Al-Qaeda even want to hit us again when all they have to do is wait us out because we are doing a very good job of destroying ourselves.", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 16:59:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: We must stand up and fight. We must storm the steps of the Capital. Tar and Feather those in politics who are dishonest. (which is 81% of them). I strongly believe the next terror attack in this country will be from a fed up American. Why should Al-Qaeda even want to hit us again when all they have to do is wait us out because we are doing a very good job of destroying ourselves. It depends, one more 9/11 style attack and it will throw this nation over the cliff politically and socially. It would confirm Dick Cheneys greatest fears, and validate the administration of President Bush. I do not wish to see something like that happen again, but I do not have any illusions about the safety of our nation under liberal control either. Until the blue half of our nation realizes we do not live in a utopian paradise where rainbows and flowers appear out of thin air, only then will we be safe... Someone, somewhere is plotting and planning....", 
        "intTime": 20090524, 
        "postID": 20, 
        "quote": "Originally posted by Duster6: We must stand up and fight. We must storm the steps of the Capital. Tar and Feather those in politics who are dishonest. (which is 81% of them). I strongly believe the next terror attack in this country will be from a fed up American. Why should Al-Qaeda even want to hit us again when all they have to do is wait us out because we are doing a very good job of destroying ourselves.", 
        "reply": " It depends, one more 9/11 style attack and it will throw this nation over the cliff politically and socially. It would confirm Dick Cheneys greatest fears, and validate the administration of President Bush. I do not wish to see something like that happen again, but I do not have any illusions about the safety of our nation under liberal control either. Until the blue half of our nation realizes we do not live in a utopian paradise where rainbows and flowers appear out of thin air, only then will we be safe... Someone, somewhere is plotting and planning....", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 17:33:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "\"http://www.jsonline.com/news/statepolitics/43995077.html\" To help pay for health care.. I guess if they can tax soda and cigarettes they can tax beer too..it's only fair.. Maybe they should tax the whiskey and wine those lawmakers drink as well??? This message has been edited. Last edited by: 3678131, Sat 23 May 2009 10:17 PM", 
        "intTime": 20090523, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"http://www.jsonline.com/news/statepolitics/43995077.html\" To help pay for health care.. I guess if they can tax soda and cigarettes they can tax beer too..it's only fair.. Maybe they should tax the whiskey and wine those lawmakers drink as well??? This message has been edited. Last edited by: 3678131, Sat 23 May 2009 10:17 PM", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-23 22:00:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "3678131"
    }, 
    {
        "content": "Good! I am they tax the heck out of beer, wine, alcohol and liquors as well!.", 
        "intTime": 20090524, 
        "postID": 22, 
        "quote": "", 
        "reply": "Good! I am they tax the heck out of beer, wine, alcohol and liquors as well!.", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 03:35:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "How do you all like the change and hope now?", 
        "intTime": 20090524, 
        "postID": 23, 
        "quote": "", 
        "reply": "How do you all like the change and hope now?", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 04:07:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by 3678131: \"http://www.jsonline.com/news/statepolitics/43995077.html\" To help pay for health care.. I guess if they can tax soda and cigarettes they can tax beer too..it's only fair.. Maybe they should tax the whiskey and wine those lawmakers drink as well??? aaaaaaahhhhhhhhhhHHHHHHHHggggggggggggggGGGGGGGGHgre They never takeaway my Delerium Tremens beer. They're gonna have to pry it out of my cold lifeless hands! Oh, wait, you say they're just gonna tax it a bit more? Never mind... Dave", 
        "intTime": 20090524, 
        "postID": 24, 
        "quote": "Originally posted by 3678131: \"http://www.jsonline.com/news/statepolitics/43995077.html\" To help pay for health care.. I guess if they can tax soda and cigarettes they can tax beer too..it's only fair.. Maybe they should tax the whiskey and wine those lawmakers drink as well???", 
        "reply": " aaaaaaahhhhhhhhhhHHHHHHHHggggggggggggggGGGGGGGGHgre They never takeaway my Delerium Tremens beer. They're gonna have to pry it out of my cold lifeless hands! Oh, wait, you say they're just gonna tax it a bit more? Never mind... Dave", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 09:35:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "Grachus"
    }, 
    {
        "content": "Toilet paper would be a good one to add all kinds of tax to also. Nobody will stop using it either, just like beer, smokes and whatever else none of us would give up no matter what the cost. You gotta wipe your azz, no gettin out of that.", 
        "intTime": 20090524, 
        "postID": 25, 
        "quote": "", 
        "reply": "Toilet paper would be a good one to add all kinds of tax to also. Nobody will stop using it either, just like beer, smokes and whatever else none of us would give up no matter what the cost. You gotta wipe your azz, no gettin out of that.", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 09:41:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Man what is going on with our country We started a revolution for a lot less. I put up a pole barn in my back yard to hold some tools and atv ect. Just a simple metal structure with metal panel sides. Got it set up by construction company then gov regulators came cost tripled and they wont even sign off on it to use until the landscaping is done! On top of that they tell me I am only allowed to put \"farm\" equipment in it. **** has more regulation on it them my old house! Its a freaking pole barn. I am becoming very disenfranchised with the government and that saddens me greatly. Before you know it children will own their life pay before they are born and everyone will be paying 70% income tax with taxes on every product. Still the people in government will still not be paying taxes still stay in office.", 
        "intTime": 20090524, 
        "postID": 26, 
        "quote": "", 
        "reply": "Man what is going on with our country We started a revolution for a lot less. I put up a pole barn in my back yard to hold some tools and atv ect. Just a simple metal structure with metal panel sides. Got it set up by construction company then gov regulators came cost tripled and they wont even sign off on it to use until the landscaping is done! On top of that they tell me I am only allowed to put \"farm\" equipment in it. **** has more regulation on it them my old house! Its a freaking pole barn. I am becoming very disenfranchised with the government and that saddens me greatly. Before you know it children will own their life pay before they are born and everyone will be paying 70% income tax with taxes on every product. Still the people in government will still not be paying taxes still stay in office.", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 10:09:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "jcm28"
    }, 
    {
        "content": "And this is suppose to help the economy? If a person had to have these things, they can grow their own tobacco and make their own beer. Isn't the point to encourage people to spend money?", 
        "intTime": 20090524, 
        "postID": 27, 
        "quote": "", 
        "reply": "And this is suppose to help the economy? If a person had to have these things, they can grow their own tobacco and make their own beer. Isn't the point to encourage people to spend money?", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 10:42:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Did you people read the same article I did? quote: Madison - The last time Wisconsin's beer tax was raised, Neil Armstrong was walking on the moon. But now's the time for another increase, Rep. Terese Berceau (D-Madison) said Wednesday. She's asking lawmakers to consider supporting a bill to take the beer tax from $2 a barrel of beer to $10 a barrel, which means an increase of about 2 1/2 cents a bottle. \"Wisconsin has a drinking problem of national renown that is killing people and ruining lives, and government in Wisconsin has been an enabler,\" Berceau said at a Capitol news conference with co-sponsor Sen. Fred Risser (D-Madison), law enforcement and health care professionals. Risser noted that he's the only state legislator who was in office in 1969, when the last beer tax increase became law. The proposal is unlikely to become law. Gov. Jim Doyle opposes it, and similar proposals in the past have died for lack of support. Wisconsin's tax is the country's third lowest, and the state has one of the highest rates of binge drinking and drunken driving crashes, supporters said. The state also has high alcohol-related health care costs, they said. Now is the wrong time to even consider such a tax increase, said Scott Stenger, lobbyist for the Tavern League of Wisconsin, which opposes the beer tax increase. Taverns are seeing a significant decline in business because of the ongoing financial slump, he said. The proposed beer tax increase would bring in about $40 million in new revenue a year, according to figures on Berceau's Web site. The new funds would go toward increased drunken driving enforcement and alcohol abuse prevention and treatment.", 
        "intTime": 20090524, 
        "postID": 28, 
        "quote": "Madison - The last time Wisconsin's beer tax was raised, Neil Armstrong was walking on the moon. But now's the time for another increase, Rep. Terese Berceau (D-Madison) said Wednesday. She's asking lawmakers to consider supporting a bill to take the beer tax from $2 a barrel of beer to $10 a barrel, which means an increase of about 2 1/2 cents a bottle. \"Wisconsin has a drinking problem of national renown that is killing people and ruining lives, and government in Wisconsin has been an enabler,\" Berceau said at a Capitol news conference with co-sponsor Sen. Fred Risser (D-Madison), law enforcement and health care professionals. Risser noted that he's the only state legislator who was in office in 1969, when the last beer tax increase became law. The proposal is unlikely to become law. Gov. Jim Doyle opposes it, and similar proposals in the past have died for lack of support. Wisconsin's tax is the country's third lowest, and the state has one of the highest rates of binge drinking and drunken driving crashes, supporters said. The state also has high alcohol-related health care costs, they said. Now is the wrong time to even consider such a tax increase, said Scott Stenger, lobbyist for the Tavern League of Wisconsin, which opposes the beer tax increase. Taverns are seeing a significant decline in business because of the ongoing financial slump, he said. The proposed beer tax increase would bring in about $40 million in new revenue a year, according to figures on Berceau's Web site. The new funds would go toward increased drunken driving enforcement and alcohol abuse prevention and treatment.", 
        "reply": "Did you people read the same article I did? ", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 10:56:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "Esample1"
    }, 
    {
        "content": "Man, if you REALLY want to increase state revenue, tax GOLF. Leave us drunken smokers alone. We did our time. Hit the doctors and lawyers with the taxes and let us work, come home, and drink and smoke ourselves to death. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090524, 
        "postID": 29, 
        "quote": "", 
        "reply": "Man, if you REALLY want to increase state revenue, tax GOLF. Leave us drunken smokers alone. We did our time. Hit the doctors and lawyers with the taxes and let us work, come home, and drink and smoke ourselves to death. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 12:10:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "\"http://www.dailytribune.com/articles/2009/05/24/news/doc4a18c885867e7277344073.txt\" quote: WASHINGTON — A federal soda pop tax. Higher levies on beer, wine and hard liquor. Taxing some health insurance benefits. Those are among the options the Senate is considering to pay for revamping health care. quote: Potential revenue raisers also include doing away with flexible spending accounts, limiting the income tax deduction for out-of-pocket medical costs, and charging upper income seniors more for their Medicare drug plans. quote: Rep. Charles Rangel, chairman of the tax-writing House Ways and Means Committee, said Congress “absolutely” has the will to raise taxes to pay for health care reform.", 
        "intTime": 20090524, 
        "postID": 30, 
        "quote": "WASHINGTON — A federal soda pop tax. Higher levies on beer, wine and hard liquor. Taxing some health insurance benefits. Those are among the options the Senate is considering to pay for revamping health care.", 
        "reply": "\"http://www.dailytribune.com/articles/2009/05/24/news/doc4a18c885867e7277344073.txt\"  quote: Potential revenue raisers also include doing away with flexible spending accounts, limiting the income tax deduction for out-of-pocket medical costs, and charging upper income seniors more for their Medicare drug plans. quote: Rep. Charles Rangel, chairman of the tax-writing House Ways and Means Committee, said Congress “absolutely” has the will to raise taxes to pay for health care reform.", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 12:50:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "3678131"
    }, 
    {
        "content": "Wonder if prohibition will return. Most assuredly there will be some form of bootlegging with this. Are all the vices going to be taxed?", 
        "intTime": 20090524, 
        "postID": 31, 
        "quote": "", 
        "reply": "Wonder if prohibition will return. Most assuredly there will be some form of bootlegging with this. Are all the vices going to be taxed?", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 13:23:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "quote: Originally posted by charlie_echo: Wonder if prohibition will return. Most assuredly there will be some form of bootlegging with this. Are all the vices going to be taxed? Anyone who wants to can make all the booze they want as long as they don't sell it. I've made my own beer. Probalem is that it's a lot of work... But if they raise the cost of booze past a certain point, they I'll screw them out of the money by making my own. On the other hand, I don't mind paying 50 cents or a dollar more for my beer, if in exchange I get health care. Dave", 
        "intTime": 20090524, 
        "postID": 32, 
        "quote": "Originally posted by charlie_echo: Wonder if prohibition will return. Most assuredly there will be some form of bootlegging with this. Are all the vices going to be taxed?", 
        "reply": " Anyone who wants to can make all the booze they want as long as they don't sell it. I've made my own beer. Probalem is that it's a lot of work... But if they raise the cost of booze past a certain point, they I'll screw them out of the money by making my own. On the other hand, I don't mind paying 50 cents or a dollar more for my beer, if in exchange I get health care. Dave", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 13:33:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Duster6: How do you all like the change and hope now? I wish I could have lived in your day sir, this tax and spend, hippie tree hugging, flower child liberal bull crap is ruining this nation.. These liberal idiots want to align the cost of beer with that of their starbucks latte...", 
        "intTime": 20090524, 
        "postID": 33, 
        "quote": "Originally posted by Duster6: How do you all like the change and hope now?", 
        "reply": " I wish I could have lived in your day sir, this tax and spend, hippie tree hugging, flower child liberal bull crap is ruining this nation.. These liberal idiots want to align the cost of beer with that of their starbucks latte...", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 13:58:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Home Breweries. I'm no legal expert, but I do believe the public is allowed to brew so many gallons of beer in their own home, for their own consumption, without being taxed.", 
        "intTime": 20090524, 
        "postID": 34, 
        "quote": "", 
        "reply": "Home Breweries. I'm no legal expert, but I do believe the public is allowed to brew so many gallons of beer in their own home, for their own consumption, without being taxed.", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 16:14:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "Applejack sound pretty good right about now!", 
        "intTime": 20090524, 
        "postID": 35, 
        "quote": "", 
        "reply": "Applejack sound pretty good right about now!", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 16:22:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "quote: Originally posted by charlie_echo: Applejack sound pretty good right about now! LOL...for what, your lawn mower??", 
        "intTime": 20090524, 
        "postID": 36, 
        "quote": "Originally posted by charlie_echo: Applejack sound pretty good right about now!", 
        "reply": " LOL...for what, your lawn mower??", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 16:32:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: Home Breweries. I'm no legal expert, but I do believe the public is allowed to brew so many gallons of beer in their own home, for their own consumption, without being taxed. My beer was pretty damn good. Of course, you're supposed to wait 90 days to let it age, and this too was a problem... Dave", 
        "intTime": 20090524, 
        "postID": 37, 
        "quote": "Originally posted by fishnfanatic: Home Breweries. I'm no legal expert, but I do believe the public is allowed to brew so many gallons of beer in their own home, for their own consumption, without being taxed.", 
        "reply": " My beer was pretty damn good. Of course, you're supposed to wait 90 days to let it age, and this too was a problem... Dave", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 16:35:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by charlie_echo: Applejack sound pretty good right about now! LOL...for what, your lawn mower?? Oh, no sir, my nana and momma could make it just right. When we were kids, the highpoint of the family gatherings, was getting to have a cup before bed. I know now it let us sleep good and the grown-ups could go on visiting. Still tickles me to this day to know that.", 
        "intTime": 20090524, 
        "postID": 38, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by charlie_echo: Applejack sound pretty good right about now! LOL...for what, your lawn mower??", 
        "reply": " Oh, no sir, my nana and momma could make it just right. When we were kids, the highpoint of the family gatherings, was getting to have a cup before bed. I know now it let us sleep good and the grown-ups could go on visiting. Still tickles me to this day to know that.", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 16:38:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "We must stand up and fight. We must storm the steps of the Capital. Tar and Feather those in politics who are dishonest. (which is 81% of them). I strongly believe the next terror attack in this country will be from a fed up American. Why should Al-Qaeda even want to hit us again when all they have to do is wait us out because we are doing a very good job of destroying ourselves.", 
        "intTime": 20090524, 
        "postID": 39, 
        "quote": "", 
        "reply": "We must stand up and fight. We must storm the steps of the Capital. Tar and Feather those in politics who are dishonest. (which is 81% of them). I strongly believe the next terror attack in this country will be from a fed up American. Why should Al-Qaeda even want to hit us again when all they have to do is wait us out because we are doing a very good job of destroying ourselves.", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 16:59:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: We must stand up and fight. We must storm the steps of the Capital. Tar and Feather those in politics who are dishonest. (which is 81% of them). I strongly believe the next terror attack in this country will be from a fed up American. Why should Al-Qaeda even want to hit us again when all they have to do is wait us out because we are doing a very good job of destroying ourselves. It depends, one more 9/11 style attack and it will throw this nation over the cliff politically and socially. It would confirm Dick Cheneys greatest fears, and validate the administration of President Bush. I do not wish to see something like that happen again, but I do not have any illusions about the safety of our nation under liberal control either. Until the blue half of our nation realizes we do not live in a utopian paradise where rainbows and flowers appear out of thin air, only then will we be safe... Someone, somewhere is plotting and planning....", 
        "intTime": 20090524, 
        "postID": 40, 
        "quote": "Originally posted by Duster6: We must stand up and fight. We must storm the steps of the Capital. Tar and Feather those in politics who are dishonest. (which is 81% of them). I strongly believe the next terror attack in this country will be from a fed up American. Why should Al-Qaeda even want to hit us again when all they have to do is wait us out because we are doing a very good job of destroying ourselves.", 
        "reply": " It depends, one more 9/11 style attack and it will throw this nation over the cliff politically and socially. It would confirm Dick Cheneys greatest fears, and validate the administration of President Bush. I do not wish to see something like that happen again, but I do not have any illusions about the safety of our nation under liberal control either. Until the blue half of our nation realizes we do not live in a utopian paradise where rainbows and flowers appear out of thin air, only then will we be safe... Someone, somewhere is plotting and planning....", 
        "threadID": "672198221_8450011422001", 
        "time": "2009-05-24 17:33:00", 
        "title": "Federal Excise Tax on Beer Could Triple", 
        "userID": "Irwin_R_Schyster"
    }
]