[
    {
        "content": "\"\"\"\"http://money.aol.com/article/georgia-new-jersey-utah-banks-shut-down/459174 Ten times as many as last year. With this rate the banking system will be gone in just a short time. How safe is your money? Silverton Marks Georgia's Biggest Bank Failure to Date posted: 1 DAY 1 HOUR AGOfiled under: Financial CrisisPrintShareText SizeAAANEW YORK (May 1) -- Three more banks shut their doors Friday, according to the federal government, bringing the total number of failures up to 32 in 2009. Recent Bank Failureswww.silvertonbank.com52 photos On May 1, Silverton Bank of Atlanta became Georgia's biggest bank to fail to date. Silverton was known as a correspondent bank and provided services to around 1,400 client banks. Click through the gallery for more news on failed financial institutions.(Note: Please disable your pop-up blocker) DailyFinance: FDIC Explains How Banks Are Seized The first failure was a wholesale banking operator that served 1,400 other lenders across the country and was the fifth biggest bank failure during the current recession in terms of assets. Georgia bank: The Federal Deposit Insurance Corp. said in a statement that it created a bridge bank to take over the operations of Silverton Bank, National Bank, headquartered in Atlanta. Unlike the other 30 banks that have failed so far in 2009, Silverton Bank did not take deposits directly from the general public or make loans to consumers. Instead, it offered a wide variety of services, such as foreign wire transfers, as well as clearing and cash management, to other banks. Silverton was cooperatively owned by community banks throughout the Southeast and was heavily invested in loans to real estate developments in Florida, Georgia, and other parts of the Southeast, according to Christopher Marinac, managing principal of financial firm FIG Partners LLC based out of Atlanta, Ga. When real estate values sank in the current downturn, the assets backing those properties also lost their value. The Southeast has seen numerous regional banks topple as the housing bubble burst. At the time of its closing, Silverton Bank had approximately $4.1 billion in assets and $3.3 billion in deposits, all of which are expected to be within the FDIC's insurance limits. The FDIC estimates that the cost to the Deposit Insurance Fund will be $1.3 billion, making it the fourth costliest bank failure since the start of the recession. \"It is a bigger hit to the insurance fund than they have seen in the last couple weeks,\" Marinac said. \"This is a bigger issue than we have seen in awhile.", 
        "intTime": 20090502, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"\"\"\"http://money.aol.com/article/georgia-new-jersey-utah-banks-shut-down/459174 Ten times as many as last year. With this rate the banking system will be gone in just a short time. How safe is your money? Silverton Marks Georgia's Biggest Bank Failure to Date posted: 1 DAY 1 HOUR AGOfiled under: Financial CrisisPrintShareText SizeAAANEW YORK (May 1) -- Three more banks shut their doors Friday, according to the federal government, bringing the total number of failures up to 32 in 2009. Recent Bank Failureswww.silvertonbank.com52 photos On May 1, Silverton Bank of Atlanta became Georgia's biggest bank to fail to date. Silverton was known as a correspondent bank and provided services to around 1,400 client banks. Click through the gallery for more news on failed financial institutions.(Note: Please disable your pop-up blocker) DailyFinance: FDIC Explains How Banks Are Seized The first failure was a wholesale banking operator that served 1,400 other lenders across the country and was the fifth biggest bank failure during the current recession in terms of assets. Georgia bank: The Federal Deposit Insurance Corp. said in a statement that it created a bridge bank to take over the operations of Silverton Bank, National Bank, headquartered in Atlanta. Unlike the other 30 banks that have failed so far in 2009, Silverton Bank did not take deposits directly from the general public or make loans to consumers. Instead, it offered a wide variety of services, such as foreign wire transfers, as well as clearing and cash management, to other banks. Silverton was cooperatively owned by community banks throughout the Southeast and was heavily invested in loans to real estate developments in Florida, Georgia, and other parts of the Southeast, according to Christopher Marinac, managing principal of financial firm FIG Partners LLC based out of Atlanta, Ga. When real estate values sank in the current downturn, the assets backing those properties also lost their value. The Southeast has seen numerous regional banks topple as the housing bubble burst. At the time of its closing, Silverton Bank had approximately $4.1 billion in assets and $3.3 billion in deposits, all of which are expected to be within the FDIC's insurance limits. The FDIC estimates that the cost to the Deposit Insurance Fund will be $1.3 billion, making it the fourth costliest bank failure since the start of the recession. \"It is a bigger hit to the insurance fund than they have seen in the last couple weeks,\" Marinac said. \"This is a bigger issue than we have seen in awhile.", 
        "threadID": "672198221_8120063222001", 
        "time": "2009-05-02 20:08:00", 
        "title": "Georgia, New Jersey, Utah Banks Seized, That makes 32 for this year so far?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "2008 United States bank failures From Wikipedia, the free encyclopedia Jump to: navigation, search Twenty-five United States banks failed and were taken over by the Federal Deposit Insurance Corporation (FDIC) in 2008,[1] after only three failures in 2007 and none in 2006 or 2005.[2] A bank failure is the closing of a bank by a federal or state banking regulatory agency. The FDIC seizes a bank's assets when its capital levels are too low, or it cannot meet obligations the next day.[2][3] After seizing a bank's assets, the FDIC acts in two capacities—first, it pays insurance to the depositors, up to the deposit insurance limit, for assets not sold to another bank.", 
        "intTime": 20090502, 
        "postID": 2, 
        "quote": "", 
        "reply": "2008 United States bank failures From Wikipedia, the free encyclopedia Jump to: navigation, search Twenty-five United States banks failed and were taken over by the Federal Deposit Insurance Corporation (FDIC) in 2008,[1] after only three failures in 2007 and none in 2006 or 2005.[2] A bank failure is the closing of a bank by a federal or state banking regulatory agency. The FDIC seizes a bank's assets when its capital levels are too low, or it cannot meet obligations the next day.[2][3] After seizing a bank's assets, the FDIC acts in two capacities—first, it pays insurance to the depositors, up to the deposit insurance limit, for assets not sold to another bank.", 
        "threadID": "672198221_8120063222001", 
        "time": "2009-05-02 20:10:00", 
        "title": "Georgia, New Jersey, Utah Banks Seized, That makes 32 for this year so far?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "The banking system isn't going to fail, so your money is safe. What we're actually seeing is a change in ownership, from individuals and corporations to public ownership. You may call that nationalization if you like. In actuality, it's more like a forced joint ownership. The upside to that is that with our representatives sitting on the Boards of Directors and in decision-making offices, we should see far, far less of the money pipeline which runs from large banks to Congress. That can't be a bad thing, can it?", 
        "intTime": 20090502, 
        "postID": 3, 
        "quote": "", 
        "reply": "The banking system isn't going to fail, so your money is safe. What we're actually seeing is a change in ownership, from individuals and corporations to public ownership. You may call that nationalization if you like. In actuality, it's more like a forced joint ownership. The upside to that is that with our representatives sitting on the Boards of Directors and in decision-making offices, we should see far, far less of the money pipeline which runs from large banks to Congress. That can't be a bad thing, can it?", 
        "threadID": "672198221_8120063222001", 
        "time": "2009-05-02 20:13:00", 
        "title": "Georgia, New Jersey, Utah Banks Seized, That makes 32 for this year so far?", 
        "userID": "stillkit"
    }, 
    {
        "content": "one by one...", 
        "intTime": 20090502, 
        "postID": 4, 
        "quote": "", 
        "reply": "one by one...", 
        "threadID": "672198221_8120063222001", 
        "time": "2009-05-02 21:05:00", 
        "title": "Georgia, New Jersey, Utah Banks Seized, That makes 32 for this year so far?", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "We all need to follow this. If you have money in a bank be sure to check out and it's rating, draw out your money if you see it going south MD", 
        "intTime": 20090503, 
        "postID": 5, 
        "quote": "", 
        "reply": "We all need to follow this. If you have money in a bank be sure to check out and it's rating, draw out your money if you see it going south MD", 
        "threadID": "672198221_8120063222001", 
        "time": "2009-05-03 04:17:00", 
        "title": "Georgia, New Jersey, Utah Banks Seized, That makes 32 for this year so far?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "Country Wide held my mortgage for the last two years. However, last month I got a letter from them saying that effective June 1st this year that Bank of America would be taking it over. Bam, the next day I went to Wells Fargo and refinanced at 5%. Can make up what it cost me in 2.5 years. I might have lost a couple Thousand but I feel better knowing I'm with a company that is more fair and honest than Country Wide and Bank of America. I didn't hear or see where Wells Fargo asked for bail out money. In fact they are still doing quite well on the stock exchange.", 
        "intTime": 20090503, 
        "postID": 6, 
        "quote": "", 
        "reply": "Country Wide held my mortgage for the last two years. However, last month I got a letter from them saying that effective June 1st this year that Bank of America would be taking it over. Bam, the next day I went to Wells Fargo and refinanced at 5%. Can make up what it cost me in 2.5 years. I might have lost a couple Thousand but I feel better knowing I'm with a company that is more fair and honest than Country Wide and Bank of America. I didn't hear or see where Wells Fargo asked for bail out money. In fact they are still doing quite well on the stock exchange.", 
        "threadID": "672198221_8120063222001", 
        "time": "2009-05-03 04:34:00", 
        "title": "Georgia, New Jersey, Utah Banks Seized, That makes 32 for this year so far?", 
        "userID": "Duster6"
    }, 
    {
        "content": "You've done your homework on banks Duster. I wish everyone would that has a morgage or investment in a bank.", 
        "intTime": 20090503, 
        "postID": 7, 
        "quote": "", 
        "reply": "You've done your homework on banks Duster. I wish everyone would that has a morgage or investment in a bank.", 
        "threadID": "672198221_8120063222001", 
        "time": "2009-05-03 05:47:00", 
        "title": "Georgia, New Jersey, Utah Banks Seized, That makes 32 for this year so far?", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: You've done your homework on banks Duster. I wish everyone would that has a morgage or investment in a bank. Your so right dog. I'll give you another example. My home owners insurance and car insurance(Tundra and Camry)is with State Farm. I went to Farm Bureau insurance and they gave me better home protection at a lower price. They also saved me about $200.00 on my auto insurance but again gave me better coverage and a lower deductible. Its time for Americans to wake up and understand that there are bargains out there, they just have to find them or ask for them.", 
        "intTime": 20090503, 
        "postID": 8, 
        "quote": "Originally posted by mainedawg: You've done your homework on banks Duster. I wish everyone would that has a morgage or investment in a bank.", 
        "reply": " Your so right dog. I'll give you another example. My home owners insurance and car insurance(Tundra and Camry)is with State Farm. I went to Farm Bureau insurance and they gave me better home protection at a lower price. They also saved me about $200.00 on my auto insurance but again gave me better coverage and a lower deductible. Its time for Americans to wake up and understand that there are bargains out there, they just have to find them or ask for them.", 
        "threadID": "672198221_8120063222001", 
        "time": "2009-05-03 07:20:00", 
        "title": "Georgia, New Jersey, Utah Banks Seized, That makes 32 for this year so far?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by stillkit: The banking system isn't going to fail, so your money is safe. What we're actually seeing is a change in ownership, from individuals and corporations to public ownership. You may call that nationalization if you like. In actuality, it's more like a forced joint ownership. The upside to that is that with our representatives sitting on the Boards of Directors and in decision-making offices, we should see far, far less of the money pipeline which runs from large banks to Congress. That can't be a bad thing, can it? Giving our elected officials the keys for a bank is like putting alcoholics in charge of a bar. They'll just eliminate the middlemen and keep more for themselves. It would be delusional to think that the people will benefit in any way or that there is any sort of \"upside\" to be had.", 
        "intTime": 20090503, 
        "postID": 9, 
        "quote": "Originally posted by stillkit: The banking system isn't going to fail, so your money is safe. What we're actually seeing is a change in ownership, from individuals and corporations to public ownership. You may call that nationalization if you like. In actuality, it's more like a forced joint ownership. The upside to that is that with our representatives sitting on the Boards of Directors and in decision-making offices, we should see far, far less of the money pipeline which runs from large banks to Congress. That can't be a bad thing, can it?", 
        "reply": " Giving our elected officials the keys for a bank is like putting alcoholics in charge of a bar. They'll just eliminate the middlemen and keep more for themselves. It would be delusional to think that the people will benefit in any way or that there is any sort of \"upside\" to be had.", 
        "threadID": "672198221_8120063222001", 
        "time": "2009-05-03 07:25:00", 
        "title": "Georgia, New Jersey, Utah Banks Seized, That makes 32 for this year so far?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: Ten times as many as last year. With this rate the banking system will be gone in just a short time. How safe is your money? Oh, puh-lease. It's already obvious which banks are going to be seized and which ones aren't. Most of the market effects of bank seizures have already passed. How many financial insitutions are there in the United States? There's thousands.", 
        "intTime": 20090503, 
        "postID": 10, 
        "quote": "Originally posted by mainedawg: Ten times as many as last year. With this rate the banking system will be gone in just a short time. How safe is your money?", 
        "reply": " Oh, puh-lease. It's already obvious which banks are going to be seized and which ones aren't. Most of the market effects of bank seizures have already passed. How many financial insitutions are there in the United States? There's thousands.", 
        "threadID": "672198221_8120063222001", 
        "time": "2009-05-03 09:21:00", 
        "title": "Georgia, New Jersey, Utah Banks Seized, That makes 32 for this year so far?", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by mainedawg: Ten times as many as last year. With this rate the banking system will be gone in just a short time. How safe is your money? Oh, puh-lease. It's already obvious which banks are going to be seized and which ones aren't. Most of the market effects of bank seizures have already passed. How many financial insitutions are there in the United States? There's thousands. And with each one that fails there is just that much less competition and when that declines consumers never benefit. There may well be thousands scattered about the country but it will only take a few hundred in key locations to have a strong effect on the economy.", 
        "intTime": 20090503, 
        "postID": 11, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by mainedawg: Ten times as many as last year. With this rate the banking system will be gone in just a short time. How safe is your money? Oh, puh-lease. It's already obvious which banks are going to be seized and which ones aren't. Most of the market effects of bank seizures have already passed. How many financial insitutions are there in the United States? There's thousands.", 
        "reply": " And with each one that fails there is just that much less competition and when that declines consumers never benefit. There may well be thousands scattered about the country but it will only take a few hundred in key locations to have a strong effect on the economy.", 
        "threadID": "672198221_8120063222001", 
        "time": "2009-05-03 16:14:00", 
        "title": "Georgia, New Jersey, Utah Banks Seized, That makes 32 for this year so far?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by mainedawg: We all need to follow this. If you have money in a bank be sure to check out and it's rating, draw out your money if you see it going south MD You're advice SHOULD read, \"Draw out your money if you have over 250K.\" That's the cutoff point for FDIC insurance. I use WA-MU, and when stories appeared about it being about to tank, I didn't worry a bit. Course, I have less than 250K... Dave", 
        "intTime": 20090503, 
        "postID": 12, 
        "quote": "Originally posted by mainedawg: We all need to follow this. If you have money in a bank be sure to check out and it's rating, draw out your money if you see it going south MD", 
        "reply": " You're advice SHOULD read, \"Draw out your money if you have over 250K.\" That's the cutoff point for FDIC insurance. I use WA-MU, and when stories appeared about it being about to tank, I didn't worry a bit. Course, I have less than 250K... Dave", 
        "threadID": "672198221_8120063222001", 
        "time": "2009-05-03 16:18:00", 
        "title": "Georgia, New Jersey, Utah Banks Seized, That makes 32 for this year so far?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by stillkit: The banking system isn't going to fail, so your money is safe. What we're actually seeing is a change in ownership, from individuals and corporations to public ownership. You may call that nationalization if you like. In actuality, it's more like a forced joint ownership. The upside to that is that with our representatives sitting on the Boards of Directors and in decision-making offices, we should see far, far less of the money pipeline which runs from large banks to Congress. That can't be a bad thing, can it? Giving our elected officials the keys for a bank is like putting alcoholics in charge of a bar. They'll just eliminate the middlemen and keep more for themselves. It would be delusional to think that the people will benefit in any way or that there is any sort of \"upside\" to be had. All these banks will be returned to the private sector, OR cease to exist. The purpose of these seizures, is to protect the depositors, not screw the banks. These banks aren't being bailed out, they are being seized because they are about to fail, and unlike banks like Citi Bank, they're \"not to big to fail.\" Dave", 
        "intTime": 20090503, 
        "postID": 13, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by stillkit: The banking system isn't going to fail, so your money is safe. What we're actually seeing is a change in ownership, from individuals and corporations to public ownership. You may call that nationalization if you like. In actuality, it's more like a forced joint ownership. The upside to that is that with our representatives sitting on the Boards of Directors and in decision-making offices, we should see far, far less of the money pipeline which runs from large banks to Congress. That can't be a bad thing, can it? Giving our elected officials the keys for a bank is like putting alcoholics in charge of a bar. They'll just eliminate the middlemen and keep more for themselves. It would be delusional to think that the people will benefit in any way or that there is any sort of \"upside\" to be had.", 
        "reply": " All these banks will be returned to the private sector, OR cease to exist. The purpose of these seizures, is to protect the depositors, not screw the banks. These banks aren't being bailed out, they are being seized because they are about to fail, and unlike banks like Citi Bank, they're \"not to big to fail.\" Dave", 
        "threadID": "672198221_8120063222001", 
        "time": "2009-05-03 16:22:00", 
        "title": "Georgia, New Jersey, Utah Banks Seized, That makes 32 for this year so far?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by adminnco1: quote: Originally posted by stillkit: The banking system isn't going to fail, so your money is safe. What we're actually seeing is a change in ownership, from individuals and corporations to public ownership. You may call that nationalization if you like. In actuality, it's more like a forced joint ownership. The upside to that is that with our representatives sitting on the Boards of Directors and in decision-making offices, we should see far, far less of the money pipeline which runs from large banks to Congress. That can't be a bad thing, can it? Giving our elected officials the keys for a bank is like putting alcoholics in charge of a bar. They'll just eliminate the middlemen and keep more for themselves. It would be delusional to think that the people will benefit in any way or that there is any sort of \"upside\" to be had. All these banks will be returned to the private sector, OR cease to exist. The purpose of these seizures, is to protect the depositors, not screw the banks. These banks aren't being bailed out, they are being seized because they are about to fail, and unlike banks like Citi Bank, they're \"not to big to fail.\" Dave You are operating under the truly bizarre assumption that \"trust\" and \"politician\" are not mutually exclusive terms.", 
        "intTime": 20090503, 
        "postID": 14, 
        "quote": "Originally posted by Grachus: quote: Originally posted by adminnco1: quote: Originally posted by stillkit: The banking system isn't going to fail, so your money is safe. What we're actually seeing is a change in ownership, from individuals and corporations to public ownership. You may call that nationalization if you like. In actuality, it's more like a forced joint ownership. The upside to that is that with our representatives sitting on the Boards of Directors and in decision-making offices, we should see far, far less of the money pipeline which runs from large banks to Congress. That can't be a bad thing, can it? Giving our elected officials the keys for a bank is like putting alcoholics in charge of a bar. They'll just eliminate the middlemen and keep more for themselves. It would be delusional to think that the people will benefit in any way or that there is any sort of \"upside\" to be had. All these banks will be returned to the private sector, OR cease to exist. The purpose of these seizures, is to protect the depositors, not screw the banks. These banks aren't being bailed out, they are being seized because they are about to fail, and unlike banks like Citi Bank, they're \"not to big to fail.\" Dave", 
        "reply": " You are operating under the truly bizarre assumption that \"trust\" and \"politician\" are not mutually exclusive terms.", 
        "threadID": "672198221_8120063222001", 
        "time": "2009-05-03 18:13:00", 
        "title": "Georgia, New Jersey, Utah Banks Seized, That makes 32 for this year so far?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: Giving our elected officials the keys for a bank is like putting alcoholics in charge of a bar. They'll just eliminate the middlemen and keep more for themselves. It would be delusional to think that the people will benefit in any way or that there is any sort of \"upside\" to be had. Too late. These banks failed in the first place because of greed.", 
        "intTime": 20090504, 
        "postID": 15, 
        "quote": "Originally posted by adminnco1: Giving our elected officials the keys for a bank is like putting alcoholics in charge of a bar. They'll just eliminate the middlemen and keep more for themselves. It would be delusional to think that the people will benefit in any way or that there is any sort of \"upside\" to be had.", 
        "reply": " Too late. These banks failed in the first place because of greed.", 
        "threadID": "672198221_8120063222001", 
        "time": "2009-05-04 04:41:00", 
        "title": "Georgia, New Jersey, Utah Banks Seized, That makes 32 for this year so far?", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: And with each one that fails there is just that much less competition and when that declines consumers never benefit. There may well be thousands scattered about the country but it will only take a few hundred in key locations to have a strong effect on the economy. 1. Do you know how many banks fail every year regardless of the economic climate? 2. If we had allowed AIG and CitiGroup to fail (like you conservatives wanted), you'd have your hundreds of banks failing.", 
        "intTime": 20090504, 
        "postID": 16, 
        "quote": "Originally posted by adminnco1: And with each one that fails there is just that much less competition and when that declines consumers never benefit. There may well be thousands scattered about the country but it will only take a few hundred in key locations to have a strong effect on the economy.", 
        "reply": " 1. Do you know how many banks fail every year regardless of the economic climate? 2. If we had allowed AIG and CitiGroup to fail (like you conservatives wanted), you'd have your hundreds of banks failing.", 
        "threadID": "672198221_8120063222001", 
        "time": "2009-05-04 04:44:00", 
        "title": "Georgia, New Jersey, Utah Banks Seized, That makes 32 for this year so far?", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: end of 2009. Utah: On Friday evening the FDIC also became the receiver of America West Bank, after the Utah regulators closed the institution. The Layton, Utah-based bank had total assets of approximately $299.4 million and total deposits of $284.1 million as of Dec. 31. Cache Valley Bank, based in Logan, Utah, is assuming all deposits, paying discounted price of $352,000. It also agreed to buy nearly $11 million worth of America West's assets and took a 30-day option to purchase loans at book value. The FDIC estimates that the cost to the Deposit Insurance Fund will be $119.4 million. America West's three branches will reopen Monday as Cache Valley Bank outposts. Checking accounts, debit cards still work: Through the weekend, depositors of both Citizens Community Bank and America West Bank can access their money by writing checks or using ATM or debit cards. Checks drawn on either of the failed banks will continue to be processed, and the FDIC said loan customers should continue to make their payments as usual. This is the first I have heard of this, but that is in Northern Utah, and I live in Central Utah. Most of the time, these things are done pretty quietly on a weekend to avoid any panic - - There has been a lot of over-inflation of size and price of homes in Utah, along with a lot of shady lending practices, greed, ponzi schemes...you name it...in Utah. Wouldn't surprise me if this is just the tip of the ice berg, and the whole state goes bust!! You'd think, in a State as Religious as this, that the Church would be sending up all kinds of red flags about all these shady housing loans and the terrible inflation it is causing, but there is probably and obvious reason for the silence: Many of the highest church officials are bankers and realitors. They are also high-up officials in the government - state and local. All of these entities FEED HEAVILY on the inflation causes by soaring property values! Tithes, Interest, and Taxes all swell right along with the inflation rate, filling all the coffers of the Church/Bank/Government, while bleeding everyone else dry - - As terrible as it may sound - this whole system of vast wealth wrung from those at the bottom via inflated Tithes/Interests/Taxes going to those at the top needs to crash down - - Wandering and Wondering", 
        "intTime": 20090504, 
        "postID": 17, 
        "quote": "end of 2009. Utah: On Friday evening the FDIC also became the receiver of America West Bank, after the Utah regulators closed the institution. The Layton, Utah-based bank had total assets of approximately $299.4 million and total deposits of $284.1 million as of Dec. 31. Cache Valley Bank, based in Logan, Utah, is assuming all deposits, paying discounted price of $352,000. It also agreed to buy nearly $11 million worth of America West's assets and took a 30-day option to purchase loans at book value. The FDIC estimates that the cost to the Deposit Insurance Fund will be $119.4 million. America West's three branches will reopen Monday as Cache Valley Bank outposts. Checking accounts, debit cards still work: Through the weekend, depositors of both Citizens Community Bank and America West Bank can access their money by writing checks or using ATM or debit cards. Checks drawn on either of the failed banks will continue to be processed, and the FDIC said loan customers should continue to make their payments as usual.", 
        "reply": " This is the first I have heard of this, but that is in Northern Utah, and I live in Central Utah. Most of the time, these things are done pretty quietly on a weekend to avoid any panic - - There has been a lot of over-inflation of size and price of homes in Utah, along with a lot of shady lending practices, greed, ponzi schemes...you name it...in Utah. Wouldn't surprise me if this is just the tip of the ice berg, and the whole state goes bust!! You'd think, in a State as Religious as this, that the Church would be sending up all kinds of red flags about all these shady housing loans and the terrible inflation it is causing, but there is probably and obvious reason for the silence: Many of the highest church officials are bankers and realitors. They are also high-up officials in the government - state and local. All of these entities FEED HEAVILY on the inflation causes by soaring property values! Tithes, Interest, and Taxes all swell right along with the inflation rate, filling all the coffers of the Church/Bank/Government, while bleeding everyone else dry - - As terrible as it may sound - this whole system of vast wealth wrung from those at the bottom via inflated Tithes/Interests/Taxes going to those at the top needs to crash down - - Wandering and Wondering", 
        "threadID": "672198221_8120063222001", 
        "time": "2009-05-04 05:06:00", 
        "title": "Georgia, New Jersey, Utah Banks Seized, That makes 32 for this year so far?", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Grachus: quote: Originally posted by adminnco1: quote: Originally posted by stillkit: The banking system isn't going to fail, so your money is safe. What we're actually seeing is a change in ownership, from individuals and corporations to public ownership. You may call that nationalization if you like. In actuality, it's more like a forced joint ownership. The upside to that is that with our representatives sitting on the Boards of Directors and in decision-making offices, we should see far, far less of the money pipeline which runs from large banks to Congress. That can't be a bad thing, can it? Giving our elected officials the keys for a bank is like putting alcoholics in charge of a bar. They'll just eliminate the middlemen and keep more for themselves. It would be delusional to think that the people will benefit in any way or that there is any sort of \"upside\" to be had. All these banks will be returned to the private sector, OR cease to exist. The purpose of these seizures, is to protect the depositors, not screw the banks. These banks aren't being bailed out, they are being seized because they are about to fail, and unlike banks like Citi Bank, they're \"not to big to fail.\" Dave You are operating under the truly bizarre assumption that \"trust\" and \"politician\" are not mutually exclusive terms. The FDIC is an independant government owned Corporation. The Board members are indeed appointed by the President, and then ratified by Congress, but they are NOT POLITICIANS. The government has no say so in running the FDIC. They cannot veto any act of the FDIC. In other words, neither Mr. Bush, or Mr. Obama can tell them a damned thing. All the current Board members are Bush appointee's, but I don't say that to tar them as being wingnuts. I think that they are fulfilling their mandate in the appropriate manner, even though they are Bush appointee's. \"http://www.fdic.gov/about/learn/board/board.html\" Dave", 
        "intTime": 20090504, 
        "postID": 18, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Grachus: quote: Originally posted by adminnco1: quote: Originally posted by stillkit: The banking system isn't going to fail, so your money is safe. What we're actually seeing is a change in ownership, from individuals and corporations to public ownership. You may call that nationalization if you like. In actuality, it's more like a forced joint ownership. The upside to that is that with our representatives sitting on the Boards of Directors and in decision-making offices, we should see far, far less of the money pipeline which runs from large banks to Congress. That can't be a bad thing, can it? Giving our elected officials the keys for a bank is like putting alcoholics in charge of a bar. They'll just eliminate the middlemen and keep more for themselves. It would be delusional to think that the people will benefit in any way or that there is any sort of \"upside\" to be had. All these banks will be returned to the private sector, OR cease to exist. The purpose of these seizures, is to protect the depositors, not screw the banks. These banks aren't being bailed out, they are being seized because they are about to fail, and unlike banks like Citi Bank, they're \"not to big to fail.\" Dave You are operating under the truly bizarre assumption that \"trust\" and \"politician\" are not mutually exclusive terms.", 
        "reply": " The FDIC is an independant government owned Corporation. The Board members are indeed appointed by the President, and then ratified by Congress, but they are NOT POLITICIANS. The government has no say so in running the FDIC. They cannot veto any act of the FDIC. In other words, neither Mr. Bush, or Mr. Obama can tell them a damned thing. All the current Board members are Bush appointee's, but I don't say that to tar them as being wingnuts. I think that they are fulfilling their mandate in the appropriate manner, even though they are Bush appointee's. \"http://www.fdic.gov/about/learn/board/board.html\" Dave", 
        "threadID": "672198221_8120063222001", 
        "time": "2009-05-04 11:25:00", 
        "title": "Georgia, New Jersey, Utah Banks Seized, That makes 32 for this year so far?", 
        "userID": "Grachus"
    }
]