[
    {
        "content": "This crash was the topic of an earlier thread on ITN ... with much speculation. Here is an article on the outcome of the investigation. quote: CNN) -- The Marine Corps has sacked four top officers of a California-based fighter squadron over the December crash of a fighter jet that slammed into a San Diego neighborhood, the service announced Tuesday. Deferred maintenance and faulty decisions by the pilot and squadron members with whom he was communicating on the ground contributed to the crash, a Marine Corps investigation concluded. The commander of the squadron involved, its top maintenance officer and two others have been relieved of duty as a result of the investigation, and nine other Marines have received other disciplinary action, Maj. Gen. Randolph Alles said. The jet crashed in the University City neighborhood of San Diego, about three miles short of the Miramar airfield. Two adults and two small children from a Korean immigrant family were killed when the jet slammed into their house. . . Maintenance rules don't require immediate repairs for the problem, he said, but the squadron flew the jet 146 times before it eventually crashed because its left engine was starved for fuel. \"The end result was that the squadron elected to fly an aircraft that had a degraded fuel system on the left side of the aircraft,\" Rupp said. \"This is a critical point, and this was collectively questionable judgment on the part of the squadron's maintenance department.\" <more> \"http://www.cnn.com/2009/US/03/03/plane.crash/index.html\"", 
        "intTime": 20090304, 
        "postID": 1, 
        "quote": "CNN) -- The Marine Corps has sacked four top officers of a California-based fighter squadron over the December crash of a fighter jet that slammed into a San Diego neighborhood, the service announced Tuesday. Deferred maintenance and faulty decisions by the pilot and squadron members with whom he was communicating on the ground contributed to the crash, a Marine Corps investigation concluded. The commander of the squadron involved, its top maintenance officer and two others have been relieved of duty as a result of the investigation, and nine other Marines have received other disciplinary action, Maj. Gen. Randolph Alles said. The jet crashed in the University City neighborhood of San Diego, about three miles short of the Miramar airfield. Two adults and two small children from a Korean immigrant family were killed when the jet slammed into their house. . . Maintenance rules don't require immediate repairs for the problem, he said, but the squadron flew the jet 146 times before it eventually crashed because its left engine was starved for fuel. \"The end result was that the squadron elected to fly an aircraft that had a degraded fuel system on the left side of the aircraft,\" Rupp said. \"This is a critical point, and this was collectively questionable judgment on the part of the squadron's maintenance department.\" <more> \"http://www.cnn.com/2009/US/03/03/plane.crash/index.html\"", 
        "reply": "This crash was the topic of an earlier thread on ITN ... with much speculation. Here is an article on the outcome of the investigation. ", 
        "threadID": "672198221_4300078612001", 
        "time": "2009-03-04 05:06:00", 
        "title": "Crash Investigation - Marine Corps Sacks Four (4)", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "A 'black eye' for them. A 'feather in the cap' of the Corps.", 
        "intTime": 20090304, 
        "postID": 2, 
        "quote": "", 
        "reply": "A 'black eye' for them. A 'feather in the cap' of the Corps.", 
        "threadID": "672198221_4300078612001", 
        "time": "2009-03-04 07:49:00", 
        "title": "Crash Investigation - Marine Corps Sacks Four (4)", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: A 'black eye' for them. A 'feather in the cap' of the Corps. Yes and no... Aircraft flying with \"marginal\" systems, is nothing new, especially in \"peace time\" operations... Stretched budgets, short training flight hours, straining to meet operational commitments, no funding for spare parts... This is what usually leads to this type of accident... This is what happens when the \"peace time\" philosophy goes horribly wrong... If they had not had the accident and they did not meet their \"mission requirements\", they would have been given bad fitness reports, if they didn't meet the \"operational commitment\"... If they loose a bird and kill people, they get hung out, even worse... It's a \"d@mned if you do and d@mned if you don't!\" situation... Maybe this will end that type of situation, maybe it won't, that's also the tragedy here... No, I'm not down playing the loss of life, just that there is more here than meets the \"official reason\" for the accident... IMHO... Respectfully, SUNLINER8", 
        "intTime": 20090304, 
        "postID": 3, 
        "quote": "Originally posted by popsiq: A 'black eye' for them. A 'feather in the cap' of the Corps.", 
        "reply": " Yes and no... Aircraft flying with \"marginal\" systems, is nothing new, especially in \"peace time\" operations... Stretched budgets, short training flight hours, straining to meet operational commitments, no funding for spare parts... This is what usually leads to this type of accident... This is what happens when the \"peace time\" philosophy goes horribly wrong... If they had not had the accident and they did not meet their \"mission requirements\", they would have been given bad fitness reports, if they didn't meet the \"operational commitment\"... If they loose a bird and kill people, they get hung out, even worse... It's a \"d@mned if you do and d@mned if you don't!\" situation... Maybe this will end that type of situation, maybe it won't, that's also the tragedy here... No, I'm not down playing the loss of life, just that there is more here than meets the \"official reason\" for the accident... IMHO... Respectfully, SUNLINER8", 
        "threadID": "672198221_4300078612001", 
        "time": "2009-03-04 08:09:00", 
        "title": "Crash Investigation - Marine Corps Sacks Four (4)", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "You must be joking, there's NO excuse for flying an A/C with a degraded fuel system, thats a NECESSARY system unlike the radar or ordinance management systems. A degraded combat system is no reason to ground an aircraft, but a degraded flight control system or powerplant should have been addressed immediately to ensure the safety of the a/c, the pilot, and everyone on the ground. Unfortunately it cost 4 men their careers and the lives of those on the ground as well as a costly aircraft, and it all could've been avoided. I hope we learned a lesson here...", 
        "intTime": 20090304, 
        "postID": 4, 
        "quote": "", 
        "reply": "You must be joking, there's NO excuse for flying an A/C with a degraded fuel system, thats a NECESSARY system unlike the radar or ordinance management systems. A degraded combat system is no reason to ground an aircraft, but a degraded flight control system or powerplant should have been addressed immediately to ensure the safety of the a/c, the pilot, and everyone on the ground. Unfortunately it cost 4 men their careers and the lives of those on the ground as well as a costly aircraft, and it all could've been avoided. I hope we learned a lesson here...", 
        "threadID": "672198221_4300078612001", 
        "time": "2009-03-04 10:32:00", 
        "title": "Crash Investigation - Marine Corps Sacks Four (4)", 
        "userID": "MaddogK"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by popsiq: A 'black eye' for them. A 'feather in the cap' of the Corps. Yes and no... Aircraft flying with \"marginal\" systems, is nothing new, especially in \"peace time\" operations... Stretched budgets, short training flight hours, straining to meet operational commitments, no funding for spare parts... This is what usually leads to this type of accident... This is what happens when the \"peace time\" philosophy goes horribly wrong... If they had not had the accident and they did not meet their \"mission requirements\", they would have been given bad fitness reports, if they didn't meet the \"operational commitment\"... If they loose a bird and kill people, they get hung out, even worse... It's a \"d@mned if you do and d@mned if you don't!\" situation... Maybe this will end that type of situation, maybe it won't, that's also the tragedy here... No, I'm not down playing the loss of life, just that there is more here than meets the \"official reason\" for the accident... IMHO... Respectfully, SUNLINER8 Sunliners, I am not certain what the Marine Corps or Navy's regulations are for in-flight emergencies or in-flight incidents. But I do know Army Regulations on the subject. We call an in-flight incident that forces/advises an aircraft to land a \"precautionary.\" That would mean, single engine failure in a multi-engine airframe, Master Caution lights, Bird strikes, etc., we also treat Precautionary landings the exact same way we do an in-flight emergency. Specifically, the PIC has no options on where he/she would like to land. They must head for the nearest safe landing zone... aka: for fixed wings, Nearest airfield that has a long enough runway. They have no other options. This accident apparently happened because the PIC didn't wish to be inconvenienced by landing at a remote site. Sounds as if he was more interested in not ruining his evening by awaiting secondary transportation home. And I suspect it was Command’s wish not to have to recover that aircraft at a later time… possibly for the reason you indicated… readiness. I like the Army way better… saves more lives and airframes.", 
        "intTime": 20090304, 
        "postID": 5, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by popsiq: A 'black eye' for them. A 'feather in the cap' of the Corps. Yes and no... Aircraft flying with \"marginal\" systems, is nothing new, especially in \"peace time\" operations... Stretched budgets, short training flight hours, straining to meet operational commitments, no funding for spare parts... This is what usually leads to this type of accident... This is what happens when the \"peace time\" philosophy goes horribly wrong... If they had not had the accident and they did not meet their \"mission requirements\", they would have been given bad fitness reports, if they didn't meet the \"operational commitment\"... If they loose a bird and kill people, they get hung out, even worse... It's a \"d@mned if you do and d@mned if you don't!\" situation... Maybe this will end that type of situation, maybe it won't, that's also the tragedy here... No, I'm not down playing the loss of life, just that there is more here than meets the \"official reason\" for the accident... IMHO... Respectfully, SUNLINER8", 
        "reply": " Sunliners, I am not certain what the Marine Corps or Navy's regulations are for in-flight emergencies or in-flight incidents. But I do know Army Regulations on the subject. We call an in-flight incident that forces/advises an aircraft to land a \"precautionary.\" That would mean, single engine failure in a multi-engine airframe, Master Caution lights, Bird strikes, etc., we also treat Precautionary landings the exact same way we do an in-flight emergency. Specifically, the PIC has no options on where he/she would like to land. They must head for the nearest safe landing zone... aka: for fixed wings, Nearest airfield that has a long enough runway. They have no other options. This accident apparently happened because the PIC didn't wish to be inconvenienced by landing at a remote site. Sounds as if he was more interested in not ruining his evening by awaiting secondary transportation home. And I suspect it was Command’s wish not to have to recover that aircraft at a later time… possibly for the reason you indicated… readiness. I like the Army way better… saves more lives and airframes.", 
        "threadID": "672198221_4300078612001", 
        "time": "2009-03-04 10:50:00", 
        "title": "Crash Investigation - Marine Corps Sacks Four (4)", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by popsiq: A 'black eye' for them. A 'feather in the cap' of the Corps. Yes and no... Aircraft flying with \"marginal\" systems, is nothing new, especially in \"peace time\" operations... Stretched budgets, short training flight hours, straining to meet operational commitments, no funding for spare parts... This is what usually leads to this type of accident... This is what happens when the \"peace time\" philosophy goes horribly wrong... If they had not had the accident and they did not meet their \"mission requirements\", they would have been given bad fitness reports, if they didn't meet the \"operational commitment\"... If they loose a bird and kill people, they get hung out, even worse... It's a \"d@mned if you do and d@mned if you don't!\" situation... Maybe this will end that type of situation, maybe it won't, that's also the tragedy here... No, I'm not down playing the loss of life, just that there is more here than meets the \"official reason\" for the accident... IMHO... Respectfully, SUNLINER8 Sunliner81 I will agree with a part of your post. There are times when stretched budgets, short training flight hours and straining to meet operational requirements can cause unwanted things to happen. However, there is one document that was obviously grossly overlooked in this situation--it's called NATOPS. It gives strict guidelines for maintenance and operational requirements. Any violation of NATOPS especially one that causes an accident will generally cause many heads to roll. The CO is ultimately responsible, but if the OPs boss puts pressure on the AMO to meet the flight schedule, it can and often boils down to a matter of who has the biggest balls I'm sorry to say. A big however is this. ANYTHING THAT INVOLVES A SAFETY OF FLIGHT ISSUE LIKE A DEGRADED FUEL SYSTEM SHOULD HAVE HAD RED FLAGS FLYING ALL OVER MAINTENANCE CONTROL. I SERIOUSLY QUESTION THE STATEMENT THAT THERE ARE NO MAINTENANCE RULES THAT EXIST THAT DO NOT COVER ANY FUEL SYSTEM PROBLEM! Another big no no is the concern of the pilot not wanting to land elsewhere due to an inconvenient alternative field OR A PERSONAL INCONVENIENCE! This boy had no business being in that seat with that kind of misguided judgement. In my 22 years of aviation maintenance, there were many times that as a Maintenance Control Chief and/or QA Chief, I downed many aircraft that neither the MO or OPS boss didn't like. But, I never had to worry that a crew was going to die on a mission because of a mistake I made.", 
        "intTime": 20090304, 
        "postID": 6, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by popsiq: A 'black eye' for them. A 'feather in the cap' of the Corps. Yes and no... Aircraft flying with \"marginal\" systems, is nothing new, especially in \"peace time\" operations... Stretched budgets, short training flight hours, straining to meet operational commitments, no funding for spare parts... This is what usually leads to this type of accident... This is what happens when the \"peace time\" philosophy goes horribly wrong... If they had not had the accident and they did not meet their \"mission requirements\", they would have been given bad fitness reports, if they didn't meet the \"operational commitment\"... If they loose a bird and kill people, they get hung out, even worse... It's a \"d@mned if you do and d@mned if you don't!\" situation... Maybe this will end that type of situation, maybe it won't, that's also the tragedy here... No, I'm not down playing the loss of life, just that there is more here than meets the \"official reason\" for the accident... IMHO... Respectfully, SUNLINER8", 
        "reply": " Sunliner81 I will agree with a part of your post. There are times when stretched budgets, short training flight hours and straining to meet operational requirements can cause unwanted things to happen. However, there is one document that was obviously grossly overlooked in this situation--it's called NATOPS. It gives strict guidelines for maintenance and operational requirements. Any violation of NATOPS especially one that causes an accident will generally cause many heads to roll. The CO is ultimately responsible, but if the OPs boss puts pressure on the AMO to meet the flight schedule, it can and often boils down to a matter of who has the biggest balls I'm sorry to say. A big however is this. ANYTHING THAT INVOLVES A SAFETY OF FLIGHT ISSUE LIKE A DEGRADED FUEL SYSTEM SHOULD HAVE HAD RED FLAGS FLYING ALL OVER MAINTENANCE CONTROL. I SERIOUSLY QUESTION THE STATEMENT THAT THERE ARE NO MAINTENANCE RULES THAT EXIST THAT DO NOT COVER ANY FUEL SYSTEM PROBLEM! Another big no no is the concern of the pilot not wanting to land elsewhere due to an inconvenient alternative field OR A PERSONAL INCONVENIENCE! This boy had no business being in that seat with that kind of misguided judgement. In my 22 years of aviation maintenance, there were many times that as a Maintenance Control Chief and/or QA Chief, I downed many aircraft that neither the MO or OPS boss didn't like. But, I never had to worry that a crew was going to die on a mission because of a mistake I made.", 
        "threadID": "672198221_4300078612001", 
        "time": "2009-03-04 18:57:00", 
        "title": "Crash Investigation - Marine Corps Sacks Four (4)", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by SUNLINER81: quote: Originally posted by popsiq: A 'black eye' for them. A 'feather in the cap' of the Corps. Yes and no... Aircraft flying with \"marginal\" systems, is nothing new, especially in \"peace time\" operations... Stretched budgets, short training flight hours, straining to meet operational commitments, no funding for spare parts... This is what usually leads to this type of accident... This is what happens when the \"peace time\" philosophy goes horribly wrong... If they had not had the accident and they did not meet their \"mission requirements\", they would have been given bad fitness reports, if they didn't meet the \"operational commitment\"... If they loose a bird and kill people, they get hung out, even worse... It's a \"d@mned if you do and d@mned if you don't!\" situation... Maybe this will end that type of situation, maybe it won't, that's also the tragedy here... No, I'm not down playing the loss of life, just that there is more here than meets the \"official reason\" for the accident... IMHO... Respectfully, SUNLINER8 Sunliners, I am not certain what the Marine Corps or Navy's regulations are for in-flight emergencies or in-flight incidents. But I do know Army Regulations on the subject. We call an in-flight incident that forces/advises an aircraft to land a \"precautionary.\" That would mean, single engine failure in a multi-engine airframe, Master Caution lights, Bird strikes, etc., we also treat Precautionary landings the exact same way we do an in-flight emergency. Specifically, the PIC has no options on where he/she would like to land. They must head for the nearest safe landing zone... aka: for fixed wings, Nearest airfield that has a long enough runway. They have no other options. This accident apparently happened because the PIC didn't wish to be inconvenienced by landing at a remote site. Sounds as if he was more interested in not ruining his evening by awaiting secondary transportation home. And I suspect it was Command’s wish not to have to recover that aircraft at a later time… possibly for the reason you indicated… readiness. I like the Army way better… saves more lives and airframes. ArtMarsh, I promise you the Navy has strict guidelines covering correct maintenance procedures for ALL to adhear to and they are at least identical if not better (because the Navy has a lot more airplanes). Unfortunately, there's no chapter that covers stupidity. I'm sure the Army guidelines don't have a chapter like that either. I cannot wait to see what the Naval Safety Center will have to say about this incident when they get involved.", 
        "intTime": 20090304, 
        "postID": 7, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by SUNLINER81: quote: Originally posted by popsiq: A 'black eye' for them. A 'feather in the cap' of the Corps. Yes and no... Aircraft flying with \"marginal\" systems, is nothing new, especially in \"peace time\" operations... Stretched budgets, short training flight hours, straining to meet operational commitments, no funding for spare parts... This is what usually leads to this type of accident... This is what happens when the \"peace time\" philosophy goes horribly wrong... If they had not had the accident and they did not meet their \"mission requirements\", they would have been given bad fitness reports, if they didn't meet the \"operational commitment\"... If they loose a bird and kill people, they get hung out, even worse... It's a \"d@mned if you do and d@mned if you don't!\" situation... Maybe this will end that type of situation, maybe it won't, that's also the tragedy here... No, I'm not down playing the loss of life, just that there is more here than meets the \"official reason\" for the accident... IMHO... Respectfully, SUNLINER8 Sunliners, I am not certain what the Marine Corps or Navy's regulations are for in-flight emergencies or in-flight incidents. But I do know Army Regulations on the subject. We call an in-flight incident that forces/advises an aircraft to land a \"precautionary.\" That would mean, single engine failure in a multi-engine airframe, Master Caution lights, Bird strikes, etc., we also treat Precautionary landings the exact same way we do an in-flight emergency. Specifically, the PIC has no options on where he/she would like to land. They must head for the nearest safe landing zone... aka: for fixed wings, Nearest airfield that has a long enough runway. They have no other options. This accident apparently happened because the PIC didn't wish to be inconvenienced by landing at a remote site. Sounds as if he was more interested in not ruining his evening by awaiting secondary transportation home. And I suspect it was Command’s wish not to have to recover that aircraft at a later time… possibly for the reason you indicated… readiness. I like the Army way better… saves more lives and airframes.", 
        "reply": " ArtMarsh, I promise you the Navy has strict guidelines covering correct maintenance procedures for ALL to adhear to and they are at least identical if not better (because the Navy has a lot more airplanes). Unfortunately, there's no chapter that covers stupidity. I'm sure the Army guidelines don't have a chapter like that either. I cannot wait to see what the Naval Safety Center will have to say about this incident when they get involved.", 
        "threadID": "672198221_4300078612001", 
        "time": "2009-03-04 19:02:00", 
        "title": "Crash Investigation - Marine Corps Sacks Four (4)", 
        "userID": "busnrete8"
    }, 
    {
        "content": "We get pretty timely reports on Naval aviation mishaps where I work. I heard more about this at work today, but it wasn't an official Safety Center report, and the investigation isn't over yet. The pilot was much closer to the airfield at North Island when he lost the first engine. But he was directed to fly to his more distant home airfield at Miramar instead of landing at North Island. I understand why they'd want the plane on home turf to make the needed repairs, but that seems like a particularly unwise decision under the circumstances. The pilot was on a training flight with what was an unfamiliar airframe to him, and pilot error very well may have contributed to the loss of the other engine. To his great credit though, he stayed with the plane and tried to steer it away from any dwellings until the absolute last possible moment. Waiting another instant to eject would only have added another fatality to the toll.", 
        "intTime": 20090304, 
        "postID": 8, 
        "quote": "", 
        "reply": "We get pretty timely reports on Naval aviation mishaps where I work. I heard more about this at work today, but it wasn't an official Safety Center report, and the investigation isn't over yet. The pilot was much closer to the airfield at North Island when he lost the first engine. But he was directed to fly to his more distant home airfield at Miramar instead of landing at North Island. I understand why they'd want the plane on home turf to make the needed repairs, but that seems like a particularly unwise decision under the circumstances. The pilot was on a training flight with what was an unfamiliar airframe to him, and pilot error very well may have contributed to the loss of the other engine. To his great credit though, he stayed with the plane and tried to steer it away from any dwellings until the absolute last possible moment. Waiting another instant to eject would only have added another fatality to the toll.", 
        "threadID": "672198221_4300078612001", 
        "time": "2009-03-04 21:44:00", 
        "title": "Crash Investigation - Marine Corps Sacks Four (4)", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "quote: Originally posted by BPCR45_90: We get pretty timely reports on Naval aviation mishaps where I work. I heard more about this at work today, but it wasn't an official Safety Center report, and the investigation isn't over yet. The pilot was much closer to the airfield at North Island when he lost the first engine. But he was directed to fly to his more distant home airfield at Miramar instead of landing at North Island. I understand why they'd want the plane on home turf to make the needed repairs, but that seems like a particularly unwise decision under the circumstances. The pilot was on a training flight with what was an unfamiliar airframe to him, and pilot error very well may have contributed to the loss of the other engine. To his great credit though, he stayed with the plane and tried to steer it away from any dwellings until the absolute last possible moment. Waiting another instant to eject would only have added another fatality to the toll. I failed to mention that staying with the A/C to avoid more casualties was to his credit. There's is still a lot of speculation yet, I'm sure. Is the gentleman at the Naval Safety Center still Grampa Pettybone?", 
        "intTime": 20090305, 
        "postID": 9, 
        "quote": "Originally posted by BPCR45_90: We get pretty timely reports on Naval aviation mishaps where I work. I heard more about this at work today, but it wasn't an official Safety Center report, and the investigation isn't over yet. The pilot was much closer to the airfield at North Island when he lost the first engine. But he was directed to fly to his more distant home airfield at Miramar instead of landing at North Island. I understand why they'd want the plane on home turf to make the needed repairs, but that seems like a particularly unwise decision under the circumstances. The pilot was on a training flight with what was an unfamiliar airframe to him, and pilot error very well may have contributed to the loss of the other engine. To his great credit though, he stayed with the plane and tried to steer it away from any dwellings until the absolute last possible moment. Waiting another instant to eject would only have added another fatality to the toll.", 
        "reply": " I failed to mention that staying with the A/C to avoid more casualties was to his credit. There's is still a lot of speculation yet, I'm sure. Is the gentleman at the Naval Safety Center still Grampa Pettybone?", 
        "threadID": "672198221_4300078612001", 
        "time": "2009-03-05 05:56:00", 
        "title": "Crash Investigation - Marine Corps Sacks Four (4)", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Hey guys, don't shoot the messenger!... I just stated the conditions, as YOU all know that they are, rightly or wrongly!... I have personally downed for flight, aircraft that had three different sources stating that the aircraft was down and for safety items, that's SAFETY, as in crew safety systems and I had a maintenance chief literally tear the maintenance action forms off of his board and tear them up!... Initially I wrote them up as \"up\" gripes, after consulting with the pilots and flight crews, because of mission requirements at the time... I was hesitant to do so, as it was for missing bailout warning horns on the RA-3 aircraft... I had the Daily Turn Around Cards, Pilot's Walk Around Cards and the Maintenance Instruction Manuals, all state that if the pressure in the nitrogen bottles fell below a certain point, the aircraft was down till serviced... Well, the bottles and HORNS were all missing, after the aircraft returned from scheduled depot level maintenance... My first reaction, must be an airframes change but, there was nothing to indicate so... Seems depot, i.e. civilian contractor, had to remove the horns and bottles to access areas where they had to do maintenance and FORGOT, to reinstall the bottles and nobody seemed to notice, civilian civil service inspectors and Navy inspectors, that they were missing... The long and the short of it is, that if the escape doors on a RA-3 are blown, everyone knows it and everyone is gonna be leaving the aircraft, hence, UP Gripes!... It was taking a chance, because if there was an accident, incident and heaven forbid, someone injured or killed, heads would roll... They were the only aircraft capable of doing their mission on station and if they were DOWN, the whole Pacific Missile Test Center, came to a halt... When the maintenance chief tore up the gripes and never intended to reinstall the systems, I changed them all to DOWN gripes and reinstated them, BIG BLOW UP!!!... The maintenance chief took it as a \"pizzing contest\" and he, having more horse power than I, I said, fine!... If there was an incident, it was on his head, as I had documented all my actions, zerox machines are wonderful, as are Plane Captain Daily Turn Around Logs... They flew and so do many other military aircraft, when the \"mission\" requires it, in actuality, or in someone's mind or both... This, from the limited data that is available to me, sounds just like one of those situations... D@mned if you do, d@mned if you don't!... Your fitness report reflects your desire to NOT meet mission requirements, if you are an officer and your quarterly evaluations reflect it, if you are enlisted, such is the \"peace time\" military, even though there is a war going on... The old saw of, \"Accidents are a chain of events. Break the chain, anywhere and the accident doesn't happen!\", is true... This is a case of, in peoples minds, the mission justified the actions and PEOPLE DIED!... It's not right, it never is but, there it is... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 05 March 2009 01:36 PM", 
        "intTime": 20090305, 
        "postID": 10, 
        "quote": "", 
        "reply": "Hey guys, don't shoot the messenger!... I just stated the conditions, as YOU all know that they are, rightly or wrongly!... I have personally downed for flight, aircraft that had three different sources stating that the aircraft was down and for safety items, that's SAFETY, as in crew safety systems and I had a maintenance chief literally tear the maintenance action forms off of his board and tear them up!... Initially I wrote them up as \"up\" gripes, after consulting with the pilots and flight crews, because of mission requirements at the time... I was hesitant to do so, as it was for missing bailout warning horns on the RA-3 aircraft... I had the Daily Turn Around Cards, Pilot's Walk Around Cards and the Maintenance Instruction Manuals, all state that if the pressure in the nitrogen bottles fell below a certain point, the aircraft was down till serviced... Well, the bottles and HORNS were all missing, after the aircraft returned from scheduled depot level maintenance... My first reaction, must be an airframes change but, there was nothing to indicate so... Seems depot, i.e. civilian contractor, had to remove the horns and bottles to access areas where they had to do maintenance and FORGOT, to reinstall the bottles and nobody seemed to notice, civilian civil service inspectors and Navy inspectors, that they were missing... The long and the short of it is, that if the escape doors on a RA-3 are blown, everyone knows it and everyone is gonna be leaving the aircraft, hence, UP Gripes!... It was taking a chance, because if there was an accident, incident and heaven forbid, someone injured or killed, heads would roll... They were the only aircraft capable of doing their mission on station and if they were DOWN, the whole Pacific Missile Test Center, came to a halt... When the maintenance chief tore up the gripes and never intended to reinstall the systems, I changed them all to DOWN gripes and reinstated them, BIG BLOW UP!!!... The maintenance chief took it as a \"pizzing contest\" and he, having more horse power than I, I said, fine!... If there was an incident, it was on his head, as I had documented all my actions, zerox machines are wonderful, as are Plane Captain Daily Turn Around Logs... They flew and so do many other military aircraft, when the \"mission\" requires it, in actuality, or in someone's mind or both... This, from the limited data that is available to me, sounds just like one of those situations... D@mned if you do, d@mned if you don't!... Your fitness report reflects your desire to NOT meet mission requirements, if you are an officer and your quarterly evaluations reflect it, if you are enlisted, such is the \"peace time\" military, even though there is a war going on... The old saw of, \"Accidents are a chain of events. Break the chain, anywhere and the accident doesn't happen!\", is true... This is a case of, in peoples minds, the mission justified the actions and PEOPLE DIED!... It's not right, it never is but, there it is... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Thu 05 March 2009 01:36 PM", 
        "threadID": "672198221_4300078612001", 
        "time": "2009-03-05 11:47:00", 
        "title": "Crash Investigation - Marine Corps Sacks Four (4)", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Those errors were all common knowledge in the Air side of the Corps about 48hrs after. My only question was how many would be done.", 
        "intTime": 20090305, 
        "postID": 11, 
        "quote": "", 
        "reply": "Those errors were all common knowledge in the Air side of the Corps about 48hrs after. My only question was how many would be done.", 
        "threadID": "672198221_4300078612001", 
        "time": "2009-03-05 11:53:00", 
        "title": "Crash Investigation - Marine Corps Sacks Four (4)", 
        "userID": "GunnyRet03"
    }
]