[
    {
        "content": "Here is a three part series--examining the topic \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.01.002.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.05.001.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.08.001.pdart\"", 
        "intTime": 20090508, 
        "postID": 1, 
        "quote": "", 
        "reply": "Here is a three part series--examining the topic \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.01.002.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.05.001.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.08.001.pdart\"", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-08 21:51:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "3678131"
    }, 
    {
        "content": "Is there a corollary in forcing the rich to adopt?", 
        "intTime": 20090509, 
        "postID": 2, 
        "quote": "", 
        "reply": "Is there a corollary in forcing the rich to adopt?", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 06:51:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "popsiq"
    }, 
    {
        "content": "Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "intTime": 20090509, 
        "postID": 3, 
        "quote": "", 
        "reply": "Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 06:57:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren. I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090509, 
        "postID": 4, 
        "quote": "Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "reply": " I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 07:28:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough.", 
        "intTime": 20090509, 
        "postID": 5, 
        "quote": "I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government.", 
        "reply": " Yep, the incentive needs to stop, enough is enough.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 08:06:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "intTime": 20090509, 
        "postID": 6, 
        "quote": "Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough.", 
        "reply": " You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 08:30:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave Ya and additional hundreds of billions to corporate big wig retirement funds", 
        "intTime": 20090509, 
        "postID": 7, 
        "quote": "Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "reply": " Ya and additional hundreds of billions to corporate big wig retirement funds", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 08:51:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090509, 
        "postID": 8, 
        "quote": "Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "reply": " As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 09:02:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "L0A1"
    }, 
    {
        "content": "Oficially \"welfare\" may have been reforemd but that is just semantics as a barrage of other programs now funnel down to those that know how to milk the system. EIC from the IRS is welfare. HUD is welfare. Medicaid - medicair is welfare Food stamps is welfare. WIC is welfare. And I'm sure there are others that many collect for years and years. Welfare was started as a good program that has exploded into an abuse on the working people.", 
        "intTime": 20090509, 
        "postID": 9, 
        "quote": "", 
        "reply": "Oficially \"welfare\" may have been reforemd but that is just semantics as a barrage of other programs now funnel down to those that know how to milk the system. EIC from the IRS is welfare. HUD is welfare. Medicaid - medicair is welfare Food stamps is welfare. WIC is welfare. And I'm sure there are others that many collect for years and years. Welfare was started as a good program that has exploded into an abuse on the working people.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 09:32:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by Grachus: You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave quote: Originally posted by L0A1: As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Well, I don't know what your State program is. But State Programs are largely funded by Federal money. As I said, Federal money can only be given for two year stretches, five year cumulative maximum. Here in NYC, you can't even get any welfare without working for the City. And yes, the City does provide day care while you are fulfilling your work obligation. Google it. Personally, I've always thought that the only welfare program that makes sense, is a living wage law, coupled with job training if you have no skills. Dave", 
        "intTime": 20090509, 
        "postID": 10, 
        "quote": "Originally posted by Grachus: You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "reply": " quote: Originally posted by L0A1: As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Well, I don't know what your State program is. But State Programs are largely funded by Federal money. As I said, Federal money can only be given for two year stretches, five year cumulative maximum. Here in NYC, you can't even get any welfare without working for the City. And yes, the City does provide day care while you are fulfilling your work obligation. Google it. Personally, I've always thought that the only welfare program that makes sense, is a living wage law, coupled with job training if you have no skills. Dave", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 09:43:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren. Didn't know you needed medical care to buy condoms.....interesting.", 
        "intTime": 20090509, 
        "postID": 11, 
        "quote": "Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "reply": " Didn't know you needed medical care to buy condoms.....interesting.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 10:03:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "sw614"
    }, 
    {
        "content": "I think that if a person has a kid while already on welfare, then that person shouldn't get another dime. I know, it punishes the innocent child, but I'm tired of people breeding without restraint just to get additional benefits out of my tax dollars. People already KNOW how to use contraception. It's not rocket science, and even the dumbest high-school dropout knows how to use a rubber. The challenge is empowering women to take care of their own contraception needs, to give them the tools to educate themselves, and the promise of a world where the rewards of WORKING and EARNING a living are better than popping out kids to receive handouts and welfare. Sure, it costs a few dollars for Planned Parenthood to give out free birth control pills... but that costs a LOT LESS than years and years of welfare payments and other benefits for a low-income child. And if women who had never otherwise been given an option in life were to receive the support to seek a path other than perpetual childbearing and welfare, they might actually break the cycle. Will everyone break the cycle? Of course not. But if you take away the incentive of perpetual welfare payments, and make it more lucrative and beneficial to actually get a job and have a smaller brood of children, then hopefully more people will take that path. But the first step is strictly limiting the amount of money a person can get for being an unemployed parent. My tax dollars shouldn't support someone else's bad decisions, and perhaps even encourage those bad decisions. I work and pay taxes. That's the responsibility of every capable adult. If a person has an emergency, medical problem, or other unexpected situation, I think it's good for a civilized society to help them bridge the gap so they can become healthy, productive, or situationally stable again. If a person who has worked his entire life shatters his leg in an accident, and he works as a construction worker, he needs time to train to a new job or recover to the point where he can work again. If a person is diagnosed with cancer, then a good society helps that person while she is recovering. But if a person spends his or her lie avoiding work and responsibility, and expects to get money just for breeding... we need to stop that sort of garbage. Can we force people to stop having children? Of course not. We're not China. People have the freedom to breed. But we shouldn't fund their breeding with our tax dollars. You want kids? You support them.", 
        "intTime": 20090509, 
        "postID": 12, 
        "quote": "", 
        "reply": "I think that if a person has a kid while already on welfare, then that person shouldn't get another dime. I know, it punishes the innocent child, but I'm tired of people breeding without restraint just to get additional benefits out of my tax dollars. People already KNOW how to use contraception. It's not rocket science, and even the dumbest high-school dropout knows how to use a rubber. The challenge is empowering women to take care of their own contraception needs, to give them the tools to educate themselves, and the promise of a world where the rewards of WORKING and EARNING a living are better than popping out kids to receive handouts and welfare. Sure, it costs a few dollars for Planned Parenthood to give out free birth control pills... but that costs a LOT LESS than years and years of welfare payments and other benefits for a low-income child. And if women who had never otherwise been given an option in life were to receive the support to seek a path other than perpetual childbearing and welfare, they might actually break the cycle. Will everyone break the cycle? Of course not. But if you take away the incentive of perpetual welfare payments, and make it more lucrative and beneficial to actually get a job and have a smaller brood of children, then hopefully more people will take that path. But the first step is strictly limiting the amount of money a person can get for being an unemployed parent. My tax dollars shouldn't support someone else's bad decisions, and perhaps even encourage those bad decisions. I work and pay taxes. That's the responsibility of every capable adult. If a person has an emergency, medical problem, or other unexpected situation, I think it's good for a civilized society to help them bridge the gap so they can become healthy, productive, or situationally stable again. If a person who has worked his entire life shatters his leg in an accident, and he works as a construction worker, he needs time to train to a new job or recover to the point where he can work again. If a person is diagnosed with cancer, then a good society helps that person while she is recovering. But if a person spends his or her lie avoiding work and responsibility, and expects to get money just for breeding... we need to stop that sort of garbage. Can we force people to stop having children? Of course not. We're not China. People have the freedom to breed. But we shouldn't fund their breeding with our tax dollars. You want kids? You support them.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 12:29:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "If you can't afford kids, use contraception. If that doesn't work, then sterilization or a chastity belt. And if that doesn't work, take the garden shears, and cut big-daddy pee-funk's nutz off. Snip, snip... \"The World's Finest\"", 
        "intTime": 20090509, 
        "postID": 13, 
        "quote": "", 
        "reply": "If you can't afford kids, use contraception. If that doesn't work, then sterilization or a chastity belt. And if that doesn't work, take the garden shears, and cut big-daddy pee-funk's nutz off. Snip, snip... \"The World's Finest\"", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 12:40:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Kegler300"
    }, 
    {
        "content": "My Mother spent most of her childhood and early adult years in Puerto Rico. She told me about a government policy there that was in effect around the 1930s or 1940s until it was reversed due to legal challenges. In those days what a couple(or single mother if that was the case) was billed for the medical services involved in delivering a baby was equivalent to one month's salary. The rich paid more, the middle class less for the same basic service. The government provided the service free of charge for those with little or no income, but there was a catch. Delivery of a second child on the government's tab included a sterilization procedure. The legal problems stemmed from the fact that the poor mothers weren't informed that they were being sterilized. I could support free government sterilizations in exchange for the free medical care, but not without prior disclosure and consent of the mother.", 
        "intTime": 20090509, 
        "postID": 14, 
        "quote": "", 
        "reply": "My Mother spent most of her childhood and early adult years in Puerto Rico. She told me about a government policy there that was in effect around the 1930s or 1940s until it was reversed due to legal challenges. In those days what a couple(or single mother if that was the case) was billed for the medical services involved in delivering a baby was equivalent to one month's salary. The rich paid more, the middle class less for the same basic service. The government provided the service free of charge for those with little or no income, but there was a catch. Delivery of a second child on the government's tab included a sterilization procedure. The legal problems stemmed from the fact that the poor mothers weren't informed that they were being sterilized. I could support free government sterilizations in exchange for the free medical care, but not without prior disclosure and consent of the mother.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 15:17:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real.", 
        "intTime": 20090509, 
        "postID": 15, 
        "quote": "", 
        "reply": "I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 20:28:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real. Yes, sterilisation was integral to Nazi thinking. Look, this entire welfare debate is just an excuse to get away from having a minimu wage which is also a living wage. Conservatives are RIGHT to attack welfare as insitutionalising poverty. But they don't want to deal with the obvious logic of their conclusions. Liberals are quite content to institutionalise poverty, because their afraid of being accused of being \"Socialists.\" What was the original \"welfare\" program all about? Roosevelt created it to aid those who could not work. No one else was eligible. At the same time he created the minumum wage program, and created it as a Living Wage program. Well you can't live off the minimum wage, and there should be no welfare for those who CAN work. Of course government should be the employer of last resort - Strictly an emergency measure, but a living wage is integral to any intelligent program. As for this crap about children, it's just another excuse to dodge the real problems. And spending money to train people for real jobs is a hell of a lot cheaper than any of this nonsense going on today. Dave", 
        "intTime": 20090509, 
        "postID": 16, 
        "quote": "Originally posted by crackerjacks61: I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real.", 
        "reply": " Yes, sterilisation was integral to Nazi thinking. Look, this entire welfare debate is just an excuse to get away from having a minimu wage which is also a living wage. Conservatives are RIGHT to attack welfare as insitutionalising poverty. But they don't want to deal with the obvious logic of their conclusions. Liberals are quite content to institutionalise poverty, because their afraid of being accused of being \"Socialists.\" What was the original \"welfare\" program all about? Roosevelt created it to aid those who could not work. No one else was eligible. At the same time he created the minumum wage program, and created it as a Living Wage program. Well you can't live off the minimum wage, and there should be no welfare for those who CAN work. Of course government should be the employer of last resort - Strictly an emergency measure, but a living wage is integral to any intelligent program. As for this crap about children, it's just another excuse to dodge the real problems. And spending money to train people for real jobs is a hell of a lot cheaper than any of this nonsense going on today. Dave", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 20:40:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Grachus"
    }, 
    {
        "content": "Here is a three part series--examining the topic \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.01.002.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.05.001.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.08.001.pdart\"", 
        "intTime": 20090508, 
        "postID": 17, 
        "quote": "", 
        "reply": "Here is a three part series--examining the topic \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.01.002.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.05.001.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.08.001.pdart\"", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-08 21:51:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "3678131"
    }, 
    {
        "content": "Is there a corollary in forcing the rich to adopt?", 
        "intTime": 20090509, 
        "postID": 18, 
        "quote": "", 
        "reply": "Is there a corollary in forcing the rich to adopt?", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 06:51:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "popsiq"
    }, 
    {
        "content": "Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "intTime": 20090509, 
        "postID": 19, 
        "quote": "", 
        "reply": "Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 06:57:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren. I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090509, 
        "postID": 20, 
        "quote": "Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "reply": " I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 07:28:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough.", 
        "intTime": 20090509, 
        "postID": 21, 
        "quote": "I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government.", 
        "reply": " Yep, the incentive needs to stop, enough is enough.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 08:06:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "intTime": 20090509, 
        "postID": 22, 
        "quote": "Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough.", 
        "reply": " You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 08:30:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave Ya and additional hundreds of billions to corporate big wig retirement funds", 
        "intTime": 20090509, 
        "postID": 23, 
        "quote": "Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "reply": " Ya and additional hundreds of billions to corporate big wig retirement funds", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 08:51:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090509, 
        "postID": 24, 
        "quote": "Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "reply": " As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 09:02:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "L0A1"
    }, 
    {
        "content": "Oficially \"welfare\" may have been reforemd but that is just semantics as a barrage of other programs now funnel down to those that know how to milk the system. EIC from the IRS is welfare. HUD is welfare. Medicaid - medicair is welfare Food stamps is welfare. WIC is welfare. And I'm sure there are others that many collect for years and years. Welfare was started as a good program that has exploded into an abuse on the working people.", 
        "intTime": 20090509, 
        "postID": 25, 
        "quote": "", 
        "reply": "Oficially \"welfare\" may have been reforemd but that is just semantics as a barrage of other programs now funnel down to those that know how to milk the system. EIC from the IRS is welfare. HUD is welfare. Medicaid - medicair is welfare Food stamps is welfare. WIC is welfare. And I'm sure there are others that many collect for years and years. Welfare was started as a good program that has exploded into an abuse on the working people.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 09:32:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by Grachus: You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave quote: Originally posted by L0A1: As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Well, I don't know what your State program is. But State Programs are largely funded by Federal money. As I said, Federal money can only be given for two year stretches, five year cumulative maximum. Here in NYC, you can't even get any welfare without working for the City. And yes, the City does provide day care while you are fulfilling your work obligation. Google it. Personally, I've always thought that the only welfare program that makes sense, is a living wage law, coupled with job training if you have no skills. Dave", 
        "intTime": 20090509, 
        "postID": 26, 
        "quote": "Originally posted by Grachus: You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "reply": " quote: Originally posted by L0A1: As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Well, I don't know what your State program is. But State Programs are largely funded by Federal money. As I said, Federal money can only be given for two year stretches, five year cumulative maximum. Here in NYC, you can't even get any welfare without working for the City. And yes, the City does provide day care while you are fulfilling your work obligation. Google it. Personally, I've always thought that the only welfare program that makes sense, is a living wage law, coupled with job training if you have no skills. Dave", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 09:43:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren. Didn't know you needed medical care to buy condoms.....interesting.", 
        "intTime": 20090509, 
        "postID": 27, 
        "quote": "Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "reply": " Didn't know you needed medical care to buy condoms.....interesting.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 10:03:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "sw614"
    }, 
    {
        "content": "I think that if a person has a kid while already on welfare, then that person shouldn't get another dime. I know, it punishes the innocent child, but I'm tired of people breeding without restraint just to get additional benefits out of my tax dollars. People already KNOW how to use contraception. It's not rocket science, and even the dumbest high-school dropout knows how to use a rubber. The challenge is empowering women to take care of their own contraception needs, to give them the tools to educate themselves, and the promise of a world where the rewards of WORKING and EARNING a living are better than popping out kids to receive handouts and welfare. Sure, it costs a few dollars for Planned Parenthood to give out free birth control pills... but that costs a LOT LESS than years and years of welfare payments and other benefits for a low-income child. And if women who had never otherwise been given an option in life were to receive the support to seek a path other than perpetual childbearing and welfare, they might actually break the cycle. Will everyone break the cycle? Of course not. But if you take away the incentive of perpetual welfare payments, and make it more lucrative and beneficial to actually get a job and have a smaller brood of children, then hopefully more people will take that path. But the first step is strictly limiting the amount of money a person can get for being an unemployed parent. My tax dollars shouldn't support someone else's bad decisions, and perhaps even encourage those bad decisions. I work and pay taxes. That's the responsibility of every capable adult. If a person has an emergency, medical problem, or other unexpected situation, I think it's good for a civilized society to help them bridge the gap so they can become healthy, productive, or situationally stable again. If a person who has worked his entire life shatters his leg in an accident, and he works as a construction worker, he needs time to train to a new job or recover to the point where he can work again. If a person is diagnosed with cancer, then a good society helps that person while she is recovering. But if a person spends his or her lie avoiding work and responsibility, and expects to get money just for breeding... we need to stop that sort of garbage. Can we force people to stop having children? Of course not. We're not China. People have the freedom to breed. But we shouldn't fund their breeding with our tax dollars. You want kids? You support them.", 
        "intTime": 20090509, 
        "postID": 28, 
        "quote": "", 
        "reply": "I think that if a person has a kid while already on welfare, then that person shouldn't get another dime. I know, it punishes the innocent child, but I'm tired of people breeding without restraint just to get additional benefits out of my tax dollars. People already KNOW how to use contraception. It's not rocket science, and even the dumbest high-school dropout knows how to use a rubber. The challenge is empowering women to take care of their own contraception needs, to give them the tools to educate themselves, and the promise of a world where the rewards of WORKING and EARNING a living are better than popping out kids to receive handouts and welfare. Sure, it costs a few dollars for Planned Parenthood to give out free birth control pills... but that costs a LOT LESS than years and years of welfare payments and other benefits for a low-income child. And if women who had never otherwise been given an option in life were to receive the support to seek a path other than perpetual childbearing and welfare, they might actually break the cycle. Will everyone break the cycle? Of course not. But if you take away the incentive of perpetual welfare payments, and make it more lucrative and beneficial to actually get a job and have a smaller brood of children, then hopefully more people will take that path. But the first step is strictly limiting the amount of money a person can get for being an unemployed parent. My tax dollars shouldn't support someone else's bad decisions, and perhaps even encourage those bad decisions. I work and pay taxes. That's the responsibility of every capable adult. If a person has an emergency, medical problem, or other unexpected situation, I think it's good for a civilized society to help them bridge the gap so they can become healthy, productive, or situationally stable again. If a person who has worked his entire life shatters his leg in an accident, and he works as a construction worker, he needs time to train to a new job or recover to the point where he can work again. If a person is diagnosed with cancer, then a good society helps that person while she is recovering. But if a person spends his or her lie avoiding work and responsibility, and expects to get money just for breeding... we need to stop that sort of garbage. Can we force people to stop having children? Of course not. We're not China. People have the freedom to breed. But we shouldn't fund their breeding with our tax dollars. You want kids? You support them.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 12:29:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "If you can't afford kids, use contraception. If that doesn't work, then sterilization or a chastity belt. And if that doesn't work, take the garden shears, and cut big-daddy pee-funk's nutz off. Snip, snip... \"The World's Finest\"", 
        "intTime": 20090509, 
        "postID": 29, 
        "quote": "", 
        "reply": "If you can't afford kids, use contraception. If that doesn't work, then sterilization or a chastity belt. And if that doesn't work, take the garden shears, and cut big-daddy pee-funk's nutz off. Snip, snip... \"The World's Finest\"", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 12:40:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Kegler300"
    }, 
    {
        "content": "My Mother spent most of her childhood and early adult years in Puerto Rico. She told me about a government policy there that was in effect around the 1930s or 1940s until it was reversed due to legal challenges. In those days what a couple(or single mother if that was the case) was billed for the medical services involved in delivering a baby was equivalent to one month's salary. The rich paid more, the middle class less for the same basic service. The government provided the service free of charge for those with little or no income, but there was a catch. Delivery of a second child on the government's tab included a sterilization procedure. The legal problems stemmed from the fact that the poor mothers weren't informed that they were being sterilized. I could support free government sterilizations in exchange for the free medical care, but not without prior disclosure and consent of the mother.", 
        "intTime": 20090509, 
        "postID": 30, 
        "quote": "", 
        "reply": "My Mother spent most of her childhood and early adult years in Puerto Rico. She told me about a government policy there that was in effect around the 1930s or 1940s until it was reversed due to legal challenges. In those days what a couple(or single mother if that was the case) was billed for the medical services involved in delivering a baby was equivalent to one month's salary. The rich paid more, the middle class less for the same basic service. The government provided the service free of charge for those with little or no income, but there was a catch. Delivery of a second child on the government's tab included a sterilization procedure. The legal problems stemmed from the fact that the poor mothers weren't informed that they were being sterilized. I could support free government sterilizations in exchange for the free medical care, but not without prior disclosure and consent of the mother.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 15:17:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real.", 
        "intTime": 20090509, 
        "postID": 31, 
        "quote": "", 
        "reply": "I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 20:28:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real. Yes, sterilisation was integral to Nazi thinking. Look, this entire welfare debate is just an excuse to get away from having a minimu wage which is also a living wage. Conservatives are RIGHT to attack welfare as insitutionalising poverty. But they don't want to deal with the obvious logic of their conclusions. Liberals are quite content to institutionalise poverty, because their afraid of being accused of being \"Socialists.\" What was the original \"welfare\" program all about? Roosevelt created it to aid those who could not work. No one else was eligible. At the same time he created the minumum wage program, and created it as a Living Wage program. Well you can't live off the minimum wage, and there should be no welfare for those who CAN work. Of course government should be the employer of last resort - Strictly an emergency measure, but a living wage is integral to any intelligent program. As for this crap about children, it's just another excuse to dodge the real problems. And spending money to train people for real jobs is a hell of a lot cheaper than any of this nonsense going on today. Dave", 
        "intTime": 20090509, 
        "postID": 32, 
        "quote": "Originally posted by crackerjacks61: I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real.", 
        "reply": " Yes, sterilisation was integral to Nazi thinking. Look, this entire welfare debate is just an excuse to get away from having a minimu wage which is also a living wage. Conservatives are RIGHT to attack welfare as insitutionalising poverty. But they don't want to deal with the obvious logic of their conclusions. Liberals are quite content to institutionalise poverty, because their afraid of being accused of being \"Socialists.\" What was the original \"welfare\" program all about? Roosevelt created it to aid those who could not work. No one else was eligible. At the same time he created the minumum wage program, and created it as a Living Wage program. Well you can't live off the minimum wage, and there should be no welfare for those who CAN work. Of course government should be the employer of last resort - Strictly an emergency measure, but a living wage is integral to any intelligent program. As for this crap about children, it's just another excuse to dodge the real problems. And spending money to train people for real jobs is a hell of a lot cheaper than any of this nonsense going on today. Dave", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 20:40:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Grachus"
    }, 
    {
        "content": "Here is a three part series--examining the topic \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.01.002.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.05.001.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.08.001.pdart\"", 
        "intTime": 20090508, 
        "postID": 33, 
        "quote": "", 
        "reply": "Here is a three part series--examining the topic \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.01.002.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.05.001.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.08.001.pdart\"", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-08 21:51:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "3678131"
    }, 
    {
        "content": "Is there a corollary in forcing the rich to adopt?", 
        "intTime": 20090509, 
        "postID": 34, 
        "quote": "", 
        "reply": "Is there a corollary in forcing the rich to adopt?", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 06:51:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "popsiq"
    }, 
    {
        "content": "Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "intTime": 20090509, 
        "postID": 35, 
        "quote": "", 
        "reply": "Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 06:57:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren. I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090509, 
        "postID": 36, 
        "quote": "Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "reply": " I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 07:28:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough.", 
        "intTime": 20090509, 
        "postID": 37, 
        "quote": "I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government.", 
        "reply": " Yep, the incentive needs to stop, enough is enough.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 08:06:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "intTime": 20090509, 
        "postID": 38, 
        "quote": "Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough.", 
        "reply": " You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 08:30:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave Ya and additional hundreds of billions to corporate big wig retirement funds", 
        "intTime": 20090509, 
        "postID": 39, 
        "quote": "Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "reply": " Ya and additional hundreds of billions to corporate big wig retirement funds", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 08:51:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090509, 
        "postID": 40, 
        "quote": "Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "reply": " As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 09:02:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "L0A1"
    }, 
    {
        "content": "Oficially \"welfare\" may have been reforemd but that is just semantics as a barrage of other programs now funnel down to those that know how to milk the system. EIC from the IRS is welfare. HUD is welfare. Medicaid - medicair is welfare Food stamps is welfare. WIC is welfare. And I'm sure there are others that many collect for years and years. Welfare was started as a good program that has exploded into an abuse on the working people.", 
        "intTime": 20090509, 
        "postID": 41, 
        "quote": "", 
        "reply": "Oficially \"welfare\" may have been reforemd but that is just semantics as a barrage of other programs now funnel down to those that know how to milk the system. EIC from the IRS is welfare. HUD is welfare. Medicaid - medicair is welfare Food stamps is welfare. WIC is welfare. And I'm sure there are others that many collect for years and years. Welfare was started as a good program that has exploded into an abuse on the working people.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 09:32:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by Grachus: You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave quote: Originally posted by L0A1: As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Well, I don't know what your State program is. But State Programs are largely funded by Federal money. As I said, Federal money can only be given for two year stretches, five year cumulative maximum. Here in NYC, you can't even get any welfare without working for the City. And yes, the City does provide day care while you are fulfilling your work obligation. Google it. Personally, I've always thought that the only welfare program that makes sense, is a living wage law, coupled with job training if you have no skills. Dave", 
        "intTime": 20090509, 
        "postID": 42, 
        "quote": "Originally posted by Grachus: You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "reply": " quote: Originally posted by L0A1: As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Well, I don't know what your State program is. But State Programs are largely funded by Federal money. As I said, Federal money can only be given for two year stretches, five year cumulative maximum. Here in NYC, you can't even get any welfare without working for the City. And yes, the City does provide day care while you are fulfilling your work obligation. Google it. Personally, I've always thought that the only welfare program that makes sense, is a living wage law, coupled with job training if you have no skills. Dave", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 09:43:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren. Didn't know you needed medical care to buy condoms.....interesting.", 
        "intTime": 20090509, 
        "postID": 43, 
        "quote": "Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "reply": " Didn't know you needed medical care to buy condoms.....interesting.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 10:03:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "sw614"
    }, 
    {
        "content": "I think that if a person has a kid while already on welfare, then that person shouldn't get another dime. I know, it punishes the innocent child, but I'm tired of people breeding without restraint just to get additional benefits out of my tax dollars. People already KNOW how to use contraception. It's not rocket science, and even the dumbest high-school dropout knows how to use a rubber. The challenge is empowering women to take care of their own contraception needs, to give them the tools to educate themselves, and the promise of a world where the rewards of WORKING and EARNING a living are better than popping out kids to receive handouts and welfare. Sure, it costs a few dollars for Planned Parenthood to give out free birth control pills... but that costs a LOT LESS than years and years of welfare payments and other benefits for a low-income child. And if women who had never otherwise been given an option in life were to receive the support to seek a path other than perpetual childbearing and welfare, they might actually break the cycle. Will everyone break the cycle? Of course not. But if you take away the incentive of perpetual welfare payments, and make it more lucrative and beneficial to actually get a job and have a smaller brood of children, then hopefully more people will take that path. But the first step is strictly limiting the amount of money a person can get for being an unemployed parent. My tax dollars shouldn't support someone else's bad decisions, and perhaps even encourage those bad decisions. I work and pay taxes. That's the responsibility of every capable adult. If a person has an emergency, medical problem, or other unexpected situation, I think it's good for a civilized society to help them bridge the gap so they can become healthy, productive, or situationally stable again. If a person who has worked his entire life shatters his leg in an accident, and he works as a construction worker, he needs time to train to a new job or recover to the point where he can work again. If a person is diagnosed with cancer, then a good society helps that person while she is recovering. But if a person spends his or her lie avoiding work and responsibility, and expects to get money just for breeding... we need to stop that sort of garbage. Can we force people to stop having children? Of course not. We're not China. People have the freedom to breed. But we shouldn't fund their breeding with our tax dollars. You want kids? You support them.", 
        "intTime": 20090509, 
        "postID": 44, 
        "quote": "", 
        "reply": "I think that if a person has a kid while already on welfare, then that person shouldn't get another dime. I know, it punishes the innocent child, but I'm tired of people breeding without restraint just to get additional benefits out of my tax dollars. People already KNOW how to use contraception. It's not rocket science, and even the dumbest high-school dropout knows how to use a rubber. The challenge is empowering women to take care of their own contraception needs, to give them the tools to educate themselves, and the promise of a world where the rewards of WORKING and EARNING a living are better than popping out kids to receive handouts and welfare. Sure, it costs a few dollars for Planned Parenthood to give out free birth control pills... but that costs a LOT LESS than years and years of welfare payments and other benefits for a low-income child. And if women who had never otherwise been given an option in life were to receive the support to seek a path other than perpetual childbearing and welfare, they might actually break the cycle. Will everyone break the cycle? Of course not. But if you take away the incentive of perpetual welfare payments, and make it more lucrative and beneficial to actually get a job and have a smaller brood of children, then hopefully more people will take that path. But the first step is strictly limiting the amount of money a person can get for being an unemployed parent. My tax dollars shouldn't support someone else's bad decisions, and perhaps even encourage those bad decisions. I work and pay taxes. That's the responsibility of every capable adult. If a person has an emergency, medical problem, or other unexpected situation, I think it's good for a civilized society to help them bridge the gap so they can become healthy, productive, or situationally stable again. If a person who has worked his entire life shatters his leg in an accident, and he works as a construction worker, he needs time to train to a new job or recover to the point where he can work again. If a person is diagnosed with cancer, then a good society helps that person while she is recovering. But if a person spends his or her lie avoiding work and responsibility, and expects to get money just for breeding... we need to stop that sort of garbage. Can we force people to stop having children? Of course not. We're not China. People have the freedom to breed. But we shouldn't fund their breeding with our tax dollars. You want kids? You support them.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 12:29:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "If you can't afford kids, use contraception. If that doesn't work, then sterilization or a chastity belt. And if that doesn't work, take the garden shears, and cut big-daddy pee-funk's nutz off. Snip, snip... \"The World's Finest\"", 
        "intTime": 20090509, 
        "postID": 45, 
        "quote": "", 
        "reply": "If you can't afford kids, use contraception. If that doesn't work, then sterilization or a chastity belt. And if that doesn't work, take the garden shears, and cut big-daddy pee-funk's nutz off. Snip, snip... \"The World's Finest\"", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 12:40:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Kegler300"
    }, 
    {
        "content": "My Mother spent most of her childhood and early adult years in Puerto Rico. She told me about a government policy there that was in effect around the 1930s or 1940s until it was reversed due to legal challenges. In those days what a couple(or single mother if that was the case) was billed for the medical services involved in delivering a baby was equivalent to one month's salary. The rich paid more, the middle class less for the same basic service. The government provided the service free of charge for those with little or no income, but there was a catch. Delivery of a second child on the government's tab included a sterilization procedure. The legal problems stemmed from the fact that the poor mothers weren't informed that they were being sterilized. I could support free government sterilizations in exchange for the free medical care, but not without prior disclosure and consent of the mother.", 
        "intTime": 20090509, 
        "postID": 46, 
        "quote": "", 
        "reply": "My Mother spent most of her childhood and early adult years in Puerto Rico. She told me about a government policy there that was in effect around the 1930s or 1940s until it was reversed due to legal challenges. In those days what a couple(or single mother if that was the case) was billed for the medical services involved in delivering a baby was equivalent to one month's salary. The rich paid more, the middle class less for the same basic service. The government provided the service free of charge for those with little or no income, but there was a catch. Delivery of a second child on the government's tab included a sterilization procedure. The legal problems stemmed from the fact that the poor mothers weren't informed that they were being sterilized. I could support free government sterilizations in exchange for the free medical care, but not without prior disclosure and consent of the mother.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 15:17:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real.", 
        "intTime": 20090509, 
        "postID": 47, 
        "quote": "", 
        "reply": "I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 20:28:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real. Yes, sterilisation was integral to Nazi thinking. Look, this entire welfare debate is just an excuse to get away from having a minimu wage which is also a living wage. Conservatives are RIGHT to attack welfare as insitutionalising poverty. But they don't want to deal with the obvious logic of their conclusions. Liberals are quite content to institutionalise poverty, because their afraid of being accused of being \"Socialists.\" What was the original \"welfare\" program all about? Roosevelt created it to aid those who could not work. No one else was eligible. At the same time he created the minumum wage program, and created it as a Living Wage program. Well you can't live off the minimum wage, and there should be no welfare for those who CAN work. Of course government should be the employer of last resort - Strictly an emergency measure, but a living wage is integral to any intelligent program. As for this crap about children, it's just another excuse to dodge the real problems. And spending money to train people for real jobs is a hell of a lot cheaper than any of this nonsense going on today. Dave", 
        "intTime": 20090509, 
        "postID": 48, 
        "quote": "Originally posted by crackerjacks61: I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real.", 
        "reply": " Yes, sterilisation was integral to Nazi thinking. Look, this entire welfare debate is just an excuse to get away from having a minimu wage which is also a living wage. Conservatives are RIGHT to attack welfare as insitutionalising poverty. But they don't want to deal with the obvious logic of their conclusions. Liberals are quite content to institutionalise poverty, because their afraid of being accused of being \"Socialists.\" What was the original \"welfare\" program all about? Roosevelt created it to aid those who could not work. No one else was eligible. At the same time he created the minumum wage program, and created it as a Living Wage program. Well you can't live off the minimum wage, and there should be no welfare for those who CAN work. Of course government should be the employer of last resort - Strictly an emergency measure, but a living wage is integral to any intelligent program. As for this crap about children, it's just another excuse to dodge the real problems. And spending money to train people for real jobs is a hell of a lot cheaper than any of this nonsense going on today. Dave", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 20:40:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Grachus"
    }, 
    {
        "content": "Here is a three part series--examining the topic \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.01.002.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.05.001.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.08.001.pdart\"", 
        "intTime": 20090508, 
        "postID": 49, 
        "quote": "", 
        "reply": "Here is a three part series--examining the topic \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.01.002.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.05.001.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.08.001.pdart\"", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-08 21:51:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "3678131"
    }, 
    {
        "content": "Is there a corollary in forcing the rich to adopt?", 
        "intTime": 20090509, 
        "postID": 50, 
        "quote": "", 
        "reply": "Is there a corollary in forcing the rich to adopt?", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 06:51:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "popsiq"
    }, 
    {
        "content": "Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "intTime": 20090509, 
        "postID": 51, 
        "quote": "", 
        "reply": "Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 06:57:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren. I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090509, 
        "postID": 52, 
        "quote": "Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "reply": " I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 07:28:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough.", 
        "intTime": 20090509, 
        "postID": 53, 
        "quote": "I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government.", 
        "reply": " Yep, the incentive needs to stop, enough is enough.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 08:06:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "intTime": 20090509, 
        "postID": 54, 
        "quote": "Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough.", 
        "reply": " You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 08:30:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave Ya and additional hundreds of billions to corporate big wig retirement funds", 
        "intTime": 20090509, 
        "postID": 55, 
        "quote": "Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "reply": " Ya and additional hundreds of billions to corporate big wig retirement funds", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 08:51:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090509, 
        "postID": 56, 
        "quote": "Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "reply": " As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 09:02:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "L0A1"
    }, 
    {
        "content": "Oficially \"welfare\" may have been reforemd but that is just semantics as a barrage of other programs now funnel down to those that know how to milk the system. EIC from the IRS is welfare. HUD is welfare. Medicaid - medicair is welfare Food stamps is welfare. WIC is welfare. And I'm sure there are others that many collect for years and years. Welfare was started as a good program that has exploded into an abuse on the working people.", 
        "intTime": 20090509, 
        "postID": 57, 
        "quote": "", 
        "reply": "Oficially \"welfare\" may have been reforemd but that is just semantics as a barrage of other programs now funnel down to those that know how to milk the system. EIC from the IRS is welfare. HUD is welfare. Medicaid - medicair is welfare Food stamps is welfare. WIC is welfare. And I'm sure there are others that many collect for years and years. Welfare was started as a good program that has exploded into an abuse on the working people.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 09:32:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by Grachus: You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave quote: Originally posted by L0A1: As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Well, I don't know what your State program is. But State Programs are largely funded by Federal money. As I said, Federal money can only be given for two year stretches, five year cumulative maximum. Here in NYC, you can't even get any welfare without working for the City. And yes, the City does provide day care while you are fulfilling your work obligation. Google it. Personally, I've always thought that the only welfare program that makes sense, is a living wage law, coupled with job training if you have no skills. Dave", 
        "intTime": 20090509, 
        "postID": 58, 
        "quote": "Originally posted by Grachus: You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "reply": " quote: Originally posted by L0A1: As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Well, I don't know what your State program is. But State Programs are largely funded by Federal money. As I said, Federal money can only be given for two year stretches, five year cumulative maximum. Here in NYC, you can't even get any welfare without working for the City. And yes, the City does provide day care while you are fulfilling your work obligation. Google it. Personally, I've always thought that the only welfare program that makes sense, is a living wage law, coupled with job training if you have no skills. Dave", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 09:43:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren. Didn't know you needed medical care to buy condoms.....interesting.", 
        "intTime": 20090509, 
        "postID": 59, 
        "quote": "Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "reply": " Didn't know you needed medical care to buy condoms.....interesting.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 10:03:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "sw614"
    }, 
    {
        "content": "I think that if a person has a kid while already on welfare, then that person shouldn't get another dime. I know, it punishes the innocent child, but I'm tired of people breeding without restraint just to get additional benefits out of my tax dollars. People already KNOW how to use contraception. It's not rocket science, and even the dumbest high-school dropout knows how to use a rubber. The challenge is empowering women to take care of their own contraception needs, to give them the tools to educate themselves, and the promise of a world where the rewards of WORKING and EARNING a living are better than popping out kids to receive handouts and welfare. Sure, it costs a few dollars for Planned Parenthood to give out free birth control pills... but that costs a LOT LESS than years and years of welfare payments and other benefits for a low-income child. And if women who had never otherwise been given an option in life were to receive the support to seek a path other than perpetual childbearing and welfare, they might actually break the cycle. Will everyone break the cycle? Of course not. But if you take away the incentive of perpetual welfare payments, and make it more lucrative and beneficial to actually get a job and have a smaller brood of children, then hopefully more people will take that path. But the first step is strictly limiting the amount of money a person can get for being an unemployed parent. My tax dollars shouldn't support someone else's bad decisions, and perhaps even encourage those bad decisions. I work and pay taxes. That's the responsibility of every capable adult. If a person has an emergency, medical problem, or other unexpected situation, I think it's good for a civilized society to help them bridge the gap so they can become healthy, productive, or situationally stable again. If a person who has worked his entire life shatters his leg in an accident, and he works as a construction worker, he needs time to train to a new job or recover to the point where he can work again. If a person is diagnosed with cancer, then a good society helps that person while she is recovering. But if a person spends his or her lie avoiding work and responsibility, and expects to get money just for breeding... we need to stop that sort of garbage. Can we force people to stop having children? Of course not. We're not China. People have the freedom to breed. But we shouldn't fund their breeding with our tax dollars. You want kids? You support them.", 
        "intTime": 20090509, 
        "postID": 60, 
        "quote": "", 
        "reply": "I think that if a person has a kid while already on welfare, then that person shouldn't get another dime. I know, it punishes the innocent child, but I'm tired of people breeding without restraint just to get additional benefits out of my tax dollars. People already KNOW how to use contraception. It's not rocket science, and even the dumbest high-school dropout knows how to use a rubber. The challenge is empowering women to take care of their own contraception needs, to give them the tools to educate themselves, and the promise of a world where the rewards of WORKING and EARNING a living are better than popping out kids to receive handouts and welfare. Sure, it costs a few dollars for Planned Parenthood to give out free birth control pills... but that costs a LOT LESS than years and years of welfare payments and other benefits for a low-income child. And if women who had never otherwise been given an option in life were to receive the support to seek a path other than perpetual childbearing and welfare, they might actually break the cycle. Will everyone break the cycle? Of course not. But if you take away the incentive of perpetual welfare payments, and make it more lucrative and beneficial to actually get a job and have a smaller brood of children, then hopefully more people will take that path. But the first step is strictly limiting the amount of money a person can get for being an unemployed parent. My tax dollars shouldn't support someone else's bad decisions, and perhaps even encourage those bad decisions. I work and pay taxes. That's the responsibility of every capable adult. If a person has an emergency, medical problem, or other unexpected situation, I think it's good for a civilized society to help them bridge the gap so they can become healthy, productive, or situationally stable again. If a person who has worked his entire life shatters his leg in an accident, and he works as a construction worker, he needs time to train to a new job or recover to the point where he can work again. If a person is diagnosed with cancer, then a good society helps that person while she is recovering. But if a person spends his or her lie avoiding work and responsibility, and expects to get money just for breeding... we need to stop that sort of garbage. Can we force people to stop having children? Of course not. We're not China. People have the freedom to breed. But we shouldn't fund their breeding with our tax dollars. You want kids? You support them.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 12:29:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "If you can't afford kids, use contraception. If that doesn't work, then sterilization or a chastity belt. And if that doesn't work, take the garden shears, and cut big-daddy pee-funk's nutz off. Snip, snip... \"The World's Finest\"", 
        "intTime": 20090509, 
        "postID": 61, 
        "quote": "", 
        "reply": "If you can't afford kids, use contraception. If that doesn't work, then sterilization or a chastity belt. And if that doesn't work, take the garden shears, and cut big-daddy pee-funk's nutz off. Snip, snip... \"The World's Finest\"", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 12:40:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Kegler300"
    }, 
    {
        "content": "My Mother spent most of her childhood and early adult years in Puerto Rico. She told me about a government policy there that was in effect around the 1930s or 1940s until it was reversed due to legal challenges. In those days what a couple(or single mother if that was the case) was billed for the medical services involved in delivering a baby was equivalent to one month's salary. The rich paid more, the middle class less for the same basic service. The government provided the service free of charge for those with little or no income, but there was a catch. Delivery of a second child on the government's tab included a sterilization procedure. The legal problems stemmed from the fact that the poor mothers weren't informed that they were being sterilized. I could support free government sterilizations in exchange for the free medical care, but not without prior disclosure and consent of the mother.", 
        "intTime": 20090509, 
        "postID": 62, 
        "quote": "", 
        "reply": "My Mother spent most of her childhood and early adult years in Puerto Rico. She told me about a government policy there that was in effect around the 1930s or 1940s until it was reversed due to legal challenges. In those days what a couple(or single mother if that was the case) was billed for the medical services involved in delivering a baby was equivalent to one month's salary. The rich paid more, the middle class less for the same basic service. The government provided the service free of charge for those with little or no income, but there was a catch. Delivery of a second child on the government's tab included a sterilization procedure. The legal problems stemmed from the fact that the poor mothers weren't informed that they were being sterilized. I could support free government sterilizations in exchange for the free medical care, but not without prior disclosure and consent of the mother.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 15:17:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real.", 
        "intTime": 20090509, 
        "postID": 63, 
        "quote": "", 
        "reply": "I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 20:28:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real. Yes, sterilisation was integral to Nazi thinking. Look, this entire welfare debate is just an excuse to get away from having a minimu wage which is also a living wage. Conservatives are RIGHT to attack welfare as insitutionalising poverty. But they don't want to deal with the obvious logic of their conclusions. Liberals are quite content to institutionalise poverty, because their afraid of being accused of being \"Socialists.\" What was the original \"welfare\" program all about? Roosevelt created it to aid those who could not work. No one else was eligible. At the same time he created the minumum wage program, and created it as a Living Wage program. Well you can't live off the minimum wage, and there should be no welfare for those who CAN work. Of course government should be the employer of last resort - Strictly an emergency measure, but a living wage is integral to any intelligent program. As for this crap about children, it's just another excuse to dodge the real problems. And spending money to train people for real jobs is a hell of a lot cheaper than any of this nonsense going on today. Dave", 
        "intTime": 20090509, 
        "postID": 64, 
        "quote": "Originally posted by crackerjacks61: I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real.", 
        "reply": " Yes, sterilisation was integral to Nazi thinking. Look, this entire welfare debate is just an excuse to get away from having a minimu wage which is also a living wage. Conservatives are RIGHT to attack welfare as insitutionalising poverty. But they don't want to deal with the obvious logic of their conclusions. Liberals are quite content to institutionalise poverty, because their afraid of being accused of being \"Socialists.\" What was the original \"welfare\" program all about? Roosevelt created it to aid those who could not work. No one else was eligible. At the same time he created the minumum wage program, and created it as a Living Wage program. Well you can't live off the minimum wage, and there should be no welfare for those who CAN work. Of course government should be the employer of last resort - Strictly an emergency measure, but a living wage is integral to any intelligent program. As for this crap about children, it's just another excuse to dodge the real problems. And spending money to train people for real jobs is a hell of a lot cheaper than any of this nonsense going on today. Dave", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 20:40:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Grachus"
    }, 
    {
        "content": "Here is a three part series--examining the topic \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.01.002.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.05.001.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.08.001.pdart\"", 
        "intTime": 20090508, 
        "postID": 65, 
        "quote": "", 
        "reply": "Here is a three part series--examining the topic \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.01.002.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.05.001.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.08.001.pdart\"", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-08 21:51:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "3678131"
    }, 
    {
        "content": "Is there a corollary in forcing the rich to adopt?", 
        "intTime": 20090509, 
        "postID": 66, 
        "quote": "", 
        "reply": "Is there a corollary in forcing the rich to adopt?", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 06:51:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "popsiq"
    }, 
    {
        "content": "Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "intTime": 20090509, 
        "postID": 67, 
        "quote": "", 
        "reply": "Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 06:57:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren. I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090509, 
        "postID": 68, 
        "quote": "Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "reply": " I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 07:28:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough.", 
        "intTime": 20090509, 
        "postID": 69, 
        "quote": "I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government.", 
        "reply": " Yep, the incentive needs to stop, enough is enough.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 08:06:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "intTime": 20090509, 
        "postID": 70, 
        "quote": "Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough.", 
        "reply": " You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 08:30:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave Ya and additional hundreds of billions to corporate big wig retirement funds", 
        "intTime": 20090509, 
        "postID": 71, 
        "quote": "Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "reply": " Ya and additional hundreds of billions to corporate big wig retirement funds", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 08:51:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090509, 
        "postID": 72, 
        "quote": "Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "reply": " As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 09:02:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "L0A1"
    }, 
    {
        "content": "Oficially \"welfare\" may have been reforemd but that is just semantics as a barrage of other programs now funnel down to those that know how to milk the system. EIC from the IRS is welfare. HUD is welfare. Medicaid - medicair is welfare Food stamps is welfare. WIC is welfare. And I'm sure there are others that many collect for years and years. Welfare was started as a good program that has exploded into an abuse on the working people.", 
        "intTime": 20090509, 
        "postID": 73, 
        "quote": "", 
        "reply": "Oficially \"welfare\" may have been reforemd but that is just semantics as a barrage of other programs now funnel down to those that know how to milk the system. EIC from the IRS is welfare. HUD is welfare. Medicaid - medicair is welfare Food stamps is welfare. WIC is welfare. And I'm sure there are others that many collect for years and years. Welfare was started as a good program that has exploded into an abuse on the working people.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 09:32:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by Grachus: You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave quote: Originally posted by L0A1: As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Well, I don't know what your State program is. But State Programs are largely funded by Federal money. As I said, Federal money can only be given for two year stretches, five year cumulative maximum. Here in NYC, you can't even get any welfare without working for the City. And yes, the City does provide day care while you are fulfilling your work obligation. Google it. Personally, I've always thought that the only welfare program that makes sense, is a living wage law, coupled with job training if you have no skills. Dave", 
        "intTime": 20090509, 
        "postID": 74, 
        "quote": "Originally posted by Grachus: You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "reply": " quote: Originally posted by L0A1: As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Well, I don't know what your State program is. But State Programs are largely funded by Federal money. As I said, Federal money can only be given for two year stretches, five year cumulative maximum. Here in NYC, you can't even get any welfare without working for the City. And yes, the City does provide day care while you are fulfilling your work obligation. Google it. Personally, I've always thought that the only welfare program that makes sense, is a living wage law, coupled with job training if you have no skills. Dave", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 09:43:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren. Didn't know you needed medical care to buy condoms.....interesting.", 
        "intTime": 20090509, 
        "postID": 75, 
        "quote": "Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "reply": " Didn't know you needed medical care to buy condoms.....interesting.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 10:03:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "sw614"
    }, 
    {
        "content": "I think that if a person has a kid while already on welfare, then that person shouldn't get another dime. I know, it punishes the innocent child, but I'm tired of people breeding without restraint just to get additional benefits out of my tax dollars. People already KNOW how to use contraception. It's not rocket science, and even the dumbest high-school dropout knows how to use a rubber. The challenge is empowering women to take care of their own contraception needs, to give them the tools to educate themselves, and the promise of a world where the rewards of WORKING and EARNING a living are better than popping out kids to receive handouts and welfare. Sure, it costs a few dollars for Planned Parenthood to give out free birth control pills... but that costs a LOT LESS than years and years of welfare payments and other benefits for a low-income child. And if women who had never otherwise been given an option in life were to receive the support to seek a path other than perpetual childbearing and welfare, they might actually break the cycle. Will everyone break the cycle? Of course not. But if you take away the incentive of perpetual welfare payments, and make it more lucrative and beneficial to actually get a job and have a smaller brood of children, then hopefully more people will take that path. But the first step is strictly limiting the amount of money a person can get for being an unemployed parent. My tax dollars shouldn't support someone else's bad decisions, and perhaps even encourage those bad decisions. I work and pay taxes. That's the responsibility of every capable adult. If a person has an emergency, medical problem, or other unexpected situation, I think it's good for a civilized society to help them bridge the gap so they can become healthy, productive, or situationally stable again. If a person who has worked his entire life shatters his leg in an accident, and he works as a construction worker, he needs time to train to a new job or recover to the point where he can work again. If a person is diagnosed with cancer, then a good society helps that person while she is recovering. But if a person spends his or her lie avoiding work and responsibility, and expects to get money just for breeding... we need to stop that sort of garbage. Can we force people to stop having children? Of course not. We're not China. People have the freedom to breed. But we shouldn't fund their breeding with our tax dollars. You want kids? You support them.", 
        "intTime": 20090509, 
        "postID": 76, 
        "quote": "", 
        "reply": "I think that if a person has a kid while already on welfare, then that person shouldn't get another dime. I know, it punishes the innocent child, but I'm tired of people breeding without restraint just to get additional benefits out of my tax dollars. People already KNOW how to use contraception. It's not rocket science, and even the dumbest high-school dropout knows how to use a rubber. The challenge is empowering women to take care of their own contraception needs, to give them the tools to educate themselves, and the promise of a world where the rewards of WORKING and EARNING a living are better than popping out kids to receive handouts and welfare. Sure, it costs a few dollars for Planned Parenthood to give out free birth control pills... but that costs a LOT LESS than years and years of welfare payments and other benefits for a low-income child. And if women who had never otherwise been given an option in life were to receive the support to seek a path other than perpetual childbearing and welfare, they might actually break the cycle. Will everyone break the cycle? Of course not. But if you take away the incentive of perpetual welfare payments, and make it more lucrative and beneficial to actually get a job and have a smaller brood of children, then hopefully more people will take that path. But the first step is strictly limiting the amount of money a person can get for being an unemployed parent. My tax dollars shouldn't support someone else's bad decisions, and perhaps even encourage those bad decisions. I work and pay taxes. That's the responsibility of every capable adult. If a person has an emergency, medical problem, or other unexpected situation, I think it's good for a civilized society to help them bridge the gap so they can become healthy, productive, or situationally stable again. If a person who has worked his entire life shatters his leg in an accident, and he works as a construction worker, he needs time to train to a new job or recover to the point where he can work again. If a person is diagnosed with cancer, then a good society helps that person while she is recovering. But if a person spends his or her lie avoiding work and responsibility, and expects to get money just for breeding... we need to stop that sort of garbage. Can we force people to stop having children? Of course not. We're not China. People have the freedom to breed. But we shouldn't fund their breeding with our tax dollars. You want kids? You support them.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 12:29:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "If you can't afford kids, use contraception. If that doesn't work, then sterilization or a chastity belt. And if that doesn't work, take the garden shears, and cut big-daddy pee-funk's nutz off. Snip, snip... \"The World's Finest\"", 
        "intTime": 20090509, 
        "postID": 77, 
        "quote": "", 
        "reply": "If you can't afford kids, use contraception. If that doesn't work, then sterilization or a chastity belt. And if that doesn't work, take the garden shears, and cut big-daddy pee-funk's nutz off. Snip, snip... \"The World's Finest\"", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 12:40:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Kegler300"
    }, 
    {
        "content": "My Mother spent most of her childhood and early adult years in Puerto Rico. She told me about a government policy there that was in effect around the 1930s or 1940s until it was reversed due to legal challenges. In those days what a couple(or single mother if that was the case) was billed for the medical services involved in delivering a baby was equivalent to one month's salary. The rich paid more, the middle class less for the same basic service. The government provided the service free of charge for those with little or no income, but there was a catch. Delivery of a second child on the government's tab included a sterilization procedure. The legal problems stemmed from the fact that the poor mothers weren't informed that they were being sterilized. I could support free government sterilizations in exchange for the free medical care, but not without prior disclosure and consent of the mother.", 
        "intTime": 20090509, 
        "postID": 78, 
        "quote": "", 
        "reply": "My Mother spent most of her childhood and early adult years in Puerto Rico. She told me about a government policy there that was in effect around the 1930s or 1940s until it was reversed due to legal challenges. In those days what a couple(or single mother if that was the case) was billed for the medical services involved in delivering a baby was equivalent to one month's salary. The rich paid more, the middle class less for the same basic service. The government provided the service free of charge for those with little or no income, but there was a catch. Delivery of a second child on the government's tab included a sterilization procedure. The legal problems stemmed from the fact that the poor mothers weren't informed that they were being sterilized. I could support free government sterilizations in exchange for the free medical care, but not without prior disclosure and consent of the mother.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 15:17:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real.", 
        "intTime": 20090509, 
        "postID": 79, 
        "quote": "", 
        "reply": "I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 20:28:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real. Yes, sterilisation was integral to Nazi thinking. Look, this entire welfare debate is just an excuse to get away from having a minimu wage which is also a living wage. Conservatives are RIGHT to attack welfare as insitutionalising poverty. But they don't want to deal with the obvious logic of their conclusions. Liberals are quite content to institutionalise poverty, because their afraid of being accused of being \"Socialists.\" What was the original \"welfare\" program all about? Roosevelt created it to aid those who could not work. No one else was eligible. At the same time he created the minumum wage program, and created it as a Living Wage program. Well you can't live off the minimum wage, and there should be no welfare for those who CAN work. Of course government should be the employer of last resort - Strictly an emergency measure, but a living wage is integral to any intelligent program. As for this crap about children, it's just another excuse to dodge the real problems. And spending money to train people for real jobs is a hell of a lot cheaper than any of this nonsense going on today. Dave", 
        "intTime": 20090509, 
        "postID": 80, 
        "quote": "Originally posted by crackerjacks61: I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real.", 
        "reply": " Yes, sterilisation was integral to Nazi thinking. Look, this entire welfare debate is just an excuse to get away from having a minimu wage which is also a living wage. Conservatives are RIGHT to attack welfare as insitutionalising poverty. But they don't want to deal with the obvious logic of their conclusions. Liberals are quite content to institutionalise poverty, because their afraid of being accused of being \"Socialists.\" What was the original \"welfare\" program all about? Roosevelt created it to aid those who could not work. No one else was eligible. At the same time he created the minumum wage program, and created it as a Living Wage program. Well you can't live off the minimum wage, and there should be no welfare for those who CAN work. Of course government should be the employer of last resort - Strictly an emergency measure, but a living wage is integral to any intelligent program. As for this crap about children, it's just another excuse to dodge the real problems. And spending money to train people for real jobs is a hell of a lot cheaper than any of this nonsense going on today. Dave", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 20:40:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Grachus"
    }, 
    {
        "content": "Here is a three part series--examining the topic \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.01.002.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.05.001.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.08.001.pdart\"", 
        "intTime": 20090508, 
        "postID": 81, 
        "quote": "", 
        "reply": "Here is a three part series--examining the topic \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.01.002.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.05.001.pdart\" \"http://www.thepublicdiscourse.com/viewarticle.php?selectedarticle=2009.05.08.001.pdart\"", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-08 21:51:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "3678131"
    }, 
    {
        "content": "Is there a corollary in forcing the rich to adopt?", 
        "intTime": 20090509, 
        "postID": 82, 
        "quote": "", 
        "reply": "Is there a corollary in forcing the rich to adopt?", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 06:51:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "popsiq"
    }, 
    {
        "content": "Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "intTime": 20090509, 
        "postID": 83, 
        "quote": "", 
        "reply": "Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 06:57:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren. I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090509, 
        "postID": 84, 
        "quote": "Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "reply": " I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 07:28:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough.", 
        "intTime": 20090509, 
        "postID": 85, 
        "quote": "I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government.", 
        "reply": " Yep, the incentive needs to stop, enough is enough.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 08:06:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "intTime": 20090509, 
        "postID": 86, 
        "quote": "Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough.", 
        "reply": " You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 08:30:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave Ya and additional hundreds of billions to corporate big wig retirement funds", 
        "intTime": 20090509, 
        "postID": 87, 
        "quote": "Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "reply": " Ya and additional hundreds of billions to corporate big wig retirement funds", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 08:51:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090509, 
        "postID": 88, 
        "quote": "Originally posted by Grachus: quote: Originally posted by soscorpio: quote: I don't know how it works in Canada, but here in America, the poor have children in many cases to receive MORE money from the government. Yep, the incentive needs to stop, enough is enough. You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "reply": " As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 09:02:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "L0A1"
    }, 
    {
        "content": "Oficially \"welfare\" may have been reforemd but that is just semantics as a barrage of other programs now funnel down to those that know how to milk the system. EIC from the IRS is welfare. HUD is welfare. Medicaid - medicair is welfare Food stamps is welfare. WIC is welfare. And I'm sure there are others that many collect for years and years. Welfare was started as a good program that has exploded into an abuse on the working people.", 
        "intTime": 20090509, 
        "postID": 89, 
        "quote": "", 
        "reply": "Oficially \"welfare\" may have been reforemd but that is just semantics as a barrage of other programs now funnel down to those that know how to milk the system. EIC from the IRS is welfare. HUD is welfare. Medicaid - medicair is welfare Food stamps is welfare. WIC is welfare. And I'm sure there are others that many collect for years and years. Welfare was started as a good program that has exploded into an abuse on the working people.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 09:32:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "soscorpio"
    }, 
    {
        "content": "quote: Originally posted by Grachus: You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave quote: Originally posted by L0A1: As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Well, I don't know what your State program is. But State Programs are largely funded by Federal money. As I said, Federal money can only be given for two year stretches, five year cumulative maximum. Here in NYC, you can't even get any welfare without working for the City. And yes, the City does provide day care while you are fulfilling your work obligation. Google it. Personally, I've always thought that the only welfare program that makes sense, is a living wage law, coupled with job training if you have no skills. Dave", 
        "intTime": 20090509, 
        "postID": 90, 
        "quote": "Originally posted by Grachus: You guys keeping up with the news? Welfare was \"reformed\" out of existance in the 90's. While you still might get some help, as in day care or health care, people are no longer living off of welfare. (Two years max, and five years cumulative.) On the other hand, we just gave 700 billion in welfare payments to the banks, which is about 200 years of welfare under the old programs. Dave", 
        "reply": " quote: Originally posted by L0A1: As you know Dave, I don't nor will I ever support these Bailout programs. It is generational theft coined by McCain. As far as welfar reform goes, My neighbor recently kicked her 17 year old out because she no longer receives a check for him. She recentl gave birth and admittedly has babies for the moeny. She is scum, but DOES live off welfare. She has 8 kids and has one about ever 2 - 3 years. The is gets welfare again. Well, I don't know what your State program is. But State Programs are largely funded by Federal money. As I said, Federal money can only be given for two year stretches, five year cumulative maximum. Here in NYC, you can't even get any welfare without working for the City. And yes, the City does provide day care while you are fulfilling your work obligation. Google it. Personally, I've always thought that the only welfare program that makes sense, is a living wage law, coupled with job training if you have no skills. Dave", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 09:43:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren. Didn't know you needed medical care to buy condoms.....interesting.", 
        "intTime": 20090509, 
        "postID": 91, 
        "quote": "Originally posted by popsiq: Tangentially related, but if the 'poor' had the same kind of medical treatment available to rich retirees, like the kind depicted on last night's 60 Minutes (about Medicare), they might have less children. At least it wouldn't be for lack of medical advice or intervention. The wealthy seem to be stealing (have stolen?) the futures of somebody else's grandchildren.", 
        "reply": " Didn't know you needed medical care to buy condoms.....interesting.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 10:03:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "sw614"
    }, 
    {
        "content": "I think that if a person has a kid while already on welfare, then that person shouldn't get another dime. I know, it punishes the innocent child, but I'm tired of people breeding without restraint just to get additional benefits out of my tax dollars. People already KNOW how to use contraception. It's not rocket science, and even the dumbest high-school dropout knows how to use a rubber. The challenge is empowering women to take care of their own contraception needs, to give them the tools to educate themselves, and the promise of a world where the rewards of WORKING and EARNING a living are better than popping out kids to receive handouts and welfare. Sure, it costs a few dollars for Planned Parenthood to give out free birth control pills... but that costs a LOT LESS than years and years of welfare payments and other benefits for a low-income child. And if women who had never otherwise been given an option in life were to receive the support to seek a path other than perpetual childbearing and welfare, they might actually break the cycle. Will everyone break the cycle? Of course not. But if you take away the incentive of perpetual welfare payments, and make it more lucrative and beneficial to actually get a job and have a smaller brood of children, then hopefully more people will take that path. But the first step is strictly limiting the amount of money a person can get for being an unemployed parent. My tax dollars shouldn't support someone else's bad decisions, and perhaps even encourage those bad decisions. I work and pay taxes. That's the responsibility of every capable adult. If a person has an emergency, medical problem, or other unexpected situation, I think it's good for a civilized society to help them bridge the gap so they can become healthy, productive, or situationally stable again. If a person who has worked his entire life shatters his leg in an accident, and he works as a construction worker, he needs time to train to a new job or recover to the point where he can work again. If a person is diagnosed with cancer, then a good society helps that person while she is recovering. But if a person spends his or her lie avoiding work and responsibility, and expects to get money just for breeding... we need to stop that sort of garbage. Can we force people to stop having children? Of course not. We're not China. People have the freedom to breed. But we shouldn't fund their breeding with our tax dollars. You want kids? You support them.", 
        "intTime": 20090509, 
        "postID": 92, 
        "quote": "", 
        "reply": "I think that if a person has a kid while already on welfare, then that person shouldn't get another dime. I know, it punishes the innocent child, but I'm tired of people breeding without restraint just to get additional benefits out of my tax dollars. People already KNOW how to use contraception. It's not rocket science, and even the dumbest high-school dropout knows how to use a rubber. The challenge is empowering women to take care of their own contraception needs, to give them the tools to educate themselves, and the promise of a world where the rewards of WORKING and EARNING a living are better than popping out kids to receive handouts and welfare. Sure, it costs a few dollars for Planned Parenthood to give out free birth control pills... but that costs a LOT LESS than years and years of welfare payments and other benefits for a low-income child. And if women who had never otherwise been given an option in life were to receive the support to seek a path other than perpetual childbearing and welfare, they might actually break the cycle. Will everyone break the cycle? Of course not. But if you take away the incentive of perpetual welfare payments, and make it more lucrative and beneficial to actually get a job and have a smaller brood of children, then hopefully more people will take that path. But the first step is strictly limiting the amount of money a person can get for being an unemployed parent. My tax dollars shouldn't support someone else's bad decisions, and perhaps even encourage those bad decisions. I work and pay taxes. That's the responsibility of every capable adult. If a person has an emergency, medical problem, or other unexpected situation, I think it's good for a civilized society to help them bridge the gap so they can become healthy, productive, or situationally stable again. If a person who has worked his entire life shatters his leg in an accident, and he works as a construction worker, he needs time to train to a new job or recover to the point where he can work again. If a person is diagnosed with cancer, then a good society helps that person while she is recovering. But if a person spends his or her lie avoiding work and responsibility, and expects to get money just for breeding... we need to stop that sort of garbage. Can we force people to stop having children? Of course not. We're not China. People have the freedom to breed. But we shouldn't fund their breeding with our tax dollars. You want kids? You support them.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 12:29:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "If you can't afford kids, use contraception. If that doesn't work, then sterilization or a chastity belt. And if that doesn't work, take the garden shears, and cut big-daddy pee-funk's nutz off. Snip, snip... \"The World's Finest\"", 
        "intTime": 20090509, 
        "postID": 93, 
        "quote": "", 
        "reply": "If you can't afford kids, use contraception. If that doesn't work, then sterilization or a chastity belt. And if that doesn't work, take the garden shears, and cut big-daddy pee-funk's nutz off. Snip, snip... \"The World's Finest\"", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 12:40:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Kegler300"
    }, 
    {
        "content": "My Mother spent most of her childhood and early adult years in Puerto Rico. She told me about a government policy there that was in effect around the 1930s or 1940s until it was reversed due to legal challenges. In those days what a couple(or single mother if that was the case) was billed for the medical services involved in delivering a baby was equivalent to one month's salary. The rich paid more, the middle class less for the same basic service. The government provided the service free of charge for those with little or no income, but there was a catch. Delivery of a second child on the government's tab included a sterilization procedure. The legal problems stemmed from the fact that the poor mothers weren't informed that they were being sterilized. I could support free government sterilizations in exchange for the free medical care, but not without prior disclosure and consent of the mother.", 
        "intTime": 20090509, 
        "postID": 94, 
        "quote": "", 
        "reply": "My Mother spent most of her childhood and early adult years in Puerto Rico. She told me about a government policy there that was in effect around the 1930s or 1940s until it was reversed due to legal challenges. In those days what a couple(or single mother if that was the case) was billed for the medical services involved in delivering a baby was equivalent to one month's salary. The rich paid more, the middle class less for the same basic service. The government provided the service free of charge for those with little or no income, but there was a catch. Delivery of a second child on the government's tab included a sterilization procedure. The legal problems stemmed from the fact that the poor mothers weren't informed that they were being sterilized. I could support free government sterilizations in exchange for the free medical care, but not without prior disclosure and consent of the mother.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 15:17:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real.", 
        "intTime": 20090509, 
        "postID": 95, 
        "quote": "", 
        "reply": "I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real.", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 20:28:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real. Yes, sterilisation was integral to Nazi thinking. Look, this entire welfare debate is just an excuse to get away from having a minimu wage which is also a living wage. Conservatives are RIGHT to attack welfare as insitutionalising poverty. But they don't want to deal with the obvious logic of their conclusions. Liberals are quite content to institutionalise poverty, because their afraid of being accused of being \"Socialists.\" What was the original \"welfare\" program all about? Roosevelt created it to aid those who could not work. No one else was eligible. At the same time he created the minumum wage program, and created it as a Living Wage program. Well you can't live off the minimum wage, and there should be no welfare for those who CAN work. Of course government should be the employer of last resort - Strictly an emergency measure, but a living wage is integral to any intelligent program. As for this crap about children, it's just another excuse to dodge the real problems. And spending money to train people for real jobs is a hell of a lot cheaper than any of this nonsense going on today. Dave", 
        "intTime": 20090509, 
        "postID": 96, 
        "quote": "Originally posted by crackerjacks61: I am Simply amazed by some people on here. Dave, wasn't sterilization part of the NAZI \"conservative\" movement? I think so. Most People don't want hand outs, they want to work with dignity and have jobs which can supprt a family, but you, the republican and the rest of the conservatives have already stolen. No restrictions on child numbers. Man. What two-faced double standards the party of 'no' has, they want freedom and independence but then they want the government to be able to dictate how many children a woman can have. Get real.", 
        "reply": " Yes, sterilisation was integral to Nazi thinking. Look, this entire welfare debate is just an excuse to get away from having a minimu wage which is also a living wage. Conservatives are RIGHT to attack welfare as insitutionalising poverty. But they don't want to deal with the obvious logic of their conclusions. Liberals are quite content to institutionalise poverty, because their afraid of being accused of being \"Socialists.\" What was the original \"welfare\" program all about? Roosevelt created it to aid those who could not work. No one else was eligible. At the same time he created the minumum wage program, and created it as a Living Wage program. Well you can't live off the minimum wage, and there should be no welfare for those who CAN work. Of course government should be the employer of last resort - Strictly an emergency measure, but a living wage is integral to any intelligent program. As for this crap about children, it's just another excuse to dodge the real problems. And spending money to train people for real jobs is a hell of a lot cheaper than any of this nonsense going on today. Dave", 
        "threadID": "672198221_5840078222001", 
        "time": "2009-05-09 20:40:00", 
        "title": "Forcing the Poor to Stop Having Children??", 
        "userID": "Grachus"
    }
]