[
    {
        "content": "RE: http://www.military.com/forums/0,15240,190912,00.html Seems like Mr. Cheney is trying his best to cover his arse.",
        "intTime": 20090515,
        "postID": 1,
        "quote": "",
        "reply": "RE: http://www.military.com/forums/0,15240,190912,00.html Seems like Mr. Cheney is trying his best to cover his arse.",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 04:50:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "dugout2342"
    },
    {
        "content": "Cheney actually wants to DEclassify something?!?!?!?!?! Now I HAVE seen everything!!! If he starts demanding full disclosure of government actions, I'm going to faint.",
        "intTime": 20090515,
        "postID": 2,
        "quote": "",
        "reply": "Cheney actually wants to DEclassify something?!?!?!?!?! Now I HAVE seen everything!!! If he starts demanding full disclosure of government actions, I'm going to faint.",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 04:54:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "mrmixitup"
    },
    {
        "content": "I like this format much better, Now back to the subject. I think dick cheney want to tell he authorized the torture so bad it's running him crazy, not that he wasn't(crazy)already. Just requesting the documents tell that he did it. What I can't understand is, How can man in a position(V.P.)with no power politically what so ever can authorized torture? that was a break down in leadership for the bush administration. I like what Jesse the Governor said about him, I thought it was funny.",
        "intTime": 20090515,
        "postID": 3,
        "quote": "",
        "reply": "I like this format much better, Now back to the subject. I think dick cheney want to tell he authorized the torture so bad it's running him crazy, not that he wasn't(crazy)already. Just requesting the documents tell that he did it. What I can't understand is, How can man in a position(V.P.)with no power politically what so ever can authorized torture? that was a break down in leadership for the bush administration. I like what Jesse the Governor said about him, I thought it was funny.",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 05:05:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "wtpworrier"
    },
    {
        "content": "Quite the contrary, he is trying to expose the great risks that the Obama administration is placing my country. Have another sip of Koool-aid...",
        "intTime": 20090515,
        "postID": 4,
        "quote": "",
        "reply": "Quite the contrary, he is trying to expose the great risks that the Obama administration is placing my country. Have another sip of Koool-aid...",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 05:07:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "Hrynkiw"
    },
    {
        "content": "To counter the present administration's poisioning of the inel waters by callling interogation tactics suuch as waterboarding \"torture\", former vice President Cheny wants to reveal how many thousands of American lives were saved by using the tactic. The administration's appointed head of intel says \"request denied\".",
        "intTime": 20090515,
        "postID": 5,
        "quote": "",
        "reply": "To counter the present administration's poisioning of the inel waters by callling interogation tactics suuch as waterboarding \"torture\", former vice President Cheny wants to reveal how many thousands of American lives were saved by using the tactic. The administration's appointed head of intel says \"request denied\".",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 05:37:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "jcb322000"
    },
    {
        "content": "Water boarding is torture and like Cheney it is both cowardly and dishonorable it will cost many more lives in the long run than any it may have saved. Although there is a lot of right wing extremist propaganda that it did, it is unlikely that it actually saved any lives.",
        "intTime": 20090515,
        "postID": 6,
        "quote": "",
        "reply": "Water boarding is torture and like Cheney it is both cowardly and dishonorable it will cost many more lives in the long run than any it may have saved. Although there is a lot of right wing extremist propaganda that it did, it is unlikely that it actually saved any lives.",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 05:55:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "6837602"
    },
    {
        "content": "I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again.",
        "intTime": 20090515,
        "postID": 7,
        "quote": "",
        "reply": "I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again.",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 07:29:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "Pistol762"
    },
    {
        "content": "They don't call him \"Dick\" for no reason! Just don't except his invitation for a hunting trip.",
        "intTime": 20090515,
        "postID": 8,
        "quote": "",
        "reply": "They don't call him \"Dick\" for no reason! Just don't except his invitation for a hunting trip.",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 07:50:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "kennyc"
    },
    {
        "content": "Why didn't Cheney release the memos when he was Vice President? If he feels that they would show that it was necessary to torture people to make America safe, he would have vindicated the Bush Administration by releasing them when he had the chance.",
        "intTime": 20090515,
        "postID": 9,
        "quote": "",
        "reply": "Why didn't Cheney release the memos when he was Vice President? If he feels that they would show that it was necessary to torture people to make America safe, he would have vindicated the Bush Administration by releasing them when he had the chance.",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 07:54:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "xerello"
    },
    {
        "content": "Oh the irony, they are refusing to release the memo`s by using a Executive Order Issued by bush As you are aware, a request for Mandatory Declassification Review is governed by Executive Order 12958, as amended, which was signed and executed by the President on March 25, 2003. Under section 3.5.(a)(3) of that Executive Order, a document is excluded from Mandatory Declassification Review if that document contains information that is the subject of pending litigation. This provision ensures that the Mandatory Declassification Review process is not used to disrupt simultaneous litigation proceedings that are already pending. In researching the information in question, we have discovered that it is currently the subject of pending FOIA litigation (Bloche v. Department of Defense, Amnesty International v. Central Intelligence Agency). Therefore, the requested document, which contains this information, is excluded from Mandatory Declassification Review. -- Savage",
        "intTime": 20090515,
        "postID": 10,
        "quote": "",
        "reply": "Oh the irony, they are refusing to release the memo`s by using a Executive Order Issued by bush As you are aware, a request for Mandatory Declassification Review is governed by Executive Order 12958, as amended, which was signed and executed by the President on March 25, 2003. Under section 3.5.(a)(3) of that Executive Order, a document is excluded from Mandatory Declassification Review if that document contains information that is the subject of pending litigation. This provision ensures that the Mandatory Declassification Review process is not used to disrupt simultaneous litigation proceedings that are already pending. In researching the information in question, we have discovered that it is currently the subject of pending FOIA litigation (Bloche v. Department of Defense, Amnesty International v. Central Intelligence Agency). Therefore, the requested document, which contains this information, is excluded from Mandatory Declassification Review. -- Savage",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 08:03:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "A_Savage"
    },
    {
        "content": "quote: Originally posted by xerello: Why didn't Cheney release the memos when he was Vice President? If he feels that they would show that it was necessary to torture people to make America safe, he would have vindicated the Bush Administration by releasing them when he had the chance. Because his boss said no. That's just one of the reasons why the two haven't been big bud's for quite a while now (Libby's non-pardon being the other). GWB did not want torture as his legacy and the reckless Cheney could care less. The guy is in a world of his own. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090515,
        "postID": 11,
        "quote": "Originally posted by xerello: Why didn't Cheney release the memos when he was Vice President? If he feels that they would show that it was necessary to torture people to make America safe, he would have vindicated the Bush Administration by releasing them when he had the chance.",
        "reply": " Because his boss said no. That's just one of the reasons why the two haven't been big bud's for quite a while now (Libby's non-pardon being the other). GWB did not want torture as his legacy and the reckless Cheney could care less. The guy is in a world of his own. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 08:08:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by Pistol762: I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again. Wrongo, it's Cheney who hates America and has total contempt for all America stands for. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090515,
        "postID": 12,
        "quote": "Originally posted by Pistol762: I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again.",
        "reply": " Wrongo, it's Cheney who hates America and has total contempt for all America stands for. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 08:10:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by Pistol762: I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again. Wrongo, it's Cheney who hates America and all it stands for. you're confusing Jack.....you used to say he was robbing money from the war coffers as a Capitalist and now he hates his country that is Capitalist?????? are you suggesting between the lines we are now socialist? Already past the future",
        "intTime": 20090515,
        "postID": 13,
        "quote": "Originally posted by jack_flats: quote: Originally posted by Pistol762: I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again. Wrongo, it's Cheney who hates America and all it stands for.",
        "reply": " you're confusing Jack.....you used to say he was robbing money from the war coffers as a Capitalist and now he hates his country that is Capitalist?????? are you suggesting between the lines we are now socialist? Already past the future",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 08:17:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "6486143"
    },
    {
        "content": "Cheney is just trying to CHA after working behind the as VP and not saying much. except we can do that! Now he wants to show that they extracted good info and prevented attacks on the US. Is it not funny when he was VP and others demanded full disclosure he would decline. Hi blood must be boiling after being told NO! something he is not use to hearing but is use to dishing it out.",
        "intTime": 20090515,
        "postID": 14,
        "quote": "",
        "reply": "Cheney is just trying to CHA after working behind the as VP and not saying much. except we can do that! Now he wants to show that they extracted good info and prevented attacks on the US. Is it not funny when he was VP and others demanded full disclosure he would decline. Hi blood must be boiling after being told NO! something he is not use to hearing but is use to dishing it out.",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 08:25:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "Junebug2983"
    },
    {
        "content": "quote: Originally posted by Junebug2983: Cheney is just trying to CHA after working behind the as VP and not saying much. except we can do that! Now he wants to show that they extracted good info and prevented attacks on the US. Is it not funny when he was VP and others demanded full disclosure he would decline. Hi blood must be boiling after being told NO! something he is not use to hearing but is use to dishing it out.",
        "intTime": 20090515,
        "postID": 15,
        "quote": "Originally posted by Junebug2983: Cheney is just trying to CHA after working behind the as VP and not saying much. except we can do that! Now he wants to show that they extracted good info and prevented attacks on the US. Is it not funny when he was VP and others demanded full disclosure he would decline. Hi blood must be boiling after being told NO! something he is not use to hearing but is use to dishing it out.",
        "reply": "",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 08:33:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "Junebug2983"
    },
    {
        "content": "Bush was a figure head Cheney ran the show \"wtpworrier\" you got it all wrong Anf to \"Hrynkiw\" You are so wrong you don't know what you are talking about this is my Country too and Cheney is a money hungry jerk who don't give a dam about it. He put us in really bad shape around the world nuts. AND TO \"jcb322000\" What do you call water Boarding let me do it to you then you can think about wheather it is torture or not! \"Pistol762\" Your just as NUTS AS Cheney is must be related!. To kennyc\" I agreed he will say he shot you by accident he did not see you!",
        "intTime": 20090515,
        "postID": 16,
        "quote": "",
        "reply": "Bush was a figure head Cheney ran the show \"wtpworrier\" you got it all wrong Anf to \"Hrynkiw\" You are so wrong you don't know what you are talking about this is my Country too and Cheney is a money hungry jerk who don't give a dam about it. He put us in really bad shape around the world nuts. AND TO \"jcb322000\" What do you call water Boarding let me do it to you then you can think about wheather it is torture or not! \"Pistol762\" Your just as NUTS AS Cheney is must be related!. To kennyc\" I agreed he will say he shot you by accident he did not see you!",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 09:10:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "Junebug2983"
    },
    {
        "content": "quote: Originally posted by Pistol762: \"I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again. Yes thats typical psycho rationale, except for one problem, you forced him to drink the water. Theres an old saying \"You can lead a horse to water but you can't make him drink\"",
        "intTime": 20090515,
        "postID": 17,
        "quote": "Originally posted by Pistol762: \"I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again.",
        "reply": " Yes thats typical psycho rationale, except for one problem, you forced him to drink the water. Theres an old saying \"You can lead a horse to water but you can't make him drink\"",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 09:15:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "wtpworrier"
    },
    {
        "content": "quote: Originally posted by 6486143: quote: Originally posted by jack_flats: quote: Originally posted by Pistol762: I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again. Wrongo, it's Cheney who hates America and all it stands for. you're confusing Jack.....you used to say he was robbing money from the war coffers as a Capitalist and now he hates his country that is Capitalist?????? are you suggesting between the lines we are now socialist? We have been Socialist for a long-long time. Republican's only haul out and dust off the Socialist thing now that Democrats are in power. Fact is, one of the largest Socialist undertakings ever planned and executed was just done by none other than George W. Bush himself with the bailout of his buddies in the financial system and the government taking ownership of banks. The Socialist thing here doesn't fly. Republican's are going to need more than that if hey want to re-gain the trust of the American people again. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090515,
        "postID": 18,
        "quote": "Originally posted by 6486143: quote: Originally posted by jack_flats: quote: Originally posted by Pistol762: I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again. Wrongo, it's Cheney who hates America and all it stands for. you're confusing Jack.....you used to say he was robbing money from the war coffers as a Capitalist and now he hates his country that is Capitalist?????? are you suggesting between the lines we are now socialist?",
        "reply": " We have been Socialist for a long-long time. Republican's only haul out and dust off the Socialist thing now that Democrats are in power. Fact is, one of the largest Socialist undertakings ever planned and executed was just done by none other than George W. Bush himself with the bailout of his buddies in the financial system and the government taking ownership of banks. The Socialist thing here doesn't fly. Republican's are going to need more than that if hey want to re-gain the trust of the American people again. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 09:21:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by 6486143: quote: Originally posted by jack_flats: quote: Originally posted by Pistol762: I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again. Wrongo, it's Cheney who hates America and all it stands for. you're confusing Jack.....you used to say he was robbing money from the war coffers as a Capitalist and now he hates his country that is Capitalist?????? are you suggesting between the lines we are now socialist? We have been Socialist for a long-long time. Republican's only haul out and dust off the Socialist thing now that Democrats are in power. Fact is, one of the largest Socialist undertakings ever planned and executed was just done by none other than George W. Bush himself with the bailout of his buddies in the financial system and the government taking ownership of banks. The Socialist thing here doesn't fly. Republican's are going to need more than that if hey want to re-gain the trust of the American people again. If your blaming Bush for banks being owned by the Gov't you might want to look at Obama for that one. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090515,
        "postID": 19,
        "quote": "Originally posted by jack_flats: quote: Originally posted by 6486143: quote: Originally posted by jack_flats: quote: Originally posted by Pistol762: I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again. Wrongo, it's Cheney who hates America and all it stands for. you're confusing Jack.....you used to say he was robbing money from the war coffers as a Capitalist and now he hates his country that is Capitalist?????? are you suggesting between the lines we are now socialist? We have been Socialist for a long-long time. Republican's only haul out and dust off the Socialist thing now that Democrats are in power. Fact is, one of the largest Socialist undertakings ever planned and executed was just done by none other than George W. Bush himself with the bailout of his buddies in the financial system and the government taking ownership of banks. The Socialist thing here doesn't fly. Republican's are going to need more than that if hey want to re-gain the trust of the American people again.",
        "reply": " If your blaming Bush for banks being owned by the Gov't you might want to look at Obama for that one. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 09:23:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "Anbar7"
    },
    {
        "content": "Now isn't it strange how all of you play with twist of words..just so in your mind you are right, regardless if your wrong...Now that is what is known as a liberal/democrat/progessive. The CIA allowed the BAD info to be leak and shown, but not the other side of the coin. Thats just like a divorce, there is ALWAYS two sides to the story...Funny how the cover-up has started and right in front of your eyes. And you all will just turn a blind side to it, just have you had already done for so many years. It was Clinton and Kerry and Democrat PARTY, I REPEAT. I REPEAT IT WAS CLINTON AND KERRY AND DEMOCRAT PARTY THAT SAID ON MANY OCCASSION THAT IRAQ HAD WMD'S!!!!!!! How stupid can some people believe that Bush lied!!!!!!! If anyone lied it was Clinton, Kerry,and the Democrat party. Now ask yourself what Berger stole out of the classify libary for clinton!!!! What was so important to risk that?. One man came up to Bush after Bush made President and whipser in his ear that the Intell was wrong..one man I remind you out of how many democrats and Clinton and Kerry? Why did Kerry flip-flop on his vote? BECAUSE he knew the intell was wrong for he sat on the Intell committee for christ sake.. But...and I mean but..since ONE man told Bush the intell was not right, that makes him a liar, well what about a ex-President and his democrat party? what does that make them? Hero's for not telling Bush the TRUTH!!!! You people are something else...let me tell you, you have been bull crap all over and like it... Just think if Clinton, Kerry and democrat party would have spoken up and told the truth, we would not be in Iraq today...Think about that and all those lives lost...",
        "intTime": 20090515,
        "postID": 20,
        "quote": "",
        "reply": "Now isn't it strange how all of you play with twist of words..just so in your mind you are right, regardless if your wrong...Now that is what is known as a liberal/democrat/progessive. The CIA allowed the BAD info to be leak and shown, but not the other side of the coin. Thats just like a divorce, there is ALWAYS two sides to the story...Funny how the cover-up has started and right in front of your eyes. And you all will just turn a blind side to it, just have you had already done for so many years. It was Clinton and Kerry and Democrat PARTY, I REPEAT. I REPEAT IT WAS CLINTON AND KERRY AND DEMOCRAT PARTY THAT SAID ON MANY OCCASSION THAT IRAQ HAD WMD'S!!!!!!! How stupid can some people believe that Bush lied!!!!!!! If anyone lied it was Clinton, Kerry,and the Democrat party. Now ask yourself what Berger stole out of the classify libary for clinton!!!! What was so important to risk that?. One man came up to Bush after Bush made President and whipser in his ear that the Intell was wrong..one man I remind you out of how many democrats and Clinton and Kerry? Why did Kerry flip-flop on his vote? BECAUSE he knew the intell was wrong for he sat on the Intell committee for christ sake.. But...and I mean but..since ONE man told Bush the intell was not right, that makes him a liar, well what about a ex-President and his democrat party? what does that make them? Hero's for not telling Bush the TRUTH!!!! You people are something else...let me tell you, you have been bull crap all over and like it... Just think if Clinton, Kerry and democrat party would have spoken up and told the truth, we would not be in Iraq today...Think about that and all those lives lost...",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 09:58:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "dman1948"
    },
    {
        "content": "RE: http://www.military.com/forums/0,15240,190912,00.html Seems like Mr. Cheney is trying his best to cover his arse.",
        "intTime": 20090515,
        "postID": 21,
        "quote": "",
        "reply": "RE: http://www.military.com/forums/0,15240,190912,00.html Seems like Mr. Cheney is trying his best to cover his arse.",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 04:50:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "dugout2342"
    },
    {
        "content": "Cheney actually wants to DEclassify something?!?!?!?!?! Now I HAVE seen everything!!! If he starts demanding full disclosure of government actions, I'm going to faint.",
        "intTime": 20090515,
        "postID": 22,
        "quote": "",
        "reply": "Cheney actually wants to DEclassify something?!?!?!?!?! Now I HAVE seen everything!!! If he starts demanding full disclosure of government actions, I'm going to faint.",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 04:54:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "mrmixitup"
    },
    {
        "content": "I like this format much better, Now back to the subject. I think dick cheney want to tell he authorized the torture so bad it's running him crazy, not that he wasn't(crazy)already. Just requesting the documents tell that he did it. What I can't understand is, How can man in a position(V.P.)with no power politically what so ever can authorized torture? that was a break down in leadership for the bush administration. I like what Jesse the Governor said about him, I thought it was funny.",
        "intTime": 20090515,
        "postID": 23,
        "quote": "",
        "reply": "I like this format much better, Now back to the subject. I think dick cheney want to tell he authorized the torture so bad it's running him crazy, not that he wasn't(crazy)already. Just requesting the documents tell that he did it. What I can't understand is, How can man in a position(V.P.)with no power politically what so ever can authorized torture? that was a break down in leadership for the bush administration. I like what Jesse the Governor said about him, I thought it was funny.",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 05:05:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "wtpworrier"
    },
    {
        "content": "Quite the contrary, he is trying to expose the great risks that the Obama administration is placing my country. Have another sip of Koool-aid...",
        "intTime": 20090515,
        "postID": 24,
        "quote": "",
        "reply": "Quite the contrary, he is trying to expose the great risks that the Obama administration is placing my country. Have another sip of Koool-aid...",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 05:07:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "Hrynkiw"
    },
    {
        "content": "To counter the present administration's poisioning of the inel waters by callling interogation tactics suuch as waterboarding \"torture\", former vice President Cheny wants to reveal how many thousands of American lives were saved by using the tactic. The administration's appointed head of intel says \"request denied\".",
        "intTime": 20090515,
        "postID": 25,
        "quote": "",
        "reply": "To counter the present administration's poisioning of the inel waters by callling interogation tactics suuch as waterboarding \"torture\", former vice President Cheny wants to reveal how many thousands of American lives were saved by using the tactic. The administration's appointed head of intel says \"request denied\".",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 05:37:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "jcb322000"
    },
    {
        "content": "Water boarding is torture and like Cheney it is both cowardly and dishonorable it will cost many more lives in the long run than any it may have saved. Although there is a lot of right wing extremist propaganda that it did, it is unlikely that it actually saved any lives.",
        "intTime": 20090515,
        "postID": 26,
        "quote": "",
        "reply": "Water boarding is torture and like Cheney it is both cowardly and dishonorable it will cost many more lives in the long run than any it may have saved. Although there is a lot of right wing extremist propaganda that it did, it is unlikely that it actually saved any lives.",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 05:55:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "6837602"
    },
    {
        "content": "I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again.",
        "intTime": 20090515,
        "postID": 27,
        "quote": "",
        "reply": "I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again.",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 07:29:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "Pistol762"
    },
    {
        "content": "They don't call him \"Dick\" for no reason! Just don't except his invitation for a hunting trip.",
        "intTime": 20090515,
        "postID": 28,
        "quote": "",
        "reply": "They don't call him \"Dick\" for no reason! Just don't except his invitation for a hunting trip.",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 07:50:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "kennyc"
    },
    {
        "content": "Why didn't Cheney release the memos when he was Vice President? If he feels that they would show that it was necessary to torture people to make America safe, he would have vindicated the Bush Administration by releasing them when he had the chance.",
        "intTime": 20090515,
        "postID": 29,
        "quote": "",
        "reply": "Why didn't Cheney release the memos when he was Vice President? If he feels that they would show that it was necessary to torture people to make America safe, he would have vindicated the Bush Administration by releasing them when he had the chance.",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 07:54:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "xerello"
    },
    {
        "content": "Oh the irony, they are refusing to release the memo`s by using a Executive Order Issued by bush As you are aware, a request for Mandatory Declassification Review is governed by Executive Order 12958, as amended, which was signed and executed by the President on March 25, 2003. Under section 3.5.(a)(3) of that Executive Order, a document is excluded from Mandatory Declassification Review if that document contains information that is the subject of pending litigation. This provision ensures that the Mandatory Declassification Review process is not used to disrupt simultaneous litigation proceedings that are already pending. In researching the information in question, we have discovered that it is currently the subject of pending FOIA litigation (Bloche v. Department of Defense, Amnesty International v. Central Intelligence Agency). Therefore, the requested document, which contains this information, is excluded from Mandatory Declassification Review. -- Savage",
        "intTime": 20090515,
        "postID": 30,
        "quote": "",
        "reply": "Oh the irony, they are refusing to release the memo`s by using a Executive Order Issued by bush As you are aware, a request for Mandatory Declassification Review is governed by Executive Order 12958, as amended, which was signed and executed by the President on March 25, 2003. Under section 3.5.(a)(3) of that Executive Order, a document is excluded from Mandatory Declassification Review if that document contains information that is the subject of pending litigation. This provision ensures that the Mandatory Declassification Review process is not used to disrupt simultaneous litigation proceedings that are already pending. In researching the information in question, we have discovered that it is currently the subject of pending FOIA litigation (Bloche v. Department of Defense, Amnesty International v. Central Intelligence Agency). Therefore, the requested document, which contains this information, is excluded from Mandatory Declassification Review. -- Savage",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 08:03:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "A_Savage"
    },
    {
        "content": "quote: Originally posted by xerello: Why didn't Cheney release the memos when he was Vice President? If he feels that they would show that it was necessary to torture people to make America safe, he would have vindicated the Bush Administration by releasing them when he had the chance. Because his boss said no. That's just one of the reasons why the two haven't been big bud's for quite a while now (Libby's non-pardon being the other). GWB did not want torture as his legacy and the reckless Cheney could care less. The guy is in a world of his own. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090515,
        "postID": 31,
        "quote": "Originally posted by xerello: Why didn't Cheney release the memos when he was Vice President? If he feels that they would show that it was necessary to torture people to make America safe, he would have vindicated the Bush Administration by releasing them when he had the chance.",
        "reply": " Because his boss said no. That's just one of the reasons why the two haven't been big bud's for quite a while now (Libby's non-pardon being the other). GWB did not want torture as his legacy and the reckless Cheney could care less. The guy is in a world of his own. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 08:08:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by Pistol762: I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again. Wrongo, it's Cheney who hates America and has total contempt for all America stands for. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090515,
        "postID": 32,
        "quote": "Originally posted by Pistol762: I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again.",
        "reply": " Wrongo, it's Cheney who hates America and has total contempt for all America stands for. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 08:10:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by Pistol762: I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again. Wrongo, it's Cheney who hates America and all it stands for. you're confusing Jack.....you used to say he was robbing money from the war coffers as a Capitalist and now he hates his country that is Capitalist?????? are you suggesting between the lines we are now socialist? Already past the future",
        "intTime": 20090515,
        "postID": 33,
        "quote": "Originally posted by jack_flats: quote: Originally posted by Pistol762: I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again. Wrongo, it's Cheney who hates America and all it stands for.",
        "reply": " you're confusing Jack.....you used to say he was robbing money from the war coffers as a Capitalist and now he hates his country that is Capitalist?????? are you suggesting between the lines we are now socialist? Already past the future",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 08:17:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "6486143"
    },
    {
        "content": "Cheney is just trying to CHA after working behind the as VP and not saying much. except we can do that! Now he wants to show that they extracted good info and prevented attacks on the US. Is it not funny when he was VP and others demanded full disclosure he would decline. Hi blood must be boiling after being told NO! something he is not use to hearing but is use to dishing it out.",
        "intTime": 20090515,
        "postID": 34,
        "quote": "",
        "reply": "Cheney is just trying to CHA after working behind the as VP and not saying much. except we can do that! Now he wants to show that they extracted good info and prevented attacks on the US. Is it not funny when he was VP and others demanded full disclosure he would decline. Hi blood must be boiling after being told NO! something he is not use to hearing but is use to dishing it out.",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 08:25:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "Junebug2983"
    },
    {
        "content": "quote: Originally posted by Junebug2983: Cheney is just trying to CHA after working behind the as VP and not saying much. except we can do that! Now he wants to show that they extracted good info and prevented attacks on the US. Is it not funny when he was VP and others demanded full disclosure he would decline. Hi blood must be boiling after being told NO! something he is not use to hearing but is use to dishing it out.",
        "intTime": 20090515,
        "postID": 35,
        "quote": "Originally posted by Junebug2983: Cheney is just trying to CHA after working behind the as VP and not saying much. except we can do that! Now he wants to show that they extracted good info and prevented attacks on the US. Is it not funny when he was VP and others demanded full disclosure he would decline. Hi blood must be boiling after being told NO! something he is not use to hearing but is use to dishing it out.",
        "reply": "",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 08:33:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "Junebug2983"
    },
    {
        "content": "Bush was a figure head Cheney ran the show \"wtpworrier\" you got it all wrong Anf to \"Hrynkiw\" You are so wrong you don't know what you are talking about this is my Country too and Cheney is a money hungry jerk who don't give a dam about it. He put us in really bad shape around the world nuts. AND TO \"jcb322000\" What do you call water Boarding let me do it to you then you can think about wheather it is torture or not! \"Pistol762\" Your just as NUTS AS Cheney is must be related!. To kennyc\" I agreed he will say he shot you by accident he did not see you!",
        "intTime": 20090515,
        "postID": 36,
        "quote": "",
        "reply": "Bush was a figure head Cheney ran the show \"wtpworrier\" you got it all wrong Anf to \"Hrynkiw\" You are so wrong you don't know what you are talking about this is my Country too and Cheney is a money hungry jerk who don't give a dam about it. He put us in really bad shape around the world nuts. AND TO \"jcb322000\" What do you call water Boarding let me do it to you then you can think about wheather it is torture or not! \"Pistol762\" Your just as NUTS AS Cheney is must be related!. To kennyc\" I agreed he will say he shot you by accident he did not see you!",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 09:10:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "Junebug2983"
    },
    {
        "content": "quote: Originally posted by Pistol762: \"I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again. Yes thats typical psycho rationale, except for one problem, you forced him to drink the water. Theres an old saying \"You can lead a horse to water but you can't make him drink\"",
        "intTime": 20090515,
        "postID": 37,
        "quote": "Originally posted by Pistol762: \"I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again.",
        "reply": " Yes thats typical psycho rationale, except for one problem, you forced him to drink the water. Theres an old saying \"You can lead a horse to water but you can't make him drink\"",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 09:15:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "wtpworrier"
    },
    {
        "content": "quote: Originally posted by 6486143: quote: Originally posted by jack_flats: quote: Originally posted by Pistol762: I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again. Wrongo, it's Cheney who hates America and all it stands for. you're confusing Jack.....you used to say he was robbing money from the war coffers as a Capitalist and now he hates his country that is Capitalist?????? are you suggesting between the lines we are now socialist? We have been Socialist for a long-long time. Republican's only haul out and dust off the Socialist thing now that Democrats are in power. Fact is, one of the largest Socialist undertakings ever planned and executed was just done by none other than George W. Bush himself with the bailout of his buddies in the financial system and the government taking ownership of banks. The Socialist thing here doesn't fly. Republican's are going to need more than that if hey want to re-gain the trust of the American people again. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090515,
        "postID": 38,
        "quote": "Originally posted by 6486143: quote: Originally posted by jack_flats: quote: Originally posted by Pistol762: I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again. Wrongo, it's Cheney who hates America and all it stands for. you're confusing Jack.....you used to say he was robbing money from the war coffers as a Capitalist and now he hates his country that is Capitalist?????? are you suggesting between the lines we are now socialist?",
        "reply": " We have been Socialist for a long-long time. Republican's only haul out and dust off the Socialist thing now that Democrats are in power. Fact is, one of the largest Socialist undertakings ever planned and executed was just done by none other than George W. Bush himself with the bailout of his buddies in the financial system and the government taking ownership of banks. The Socialist thing here doesn't fly. Republican's are going to need more than that if hey want to re-gain the trust of the American people again. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 09:21:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by 6486143: quote: Originally posted by jack_flats: quote: Originally posted by Pistol762: I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again. Wrongo, it's Cheney who hates America and all it stands for. you're confusing Jack.....you used to say he was robbing money from the war coffers as a Capitalist and now he hates his country that is Capitalist?????? are you suggesting between the lines we are now socialist? We have been Socialist for a long-long time. Republican's only haul out and dust off the Socialist thing now that Democrats are in power. Fact is, one of the largest Socialist undertakings ever planned and executed was just done by none other than George W. Bush himself with the bailout of his buddies in the financial system and the government taking ownership of banks. The Socialist thing here doesn't fly. Republican's are going to need more than that if hey want to re-gain the trust of the American people again. If your blaming Bush for banks being owned by the Gov't you might want to look at Obama for that one. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090515,
        "postID": 39,
        "quote": "Originally posted by jack_flats: quote: Originally posted by 6486143: quote: Originally posted by jack_flats: quote: Originally posted by Pistol762: I like the former VP, he has the guts to speak up and not allow the lies of the leftist Hate America crowd to stand! I think we were being lenient to these Islamofacist animals, by not using their techniques of cutting off body parts! Instead we offered them a drink of water! I had only hoped the animals gargled to death! Of course if the documents do come out...then the Liar of the House Nancy will change her story again. Wrongo, it's Cheney who hates America and all it stands for. you're confusing Jack.....you used to say he was robbing money from the war coffers as a Capitalist and now he hates his country that is Capitalist?????? are you suggesting between the lines we are now socialist? We have been Socialist for a long-long time. Republican's only haul out and dust off the Socialist thing now that Democrats are in power. Fact is, one of the largest Socialist undertakings ever planned and executed was just done by none other than George W. Bush himself with the bailout of his buddies in the financial system and the government taking ownership of banks. The Socialist thing here doesn't fly. Republican's are going to need more than that if hey want to re-gain the trust of the American people again.",
        "reply": " If your blaming Bush for banks being owned by the Gov't you might want to look at Obama for that one. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 09:23:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "Anbar7"
    },
    {
        "content": "Now isn't it strange how all of you play with twist of words..just so in your mind you are right, regardless if your wrong...Now that is what is known as a liberal/democrat/progessive. The CIA allowed the BAD info to be leak and shown, but not the other side of the coin. Thats just like a divorce, there is ALWAYS two sides to the story...Funny how the cover-up has started and right in front of your eyes. And you all will just turn a blind side to it, just have you had already done for so many years. It was Clinton and Kerry and Democrat PARTY, I REPEAT. I REPEAT IT WAS CLINTON AND KERRY AND DEMOCRAT PARTY THAT SAID ON MANY OCCASSION THAT IRAQ HAD WMD'S!!!!!!! How stupid can some people believe that Bush lied!!!!!!! If anyone lied it was Clinton, Kerry,and the Democrat party. Now ask yourself what Berger stole out of the classify libary for clinton!!!! What was so important to risk that?. One man came up to Bush after Bush made President and whipser in his ear that the Intell was wrong..one man I remind you out of how many democrats and Clinton and Kerry? Why did Kerry flip-flop on his vote? BECAUSE he knew the intell was wrong for he sat on the Intell committee for christ sake.. But...and I mean but..since ONE man told Bush the intell was not right, that makes him a liar, well what about a ex-President and his democrat party? what does that make them? Hero's for not telling Bush the TRUTH!!!! You people are something else...let me tell you, you have been bull crap all over and like it... Just think if Clinton, Kerry and democrat party would have spoken up and told the truth, we would not be in Iraq today...Think about that and all those lives lost...",
        "intTime": 20090515,
        "postID": 40,
        "quote": "",
        "reply": "Now isn't it strange how all of you play with twist of words..just so in your mind you are right, regardless if your wrong...Now that is what is known as a liberal/democrat/progessive. The CIA allowed the BAD info to be leak and shown, but not the other side of the coin. Thats just like a divorce, there is ALWAYS two sides to the story...Funny how the cover-up has started and right in front of your eyes. And you all will just turn a blind side to it, just have you had already done for so many years. It was Clinton and Kerry and Democrat PARTY, I REPEAT. I REPEAT IT WAS CLINTON AND KERRY AND DEMOCRAT PARTY THAT SAID ON MANY OCCASSION THAT IRAQ HAD WMD'S!!!!!!! How stupid can some people believe that Bush lied!!!!!!! If anyone lied it was Clinton, Kerry,and the Democrat party. Now ask yourself what Berger stole out of the classify libary for clinton!!!! What was so important to risk that?. One man came up to Bush after Bush made President and whipser in his ear that the Intell was wrong..one man I remind you out of how many democrats and Clinton and Kerry? Why did Kerry flip-flop on his vote? BECAUSE he knew the intell was wrong for he sat on the Intell committee for christ sake.. But...and I mean but..since ONE man told Bush the intell was not right, that makes him a liar, well what about a ex-President and his democrat party? what does that make them? Hero's for not telling Bush the TRUTH!!!! You people are something else...let me tell you, you have been bull crap all over and like it... Just think if Clinton, Kerry and democrat party would have spoken up and told the truth, we would not be in Iraq today...Think about that and all those lives lost...",
        "threadID": "672198221_8790053322001",
        "time": "2009-05-15 09:58:00",
        "title": "CIA Denies Cheney Request to Declassify Memos",
        "userID": "dman1948"
    }
]