[
    {
        "content": "- David Kilcullen's latest on how to win in Afghanistan... Kinda makes it sound obvious. But hey, the dude knows what he is talking about. quote: Sir Olaf Caroe — a legendary figure of the Raj, ethnographer of the Pashtuns and last administrator of the North-West Frontier of British India — wrote in 1958 that ‘unlike other wars, Afghan wars become serious only when they are over; in British times at least they were apt to produce an after-crop of tribal unrest [and] constant intrigue among the border tribes.’ Western leaders would have been wise to consider his words after the ‘stunning defeat’ of the Taleban, whose ramshackle theocratic tyranny crumbled in less than ten weeks’ fighting after 9/11. +http://www.spectator.co.uk/print/the-magazine/features/3634478/if-we-lose-hearts-and-minds-we-will-lose-the-war.thtml -", 
        "intTime": 20090526, 
        "postID": 1, 
        "quote": "Sir Olaf Caroe — a legendary figure of the Raj, ethnographer of the Pashtuns and last administrator of the North-West Frontier of British India — wrote in 1958 that ‘unlike other wars, Afghan wars become serious only when they are over; in British times at least they were apt to produce an after-crop of tribal unrest [and] constant intrigue among the border tribes.’ Western leaders would have been wise to consider his words after the ‘stunning defeat’ of the Taleban, whose ramshackle theocratic tyranny crumbled in less than ten weeks’ fighting after 9/11.", 
        "reply": "- David Kilcullen's latest on how to win in Afghanistan... Kinda makes it sound obvious. But hey, the dude knows what he is talking about.  +http://www.spectator.co.uk/print/the-magazine/features/3634478/if-we-lose-hearts-and-minds-we-will-lose-the-war.thtml -", 
        "threadID": "672198221_1980053422001", 
        "time": "2009-05-26 21:16:00", 
        "title": "More Kilcullen on Afghan win strat", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "He does? Based on what? The notion that having started a fight, the only way out is to win or lose? That's hardly innovative thinking, focussed as it is soley on the first choice. His only the latest in a string of 'revised' tactics manuals. It might delay the second outcome, but history doesn't support the thinking, at all. Bottom line, having failed, or at least not having been successful, the military mind is starting to realize that the military solution requires more than just firepower and equipment and the military. As in a previous engagement in which similar tactics were applied but apparently, little learned about counter insurgency, the military might well be on its way to another revelation that a 'military solution' never existed at all. but reinventing the wheel,and not deliberately wanting to lose, are military fundamentals. He'd be a lot more 'outspoken', as opposed to just plain foul-mouthed, if he was saying that the best 'way' is a speedy military withdrawal. Dropping the f-bomb in higher echelons may be an attention getter - but it's not an indicator of free-thinking. Neither are academic 'quals'.", 
        "intTime": 20090527, 
        "postID": 2, 
        "quote": "", 
        "reply": "He does? Based on what? The notion that having started a fight, the only way out is to win or lose? That's hardly innovative thinking, focussed as it is soley on the first choice. His only the latest in a string of 'revised' tactics manuals. It might delay the second outcome, but history doesn't support the thinking, at all. Bottom line, having failed, or at least not having been successful, the military mind is starting to realize that the military solution requires more than just firepower and equipment and the military. As in a previous engagement in which similar tactics were applied but apparently, little learned about counter insurgency, the military might well be on its way to another revelation that a 'military solution' never existed at all. but reinventing the wheel,and not deliberately wanting to lose, are military fundamentals. He'd be a lot more 'outspoken', as opposed to just plain foul-mouthed, if he was saying that the best 'way' is a speedy military withdrawal. Dropping the f-bomb in higher echelons may be an attention getter - but it's not an indicator of free-thinking. Neither are academic 'quals'.", 
        "threadID": "672198221_1980053422001", 
        "time": "2009-05-27 06:18:00", 
        "title": "More Kilcullen on Afghan win strat", 
        "userID": "AliBubba"
    }, 
    {
        "content": "- Alibubba you muppet, Before you pass judgement, perhaps you should do a little research on the guy. As an advisor to Gen. Petraeus, Lt. Col. Kilcullen literally wrote the US Army’s field guide on counterinsurgency. Heard of ‘Twenty-eight Articles: Fundamentals of Company-Level Counterinsurgency’? Yeah, he wrote that. But he’s not just an academic, he’s BTDT, serving with the Australian Army as an infantry commander in East Timor. The dude knows his stuff. quote: Dr. David Kilcullen served 21 years in the Australian Army, commanded an infantry company on counterinsurgency operations in East Timor, taught tactics on the Platoon Commanders Battle Course at the British School of Infantry, served on peace operations in Cyprus and Bougainville, was a military advisor to Indonesian Special Forces, and trained and led Timorese irregulars. He has worked in several Middle East countries with irregular and paramilitary police and military units, and was special adviser for Irregular Warfare to the 2005 U.S. Quadrennial Defense Review. He is currently seconded to the U.S. State Department as Chief Strategist in the Office of the Coordinator for Counterterrorism, and remains a Reserve Lieutenant Colonel in the Australian Army. His doctoral dissertation is a study of Indonesian insurgent and terrorist groups and counterinsurgency methods. *http://www.newyorker.com/archive/2006/12/18/061218fa_fact2?currentPage=all *http://smallwarsjournal.com/documents/28articles.pdf -", 
        "intTime": 20090527, 
        "postID": 3, 
        "quote": "Dr. David Kilcullen served 21 years in the Australian Army, commanded an infantry company on counterinsurgency operations in East Timor, taught tactics on the Platoon Commanders Battle Course at the British School of Infantry, served on peace operations in Cyprus and Bougainville, was a military advisor to Indonesian Special Forces, and trained and led Timorese irregulars. He has worked in several Middle East countries with irregular and paramilitary police and military units, and was special adviser for Irregular Warfare to the 2005 U.S. Quadrennial Defense Review. He is currently seconded to the U.S. State Department as Chief Strategist in the Office of the Coordinator for Counterterrorism, and remains a Reserve Lieutenant Colonel in the Australian Army. His doctoral dissertation is a study of Indonesian insurgent and terrorist groups and counterinsurgency methods.", 
        "reply": "- Alibubba you muppet, Before you pass judgement, perhaps you should do a little research on the guy. As an advisor to Gen. Petraeus, Lt. Col. Kilcullen literally wrote the US Army’s field guide on counterinsurgency. Heard of ‘Twenty-eight Articles: Fundamentals of Company-Level Counterinsurgency’? Yeah, he wrote that. But he’s not just an academic, he’s BTDT, serving with the Australian Army as an infantry commander in East Timor. The dude knows his stuff.  *http://www.newyorker.com/archive/2006/12/18/061218fa_fact2?currentPage=all *http://smallwarsjournal.com/documents/28articles.pdf -", 
        "threadID": "672198221_1980053422001", 
        "time": "2009-05-27 16:12:00", 
        "title": "More Kilcullen on Afghan win strat", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "quote: Originally posted by ANZACbiscuit: - Alibubba you muppet, Before you pass judgement, perhaps you should do a little research on the guy. As an advisor to Gen. Petraeus, Lt. Col. Kilcullen literally wrote the US Army’s field guide on counterinsurgency. Heard of ‘Twenty-eight Articles: Fundamentals of Company-Level Counterinsurgency’? Yeah, he wrote that. But he’s not just an academic, he’s BTDT, serving with the Australian Army as an infantry commander in East Timor. The dude knows his stuff. quote: Dr. David Kilcullen served 21 years in the Australian Army, commanded an infantry company on counterinsurgency operations in East Timor, taught tactics on the Platoon Commanders Battle Course at the British School of Infantry, served on peace operations in Cyprus and Bougainville, was a military advisor to Indonesian Special Forces, and trained and led Timorese irregulars. He has worked in several Middle East countries with irregular and paramilitary police and military units, and was special adviser for Irregular Warfare to the 2005 U.S. Quadrennial Defense Review. He is currently seconded to the U.S. State Department as Chief Strategist in the Office of the Coordinator for Counterterrorism, and remains a Reserve Lieutenant Colonel in the Australian Army. His doctoral dissertation is a study of Indonesian insurgent and terrorist groups and counterinsurgency methods. *http://www.newyorker.com/archive/2006/12/18/061218fa_fact2?currentPage=all *http://smallwarsjournal.com/documents/28articles.pdf - With apologies to Jim Henson, telling 'em what they want to hear will make you popular, but it don't necessarily make you right. Petraeus, no doubt coached by this brilliant 'new' tactical philosopher, his Iraqi guide and other various gurus - spent his way to higher command with a 'strategy' that had more clout in the US media than it's having in the streets of Iraq. Currently it's showing severe signs of wear. The notion of getting 'allies' to do the dirty work - whether from mutual benefit, or from coercion, is ancient. This century's insurgent wars have indicated its weaknesses. Weaknesses that have not been, and I believe cannot be, overcome in most arenas when foreign armies and foreign objectives are the motive force.", 
        "intTime": 20090528, 
        "postID": 4, 
        "quote": "Originally posted by ANZACbiscuit: - Alibubba you muppet, Before you pass judgement, perhaps you should do a little research on the guy. As an advisor to Gen. Petraeus, Lt. Col. Kilcullen literally wrote the US Army’s field guide on counterinsurgency. Heard of ‘Twenty-eight Articles: Fundamentals of Company-Level Counterinsurgency’? Yeah, he wrote that. But he’s not just an academic, he’s BTDT, serving with the Australian Army as an infantry commander in East Timor. The dude knows his stuff. quote: Dr. David Kilcullen served 21 years in the Australian Army, commanded an infantry company on counterinsurgency operations in East Timor, taught tactics on the Platoon Commanders Battle Course at the British School of Infantry, served on peace operations in Cyprus and Bougainville, was a military advisor to Indonesian Special Forces, and trained and led Timorese irregulars. He has worked in several Middle East countries with irregular and paramilitary police and military units, and was special adviser for Irregular Warfare to the 2005 U.S. Quadrennial Defense Review. He is currently seconded to the U.S. State Department as Chief Strategist in the Office of the Coordinator for Counterterrorism, and remains a Reserve Lieutenant Colonel in the Australian Army. His doctoral dissertation is a study of Indonesian insurgent and terrorist groups and counterinsurgency methods. *http://www.newyorker.com/archive/2006/12/18/061218fa_fact2?currentPage=all *http://smallwarsjournal.com/documents/28articles.pdf -", 
        "reply": " With apologies to Jim Henson, telling 'em what they want to hear will make you popular, but it don't necessarily make you right. Petraeus, no doubt coached by this brilliant 'new' tactical philosopher, his Iraqi guide and other various gurus - spent his way to higher command with a 'strategy' that had more clout in the US media than it's having in the streets of Iraq. Currently it's showing severe signs of wear. The notion of getting 'allies' to do the dirty work - whether from mutual benefit, or from coercion, is ancient. This century's insurgent wars have indicated its weaknesses. Weaknesses that have not been, and I believe cannot be, overcome in most arenas when foreign armies and foreign objectives are the motive force.", 
        "threadID": "672198221_1980053422001", 
        "time": "2009-05-28 05:59:00", 
        "title": "More Kilcullen on Afghan win strat", 
        "userID": "AliBubba"
    }, 
    {
        "content": "ANZACbiscuit: Thank you for the article by Kilcullen. I had never heard of Kilcullen let alone Sir Olaf Caroe. I have argued, mostly with little knowledge, that we had to get out of Afghanistan, that we could not win there, that our original mission was to \"get\" bin Ladin and AlQaeda. Our mission was not to democratize Afghanistan nor to free it from Taliban control. By having diverted to Iraq (unnecessarily) we lost our opportunity in Afghanistan and would not \"get\" AlQaeda and bin Ladin. I have also felt that since the Taliban operate across the Afghan/Pakistan border and since we fear that the Taliban might get control of the Atom Bomb from Pakistan, the US would then \"own\" the Pakistan problem. If we get out of Afghanistan, the nations of the world would have to deal with the Pakistan problem -- that would be the proper approach. As long as we are in the region, the world is satisfied to have us deal with the situation.", 
        "intTime": 20090528, 
        "postID": 5, 
        "quote": "", 
        "reply": "ANZACbiscuit: Thank you for the article by Kilcullen. I had never heard of Kilcullen let alone Sir Olaf Caroe. I have argued, mostly with little knowledge, that we had to get out of Afghanistan, that we could not win there, that our original mission was to \"get\" bin Ladin and AlQaeda. Our mission was not to democratize Afghanistan nor to free it from Taliban control. By having diverted to Iraq (unnecessarily) we lost our opportunity in Afghanistan and would not \"get\" AlQaeda and bin Ladin. I have also felt that since the Taliban operate across the Afghan/Pakistan border and since we fear that the Taliban might get control of the Atom Bomb from Pakistan, the US would then \"own\" the Pakistan problem. If we get out of Afghanistan, the nations of the world would have to deal with the Pakistan problem -- that would be the proper approach. As long as we are in the region, the world is satisfied to have us deal with the situation.", 
        "threadID": "672198221_1980053422001", 
        "time": "2009-05-28 09:51:00", 
        "title": "More Kilcullen on Afghan win strat", 
        "userID": "fnewt"
    }, 
    {
        "content": "Kilcullen is no dummy. If his general argument (which is not presented in any of the quotes) seems extraordinarily bright, even though it's just common sense, it's because so many rival arguments are fundamentally dumb. Kilcullen is an anthropologist as much as a military strategist. His critique of most popular attitudes towards the opposition is based on the simple observation that we have a tendency towards lazy thinking -- of lumping all real or potential anti-American populations together and calling them by the same name. Something like the way we used to lump the USSR, China, Albania, and Yugoslavia together as nothing more than \"communist\" who sleep in the same bed. Kilcullen has argued that we need to understand the differences between our opponents on the global stage -- and exploit those differences. They may all be \"Muslim funamentalist terrorist camel jockeys\" to some of us, but they don't see it that way at all. The devout Muslims of Indonesia have their own local problems that they are organized against, as do Muslim populations of other nations. The morons who flew the planes on 9/11 didn't hate us for our freedoms, although it's comforting to think they did. They hated us mostly because we put Playboys in their book stores, beer in their stores, McDonald's on their malls, and ladies with naked legs on their streets. An ancillary hatred was generated by our support for Israel, a nation they see as having been carved out of THEIR territory because of suffering imposed on the Jews by Europeans! (How about if we'd given the displaced Jewish survivors Florida?) And Americans have no monopoly on stupidity. Thomas Friedman of the NY Times gave a lecture tour in Indonesian colleges (colleges, mind you), in which students believed that Al Gore was Jewish. Kilcullen isn't a spectacular speaker and doesn't seek the limelight. He's quiet, thoughtful, and he mumbles a lot. For these and other reasons, we don't see or hear him very often. He's unlikely to appear on Tyra Banks. Yet I'm sure he'd have something valuable to tell us about how to tap into the modest but simmering pro-Western sentiments of the younger people in Iran, for whom the events of 1979 are ancient history, just as Vietnam is for our students. They're pretty tired of the reign of the Mullahs too. The division between the older theocrats and the younger dissidents is an opportunity ripe for exploitation. I think Kilcullen would agree that lumping Iranians all together as nationalist fanatics is both inaccurate and not constructive.", 
        "intTime": 20090529, 
        "postID": 6, 
        "quote": "", 
        "reply": "Kilcullen is no dummy. If his general argument (which is not presented in any of the quotes) seems extraordinarily bright, even though it's just common sense, it's because so many rival arguments are fundamentally dumb. Kilcullen is an anthropologist as much as a military strategist. His critique of most popular attitudes towards the opposition is based on the simple observation that we have a tendency towards lazy thinking -- of lumping all real or potential anti-American populations together and calling them by the same name. Something like the way we used to lump the USSR, China, Albania, and Yugoslavia together as nothing more than \"communist\" who sleep in the same bed. Kilcullen has argued that we need to understand the differences between our opponents on the global stage -- and exploit those differences. They may all be \"Muslim funamentalist terrorist camel jockeys\" to some of us, but they don't see it that way at all. The devout Muslims of Indonesia have their own local problems that they are organized against, as do Muslim populations of other nations. The morons who flew the planes on 9/11 didn't hate us for our freedoms, although it's comforting to think they did. They hated us mostly because we put Playboys in their book stores, beer in their stores, McDonald's on their malls, and ladies with naked legs on their streets. An ancillary hatred was generated by our support for Israel, a nation they see as having been carved out of THEIR territory because of suffering imposed on the Jews by Europeans! (How about if we'd given the displaced Jewish survivors Florida?) And Americans have no monopoly on stupidity. Thomas Friedman of the NY Times gave a lecture tour in Indonesian colleges (colleges, mind you), in which students believed that Al Gore was Jewish. Kilcullen isn't a spectacular speaker and doesn't seek the limelight. He's quiet, thoughtful, and he mumbles a lot. For these and other reasons, we don't see or hear him very often. He's unlikely to appear on Tyra Banks. Yet I'm sure he'd have something valuable to tell us about how to tap into the modest but simmering pro-Western sentiments of the younger people in Iran, for whom the events of 1979 are ancient history, just as Vietnam is for our students. They're pretty tired of the reign of the Mullahs too. The division between the older theocrats and the younger dissidents is an opportunity ripe for exploitation. I think Kilcullen would agree that lumping Iranians all together as nationalist fanatics is both inaccurate and not constructive.", 
        "threadID": "672198221_1980053422001", 
        "time": "2009-05-29 20:21:00", 
        "title": "More Kilcullen on Afghan win strat", 
        "userID": "RMax304823"
    }, 
    {
        "content": "quote: Originally posted by RMax304823: Kilcullen is no dummy. If his general argument (which is not presented in any of the quotes) seems extraordinarily bright, even though it's just common sense, it's because so many rival arguments are fundamentally dumb. Kilcullen is an anthropologist as much as a military strategist. His critique of most popular attitudes towards the opposition is based on the simple observation that we have a tendency towards lazy thinking -- of lumping all real or potential anti-American populations together and calling them by the same name. Something like the way we used to lump the USSR, China, Albania, and Yugoslavia together as nothing more than \"communist\" who sleep in the same bed. Kilcullen has argued that we need to understand the differences between our opponents on the global stage -- and exploit those differences. They may all be \"Muslim funamentalist terrorist camel jockeys\" to some of us, but they don't see it that way at all. The devout Muslims of Indonesia have their own local problems that they are organized against, as do Muslim populations of other nations. The morons who flew the planes on 9/11 didn't hate us for our freedoms, although it's comforting to think they did. They hated us mostly because we put Playboys in their book stores, beer in their stores, McDonald's on their malls, and ladies with naked legs on their streets. An ancillary hatred was generated by our support for Israel, a nation they see as having been carved out of THEIR territory because of suffering imposed on the Jews by Europeans! (How about if we'd given the displaced Jewish survivors Florida?) And Americans have no monopoly on stupidity. Thomas Friedman of the NY Times gave a lecture tour in Indonesian colleges (colleges, mind you), in which students believed that Al Gore was Jewish. Kilcullen isn't a spectacular speaker and doesn't seek the limelight. He's quiet, thoughtful, and he mumbles a lot. For these and other reasons, we don't see or hear him very often. He's unlikely to appear on Tyra Banks. Yet I'm sure he'd have something valuable to tell us about how to tap into the modest but simmering pro-Western sentiments of the younger people in Iran, for whom the events of 1979 are ancient history, just as Vietnam is for our students. They're pretty tired of the reign of the Mullahs too. The division between the older theocrats and the younger dissidents is an opportunity ripe for exploitation. I think Kilcullen would agree that lumping Iranians all together as nationalist fanatics is both inaccurate and not constructive. Thanks very much for your comments. THIS is why I hang out at Mil.com - for intelligent conversation/debate. Well, okay, and a liiiitle baiting -", 
        "intTime": 20090530, 
        "postID": 7, 
        "quote": "Originally posted by RMax304823: Kilcullen is no dummy. If his general argument (which is not presented in any of the quotes) seems extraordinarily bright, even though it's just common sense, it's because so many rival arguments are fundamentally dumb. Kilcullen is an anthropologist as much as a military strategist. His critique of most popular attitudes towards the opposition is based on the simple observation that we have a tendency towards lazy thinking -- of lumping all real or potential anti-American populations together and calling them by the same name. Something like the way we used to lump the USSR, China, Albania, and Yugoslavia together as nothing more than \"communist\" who sleep in the same bed. Kilcullen has argued that we need to understand the differences between our opponents on the global stage -- and exploit those differences. They may all be \"Muslim funamentalist terrorist camel jockeys\" to some of us, but they don't see it that way at all. The devout Muslims of Indonesia have their own local problems that they are organized against, as do Muslim populations of other nations. The morons who flew the planes on 9/11 didn't hate us for our freedoms, although it's comforting to think they did. They hated us mostly because we put Playboys in their book stores, beer in their stores, McDonald's on their malls, and ladies with naked legs on their streets. An ancillary hatred was generated by our support for Israel, a nation they see as having been carved out of THEIR territory because of suffering imposed on the Jews by Europeans! (How about if we'd given the displaced Jewish survivors Florida?) And Americans have no monopoly on stupidity. Thomas Friedman of the NY Times gave a lecture tour in Indonesian colleges (colleges, mind you), in which students believed that Al Gore was Jewish. Kilcullen isn't a spectacular speaker and doesn't seek the limelight. He's quiet, thoughtful, and he mumbles a lot. For these and other reasons, we don't see or hear him very often. He's unlikely to appear on Tyra Banks. Yet I'm sure he'd have something valuable to tell us about how to tap into the modest but simmering pro-Western sentiments of the younger people in Iran, for whom the events of 1979 are ancient history, just as Vietnam is for our students. They're pretty tired of the reign of the Mullahs too. The division between the older theocrats and the younger dissidents is an opportunity ripe for exploitation. I think Kilcullen would agree that lumping Iranians all together as nationalist fanatics is both inaccurate and not constructive.", 
        "reply": " Thanks very much for your comments. THIS is why I hang out at Mil.com - for intelligent conversation/debate. Well, okay, and a liiiitle baiting -", 
        "threadID": "672198221_1980053422001", 
        "time": "2009-05-30 00:38:00", 
        "title": "More Kilcullen on Afghan win strat", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "Military.com -- a place where you can fish and cut bait at the same time. What's a little surprising -- pleasantly surprising -- is that the majority of comments here, whether I agree with them or not, are often more thoughtful than those on other news boards like Yahoo! Buzz and Newsvine. If there is sometimes conflict on military.com, it's usually good-natured and nothing like the intensity and stupidity endemic to the others. There, the world is extremely simple. Eliminate all taxes. Obama is a Kenyan and a racist. Sotomayor is a stupid anti-white racist and activist who menstruates. (I'm not making that up.) Let's go to war at once. Let's nuke North Korea. Then maybe Iran. Show the world we have cojones, never mind about brains. It hardly seems like the country I grew up in -- a hundred and forty years ago or so.", 
        "intTime": 20090530, 
        "postID": 8, 
        "quote": "", 
        "reply": "Military.com -- a place where you can fish and cut bait at the same time. What's a little surprising -- pleasantly surprising -- is that the majority of comments here, whether I agree with them or not, are often more thoughtful than those on other news boards like Yahoo! Buzz and Newsvine. If there is sometimes conflict on military.com, it's usually good-natured and nothing like the intensity and stupidity endemic to the others. There, the world is extremely simple. Eliminate all taxes. Obama is a Kenyan and a racist. Sotomayor is a stupid anti-white racist and activist who menstruates. (I'm not making that up.) Let's go to war at once. Let's nuke North Korea. Then maybe Iran. Show the world we have cojones, never mind about brains. It hardly seems like the country I grew up in -- a hundred and forty years ago or so.", 
        "threadID": "672198221_1980053422001", 
        "time": "2009-05-30 16:04:00", 
        "title": "More Kilcullen on Afghan win strat", 
        "userID": "RMax304823"
    }
]