[
    {
        "content": "At least the situation was resolved with no casualties. ++http://news.yahoo.com/s/ap/20090420/ap_on_re_la_am_ca/cb_jamaica_airplane_hijacked quote: Jamaican police storm airliner to capture gunman Howard Campbell, Associated Press Writer – 1 hr 55 mins ago KINGSTON, Jamaica – A gunman forced his way though airport security onto a Canadian jet near Montego Bay, holding six crew members hostage for eight hours before police and soldiers stormed the aircraft on Monday and captured him. Nobody was killed or injured in the ordeal, which ended with a raid after talks broke down with a 20-year-old Jamaican gunman described as \"mentally challenged.\" \"We were getting nowhere with the negotiations,\" Jamaican Information Minister Daryl Vaz told The Associated Press. \"Police and military went on the plane and captured him.\" The suspect identified as Stephen Fray was in custody. Vaz said he is a \"mentally challenged\" man from the northwestern resort city of Montego Bay. He did not detail the man's mental condition but said he was apparently upset over a failed relationship. The hostage crisis began at about 10:20 p.m. local time Sunday and ended near 6:40 a.m., when members of the Jamaica Defence Force Counter Terrorism Operations Group stormed the aircraft's cabin, according to a police statement. The young man boarded CanJet Airlines Flight 918 and demanded to be flown to Cuba, Vaz told The Associated Press. The plane already was scheduled to stop in Santa Clara, Cuba, before returning to Canada. It arrived from arrived from Halifax, Nova Scotia. A total of 159 Canadian passengers and eight crew members were aboard the Boeing 737 at the time, according to Jamaican police. Police said all the passengers and two crew members were released after a short time. (...) Jamaican National Security Minister Dwight Nelson said the airport is expected to reopen Monday morning. ___ Associated Press writers Mike Melia in San Juan, Puerto Rico, and Rob Gillies in Toronto contributed to this report. This message has been edited. Last edited by: Canuck_Centaur, Mon 20 April 2009 10:59 AM", 
        "intTime": 20090420, 
        "postID": 1, 
        "quote": "Jamaican police storm airliner to capture gunman Howard Campbell, Associated Press Writer – 1 hr 55 mins ago KINGSTON, Jamaica – A gunman forced his way though airport security onto a Canadian jet near Montego Bay, holding six crew members hostage for eight hours before police and soldiers stormed the aircraft on Monday and captured him. Nobody was killed or injured in the ordeal, which ended with a raid after talks broke down with a 20-year-old Jamaican gunman described as \"mentally challenged.\" \"We were getting nowhere with the negotiations,\" Jamaican Information Minister Daryl Vaz told The Associated Press. \"Police and military went on the plane and captured him.\" The suspect identified as Stephen Fray was in custody. Vaz said he is a \"mentally challenged\" man from the northwestern resort city of Montego Bay. He did not detail the man's mental condition but said he was apparently upset over a failed relationship. The hostage crisis began at about 10:20 p.m. local time Sunday and ended near 6:40 a.m., when members of the Jamaica Defence Force Counter Terrorism Operations Group stormed the aircraft's cabin, according to a police statement. The young man boarded CanJet Airlines Flight 918 and demanded to be flown to Cuba, Vaz told The Associated Press. The plane already was scheduled to stop in Santa Clara, Cuba, before returning to Canada. It arrived from arrived from Halifax, Nova Scotia. A total of 159 Canadian passengers and eight crew members were aboard the Boeing 737 at the time, according to Jamaican police. Police said all the passengers and two crew members were released after a short time. (...) Jamaican National Security Minister Dwight Nelson said the airport is expected to reopen Monday morning. ___ Associated Press writers Mike Melia in San Juan, Puerto Rico, and Rob Gillies in Toronto contributed to this report.", 
        "reply": "At least the situation was resolved with no casualties. ++http://news.yahoo.com/s/ap/20090420/ap_on_re_la_am_ca/cb_jamaica_airplane_hijacked  This message has been edited. Last edited by: Canuck_Centaur, Mon 20 April 2009 10:59 AM", 
        "threadID": "672198221_4060072122001", 
        "time": "2009-04-20 10:41:00", 
        "title": "Jamaican police storm Canadian airliner to capture gunman", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Hope he likes his 24hour supervision now. Failed relationship at the age of 20...", 
        "intTime": 20090420, 
        "postID": 2, 
        "quote": "", 
        "reply": "Hope he likes his 24hour supervision now. Failed relationship at the age of 20...", 
        "threadID": "672198221_4060072122001", 
        "time": "2009-04-20 15:15:00", 
        "title": "Jamaican police storm Canadian airliner to capture gunman", 
        "userID": "Grimbo"
    }
]