[
    {
        "content": "Man this thing is one mean critter. \"bite will kill a person in about 25 minutes\" Seems like This thing kinda looks like a certain Taranchula which many have for pets. Just a matter of time before.... Brazilian Wandering Spider \"http://www.foxnews.com/story/0,2933,509876,00.html\"", 
        "intTime": 20090321, 
        "postID": 1, 
        "quote": "", 
        "reply": "Man this thing is one mean critter. \"bite will kill a person in about 25 minutes\" Seems like This thing kinda looks like a certain Taranchula which many have for pets. Just a matter of time before.... Brazilian Wandering Spider \"http://www.foxnews.com/story/0,2933,509876,00.html\"", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 07:27:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: http://www.foxnews.com/story/0,2933,509876,00.html That cooks it for the Viagra brigade! Now they be wondering if their 'woodies' aren't from a spider bite they got while picking up shopping MILFs and beer at the Piggly Wiggly. Talk about the 'Kiss of the Spider woman'!", 
        "intTime": 20090321, 
        "postID": 2, 
        "quote": "http://www.foxnews.com/story/0,2933,509876,00.html", 
        "reply": " That cooks it for the Viagra brigade! Now they be wondering if their 'woodies' aren't from a spider bite they got while picking up shopping MILFs and beer at the Piggly Wiggly. Talk about the 'Kiss of the Spider woman'!", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 08:45:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "popsiq"
    }, 
    {
        "content": "We use to crawl around the woods of Key Largo looking for smugglers. I saw a few Black Widows. Actually it was the Brown Recluse that freaked me out the most. Don", 
        "intTime": 20090321, 
        "postID": 3, 
        "quote": "", 
        "reply": "We use to crawl around the woods of Key Largo looking for smugglers. I saw a few Black Widows. Actually it was the Brown Recluse that freaked me out the most. Don", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 09:47:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "sorry cracker.... but the spider turned out to be a harmless critter.... wrong idenity made. But still would be an eye opener to find it when buying banana's or worse yet to reach down to choose which bunch you wanted and see this thing on your hand..... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090321, 
        "postID": 4, 
        "quote": "", 
        "reply": "sorry cracker.... but the spider turned out to be a harmless critter.... wrong idenity made. But still would be an eye opener to find it when buying banana's or worse yet to reach down to choose which bunch you wanted and see this thing on your hand..... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 09:58:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by popsiq: quote: http://www.foxnews.com/story/0,2933,509876,00.html That cooks it for the Viagra brigade! Now they be wondering if their 'woodies' aren't from a spider bite they got while picking up shopping MILFs and beer at the Piggly Wiggly. Talk about the 'Kiss of the Spider woman'! He, heh, according to the Wiki article on this spider, their venom IS being investigated as a cure for impotence... Dave", 
        "intTime": 20090321, 
        "postID": 5, 
        "quote": "Originally posted by popsiq: quote: http://www.foxnews.com/story/0,2933,509876,00.html That cooks it for the Viagra brigade! Now they be wondering if their 'woodies' aren't from a spider bite they got while picking up shopping MILFs and beer at the Piggly Wiggly. Talk about the 'Kiss of the Spider woman'!", 
        "reply": " He, heh, according to the Wiki article on this spider, their venom IS being investigated as a cure for impotence... Dave", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 10:00:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: We use to crawl around the woods of Key Largo looking for smugglers. I saw a few Black Widows. Actually it was the Brown Recluse that freaked me out the most. Don As well it should. The brown recluse's venom is far more dangerous than the black widow's is. Widow venom is painful, but it doesn't do massive tissue damage, (as the brown recluse's does). They're really only dangerous to kids and the elderly. Widows can be found everywhere here in the west. They're not that big a deal, their webs are easy to identify and thus they're easy to find and exterminate. Recluses are worse. They don't stay in a web, they hide, and they wander at night. Their venom can cause ya to potentially lose a digit or part of a limb, as it's a necrotoxin.", 
        "intTime": 20090321, 
        "postID": 6, 
        "quote": "Originally posted by 21yrsUSCGUSCS: We use to crawl around the woods of Key Largo looking for smugglers. I saw a few Black Widows. Actually it was the Brown Recluse that freaked me out the most. Don", 
        "reply": " As well it should. The brown recluse's venom is far more dangerous than the black widow's is. Widow venom is painful, but it doesn't do massive tissue damage, (as the brown recluse's does). They're really only dangerous to kids and the elderly. Widows can be found everywhere here in the west. They're not that big a deal, their webs are easy to identify and thus they're easy to find and exterminate. Recluses are worse. They don't stay in a web, they hide, and they wander at night. Their venom can cause ya to potentially lose a digit or part of a limb, as it's a necrotoxin.", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 10:17:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Man this thing is one mean critter. \"bite will kill a person in about 25 minutes\" Seems like This thing kinda looks like a certain Taranchula which many have for pets. Just a matter of time before.... Brazilian Wandering Spider \"http://www.foxnews.com/story/0,2933,509876,00.html\" Probably road in on a hairy legg hippie broad!", 
        "intTime": 20090321, 
        "postID": 7, 
        "quote": "Originally posted by crackerjacks61: Man this thing is one mean critter. \"bite will kill a person in about 25 minutes\" Seems like This thing kinda looks like a certain Taranchula which many have for pets. Just a matter of time before.... Brazilian Wandering Spider \"http://www.foxnews.com/story/0,2933,509876,00.html\"", 
        "reply": " Probably road in on a hairy legg hippie broad!", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 10:19:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: We use to crawl around the woods of Key Largo looking for smugglers. I saw a few Black Widows. Actually it was the Brown Recluse that freaked me out the most. Don BWs are nothing compared to the Brown...", 
        "intTime": 20090321, 
        "postID": 8, 
        "quote": "Originally posted by 21yrsUSCGUSCS: We use to crawl around the woods of Key Largo looking for smugglers. I saw a few Black Widows. Actually it was the Brown Recluse that freaked me out the most. Don", 
        "reply": " BWs are nothing compared to the Brown...", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 10:28:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by popsiq: quote: http://www.foxnews.com/story/0,2933,509876,00.html That cooks it for the Viagra brigade! Now they be wondering if their 'woodies' aren't from a spider bite they got while picking up shopping MILFs and beer at the Piggly Wiggly. Talk about the 'Kiss of the Spider woman'! He, heh, according to the Wiki article on this spider, their venom IS being investigated as a cure for impotence... Dave I wouldn't laugh, lord knows what nature has that could cure all kinds of stuff. Ever seen that movie \"Medicine Man\" with Sean Connery? Quite realistic IMO. \"Parasite turns ants into tasty looking berries - January 17, 2008\" Found this browsing...amazing.", 
        "intTime": 20090321, 
        "postID": 9, 
        "quote": "Originally posted by Grachus: quote: Originally posted by popsiq: quote: http://www.foxnews.com/story/0,2933,509876,00.html That cooks it for the Viagra brigade! Now they be wondering if their 'woodies' aren't from a spider bite they got while picking up shopping MILFs and beer at the Piggly Wiggly. Talk about the 'Kiss of the Spider woman'! He, heh, according to the Wiki article on this spider, their venom IS being investigated as a cure for impotence... Dave", 
        "reply": " I wouldn't laugh, lord knows what nature has that could cure all kinds of stuff. Ever seen that movie \"Medicine Man\" with Sean Connery? Quite realistic IMO. \"Parasite turns ants into tasty looking berries - January 17, 2008\" Found this browsing...amazing.", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 10:34:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: sorry cracker.... but the spider turned out to be a harmless critter.... wrong idenity made. But still would be an eye opener to find it when buying banana's or worse yet to reach down to choose which bunch you wanted and see this thing on your hand..... What was the spider they know for sure?", 
        "intTime": 20090321, 
        "postID": 10, 
        "quote": "Originally posted by m551sheridan: sorry cracker.... but the spider turned out to be a harmless critter.... wrong idenity made. But still would be an eye opener to find it when buying banana's or worse yet to reach down to choose which bunch you wanted and see this thing on your hand.....", 
        "reply": " What was the spider they know for sure?", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 10:41:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "On the Big Island of Hawaii, in the sourthern region lurks one of this bad boys cousins. He looks the same minus the hair, instead he has a aerodescent exoskeleton that reflects the colors around himself. I never knew what a bad azz he was until one day when the new issue of National Geographic came in the mail. There on the front cover was our lil Big Island monster. \"The worlds most ferocious spider\" read the title. I have had run ins with this quarter sized spider before and knew he was a feerless lil guy but did not know he was listed as the worlds most ferocious. With eyes much like our guy shown in the photo above and a independent moving head on a neck much like that of a humans he is very intriguing. He is also the Navy Seal of spiders, only the size of a quarter with a bite that measures 1/2 an inch, the ability to leap about six inches and a attitude, he lays no web and hunts for his prey, he will stalk anything, even humans. I have played with him on several occasions using a pencil to prod him. He is very smart and recognises that the pencil is merely a tool, his interest was not in the pencil but in me, he tried in vain to bite me over and over ignoring the pencil. Eventually I tired of playing with him and he met Mr. Nike, but of all the spiders I have ever seen, this guy takes the cake. He is without a doubt the most beautiful, ferocious and cunning of all. If you ever visit the Big Island of Hawaii beware of this spider while in the southern region. I lived on the Big Island for about four years and only saw him in that area. I have never seen him anywhere else in our State and even though I live on Kauai, I am always aware of this lil bad boy out there lurking somewhere, I know he fears nothing and is heavily armed.", 
        "intTime": 20090321, 
        "postID": 11, 
        "quote": "", 
        "reply": "On the Big Island of Hawaii, in the sourthern region lurks one of this bad boys cousins. He looks the same minus the hair, instead he has a aerodescent exoskeleton that reflects the colors around himself. I never knew what a bad azz he was until one day when the new issue of National Geographic came in the mail. There on the front cover was our lil Big Island monster. \"The worlds most ferocious spider\" read the title. I have had run ins with this quarter sized spider before and knew he was a feerless lil guy but did not know he was listed as the worlds most ferocious. With eyes much like our guy shown in the photo above and a independent moving head on a neck much like that of a humans he is very intriguing. He is also the Navy Seal of spiders, only the size of a quarter with a bite that measures 1/2 an inch, the ability to leap about six inches and a attitude, he lays no web and hunts for his prey, he will stalk anything, even humans. I have played with him on several occasions using a pencil to prod him. He is very smart and recognises that the pencil is merely a tool, his interest was not in the pencil but in me, he tried in vain to bite me over and over ignoring the pencil. Eventually I tired of playing with him and he met Mr. Nike, but of all the spiders I have ever seen, this guy takes the cake. He is without a doubt the most beautiful, ferocious and cunning of all. If you ever visit the Big Island of Hawaii beware of this spider while in the southern region. I lived on the Big Island for about four years and only saw him in that area. I have never seen him anywhere else in our State and even though I live on Kauai, I am always aware of this lil bad boy out there lurking somewhere, I know he fears nothing and is heavily armed.", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 11:03:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by m551sheridan: sorry cracker.... but the spider turned out to be a harmless critter.... wrong idenity made. But still would be an eye opener to find it when buying banana's or worse yet to reach down to choose which bunch you wanted and see this thing on your hand..... What was the spider they know for sure? I forget the name... they had a guy on FOX last night and I think he said it was a banana spider.. big, but harmless... but he did say the original claim was false and the spider was wrongly identified. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090321, 
        "postID": 12, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by m551sheridan: sorry cracker.... but the spider turned out to be a harmless critter.... wrong idenity made. But still would be an eye opener to find it when buying banana's or worse yet to reach down to choose which bunch you wanted and see this thing on your hand..... What was the spider they know for sure?", 
        "reply": " I forget the name... they had a guy on FOX last night and I think he said it was a banana spider.. big, but harmless... but he did say the original claim was false and the spider was wrongly identified. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 11:16:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: On the Big Island of Hawaii, in the sourthern region lurks one of this bad boys cousins. He looks the same minus the hair, instead he has a aerodescent exoskeleton that reflects the colors around himself. I never knew what a bad azz he was until one day when the new issue of National Geographic came in the mail. There on the front cover was our lil Big Island monster. \"The worlds most ferocious spider\" read the title. I have had run ins with this quarter sized spider before and knew he was a feerless lil guy but did not know he was listed as the worlds most ferocious. With eyes much like our guy shown in the photo above and a independent moving head on a neck much like that of a humans he is very intriguing. He is also the Navy Seal of spiders, only the size of a quarter with a bite that measures 1/2 an inch, the ability to leap about six inches and a attitude, he lays no web and hunts for his prey, he will stalk anything, even humans. I have played with him on several occasions using a pencil to prod him. He is very smart and recognises that the pencil is merely a tool, his interest was not in the pencil but in me, he tried in vain to bite me over and over ignoring the pencil. Eventually I tired of playing with him and he met Mr. Nike, but of all the spiders I have ever seen, this guy takes the cake. He is without a doubt the most beautiful, ferocious and cunning of all. If you ever visit the Big Island of Hawaii beware of this spider while in the southern region. I lived on the Big Island for about four years and only saw him in that area. I have never seen him anywhere else in our State and even though I live on Kauai, I am always aware of this lil bad boy out there lurking somewhere, I know he fears nothing and is heavily armed. I actually appreciate Spiders. Here is New York we have a little harmless taratualla called the American Wolf spider. They're not poisonious to us, and cannot even break the skin. In fact they don't want to bite. We're not food and they know it. But I convinced my land lord to stop using the exterminator with his sprays, and I released a female with her egg case in the building. Once the \"kids\" hatched, within a few weeks, all, and I mean ALL the roaches were gone. I rarely even see one now, but they're around - but there are no roaches around. Dave", 
        "intTime": 20090321, 
        "postID": 13, 
        "quote": "Originally posted by BAGodbehere: On the Big Island of Hawaii, in the sourthern region lurks one of this bad boys cousins. He looks the same minus the hair, instead he has a aerodescent exoskeleton that reflects the colors around himself. I never knew what a bad azz he was until one day when the new issue of National Geographic came in the mail. There on the front cover was our lil Big Island monster. \"The worlds most ferocious spider\" read the title. I have had run ins with this quarter sized spider before and knew he was a feerless lil guy but did not know he was listed as the worlds most ferocious. With eyes much like our guy shown in the photo above and a independent moving head on a neck much like that of a humans he is very intriguing. He is also the Navy Seal of spiders, only the size of a quarter with a bite that measures 1/2 an inch, the ability to leap about six inches and a attitude, he lays no web and hunts for his prey, he will stalk anything, even humans. I have played with him on several occasions using a pencil to prod him. He is very smart and recognises that the pencil is merely a tool, his interest was not in the pencil but in me, he tried in vain to bite me over and over ignoring the pencil. Eventually I tired of playing with him and he met Mr. Nike, but of all the spiders I have ever seen, this guy takes the cake. He is without a doubt the most beautiful, ferocious and cunning of all. If you ever visit the Big Island of Hawaii beware of this spider while in the southern region. I lived on the Big Island for about four years and only saw him in that area. I have never seen him anywhere else in our State and even though I live on Kauai, I am always aware of this lil bad boy out there lurking somewhere, I know he fears nothing and is heavily armed.", 
        "reply": " I actually appreciate Spiders. Here is New York we have a little harmless taratualla called the American Wolf spider. They're not poisonious to us, and cannot even break the skin. In fact they don't want to bite. We're not food and they know it. But I convinced my land lord to stop using the exterminator with his sprays, and I released a female with her egg case in the building. Once the \"kids\" hatched, within a few weeks, all, and I mean ALL the roaches were gone. I rarely even see one now, but they're around - but there are no roaches around. Dave", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 11:29:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: I actually appreciate Spiders. Here is New York we have a little harmless taratualla called the American Wolf spider. They're not poisonious to us, and cannot even break the skin. In fact they don't want to bite. We're not food and they know it. But I convinced my land lord to stop using the exterminator with his sprays, and I released a female with her egg case in the building. Once the \"kids\" hatched, within a few weeks, all, and I mean ALL the roaches were gone. I rarely even see one now, but they're around - but there are no roaches around. Dave Dave we have those also, I don't kill them and let them roam in the house. Like you say, they are harmless and I have never heard of someone being bit by one. They are hunters also so they are pretty clean lil guys. They freak out my duaghter becuase of their size and look but I am slowly getting her used to the idea that they are good to have around. Here in the tropics it is impossible to be bug free and these Wolf spiders( alot of people here call them Cane siders) are a big help in ridding the house of the truly undesirable pest.", 
        "intTime": 20090321, 
        "postID": 14, 
        "quote": "I actually appreciate Spiders. Here is New York we have a little harmless taratualla called the American Wolf spider. They're not poisonious to us, and cannot even break the skin. In fact they don't want to bite. We're not food and they know it. But I convinced my land lord to stop using the exterminator with his sprays, and I released a female with her egg case in the building. Once the \"kids\" hatched, within a few weeks, all, and I mean ALL the roaches were gone. I rarely even see one now, but they're around - but there are no roaches around. Dave", 
        "reply": " Dave we have those also, I don't kill them and let them roam in the house. Like you say, they are harmless and I have never heard of someone being bit by one. They are hunters also so they are pretty clean lil guys. They freak out my duaghter becuase of their size and look but I am slowly getting her used to the idea that they are good to have around. Here in the tropics it is impossible to be bug free and these Wolf spiders( alot of people here call them Cane siders) are a big help in ridding the house of the truly undesirable pest.", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 11:48:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: quote: I actually appreciate Spiders. Here is New York we have a little harmless taratualla called the American Wolf spider. They're not poisonious to us, and cannot even break the skin. In fact they don't want to bite. We're not food and they know it. But I convinced my land lord to stop using the exterminator with his sprays, and I released a female with her egg case in the building. Once the \"kids\" hatched, within a few weeks, all, and I mean ALL the roaches were gone. I rarely even see one now, but they're around - but there are no roaches around. Dave Dave we have those also, I don't kill them and let them roam in the house. Like you say, they are harmless and I have never heard of someone being bit by one. They are hunters also so they are pretty clean lil guys. They freak out my duaghter becuase of their size and look but I am slowly getting her used to the idea that they are good to have around. Here in the tropics it is impossible to be bug free and these Wolf spiders( alot of people here call them Cane siders) are a big help in ridding the house of the truly undesirable pest. He, heh, I think I live in the only raoch free building in the Lower East Side... When I tell my neighbors, they all freak out. The poor Wolf spiders have no doubt spread to the other buildings, but are immediately killed by all the bug sprays - sprays that the roaches not only have a built in immunity to, but regards as a decent desert. Sorry BAGodbehere, I also have a problem with deadly spiders running around the house... Didn't mean to sound critical. My bad... Dave", 
        "intTime": 20090321, 
        "postID": 15, 
        "quote": "Originally posted by BAGodbehere: quote: I actually appreciate Spiders. Here is New York we have a little harmless taratualla called the American Wolf spider. They're not poisonious to us, and cannot even break the skin. In fact they don't want to bite. We're not food and they know it. But I convinced my land lord to stop using the exterminator with his sprays, and I released a female with her egg case in the building. Once the \"kids\" hatched, within a few weeks, all, and I mean ALL the roaches were gone. I rarely even see one now, but they're around - but there are no roaches around. Dave Dave we have those also, I don't kill them and let them roam in the house. Like you say, they are harmless and I have never heard of someone being bit by one. They are hunters also so they are pretty clean lil guys. They freak out my duaghter becuase of their size and look but I am slowly getting her used to the idea that they are good to have around. Here in the tropics it is impossible to be bug free and these Wolf spiders( alot of people here call them Cane siders) are a big help in ridding the house of the truly undesirable pest.", 
        "reply": " He, heh, I think I live in the only raoch free building in the Lower East Side... When I tell my neighbors, they all freak out. The poor Wolf spiders have no doubt spread to the other buildings, but are immediately killed by all the bug sprays - sprays that the roaches not only have a built in immunity to, but regards as a decent desert. Sorry BAGodbehere, I also have a problem with deadly spiders running around the house... Didn't mean to sound critical. My bad... Dave", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 12:32:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "Grachus"
    }, 
    {
        "content": "Thats not the worlds deadliest spider....Some ******* in Australia holds that title.... The aforementioned spider doesn't even have its fangs exposed....the Australian funnel web has 1 inch fangs that will go through boots.", 
        "intTime": 20090321, 
        "postID": 16, 
        "quote": "", 
        "reply": "Thats not the worlds deadliest spider....Some ******* in Australia holds that title.... The aforementioned spider doesn't even have its fangs exposed....the Australian funnel web has 1 inch fangs that will go through boots.", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 13:52:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "We have one spider here, about the size of a quarter that will chase you. Its bite is poisonous but not deadly. Its called a \"Hobo\" spider, and its not a native U.S. species. We also have black widows, brown recluses, and a few others. When fall comes around I set out sticky traps made just for spiders, in every corner, nook, and cranny in the house. Then come spring when it warms up and they go back outside. I wear leather gloves to pick up and toss the traps. DANG! I hate spiders!!", 
        "intTime": 20090321, 
        "postID": 17, 
        "quote": "", 
        "reply": "We have one spider here, about the size of a quarter that will chase you. Its bite is poisonous but not deadly. Its called a \"Hobo\" spider, and its not a native U.S. species. We also have black widows, brown recluses, and a few others. When fall comes around I set out sticky traps made just for spiders, in every corner, nook, and cranny in the house. Then come spring when it warms up and they go back outside. I wear leather gloves to pick up and toss the traps. DANG! I hate spiders!!", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 14:36:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Didn't mean to sound critical. My bad... Dave Dave, none taken brother all good, I like the wolf spiders, they can co-exist in my house all they want and while they're indoors they are working away helping me while they help themselves, and no droppings either, it's a win/win.", 
        "intTime": 20090321, 
        "postID": 18, 
        "quote": "Didn't mean to sound critical. My bad... Dave", 
        "reply": " Dave, none taken brother all good, I like the wolf spiders, they can co-exist in my house all they want and while they're indoors they are working away helping me while they help themselves, and no droppings either, it's a win/win.", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 16:37:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: We have one spider here, about the size of a quarter that will chase you. Its bite is poisonous but not deadly. Its called a \"Hobo\" spider, and its not a native U.S. species. We also have black widows, brown recluses, and a few others. When fall comes around I set out sticky traps made just for spiders, in every corner, nook, and cranny in the house. Then come spring when it warms up and they go back outside. I wear leather gloves to pick up and toss the traps. DANG! I hate spiders!! You think thats bad? I have a large tree in front of my home that is CRAWLING with spiders during spring and summer....guess what they like to do? They \"rappel\" down from the trees and just hang there waiting for their prey, or my face as I accidentally walk into them at night...lol", 
        "intTime": 20090321, 
        "postID": 19, 
        "quote": "Originally posted by fishnfanatic: We have one spider here, about the size of a quarter that will chase you. Its bite is poisonous but not deadly. Its called a \"Hobo\" spider, and its not a native U.S. species. We also have black widows, brown recluses, and a few others. When fall comes around I set out sticky traps made just for spiders, in every corner, nook, and cranny in the house. Then come spring when it warms up and they go back outside. I wear leather gloves to pick up and toss the traps. DANG! I hate spiders!!", 
        "reply": " You think thats bad? I have a large tree in front of my home that is CRAWLING with spiders during spring and summer....guess what they like to do? They \"rappel\" down from the trees and just hang there waiting for their prey, or my face as I accidentally walk into them at night...lol", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 16:49:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Iam lucky i got thousands of lizards who feast on the roaches and bugs. so I don't got a major bug problem. and i got a few wasp nest that hunt spiders. BTW I don't suggest any of you start placing pest eaters if you don't know what they will do in the long run. There a island some place near bora bora I think who had a major rat problem so they brought in a bunch of cat's in. The rat's were soon gone but the cat's were soon producing more then the island can handle so they brought in a prison frog and soon the cat's where all gone now but that little group of frogs now number in the thousands.", 
        "intTime": 20090321, 
        "postID": 20, 
        "quote": "", 
        "reply": "Iam lucky i got thousands of lizards who feast on the roaches and bugs. so I don't got a major bug problem. and i got a few wasp nest that hunt spiders. BTW I don't suggest any of you start placing pest eaters if you don't know what they will do in the long run. There a island some place near bora bora I think who had a major rat problem so they brought in a bunch of cat's in. The rat's were soon gone but the cat's were soon producing more then the island can handle so they brought in a prison frog and soon the cat's where all gone now but that little group of frogs now number in the thousands.", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 23:41:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "world_king377"
    }, 
    {
        "content": "Man this thing is one mean critter. \"bite will kill a person in about 25 minutes\" Seems like This thing kinda looks like a certain Taranchula which many have for pets. Just a matter of time before.... Brazilian Wandering Spider \"http://www.foxnews.com/story/0,2933,509876,00.html\"", 
        "intTime": 20090321, 
        "postID": 21, 
        "quote": "", 
        "reply": "Man this thing is one mean critter. \"bite will kill a person in about 25 minutes\" Seems like This thing kinda looks like a certain Taranchula which many have for pets. Just a matter of time before.... Brazilian Wandering Spider \"http://www.foxnews.com/story/0,2933,509876,00.html\"", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 07:27:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: http://www.foxnews.com/story/0,2933,509876,00.html That cooks it for the Viagra brigade! Now they be wondering if their 'woodies' aren't from a spider bite they got while picking up shopping MILFs and beer at the Piggly Wiggly. Talk about the 'Kiss of the Spider woman'!", 
        "intTime": 20090321, 
        "postID": 22, 
        "quote": "http://www.foxnews.com/story/0,2933,509876,00.html", 
        "reply": " That cooks it for the Viagra brigade! Now they be wondering if their 'woodies' aren't from a spider bite they got while picking up shopping MILFs and beer at the Piggly Wiggly. Talk about the 'Kiss of the Spider woman'!", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 08:45:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "popsiq"
    }, 
    {
        "content": "We use to crawl around the woods of Key Largo looking for smugglers. I saw a few Black Widows. Actually it was the Brown Recluse that freaked me out the most. Don", 
        "intTime": 20090321, 
        "postID": 23, 
        "quote": "", 
        "reply": "We use to crawl around the woods of Key Largo looking for smugglers. I saw a few Black Widows. Actually it was the Brown Recluse that freaked me out the most. Don", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 09:47:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "sorry cracker.... but the spider turned out to be a harmless critter.... wrong idenity made. But still would be an eye opener to find it when buying banana's or worse yet to reach down to choose which bunch you wanted and see this thing on your hand..... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090321, 
        "postID": 24, 
        "quote": "", 
        "reply": "sorry cracker.... but the spider turned out to be a harmless critter.... wrong idenity made. But still would be an eye opener to find it when buying banana's or worse yet to reach down to choose which bunch you wanted and see this thing on your hand..... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 09:58:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by popsiq: quote: http://www.foxnews.com/story/0,2933,509876,00.html That cooks it for the Viagra brigade! Now they be wondering if their 'woodies' aren't from a spider bite they got while picking up shopping MILFs and beer at the Piggly Wiggly. Talk about the 'Kiss of the Spider woman'! He, heh, according to the Wiki article on this spider, their venom IS being investigated as a cure for impotence... Dave", 
        "intTime": 20090321, 
        "postID": 25, 
        "quote": "Originally posted by popsiq: quote: http://www.foxnews.com/story/0,2933,509876,00.html That cooks it for the Viagra brigade! Now they be wondering if their 'woodies' aren't from a spider bite they got while picking up shopping MILFs and beer at the Piggly Wiggly. Talk about the 'Kiss of the Spider woman'!", 
        "reply": " He, heh, according to the Wiki article on this spider, their venom IS being investigated as a cure for impotence... Dave", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 10:00:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: We use to crawl around the woods of Key Largo looking for smugglers. I saw a few Black Widows. Actually it was the Brown Recluse that freaked me out the most. Don As well it should. The brown recluse's venom is far more dangerous than the black widow's is. Widow venom is painful, but it doesn't do massive tissue damage, (as the brown recluse's does). They're really only dangerous to kids and the elderly. Widows can be found everywhere here in the west. They're not that big a deal, their webs are easy to identify and thus they're easy to find and exterminate. Recluses are worse. They don't stay in a web, they hide, and they wander at night. Their venom can cause ya to potentially lose a digit or part of a limb, as it's a necrotoxin.", 
        "intTime": 20090321, 
        "postID": 26, 
        "quote": "Originally posted by 21yrsUSCGUSCS: We use to crawl around the woods of Key Largo looking for smugglers. I saw a few Black Widows. Actually it was the Brown Recluse that freaked me out the most. Don", 
        "reply": " As well it should. The brown recluse's venom is far more dangerous than the black widow's is. Widow venom is painful, but it doesn't do massive tissue damage, (as the brown recluse's does). They're really only dangerous to kids and the elderly. Widows can be found everywhere here in the west. They're not that big a deal, their webs are easy to identify and thus they're easy to find and exterminate. Recluses are worse. They don't stay in a web, they hide, and they wander at night. Their venom can cause ya to potentially lose a digit or part of a limb, as it's a necrotoxin.", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 10:17:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Man this thing is one mean critter. \"bite will kill a person in about 25 minutes\" Seems like This thing kinda looks like a certain Taranchula which many have for pets. Just a matter of time before.... Brazilian Wandering Spider \"http://www.foxnews.com/story/0,2933,509876,00.html\" Probably road in on a hairy legg hippie broad!", 
        "intTime": 20090321, 
        "postID": 27, 
        "quote": "Originally posted by crackerjacks61: Man this thing is one mean critter. \"bite will kill a person in about 25 minutes\" Seems like This thing kinda looks like a certain Taranchula which many have for pets. Just a matter of time before.... Brazilian Wandering Spider \"http://www.foxnews.com/story/0,2933,509876,00.html\"", 
        "reply": " Probably road in on a hairy legg hippie broad!", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 10:19:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: We use to crawl around the woods of Key Largo looking for smugglers. I saw a few Black Widows. Actually it was the Brown Recluse that freaked me out the most. Don BWs are nothing compared to the Brown...", 
        "intTime": 20090321, 
        "postID": 28, 
        "quote": "Originally posted by 21yrsUSCGUSCS: We use to crawl around the woods of Key Largo looking for smugglers. I saw a few Black Widows. Actually it was the Brown Recluse that freaked me out the most. Don", 
        "reply": " BWs are nothing compared to the Brown...", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 10:28:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by popsiq: quote: http://www.foxnews.com/story/0,2933,509876,00.html That cooks it for the Viagra brigade! Now they be wondering if their 'woodies' aren't from a spider bite they got while picking up shopping MILFs and beer at the Piggly Wiggly. Talk about the 'Kiss of the Spider woman'! He, heh, according to the Wiki article on this spider, their venom IS being investigated as a cure for impotence... Dave I wouldn't laugh, lord knows what nature has that could cure all kinds of stuff. Ever seen that movie \"Medicine Man\" with Sean Connery? Quite realistic IMO. \"Parasite turns ants into tasty looking berries - January 17, 2008\" Found this browsing...amazing.", 
        "intTime": 20090321, 
        "postID": 29, 
        "quote": "Originally posted by Grachus: quote: Originally posted by popsiq: quote: http://www.foxnews.com/story/0,2933,509876,00.html That cooks it for the Viagra brigade! Now they be wondering if their 'woodies' aren't from a spider bite they got while picking up shopping MILFs and beer at the Piggly Wiggly. Talk about the 'Kiss of the Spider woman'! He, heh, according to the Wiki article on this spider, their venom IS being investigated as a cure for impotence... Dave", 
        "reply": " I wouldn't laugh, lord knows what nature has that could cure all kinds of stuff. Ever seen that movie \"Medicine Man\" with Sean Connery? Quite realistic IMO. \"Parasite turns ants into tasty looking berries - January 17, 2008\" Found this browsing...amazing.", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 10:34:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: sorry cracker.... but the spider turned out to be a harmless critter.... wrong idenity made. But still would be an eye opener to find it when buying banana's or worse yet to reach down to choose which bunch you wanted and see this thing on your hand..... What was the spider they know for sure?", 
        "intTime": 20090321, 
        "postID": 30, 
        "quote": "Originally posted by m551sheridan: sorry cracker.... but the spider turned out to be a harmless critter.... wrong idenity made. But still would be an eye opener to find it when buying banana's or worse yet to reach down to choose which bunch you wanted and see this thing on your hand.....", 
        "reply": " What was the spider they know for sure?", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 10:41:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "On the Big Island of Hawaii, in the sourthern region lurks one of this bad boys cousins. He looks the same minus the hair, instead he has a aerodescent exoskeleton that reflects the colors around himself. I never knew what a bad azz he was until one day when the new issue of National Geographic came in the mail. There on the front cover was our lil Big Island monster. \"The worlds most ferocious spider\" read the title. I have had run ins with this quarter sized spider before and knew he was a feerless lil guy but did not know he was listed as the worlds most ferocious. With eyes much like our guy shown in the photo above and a independent moving head on a neck much like that of a humans he is very intriguing. He is also the Navy Seal of spiders, only the size of a quarter with a bite that measures 1/2 an inch, the ability to leap about six inches and a attitude, he lays no web and hunts for his prey, he will stalk anything, even humans. I have played with him on several occasions using a pencil to prod him. He is very smart and recognises that the pencil is merely a tool, his interest was not in the pencil but in me, he tried in vain to bite me over and over ignoring the pencil. Eventually I tired of playing with him and he met Mr. Nike, but of all the spiders I have ever seen, this guy takes the cake. He is without a doubt the most beautiful, ferocious and cunning of all. If you ever visit the Big Island of Hawaii beware of this spider while in the southern region. I lived on the Big Island for about four years and only saw him in that area. I have never seen him anywhere else in our State and even though I live on Kauai, I am always aware of this lil bad boy out there lurking somewhere, I know he fears nothing and is heavily armed.", 
        "intTime": 20090321, 
        "postID": 31, 
        "quote": "", 
        "reply": "On the Big Island of Hawaii, in the sourthern region lurks one of this bad boys cousins. He looks the same minus the hair, instead he has a aerodescent exoskeleton that reflects the colors around himself. I never knew what a bad azz he was until one day when the new issue of National Geographic came in the mail. There on the front cover was our lil Big Island monster. \"The worlds most ferocious spider\" read the title. I have had run ins with this quarter sized spider before and knew he was a feerless lil guy but did not know he was listed as the worlds most ferocious. With eyes much like our guy shown in the photo above and a independent moving head on a neck much like that of a humans he is very intriguing. He is also the Navy Seal of spiders, only the size of a quarter with a bite that measures 1/2 an inch, the ability to leap about six inches and a attitude, he lays no web and hunts for his prey, he will stalk anything, even humans. I have played with him on several occasions using a pencil to prod him. He is very smart and recognises that the pencil is merely a tool, his interest was not in the pencil but in me, he tried in vain to bite me over and over ignoring the pencil. Eventually I tired of playing with him and he met Mr. Nike, but of all the spiders I have ever seen, this guy takes the cake. He is without a doubt the most beautiful, ferocious and cunning of all. If you ever visit the Big Island of Hawaii beware of this spider while in the southern region. I lived on the Big Island for about four years and only saw him in that area. I have never seen him anywhere else in our State and even though I live on Kauai, I am always aware of this lil bad boy out there lurking somewhere, I know he fears nothing and is heavily armed.", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 11:03:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by m551sheridan: sorry cracker.... but the spider turned out to be a harmless critter.... wrong idenity made. But still would be an eye opener to find it when buying banana's or worse yet to reach down to choose which bunch you wanted and see this thing on your hand..... What was the spider they know for sure? I forget the name... they had a guy on FOX last night and I think he said it was a banana spider.. big, but harmless... but he did say the original claim was false and the spider was wrongly identified. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090321, 
        "postID": 32, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by m551sheridan: sorry cracker.... but the spider turned out to be a harmless critter.... wrong idenity made. But still would be an eye opener to find it when buying banana's or worse yet to reach down to choose which bunch you wanted and see this thing on your hand..... What was the spider they know for sure?", 
        "reply": " I forget the name... they had a guy on FOX last night and I think he said it was a banana spider.. big, but harmless... but he did say the original claim was false and the spider was wrongly identified. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 11:16:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: On the Big Island of Hawaii, in the sourthern region lurks one of this bad boys cousins. He looks the same minus the hair, instead he has a aerodescent exoskeleton that reflects the colors around himself. I never knew what a bad azz he was until one day when the new issue of National Geographic came in the mail. There on the front cover was our lil Big Island monster. \"The worlds most ferocious spider\" read the title. I have had run ins with this quarter sized spider before and knew he was a feerless lil guy but did not know he was listed as the worlds most ferocious. With eyes much like our guy shown in the photo above and a independent moving head on a neck much like that of a humans he is very intriguing. He is also the Navy Seal of spiders, only the size of a quarter with a bite that measures 1/2 an inch, the ability to leap about six inches and a attitude, he lays no web and hunts for his prey, he will stalk anything, even humans. I have played with him on several occasions using a pencil to prod him. He is very smart and recognises that the pencil is merely a tool, his interest was not in the pencil but in me, he tried in vain to bite me over and over ignoring the pencil. Eventually I tired of playing with him and he met Mr. Nike, but of all the spiders I have ever seen, this guy takes the cake. He is without a doubt the most beautiful, ferocious and cunning of all. If you ever visit the Big Island of Hawaii beware of this spider while in the southern region. I lived on the Big Island for about four years and only saw him in that area. I have never seen him anywhere else in our State and even though I live on Kauai, I am always aware of this lil bad boy out there lurking somewhere, I know he fears nothing and is heavily armed. I actually appreciate Spiders. Here is New York we have a little harmless taratualla called the American Wolf spider. They're not poisonious to us, and cannot even break the skin. In fact they don't want to bite. We're not food and they know it. But I convinced my land lord to stop using the exterminator with his sprays, and I released a female with her egg case in the building. Once the \"kids\" hatched, within a few weeks, all, and I mean ALL the roaches were gone. I rarely even see one now, but they're around - but there are no roaches around. Dave", 
        "intTime": 20090321, 
        "postID": 33, 
        "quote": "Originally posted by BAGodbehere: On the Big Island of Hawaii, in the sourthern region lurks one of this bad boys cousins. He looks the same minus the hair, instead he has a aerodescent exoskeleton that reflects the colors around himself. I never knew what a bad azz he was until one day when the new issue of National Geographic came in the mail. There on the front cover was our lil Big Island monster. \"The worlds most ferocious spider\" read the title. I have had run ins with this quarter sized spider before and knew he was a feerless lil guy but did not know he was listed as the worlds most ferocious. With eyes much like our guy shown in the photo above and a independent moving head on a neck much like that of a humans he is very intriguing. He is also the Navy Seal of spiders, only the size of a quarter with a bite that measures 1/2 an inch, the ability to leap about six inches and a attitude, he lays no web and hunts for his prey, he will stalk anything, even humans. I have played with him on several occasions using a pencil to prod him. He is very smart and recognises that the pencil is merely a tool, his interest was not in the pencil but in me, he tried in vain to bite me over and over ignoring the pencil. Eventually I tired of playing with him and he met Mr. Nike, but of all the spiders I have ever seen, this guy takes the cake. He is without a doubt the most beautiful, ferocious and cunning of all. If you ever visit the Big Island of Hawaii beware of this spider while in the southern region. I lived on the Big Island for about four years and only saw him in that area. I have never seen him anywhere else in our State and even though I live on Kauai, I am always aware of this lil bad boy out there lurking somewhere, I know he fears nothing and is heavily armed.", 
        "reply": " I actually appreciate Spiders. Here is New York we have a little harmless taratualla called the American Wolf spider. They're not poisonious to us, and cannot even break the skin. In fact they don't want to bite. We're not food and they know it. But I convinced my land lord to stop using the exterminator with his sprays, and I released a female with her egg case in the building. Once the \"kids\" hatched, within a few weeks, all, and I mean ALL the roaches were gone. I rarely even see one now, but they're around - but there are no roaches around. Dave", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 11:29:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: I actually appreciate Spiders. Here is New York we have a little harmless taratualla called the American Wolf spider. They're not poisonious to us, and cannot even break the skin. In fact they don't want to bite. We're not food and they know it. But I convinced my land lord to stop using the exterminator with his sprays, and I released a female with her egg case in the building. Once the \"kids\" hatched, within a few weeks, all, and I mean ALL the roaches were gone. I rarely even see one now, but they're around - but there are no roaches around. Dave Dave we have those also, I don't kill them and let them roam in the house. Like you say, they are harmless and I have never heard of someone being bit by one. They are hunters also so they are pretty clean lil guys. They freak out my duaghter becuase of their size and look but I am slowly getting her used to the idea that they are good to have around. Here in the tropics it is impossible to be bug free and these Wolf spiders( alot of people here call them Cane siders) are a big help in ridding the house of the truly undesirable pest.", 
        "intTime": 20090321, 
        "postID": 34, 
        "quote": "I actually appreciate Spiders. Here is New York we have a little harmless taratualla called the American Wolf spider. They're not poisonious to us, and cannot even break the skin. In fact they don't want to bite. We're not food and they know it. But I convinced my land lord to stop using the exterminator with his sprays, and I released a female with her egg case in the building. Once the \"kids\" hatched, within a few weeks, all, and I mean ALL the roaches were gone. I rarely even see one now, but they're around - but there are no roaches around. Dave", 
        "reply": " Dave we have those also, I don't kill them and let them roam in the house. Like you say, they are harmless and I have never heard of someone being bit by one. They are hunters also so they are pretty clean lil guys. They freak out my duaghter becuase of their size and look but I am slowly getting her used to the idea that they are good to have around. Here in the tropics it is impossible to be bug free and these Wolf spiders( alot of people here call them Cane siders) are a big help in ridding the house of the truly undesirable pest.", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 11:48:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: quote: I actually appreciate Spiders. Here is New York we have a little harmless taratualla called the American Wolf spider. They're not poisonious to us, and cannot even break the skin. In fact they don't want to bite. We're not food and they know it. But I convinced my land lord to stop using the exterminator with his sprays, and I released a female with her egg case in the building. Once the \"kids\" hatched, within a few weeks, all, and I mean ALL the roaches were gone. I rarely even see one now, but they're around - but there are no roaches around. Dave Dave we have those also, I don't kill them and let them roam in the house. Like you say, they are harmless and I have never heard of someone being bit by one. They are hunters also so they are pretty clean lil guys. They freak out my duaghter becuase of their size and look but I am slowly getting her used to the idea that they are good to have around. Here in the tropics it is impossible to be bug free and these Wolf spiders( alot of people here call them Cane siders) are a big help in ridding the house of the truly undesirable pest. He, heh, I think I live in the only raoch free building in the Lower East Side... When I tell my neighbors, they all freak out. The poor Wolf spiders have no doubt spread to the other buildings, but are immediately killed by all the bug sprays - sprays that the roaches not only have a built in immunity to, but regards as a decent desert. Sorry BAGodbehere, I also have a problem with deadly spiders running around the house... Didn't mean to sound critical. My bad... Dave", 
        "intTime": 20090321, 
        "postID": 35, 
        "quote": "Originally posted by BAGodbehere: quote: I actually appreciate Spiders. Here is New York we have a little harmless taratualla called the American Wolf spider. They're not poisonious to us, and cannot even break the skin. In fact they don't want to bite. We're not food and they know it. But I convinced my land lord to stop using the exterminator with his sprays, and I released a female with her egg case in the building. Once the \"kids\" hatched, within a few weeks, all, and I mean ALL the roaches were gone. I rarely even see one now, but they're around - but there are no roaches around. Dave Dave we have those also, I don't kill them and let them roam in the house. Like you say, they are harmless and I have never heard of someone being bit by one. They are hunters also so they are pretty clean lil guys. They freak out my duaghter becuase of their size and look but I am slowly getting her used to the idea that they are good to have around. Here in the tropics it is impossible to be bug free and these Wolf spiders( alot of people here call them Cane siders) are a big help in ridding the house of the truly undesirable pest.", 
        "reply": " He, heh, I think I live in the only raoch free building in the Lower East Side... When I tell my neighbors, they all freak out. The poor Wolf spiders have no doubt spread to the other buildings, but are immediately killed by all the bug sprays - sprays that the roaches not only have a built in immunity to, but regards as a decent desert. Sorry BAGodbehere, I also have a problem with deadly spiders running around the house... Didn't mean to sound critical. My bad... Dave", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 12:32:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "Grachus"
    }, 
    {
        "content": "Thats not the worlds deadliest spider....Some ******* in Australia holds that title.... The aforementioned spider doesn't even have its fangs exposed....the Australian funnel web has 1 inch fangs that will go through boots.", 
        "intTime": 20090321, 
        "postID": 36, 
        "quote": "", 
        "reply": "Thats not the worlds deadliest spider....Some ******* in Australia holds that title.... The aforementioned spider doesn't even have its fangs exposed....the Australian funnel web has 1 inch fangs that will go through boots.", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 13:52:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "We have one spider here, about the size of a quarter that will chase you. Its bite is poisonous but not deadly. Its called a \"Hobo\" spider, and its not a native U.S. species. We also have black widows, brown recluses, and a few others. When fall comes around I set out sticky traps made just for spiders, in every corner, nook, and cranny in the house. Then come spring when it warms up and they go back outside. I wear leather gloves to pick up and toss the traps. DANG! I hate spiders!!", 
        "intTime": 20090321, 
        "postID": 37, 
        "quote": "", 
        "reply": "We have one spider here, about the size of a quarter that will chase you. Its bite is poisonous but not deadly. Its called a \"Hobo\" spider, and its not a native U.S. species. We also have black widows, brown recluses, and a few others. When fall comes around I set out sticky traps made just for spiders, in every corner, nook, and cranny in the house. Then come spring when it warms up and they go back outside. I wear leather gloves to pick up and toss the traps. DANG! I hate spiders!!", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 14:36:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Didn't mean to sound critical. My bad... Dave Dave, none taken brother all good, I like the wolf spiders, they can co-exist in my house all they want and while they're indoors they are working away helping me while they help themselves, and no droppings either, it's a win/win.", 
        "intTime": 20090321, 
        "postID": 38, 
        "quote": "Didn't mean to sound critical. My bad... Dave", 
        "reply": " Dave, none taken brother all good, I like the wolf spiders, they can co-exist in my house all they want and while they're indoors they are working away helping me while they help themselves, and no droppings either, it's a win/win.", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 16:37:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: We have one spider here, about the size of a quarter that will chase you. Its bite is poisonous but not deadly. Its called a \"Hobo\" spider, and its not a native U.S. species. We also have black widows, brown recluses, and a few others. When fall comes around I set out sticky traps made just for spiders, in every corner, nook, and cranny in the house. Then come spring when it warms up and they go back outside. I wear leather gloves to pick up and toss the traps. DANG! I hate spiders!! You think thats bad? I have a large tree in front of my home that is CRAWLING with spiders during spring and summer....guess what they like to do? They \"rappel\" down from the trees and just hang there waiting for their prey, or my face as I accidentally walk into them at night...lol", 
        "intTime": 20090321, 
        "postID": 39, 
        "quote": "Originally posted by fishnfanatic: We have one spider here, about the size of a quarter that will chase you. Its bite is poisonous but not deadly. Its called a \"Hobo\" spider, and its not a native U.S. species. We also have black widows, brown recluses, and a few others. When fall comes around I set out sticky traps made just for spiders, in every corner, nook, and cranny in the house. Then come spring when it warms up and they go back outside. I wear leather gloves to pick up and toss the traps. DANG! I hate spiders!!", 
        "reply": " You think thats bad? I have a large tree in front of my home that is CRAWLING with spiders during spring and summer....guess what they like to do? They \"rappel\" down from the trees and just hang there waiting for their prey, or my face as I accidentally walk into them at night...lol", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 16:49:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Iam lucky i got thousands of lizards who feast on the roaches and bugs. so I don't got a major bug problem. and i got a few wasp nest that hunt spiders. BTW I don't suggest any of you start placing pest eaters if you don't know what they will do in the long run. There a island some place near bora bora I think who had a major rat problem so they brought in a bunch of cat's in. The rat's were soon gone but the cat's were soon producing more then the island can handle so they brought in a prison frog and soon the cat's where all gone now but that little group of frogs now number in the thousands.", 
        "intTime": 20090321, 
        "postID": 40, 
        "quote": "", 
        "reply": "Iam lucky i got thousands of lizards who feast on the roaches and bugs. so I don't got a major bug problem. and i got a few wasp nest that hunt spiders. BTW I don't suggest any of you start placing pest eaters if you don't know what they will do in the long run. There a island some place near bora bora I think who had a major rat problem so they brought in a bunch of cat's in. The rat's were soon gone but the cat's were soon producing more then the island can handle so they brought in a prison frog and soon the cat's where all gone now but that little group of frogs now number in the thousands.", 
        "threadID": "672198221_3780084812001", 
        "time": "2009-03-21 23:41:00", 
        "title": "'World's Deadliest Spider' Found in Whole Foods Produce Section", 
        "userID": "world_king377"
    }
]