[
    {
        "content": "In an about-face, the government has disavowed a 12-year-old federal report that found little or no cancer risk for adults who lived at Camp Lejeune, N.C., where drinking water was contaminated for three decades. Up to a million people could have been exposed to toxins that seeped from a neighboring dry cleaner and industrial activity at Lejeune, federal officials say. Now, a report that minimized the cancer threat for adults has been discredited. \"We can no longer stand behind the accuracy of the information in that document,\" William Cibulas, director of health assessment for the Agency for Toxic Substances and Disease Registry, said at a meeting in Atlanta. \"We know too much now.\" Sick veterans, who became known as \"poisoned patriots,\" and their advocates never believed the report's conclusions. Their families have filed claims for $33.8 billion in damages. A study continues on whether fetuses might have been harmed. The agency, charged with protecting public health around toxic sites, said it was rescinding the 1997 assessment on health effects of water that residents of the base drank and bathed in, because of omissions and scientific inaccuracy. That study found the water contamination began in the 1950s and continued until wells were shut down in 1987. The agency offered no new health conclusions but will pull the flawed document from the Internet while incorporating new science to rewrite what Cibulas called \"troublesome\" sections. Jerry Ens*****r, a retired Marine who has spent years digging through military and health documents at Camp Lejeune and believes his daughter Janey's leukemia death at age 9 was due to the water, welcomed the government's reversal on the report. Rest here: http://www.military.com/news/article/us-cant-back-cance...nces-to-marines.html \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090430, 
        "postID": 1, 
        "quote": "", 
        "reply": "In an about-face, the government has disavowed a 12-year-old federal report that found little or no cancer risk for adults who lived at Camp Lejeune, N.C., where drinking water was contaminated for three decades. Up to a million people could have been exposed to toxins that seeped from a neighboring dry cleaner and industrial activity at Lejeune, federal officials say. Now, a report that minimized the cancer threat for adults has been discredited. \"We can no longer stand behind the accuracy of the information in that document,\" William Cibulas, director of health assessment for the Agency for Toxic Substances and Disease Registry, said at a meeting in Atlanta. \"We know too much now.\" Sick veterans, who became known as \"poisoned patriots,\" and their advocates never believed the report's conclusions. Their families have filed claims for $33.8 billion in damages. A study continues on whether fetuses might have been harmed. The agency, charged with protecting public health around toxic sites, said it was rescinding the 1997 assessment on health effects of water that residents of the base drank and bathed in, because of omissions and scientific inaccuracy. That study found the water contamination began in the 1950s and continued until wells were shut down in 1987. The agency offered no new health conclusions but will pull the flawed document from the Internet while incorporating new science to rewrite what Cibulas called \"troublesome\" sections. Jerry Ens*****r, a retired Marine who has spent years digging through military and health documents at Camp Lejeune and believes his daughter Janey's leukemia death at age 9 was due to the water, welcomed the government's reversal on the report. Rest here: http://www.military.com/news/article/us-cant-back-cance...nces-to-marines.html \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5440051222001", 
        "time": "2009-04-30 08:25:00", 
        "title": "US Can't Back Cancer Assurances to Marines", 
        "userID": "Anbar7"
    }, 
    {
        "content": "So who does the blame fall on here? Government or the agency that conducted the report and said all was fine? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090430, 
        "postID": 2, 
        "quote": "", 
        "reply": "So who does the blame fall on here? Government or the agency that conducted the report and said all was fine? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5440051222001", 
        "time": "2009-04-30 09:17:00", 
        "title": "US Can't Back Cancer Assurances to Marines", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: So who does the blame fall on here? Government or the agency that conducted the report and said all was fine? It was the GOVERNMENT (a government agency) that released the report.", 
        "intTime": 20090430, 
        "postID": 3, 
        "quote": "Originally posted by Anbar7: So who does the blame fall on here? Government or the agency that conducted the report and said all was fine?", 
        "reply": " It was the GOVERNMENT (a government agency) that released the report.", 
        "threadID": "672198221_5440051222001", 
        "time": "2009-04-30 09:22:00", 
        "title": "US Can't Back Cancer Assurances to Marines", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Anbar7: So who does the blame fall on here? Government or the agency that conducted the report and said all was fine? It was the GOVERNMENT (a government agency) that released the report. right, but should the agency itself only be at fault or the whole government itself for its lack work on this? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090430, 
        "postID": 4, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Anbar7: So who does the blame fall on here? Government or the agency that conducted the report and said all was fine? It was the GOVERNMENT (a government agency) that released the report.", 
        "reply": " right, but should the agency itself only be at fault or the whole government itself for its lack work on this? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5440051222001", 
        "time": "2009-04-30 10:09:00", 
        "title": "US Can't Back Cancer Assurances to Marines", 
        "userID": "Anbar7"
    }, 
    {
        "content": "I was at CamLej in 1976-77 and 1982-84. Walt", 
        "intTime": 20090430, 
        "postID": 5, 
        "quote": "", 
        "reply": "I was at CamLej in 1976-77 and 1982-84. Walt", 
        "threadID": "672198221_5440051222001", 
        "time": "2009-04-30 10:27:00", 
        "title": "US Can't Back Cancer Assurances to Marines", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by rayld2: quote: Originally posted by Anbar7: So who does the blame fall on here? Government or the agency that conducted the report and said all was fine? It was the GOVERNMENT (a government agency) that released the report. right, but should the agency itself only be at fault or the whole government itself for its lack work on this? Typically agencies get sued for screwups that come under their jurisdictional purview.", 
        "intTime": 20090430, 
        "postID": 6, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by rayld2: quote: Originally posted by Anbar7: So who does the blame fall on here? Government or the agency that conducted the report and said all was fine? It was the GOVERNMENT (a government agency) that released the report. right, but should the agency itself only be at fault or the whole government itself for its lack work on this?", 
        "reply": " Typically agencies get sued for screwups that come under their jurisdictional purview.", 
        "threadID": "672198221_5440051222001", 
        "time": "2009-04-30 10:42:00", 
        "title": "US Can't Back Cancer Assurances to Marines", 
        "userID": "Sand_Flea"
    }
]