[
    {
        "content": "\"http://www.reuters.com/article/domesticNews/idUSTRE53I2GJ20090419\" plans to crack down on deceptive credit-card industry practices that have saddled U.S. consumers with huge debts and soaring interest rates, U.S. officials said on Sunday. Top White House economic adviser Lawrence Summers said Obama would be \"very focused in the very near term on a whole set of issues having to do with credit card abuses.\" \"We need to do things to stop the marketing of credit in ways that addict people to it,\" Summers said in an interview on the NBC television talk show \"Meet the Press.\" Summers, director of the White House National Economic Council, said the administration is concerned about practices that result in consumers being \"deceived into paying extraordinarily high rates that they wouldn't have paid if they knew they were getting themselves into.\" Summers and other officials are scheduled to meet on Thursday at the White House with top executives of credit card companies. The meeting comes as lawmakers in the Democratic-led Congress have vented anger that banks with big credit card operations charging high interest rates and fees are the same institutions getting government bailouts from U.S. taxpayers who use these credit cards. The House of Representatives and Senate are considering a credit card \"bill of rights\" that would limit the ability of credit card companies to raise interest rates on existing balances and require greater disclosure of terms. Federal Reserve Chairman Ben Bernanke has spoken out against complexity in consumer lending practices that is designed to confuse customers and drive up lending fees. quote: The Fed tightened rules on credit-card practices in December, but the proposed legislation would take that further . I havent seen any lowered rates or payments from december", 
        "intTime": 20090419, 
        "postID": 1, 
        "quote": "The Fed tightened rules on credit-card practices in December, but the proposed legislation would take that further", 
        "reply": "\"http://www.reuters.com/article/domesticNews/idUSTRE53I2GJ20090419\" plans to crack down on deceptive credit-card industry practices that have saddled U.S. consumers with huge debts and soaring interest rates, U.S. officials said on Sunday. Top White House economic adviser Lawrence Summers said Obama would be \"very focused in the very near term on a whole set of issues having to do with credit card abuses.\" \"We need to do things to stop the marketing of credit in ways that addict people to it,\" Summers said in an interview on the NBC television talk show \"Meet the Press.\" Summers, director of the White House National Economic Council, said the administration is concerned about practices that result in consumers being \"deceived into paying extraordinarily high rates that they wouldn't have paid if they knew they were getting themselves into.\" Summers and other officials are scheduled to meet on Thursday at the White House with top executives of credit card companies. The meeting comes as lawmakers in the Democratic-led Congress have vented anger that banks with big credit card operations charging high interest rates and fees are the same institutions getting government bailouts from U.S. taxpayers who use these credit cards. The House of Representatives and Senate are considering a credit card \"bill of rights\" that would limit the ability of credit card companies to raise interest rates on existing balances and require greater disclosure of terms. Federal Reserve Chairman Ben Bernanke has spoken out against complexity in consumer lending practices that is designed to confuse customers and drive up lending fees.  . I havent seen any lowered rates or payments from december", 
        "threadID": "672198221_6830012122001", 
        "time": "2009-04-19 15:27:00", 
        "title": "Credit Cards Abuse Crackdown", 
        "userID": "ss_287"
    }, 
    {
        "content": "my interst rate has gone up past 3 months each month it was higher then the last...so i call up to see if i can get it lowered... and what do they tell me?? your rate will be going up.. i said yea i see it has for the past 3 months and she said it will go up higher... ive made all my payments on time and everything...", 
        "intTime": 20090419, 
        "postID": 2, 
        "quote": "", 
        "reply": "my interst rate has gone up past 3 months each month it was higher then the last...so i call up to see if i can get it lowered... and what do they tell me?? your rate will be going up.. i said yea i see it has for the past 3 months and she said it will go up higher... ive made all my payments on time and everything...", 
        "threadID": "672198221_6830012122001", 
        "time": "2009-04-19 15:43:00", 
        "title": "Credit Cards Abuse Crackdown", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Federal Reserve Chairman Ben Bernanke has spoken out against complexity in consumer lending practices that is designed to confuse customers and drive up lending fees. Maybe Congress'll simplify consumer lending practices the same way they've promised for years to simplify the tax code. We'd all be a lot better off in the long haul if the full statement balance had to be paid within 10-20 days of the statement date ... specifically no \"minimum payments\" with the rest carried over.", 
        "intTime": 20090419, 
        "postID": 3, 
        "quote": "Federal Reserve Chairman Ben Bernanke has spoken out against complexity in consumer lending practices that is designed to confuse customers and drive up lending fees.", 
        "reply": " Maybe Congress'll simplify consumer lending practices the same way they've promised for years to simplify the tax code. We'd all be a lot better off in the long haul if the full statement balance had to be paid within 10-20 days of the statement date ... specifically no \"minimum payments\" with the rest carried over.", 
        "threadID": "672198221_6830012122001", 
        "time": "2009-04-19 15:47:00", 
        "title": "Credit Cards Abuse Crackdown", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "The Outlaw said it right. From banks to Capital One, all have increase rates charges for being over limit and then charges for late payments when you didn't. Called, written and pleaded and all you get is a standard letter saying how happy they are you are a customer. So I figure if I get charged late for making a payment, why make the damn payment??", 
        "intTime": 20090419, 
        "postID": 4, 
        "quote": "", 
        "reply": "The Outlaw said it right. From banks to Capital One, all have increase rates charges for being over limit and then charges for late payments when you didn't. Called, written and pleaded and all you get is a standard letter saying how happy they are you are a customer. So I figure if I get charged late for making a payment, why make the damn payment??", 
        "threadID": "672198221_6830012122001", 
        "time": "2009-04-19 16:04:00", 
        "title": "Credit Cards Abuse Crackdown", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: The Outlaw said it right. From banks to Capital One, all have increase rates charges for being over limit and then charges for late payments when you didn't. Called, written and pleaded and all you get is a standard letter saying how happy they are you are a customer. So I figure if I get charged late for making a payment, why make the damn payment?? someone a few years aao stopped paying for a few months then called the c/c company told them to reduce the interest or not get paid they were very receptive at thay point although it did not do much for his credit for 2 years", 
        "intTime": 20090419, 
        "postID": 5, 
        "quote": "Originally posted by rayevinsonsr: The Outlaw said it right. From banks to Capital One, all have increase rates charges for being over limit and then charges for late payments when you didn't. Called, written and pleaded and all you get is a standard letter saying how happy they are you are a customer. So I figure if I get charged late for making a payment, why make the damn payment??", 
        "reply": " someone a few years aao stopped paying for a few months then called the c/c company told them to reduce the interest or not get paid they were very receptive at thay point although it did not do much for his credit for 2 years", 
        "threadID": "672198221_6830012122001", 
        "time": "2009-04-19 16:10:00", 
        "title": "Credit Cards Abuse Crackdown", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by I_M_Qwerty: [QUOTE]Federal Reserve Chairman Ben Bernanke has spoken out against complexity in consumer lending practices that is designed to confuse customers and drive up lending fees. Maybe Congress'll simplify consumer lending practices the same way they've promised for years to simplify the tax code. We'd all be a lot better off in the long haul if the full statement balance had to be paid within 10-20 days of the statement date ... specifically no \"minimum payments\" with the rest carried over. When you use a credit care, you are taking a \"loan.\" Sort of a prime-rate loan, but without any protection at all. You get a card with a ten percent rate of interest, barrow some money, and find out next month that instead of 10 percent, you are paying 25. Years ago we called this Loansharking - But that's really an insult to loansharks - They tell you up front that their going to shaft you. But THESE guys are respectable business men and bankers, they shaft you with the fine print. I once took a loan a 5k loan for the convenience. Next month my interest did exactly as the above. FOrtunately I could pay the whole thing off at one shot, and did in fact cancel the card - Waste of time to cancel the card, they are all the same. Dave", 
        "intTime": 20090419, 
        "postID": 6, 
        "quote": "Originally posted by Grachus: quote: Originally posted by I_M_Qwerty: [QUOTE]Federal Reserve Chairman Ben Bernanke has spoken out against complexity in consumer lending practices that is designed to confuse customers and drive up lending fees. Maybe Congress'll simplify consumer lending practices the same way they've promised for years to simplify the tax code. We'd all be a lot better off in the long haul if the full statement balance had to be paid within 10-20 days of the statement date ... specifically no \"minimum payments\" with the rest carried over.", 
        "reply": " When you use a credit care, you are taking a \"loan.\" Sort of a prime-rate loan, but without any protection at all. You get a card with a ten percent rate of interest, barrow some money, and find out next month that instead of 10 percent, you are paying 25. Years ago we called this Loansharking - But that's really an insult to loansharks - They tell you up front that their going to shaft you. But THESE guys are respectable business men and bankers, they shaft you with the fine print. I once took a loan a 5k loan for the convenience. Next month my interest did exactly as the above. FOrtunately I could pay the whole thing off at one shot, and did in fact cancel the card - Waste of time to cancel the card, they are all the same. Dave", 
        "threadID": "672198221_6830012122001", 
        "time": "2009-04-19 16:19:00", 
        "title": "Credit Cards Abuse Crackdown", 
        "userID": "Grachus"
    }, 
    {
        "content": "I closed all credit accounts about 6 months ago. I didn't have many, but now all I have is a Navy Fed Visa and a Navy Fed Navcheck account. I do not even use those, but they are there for emergencies. And, the effective APR on the Visa card is 0%. The APR on the Navcheck is 7%. And, they haven't gone up. As a matter of fact, my Navcheck went down 1/2%,", 
        "intTime": 20090419, 
        "postID": 7, 
        "quote": "", 
        "reply": "I closed all credit accounts about 6 months ago. I didn't have many, but now all I have is a Navy Fed Visa and a Navy Fed Navcheck account. I do not even use those, but they are there for emergencies. And, the effective APR on the Visa card is 0%. The APR on the Navcheck is 7%. And, they haven't gone up. As a matter of fact, my Navcheck went down 1/2%,", 
        "threadID": "672198221_6830012122001", 
        "time": "2009-04-19 16:42:00", 
        "title": "Credit Cards Abuse Crackdown", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: I closed all credit accounts about 6 months ago. I didn't have many, but now all I have is a Navy Fed Visa and a Navy Fed Navcheck account. I do not even use those, but they are there for emergencies. And, the effective APR on the Visa card is 0%. The APR on the Navcheck is 7%. And, they haven't gone up. As a matter of fact, my Navcheck went down 1/2%, They're waiting for you to barrow something. Why should they charge you high interest on money you don't owe? While completely possible, it's hard to go through life without a credit card. I simply pay whatever I bought off the same month. I wonder if people have sued the companies that demand access to a card, such as car rental companies - After all it says right there on my collection of George Washington pictures, \"This note is legal tender for all debts public and private.\" Nothing about, \"except for the following.\" Dave", 
        "intTime": 20090419, 
        "postID": 8, 
        "quote": "Originally posted by 10tenths: I closed all credit accounts about 6 months ago. I didn't have many, but now all I have is a Navy Fed Visa and a Navy Fed Navcheck account. I do not even use those, but they are there for emergencies. And, the effective APR on the Visa card is 0%. The APR on the Navcheck is 7%. And, they haven't gone up. As a matter of fact, my Navcheck went down 1/2%,", 
        "reply": " They're waiting for you to barrow something. Why should they charge you high interest on money you don't owe? While completely possible, it's hard to go through life without a credit card. I simply pay whatever I bought off the same month. I wonder if people have sued the companies that demand access to a card, such as car rental companies - After all it says right there on my collection of George Washington pictures, \"This note is legal tender for all debts public and private.\" Nothing about, \"except for the following.\" Dave", 
        "threadID": "672198221_6830012122001", 
        "time": "2009-04-19 16:51:00", 
        "title": "Credit Cards Abuse Crackdown", 
        "userID": "Grachus"
    }, 
    {
        "content": "Just be smart people and start paying cash for everything. Don't do business with the crooked banks like Bank of America. Join your local Credit Union or your local small town bank. The only way to stop these large banks and other companies like IOU(I mean AIG) is to not do business with them and sooner or later they will go out of business. If you need to use your credit card then use it wisely and pay it off ASAP. I know about 78% of you all will ignore me but at least try it for a few months.", 
        "intTime": 20090419, 
        "postID": 9, 
        "quote": "", 
        "reply": "Just be smart people and start paying cash for everything. Don't do business with the crooked banks like Bank of America. Join your local Credit Union or your local small town bank. The only way to stop these large banks and other companies like IOU(I mean AIG) is to not do business with them and sooner or later they will go out of business. If you need to use your credit card then use it wisely and pay it off ASAP. I know about 78% of you all will ignore me but at least try it for a few months.", 
        "threadID": "672198221_6830012122001", 
        "time": "2009-04-19 16:57:00", 
        "title": "Credit Cards Abuse Crackdown", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: I closed all credit accounts about 6 months ago. I didn't have many, but now all I have is a Navy Fed Visa and a Navy Fed Navcheck account. I do not even use those, but they are there for emergencies. And, the effective APR on the Visa card is 0%. The APR on the Navcheck is 7%. And, they haven't gone up. As a matter of fact, my Navcheck went down 1/2%, Well hopfully they wont charge you a \"No Activity\" fee for not USING the card...LOL I don't know whats worst, the clowns who do this, or the morons(General public) who continue to let it happen...", 
        "intTime": 20090419, 
        "postID": 10, 
        "quote": "Originally posted by 10tenths: I closed all credit accounts about 6 months ago. I didn't have many, but now all I have is a Navy Fed Visa and a Navy Fed Navcheck account. I do not even use those, but they are there for emergencies. And, the effective APR on the Visa card is 0%. The APR on the Navcheck is 7%. And, they haven't gone up. As a matter of fact, my Navcheck went down 1/2%,", 
        "reply": " Well hopfully they wont charge you a \"No Activity\" fee for not USING the card...LOL I don't know whats worst, the clowns who do this, or the morons(General public) who continue to let it happen...", 
        "threadID": "672198221_6830012122001", 
        "time": "2009-04-19 17:07:00", 
        "title": "Credit Cards Abuse Crackdown", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: I wonder if people have sued the companies that demand access to a card, such as car rental companies - After all it says right there on my collection of George Washington pictures, \"This note is legal tender for all debts public and private.\" Interesting point ... but bear in mind that the credit card serves as your \"deposit\" ... not sure you'd want to fork over the up-front cash that would be required to accomplish the same thing.", 
        "intTime": 20090419, 
        "postID": 11, 
        "quote": "I wonder if people have sued the companies that demand access to a card, such as car rental companies - After all it says right there on my collection of George Washington pictures, \"This note is legal tender for all debts public and private.\"", 
        "reply": " Interesting point ... but bear in mind that the credit card serves as your \"deposit\" ... not sure you'd want to fork over the up-front cash that would be required to accomplish the same thing.", 
        "threadID": "672198221_6830012122001", 
        "time": "2009-04-19 17:10:00", 
        "title": "Credit Cards Abuse Crackdown", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Just be smart people and start paying cash for everything. Don't do business with the crooked banks like Bank of America. Join your local Credit Union or your local small town bank. The only way to stop these large banks and other companies like IOU(I mean AIG) is to not do business with them and sooner or later they will go out of business. If you need to use your credit card then use it wisely and pay it off ASAP. I know about 78% of you all will ignore me but at least try it for a few months. I won't ignore you, well at least not this time anyway, you are right... I paid off all of the cards, the house, the car and go on a strictly \"cash and carry\" basis... Respectfully, SUNLINER81", 
        "intTime": 20090419, 
        "postID": 12, 
        "quote": "Originally posted by Duster6: Just be smart people and start paying cash for everything. Don't do business with the crooked banks like Bank of America. Join your local Credit Union or your local small town bank. The only way to stop these large banks and other companies like IOU(I mean AIG) is to not do business with them and sooner or later they will go out of business. If you need to use your credit card then use it wisely and pay it off ASAP. I know about 78% of you all will ignore me but at least try it for a few months.", 
        "reply": " I won't ignore you, well at least not this time anyway, you are right... I paid off all of the cards, the house, the car and go on a strictly \"cash and carry\" basis... Respectfully, SUNLINER81", 
        "threadID": "672198221_6830012122001", 
        "time": "2009-04-19 17:18:00", 
        "title": "Credit Cards Abuse Crackdown", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: I wonder if people have sued the companies that demand access to a card, such as car rental companies - After all it says right there on my collection of George Washington pictures, \"This note is legal tender for all debts public and private.\" Interesting point ... but bear in mind that the credit card serves as your \"deposit\" ... not sure you'd want to fork over the up-front cash that would be required to accomplish the same thing. Actually I avoided credit cards like the plague, for all the reasons stated on this thread. When I was in my late thirties I finally through in the towel because I HAD to rent a car and no deposit was big enough for the rental company. They wanted the damn card - Period. And recently I changed auto insurance companies. They wanted me to pay by card, and I insisted on them sending me a bill - But again, the First payment HAD to be by card. Same thing for my internet provider. I've always wondered if there would be legal grounds for a suit. Dave", 
        "intTime": 20090419, 
        "postID": 13, 
        "quote": "Originally posted by I_M_Qwerty: quote: I wonder if people have sued the companies that demand access to a card, such as car rental companies - After all it says right there on my collection of George Washington pictures, \"This note is legal tender for all debts public and private.\" Interesting point ... but bear in mind that the credit card serves as your \"deposit\" ... not sure you'd want to fork over the up-front cash that would be required to accomplish the same thing.", 
        "reply": " Actually I avoided credit cards like the plague, for all the reasons stated on this thread. When I was in my late thirties I finally through in the towel because I HAD to rent a car and no deposit was big enough for the rental company. They wanted the damn card - Period. And recently I changed auto insurance companies. They wanted me to pay by card, and I insisted on them sending me a bill - But again, the First payment HAD to be by card. Same thing for my internet provider. I've always wondered if there would be legal grounds for a suit. Dave", 
        "threadID": "672198221_6830012122001", 
        "time": "2009-04-19 17:28:00", 
        "title": "Credit Cards Abuse Crackdown", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by Duster6: Just be smart people and start paying cash for everything. Don't do business with the crooked banks like Bank of America. Join your local Credit Union or your local small town bank. The only way to stop these large banks and other companies like IOU(I mean AIG) is to not do business with them and sooner or later they will go out of business. If you need to use your credit card then use it wisely and pay it off ASAP. I know about 78% of you all will ignore me but at least try it for a few months. I won't ignore you, well at least not this time anyway, you are right... I paid off all of the cards, the house, the car and go on a strictly \"cash and carry\" basis... Respectfully, SUNLINER81 Thank you for not ignoring me and thinking I am stupid or a Pin Head. You are a very smart man and a very good American. People like you and I are the real Heros of this country. We turn our noses and middle fingers up to all these greedy businesses.", 
        "intTime": 20090419, 
        "postID": 14, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by Duster6: Just be smart people and start paying cash for everything. Don't do business with the crooked banks like Bank of America. Join your local Credit Union or your local small town bank. The only way to stop these large banks and other companies like IOU(I mean AIG) is to not do business with them and sooner or later they will go out of business. If you need to use your credit card then use it wisely and pay it off ASAP. I know about 78% of you all will ignore me but at least try it for a few months. I won't ignore you, well at least not this time anyway, you are right... I paid off all of the cards, the house, the car and go on a strictly \"cash and carry\" basis... Respectfully, SUNLINER81", 
        "reply": " Thank you for not ignoring me and thinking I am stupid or a Pin Head. You are a very smart man and a very good American. People like you and I are the real Heros of this country. We turn our noses and middle fingers up to all these greedy businesses.", 
        "threadID": "672198221_6830012122001", 
        "time": "2009-04-19 17:31:00", 
        "title": "Credit Cards Abuse Crackdown", 
        "userID": "Duster6"
    }, 
    {
        "content": "I shut off all my credit cards just before I retired and paid them off. Been the best decision I've ever made.", 
        "intTime": 20090419, 
        "postID": 15, 
        "quote": "", 
        "reply": "I shut off all my credit cards just before I retired and paid them off. Been the best decision I've ever made.", 
        "threadID": "672198221_6830012122001", 
        "time": "2009-04-19 17:40:00", 
        "title": "Credit Cards Abuse Crackdown", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by SUNLINER81: quote: Originally posted by Duster6: Just be smart people and start paying cash for everything. Don't do business with the crooked banks like Bank of America. Join your local Credit Union or your local small town bank. The only way to stop these large banks and other companies like IOU(I mean AIG) is to not do business with them and sooner or later they will go out of business. If you need to use your credit card then use it wisely and pay it off ASAP. I know about 78% of you all will ignore me but at least try it for a few months. I won't ignore you, well at least not this time anyway, you are right... I paid off all of the cards, the house, the car and go on a strictly \"cash and carry\" basis... Respectfully, SUNLINER81 Thank you for not ignoring me and thinking I am stupid or a Pin Head. You are a very smart man and a very good American. People like you and I are the real Heros of this country. We turn our noses and middle fingers up to all these greedy businesses. Looks like we will have to start a \"Mutual Admiration Society\"!... LOL Respectfully, SUNLINER81", 
        "intTime": 20090419, 
        "postID": 16, 
        "quote": "Originally posted by Duster6: quote: Originally posted by SUNLINER81: quote: Originally posted by Duster6: Just be smart people and start paying cash for everything. Don't do business with the crooked banks like Bank of America. Join your local Credit Union or your local small town bank. The only way to stop these large banks and other companies like IOU(I mean AIG) is to not do business with them and sooner or later they will go out of business. If you need to use your credit card then use it wisely and pay it off ASAP. I know about 78% of you all will ignore me but at least try it for a few months. I won't ignore you, well at least not this time anyway, you are right... I paid off all of the cards, the house, the car and go on a strictly \"cash and carry\" basis... Respectfully, SUNLINER81 Thank you for not ignoring me and thinking I am stupid or a Pin Head. You are a very smart man and a very good American. People like you and I are the real Heros of this country. We turn our noses and middle fingers up to all these greedy businesses.", 
        "reply": " Looks like we will have to start a \"Mutual Admiration Society\"!... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_6830012122001", 
        "time": "2009-04-19 17:55:00", 
        "title": "Credit Cards Abuse Crackdown", 
        "userID": "SUNLINER81"
    }
]