[
    {
        "content": "From the BBC: quote: Fighting off the Somali pirates The recent escalation in pirate attacks has highlighted the vulnerability of shipping off the coast of Somalia. Now many ships are taking their own precautions, using hi-tech equipment to keep pirates at bay. Graphic shows anti-pirate measures that can be used on ship, plus pirates and their weapons A beefed-up international naval presence and United Nations resolutions giving foreign military vessels greater powers to chase the pirates have created little in the way of an effective deterrent. But a consensus is emerging that ship-owners themselves could be doing more to prevent piracy. So is there more in practical terms that ships' captains can do to fend off the pirates? Wire and sound Those who have witnessed attacks say the pirates tend to sneak up on one side of a ship. They use grappling hooks and ladders to board it at the most vulnerable point - where there is least distance between the height of the deck and the water level. Some vessels have strung barbed wire at those points, as recommended by the International Maritime Bureau in London. In some cases, say experts, this has proved effective. Slippery foam sprayed onto the deck can also present a further barrier to pirates taking over. Other possible solutions include electric security fences and blasting the pirates with water from fire hoses. While hoses can be used to knock them off balance as they try to board a ship, they are thought to be of limited use against heavily-armed intruders. Another weapon in a skipper's armoury are loudspeaker systems - or long-range acoustic devices - which provide a clear warning and can, in some instances, damage the hearing of potential unwelcome boarders. One manufacturer describes its product as having a 'highly irritating deterrent tone for behaviour modification'. An obvious deterrent is the deployment of more lookouts to give ample warning of a possible attack, supplemented by beefed up camera surveillance. Skippers are also able to deploy sensitive radar, again, alerting them to imminent danger. Use of arms Controversial, though, is any proposal to arm crews. The problem with this, says Will Geddes, managing director of International Corporate Protection group, is the risk of a protracted battle with already well-armed pirates. (...) \"If you have guns for protection, you have to shoot to kill... even if you have the officers shoot, you're going to be shot back at and I think the chance of injury and death to the crew members, and damage to the ship, would be prohibitive.\" John Burnett suggests thorough training of crew so that when they enter pirate territory, they are alert and assume that they are going to be attacked...", 
        "intTime": 20090416, 
        "postID": 1, 
        "quote": "Fighting off the Somali pirates The recent escalation in pirate attacks has highlighted the vulnerability of shipping off the coast of Somalia. Now many ships are taking their own precautions, using hi-tech equipment to keep pirates at bay. Graphic shows anti-pirate measures that can be used on ship, plus pirates and their weapons A beefed-up international naval presence and United Nations resolutions giving foreign military vessels greater powers to chase the pirates have created little in the way of an effective deterrent. But a consensus is emerging that ship-owners themselves could be doing more to prevent piracy. So is there more in practical terms that ships' captains can do to fend off the pirates? Wire and sound Those who have witnessed attacks say the pirates tend to sneak up on one side of a ship. They use grappling hooks and ladders to board it at the most vulnerable point - where there is least distance between the height of the deck and the water level. Some vessels have strung barbed wire at those points, as recommended by the International Maritime Bureau in London. In some cases, say experts, this has proved effective. Slippery foam sprayed onto the deck can also present a further barrier to pirates taking over. Other possible solutions include electric security fences and blasting the pirates with water from fire hoses. While hoses can be used to knock them off balance as they try to board a ship, they are thought to be of limited use against heavily-armed intruders. Another weapon in a skipper's armoury are loudspeaker systems - or long-range acoustic devices - which provide a clear warning and can, in some instances, damage the hearing of potential unwelcome boarders. One manufacturer describes its product as having a 'highly irritating deterrent tone for behaviour modification'. An obvious deterrent is the deployment of more lookouts to give ample warning of a possible attack, supplemented by beefed up camera surveillance. Skippers are also able to deploy sensitive radar, again, alerting them to imminent danger. Use of arms Controversial, though, is any proposal to arm crews. The problem with this, says Will Geddes, managing director of International Corporate Protection group, is the risk of a protracted battle with already well-armed pirates. (...) \"If you have guns for protection, you have to shoot to kill... even if you have the officers shoot, you're going to be shot back at and I think the chance of injury and death to the crew members, and damage to the ship, would be prohibitive.\" John Burnett suggests thorough training of crew so that when they enter pirate territory, they are alert and assume that they are going to be attacked...", 
        "reply": "From the BBC: ", 
        "threadID": "672198221_1770099022001", 
        "time": "2009-04-16 23:35:00", 
        "title": "article: Antipiracy methods used by merchant ships", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: \"If you have guns for protection, you have to shoot to kill... even if you have the officers shoot, you're going to be shot back at and I think the chance of injury and death to the crew members, and damage to the ship, would be prohibitive.\" so it all comes down to money.", 
        "intTime": 20090416, 
        "postID": 2, 
        "quote": "\"If you have guns for protection, you have to shoot to kill... even if you have the officers shoot, you're going to be shot back at and I think the chance of injury and death to the crew members, and damage to the ship, would be prohibitive.\"", 
        "reply": " so it all comes down to money.", 
        "threadID": "672198221_1770099022001", 
        "time": "2009-04-16 23:43:00", 
        "title": "article: Antipiracy methods used by merchant ships", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "They should also have steam cannons, so when the pirates try to board the \"boat\", they can turn them on and roast the buggers as the try and climb the sides... Used to work real well on U.S. Naval vessels years ago and would work well now... Take the hot water boiler and jack 'er up a notch or two or even install a small steam boiler for just such a purpose... Respectfully, SUNLINER81", 
        "intTime": 20090417, 
        "postID": 3, 
        "quote": "", 
        "reply": "They should also have steam cannons, so when the pirates try to board the \"boat\", they can turn them on and roast the buggers as the try and climb the sides... Used to work real well on U.S. Naval vessels years ago and would work well now... Take the hot water boiler and jack 'er up a notch or two or even install a small steam boiler for just such a purpose... Respectfully, SUNLINER81", 
        "threadID": "672198221_1770099022001", 
        "time": "2009-04-17 00:38:00", 
        "title": "article: Antipiracy methods used by merchant ships", 
        "userID": "SUNLINER81"
    }
]