[
    {
        "content": ">http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know?",
        "intTime": 20090310,
        "postID": 1,
        "quote": "",
        "reply": ">http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know?",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 19:24:00",
        "title": "Operation Enduring Blunder",
        "userID": "popsiq"
    },
    {
        "content": "Wow! Makes me wonder what the good people at move on dot org think....ooops, my mind was stuck on \"sarcastic\" there for a moment. I question the advisability of giving antiwar.com any publicity. But that's just be me...",
        "intTime": 20090310,
        "postID": 2,
        "quote": "",
        "reply": "Wow! Makes me wonder what the good people at move on dot org think....ooops, my mind was stuck on \"sarcastic\" there for a moment. I question the advisability of giving antiwar.com any publicity. But that's just be me...",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 19:45:00",
        "title": "Operation Enduring Blunder",
        "userID": "scooter_mech"
    },
    {
        "content": "quote: Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know? Say, Pops, What do you think of the latest development regarding Gen. Leslie's comments on the Canadian Army at this thread? \"thread post about Canadian Army needing to regroup\" at the British and Commonwealth forum of military.com I would have PM'ed/e-mailed, but no one ever seems to get my PMs.",
        "intTime": 20090310,
        "postID": 3,
        "quote": "Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know?",
        "reply": " Say, Pops, What do you think of the latest development regarding Gen. Leslie's comments on the Canadian Army at this thread? \"thread post about Canadian Army needing to regroup\" at the British and Commonwealth forum of military.com I would have PM'ed/e-mailed, but no one ever seems to get my PMs.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 19:57:00",
        "title": "Operation Enduring Blunder",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "I have never read Clausewitz , ?I was more interested in \"asymetrical\" warefare, all without a \"center of gravity\" that we could actually direct all our forces. aS ALL MY ADULT LIFE, WE HAVE HAD ONLY ASYM,ETRICAL WARFARE, IMPOSED EITHER BY THE enemy or THE fAT tED WING OF THE Congress. With no center of gravity, what do Clausewitz and SunTsu advise. I know what the Comanche and Apschy War Chiefs did and what beat them.......",
        "intTime": 20090310,
        "postID": 4,
        "quote": "",
        "reply": "I have never read Clausewitz , ?I was more interested in \"asymetrical\" warefare, all without a \"center of gravity\" that we could actually direct all our forces. aS ALL MY ADULT LIFE, WE HAVE HAD ONLY ASYM,ETRICAL WARFARE, IMPOSED EITHER BY THE enemy or THE fAT tED WING OF THE Congress. With no center of gravity, what do Clausewitz and SunTsu advise. I know what the Comanche and Apschy War Chiefs did and what beat them.......",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 20:05:00",
        "title": "Operation Enduring Blunder",
        "userID": "peter3_1"
    },
    {
        "content": "quote: Originally posted by scooter_mech: Wow! Makes me wonder what the good people at move on dot org think....ooops, my mind was stuck on \"sarcastic\" there for a moment. I question the advisability of giving antiwar.com any publicity. But that's just be me... Huber should be posting on opinions at Mil.com. Did he offend somebody? He raises some points in defiance of conventional wisdom. The kind that somebody should have been raising all along. But they aren't the kind of points that are easily debated, or blown away with BS.",
        "intTime": 20090310,
        "postID": 5,
        "quote": "Originally posted by scooter_mech: Wow! Makes me wonder what the good people at move on dot org think....ooops, my mind was stuck on \"sarcastic\" there for a moment. I question the advisability of giving antiwar.com any publicity. But that's just be me...",
        "reply": " Huber should be posting on opinions at Mil.com. Did he offend somebody? He raises some points in defiance of conventional wisdom. The kind that somebody should have been raising all along. But they aren't the kind of points that are easily debated, or blown away with BS.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 20:55:00",
        "title": "Operation Enduring Blunder",
        "userID": "popsiq"
    },
    {
        "content": "Yes, I'm sure the troops are there just to \"hang out\". Just aimlessly wandering around the desert, right? I find it more than a little disingenuous that someone with an obvious anti-war bent would pass himself off to know anything about military strategy. He sure knows how to criticize; I wonder what he would consider GOOD strategy... quote: --The Keystone Kollege of Armed Konflict Knowledge that all our generals seem to have attended doesn't place much importance on coherent strategy making, either. --Back in the day, all those four-stars would have kept smoke grenades handy so they'd have something to blow up the boss's skirt if he asked a hard question. --Like most military matters, the center of gravity concept is broadly misunderstood, especially among the military's top brass. --We don't know the enemy. --Blowing stuff up is the one thing Obama's generals know how to do real good. Then he DOES goes on to offer what he thinks is good military strategy: shake hands with the Taliban and go home. Wow, now that wouldn't enable and bolden those who hate Westerners, would it? In order to have a legitimate discussion about conventional or asymmetrical warfare, you have to post something legitimate.",
        "intTime": 20090310,
        "postID": 6,
        "quote": "--The Keystone Kollege of Armed Konflict Knowledge that all our generals seem to have attended doesn't place much importance on coherent strategy making, either. --Back in the day, all those four-stars would have kept smoke grenades handy so they'd have something to blow up the boss's skirt if he asked a hard question. --Like most military matters, the center of gravity concept is broadly misunderstood, especially among the military's top brass. --We don't know the enemy. --Blowing stuff up is the one thing Obama's generals know how to do real good.",
        "reply": "Yes, I'm sure the troops are there just to \"hang out\". Just aimlessly wandering around the desert, right? I find it more than a little disingenuous that someone with an obvious anti-war bent would pass himself off to know anything about military strategy. He sure knows how to criticize; I wonder what he would consider GOOD strategy...  Then he DOES goes on to offer what he thinks is good military strategy: shake hands with the Taliban and go home. Wow, now that wouldn't enable and bolden those who hate Westerners, would it? In order to have a legitimate discussion about conventional or asymmetrical warfare, you have to post something legitimate.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 21:48:00",
        "title": "Operation Enduring Blunder",
        "userID": "DCookeUSA1"
    },
    {
        "content": "I think the thing to do is just maintain enough troops there to make sure those tribes don't breed any organized force - for as long as it takes until those areas come up to the speed of the developed world - could be 20 years, could be 50 or 100. What we are doing is providing an environment where education and critical thinking is valued and encouraged.",
        "intTime": 20090310,
        "postID": 7,
        "quote": "",
        "reply": "I think the thing to do is just maintain enough troops there to make sure those tribes don't breed any organized force - for as long as it takes until those areas come up to the speed of the developed world - could be 20 years, could be 50 or 100. What we are doing is providing an environment where education and critical thinking is valued and encouraged.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 22:10:00",
        "title": "Operation Enduring Blunder",
        "userID": "DCookeUSA1"
    },
    {
        "content": "Huber was wrong about the Iraq Surge, so why should he be taken seriously now?",
        "intTime": 20090311,
        "postID": 8,
        "quote": "",
        "reply": "Huber was wrong about the Iraq Surge, so why should he be taken seriously now?",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 00:06:00",
        "title": "Operation Enduring Blunder",
        "userID": "LineDoggie"
    },
    {
        "content": "quote: Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know? Our illustrious Administration is using the words, moderate Taliban. You show me a moderate Taliban and I will show you that cheap bridge that I have for sale....Neither exists.",
        "intTime": 20090311,
        "postID": 9,
        "quote": "Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know?",
        "reply": " Our illustrious Administration is using the words, moderate Taliban. You show me a moderate Taliban and I will show you that cheap bridge that I have for sale....Neither exists.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 03:05:00",
        "title": "Operation Enduring Blunder",
        "userID": "dhd123"
    },
    {
        "content": "quote: Originally posted by scooter_mech: Wow! Makes me wonder what the good people at move on dot org think....ooops, my mind was stuck on \"sarcastic\" there for a moment. I question the advisability of giving antiwar.com any publicity. But that's just be me... I enjoyed your sarcasim scooter. With references like (quote)The Keystone Kollege of Armed Konflict Knowledge that all our generals seem to have attended doesn't place much importance on coherent strategy making, either.(quote) and from another article on the web site: (quote)Sen. John Kerry says the center of gravity in Afghanistan is in Pakistan. Let's hope Obama stays mindful of Kerry's track record vis-à-vis winning strategies.(quote) a real self proclaimed war hero--OMG, more sarcasim , do these folks deserve ANY CREDIBILITY? Isn't 'Freedom of Speach' a wonderful thing?",
        "intTime": 20090311,
        "postID": 10,
        "quote": "Originally posted by scooter_mech: Wow! Makes me wonder what the good people at move on dot org think....ooops, my mind was stuck on \"sarcastic\" there for a moment. I question the advisability of giving antiwar.com any publicity. But that's just be me...",
        "reply": " I enjoyed your sarcasim scooter. With references like (quote)The Keystone Kollege of Armed Konflict Knowledge that all our generals seem to have attended doesn't place much importance on coherent strategy making, either.(quote) and from another article on the web site: (quote)Sen. John Kerry says the center of gravity in Afghanistan is in Pakistan. Let's hope Obama stays mindful of Kerry's track record vis-à-vis winning strategies.(quote) a real self proclaimed war hero--OMG, more sarcasim , do these folks deserve ANY CREDIBILITY? Isn't 'Freedom of Speach' a wonderful thing?",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 06:15:00",
        "title": "Operation Enduring Blunder",
        "userID": "busnrete8"
    },
    {
        "content": "quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda.",
        "intTime": 20090311,
        "postID": 11,
        "quote": "Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now?",
        "reply": " Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 06:26:00",
        "title": "Operation Enduring Blunder",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by dhd123: quote: Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know? Our illustrious Administration is using the words, moderate Taliban. You show me a moderate Taliban and I will show you that cheap bridge that I have for sale....Neither exists. Actually what people CALL the Taliban does include moderates. Remember what is called the Taliban is a LARGE number of different groups and subgroups with leaders that vary from extremely religious to warloards out only for themselves to those that see the Taliban as the only alternative to lawlessness and corrupt government.",
        "intTime": 20090311,
        "postID": 12,
        "quote": "Originally posted by dhd123: quote: Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know? Our illustrious Administration is using the words, moderate Taliban. You show me a moderate Taliban and I will show you that cheap bridge that I have for sale....Neither exists.",
        "reply": " Actually what people CALL the Taliban does include moderates. Remember what is called the Taliban is a LARGE number of different groups and subgroups with leaders that vary from extremely religious to warloards out only for themselves to those that see the Taliban as the only alternative to lawlessness and corrupt government.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 06:30:00",
        "title": "Operation Enduring Blunder",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. After the invasion in 2003 the Iraqi military ceased to exist. In 2004 the Iraqi Army began to be rebuilt, but they lacked everything from vehicles to tanks to supplies of uniforms. In Iraqi I was on a training team under MNSTC-I, the other 3 star command there besides MNC-I. I lived and worked at an Iraqi regional training center. Over the course of the year I was there we graduated nearly 10,000 Iraqi soldiers from basic training, and we were just one of a dozen training centers. We also fielded tens of thousands of M-16s and M-4s, thousands of HMMWVs, over 10,000 SINCGARS variant radios, and had an operating CIF for uniforms and field gear. We built ranges, obstacle courses, live fire shoot houses, and many other things. By the time I left our basic training mission went from 1200-1500 soldiers per cycle to 300-400 because the divisions are at strength and they were not building new manuever units. One of the biggest successes was conducting actual Warfighter exercises on a battalion scale. We taught the staffs, COIN, and battle tracking. The surge provided the breathing room and security to build confidence in the Iraqi's own security forces. Like us they have an AVF, and they are not short of recruits. That is the success in Iraq. I met and worked with hundreds of young IA officers and soldiers that know their business. They have the training, they are capable, and now they are out doing it.",
        "intTime": 20090311,
        "postID": 13,
        "quote": "Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda.",
        "reply": " The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. After the invasion in 2003 the Iraqi military ceased to exist. In 2004 the Iraqi Army began to be rebuilt, but they lacked everything from vehicles to tanks to supplies of uniforms. In Iraqi I was on a training team under MNSTC-I, the other 3 star command there besides MNC-I. I lived and worked at an Iraqi regional training center. Over the course of the year I was there we graduated nearly 10,000 Iraqi soldiers from basic training, and we were just one of a dozen training centers. We also fielded tens of thousands of M-16s and M-4s, thousands of HMMWVs, over 10,000 SINCGARS variant radios, and had an operating CIF for uniforms and field gear. We built ranges, obstacle courses, live fire shoot houses, and many other things. By the time I left our basic training mission went from 1200-1500 soldiers per cycle to 300-400 because the divisions are at strength and they were not building new manuever units. One of the biggest successes was conducting actual Warfighter exercises on a battalion scale. We taught the staffs, COIN, and battle tracking. The surge provided the breathing room and security to build confidence in the Iraqi's own security forces. Like us they have an AVF, and they are not short of recruits. That is the success in Iraq. I met and worked with hundreds of young IA officers and soldiers that know their business. They have the training, they are capable, and now they are out doing it.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 07:13:00",
        "title": "Operation Enduring Blunder",
        "userID": "nspreitler"
    },
    {
        "content": "quote: Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know? Yeah. Imagine if we had simply talked to the good Nazis.",
        "intTime": 20090311,
        "postID": 14,
        "quote": "Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know?",
        "reply": " Yeah. Imagine if we had simply talked to the good Nazis.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 07:20:00",
        "title": "Operation Enduring Blunder",
        "userID": "M1Lase_n_Blaze"
    },
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. After the invasion in 2003 the Iraqi military ceased to exist. In 2004 the Iraqi Army began to be rebuilt, but they lacked everything from vehicles to tanks to supplies of uniforms. In Iraqi I was on a training team under MNSTC-I, the other 3 star command there besides MNC-I. I lived and worked at an Iraqi regional training center. Over the course of the year I was there we graduated nearly 10,000 Iraqi soldiers from basic training, and we were just one of a dozen training centers. We also fielded tens of thousands of M-16s and M-4s, thousands of HMMWVs, over 10,000 SINCGARS variant radios, and had an operating CIF for uniforms and field gear. We built ranges, obstacle courses, live fire shoot houses, and many other things. By the time I left our basic training mission went from 1200-1500 soldiers per cycle to 300-400 because the divisions are at strength and they were not building new manuever units. One of the biggest successes was conducting actual Warfighter exercises on a battalion scale. We taught the staffs, COIN, and battle tracking. The surge provided the breathing room and security to build confidence in the Iraqi's own security forces. Like us they have an AVF, and they are not short of recruits. That is the success in Iraq. I met and worked with hundreds of young IA officers and soldiers that know their business. They have the training, they are capable, and now they are out doing it. Absolutely concur. The increase in numbers allowed a greater permanent presence among the populace. Sort of like establishing permanent courts and local law enforcement instead of depending on US Marshalls and far flung Cavalry posts, tamed the US West.",
        "intTime": 20090311,
        "postID": 15,
        "quote": "Originally posted by nspreitler: quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. After the invasion in 2003 the Iraqi military ceased to exist. In 2004 the Iraqi Army began to be rebuilt, but they lacked everything from vehicles to tanks to supplies of uniforms. In Iraqi I was on a training team under MNSTC-I, the other 3 star command there besides MNC-I. I lived and worked at an Iraqi regional training center. Over the course of the year I was there we graduated nearly 10,000 Iraqi soldiers from basic training, and we were just one of a dozen training centers. We also fielded tens of thousands of M-16s and M-4s, thousands of HMMWVs, over 10,000 SINCGARS variant radios, and had an operating CIF for uniforms and field gear. We built ranges, obstacle courses, live fire shoot houses, and many other things. By the time I left our basic training mission went from 1200-1500 soldiers per cycle to 300-400 because the divisions are at strength and they were not building new manuever units. One of the biggest successes was conducting actual Warfighter exercises on a battalion scale. We taught the staffs, COIN, and battle tracking. The surge provided the breathing room and security to build confidence in the Iraqi's own security forces. Like us they have an AVF, and they are not short of recruits. That is the success in Iraq. I met and worked with hundreds of young IA officers and soldiers that know their business. They have the training, they are capable, and now they are out doing it.",
        "reply": " Absolutely concur. The increase in numbers allowed a greater permanent presence among the populace. Sort of like establishing permanent courts and local law enforcement instead of depending on US Marshalls and far flung Cavalry posts, tamed the US West.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 07:26:00",
        "title": "Operation Enduring Blunder",
        "userID": "M1Lase_n_Blaze"
    },
    {
        "content": "quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? How so? Is Iraq at peace and nobody told us? You will announce the BIG parade won't you?",
        "intTime": 20090311,
        "postID": 16,
        "quote": "Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now?",
        "reply": " How so? Is Iraq at peace and nobody told us? You will announce the BIG parade won't you?",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 14:08:00",
        "title": "Operation Enduring Blunder",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. -snip-. nspreitler I did NOT say the surge did not help I said \"the surge was NOT the biggest factor in the improvement in Iraq\". The surge was for the Baghdad area NOT Iraq as a whole. I think the evidence shows quite clearly that convincing the Sunni tribal leaders to shift to fighting Al Queada for the US rather helping Al Quaeda fight the US and the US backed Iraqi government had a much bigger impact on Iraq as a whole than the surge. This message has been edited. Last edited by: rayld2, Thu 12 March 2009 09:15 AM",
        "intTime": 20090312,
        "postID": 17,
        "quote": "Originally posted by nspreitler: quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. -snip-.",
        "reply": " nspreitler I did NOT say the surge did not help I said \"the surge was NOT the biggest factor in the improvement in Iraq\". The surge was for the Baghdad area NOT Iraq as a whole. I think the evidence shows quite clearly that convincing the Sunni tribal leaders to shift to fighting Al Queada for the US rather helping Al Quaeda fight the US and the US backed Iraqi government had a much bigger impact on Iraq as a whole than the surge. This message has been edited. Last edited by: rayld2, Thu 12 March 2009 09:15 AM",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-12 06:15:00",
        "title": "Operation Enduring Blunder",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by nspreitler: quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. -snip-. nspreitler I did NOT say the surge did not help I said \"he surge was NOT the biggest factor in the improvement in Iraq\". The surge was for the Baghdad area NOT Iraq as a whole. I think the evidence shows quite clearly that convincing the Sunni tribal leaders to shift to fighting Al Queada for the US rather helping Al Quaeda fight the US and the US backed Iraqi government had a much bigger impact on Iraq as a whole than the surge. The Sons of Iraq did help in Sunni areas. In Baghdad it was the Shia Mahdi Army that was the biggest threat. About this time last year the IZ had earned its name as the \"Impact Zone\" because of all the ortars and rockets being lobbed at it. After the offensive operation in April and May that area has become much safer. That was a combined US and Iraqi offensive. There is no doubt that the application of counterinsurgency tactics worked very well. It also increased the number of advisors. Where I was every Iraqi manuever battalion had a MiTT with it. Once Sadr City was calmed down the breathing room in Baghdad allowed us to rotate Iraqi units off the line and conduct training. The success of the MiTTs is probably the biggest lesson of Iraq.",
        "intTime": 20090312,
        "postID": 18,
        "quote": "Originally posted by rayld2: quote: Originally posted by nspreitler: quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. -snip-. nspreitler I did NOT say the surge did not help I said \"he surge was NOT the biggest factor in the improvement in Iraq\". The surge was for the Baghdad area NOT Iraq as a whole. I think the evidence shows quite clearly that convincing the Sunni tribal leaders to shift to fighting Al Queada for the US rather helping Al Quaeda fight the US and the US backed Iraqi government had a much bigger impact on Iraq as a whole than the surge.",
        "reply": " The Sons of Iraq did help in Sunni areas. In Baghdad it was the Shia Mahdi Army that was the biggest threat. About this time last year the IZ had earned its name as the \"Impact Zone\" because of all the ortars and rockets being lobbed at it. After the offensive operation in April and May that area has become much safer. That was a combined US and Iraqi offensive. There is no doubt that the application of counterinsurgency tactics worked very well. It also increased the number of advisors. Where I was every Iraqi manuever battalion had a MiTT with it. Once Sadr City was calmed down the breathing room in Baghdad allowed us to rotate Iraqi units off the line and conduct training. The success of the MiTTs is probably the biggest lesson of Iraq.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-12 06:51:00",
        "title": "Operation Enduring Blunder",
        "userID": "nspreitler"
    },
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? How so? Is Iraq at peace and nobody told us? You will announce the BIG parade won't you? Sure thing, but it's only open to those who participated, not to sideline hecklers Though I suppose your cheering on for a US loss counts",
        "intTime": 20090312,
        "postID": 19,
        "quote": "Originally posted by popsiq: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? How so? Is Iraq at peace and nobody told us? You will announce the BIG parade won't you?",
        "reply": " Sure thing, but it's only open to those who participated, not to sideline hecklers Though I suppose your cheering on for a US loss counts",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-12 07:39:00",
        "title": "Operation Enduring Blunder",
        "userID": "LineDoggie"
    },
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by popsiq: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? How so? Is Iraq at peace and nobody told us? You will announce the BIG parade won't you? Sure thing, but it's only open to those who participated, not to sideline hecklers Though I suppose your cheering on for a US loss counts",
        "intTime": 20090312,
        "postID": 20,
        "quote": "Originally posted by LineDoggie: quote: Originally posted by popsiq: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? How so? Is Iraq at peace and nobody told us? You will announce the BIG parade won't you? Sure thing, but it's only open to those who participated, not to sideline hecklers Though I suppose your cheering on for a US loss counts",
        "reply": "",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-12 07:46:00",
        "title": "Operation Enduring Blunder",
        "userID": "M1Lase_n_Blaze"
    },
    {
        "content": ">http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know?",
        "intTime": 20090310,
        "postID": 21,
        "quote": "",
        "reply": ">http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know?",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 19:24:00",
        "title": "Operation Enduring Blunder",
        "userID": "popsiq"
    },
    {
        "content": "Wow! Makes me wonder what the good people at move on dot org think....ooops, my mind was stuck on \"sarcastic\" there for a moment. I question the advisability of giving antiwar.com any publicity. But that's just be me...",
        "intTime": 20090310,
        "postID": 22,
        "quote": "",
        "reply": "Wow! Makes me wonder what the good people at move on dot org think....ooops, my mind was stuck on \"sarcastic\" there for a moment. I question the advisability of giving antiwar.com any publicity. But that's just be me...",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 19:45:00",
        "title": "Operation Enduring Blunder",
        "userID": "scooter_mech"
    },
    {
        "content": "quote: Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know? Say, Pops, What do you think of the latest development regarding Gen. Leslie's comments on the Canadian Army at this thread? \"thread post about Canadian Army needing to regroup\" at the British and Commonwealth forum of military.com I would have PM'ed/e-mailed, but no one ever seems to get my PMs.",
        "intTime": 20090310,
        "postID": 23,
        "quote": "Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know?",
        "reply": " Say, Pops, What do you think of the latest development regarding Gen. Leslie's comments on the Canadian Army at this thread? \"thread post about Canadian Army needing to regroup\" at the British and Commonwealth forum of military.com I would have PM'ed/e-mailed, but no one ever seems to get my PMs.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 19:57:00",
        "title": "Operation Enduring Blunder",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "I have never read Clausewitz , ?I was more interested in \"asymetrical\" warefare, all without a \"center of gravity\" that we could actually direct all our forces. aS ALL MY ADULT LIFE, WE HAVE HAD ONLY ASYM,ETRICAL WARFARE, IMPOSED EITHER BY THE enemy or THE fAT tED WING OF THE Congress. With no center of gravity, what do Clausewitz and SunTsu advise. I know what the Comanche and Apschy War Chiefs did and what beat them.......",
        "intTime": 20090310,
        "postID": 24,
        "quote": "",
        "reply": "I have never read Clausewitz , ?I was more interested in \"asymetrical\" warefare, all without a \"center of gravity\" that we could actually direct all our forces. aS ALL MY ADULT LIFE, WE HAVE HAD ONLY ASYM,ETRICAL WARFARE, IMPOSED EITHER BY THE enemy or THE fAT tED WING OF THE Congress. With no center of gravity, what do Clausewitz and SunTsu advise. I know what the Comanche and Apschy War Chiefs did and what beat them.......",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 20:05:00",
        "title": "Operation Enduring Blunder",
        "userID": "peter3_1"
    },
    {
        "content": "quote: Originally posted by scooter_mech: Wow! Makes me wonder what the good people at move on dot org think....ooops, my mind was stuck on \"sarcastic\" there for a moment. I question the advisability of giving antiwar.com any publicity. But that's just be me... Huber should be posting on opinions at Mil.com. Did he offend somebody? He raises some points in defiance of conventional wisdom. The kind that somebody should have been raising all along. But they aren't the kind of points that are easily debated, or blown away with BS.",
        "intTime": 20090310,
        "postID": 25,
        "quote": "Originally posted by scooter_mech: Wow! Makes me wonder what the good people at move on dot org think....ooops, my mind was stuck on \"sarcastic\" there for a moment. I question the advisability of giving antiwar.com any publicity. But that's just be me...",
        "reply": " Huber should be posting on opinions at Mil.com. Did he offend somebody? He raises some points in defiance of conventional wisdom. The kind that somebody should have been raising all along. But they aren't the kind of points that are easily debated, or blown away with BS.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 20:55:00",
        "title": "Operation Enduring Blunder",
        "userID": "popsiq"
    },
    {
        "content": "Yes, I'm sure the troops are there just to \"hang out\". Just aimlessly wandering around the desert, right? I find it more than a little disingenuous that someone with an obvious anti-war bent would pass himself off to know anything about military strategy. He sure knows how to criticize; I wonder what he would consider GOOD strategy... quote: --The Keystone Kollege of Armed Konflict Knowledge that all our generals seem to have attended doesn't place much importance on coherent strategy making, either. --Back in the day, all those four-stars would have kept smoke grenades handy so they'd have something to blow up the boss's skirt if he asked a hard question. --Like most military matters, the center of gravity concept is broadly misunderstood, especially among the military's top brass. --We don't know the enemy. --Blowing stuff up is the one thing Obama's generals know how to do real good. Then he DOES goes on to offer what he thinks is good military strategy: shake hands with the Taliban and go home. Wow, now that wouldn't enable and bolden those who hate Westerners, would it? In order to have a legitimate discussion about conventional or asymmetrical warfare, you have to post something legitimate.",
        "intTime": 20090310,
        "postID": 26,
        "quote": "--The Keystone Kollege of Armed Konflict Knowledge that all our generals seem to have attended doesn't place much importance on coherent strategy making, either. --Back in the day, all those four-stars would have kept smoke grenades handy so they'd have something to blow up the boss's skirt if he asked a hard question. --Like most military matters, the center of gravity concept is broadly misunderstood, especially among the military's top brass. --We don't know the enemy. --Blowing stuff up is the one thing Obama's generals know how to do real good.",
        "reply": "Yes, I'm sure the troops are there just to \"hang out\". Just aimlessly wandering around the desert, right? I find it more than a little disingenuous that someone with an obvious anti-war bent would pass himself off to know anything about military strategy. He sure knows how to criticize; I wonder what he would consider GOOD strategy...  Then he DOES goes on to offer what he thinks is good military strategy: shake hands with the Taliban and go home. Wow, now that wouldn't enable and bolden those who hate Westerners, would it? In order to have a legitimate discussion about conventional or asymmetrical warfare, you have to post something legitimate.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 21:48:00",
        "title": "Operation Enduring Blunder",
        "userID": "DCookeUSA1"
    },
    {
        "content": "I think the thing to do is just maintain enough troops there to make sure those tribes don't breed any organized force - for as long as it takes until those areas come up to the speed of the developed world - could be 20 years, could be 50 or 100. What we are doing is providing an environment where education and critical thinking is valued and encouraged.",
        "intTime": 20090310,
        "postID": 27,
        "quote": "",
        "reply": "I think the thing to do is just maintain enough troops there to make sure those tribes don't breed any organized force - for as long as it takes until those areas come up to the speed of the developed world - could be 20 years, could be 50 or 100. What we are doing is providing an environment where education and critical thinking is valued and encouraged.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 22:10:00",
        "title": "Operation Enduring Blunder",
        "userID": "DCookeUSA1"
    },
    {
        "content": "Huber was wrong about the Iraq Surge, so why should he be taken seriously now?",
        "intTime": 20090311,
        "postID": 28,
        "quote": "",
        "reply": "Huber was wrong about the Iraq Surge, so why should he be taken seriously now?",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 00:06:00",
        "title": "Operation Enduring Blunder",
        "userID": "LineDoggie"
    },
    {
        "content": "quote: Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know? Our illustrious Administration is using the words, moderate Taliban. You show me a moderate Taliban and I will show you that cheap bridge that I have for sale....Neither exists.",
        "intTime": 20090311,
        "postID": 29,
        "quote": "Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know?",
        "reply": " Our illustrious Administration is using the words, moderate Taliban. You show me a moderate Taliban and I will show you that cheap bridge that I have for sale....Neither exists.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 03:05:00",
        "title": "Operation Enduring Blunder",
        "userID": "dhd123"
    },
    {
        "content": "quote: Originally posted by scooter_mech: Wow! Makes me wonder what the good people at move on dot org think....ooops, my mind was stuck on \"sarcastic\" there for a moment. I question the advisability of giving antiwar.com any publicity. But that's just be me... I enjoyed your sarcasim scooter. With references like (quote)The Keystone Kollege of Armed Konflict Knowledge that all our generals seem to have attended doesn't place much importance on coherent strategy making, either.(quote) and from another article on the web site: (quote)Sen. John Kerry says the center of gravity in Afghanistan is in Pakistan. Let's hope Obama stays mindful of Kerry's track record vis-à-vis winning strategies.(quote) a real self proclaimed war hero--OMG, more sarcasim , do these folks deserve ANY CREDIBILITY? Isn't 'Freedom of Speach' a wonderful thing?",
        "intTime": 20090311,
        "postID": 30,
        "quote": "Originally posted by scooter_mech: Wow! Makes me wonder what the good people at move on dot org think....ooops, my mind was stuck on \"sarcastic\" there for a moment. I question the advisability of giving antiwar.com any publicity. But that's just be me...",
        "reply": " I enjoyed your sarcasim scooter. With references like (quote)The Keystone Kollege of Armed Konflict Knowledge that all our generals seem to have attended doesn't place much importance on coherent strategy making, either.(quote) and from another article on the web site: (quote)Sen. John Kerry says the center of gravity in Afghanistan is in Pakistan. Let's hope Obama stays mindful of Kerry's track record vis-à-vis winning strategies.(quote) a real self proclaimed war hero--OMG, more sarcasim , do these folks deserve ANY CREDIBILITY? Isn't 'Freedom of Speach' a wonderful thing?",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 06:15:00",
        "title": "Operation Enduring Blunder",
        "userID": "busnrete8"
    },
    {
        "content": "quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda.",
        "intTime": 20090311,
        "postID": 31,
        "quote": "Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now?",
        "reply": " Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 06:26:00",
        "title": "Operation Enduring Blunder",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by dhd123: quote: Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know? Our illustrious Administration is using the words, moderate Taliban. You show me a moderate Taliban and I will show you that cheap bridge that I have for sale....Neither exists. Actually what people CALL the Taliban does include moderates. Remember what is called the Taliban is a LARGE number of different groups and subgroups with leaders that vary from extremely religious to warloards out only for themselves to those that see the Taliban as the only alternative to lawlessness and corrupt government.",
        "intTime": 20090311,
        "postID": 32,
        "quote": "Originally posted by dhd123: quote: Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know? Our illustrious Administration is using the words, moderate Taliban. You show me a moderate Taliban and I will show you that cheap bridge that I have for sale....Neither exists.",
        "reply": " Actually what people CALL the Taliban does include moderates. Remember what is called the Taliban is a LARGE number of different groups and subgroups with leaders that vary from extremely religious to warloards out only for themselves to those that see the Taliban as the only alternative to lawlessness and corrupt government.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 06:30:00",
        "title": "Operation Enduring Blunder",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. After the invasion in 2003 the Iraqi military ceased to exist. In 2004 the Iraqi Army began to be rebuilt, but they lacked everything from vehicles to tanks to supplies of uniforms. In Iraqi I was on a training team under MNSTC-I, the other 3 star command there besides MNC-I. I lived and worked at an Iraqi regional training center. Over the course of the year I was there we graduated nearly 10,000 Iraqi soldiers from basic training, and we were just one of a dozen training centers. We also fielded tens of thousands of M-16s and M-4s, thousands of HMMWVs, over 10,000 SINCGARS variant radios, and had an operating CIF for uniforms and field gear. We built ranges, obstacle courses, live fire shoot houses, and many other things. By the time I left our basic training mission went from 1200-1500 soldiers per cycle to 300-400 because the divisions are at strength and they were not building new manuever units. One of the biggest successes was conducting actual Warfighter exercises on a battalion scale. We taught the staffs, COIN, and battle tracking. The surge provided the breathing room and security to build confidence in the Iraqi's own security forces. Like us they have an AVF, and they are not short of recruits. That is the success in Iraq. I met and worked with hundreds of young IA officers and soldiers that know their business. They have the training, they are capable, and now they are out doing it.",
        "intTime": 20090311,
        "postID": 33,
        "quote": "Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda.",
        "reply": " The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. After the invasion in 2003 the Iraqi military ceased to exist. In 2004 the Iraqi Army began to be rebuilt, but they lacked everything from vehicles to tanks to supplies of uniforms. In Iraqi I was on a training team under MNSTC-I, the other 3 star command there besides MNC-I. I lived and worked at an Iraqi regional training center. Over the course of the year I was there we graduated nearly 10,000 Iraqi soldiers from basic training, and we were just one of a dozen training centers. We also fielded tens of thousands of M-16s and M-4s, thousands of HMMWVs, over 10,000 SINCGARS variant radios, and had an operating CIF for uniforms and field gear. We built ranges, obstacle courses, live fire shoot houses, and many other things. By the time I left our basic training mission went from 1200-1500 soldiers per cycle to 300-400 because the divisions are at strength and they were not building new manuever units. One of the biggest successes was conducting actual Warfighter exercises on a battalion scale. We taught the staffs, COIN, and battle tracking. The surge provided the breathing room and security to build confidence in the Iraqi's own security forces. Like us they have an AVF, and they are not short of recruits. That is the success in Iraq. I met and worked with hundreds of young IA officers and soldiers that know their business. They have the training, they are capable, and now they are out doing it.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 07:13:00",
        "title": "Operation Enduring Blunder",
        "userID": "nspreitler"
    },
    {
        "content": "quote: Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know? Yeah. Imagine if we had simply talked to the good Nazis.",
        "intTime": 20090311,
        "postID": 34,
        "quote": "Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know?",
        "reply": " Yeah. Imagine if we had simply talked to the good Nazis.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 07:20:00",
        "title": "Operation Enduring Blunder",
        "userID": "M1Lase_n_Blaze"
    },
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. After the invasion in 2003 the Iraqi military ceased to exist. In 2004 the Iraqi Army began to be rebuilt, but they lacked everything from vehicles to tanks to supplies of uniforms. In Iraqi I was on a training team under MNSTC-I, the other 3 star command there besides MNC-I. I lived and worked at an Iraqi regional training center. Over the course of the year I was there we graduated nearly 10,000 Iraqi soldiers from basic training, and we were just one of a dozen training centers. We also fielded tens of thousands of M-16s and M-4s, thousands of HMMWVs, over 10,000 SINCGARS variant radios, and had an operating CIF for uniforms and field gear. We built ranges, obstacle courses, live fire shoot houses, and many other things. By the time I left our basic training mission went from 1200-1500 soldiers per cycle to 300-400 because the divisions are at strength and they were not building new manuever units. One of the biggest successes was conducting actual Warfighter exercises on a battalion scale. We taught the staffs, COIN, and battle tracking. The surge provided the breathing room and security to build confidence in the Iraqi's own security forces. Like us they have an AVF, and they are not short of recruits. That is the success in Iraq. I met and worked with hundreds of young IA officers and soldiers that know their business. They have the training, they are capable, and now they are out doing it. Absolutely concur. The increase in numbers allowed a greater permanent presence among the populace. Sort of like establishing permanent courts and local law enforcement instead of depending on US Marshalls and far flung Cavalry posts, tamed the US West.",
        "intTime": 20090311,
        "postID": 35,
        "quote": "Originally posted by nspreitler: quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. After the invasion in 2003 the Iraqi military ceased to exist. In 2004 the Iraqi Army began to be rebuilt, but they lacked everything from vehicles to tanks to supplies of uniforms. In Iraqi I was on a training team under MNSTC-I, the other 3 star command there besides MNC-I. I lived and worked at an Iraqi regional training center. Over the course of the year I was there we graduated nearly 10,000 Iraqi soldiers from basic training, and we were just one of a dozen training centers. We also fielded tens of thousands of M-16s and M-4s, thousands of HMMWVs, over 10,000 SINCGARS variant radios, and had an operating CIF for uniforms and field gear. We built ranges, obstacle courses, live fire shoot houses, and many other things. By the time I left our basic training mission went from 1200-1500 soldiers per cycle to 300-400 because the divisions are at strength and they were not building new manuever units. One of the biggest successes was conducting actual Warfighter exercises on a battalion scale. We taught the staffs, COIN, and battle tracking. The surge provided the breathing room and security to build confidence in the Iraqi's own security forces. Like us they have an AVF, and they are not short of recruits. That is the success in Iraq. I met and worked with hundreds of young IA officers and soldiers that know their business. They have the training, they are capable, and now they are out doing it.",
        "reply": " Absolutely concur. The increase in numbers allowed a greater permanent presence among the populace. Sort of like establishing permanent courts and local law enforcement instead of depending on US Marshalls and far flung Cavalry posts, tamed the US West.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 07:26:00",
        "title": "Operation Enduring Blunder",
        "userID": "M1Lase_n_Blaze"
    },
    {
        "content": "quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? How so? Is Iraq at peace and nobody told us? You will announce the BIG parade won't you?",
        "intTime": 20090311,
        "postID": 36,
        "quote": "Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now?",
        "reply": " How so? Is Iraq at peace and nobody told us? You will announce the BIG parade won't you?",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 14:08:00",
        "title": "Operation Enduring Blunder",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. -snip-. nspreitler I did NOT say the surge did not help I said \"the surge was NOT the biggest factor in the improvement in Iraq\". The surge was for the Baghdad area NOT Iraq as a whole. I think the evidence shows quite clearly that convincing the Sunni tribal leaders to shift to fighting Al Queada for the US rather helping Al Quaeda fight the US and the US backed Iraqi government had a much bigger impact on Iraq as a whole than the surge. This message has been edited. Last edited by: rayld2, Thu 12 March 2009 09:15 AM",
        "intTime": 20090312,
        "postID": 37,
        "quote": "Originally posted by nspreitler: quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. -snip-.",
        "reply": " nspreitler I did NOT say the surge did not help I said \"the surge was NOT the biggest factor in the improvement in Iraq\". The surge was for the Baghdad area NOT Iraq as a whole. I think the evidence shows quite clearly that convincing the Sunni tribal leaders to shift to fighting Al Queada for the US rather helping Al Quaeda fight the US and the US backed Iraqi government had a much bigger impact on Iraq as a whole than the surge. This message has been edited. Last edited by: rayld2, Thu 12 March 2009 09:15 AM",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-12 06:15:00",
        "title": "Operation Enduring Blunder",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by nspreitler: quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. -snip-. nspreitler I did NOT say the surge did not help I said \"he surge was NOT the biggest factor in the improvement in Iraq\". The surge was for the Baghdad area NOT Iraq as a whole. I think the evidence shows quite clearly that convincing the Sunni tribal leaders to shift to fighting Al Queada for the US rather helping Al Quaeda fight the US and the US backed Iraqi government had a much bigger impact on Iraq as a whole than the surge. The Sons of Iraq did help in Sunni areas. In Baghdad it was the Shia Mahdi Army that was the biggest threat. About this time last year the IZ had earned its name as the \"Impact Zone\" because of all the ortars and rockets being lobbed at it. After the offensive operation in April and May that area has become much safer. That was a combined US and Iraqi offensive. There is no doubt that the application of counterinsurgency tactics worked very well. It also increased the number of advisors. Where I was every Iraqi manuever battalion had a MiTT with it. Once Sadr City was calmed down the breathing room in Baghdad allowed us to rotate Iraqi units off the line and conduct training. The success of the MiTTs is probably the biggest lesson of Iraq.",
        "intTime": 20090312,
        "postID": 38,
        "quote": "Originally posted by rayld2: quote: Originally posted by nspreitler: quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. -snip-. nspreitler I did NOT say the surge did not help I said \"he surge was NOT the biggest factor in the improvement in Iraq\". The surge was for the Baghdad area NOT Iraq as a whole. I think the evidence shows quite clearly that convincing the Sunni tribal leaders to shift to fighting Al Queada for the US rather helping Al Quaeda fight the US and the US backed Iraqi government had a much bigger impact on Iraq as a whole than the surge.",
        "reply": " The Sons of Iraq did help in Sunni areas. In Baghdad it was the Shia Mahdi Army that was the biggest threat. About this time last year the IZ had earned its name as the \"Impact Zone\" because of all the ortars and rockets being lobbed at it. After the offensive operation in April and May that area has become much safer. That was a combined US and Iraqi offensive. There is no doubt that the application of counterinsurgency tactics worked very well. It also increased the number of advisors. Where I was every Iraqi manuever battalion had a MiTT with it. Once Sadr City was calmed down the breathing room in Baghdad allowed us to rotate Iraqi units off the line and conduct training. The success of the MiTTs is probably the biggest lesson of Iraq.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-12 06:51:00",
        "title": "Operation Enduring Blunder",
        "userID": "nspreitler"
    },
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? How so? Is Iraq at peace and nobody told us? You will announce the BIG parade won't you? Sure thing, but it's only open to those who participated, not to sideline hecklers Though I suppose your cheering on for a US loss counts",
        "intTime": 20090312,
        "postID": 39,
        "quote": "Originally posted by popsiq: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? How so? Is Iraq at peace and nobody told us? You will announce the BIG parade won't you?",
        "reply": " Sure thing, but it's only open to those who participated, not to sideline hecklers Though I suppose your cheering on for a US loss counts",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-12 07:39:00",
        "title": "Operation Enduring Blunder",
        "userID": "LineDoggie"
    },
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by popsiq: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? How so? Is Iraq at peace and nobody told us? You will announce the BIG parade won't you? Sure thing, but it's only open to those who participated, not to sideline hecklers Though I suppose your cheering on for a US loss counts",
        "intTime": 20090312,
        "postID": 40,
        "quote": "Originally posted by LineDoggie: quote: Originally posted by popsiq: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? How so? Is Iraq at peace and nobody told us? You will announce the BIG parade won't you? Sure thing, but it's only open to those who participated, not to sideline hecklers Though I suppose your cheering on for a US loss counts",
        "reply": "",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-12 07:46:00",
        "title": "Operation Enduring Blunder",
        "userID": "M1Lase_n_Blaze"
    },
    {
        "content": ">http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know?",
        "intTime": 20090310,
        "postID": 41,
        "quote": "",
        "reply": ">http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know?",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 19:24:00",
        "title": "Operation Enduring Blunder",
        "userID": "popsiq"
    },
    {
        "content": "Wow! Makes me wonder what the good people at move on dot org think....ooops, my mind was stuck on \"sarcastic\" there for a moment. I question the advisability of giving antiwar.com any publicity. But that's just be me...",
        "intTime": 20090310,
        "postID": 42,
        "quote": "",
        "reply": "Wow! Makes me wonder what the good people at move on dot org think....ooops, my mind was stuck on \"sarcastic\" there for a moment. I question the advisability of giving antiwar.com any publicity. But that's just be me...",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 19:45:00",
        "title": "Operation Enduring Blunder",
        "userID": "scooter_mech"
    },
    {
        "content": "quote: Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know? Say, Pops, What do you think of the latest development regarding Gen. Leslie's comments on the Canadian Army at this thread? \"thread post about Canadian Army needing to regroup\" at the British and Commonwealth forum of military.com I would have PM'ed/e-mailed, but no one ever seems to get my PMs.",
        "intTime": 20090310,
        "postID": 43,
        "quote": "Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know?",
        "reply": " Say, Pops, What do you think of the latest development regarding Gen. Leslie's comments on the Canadian Army at this thread? \"thread post about Canadian Army needing to regroup\" at the British and Commonwealth forum of military.com I would have PM'ed/e-mailed, but no one ever seems to get my PMs.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 19:57:00",
        "title": "Operation Enduring Blunder",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "I have never read Clausewitz , ?I was more interested in \"asymetrical\" warefare, all without a \"center of gravity\" that we could actually direct all our forces. aS ALL MY ADULT LIFE, WE HAVE HAD ONLY ASYM,ETRICAL WARFARE, IMPOSED EITHER BY THE enemy or THE fAT tED WING OF THE Congress. With no center of gravity, what do Clausewitz and SunTsu advise. I know what the Comanche and Apschy War Chiefs did and what beat them.......",
        "intTime": 20090310,
        "postID": 44,
        "quote": "",
        "reply": "I have never read Clausewitz , ?I was more interested in \"asymetrical\" warefare, all without a \"center of gravity\" that we could actually direct all our forces. aS ALL MY ADULT LIFE, WE HAVE HAD ONLY ASYM,ETRICAL WARFARE, IMPOSED EITHER BY THE enemy or THE fAT tED WING OF THE Congress. With no center of gravity, what do Clausewitz and SunTsu advise. I know what the Comanche and Apschy War Chiefs did and what beat them.......",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 20:05:00",
        "title": "Operation Enduring Blunder",
        "userID": "peter3_1"
    },
    {
        "content": "quote: Originally posted by scooter_mech: Wow! Makes me wonder what the good people at move on dot org think....ooops, my mind was stuck on \"sarcastic\" there for a moment. I question the advisability of giving antiwar.com any publicity. But that's just be me... Huber should be posting on opinions at Mil.com. Did he offend somebody? He raises some points in defiance of conventional wisdom. The kind that somebody should have been raising all along. But they aren't the kind of points that are easily debated, or blown away with BS.",
        "intTime": 20090310,
        "postID": 45,
        "quote": "Originally posted by scooter_mech: Wow! Makes me wonder what the good people at move on dot org think....ooops, my mind was stuck on \"sarcastic\" there for a moment. I question the advisability of giving antiwar.com any publicity. But that's just be me...",
        "reply": " Huber should be posting on opinions at Mil.com. Did he offend somebody? He raises some points in defiance of conventional wisdom. The kind that somebody should have been raising all along. But they aren't the kind of points that are easily debated, or blown away with BS.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 20:55:00",
        "title": "Operation Enduring Blunder",
        "userID": "popsiq"
    },
    {
        "content": "Yes, I'm sure the troops are there just to \"hang out\". Just aimlessly wandering around the desert, right? I find it more than a little disingenuous that someone with an obvious anti-war bent would pass himself off to know anything about military strategy. He sure knows how to criticize; I wonder what he would consider GOOD strategy... quote: --The Keystone Kollege of Armed Konflict Knowledge that all our generals seem to have attended doesn't place much importance on coherent strategy making, either. --Back in the day, all those four-stars would have kept smoke grenades handy so they'd have something to blow up the boss's skirt if he asked a hard question. --Like most military matters, the center of gravity concept is broadly misunderstood, especially among the military's top brass. --We don't know the enemy. --Blowing stuff up is the one thing Obama's generals know how to do real good. Then he DOES goes on to offer what he thinks is good military strategy: shake hands with the Taliban and go home. Wow, now that wouldn't enable and bolden those who hate Westerners, would it? In order to have a legitimate discussion about conventional or asymmetrical warfare, you have to post something legitimate.",
        "intTime": 20090310,
        "postID": 46,
        "quote": "--The Keystone Kollege of Armed Konflict Knowledge that all our generals seem to have attended doesn't place much importance on coherent strategy making, either. --Back in the day, all those four-stars would have kept smoke grenades handy so they'd have something to blow up the boss's skirt if he asked a hard question. --Like most military matters, the center of gravity concept is broadly misunderstood, especially among the military's top brass. --We don't know the enemy. --Blowing stuff up is the one thing Obama's generals know how to do real good.",
        "reply": "Yes, I'm sure the troops are there just to \"hang out\". Just aimlessly wandering around the desert, right? I find it more than a little disingenuous that someone with an obvious anti-war bent would pass himself off to know anything about military strategy. He sure knows how to criticize; I wonder what he would consider GOOD strategy...  Then he DOES goes on to offer what he thinks is good military strategy: shake hands with the Taliban and go home. Wow, now that wouldn't enable and bolden those who hate Westerners, would it? In order to have a legitimate discussion about conventional or asymmetrical warfare, you have to post something legitimate.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 21:48:00",
        "title": "Operation Enduring Blunder",
        "userID": "DCookeUSA1"
    },
    {
        "content": "I think the thing to do is just maintain enough troops there to make sure those tribes don't breed any organized force - for as long as it takes until those areas come up to the speed of the developed world - could be 20 years, could be 50 or 100. What we are doing is providing an environment where education and critical thinking is valued and encouraged.",
        "intTime": 20090310,
        "postID": 47,
        "quote": "",
        "reply": "I think the thing to do is just maintain enough troops there to make sure those tribes don't breed any organized force - for as long as it takes until those areas come up to the speed of the developed world - could be 20 years, could be 50 or 100. What we are doing is providing an environment where education and critical thinking is valued and encouraged.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-10 22:10:00",
        "title": "Operation Enduring Blunder",
        "userID": "DCookeUSA1"
    },
    {
        "content": "Huber was wrong about the Iraq Surge, so why should he be taken seriously now?",
        "intTime": 20090311,
        "postID": 48,
        "quote": "",
        "reply": "Huber was wrong about the Iraq Surge, so why should he be taken seriously now?",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 00:06:00",
        "title": "Operation Enduring Blunder",
        "userID": "LineDoggie"
    },
    {
        "content": "quote: Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know? Our illustrious Administration is using the words, moderate Taliban. You show me a moderate Taliban and I will show you that cheap bridge that I have for sale....Neither exists.",
        "intTime": 20090311,
        "postID": 49,
        "quote": "Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know?",
        "reply": " Our illustrious Administration is using the words, moderate Taliban. You show me a moderate Taliban and I will show you that cheap bridge that I have for sale....Neither exists.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 03:05:00",
        "title": "Operation Enduring Blunder",
        "userID": "dhd123"
    },
    {
        "content": "quote: Originally posted by scooter_mech: Wow! Makes me wonder what the good people at move on dot org think....ooops, my mind was stuck on \"sarcastic\" there for a moment. I question the advisability of giving antiwar.com any publicity. But that's just be me... I enjoyed your sarcasim scooter. With references like (quote)The Keystone Kollege of Armed Konflict Knowledge that all our generals seem to have attended doesn't place much importance on coherent strategy making, either.(quote) and from another article on the web site: (quote)Sen. John Kerry says the center of gravity in Afghanistan is in Pakistan. Let's hope Obama stays mindful of Kerry's track record vis-à-vis winning strategies.(quote) a real self proclaimed war hero--OMG, more sarcasim , do these folks deserve ANY CREDIBILITY? Isn't 'Freedom of Speach' a wonderful thing?",
        "intTime": 20090311,
        "postID": 50,
        "quote": "Originally posted by scooter_mech: Wow! Makes me wonder what the good people at move on dot org think....ooops, my mind was stuck on \"sarcastic\" there for a moment. I question the advisability of giving antiwar.com any publicity. But that's just be me...",
        "reply": " I enjoyed your sarcasim scooter. With references like (quote)The Keystone Kollege of Armed Konflict Knowledge that all our generals seem to have attended doesn't place much importance on coherent strategy making, either.(quote) and from another article on the web site: (quote)Sen. John Kerry says the center of gravity in Afghanistan is in Pakistan. Let's hope Obama stays mindful of Kerry's track record vis-à-vis winning strategies.(quote) a real self proclaimed war hero--OMG, more sarcasim , do these folks deserve ANY CREDIBILITY? Isn't 'Freedom of Speach' a wonderful thing?",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 06:15:00",
        "title": "Operation Enduring Blunder",
        "userID": "busnrete8"
    },
    {
        "content": "quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda.",
        "intTime": 20090311,
        "postID": 51,
        "quote": "Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now?",
        "reply": " Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 06:26:00",
        "title": "Operation Enduring Blunder",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by dhd123: quote: Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know? Our illustrious Administration is using the words, moderate Taliban. You show me a moderate Taliban and I will show you that cheap bridge that I have for sale....Neither exists. Actually what people CALL the Taliban does include moderates. Remember what is called the Taliban is a LARGE number of different groups and subgroups with leaders that vary from extremely religious to warloards out only for themselves to those that see the Taliban as the only alternative to lawlessness and corrupt government.",
        "intTime": 20090311,
        "postID": 52,
        "quote": "Originally posted by dhd123: quote: Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know? Our illustrious Administration is using the words, moderate Taliban. You show me a moderate Taliban and I will show you that cheap bridge that I have for sale....Neither exists.",
        "reply": " Actually what people CALL the Taliban does include moderates. Remember what is called the Taliban is a LARGE number of different groups and subgroups with leaders that vary from extremely religious to warloards out only for themselves to those that see the Taliban as the only alternative to lawlessness and corrupt government.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 06:30:00",
        "title": "Operation Enduring Blunder",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. After the invasion in 2003 the Iraqi military ceased to exist. In 2004 the Iraqi Army began to be rebuilt, but they lacked everything from vehicles to tanks to supplies of uniforms. In Iraqi I was on a training team under MNSTC-I, the other 3 star command there besides MNC-I. I lived and worked at an Iraqi regional training center. Over the course of the year I was there we graduated nearly 10,000 Iraqi soldiers from basic training, and we were just one of a dozen training centers. We also fielded tens of thousands of M-16s and M-4s, thousands of HMMWVs, over 10,000 SINCGARS variant radios, and had an operating CIF for uniforms and field gear. We built ranges, obstacle courses, live fire shoot houses, and many other things. By the time I left our basic training mission went from 1200-1500 soldiers per cycle to 300-400 because the divisions are at strength and they were not building new manuever units. One of the biggest successes was conducting actual Warfighter exercises on a battalion scale. We taught the staffs, COIN, and battle tracking. The surge provided the breathing room and security to build confidence in the Iraqi's own security forces. Like us they have an AVF, and they are not short of recruits. That is the success in Iraq. I met and worked with hundreds of young IA officers and soldiers that know their business. They have the training, they are capable, and now they are out doing it.",
        "intTime": 20090311,
        "postID": 53,
        "quote": "Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda.",
        "reply": " The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. After the invasion in 2003 the Iraqi military ceased to exist. In 2004 the Iraqi Army began to be rebuilt, but they lacked everything from vehicles to tanks to supplies of uniforms. In Iraqi I was on a training team under MNSTC-I, the other 3 star command there besides MNC-I. I lived and worked at an Iraqi regional training center. Over the course of the year I was there we graduated nearly 10,000 Iraqi soldiers from basic training, and we were just one of a dozen training centers. We also fielded tens of thousands of M-16s and M-4s, thousands of HMMWVs, over 10,000 SINCGARS variant radios, and had an operating CIF for uniforms and field gear. We built ranges, obstacle courses, live fire shoot houses, and many other things. By the time I left our basic training mission went from 1200-1500 soldiers per cycle to 300-400 because the divisions are at strength and they were not building new manuever units. One of the biggest successes was conducting actual Warfighter exercises on a battalion scale. We taught the staffs, COIN, and battle tracking. The surge provided the breathing room and security to build confidence in the Iraqi's own security forces. Like us they have an AVF, and they are not short of recruits. That is the success in Iraq. I met and worked with hundreds of young IA officers and soldiers that know their business. They have the training, they are capable, and now they are out doing it.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 07:13:00",
        "title": "Operation Enduring Blunder",
        "userID": "nspreitler"
    },
    {
        "content": "quote: Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know? Yeah. Imagine if we had simply talked to the good Nazis.",
        "intTime": 20090311,
        "postID": 54,
        "quote": "Originally posted by popsiq: >http://www.antiwar.com/orig/huber.php?articleid=14375 Jeff Huber's take on the 'new' improved Afghan 'strategy'. It makes talking to the Taliban look like a stroke of genius. Question is which Taliban and how would one know?",
        "reply": " Yeah. Imagine if we had simply talked to the good Nazis.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 07:20:00",
        "title": "Operation Enduring Blunder",
        "userID": "M1Lase_n_Blaze"
    },
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. After the invasion in 2003 the Iraqi military ceased to exist. In 2004 the Iraqi Army began to be rebuilt, but they lacked everything from vehicles to tanks to supplies of uniforms. In Iraqi I was on a training team under MNSTC-I, the other 3 star command there besides MNC-I. I lived and worked at an Iraqi regional training center. Over the course of the year I was there we graduated nearly 10,000 Iraqi soldiers from basic training, and we were just one of a dozen training centers. We also fielded tens of thousands of M-16s and M-4s, thousands of HMMWVs, over 10,000 SINCGARS variant radios, and had an operating CIF for uniforms and field gear. We built ranges, obstacle courses, live fire shoot houses, and many other things. By the time I left our basic training mission went from 1200-1500 soldiers per cycle to 300-400 because the divisions are at strength and they were not building new manuever units. One of the biggest successes was conducting actual Warfighter exercises on a battalion scale. We taught the staffs, COIN, and battle tracking. The surge provided the breathing room and security to build confidence in the Iraqi's own security forces. Like us they have an AVF, and they are not short of recruits. That is the success in Iraq. I met and worked with hundreds of young IA officers and soldiers that know their business. They have the training, they are capable, and now they are out doing it. Absolutely concur. The increase in numbers allowed a greater permanent presence among the populace. Sort of like establishing permanent courts and local law enforcement instead of depending on US Marshalls and far flung Cavalry posts, tamed the US West.",
        "intTime": 20090311,
        "postID": 55,
        "quote": "Originally posted by nspreitler: quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. After the invasion in 2003 the Iraqi military ceased to exist. In 2004 the Iraqi Army began to be rebuilt, but they lacked everything from vehicles to tanks to supplies of uniforms. In Iraqi I was on a training team under MNSTC-I, the other 3 star command there besides MNC-I. I lived and worked at an Iraqi regional training center. Over the course of the year I was there we graduated nearly 10,000 Iraqi soldiers from basic training, and we were just one of a dozen training centers. We also fielded tens of thousands of M-16s and M-4s, thousands of HMMWVs, over 10,000 SINCGARS variant radios, and had an operating CIF for uniforms and field gear. We built ranges, obstacle courses, live fire shoot houses, and many other things. By the time I left our basic training mission went from 1200-1500 soldiers per cycle to 300-400 because the divisions are at strength and they were not building new manuever units. One of the biggest successes was conducting actual Warfighter exercises on a battalion scale. We taught the staffs, COIN, and battle tracking. The surge provided the breathing room and security to build confidence in the Iraqi's own security forces. Like us they have an AVF, and they are not short of recruits. That is the success in Iraq. I met and worked with hundreds of young IA officers and soldiers that know their business. They have the training, they are capable, and now they are out doing it.",
        "reply": " Absolutely concur. The increase in numbers allowed a greater permanent presence among the populace. Sort of like establishing permanent courts and local law enforcement instead of depending on US Marshalls and far flung Cavalry posts, tamed the US West.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 07:26:00",
        "title": "Operation Enduring Blunder",
        "userID": "M1Lase_n_Blaze"
    },
    {
        "content": "quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? How so? Is Iraq at peace and nobody told us? You will announce the BIG parade won't you?",
        "intTime": 20090311,
        "postID": 56,
        "quote": "Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now?",
        "reply": " How so? Is Iraq at peace and nobody told us? You will announce the BIG parade won't you?",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-11 14:08:00",
        "title": "Operation Enduring Blunder",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. -snip-. nspreitler I did NOT say the surge did not help I said \"the surge was NOT the biggest factor in the improvement in Iraq\". The surge was for the Baghdad area NOT Iraq as a whole. I think the evidence shows quite clearly that convincing the Sunni tribal leaders to shift to fighting Al Queada for the US rather helping Al Quaeda fight the US and the US backed Iraqi government had a much bigger impact on Iraq as a whole than the surge. This message has been edited. Last edited by: rayld2, Thu 12 March 2009 09:15 AM",
        "intTime": 20090312,
        "postID": 57,
        "quote": "Originally posted by nspreitler: quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. -snip-.",
        "reply": " nspreitler I did NOT say the surge did not help I said \"the surge was NOT the biggest factor in the improvement in Iraq\". The surge was for the Baghdad area NOT Iraq as a whole. I think the evidence shows quite clearly that convincing the Sunni tribal leaders to shift to fighting Al Queada for the US rather helping Al Quaeda fight the US and the US backed Iraqi government had a much bigger impact on Iraq as a whole than the surge. This message has been edited. Last edited by: rayld2, Thu 12 March 2009 09:15 AM",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-12 06:15:00",
        "title": "Operation Enduring Blunder",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by nspreitler: quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. -snip-. nspreitler I did NOT say the surge did not help I said \"he surge was NOT the biggest factor in the improvement in Iraq\". The surge was for the Baghdad area NOT Iraq as a whole. I think the evidence shows quite clearly that convincing the Sunni tribal leaders to shift to fighting Al Queada for the US rather helping Al Quaeda fight the US and the US backed Iraqi government had a much bigger impact on Iraq as a whole than the surge. The Sons of Iraq did help in Sunni areas. In Baghdad it was the Shia Mahdi Army that was the biggest threat. About this time last year the IZ had earned its name as the \"Impact Zone\" because of all the ortars and rockets being lobbed at it. After the offensive operation in April and May that area has become much safer. That was a combined US and Iraqi offensive. There is no doubt that the application of counterinsurgency tactics worked very well. It also increased the number of advisors. Where I was every Iraqi manuever battalion had a MiTT with it. Once Sadr City was calmed down the breathing room in Baghdad allowed us to rotate Iraqi units off the line and conduct training. The success of the MiTTs is probably the biggest lesson of Iraq.",
        "intTime": 20090312,
        "postID": 58,
        "quote": "Originally posted by rayld2: quote: Originally posted by nspreitler: quote: Originally posted by rayld2: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? Of course you realise that the surge was NOT the biggest factor in the improvement in Iraq (no matter what the Pol spin said) it was the FACT that the US had started following the Counter Insurgency Manual and took advantage of an Al Quaeda mistake (attacking Sunni tribal members in an effort to grab control from local tribal leaders) and shifted the Sunni forces fighing the US to fighting for the US against Al Quaeda. The surge did work. I was there in Baghdad from November 07 to Feb 09, and I saw the difference in places like Sadr City first hand. In conjunction with the surge the biggest shift was in th ability of the Iraqi Army and Police to conduct operations on their own or with limited assistance. -snip-. nspreitler I did NOT say the surge did not help I said \"he surge was NOT the biggest factor in the improvement in Iraq\". The surge was for the Baghdad area NOT Iraq as a whole. I think the evidence shows quite clearly that convincing the Sunni tribal leaders to shift to fighting Al Queada for the US rather helping Al Quaeda fight the US and the US backed Iraqi government had a much bigger impact on Iraq as a whole than the surge.",
        "reply": " The Sons of Iraq did help in Sunni areas. In Baghdad it was the Shia Mahdi Army that was the biggest threat. About this time last year the IZ had earned its name as the \"Impact Zone\" because of all the ortars and rockets being lobbed at it. After the offensive operation in April and May that area has become much safer. That was a combined US and Iraqi offensive. There is no doubt that the application of counterinsurgency tactics worked very well. It also increased the number of advisors. Where I was every Iraqi manuever battalion had a MiTT with it. Once Sadr City was calmed down the breathing room in Baghdad allowed us to rotate Iraqi units off the line and conduct training. The success of the MiTTs is probably the biggest lesson of Iraq.",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-12 06:51:00",
        "title": "Operation Enduring Blunder",
        "userID": "nspreitler"
    },
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? How so? Is Iraq at peace and nobody told us? You will announce the BIG parade won't you? Sure thing, but it's only open to those who participated, not to sideline hecklers Though I suppose your cheering on for a US loss counts",
        "intTime": 20090312,
        "postID": 59,
        "quote": "Originally posted by popsiq: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? How so? Is Iraq at peace and nobody told us? You will announce the BIG parade won't you?",
        "reply": " Sure thing, but it's only open to those who participated, not to sideline hecklers Though I suppose your cheering on for a US loss counts",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-12 07:39:00",
        "title": "Operation Enduring Blunder",
        "userID": "LineDoggie"
    },
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by popsiq: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? How so? Is Iraq at peace and nobody told us? You will announce the BIG parade won't you? Sure thing, but it's only open to those who participated, not to sideline hecklers Though I suppose your cheering on for a US loss counts",
        "intTime": 20090312,
        "postID": 60,
        "quote": "Originally posted by LineDoggie: quote: Originally posted by popsiq: quote: Originally posted by LineDoggie: Huber was wrong about the Iraq Surge, so why should he be taken seriously now? How so? Is Iraq at peace and nobody told us? You will announce the BIG parade won't you? Sure thing, but it's only open to those who participated, not to sideline hecklers Though I suppose your cheering on for a US loss counts",
        "reply": "",
        "threadID": "672198221_8730005712001",
        "time": "2009-03-12 07:46:00",
        "title": "Operation Enduring Blunder",
        "userID": "M1Lase_n_Blaze"
    }
]