[
    {
        "content": "Quite a tragedy. ++http://news.yahoo.com/s/ap/as_indonesia_plane_crash quote: 98 killed in Indonesian military plane crash By Agus Basuki, Associated Press Writer Yahoo! News 36 mins ago MAGETAN, Indonesia – An Indonesian military plane carrying troops and their families crashed into a row of houses and burst into flames Wednesday, killing at least 98 people, the latest in a string of accidents plaguing the beleaguered air force. Black smoke billowed in the air as soldiers carried the injured past the burning wreckage of the C-130 Hercules — its tail resting upside down in a rice paddy and the rest of the fuselage scattered and charred. Military spokesman Sagom Tamboen said the transport plane plunged to the ground near an air force base in East Java province, slamming into a residential neighborhood and then skidding into a field. It was not clear what caused the crash, but air force spokesman Bambang Sulistyo said the plane was nearly 30 years old and several witnesses described seeing its right wing fall off while it was still in the air. (...) About 40 more were delivered over the next 20 years, many secondhand and provided by Washington before the Clinton administration imposed sanctions on military deliveries because of violence that broke out during East Timor's 1999 break for independence. The air force complained that many of the planes quickly became unserviceable because of the lack of spare parts. Though the embargo was lifted several years ago, the air worthiness of many is still in question. Tamboen promised a full investigation of all military aircraft. There have also been a series of commercial airline crashes in recent years, killing more than 120 people. The EU responded by banning all Indonesian carriers from flying to Europe...", 
        "intTime": 20090520, 
        "postID": 1, 
        "quote": "98 killed in Indonesian military plane crash By Agus Basuki, Associated Press Writer Yahoo! News 36 mins ago MAGETAN, Indonesia – An Indonesian military plane carrying troops and their families crashed into a row of houses and burst into flames Wednesday, killing at least 98 people, the latest in a string of accidents plaguing the beleaguered air force. Black smoke billowed in the air as soldiers carried the injured past the burning wreckage of the C-130 Hercules — its tail resting upside down in a rice paddy and the rest of the fuselage scattered and charred. Military spokesman Sagom Tamboen said the transport plane plunged to the ground near an air force base in East Java province, slamming into a residential neighborhood and then skidding into a field. It was not clear what caused the crash, but air force spokesman Bambang Sulistyo said the plane was nearly 30 years old and several witnesses described seeing its right wing fall off while it was still in the air. (...) About 40 more were delivered over the next 20 years, many secondhand and provided by Washington before the Clinton administration imposed sanctions on military deliveries because of violence that broke out during East Timor's 1999 break for independence. The air force complained that many of the planes quickly became unserviceable because of the lack of spare parts. Though the embargo was lifted several years ago, the air worthiness of many is still in question. Tamboen promised a full investigation of all military aircraft. There have also been a series of commercial airline crashes in recent years, killing more than 120 people. The EU responded by banning all Indonesian carriers from flying to Europe...", 
        "reply": "Quite a tragedy. ++http://news.yahoo.com/s/ap/as_indonesia_plane_crash ", 
        "threadID": "672198221_7270037322001", 
        "time": "2009-05-20 05:45:00", 
        "title": "Indonesian C130 crash kills 98", 
        "userID": "Canuck_Centaur"
    }
]