[
    {
        "content": "How's your dry wall! \"http://news.yahoo.com/s/ap/20090411/ap_on_bi_ge/chinese_drywall", 
        "intTime": 20090411, 
        "postID": 1, 
        "quote": "", 
        "reply": "How's your dry wall! \"http://news.yahoo.com/s/ap/20090411/ap_on_bi_ge/chinese_drywall", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 14:35:00", 
        "title": "China invades", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: How's your dry wall! \"http://news.yahoo.com/s/ap/20090411/ap_on_bi_ge/chinese_drywall Better than my asbestos \"popcorn\" ceiling... LOL Respectfully, SUNLINER81", 
        "intTime": 20090411, 
        "postID": 2, 
        "quote": "Originally posted by EAG154: How's your dry wall! \"http://news.yahoo.com/s/ap/20090411/ap_on_bi_ge/chinese_drywall", 
        "reply": " Better than my asbestos \"popcorn\" ceiling... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 14:47:00", 
        "title": "China invades", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81", 
        "intTime": 20090411, 
        "postID": 3, 
        "quote": "", 
        "reply": "Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 14:55:00", 
        "title": "China invades", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same? One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090411, 
        "postID": 4, 
        "quote": "Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81", 
        "reply": " yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same? One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 14:59:00", 
        "title": "China invades", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by EAG154: How's your dry wall! \"http://news.yahoo.com/s/ap/20090411/ap_on_bi_ge/chinese_drywall Better than my asbestos \"popcorn\" ceiling... LOL Respectfully, SUNLINER81 Not really, asbo really doesn't cause any harm to health unless it is disturbed, thus releasing its fibers. Most popcorn ceilings are friable, but they usually put a hardcoat over it. So, your ceilings aren't a problem unless you are planning on breaking it up. Just a little fun fact. There is asbestos fibers found in the air in every major city. Asbestos abatement workers who are removing asbestos inside a containment usually record lower fiber counts within the containment than what is present outside of containment. Even their excursion samples are lower (excursion samples are taken when fiber counts within containment are at their highest level). So, the amount of asbo fibers that you breath are more than the amount of a asbestos worker who is breaking up and removing asbo within containment. The drywall in this case is releasing chemical and those chemicals are thus able to react with other things. If these chemicals find the right combination, that could mean an immediate danger to life will be present. That is not something that happens with asbo.", 
        "intTime": 20090411, 
        "postID": 5, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by EAG154: How's your dry wall! \"http://news.yahoo.com/s/ap/20090411/ap_on_bi_ge/chinese_drywall Better than my asbestos \"popcorn\" ceiling... LOL Respectfully, SUNLINER81", 
        "reply": " Not really, asbo really doesn't cause any harm to health unless it is disturbed, thus releasing its fibers. Most popcorn ceilings are friable, but they usually put a hardcoat over it. So, your ceilings aren't a problem unless you are planning on breaking it up. Just a little fun fact. There is asbestos fibers found in the air in every major city. Asbestos abatement workers who are removing asbestos inside a containment usually record lower fiber counts within the containment than what is present outside of containment. Even their excursion samples are lower (excursion samples are taken when fiber counts within containment are at their highest level). So, the amount of asbo fibers that you breath are more than the amount of a asbestos worker who is breaking up and removing asbo within containment. The drywall in this case is releasing chemical and those chemicals are thus able to react with other things. If these chemicals find the right combination, that could mean an immediate danger to life will be present. That is not something that happens with asbo.", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 15:00:00", 
        "title": "China invades", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same? That was my point, the PRC does seem to be slowly and deliberately planning an attack, economically and or militarily on the U.S.... It's like all the warnings that we had before Pearl Harbor but no one had the cajones to actually take preemptive action... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090411, 
        "postID": 6, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same?", 
        "reply": " That was my point, the PRC does seem to be slowly and deliberately planning an attack, economically and or militarily on the U.S.... It's like all the warnings that we had before Pearl Harbor but no one had the cajones to actually take preemptive action... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 15:05:00", 
        "title": "China invades", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: quote: Originally posted by SUNLINER81: quote: Originally posted by EAG154: How's your dry wall! \"http://news.yahoo.com/s/ap/20090411/ap_on_bi_ge/chinese_drywall Better than my asbestos \"popcorn\" ceiling... LOL Respectfully, SUNLINER81 Not really, asbo really doesn't cause any harm to health unless it is disturbed, thus releasing its fibers. Most popcorn ceilings are friable, but they usually put a hardcoat over it. So, your ceilings aren't a problem unless you are planning on breaking it up. Actually, you can \"wet\" it down and then remove it safely, provided you still use a respirator or so I have been told... Respectfully, SUNLINER81", 
        "intTime": 20090411, 
        "postID": 7, 
        "quote": "Originally posted by 10tenths: quote: Originally posted by SUNLINER81: quote: Originally posted by EAG154: How's your dry wall! \"http://news.yahoo.com/s/ap/20090411/ap_on_bi_ge/chinese_drywall Better than my asbestos \"popcorn\" ceiling... LOL Respectfully, SUNLINER81 Not really, asbo really doesn't cause any harm to health unless it is disturbed, thus releasing its fibers. Most popcorn ceilings are friable, but they usually put a hardcoat over it. So, your ceilings aren't a problem unless you are planning on breaking it up.", 
        "reply": " Actually, you can \"wet\" it down and then remove it safely, provided you still use a respirator or so I have been told... Respectfully, SUNLINER81", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 15:07:00", 
        "title": "China invades", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Yes, it does reduce the amount of airborne fibers. But, it is still Class 1 removal due to the fact that you have to scrap it off with either a mutt or hand scraper. That requires air-testing, containment, airlock w/ shower, donning of Tyvek suits, notification (EPA guideline), and the use of PAPR until air sampling verifies fiber count per cubic centimeter. If it is below 10 fcc, then you can downgrade your respirator to a half-face respirator. Also, all respirators must use P100 filters. You can't go using a paper dust mask, that is for sure. Popcorn ceiling is a pain in the arse to remove. Not because of the difficulty of removal, but because of the regulations involved. Popcorn ceilings usually have 30% or more asbestos in it. Just to give a comparison, the asbo \"mag\" used to cover industrial hot piping usually only contains 15%. Asbo floor tile usually contains 2-5%, but is non-friable. So, about the only asbo that a homeowner could realistically remove themselves is floor tile. It still requires the use of water, respirators and other PPE, as well as notification. But, you don't need to use a containment. So, popcorn ceilings are usually best kept and undisturbed. You may even want to encapsulate it to add relief to any worry.", 
        "intTime": 20090411, 
        "postID": 8, 
        "quote": "", 
        "reply": "Yes, it does reduce the amount of airborne fibers. But, it is still Class 1 removal due to the fact that you have to scrap it off with either a mutt or hand scraper. That requires air-testing, containment, airlock w/ shower, donning of Tyvek suits, notification (EPA guideline), and the use of PAPR until air sampling verifies fiber count per cubic centimeter. If it is below 10 fcc, then you can downgrade your respirator to a half-face respirator. Also, all respirators must use P100 filters. You can't go using a paper dust mask, that is for sure. Popcorn ceiling is a pain in the arse to remove. Not because of the difficulty of removal, but because of the regulations involved. Popcorn ceilings usually have 30% or more asbestos in it. Just to give a comparison, the asbo \"mag\" used to cover industrial hot piping usually only contains 15%. Asbo floor tile usually contains 2-5%, but is non-friable. So, about the only asbo that a homeowner could realistically remove themselves is floor tile. It still requires the use of water, respirators and other PPE, as well as notification. But, you don't need to use a containment. So, popcorn ceilings are usually best kept and undisturbed. You may even want to encapsulate it to add relief to any worry.", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 15:30:00", 
        "title": "China invades", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: Yes, it does reduce the amount of airborne fibers. But, it is still Class 1 removal due to the fact that you have to scrap it off with either a mutt or hand scraper. That requires air-testing, containment, airlock w/ shower, donning of Tyvek suits, notification (EPA guideline), and the use of PAPR until air sampling verifies fiber count per cubic centimeter. If it is below 10 fcc, then you can downgrade your respirator to a half-face respirator. Also, all respirators must use P100 filters. You can't go using a paper dust mask, that is for sure. Popcorn ceiling is a pain in the arse to remove. Not because of the difficulty of removal, but because of the regulations involved. Popcorn ceilings usually have 30% or more asbestos in it. Just to give a comparison, the asbo \"mag\" used to cover industrial hot piping usually only contains 15%. Asbo floor tile usually contains 2-5%, but is non-friable. So, about the only asbo that a homeowner could realistically remove themselves is floor tile. It still requires the use of water, respirators and other PPE, as well as notification. But, you don't need to use a containment. So, popcorn ceilings are usually best kept and undisturbed. You may even want to encapsulate it to add relief to any worry. Kr@p, I hadda ask!... Respectfully, SUNLINER81", 
        "intTime": 20090411, 
        "postID": 9, 
        "quote": "Originally posted by 10tenths: Yes, it does reduce the amount of airborne fibers. But, it is still Class 1 removal due to the fact that you have to scrap it off with either a mutt or hand scraper. That requires air-testing, containment, airlock w/ shower, donning of Tyvek suits, notification (EPA guideline), and the use of PAPR until air sampling verifies fiber count per cubic centimeter. If it is below 10 fcc, then you can downgrade your respirator to a half-face respirator. Also, all respirators must use P100 filters. You can't go using a paper dust mask, that is for sure. Popcorn ceiling is a pain in the arse to remove. Not because of the difficulty of removal, but because of the regulations involved. Popcorn ceilings usually have 30% or more asbestos in it. Just to give a comparison, the asbo \"mag\" used to cover industrial hot piping usually only contains 15%. Asbo floor tile usually contains 2-5%, but is non-friable. So, about the only asbo that a homeowner could realistically remove themselves is floor tile. It still requires the use of water, respirators and other PPE, as well as notification. But, you don't need to use a containment. So, popcorn ceilings are usually best kept and undisturbed. You may even want to encapsulate it to add relief to any worry.", 
        "reply": " Kr@p, I hadda ask!... Respectfully, SUNLINER81", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 15:45:00", 
        "title": "China invades", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: That was my point, the PRC does seem to be slowly and deliberately planning an attack, economically and or militarily on the U.S.... It's like all the warnings that we had before Pearl Harbor but no one had the cajones to actually take preemptive action... IMHO... Respectfully, SUNLINER81 LOL @ your Pearl Harbor comparison. Your fear of the world is truly astonishing.", 
        "intTime": 20090411, 
        "postID": 10, 
        "quote": "Originally posted by SUNLINER81: That was my point, the PRC does seem to be slowly and deliberately planning an attack, economically and or militarily on the U.S.... It's like all the warnings that we had before Pearl Harbor but no one had the cajones to actually take preemptive action... IMHO... Respectfully, SUNLINER81", 
        "reply": " LOL @ your Pearl Harbor comparison. Your fear of the world is truly astonishing.", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 15:50:00", 
        "title": "China invades", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by SUNLINER81: That was my point, the PRC does seem to be slowly and deliberately planning an attack, economically and or militarily on the U.S.... It's like all the warnings that we had before Pearl Harbor but no one had the cajones to actually take preemptive action... IMHO... Respectfully, SUNLINER81 LOL @ your Pearl Harbor comparison. Your fear of the world is truly astonishing. And you are still trying to bait, which is against the rules of this site... Can't you understand that everyone sees through what you are trying to do?... Respectfully, SUNLINER81", 
        "intTime": 20090411, 
        "postID": 11, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by SUNLINER81: That was my point, the PRC does seem to be slowly and deliberately planning an attack, economically and or militarily on the U.S.... It's like all the warnings that we had before Pearl Harbor but no one had the cajones to actually take preemptive action... IMHO... Respectfully, SUNLINER81 LOL @ your Pearl Harbor comparison. Your fear of the world is truly astonishing.", 
        "reply": " And you are still trying to bait, which is against the rules of this site... Can't you understand that everyone sees through what you are trying to do?... Respectfully, SUNLINER81", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 15:57:00", 
        "title": "China invades", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 No need to worry about that. Smart grid coming to a house near you.", 
        "intTime": 20090411, 
        "postID": 12, 
        "quote": "Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81", 
        "reply": " No need to worry about that. Smart grid coming to a house near you.", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 16:25:00", 
        "title": "China invades", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 No need to worry about that. Smart grid coming to a house near you. Sure as h3ll hope not!... What a \"Big Brother\" monstrosity that would be... Respectfully, SUNLINER81", 
        "intTime": 20090411, 
        "postID": 13, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 No need to worry about that. Smart grid coming to a house near you.", 
        "reply": " Sure as h3ll hope not!... What a \"Big Brother\" monstrosity that would be... Respectfully, SUNLINER81", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 16:43:00", 
        "title": "China invades", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by m551sheridan: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same? That was my point, the PRC does seem to be slowly and deliberately planning an attack, economically and or militarily on the U.S.... It's like all the warnings that we had before Pearl Harbor but no one had the cajones to actually take preemptive action... IMHO... Respectfully, SUNLINER81 you may be closer to the truth then you think but anything preemptive in this day and age may be more a problem then not... keeping vigilant and ready is key...... sadly our leader and his sidekicks do not appear to get it and THAT is what scares me.... 2012 can't get here fast enough for me. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090411, 
        "postID": 14, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by m551sheridan: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same? That was my point, the PRC does seem to be slowly and deliberately planning an attack, economically and or militarily on the U.S.... It's like all the warnings that we had before Pearl Harbor but no one had the cajones to actually take preemptive action... IMHO... Respectfully, SUNLINER81", 
        "reply": " you may be closer to the truth then you think but anything preemptive in this day and age may be more a problem then not... keeping vigilant and ready is key...... sadly our leader and his sidekicks do not appear to get it and THAT is what scares me.... 2012 can't get here fast enough for me. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 17:41:00", 
        "title": "China invades", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 No need to worry about that. Smart grid coming to a house near you. Sure as h3ll hope not!... What a \"Big Brother\" monstrosity that would be... Respectfully, SUNLINER81 Never fear the China Syndrome is here!", 
        "intTime": 20090411, 
        "postID": 15, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 No need to worry about that. Smart grid coming to a house near you. Sure as h3ll hope not!... What a \"Big Brother\" monstrosity that would be... Respectfully, SUNLINER81", 
        "reply": " Never fear the China Syndrome is here!", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 17:51:00", 
        "title": "China invades", 
        "userID": "EAG154"
    }, 
    {
        "content": "I think its about time that this country seriously considers discontinuing any more purchases from China until they get their uh SCAT together. Too much stuff is coming over tainted.", 
        "intTime": 20090411, 
        "postID": 16, 
        "quote": "", 
        "reply": "I think its about time that this country seriously considers discontinuing any more purchases from China until they get their uh SCAT together. Too much stuff is coming over tainted.", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 17:51:00", 
        "title": "China invades", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "And generators fly out the door at your local Home Depot !!", 
        "intTime": 20090411, 
        "postID": 17, 
        "quote": "", 
        "reply": "And generators fly out the door at your local Home Depot !!", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 17:52:00", 
        "title": "China invades", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "I prefer Lowe's. quote: Originally posted by OddBall1st: And generators fly out the door at your local Home Depot !!", 
        "intTime": 20090411, 
        "postID": 18, 
        "quote": "Originally posted by OddBall1st: And generators fly out the door at your local Home Depot !!", 
        "reply": "I prefer Lowe's. ", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 17:56:00", 
        "title": "China invades", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same? The simple fix for that problem is to air-gap all of the electrical grid computers. All critical government computers are air-gapped and any claim that they have been compromised by hackers using the internet is completely false. You cannot hack something that is not connected to the internet. Air-gapping is very easy to do and is very low cost. There is no need for the government to pass any legislation or to subsidize the procedure. Here, I will give the government an offer right now. I will airgap all of the utility computer networks for $1000 per host and $500 per slave plus the cost of materials. But, you know what? I would be willing to bet that all of these networks are air-gapped already and they are just spewing BS. Fear is control. Especially when the general public is uneducated.", 
        "intTime": 20090412, 
        "postID": 19, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same?", 
        "reply": " The simple fix for that problem is to air-gap all of the electrical grid computers. All critical government computers are air-gapped and any claim that they have been compromised by hackers using the internet is completely false. You cannot hack something that is not connected to the internet. Air-gapping is very easy to do and is very low cost. There is no need for the government to pass any legislation or to subsidize the procedure. Here, I will give the government an offer right now. I will airgap all of the utility computer networks for $1000 per host and $500 per slave plus the cost of materials. But, you know what? I would be willing to bet that all of these networks are air-gapped already and they are just spewing BS. Fear is control. Especially when the general public is uneducated.", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-12 10:28:00", 
        "title": "China invades", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: quote: Originally posted by m551sheridan: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same? The simple fix for that problem is to air-gap all of the electrical grid computers. All critical government computers are air-gapped and any claim that they have been compromised by hackers using the internet is completely false. You cannot hack something that is not connected to the internet. Air-gapping is very easy to do and is very low cost. There is no need for the government to pass any legislation or to subsidize the procedure. Here, I will give the government an offer right now. I will airgap all of the utility computer networks for $1000 per host and $500 per slave plus the cost of materials. But, you know what? I would be willing to bet that all of these networks are air-gapped already and they are just spewing BS. Fear is control. Especially when the general public is uneducated. Are you saying that the Obama administration is trying to spread fear among the American citizenry and for what reason would they do this?!... This is an honest question and not a \"smart azzed\" one, I would really like to know what you think the reason for fear mongering is... Respectfully, SUNLINER81", 
        "intTime": 20090412, 
        "postID": 20, 
        "quote": "Originally posted by 10tenths: quote: Originally posted by m551sheridan: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same? The simple fix for that problem is to air-gap all of the electrical grid computers. All critical government computers are air-gapped and any claim that they have been compromised by hackers using the internet is completely false. You cannot hack something that is not connected to the internet. Air-gapping is very easy to do and is very low cost. There is no need for the government to pass any legislation or to subsidize the procedure. Here, I will give the government an offer right now. I will airgap all of the utility computer networks for $1000 per host and $500 per slave plus the cost of materials. But, you know what? I would be willing to bet that all of these networks are air-gapped already and they are just spewing BS. Fear is control. Especially when the general public is uneducated.", 
        "reply": " Are you saying that the Obama administration is trying to spread fear among the American citizenry and for what reason would they do this?!... This is an honest question and not a \"smart azzed\" one, I would really like to know what you think the reason for fear mongering is... Respectfully, SUNLINER81", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-12 15:43:00", 
        "title": "China invades", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "How's your dry wall! \"http://news.yahoo.com/s/ap/20090411/ap_on_bi_ge/chinese_drywall", 
        "intTime": 20090411, 
        "postID": 21, 
        "quote": "", 
        "reply": "How's your dry wall! \"http://news.yahoo.com/s/ap/20090411/ap_on_bi_ge/chinese_drywall", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 14:35:00", 
        "title": "China invades", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: How's your dry wall! \"http://news.yahoo.com/s/ap/20090411/ap_on_bi_ge/chinese_drywall Better than my asbestos \"popcorn\" ceiling... LOL Respectfully, SUNLINER81", 
        "intTime": 20090411, 
        "postID": 22, 
        "quote": "Originally posted by EAG154: How's your dry wall! \"http://news.yahoo.com/s/ap/20090411/ap_on_bi_ge/chinese_drywall", 
        "reply": " Better than my asbestos \"popcorn\" ceiling... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 14:47:00", 
        "title": "China invades", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81", 
        "intTime": 20090411, 
        "postID": 23, 
        "quote": "", 
        "reply": "Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 14:55:00", 
        "title": "China invades", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same? One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090411, 
        "postID": 24, 
        "quote": "Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81", 
        "reply": " yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same? One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 14:59:00", 
        "title": "China invades", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by EAG154: How's your dry wall! \"http://news.yahoo.com/s/ap/20090411/ap_on_bi_ge/chinese_drywall Better than my asbestos \"popcorn\" ceiling... LOL Respectfully, SUNLINER81 Not really, asbo really doesn't cause any harm to health unless it is disturbed, thus releasing its fibers. Most popcorn ceilings are friable, but they usually put a hardcoat over it. So, your ceilings aren't a problem unless you are planning on breaking it up. Just a little fun fact. There is asbestos fibers found in the air in every major city. Asbestos abatement workers who are removing asbestos inside a containment usually record lower fiber counts within the containment than what is present outside of containment. Even their excursion samples are lower (excursion samples are taken when fiber counts within containment are at their highest level). So, the amount of asbo fibers that you breath are more than the amount of a asbestos worker who is breaking up and removing asbo within containment. The drywall in this case is releasing chemical and those chemicals are thus able to react with other things. If these chemicals find the right combination, that could mean an immediate danger to life will be present. That is not something that happens with asbo.", 
        "intTime": 20090411, 
        "postID": 25, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by EAG154: How's your dry wall! \"http://news.yahoo.com/s/ap/20090411/ap_on_bi_ge/chinese_drywall Better than my asbestos \"popcorn\" ceiling... LOL Respectfully, SUNLINER81", 
        "reply": " Not really, asbo really doesn't cause any harm to health unless it is disturbed, thus releasing its fibers. Most popcorn ceilings are friable, but they usually put a hardcoat over it. So, your ceilings aren't a problem unless you are planning on breaking it up. Just a little fun fact. There is asbestos fibers found in the air in every major city. Asbestos abatement workers who are removing asbestos inside a containment usually record lower fiber counts within the containment than what is present outside of containment. Even their excursion samples are lower (excursion samples are taken when fiber counts within containment are at their highest level). So, the amount of asbo fibers that you breath are more than the amount of a asbestos worker who is breaking up and removing asbo within containment. The drywall in this case is releasing chemical and those chemicals are thus able to react with other things. If these chemicals find the right combination, that could mean an immediate danger to life will be present. That is not something that happens with asbo.", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 15:00:00", 
        "title": "China invades", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same? That was my point, the PRC does seem to be slowly and deliberately planning an attack, economically and or militarily on the U.S.... It's like all the warnings that we had before Pearl Harbor but no one had the cajones to actually take preemptive action... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090411, 
        "postID": 26, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same?", 
        "reply": " That was my point, the PRC does seem to be slowly and deliberately planning an attack, economically and or militarily on the U.S.... It's like all the warnings that we had before Pearl Harbor but no one had the cajones to actually take preemptive action... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 15:05:00", 
        "title": "China invades", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: quote: Originally posted by SUNLINER81: quote: Originally posted by EAG154: How's your dry wall! \"http://news.yahoo.com/s/ap/20090411/ap_on_bi_ge/chinese_drywall Better than my asbestos \"popcorn\" ceiling... LOL Respectfully, SUNLINER81 Not really, asbo really doesn't cause any harm to health unless it is disturbed, thus releasing its fibers. Most popcorn ceilings are friable, but they usually put a hardcoat over it. So, your ceilings aren't a problem unless you are planning on breaking it up. Actually, you can \"wet\" it down and then remove it safely, provided you still use a respirator or so I have been told... Respectfully, SUNLINER81", 
        "intTime": 20090411, 
        "postID": 27, 
        "quote": "Originally posted by 10tenths: quote: Originally posted by SUNLINER81: quote: Originally posted by EAG154: How's your dry wall! \"http://news.yahoo.com/s/ap/20090411/ap_on_bi_ge/chinese_drywall Better than my asbestos \"popcorn\" ceiling... LOL Respectfully, SUNLINER81 Not really, asbo really doesn't cause any harm to health unless it is disturbed, thus releasing its fibers. Most popcorn ceilings are friable, but they usually put a hardcoat over it. So, your ceilings aren't a problem unless you are planning on breaking it up.", 
        "reply": " Actually, you can \"wet\" it down and then remove it safely, provided you still use a respirator or so I have been told... Respectfully, SUNLINER81", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 15:07:00", 
        "title": "China invades", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Yes, it does reduce the amount of airborne fibers. But, it is still Class 1 removal due to the fact that you have to scrap it off with either a mutt or hand scraper. That requires air-testing, containment, airlock w/ shower, donning of Tyvek suits, notification (EPA guideline), and the use of PAPR until air sampling verifies fiber count per cubic centimeter. If it is below 10 fcc, then you can downgrade your respirator to a half-face respirator. Also, all respirators must use P100 filters. You can't go using a paper dust mask, that is for sure. Popcorn ceiling is a pain in the arse to remove. Not because of the difficulty of removal, but because of the regulations involved. Popcorn ceilings usually have 30% or more asbestos in it. Just to give a comparison, the asbo \"mag\" used to cover industrial hot piping usually only contains 15%. Asbo floor tile usually contains 2-5%, but is non-friable. So, about the only asbo that a homeowner could realistically remove themselves is floor tile. It still requires the use of water, respirators and other PPE, as well as notification. But, you don't need to use a containment. So, popcorn ceilings are usually best kept and undisturbed. You may even want to encapsulate it to add relief to any worry.", 
        "intTime": 20090411, 
        "postID": 28, 
        "quote": "", 
        "reply": "Yes, it does reduce the amount of airborne fibers. But, it is still Class 1 removal due to the fact that you have to scrap it off with either a mutt or hand scraper. That requires air-testing, containment, airlock w/ shower, donning of Tyvek suits, notification (EPA guideline), and the use of PAPR until air sampling verifies fiber count per cubic centimeter. If it is below 10 fcc, then you can downgrade your respirator to a half-face respirator. Also, all respirators must use P100 filters. You can't go using a paper dust mask, that is for sure. Popcorn ceiling is a pain in the arse to remove. Not because of the difficulty of removal, but because of the regulations involved. Popcorn ceilings usually have 30% or more asbestos in it. Just to give a comparison, the asbo \"mag\" used to cover industrial hot piping usually only contains 15%. Asbo floor tile usually contains 2-5%, but is non-friable. So, about the only asbo that a homeowner could realistically remove themselves is floor tile. It still requires the use of water, respirators and other PPE, as well as notification. But, you don't need to use a containment. So, popcorn ceilings are usually best kept and undisturbed. You may even want to encapsulate it to add relief to any worry.", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 15:30:00", 
        "title": "China invades", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: Yes, it does reduce the amount of airborne fibers. But, it is still Class 1 removal due to the fact that you have to scrap it off with either a mutt or hand scraper. That requires air-testing, containment, airlock w/ shower, donning of Tyvek suits, notification (EPA guideline), and the use of PAPR until air sampling verifies fiber count per cubic centimeter. If it is below 10 fcc, then you can downgrade your respirator to a half-face respirator. Also, all respirators must use P100 filters. You can't go using a paper dust mask, that is for sure. Popcorn ceiling is a pain in the arse to remove. Not because of the difficulty of removal, but because of the regulations involved. Popcorn ceilings usually have 30% or more asbestos in it. Just to give a comparison, the asbo \"mag\" used to cover industrial hot piping usually only contains 15%. Asbo floor tile usually contains 2-5%, but is non-friable. So, about the only asbo that a homeowner could realistically remove themselves is floor tile. It still requires the use of water, respirators and other PPE, as well as notification. But, you don't need to use a containment. So, popcorn ceilings are usually best kept and undisturbed. You may even want to encapsulate it to add relief to any worry. Kr@p, I hadda ask!... Respectfully, SUNLINER81", 
        "intTime": 20090411, 
        "postID": 29, 
        "quote": "Originally posted by 10tenths: Yes, it does reduce the amount of airborne fibers. But, it is still Class 1 removal due to the fact that you have to scrap it off with either a mutt or hand scraper. That requires air-testing, containment, airlock w/ shower, donning of Tyvek suits, notification (EPA guideline), and the use of PAPR until air sampling verifies fiber count per cubic centimeter. If it is below 10 fcc, then you can downgrade your respirator to a half-face respirator. Also, all respirators must use P100 filters. You can't go using a paper dust mask, that is for sure. Popcorn ceiling is a pain in the arse to remove. Not because of the difficulty of removal, but because of the regulations involved. Popcorn ceilings usually have 30% or more asbestos in it. Just to give a comparison, the asbo \"mag\" used to cover industrial hot piping usually only contains 15%. Asbo floor tile usually contains 2-5%, but is non-friable. So, about the only asbo that a homeowner could realistically remove themselves is floor tile. It still requires the use of water, respirators and other PPE, as well as notification. But, you don't need to use a containment. So, popcorn ceilings are usually best kept and undisturbed. You may even want to encapsulate it to add relief to any worry.", 
        "reply": " Kr@p, I hadda ask!... Respectfully, SUNLINER81", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 15:45:00", 
        "title": "China invades", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: That was my point, the PRC does seem to be slowly and deliberately planning an attack, economically and or militarily on the U.S.... It's like all the warnings that we had before Pearl Harbor but no one had the cajones to actually take preemptive action... IMHO... Respectfully, SUNLINER81 LOL @ your Pearl Harbor comparison. Your fear of the world is truly astonishing.", 
        "intTime": 20090411, 
        "postID": 30, 
        "quote": "Originally posted by SUNLINER81: That was my point, the PRC does seem to be slowly and deliberately planning an attack, economically and or militarily on the U.S.... It's like all the warnings that we had before Pearl Harbor but no one had the cajones to actually take preemptive action... IMHO... Respectfully, SUNLINER81", 
        "reply": " LOL @ your Pearl Harbor comparison. Your fear of the world is truly astonishing.", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 15:50:00", 
        "title": "China invades", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by SUNLINER81: That was my point, the PRC does seem to be slowly and deliberately planning an attack, economically and or militarily on the U.S.... It's like all the warnings that we had before Pearl Harbor but no one had the cajones to actually take preemptive action... IMHO... Respectfully, SUNLINER81 LOL @ your Pearl Harbor comparison. Your fear of the world is truly astonishing. And you are still trying to bait, which is against the rules of this site... Can't you understand that everyone sees through what you are trying to do?... Respectfully, SUNLINER81", 
        "intTime": 20090411, 
        "postID": 31, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by SUNLINER81: That was my point, the PRC does seem to be slowly and deliberately planning an attack, economically and or militarily on the U.S.... It's like all the warnings that we had before Pearl Harbor but no one had the cajones to actually take preemptive action... IMHO... Respectfully, SUNLINER81 LOL @ your Pearl Harbor comparison. Your fear of the world is truly astonishing.", 
        "reply": " And you are still trying to bait, which is against the rules of this site... Can't you understand that everyone sees through what you are trying to do?... Respectfully, SUNLINER81", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 15:57:00", 
        "title": "China invades", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 No need to worry about that. Smart grid coming to a house near you.", 
        "intTime": 20090411, 
        "postID": 32, 
        "quote": "Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81", 
        "reply": " No need to worry about that. Smart grid coming to a house near you.", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 16:25:00", 
        "title": "China invades", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 No need to worry about that. Smart grid coming to a house near you. Sure as h3ll hope not!... What a \"Big Brother\" monstrosity that would be... Respectfully, SUNLINER81", 
        "intTime": 20090411, 
        "postID": 33, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 No need to worry about that. Smart grid coming to a house near you.", 
        "reply": " Sure as h3ll hope not!... What a \"Big Brother\" monstrosity that would be... Respectfully, SUNLINER81", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 16:43:00", 
        "title": "China invades", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by m551sheridan: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same? That was my point, the PRC does seem to be slowly and deliberately planning an attack, economically and or militarily on the U.S.... It's like all the warnings that we had before Pearl Harbor but no one had the cajones to actually take preemptive action... IMHO... Respectfully, SUNLINER81 you may be closer to the truth then you think but anything preemptive in this day and age may be more a problem then not... keeping vigilant and ready is key...... sadly our leader and his sidekicks do not appear to get it and THAT is what scares me.... 2012 can't get here fast enough for me. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090411, 
        "postID": 34, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by m551sheridan: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same? That was my point, the PRC does seem to be slowly and deliberately planning an attack, economically and or militarily on the U.S.... It's like all the warnings that we had before Pearl Harbor but no one had the cajones to actually take preemptive action... IMHO... Respectfully, SUNLINER81", 
        "reply": " you may be closer to the truth then you think but anything preemptive in this day and age may be more a problem then not... keeping vigilant and ready is key...... sadly our leader and his sidekicks do not appear to get it and THAT is what scares me.... 2012 can't get here fast enough for me. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 17:41:00", 
        "title": "China invades", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 No need to worry about that. Smart grid coming to a house near you. Sure as h3ll hope not!... What a \"Big Brother\" monstrosity that would be... Respectfully, SUNLINER81 Never fear the China Syndrome is here!", 
        "intTime": 20090411, 
        "postID": 35, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 No need to worry about that. Smart grid coming to a house near you. Sure as h3ll hope not!... What a \"Big Brother\" monstrosity that would be... Respectfully, SUNLINER81", 
        "reply": " Never fear the China Syndrome is here!", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 17:51:00", 
        "title": "China invades", 
        "userID": "EAG154"
    }, 
    {
        "content": "I think its about time that this country seriously considers discontinuing any more purchases from China until they get their uh SCAT together. Too much stuff is coming over tainted.", 
        "intTime": 20090411, 
        "postID": 36, 
        "quote": "", 
        "reply": "I think its about time that this country seriously considers discontinuing any more purchases from China until they get their uh SCAT together. Too much stuff is coming over tainted.", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 17:51:00", 
        "title": "China invades", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "And generators fly out the door at your local Home Depot !!", 
        "intTime": 20090411, 
        "postID": 37, 
        "quote": "", 
        "reply": "And generators fly out the door at your local Home Depot !!", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 17:52:00", 
        "title": "China invades", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "I prefer Lowe's. quote: Originally posted by OddBall1st: And generators fly out the door at your local Home Depot !!", 
        "intTime": 20090411, 
        "postID": 38, 
        "quote": "Originally posted by OddBall1st: And generators fly out the door at your local Home Depot !!", 
        "reply": "I prefer Lowe's. ", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-11 17:56:00", 
        "title": "China invades", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same? The simple fix for that problem is to air-gap all of the electrical grid computers. All critical government computers are air-gapped and any claim that they have been compromised by hackers using the internet is completely false. You cannot hack something that is not connected to the internet. Air-gapping is very easy to do and is very low cost. There is no need for the government to pass any legislation or to subsidize the procedure. Here, I will give the government an offer right now. I will airgap all of the utility computer networks for $1000 per host and $500 per slave plus the cost of materials. But, you know what? I would be willing to bet that all of these networks are air-gapped already and they are just spewing BS. Fear is control. Especially when the general public is uneducated.", 
        "intTime": 20090412, 
        "postID": 39, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same?", 
        "reply": " The simple fix for that problem is to air-gap all of the electrical grid computers. All critical government computers are air-gapped and any claim that they have been compromised by hackers using the internet is completely false. You cannot hack something that is not connected to the internet. Air-gapping is very easy to do and is very low cost. There is no need for the government to pass any legislation or to subsidize the procedure. Here, I will give the government an offer right now. I will airgap all of the utility computer networks for $1000 per host and $500 per slave plus the cost of materials. But, you know what? I would be willing to bet that all of these networks are air-gapped already and they are just spewing BS. Fear is control. Especially when the general public is uneducated.", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-12 10:28:00", 
        "title": "China invades", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: quote: Originally posted by m551sheridan: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same? The simple fix for that problem is to air-gap all of the electrical grid computers. All critical government computers are air-gapped and any claim that they have been compromised by hackers using the internet is completely false. You cannot hack something that is not connected to the internet. Air-gapping is very easy to do and is very low cost. There is no need for the government to pass any legislation or to subsidize the procedure. Here, I will give the government an offer right now. I will airgap all of the utility computer networks for $1000 per host and $500 per slave plus the cost of materials. But, you know what? I would be willing to bet that all of these networks are air-gapped already and they are just spewing BS. Fear is control. Especially when the general public is uneducated. Are you saying that the Obama administration is trying to spread fear among the American citizenry and for what reason would they do this?!... This is an honest question and not a \"smart azzed\" one, I would really like to know what you think the reason for fear mongering is... Respectfully, SUNLINER81", 
        "intTime": 20090412, 
        "postID": 40, 
        "quote": "Originally posted by 10tenths: quote: Originally posted by m551sheridan: quote: Originally posted by SUNLINER81: Think I would be more \"worried\" about the \"worm\" that has been placed in our computer systems that control our utility girds, BY THE PRC AND OTHERS... Respectfully, SUNLINER81 yeah, but what will harm us more...... a computer worm or a shutting down of the power grid as a preemptive strike? Or a prelude to same? The simple fix for that problem is to air-gap all of the electrical grid computers. All critical government computers are air-gapped and any claim that they have been compromised by hackers using the internet is completely false. You cannot hack something that is not connected to the internet. Air-gapping is very easy to do and is very low cost. There is no need for the government to pass any legislation or to subsidize the procedure. Here, I will give the government an offer right now. I will airgap all of the utility computer networks for $1000 per host and $500 per slave plus the cost of materials. But, you know what? I would be willing to bet that all of these networks are air-gapped already and they are just spewing BS. Fear is control. Especially when the general public is uneducated.", 
        "reply": " Are you saying that the Obama administration is trying to spread fear among the American citizenry and for what reason would they do this?!... This is an honest question and not a \"smart azzed\" one, I would really like to know what you think the reason for fear mongering is... Respectfully, SUNLINER81", 
        "threadID": "672198221_8510064022001", 
        "time": "2009-04-12 15:43:00", 
        "title": "China invades", 
        "userID": "SUNLINER81"
    }
]