[
    {
        "content": "What say you all on this? Should she be shot as is? Should the baby be born first then she should be shot? I say she should be put in prison for 20 years and the baby be sent back to Nigeria at Nigeria's expense. BANGKOK, Thailand (CNN) -- A pregnant British woman facing possible execution in Laos will go on trial this week, the country's foreign affairs ministry said Monday. Samantha Orobator became pregnant in prison, according to a spokeswoman for rights group Reprieve. Samantha Orobator \"is facing death by firing squad for drug trafficking,\" said Clare Algar, executive director of Reprieve, a London-based human rights group. Orobator, 20, was arrested on August 5, said Khenthong Nuanthasing, the Ministry of Foreign Affairs spokesman. She was alleged to have been carrying just over half a kilogram (1.1 pounds) of heroin, Reprieve lawyer Anna Morris told CNN by phone from Vientiane, the Laotian capital. \"For that amount of heroin the sentence is normally the death penalty,\" she said. Orobator's mother Jane found out in January her daughter was pregnant -- more than four months after she was arrested, her mother said. Jane Orobator heard the news from the British Foreign Office, which has been monitoring the case, the mother told CNN by phone from Dublin, where she lives. She cannot believe her daughter was involved in drug trafficking, and was surprised to learn she was in Laos, she said. \"I don't know\" what she was doing there, she said. \"The last time she spoke with me, she said she was on holiday in London and she would come to see us in Dublin before returning to the U.K. in July. \"She is not the type of person who would be involved in drugs,\" she added. Reprieve is worried about her health, especially given her pregnancy, Anna Morris said. \"She became pregnant in prison. We are concerned that it may not have been consensual and we are concerned that someone who finds herself in prison at 20 is subject to exploitation,\" she said. She is due to give birth in September, the lawyer added. Reprieve sent Morris from London to Laos to try to help Orobator, Algar said. The lawyer arrived there on Sunday and is hoping to visit Orobator on Tuesday, her boss at Reprieve said. A British consul has also arrived in the country. \"Reprieve heard about her case two weeks ago. We had thought yesterday the trial was going to start today,\" Algar said Monday. \"We have now heard from Anna that it is not going to.\" \"I am the first British lawyer who has asked for access to her,\" Morris said. \"She needs to have a local lawyer appointed to her. We are pressing very hard for the local authorities to appoint one.\" She said it was normal in the Laotian justice system for a defendant to get a lawyer only days before a trial. The last execution in Laos was in 1990, the foreign affairs spokesman said. British Foreign Office Minister Bill Rammell issued a statement about Orobator on Saturday. \"The British Government is opposed to the use of the death penalty in all circumstances. We have made the Laos authorities aware of this at the highest levels in Samantha's case,\" he said. \"We are paying close attention to her welfare and are in regular contact with the Laotian authorities about her case. British Embassy officials, including the Ambassador, have visited her six times since her arrest,\" he said. \"In addition, Britain's consular representatives in Laos, the Australian Embassy, including the Australian Embassy doctor, have visited Samantha 10 times on our behalf,\" he said. There is no British Embassy in Laos. A British vice-consul arrived in the country this weekend, the Foreign Office said Monday. Rammell plans to raise the Orobator case with the Laotian deputy prime minister this week, he said. Samantha Orobator was born in Nigeria and moved to London with her family when she was 8, her mother said. E-mail to a friend | Mixx it | Share", 
        "intTime": 20090504, 
        "postID": 1, 
        "quote": "", 
        "reply": "What say you all on this? Should she be shot as is? Should the baby be born first then she should be shot? I say she should be put in prison for 20 years and the baby be sent back to Nigeria at Nigeria's expense. BANGKOK, Thailand (CNN) -- A pregnant British woman facing possible execution in Laos will go on trial this week, the country's foreign affairs ministry said Monday. Samantha Orobator became pregnant in prison, according to a spokeswoman for rights group Reprieve. Samantha Orobator \"is facing death by firing squad for drug trafficking,\" said Clare Algar, executive director of Reprieve, a London-based human rights group. Orobator, 20, was arrested on August 5, said Khenthong Nuanthasing, the Ministry of Foreign Affairs spokesman. She was alleged to have been carrying just over half a kilogram (1.1 pounds) of heroin, Reprieve lawyer Anna Morris told CNN by phone from Vientiane, the Laotian capital. \"For that amount of heroin the sentence is normally the death penalty,\" she said. Orobator's mother Jane found out in January her daughter was pregnant -- more than four months after she was arrested, her mother said. Jane Orobator heard the news from the British Foreign Office, which has been monitoring the case, the mother told CNN by phone from Dublin, where she lives. She cannot believe her daughter was involved in drug trafficking, and was surprised to learn she was in Laos, she said. \"I don't know\" what she was doing there, she said. \"The last time she spoke with me, she said she was on holiday in London and she would come to see us in Dublin before returning to the U.K. in July. \"She is not the type of person who would be involved in drugs,\" she added. Reprieve is worried about her health, especially given her pregnancy, Anna Morris said. \"She became pregnant in prison. We are concerned that it may not have been consensual and we are concerned that someone who finds herself in prison at 20 is subject to exploitation,\" she said. She is due to give birth in September, the lawyer added. Reprieve sent Morris from London to Laos to try to help Orobator, Algar said. The lawyer arrived there on Sunday and is hoping to visit Orobator on Tuesday, her boss at Reprieve said. A British consul has also arrived in the country. \"Reprieve heard about her case two weeks ago. We had thought yesterday the trial was going to start today,\" Algar said Monday. \"We have now heard from Anna that it is not going to.\" \"I am the first British lawyer who has asked for access to her,\" Morris said. \"She needs to have a local lawyer appointed to her. We are pressing very hard for the local authorities to appoint one.\" She said it was normal in the Laotian justice system for a defendant to get a lawyer only days before a trial. The last execution in Laos was in 1990, the foreign affairs spokesman said. British Foreign Office Minister Bill Rammell issued a statement about Orobator on Saturday. \"The British Government is opposed to the use of the death penalty in all circumstances. We have made the Laos authorities aware of this at the highest levels in Samantha's case,\" he said. \"We are paying close attention to her welfare and are in regular contact with the Laotian authorities about her case. British Embassy officials, including the Ambassador, have visited her six times since her arrest,\" he said. \"In addition, Britain's consular representatives in Laos, the Australian Embassy, including the Australian Embassy doctor, have visited Samantha 10 times on our behalf,\" he said. There is no British Embassy in Laos. A British vice-consul arrived in the country this weekend, the Foreign Office said Monday. Rammell plans to raise the Orobator case with the Laotian deputy prime minister this week, he said. Samantha Orobator was born in Nigeria and moved to London with her family when she was 8, her mother said. E-mail to a friend | Mixx it | Share", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 15:35:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "Duster6"
    }, 
    {
        "content": "She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb.", 
        "intTime": 20090504, 
        "postID": 2, 
        "quote": "", 
        "reply": "She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb.", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 15:40:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Heroin kills people every day, why should I be sympathetic to a Drug Smuggler?", 
        "intTime": 20090504, 
        "postID": 3, 
        "quote": "", 
        "reply": "Heroin kills people every day, why should I be sympathetic to a Drug Smuggler?", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 15:47:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb. See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090504, 
        "postID": 4, 
        "quote": "Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb.", 
        "reply": " See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 16:01:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb. See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime. Alleged crime - this has been somewhat problematic as access to HM Consul and legal advice seems to have been lacking - according to some reports the Foreign and Commonwealth Office only heard about this case recently. But then what do you expect when our idiot government has been closing embassies, High Commissions and consulates to save money (which it then spends on chavs).", 
        "intTime": 20090504, 
        "postID": 5, 
        "quote": "Originally posted by L0A1: quote: Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb. See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime.", 
        "reply": " Alleged crime - this has been somewhat problematic as access to HM Consul and legal advice seems to have been lacking - according to some reports the Foreign and Commonwealth Office only heard about this case recently. But then what do you expect when our idiot government has been closing embassies, High Commissions and consulates to save money (which it then spends on chavs).", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 16:47:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "True but I do not fault her for it, I fault the laws there. The punishment does not fit the crime. An eye for an eye a tooth for a tooth. Drugs do not kill people no more than guns do. I suppose your stance is it's ok to kill the baby as well? After all the baby is attached to the drug smuggler so must be just as guilty.", 
        "intTime": 20090504, 
        "postID": 6, 
        "quote": "", 
        "reply": "True but I do not fault her for it, I fault the laws there. The punishment does not fit the crime. An eye for an eye a tooth for a tooth. Drugs do not kill people no more than guns do. I suppose your stance is it's ok to kill the baby as well? After all the baby is attached to the drug smuggler so must be just as guilty.", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 16:57:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: True but I do not fault her for it, I fault the laws there. The punishment does not fit the crime. An eye for an eye a tooth for a tooth. Drugs do not kill people no more than guns do. I suppose your stance is it's ok to kill the baby as well? After all the baby is attached to the drug smuggler so must be just as guilty. The alternate explanation is that the alleged smuggler realised might be she for the chop and did her best to get up the duff because it's generally not considered sporting to execute pregnant women (except for religious reasons).", 
        "intTime": 20090504, 
        "postID": 7, 
        "quote": "Originally posted by crackerjacks61: True but I do not fault her for it, I fault the laws there. The punishment does not fit the crime. An eye for an eye a tooth for a tooth. Drugs do not kill people no more than guns do. I suppose your stance is it's ok to kill the baby as well? After all the baby is attached to the drug smuggler so must be just as guilty.", 
        "reply": " The alternate explanation is that the alleged smuggler realised might be she for the chop and did her best to get up the duff because it's generally not considered sporting to execute pregnant women (except for religious reasons).", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 17:16:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb. See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime. Alleged crime - this has been somewhat problematic as access to HM Consul and legal advice seems to have been lacking - according to some reports the Foreign and Commonwealth Office only heard about this case recently. But then what do you expect when our idiot government has been closing embassies, High Commissions and consulates to save money (which it then spends on chavs). She was caught with around half a kilo. Alleged? Semantics.. She is guilty. Unless you want to accuse the Laotians of lying, lol. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090504, 
        "postID": 8, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb. See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime. Alleged crime - this has been somewhat problematic as access to HM Consul and legal advice seems to have been lacking - according to some reports the Foreign and Commonwealth Office only heard about this case recently. But then what do you expect when our idiot government has been closing embassies, High Commissions and consulates to save money (which it then spends on chavs).", 
        "reply": " She was caught with around half a kilo. Alleged? Semantics.. She is guilty. Unless you want to accuse the Laotians of lying, lol. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 17:27:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by crackerjacks61: True but I do not fault her for it, I fault the laws there. The punishment does not fit the crime. An eye for an eye a tooth for a tooth. Drugs do not kill people no more than guns do. I suppose your stance is it's ok to kill the baby as well? After all the baby is attached to the drug smuggler so must be just as guilty. The alternate explanation is that the alleged smuggler realised might be she for the chop and did her best to get up the duff because it's generally not considered sporting to execute pregnant women (except for religious reasons). They are saying someone in the Jail knocked her up. They are saying she was not pregnant going in. As far as the baby goes, they may wait until after she gives birth before shooting her. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090504, 
        "postID": 9, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by crackerjacks61: True but I do not fault her for it, I fault the laws there. The punishment does not fit the crime. An eye for an eye a tooth for a tooth. Drugs do not kill people no more than guns do. I suppose your stance is it's ok to kill the baby as well? After all the baby is attached to the drug smuggler so must be just as guilty. The alternate explanation is that the alleged smuggler realised might be she for the chop and did her best to get up the duff because it's generally not considered sporting to execute pregnant women (except for religious reasons).", 
        "reply": " They are saying someone in the Jail knocked her up. They are saying she was not pregnant going in. As far as the baby goes, they may wait until after she gives birth before shooting her. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 17:30:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "L0A1"
    }, 
    {
        "content": "I wonder what all the pro abortion folks think about this? I would think they wouldn't care if she was pregnant or not.", 
        "intTime": 20090504, 
        "postID": 10, 
        "quote": "", 
        "reply": "I wonder what all the pro abortion folks think about this? I would think they wouldn't care if she was pregnant or not.", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 17:49:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I wonder what all the pro abortion folks think about this? I would think they wouldn't care if she was pregnant or not. 2 birds with 1 bullet? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090504, 
        "postID": 11, 
        "quote": "Originally posted by Duster6: I wonder what all the pro abortion folks think about this? I would think they wouldn't care if she was pregnant or not.", 
        "reply": " 2 birds with 1 bullet? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 18:14:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: [QUOTE]Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb. See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime.[/QUOTEIf she can't to the time(short as it is) she shouldn't do the crime..JMHO.", 
        "intTime": 20090504, 
        "postID": 12, 
        "quote": "Originally posted by L0A1: [QUOTE]Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb.", 
        "reply": " See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime.[/QUOTEIf she can't to the time(short as it is) she shouldn't do the crime..JMHO.", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 20:43:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "Migbuster"
    }, 
    {
        "content": "we all know whats going to happen. the uk is going to step in this women will be cut a deal and bam ship back to the uk.", 
        "intTime": 20090505, 
        "postID": 13, 
        "quote": "", 
        "reply": "we all know whats going to happen. the uk is going to step in this women will be cut a deal and bam ship back to the uk.", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-05 00:01:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "world_king377"
    }, 
    {
        "content": "There is a show that I enjoy watching called \"Locked Up Abroad\". Before someone decides to go to another country and break the law, they should watch that show. It is reenactments of people who decided to go overseas and break the law without knowing the consequences of what would happen if caught. This case is not knew. Saudi Arabia and numerous other countries, that are nearly drug and crime free, carry out the death penalty for drug smugglers. Other, almost completely crime free countries use caning as punishment. This happened to an American back when I was on active duty. He went to Japan, broke the law, got caned in public. Americans will always whine about other countries laws because we are so pampered and use to being able to get away with breaking the law with a slap on the wrist.", 
        "intTime": 20090505, 
        "postID": 14, 
        "quote": "", 
        "reply": "There is a show that I enjoy watching called \"Locked Up Abroad\". Before someone decides to go to another country and break the law, they should watch that show. It is reenactments of people who decided to go overseas and break the law without knowing the consequences of what would happen if caught. This case is not knew. Saudi Arabia and numerous other countries, that are nearly drug and crime free, carry out the death penalty for drug smugglers. Other, almost completely crime free countries use caning as punishment. This happened to an American back when I was on active duty. He went to Japan, broke the law, got caned in public. Americans will always whine about other countries laws because we are so pampered and use to being able to get away with breaking the law with a slap on the wrist.", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-05 02:42:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "qsam6"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb. See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime. Alleged crime - this has been somewhat problematic as access to HM Consul and legal advice seems to have been lacking - according to some reports the Foreign and Commonwealth Office only heard about this case recently. But then what do you expect when our idiot government has been closing embassies, High Commissions and consulates to save money (which it then spends on chavs). She was caught with around half a kilo. Alleged? Semantics.. She is guilty. Unless you want to accuse the Laotians of lying, lol. Alleged is alleged, they haven't had the trial yet or presented any actual evidence so how can you be so sure of guilt? And I'd accuse quite a lot of prosecuting authorities of lying from all over the world including the UK and US. They are lawyers after all and their job is usually to get convictions at almost any cost. I always thought that was the reason we had trials but if you can be sure of guilt why bother? I just think that perhaps you might not like it if it was done to you. (Just for the record - on the balance of probability she's guilty BUT I don't know that which is why everyone deserves an advocate.)", 
        "intTime": 20090505, 
        "postID": 15, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb. See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime. Alleged crime - this has been somewhat problematic as access to HM Consul and legal advice seems to have been lacking - according to some reports the Foreign and Commonwealth Office only heard about this case recently. But then what do you expect when our idiot government has been closing embassies, High Commissions and consulates to save money (which it then spends on chavs). She was caught with around half a kilo. Alleged? Semantics.. She is guilty. Unless you want to accuse the Laotians of lying, lol.", 
        "reply": " Alleged is alleged, they haven't had the trial yet or presented any actual evidence so how can you be so sure of guilt? And I'd accuse quite a lot of prosecuting authorities of lying from all over the world including the UK and US. They are lawyers after all and their job is usually to get convictions at almost any cost. I always thought that was the reason we had trials but if you can be sure of guilt why bother? I just think that perhaps you might not like it if it was done to you. (Just for the record - on the balance of probability she's guilty BUT I don't know that which is why everyone deserves an advocate.)", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-05 04:22:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "\"My daughter wouldn't get involved with drugs\" \"I didn't even know she was in Laos\" Sure!!!!! \"The punishment doesn't fit the crime\" Maybe not in your country. \"When in Rome\"....follow their laws or don't travel.", 
        "intTime": 20090505, 
        "postID": 16, 
        "quote": "", 
        "reply": "\"My daughter wouldn't get involved with drugs\" \"I didn't even know she was in Laos\" Sure!!!!! \"The punishment doesn't fit the crime\" Maybe not in your country. \"When in Rome\"....follow their laws or don't travel.", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-05 04:23:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Anyone who takes a flight on any airlines into Saudia Arabia has to fill out a custom form. As they fill it out they will notice in bright red letters it tells one that if you are caught with drugs in the Kingdom the penality is DEATH. Of course the Liberals in this country think this is disgusting and unfair. But I f#cking love it. I would love to see it happen in this country. Even if it meant that my own family members might be caught. I know it would save me allot of money on lawyer fees. It would also solve the problem of over populated prisons in this country and free up the court cases in all of our large cities.", 
        "intTime": 20090505, 
        "postID": 17, 
        "quote": "", 
        "reply": "Anyone who takes a flight on any airlines into Saudia Arabia has to fill out a custom form. As they fill it out they will notice in bright red letters it tells one that if you are caught with drugs in the Kingdom the penality is DEATH. Of course the Liberals in this country think this is disgusting and unfair. But I f#cking love it. I would love to see it happen in this country. Even if it meant that my own family members might be caught. I know it would save me allot of money on lawyer fees. It would also solve the problem of over populated prisons in this country and free up the court cases in all of our large cities.", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-05 04:39:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Anyone who takes a flight on any airlines into Saudia Arabia has to fill out a custom form. As they fill it out they will notice in bright red letters it tells one that if you are caught with drugs in the Kingdom the penality is DEATH. Of course the Liberals in this country think this is disgusting and unfair. But I f#cking love it. I would love to see it happen in this country. Even if it meant that my own family members might be caught. I know it would save me allot of money on lawyer fees. It would also solve the problem of over populated prisons in this country and free up the court cases in all of our large cities. That wouldn't work Duster, case in point, look at all the warnings, advertisements and government help on acquiring a digital converter box these past numerous months and still....people are waiting for someone to come to their door and physical change their TV. You can always tell who are the liberals in cases like this. Tell them, tell them, tell them...and it still doesn't mean crap.", 
        "intTime": 20090505, 
        "postID": 18, 
        "quote": "Originally posted by Duster6: Anyone who takes a flight on any airlines into Saudia Arabia has to fill out a custom form. As they fill it out they will notice in bright red letters it tells one that if you are caught with drugs in the Kingdom the penality is DEATH. Of course the Liberals in this country think this is disgusting and unfair. But I f#cking love it. I would love to see it happen in this country. Even if it meant that my own family members might be caught. I know it would save me allot of money on lawyer fees. It would also solve the problem of over populated prisons in this country and free up the court cases in all of our large cities.", 
        "reply": " That wouldn't work Duster, case in point, look at all the warnings, advertisements and government help on acquiring a digital converter box these past numerous months and still....people are waiting for someone to come to their door and physical change their TV. You can always tell who are the liberals in cases like this. Tell them, tell them, tell them...and it still doesn't mean crap.", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-05 04:48:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "I know you are right. I have been saying it for years. 58% of Americans have an IQ of 62. However, people still think I'm wrong. Why do you think 33% of these people are on welfare?", 
        "intTime": 20090505, 
        "postID": 19, 
        "quote": "", 
        "reply": "I know you are right. I have been saying it for years. 58% of Americans have an IQ of 62. However, people still think I'm wrong. Why do you think 33% of these people are on welfare?", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-05 05:40:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "Duster6"
    }, 
    {
        "content": "I find it hard to sympathize with her plight. Tough drug laws overseas is nothing new and she should have known what she was getting herself into. It is interesting to note that no one has been executed for this in 19 years, so her facing the death penalty is no different than someone in the US facing the death penalty. Chances are, she will not be executed. While I am not in agreement that this should be a capital offense, Laos belongs to the Laotians and it is their call. Her pregnancy is what gets me. Is it a ploy to garner sympathy or was she manipulated or raped? And when the child is born, what citizenship will the child hold? Does British law recognize the child under these circumstances? Will Laos claim the child is Laotian since the father might be a Laotian citizen? This message has been edited. Last edited by: sw614, Tue 05 May 2009 12:08 PM", 
        "intTime": 20090505, 
        "postID": 20, 
        "quote": "", 
        "reply": "I find it hard to sympathize with her plight. Tough drug laws overseas is nothing new and she should have known what she was getting herself into. It is interesting to note that no one has been executed for this in 19 years, so her facing the death penalty is no different than someone in the US facing the death penalty. Chances are, she will not be executed. While I am not in agreement that this should be a capital offense, Laos belongs to the Laotians and it is their call. Her pregnancy is what gets me. Is it a ploy to garner sympathy or was she manipulated or raped? And when the child is born, what citizenship will the child hold? Does British law recognize the child under these circumstances? Will Laos claim the child is Laotian since the father might be a Laotian citizen? This message has been edited. Last edited by: sw614, Tue 05 May 2009 12:08 PM", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-05 07:39:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "sw614"
    }, 
    {
        "content": "What say you all on this? Should she be shot as is? Should the baby be born first then she should be shot? I say she should be put in prison for 20 years and the baby be sent back to Nigeria at Nigeria's expense. BANGKOK, Thailand (CNN) -- A pregnant British woman facing possible execution in Laos will go on trial this week, the country's foreign affairs ministry said Monday. Samantha Orobator became pregnant in prison, according to a spokeswoman for rights group Reprieve. Samantha Orobator \"is facing death by firing squad for drug trafficking,\" said Clare Algar, executive director of Reprieve, a London-based human rights group. Orobator, 20, was arrested on August 5, said Khenthong Nuanthasing, the Ministry of Foreign Affairs spokesman. She was alleged to have been carrying just over half a kilogram (1.1 pounds) of heroin, Reprieve lawyer Anna Morris told CNN by phone from Vientiane, the Laotian capital. \"For that amount of heroin the sentence is normally the death penalty,\" she said. Orobator's mother Jane found out in January her daughter was pregnant -- more than four months after she was arrested, her mother said. Jane Orobator heard the news from the British Foreign Office, which has been monitoring the case, the mother told CNN by phone from Dublin, where she lives. She cannot believe her daughter was involved in drug trafficking, and was surprised to learn she was in Laos, she said. \"I don't know\" what she was doing there, she said. \"The last time she spoke with me, she said she was on holiday in London and she would come to see us in Dublin before returning to the U.K. in July. \"She is not the type of person who would be involved in drugs,\" she added. Reprieve is worried about her health, especially given her pregnancy, Anna Morris said. \"She became pregnant in prison. We are concerned that it may not have been consensual and we are concerned that someone who finds herself in prison at 20 is subject to exploitation,\" she said. She is due to give birth in September, the lawyer added. Reprieve sent Morris from London to Laos to try to help Orobator, Algar said. The lawyer arrived there on Sunday and is hoping to visit Orobator on Tuesday, her boss at Reprieve said. A British consul has also arrived in the country. \"Reprieve heard about her case two weeks ago. We had thought yesterday the trial was going to start today,\" Algar said Monday. \"We have now heard from Anna that it is not going to.\" \"I am the first British lawyer who has asked for access to her,\" Morris said. \"She needs to have a local lawyer appointed to her. We are pressing very hard for the local authorities to appoint one.\" She said it was normal in the Laotian justice system for a defendant to get a lawyer only days before a trial. The last execution in Laos was in 1990, the foreign affairs spokesman said. British Foreign Office Minister Bill Rammell issued a statement about Orobator on Saturday. \"The British Government is opposed to the use of the death penalty in all circumstances. We have made the Laos authorities aware of this at the highest levels in Samantha's case,\" he said. \"We are paying close attention to her welfare and are in regular contact with the Laotian authorities about her case. British Embassy officials, including the Ambassador, have visited her six times since her arrest,\" he said. \"In addition, Britain's consular representatives in Laos, the Australian Embassy, including the Australian Embassy doctor, have visited Samantha 10 times on our behalf,\" he said. There is no British Embassy in Laos. A British vice-consul arrived in the country this weekend, the Foreign Office said Monday. Rammell plans to raise the Orobator case with the Laotian deputy prime minister this week, he said. Samantha Orobator was born in Nigeria and moved to London with her family when she was 8, her mother said. E-mail to a friend | Mixx it | Share", 
        "intTime": 20090504, 
        "postID": 21, 
        "quote": "", 
        "reply": "What say you all on this? Should she be shot as is? Should the baby be born first then she should be shot? I say she should be put in prison for 20 years and the baby be sent back to Nigeria at Nigeria's expense. BANGKOK, Thailand (CNN) -- A pregnant British woman facing possible execution in Laos will go on trial this week, the country's foreign affairs ministry said Monday. Samantha Orobator became pregnant in prison, according to a spokeswoman for rights group Reprieve. Samantha Orobator \"is facing death by firing squad for drug trafficking,\" said Clare Algar, executive director of Reprieve, a London-based human rights group. Orobator, 20, was arrested on August 5, said Khenthong Nuanthasing, the Ministry of Foreign Affairs spokesman. She was alleged to have been carrying just over half a kilogram (1.1 pounds) of heroin, Reprieve lawyer Anna Morris told CNN by phone from Vientiane, the Laotian capital. \"For that amount of heroin the sentence is normally the death penalty,\" she said. Orobator's mother Jane found out in January her daughter was pregnant -- more than four months after she was arrested, her mother said. Jane Orobator heard the news from the British Foreign Office, which has been monitoring the case, the mother told CNN by phone from Dublin, where she lives. She cannot believe her daughter was involved in drug trafficking, and was surprised to learn she was in Laos, she said. \"I don't know\" what she was doing there, she said. \"The last time she spoke with me, she said she was on holiday in London and she would come to see us in Dublin before returning to the U.K. in July. \"She is not the type of person who would be involved in drugs,\" she added. Reprieve is worried about her health, especially given her pregnancy, Anna Morris said. \"She became pregnant in prison. We are concerned that it may not have been consensual and we are concerned that someone who finds herself in prison at 20 is subject to exploitation,\" she said. She is due to give birth in September, the lawyer added. Reprieve sent Morris from London to Laos to try to help Orobator, Algar said. The lawyer arrived there on Sunday and is hoping to visit Orobator on Tuesday, her boss at Reprieve said. A British consul has also arrived in the country. \"Reprieve heard about her case two weeks ago. We had thought yesterday the trial was going to start today,\" Algar said Monday. \"We have now heard from Anna that it is not going to.\" \"I am the first British lawyer who has asked for access to her,\" Morris said. \"She needs to have a local lawyer appointed to her. We are pressing very hard for the local authorities to appoint one.\" She said it was normal in the Laotian justice system for a defendant to get a lawyer only days before a trial. The last execution in Laos was in 1990, the foreign affairs spokesman said. British Foreign Office Minister Bill Rammell issued a statement about Orobator on Saturday. \"The British Government is opposed to the use of the death penalty in all circumstances. We have made the Laos authorities aware of this at the highest levels in Samantha's case,\" he said. \"We are paying close attention to her welfare and are in regular contact with the Laotian authorities about her case. British Embassy officials, including the Ambassador, have visited her six times since her arrest,\" he said. \"In addition, Britain's consular representatives in Laos, the Australian Embassy, including the Australian Embassy doctor, have visited Samantha 10 times on our behalf,\" he said. There is no British Embassy in Laos. A British vice-consul arrived in the country this weekend, the Foreign Office said Monday. Rammell plans to raise the Orobator case with the Laotian deputy prime minister this week, he said. Samantha Orobator was born in Nigeria and moved to London with her family when she was 8, her mother said. E-mail to a friend | Mixx it | Share", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 15:35:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "Duster6"
    }, 
    {
        "content": "She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb.", 
        "intTime": 20090504, 
        "postID": 22, 
        "quote": "", 
        "reply": "She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb.", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 15:40:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Heroin kills people every day, why should I be sympathetic to a Drug Smuggler?", 
        "intTime": 20090504, 
        "postID": 23, 
        "quote": "", 
        "reply": "Heroin kills people every day, why should I be sympathetic to a Drug Smuggler?", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 15:47:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb. See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090504, 
        "postID": 24, 
        "quote": "Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb.", 
        "reply": " See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 16:01:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb. See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime. Alleged crime - this has been somewhat problematic as access to HM Consul and legal advice seems to have been lacking - according to some reports the Foreign and Commonwealth Office only heard about this case recently. But then what do you expect when our idiot government has been closing embassies, High Commissions and consulates to save money (which it then spends on chavs).", 
        "intTime": 20090504, 
        "postID": 25, 
        "quote": "Originally posted by L0A1: quote: Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb. See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime.", 
        "reply": " Alleged crime - this has been somewhat problematic as access to HM Consul and legal advice seems to have been lacking - according to some reports the Foreign and Commonwealth Office only heard about this case recently. But then what do you expect when our idiot government has been closing embassies, High Commissions and consulates to save money (which it then spends on chavs).", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 16:47:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "True but I do not fault her for it, I fault the laws there. The punishment does not fit the crime. An eye for an eye a tooth for a tooth. Drugs do not kill people no more than guns do. I suppose your stance is it's ok to kill the baby as well? After all the baby is attached to the drug smuggler so must be just as guilty.", 
        "intTime": 20090504, 
        "postID": 26, 
        "quote": "", 
        "reply": "True but I do not fault her for it, I fault the laws there. The punishment does not fit the crime. An eye for an eye a tooth for a tooth. Drugs do not kill people no more than guns do. I suppose your stance is it's ok to kill the baby as well? After all the baby is attached to the drug smuggler so must be just as guilty.", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 16:57:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: True but I do not fault her for it, I fault the laws there. The punishment does not fit the crime. An eye for an eye a tooth for a tooth. Drugs do not kill people no more than guns do. I suppose your stance is it's ok to kill the baby as well? After all the baby is attached to the drug smuggler so must be just as guilty. The alternate explanation is that the alleged smuggler realised might be she for the chop and did her best to get up the duff because it's generally not considered sporting to execute pregnant women (except for religious reasons).", 
        "intTime": 20090504, 
        "postID": 27, 
        "quote": "Originally posted by crackerjacks61: True but I do not fault her for it, I fault the laws there. The punishment does not fit the crime. An eye for an eye a tooth for a tooth. Drugs do not kill people no more than guns do. I suppose your stance is it's ok to kill the baby as well? After all the baby is attached to the drug smuggler so must be just as guilty.", 
        "reply": " The alternate explanation is that the alleged smuggler realised might be she for the chop and did her best to get up the duff because it's generally not considered sporting to execute pregnant women (except for religious reasons).", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 17:16:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb. See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime. Alleged crime - this has been somewhat problematic as access to HM Consul and legal advice seems to have been lacking - according to some reports the Foreign and Commonwealth Office only heard about this case recently. But then what do you expect when our idiot government has been closing embassies, High Commissions and consulates to save money (which it then spends on chavs). She was caught with around half a kilo. Alleged? Semantics.. She is guilty. Unless you want to accuse the Laotians of lying, lol. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090504, 
        "postID": 28, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb. See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime. Alleged crime - this has been somewhat problematic as access to HM Consul and legal advice seems to have been lacking - according to some reports the Foreign and Commonwealth Office only heard about this case recently. But then what do you expect when our idiot government has been closing embassies, High Commissions and consulates to save money (which it then spends on chavs).", 
        "reply": " She was caught with around half a kilo. Alleged? Semantics.. She is guilty. Unless you want to accuse the Laotians of lying, lol. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 17:27:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: quote: Originally posted by crackerjacks61: True but I do not fault her for it, I fault the laws there. The punishment does not fit the crime. An eye for an eye a tooth for a tooth. Drugs do not kill people no more than guns do. I suppose your stance is it's ok to kill the baby as well? After all the baby is attached to the drug smuggler so must be just as guilty. The alternate explanation is that the alleged smuggler realised might be she for the chop and did her best to get up the duff because it's generally not considered sporting to execute pregnant women (except for religious reasons). They are saying someone in the Jail knocked her up. They are saying she was not pregnant going in. As far as the baby goes, they may wait until after she gives birth before shooting her. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090504, 
        "postID": 29, 
        "quote": "Originally posted by Bladensburg: quote: Originally posted by crackerjacks61: True but I do not fault her for it, I fault the laws there. The punishment does not fit the crime. An eye for an eye a tooth for a tooth. Drugs do not kill people no more than guns do. I suppose your stance is it's ok to kill the baby as well? After all the baby is attached to the drug smuggler so must be just as guilty. The alternate explanation is that the alleged smuggler realised might be she for the chop and did her best to get up the duff because it's generally not considered sporting to execute pregnant women (except for religious reasons).", 
        "reply": " They are saying someone in the Jail knocked her up. They are saying she was not pregnant going in. As far as the baby goes, they may wait until after she gives birth before shooting her. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 17:30:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "L0A1"
    }, 
    {
        "content": "I wonder what all the pro abortion folks think about this? I would think they wouldn't care if she was pregnant or not.", 
        "intTime": 20090504, 
        "postID": 30, 
        "quote": "", 
        "reply": "I wonder what all the pro abortion folks think about this? I would think they wouldn't care if she was pregnant or not.", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 17:49:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I wonder what all the pro abortion folks think about this? I would think they wouldn't care if she was pregnant or not. 2 birds with 1 bullet? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090504, 
        "postID": 31, 
        "quote": "Originally posted by Duster6: I wonder what all the pro abortion folks think about this? I would think they wouldn't care if she was pregnant or not.", 
        "reply": " 2 birds with 1 bullet? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 18:14:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: [QUOTE]Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb. See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime.[/QUOTEIf she can't to the time(short as it is) she shouldn't do the crime..JMHO.", 
        "intTime": 20090504, 
        "postID": 32, 
        "quote": "Originally posted by L0A1: [QUOTE]Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb.", 
        "reply": " See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime.[/QUOTEIf she can't to the time(short as it is) she shouldn't do the crime..JMHO.", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-04 20:43:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "Migbuster"
    }, 
    {
        "content": "we all know whats going to happen. the uk is going to step in this women will be cut a deal and bam ship back to the uk.", 
        "intTime": 20090505, 
        "postID": 33, 
        "quote": "", 
        "reply": "we all know whats going to happen. the uk is going to step in this women will be cut a deal and bam ship back to the uk.", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-05 00:01:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "world_king377"
    }, 
    {
        "content": "There is a show that I enjoy watching called \"Locked Up Abroad\". Before someone decides to go to another country and break the law, they should watch that show. It is reenactments of people who decided to go overseas and break the law without knowing the consequences of what would happen if caught. This case is not knew. Saudi Arabia and numerous other countries, that are nearly drug and crime free, carry out the death penalty for drug smugglers. Other, almost completely crime free countries use caning as punishment. This happened to an American back when I was on active duty. He went to Japan, broke the law, got caned in public. Americans will always whine about other countries laws because we are so pampered and use to being able to get away with breaking the law with a slap on the wrist.", 
        "intTime": 20090505, 
        "postID": 34, 
        "quote": "", 
        "reply": "There is a show that I enjoy watching called \"Locked Up Abroad\". Before someone decides to go to another country and break the law, they should watch that show. It is reenactments of people who decided to go overseas and break the law without knowing the consequences of what would happen if caught. This case is not knew. Saudi Arabia and numerous other countries, that are nearly drug and crime free, carry out the death penalty for drug smugglers. Other, almost completely crime free countries use caning as punishment. This happened to an American back when I was on active duty. He went to Japan, broke the law, got caned in public. Americans will always whine about other countries laws because we are so pampered and use to being able to get away with breaking the law with a slap on the wrist.", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-05 02:42:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "qsam6"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb. See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime. Alleged crime - this has been somewhat problematic as access to HM Consul and legal advice seems to have been lacking - according to some reports the Foreign and Commonwealth Office only heard about this case recently. But then what do you expect when our idiot government has been closing embassies, High Commissions and consulates to save money (which it then spends on chavs). She was caught with around half a kilo. Alleged? Semantics.. She is guilty. Unless you want to accuse the Laotians of lying, lol. Alleged is alleged, they haven't had the trial yet or presented any actual evidence so how can you be so sure of guilt? And I'd accuse quite a lot of prosecuting authorities of lying from all over the world including the UK and US. They are lawyers after all and their job is usually to get convictions at almost any cost. I always thought that was the reason we had trials but if you can be sure of guilt why bother? I just think that perhaps you might not like it if it was done to you. (Just for the record - on the balance of probability she's guilty BUT I don't know that which is why everyone deserves an advocate.)", 
        "intTime": 20090505, 
        "postID": 35, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Bladensburg: quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: She shouldn't be executed period for drug laws. Legal murder is all that is. Now they are going to kill 2 human beings for something dumb really dumb. See, therin lies the problem. It's another country whose laws have NOT changed. What can ya do? She knew she was doing the crime. Alleged crime - this has been somewhat problematic as access to HM Consul and legal advice seems to have been lacking - according to some reports the Foreign and Commonwealth Office only heard about this case recently. But then what do you expect when our idiot government has been closing embassies, High Commissions and consulates to save money (which it then spends on chavs). She was caught with around half a kilo. Alleged? Semantics.. She is guilty. Unless you want to accuse the Laotians of lying, lol.", 
        "reply": " Alleged is alleged, they haven't had the trial yet or presented any actual evidence so how can you be so sure of guilt? And I'd accuse quite a lot of prosecuting authorities of lying from all over the world including the UK and US. They are lawyers after all and their job is usually to get convictions at almost any cost. I always thought that was the reason we had trials but if you can be sure of guilt why bother? I just think that perhaps you might not like it if it was done to you. (Just for the record - on the balance of probability she's guilty BUT I don't know that which is why everyone deserves an advocate.)", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-05 04:22:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "\"My daughter wouldn't get involved with drugs\" \"I didn't even know she was in Laos\" Sure!!!!! \"The punishment doesn't fit the crime\" Maybe not in your country. \"When in Rome\"....follow their laws or don't travel.", 
        "intTime": 20090505, 
        "postID": 36, 
        "quote": "", 
        "reply": "\"My daughter wouldn't get involved with drugs\" \"I didn't even know she was in Laos\" Sure!!!!! \"The punishment doesn't fit the crime\" Maybe not in your country. \"When in Rome\"....follow their laws or don't travel.", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-05 04:23:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Anyone who takes a flight on any airlines into Saudia Arabia has to fill out a custom form. As they fill it out they will notice in bright red letters it tells one that if you are caught with drugs in the Kingdom the penality is DEATH. Of course the Liberals in this country think this is disgusting and unfair. But I f#cking love it. I would love to see it happen in this country. Even if it meant that my own family members might be caught. I know it would save me allot of money on lawyer fees. It would also solve the problem of over populated prisons in this country and free up the court cases in all of our large cities.", 
        "intTime": 20090505, 
        "postID": 37, 
        "quote": "", 
        "reply": "Anyone who takes a flight on any airlines into Saudia Arabia has to fill out a custom form. As they fill it out they will notice in bright red letters it tells one that if you are caught with drugs in the Kingdom the penality is DEATH. Of course the Liberals in this country think this is disgusting and unfair. But I f#cking love it. I would love to see it happen in this country. Even if it meant that my own family members might be caught. I know it would save me allot of money on lawyer fees. It would also solve the problem of over populated prisons in this country and free up the court cases in all of our large cities.", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-05 04:39:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Anyone who takes a flight on any airlines into Saudia Arabia has to fill out a custom form. As they fill it out they will notice in bright red letters it tells one that if you are caught with drugs in the Kingdom the penality is DEATH. Of course the Liberals in this country think this is disgusting and unfair. But I f#cking love it. I would love to see it happen in this country. Even if it meant that my own family members might be caught. I know it would save me allot of money on lawyer fees. It would also solve the problem of over populated prisons in this country and free up the court cases in all of our large cities. That wouldn't work Duster, case in point, look at all the warnings, advertisements and government help on acquiring a digital converter box these past numerous months and still....people are waiting for someone to come to their door and physical change their TV. You can always tell who are the liberals in cases like this. Tell them, tell them, tell them...and it still doesn't mean crap.", 
        "intTime": 20090505, 
        "postID": 38, 
        "quote": "Originally posted by Duster6: Anyone who takes a flight on any airlines into Saudia Arabia has to fill out a custom form. As they fill it out they will notice in bright red letters it tells one that if you are caught with drugs in the Kingdom the penality is DEATH. Of course the Liberals in this country think this is disgusting and unfair. But I f#cking love it. I would love to see it happen in this country. Even if it meant that my own family members might be caught. I know it would save me allot of money on lawyer fees. It would also solve the problem of over populated prisons in this country and free up the court cases in all of our large cities.", 
        "reply": " That wouldn't work Duster, case in point, look at all the warnings, advertisements and government help on acquiring a digital converter box these past numerous months and still....people are waiting for someone to come to their door and physical change their TV. You can always tell who are the liberals in cases like this. Tell them, tell them, tell them...and it still doesn't mean crap.", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-05 04:48:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "I know you are right. I have been saying it for years. 58% of Americans have an IQ of 62. However, people still think I'm wrong. Why do you think 33% of these people are on welfare?", 
        "intTime": 20090505, 
        "postID": 39, 
        "quote": "", 
        "reply": "I know you are right. I have been saying it for years. 58% of Americans have an IQ of 62. However, people still think I'm wrong. Why do you think 33% of these people are on welfare?", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-05 05:40:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "Duster6"
    }, 
    {
        "content": "I find it hard to sympathize with her plight. Tough drug laws overseas is nothing new and she should have known what she was getting herself into. It is interesting to note that no one has been executed for this in 19 years, so her facing the death penalty is no different than someone in the US facing the death penalty. Chances are, she will not be executed. While I am not in agreement that this should be a capital offense, Laos belongs to the Laotians and it is their call. Her pregnancy is what gets me. Is it a ploy to garner sympathy or was she manipulated or raped? And when the child is born, what citizenship will the child hold? Does British law recognize the child under these circumstances? Will Laos claim the child is Laotian since the father might be a Laotian citizen? This message has been edited. Last edited by: sw614, Tue 05 May 2009 12:08 PM", 
        "intTime": 20090505, 
        "postID": 40, 
        "quote": "", 
        "reply": "I find it hard to sympathize with her plight. Tough drug laws overseas is nothing new and she should have known what she was getting herself into. It is interesting to note that no one has been executed for this in 19 years, so her facing the death penalty is no different than someone in the US facing the death penalty. Chances are, she will not be executed. While I am not in agreement that this should be a capital offense, Laos belongs to the Laotians and it is their call. Her pregnancy is what gets me. Is it a ploy to garner sympathy or was she manipulated or raped? And when the child is born, what citizenship will the child hold? Does British law recognize the child under these circumstances? Will Laos claim the child is Laotian since the father might be a Laotian citizen? This message has been edited. Last edited by: sw614, Tue 05 May 2009 12:08 PM", 
        "threadID": "672198221_7150084222001", 
        "time": "2009-05-05 07:39:00", 
        "title": "Pregnet British woman faces firing squad in Laos", 
        "userID": "sw614"
    }
]