[
    {
        "content": "Senators ask Gen. Patraeus to define Afghanistan goals Pakistan's commitment questioned in Senate hearing WASHINGTON (CNN) -- Days after President Obama announced his strategy for security in Afghanistan, senior Defense Department leaders told a congressional panel more effort is needed to fight the growing insurgency in Pakistan and Afghanistan. \"Considerable further work is required,\" Petraeus said. \"We need to provide the support and assistance to the Pakistani military that will enable them to confront the extremists.\" He said there is no doubt the United States will see more casualties and costs. \"This is going to get harder before it gets easier,\" the general said, echoing the words of Vice President Joe Biden. \"That is our assessment, and it is worth seeing this through to conclusion.\" Flournoy added, \"There will be higher human costs and higher financial costs to this effort.\" Full article found at > >http://www.cnn.com/2009/POLITICS/04/01/senate.pakistan/index.html", 
        "intTime": 20090401, 
        "postID": 1, 
        "quote": "", 
        "reply": "Senators ask Gen. Patraeus to define Afghanistan goals Pakistan's commitment questioned in Senate hearing WASHINGTON (CNN) -- Days after President Obama announced his strategy for security in Afghanistan, senior Defense Department leaders told a congressional panel more effort is needed to fight the growing insurgency in Pakistan and Afghanistan. \"Considerable further work is required,\" Petraeus said. \"We need to provide the support and assistance to the Pakistani military that will enable them to confront the extremists.\" He said there is no doubt the United States will see more casualties and costs. \"This is going to get harder before it gets easier,\" the general said, echoing the words of Vice President Joe Biden. \"That is our assessment, and it is worth seeing this through to conclusion.\" Flournoy added, \"There will be higher human costs and higher financial costs to this effort.\" Full article found at > >http://www.cnn.com/2009/POLITICS/04/01/senate.pakistan/index.html", 
        "threadID": "672198221_4820095912001", 
        "time": "2009-04-01 19:54:00", 
        "title": "Senators ask Gen. Patraeus to define Afghanistan goals.", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: Senators ask Gen. Patraeus to define Afghanistan goals Pakistan's commitment questioned in Senate hearing WASHINGTON (CNN) -- Days after President Obama announced his strategy for security in Afghanistan, senior Defense Department leaders told a congressional panel more effort is needed to fight the growing insurgency in Pakistan and Afghanistan. \"Considerable further work is required,\" Petraeus said. \"We need to provide the support and assistance to the Pakistani military that will enable them to confront the extremists.\" He said there is no doubt the United States will see more casualties and costs. \"This is going to get harder before it gets easier,\" the general said, echoing the words of Vice President Joe Biden. \"That is our assessment, and it is worth seeing this through to conclusion.\" Flournoy added, \"There will be higher human costs and higher financial costs to this effort.\" Full article found at > >http://www.cnn.com/2009/POLITICS/04/01/senate.pakistan/index.html You just can't walk into the Oval Office like you used to and get a rubber stamp on anything you want to do, right General?. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090402, 
        "postID": 2, 
        "quote": "Originally posted by IHAWKER: Senators ask Gen. Patraeus to define Afghanistan goals Pakistan's commitment questioned in Senate hearing WASHINGTON (CNN) -- Days after President Obama announced his strategy for security in Afghanistan, senior Defense Department leaders told a congressional panel more effort is needed to fight the growing insurgency in Pakistan and Afghanistan. \"Considerable further work is required,\" Petraeus said. \"We need to provide the support and assistance to the Pakistani military that will enable them to confront the extremists.\" He said there is no doubt the United States will see more casualties and costs. \"This is going to get harder before it gets easier,\" the general said, echoing the words of Vice President Joe Biden. \"That is our assessment, and it is worth seeing this through to conclusion.\" Flournoy added, \"There will be higher human costs and higher financial costs to this effort.\" Full article found at > >http://www.cnn.com/2009/POLITICS/04/01/senate.pakistan/index.html", 
        "reply": " You just can't walk into the Oval Office like you used to and get a rubber stamp on anything you want to do, right General?. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4820095912001", 
        "time": "2009-04-02 06:48:00", 
        "title": "Senators ask Gen. Patraeus to define Afghanistan goals.", 
        "userID": "jack_flats"
    }, 
    {
        "content": "But Petraeus would still be the smartest man in that room", 
        "intTime": 20090402, 
        "postID": 3, 
        "quote": "", 
        "reply": "But Petraeus would still be the smartest man in that room", 
        "threadID": "672198221_4820095912001", 
        "time": "2009-04-02 09:44:00", 
        "title": "Senators ask Gen. Patraeus to define Afghanistan goals.", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: But Petraeus would still be the smartest man in that room He certainly was during the last administration. It is yet to be proven on this current administration.", 
        "intTime": 20090402, 
        "postID": 4, 
        "quote": "Originally posted by LineDoggie: But Petraeus would still be the smartest man in that room", 
        "reply": " He certainly was during the last administration. It is yet to be proven on this current administration.", 
        "threadID": "672198221_4820095912001", 
        "time": "2009-04-02 09:57:00", 
        "title": "Senators ask Gen. Patraeus to define Afghanistan goals.", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: quote: Originally posted by LineDoggie: But Petraeus would still be the smartest man in that room He certainly was during the last administration. It is yet to be proven on this current administration. Well, Obama was smart enough to fool half the people one time", 
        "intTime": 20090402, 
        "postID": 5, 
        "quote": "Originally posted by IHAWKER: quote: Originally posted by LineDoggie: But Petraeus would still be the smartest man in that room He certainly was during the last administration. It is yet to be proven on this current administration.", 
        "reply": " Well, Obama was smart enough to fool half the people one time", 
        "threadID": "672198221_4820095912001", 
        "time": "2009-04-02 16:39:00", 
        "title": "Senators ask Gen. Patraeus to define Afghanistan goals.", 
        "userID": "EAG154"
    }, 
    {
        "content": "\"But the chairman of the committee, Sen. Carl Levin, D-Michigan, expressed doubt about the administration's plan, which puts much more emphasis on working with Pakistan to help it solve its own insurgency problems and close the porous border. \"I remain skeptical that Pakistan has the will or capability to secure their border,\" Levin said. The good Senators were not questioning the Generals or the past administration on how they handle Pakistan but the current holder of the White House and his reliance on Islamabad. You guys need to read your own post.", 
        "intTime": 20090402, 
        "postID": 6, 
        "quote": "", 
        "reply": "\"But the chairman of the committee, Sen. Carl Levin, D-Michigan, expressed doubt about the administration's plan, which puts much more emphasis on working with Pakistan to help it solve its own insurgency problems and close the porous border. \"I remain skeptical that Pakistan has the will or capability to secure their border,\" Levin said. The good Senators were not questioning the Generals or the past administration on how they handle Pakistan but the current holder of the White House and his reliance on Islamabad. You guys need to read your own post.", 
        "threadID": "672198221_4820095912001", 
        "time": "2009-04-02 17:03:00", 
        "title": "Senators ask Gen. Patraeus to define Afghanistan goals.", 
        "userID": "rayevinsonsr"
    }
]