[
    {
        "content": "The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090422, 
        "postID": 1, 
        "quote": "", 
        "reply": "The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-22 11:33:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers.", 
        "intTime": 20090422, 
        "postID": 2, 
        "quote": "Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\"", 
        "reply": " IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers.", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-22 12:33:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. I agree with you and I applaud the SP for making such a ruling. More rulings like this need to take place...like tasering people for no reason.", 
        "intTime": 20090422, 
        "postID": 3, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers.", 
        "reply": " I agree with you and I applaud the SP for making such a ruling. More rulings like this need to take place...like tasering people for no reason.", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-22 14:19:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. Never saw the constitutionality in searching a car stopped for speeding anyway. Your right, this power was grossly abused by many officers and departments", 
        "intTime": 20090422, 
        "postID": 4, 
        "quote": "IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers.", 
        "reply": " Never saw the constitutionality in searching a car stopped for speeding anyway. Your right, this power was grossly abused by many officers and departments", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-22 19:33:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Now they need to revisit illegal check points. Quick stopping people without probable cause.", 
        "intTime": 20090423, 
        "postID": 5, 
        "quote": "", 
        "reply": "Now they need to revisit illegal check points. Quick stopping people without probable cause.", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-23 04:41:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. Never saw the constitutionality in searching a car stopped for speeding anyway. Your right, this power was grossly abused by many officers and departments What I was always curious about, were \"motor homes\", that were a person's actual residence, as say in the case of a retired person or couple... If there was an \"open container\" or a fire arm in the vehicle, which was a place of residence, would it be a violation of \"unlawful search and seizure\" to bust someone, for the open container or firearm, as this was also their place of residence... One wonders... Respectfully, SUNLINER81", 
        "intTime": 20090423, 
        "postID": 6, 
        "quote": "Originally posted by FlankerFlyer: quote: IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. Never saw the constitutionality in searching a car stopped for speeding anyway. Your right, this power was grossly abused by many officers and departments", 
        "reply": " What I was always curious about, were \"motor homes\", that were a person's actual residence, as say in the case of a retired person or couple... If there was an \"open container\" or a fire arm in the vehicle, which was a place of residence, would it be a violation of \"unlawful search and seizure\" to bust someone, for the open container or firearm, as this was also their place of residence... One wonders... Respectfully, SUNLINER81", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-23 05:07:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by FlankerFlyer: quote: IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. Never saw the constitutionality in searching a car stopped for speeding anyway. Your right, this power was grossly abused by many officers and departments What I was always curious about, were \"motor homes\", that were a person's actual residence, as say in the case of a retired person or couple... If there was an \"open container\" or a fire arm in the vehicle, which was a place of residence, would it be a violation of \"unlawful search and seizure\" to bust someone, for the open container or firearm, as this was also their place of residence... One wonders... Respectfully, SUNLINER81 You should have been a lawyer.... (No insult intended) I have no idea, but isn't it true that you're not allowed to ride in the home; you have to be in the cab when moving? If (notice the \"if\") this is true, how would the cops notice an open container? Dave", 
        "intTime": 20090423, 
        "postID": 7, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by FlankerFlyer: quote: IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. Never saw the constitutionality in searching a car stopped for speeding anyway. Your right, this power was grossly abused by many officers and departments What I was always curious about, were \"motor homes\", that were a person's actual residence, as say in the case of a retired person or couple... If there was an \"open container\" or a fire arm in the vehicle, which was a place of residence, would it be a violation of \"unlawful search and seizure\" to bust someone, for the open container or firearm, as this was also their place of residence... One wonders... Respectfully, SUNLINER81", 
        "reply": " You should have been a lawyer.... (No insult intended) I have no idea, but isn't it true that you're not allowed to ride in the home; you have to be in the cab when moving? If (notice the \"if\") this is true, how would the cops notice an open container? Dave", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-23 11:56:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by SUNLINER81: quote: Originally posted by FlankerFlyer: quote: IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. Never saw the constitutionality in searching a car stopped for speeding anyway. Your right, this power was grossly abused by many officers and departments What I was always curious about, were \"motor homes\", that were a person's actual residence, as say in the case of a retired person or couple... If there was an \"open container\" or a fire arm in the vehicle, which was a place of residence, would it be a violation of \"unlawful search and seizure\" to bust someone, for the open container or firearm, as this was also their place of residence... One wonders... Respectfully, SUNLINER81 You should have been a lawyer.... (No insult intended) I have no idea, but isn't it true that you're not allowed to ride in the home; you have to be in the cab when moving? If (notice the \"if\") this is true, how would the cops notice an open container? Dave Don't know but there are a lot of people that do and it was a law, in California, that you could ride in a truck camper, if there was a means of two way communication between those in the camper and those in the cab of the truck, i.e. the driver, my Dad used to have a truck camper and I used to ride in it, thought it was neat to ride back there and you used to see kids riding in the \"cab over\" and watching as they went down the road... Like I say, I don't know now and I'm just curious about it... Respectfully, SUNLINER81", 
        "intTime": 20090423, 
        "postID": 8, 
        "quote": "Originally posted by Grachus: quote: Originally posted by SUNLINER81: quote: Originally posted by FlankerFlyer: quote: IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. Never saw the constitutionality in searching a car stopped for speeding anyway. Your right, this power was grossly abused by many officers and departments What I was always curious about, were \"motor homes\", that were a person's actual residence, as say in the case of a retired person or couple... If there was an \"open container\" or a fire arm in the vehicle, which was a place of residence, would it be a violation of \"unlawful search and seizure\" to bust someone, for the open container or firearm, as this was also their place of residence... One wonders... Respectfully, SUNLINER81 You should have been a lawyer.... (No insult intended) I have no idea, but isn't it true that you're not allowed to ride in the home; you have to be in the cab when moving? If (notice the \"if\") this is true, how would the cops notice an open container? Dave", 
        "reply": " Don't know but there are a lot of people that do and it was a law, in California, that you could ride in a truck camper, if there was a means of two way communication between those in the camper and those in the cab of the truck, i.e. the driver, my Dad used to have a truck camper and I used to ride in it, thought it was neat to ride back there and you used to see kids riding in the \"cab over\" and watching as they went down the road... Like I say, I don't know now and I'm just curious about it... Respectfully, SUNLINER81", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-23 18:08:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I'm not sure if there is a problem caused by other agencies but I know when I searched cars, it was either; Search incident to an arrest....I could search the immediate area of the person being arrested, basically a reasonable distance that the person could toss evidence if stopped. However, if the car were going to be seized, then the entire car gets searched, period. The other is simply \"Conscent\". Many drivers feel they can't say \"No\" when asked for permission to search. Frankly, I was always surprised at those who conscented knowing they had drugs in the car. Often times when a driver says no, the next step for the officer would be to run a dog around the vehicle and see if it alerts to narcotics. If it does, there's your PC to search without conscent. Now the catch is, what length of time is reasonable to have a driver wait for a dog to arrive onscene. That one is up to the courts to decide. Don", 
        "intTime": 20090424, 
        "postID": 9, 
        "quote": "", 
        "reply": "I'm not sure if there is a problem caused by other agencies but I know when I searched cars, it was either; Search incident to an arrest....I could search the immediate area of the person being arrested, basically a reasonable distance that the person could toss evidence if stopped. However, if the car were going to be seized, then the entire car gets searched, period. The other is simply \"Conscent\". Many drivers feel they can't say \"No\" when asked for permission to search. Frankly, I was always surprised at those who conscented knowing they had drugs in the car. Often times when a driver says no, the next step for the officer would be to run a dog around the vehicle and see if it alerts to narcotics. If it does, there's your PC to search without conscent. Now the catch is, what length of time is reasonable to have a driver wait for a dog to arrive onscene. That one is up to the courts to decide. Don", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-24 03:59:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "This is a two edged sword. I enjoy hearing time and time again of the Highway PAtrol stopping some car for speeding or a bad lane change, and finding out the there is a ton of cocaine inside begin shipped across our state - - At the same time, I don't want some cop pulling me over for a ticket, then demanding that I allow my car to be search, even though I would never have anything inside of an illegal nature. Search without probable cause or warrant goes against the privacy and protection guaranteed in the Constitution to a free people. Wars were fought to keep and maintain those rights - - Yet, I have a son who is a policeman, and I want him to help stop the illegal drug and other activity that is hurting our state and nation - - If you tie the hands of the police, only the creeps and crooks benefit - YUK!! Wandering and Wondering", 
        "intTime": 20090424, 
        "postID": 10, 
        "quote": "", 
        "reply": "This is a two edged sword. I enjoy hearing time and time again of the Highway PAtrol stopping some car for speeding or a bad lane change, and finding out the there is a ton of cocaine inside begin shipped across our state - - At the same time, I don't want some cop pulling me over for a ticket, then demanding that I allow my car to be search, even though I would never have anything inside of an illegal nature. Search without probable cause or warrant goes against the privacy and protection guaranteed in the Constitution to a free people. Wars were fought to keep and maintain those rights - - Yet, I have a son who is a policeman, and I want him to help stop the illegal drug and other activity that is hurting our state and nation - - If you tie the hands of the police, only the creeps and crooks benefit - YUK!! Wandering and Wondering", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-24 12:54:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Bottom-line, if a cop stops me for a traffic violation he has no damn right to search my vehicle....bring the damn dog cause you're not getting in here.", 
        "intTime": 20090424, 
        "postID": 11, 
        "quote": "", 
        "reply": "Bottom-line, if a cop stops me for a traffic violation he has no damn right to search my vehicle....bring the damn dog cause you're not getting in here.", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-24 12:58:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Why even bother searching a car if you don't have a reason to? If there's no reasonable suspicion, write the stupid ticket and get going so you can pull someone else over for speeding and make your county money.", 
        "intTime": 20090424, 
        "postID": 12, 
        "quote": "", 
        "reply": "Why even bother searching a car if you don't have a reason to? If there's no reasonable suspicion, write the stupid ticket and get going so you can pull someone else over for speeding and make your county money.", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-24 13:31:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. It happened to me. A police officer pulled me over because my registration sticker was expired , I had new registratioon, just hadn't had the time to put the new sticker on. Even after he verified I was registrared, he asked if he could search my bag inside my car and my car. I felt I had no choice and gave in. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090424, 
        "postID": 13, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers.", 
        "reply": " It happened to me. A police officer pulled me over because my registration sticker was expired , I had new registratioon, just hadn't had the time to put the new sticker on. Even after he verified I was registrared, he asked if he could search my bag inside my car and my car. I felt I had no choice and gave in. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-24 13:41:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: [ It happened to me. A police officer pulled me over because my registration sticker was expired , I had new registratioon, just hadn't had the time to put the new sticker on. Even after he verified I was registrared, he asked if he could search my bag inside my car and my car. I felt I had no choice and gave in. Civil Liberties experts caution not to resist such an illegal search. They recomend that you tell the police that \"you will comply with this illegal search.\" Just to let them know that YOU KNOW they are violating the law. I've followed this advice. Giving the above statement in a perfectly civil manner. One time they searched my car anyway, one time they backed off. Dave", 
        "intTime": 20090424, 
        "postID": 14, 
        "quote": "Originally posted by L0A1: [ It happened to me. A police officer pulled me over because my registration sticker was expired , I had new registratioon, just hadn't had the time to put the new sticker on. Even after he verified I was registrared, he asked if he could search my bag inside my car and my car. I felt I had no choice and gave in.", 
        "reply": " Civil Liberties experts caution not to resist such an illegal search. They recomend that you tell the police that \"you will comply with this illegal search.\" Just to let them know that YOU KNOW they are violating the law. I've followed this advice. Giving the above statement in a perfectly civil manner. One time they searched my car anyway, one time they backed off. Dave", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-24 13:53:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Just to let them know that YOU KNOW they are violating the law. I've followed this advice. Giving the above statement in a perfectly civil manner. One time they searched my car anyway, one time they backed off. Dave They're the ones with the guns. If you're going to stand there and argue over your rights you are an idiot. Wait until it's over and go through the proper legal channels afterward.", 
        "intTime": 20090424, 
        "postID": 15, 
        "quote": "Originally posted by Grachus: Just to let them know that YOU KNOW they are violating the law. I've followed this advice. Giving the above statement in a perfectly civil manner. One time they searched my car anyway, one time they backed off. Dave", 
        "reply": " They're the ones with the guns. If you're going to stand there and argue over your rights you are an idiot. Wait until it's over and go through the proper legal channels afterward.", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-24 14:08:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Grachus: Just to let them know that YOU KNOW they are violating the law. I've followed this advice. Giving the above statement in a perfectly civil manner. One time they searched my car anyway, one time they backed off. Dave They're the ones with the guns. If you're going to stand there and argue over your rights you are an idiot. Wait until it's over and go through the proper legal channels afterward. im sure this is a good deterent for those commiting crimes to know they will not be searched on small charges especially drugs, many states are now legalizing small amounts whats next???? airport searches to be stopped", 
        "intTime": 20090425, 
        "postID": 16, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Grachus: Just to let them know that YOU KNOW they are violating the law. I've followed this advice. Giving the above statement in a perfectly civil manner. One time they searched my car anyway, one time they backed off. Dave They're the ones with the guns. If you're going to stand there and argue over your rights you are an idiot. Wait until it's over and go through the proper legal channels afterward.", 
        "reply": " im sure this is a good deterent for those commiting crimes to know they will not be searched on small charges especially drugs, many states are now legalizing small amounts whats next???? airport searches to be stopped", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-25 18:39:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: whats next???? airport searches to be stopped Constitutionally, they are extremely questionable, but you are buying a service from someone who has the right to refuse service. They could simply turn away anyone who refuses to cooperate . . . Wandering and Wondering", 
        "intTime": 20090425, 
        "postID": 17, 
        "quote": "whats next???? airport searches to be stopped", 
        "reply": " Constitutionally, they are extremely questionable, but you are buying a service from someone who has the right to refuse service. They could simply turn away anyone who refuses to cooperate . . . Wandering and Wondering", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-25 19:35:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" As a former law enforcement officer, I am actually proud of the USSC for this. I have been seeing way too many SILAS searches based on poop. Law enforcement has used that SILAS to death. It is about time. Now maybe they will start having to do some law enforcement and not just \"hunting\" for the almighty twinkie ! One or two downsides however are as follow: Now, with the gun nexus as the ultimate probable cause, EVERY single time you get stopped, the cop is going to ask you if you have a gun in the car, regardless if it is not in your manual possession, but THEY will have search your car to find that out since of course they will not be able to take YOUR word for it! So, it is good in a way since an upstanding citizen can get a concealed weapons permit (except in liberal states where guns are evil anyway)then you can keep it on you or right next to you CONCEALED, where a criminal won't get away with it!! About d*** time !!!!!! If it is in proximity to your wife, child, or friend, they are in violation unless they have a concealed weapons license. I feel sorry for all you people who want to be able to protect yourself in liberal states like Massachusetts or New York... NOT !! Move away from the libidiot areas.", 
        "intTime": 20090425, 
        "postID": 18, 
        "quote": "Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\"", 
        "reply": " As a former law enforcement officer, I am actually proud of the USSC for this. I have been seeing way too many SILAS searches based on poop. Law enforcement has used that SILAS to death. It is about time. Now maybe they will start having to do some law enforcement and not just \"hunting\" for the almighty twinkie ! One or two downsides however are as follow: Now, with the gun nexus as the ultimate probable cause, EVERY single time you get stopped, the cop is going to ask you if you have a gun in the car, regardless if it is not in your manual possession, but THEY will have search your car to find that out since of course they will not be able to take YOUR word for it! So, it is good in a way since an upstanding citizen can get a concealed weapons permit (except in liberal states where guns are evil anyway)then you can keep it on you or right next to you CONCEALED, where a criminal won't get away with it!! About d*** time !!!!!! If it is in proximity to your wife, child, or friend, they are in violation unless they have a concealed weapons license. I feel sorry for all you people who want to be able to protect yourself in liberal states like Massachusetts or New York... NOT !! Move away from the libidiot areas.", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-25 20:26:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "SP_Five_O"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by rayld2: quote: Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. I agree with you and I applaud the SP for making such a ruling. More rulings like this need to take place...like tasering people for no reason.", 
        "intTime": 20090425, 
        "postID": 19, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by rayld2: quote: Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. I agree with you and I applaud the SP for making such a ruling. More rulings like this need to take place...like tasering people for no reason.", 
        "reply": "", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-25 20:28:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "SP_Five_O"
    }, 
    {
        "content": "quote: Originally posted by PSimon572: Now they need to revisit illegal check points. Quick stopping people without probable cause. Did you know, for instance in Florida, a check point stop allows the police to ONLY check safety issues such as a DUI (limited to obvious usually), equipment like lights and tires, drivers license check, but not insurance, registration (making you produce it when it is on your tag - not their alleged reason for stopping you anyway), and they can't investigate criminal activity unless it knocks their eyes out (no searches allowed without consent, but they usually get that consent sometimes by insinuating a search warrant will be promptly obtained within minutes, and you have to wait, which is not true!! Unless they have a reasonable suspicion (easily done admittedly) then they need to pass you on. If a judge finds out that their alleged PC was weak for a search though(during a check point stop only), he will throw it out. Check points will probably remain, but maybe they will be more limited. They are a main source of getting DUI's and drivers license violations, both of which MADD adores, so go figure. No USSC justice wants to be blamed by MADD's network of being light on DUI's.", 
        "intTime": 20090425, 
        "postID": 20, 
        "quote": "Originally posted by PSimon572: Now they need to revisit illegal check points. Quick stopping people without probable cause.", 
        "reply": " Did you know, for instance in Florida, a check point stop allows the police to ONLY check safety issues such as a DUI (limited to obvious usually), equipment like lights and tires, drivers license check, but not insurance, registration (making you produce it when it is on your tag - not their alleged reason for stopping you anyway), and they can't investigate criminal activity unless it knocks their eyes out (no searches allowed without consent, but they usually get that consent sometimes by insinuating a search warrant will be promptly obtained within minutes, and you have to wait, which is not true!! Unless they have a reasonable suspicion (easily done admittedly) then they need to pass you on. If a judge finds out that their alleged PC was weak for a search though(during a check point stop only), he will throw it out. Check points will probably remain, but maybe they will be more limited. They are a main source of getting DUI's and drivers license violations, both of which MADD adores, so go figure. No USSC justice wants to be blamed by MADD's network of being light on DUI's.", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-25 20:40:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "SP_Five_O"
    }, 
    {
        "content": "The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090422, 
        "postID": 21, 
        "quote": "", 
        "reply": "The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-22 11:33:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers.", 
        "intTime": 20090422, 
        "postID": 22, 
        "quote": "Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\"", 
        "reply": " IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers.", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-22 12:33:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. I agree with you and I applaud the SP for making such a ruling. More rulings like this need to take place...like tasering people for no reason.", 
        "intTime": 20090422, 
        "postID": 23, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers.", 
        "reply": " I agree with you and I applaud the SP for making such a ruling. More rulings like this need to take place...like tasering people for no reason.", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-22 14:19:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. Never saw the constitutionality in searching a car stopped for speeding anyway. Your right, this power was grossly abused by many officers and departments", 
        "intTime": 20090422, 
        "postID": 24, 
        "quote": "IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers.", 
        "reply": " Never saw the constitutionality in searching a car stopped for speeding anyway. Your right, this power was grossly abused by many officers and departments", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-22 19:33:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Now they need to revisit illegal check points. Quick stopping people without probable cause.", 
        "intTime": 20090423, 
        "postID": 25, 
        "quote": "", 
        "reply": "Now they need to revisit illegal check points. Quick stopping people without probable cause.", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-23 04:41:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. Never saw the constitutionality in searching a car stopped for speeding anyway. Your right, this power was grossly abused by many officers and departments What I was always curious about, were \"motor homes\", that were a person's actual residence, as say in the case of a retired person or couple... If there was an \"open container\" or a fire arm in the vehicle, which was a place of residence, would it be a violation of \"unlawful search and seizure\" to bust someone, for the open container or firearm, as this was also their place of residence... One wonders... Respectfully, SUNLINER81", 
        "intTime": 20090423, 
        "postID": 26, 
        "quote": "Originally posted by FlankerFlyer: quote: IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. Never saw the constitutionality in searching a car stopped for speeding anyway. Your right, this power was grossly abused by many officers and departments", 
        "reply": " What I was always curious about, were \"motor homes\", that were a person's actual residence, as say in the case of a retired person or couple... If there was an \"open container\" or a fire arm in the vehicle, which was a place of residence, would it be a violation of \"unlawful search and seizure\" to bust someone, for the open container or firearm, as this was also their place of residence... One wonders... Respectfully, SUNLINER81", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-23 05:07:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by FlankerFlyer: quote: IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. Never saw the constitutionality in searching a car stopped for speeding anyway. Your right, this power was grossly abused by many officers and departments What I was always curious about, were \"motor homes\", that were a person's actual residence, as say in the case of a retired person or couple... If there was an \"open container\" or a fire arm in the vehicle, which was a place of residence, would it be a violation of \"unlawful search and seizure\" to bust someone, for the open container or firearm, as this was also their place of residence... One wonders... Respectfully, SUNLINER81 You should have been a lawyer.... (No insult intended) I have no idea, but isn't it true that you're not allowed to ride in the home; you have to be in the cab when moving? If (notice the \"if\") this is true, how would the cops notice an open container? Dave", 
        "intTime": 20090423, 
        "postID": 27, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by FlankerFlyer: quote: IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. Never saw the constitutionality in searching a car stopped for speeding anyway. Your right, this power was grossly abused by many officers and departments What I was always curious about, were \"motor homes\", that were a person's actual residence, as say in the case of a retired person or couple... If there was an \"open container\" or a fire arm in the vehicle, which was a place of residence, would it be a violation of \"unlawful search and seizure\" to bust someone, for the open container or firearm, as this was also their place of residence... One wonders... Respectfully, SUNLINER81", 
        "reply": " You should have been a lawyer.... (No insult intended) I have no idea, but isn't it true that you're not allowed to ride in the home; you have to be in the cab when moving? If (notice the \"if\") this is true, how would the cops notice an open container? Dave", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-23 11:56:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by SUNLINER81: quote: Originally posted by FlankerFlyer: quote: IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. Never saw the constitutionality in searching a car stopped for speeding anyway. Your right, this power was grossly abused by many officers and departments What I was always curious about, were \"motor homes\", that were a person's actual residence, as say in the case of a retired person or couple... If there was an \"open container\" or a fire arm in the vehicle, which was a place of residence, would it be a violation of \"unlawful search and seizure\" to bust someone, for the open container or firearm, as this was also their place of residence... One wonders... Respectfully, SUNLINER81 You should have been a lawyer.... (No insult intended) I have no idea, but isn't it true that you're not allowed to ride in the home; you have to be in the cab when moving? If (notice the \"if\") this is true, how would the cops notice an open container? Dave Don't know but there are a lot of people that do and it was a law, in California, that you could ride in a truck camper, if there was a means of two way communication between those in the camper and those in the cab of the truck, i.e. the driver, my Dad used to have a truck camper and I used to ride in it, thought it was neat to ride back there and you used to see kids riding in the \"cab over\" and watching as they went down the road... Like I say, I don't know now and I'm just curious about it... Respectfully, SUNLINER81", 
        "intTime": 20090423, 
        "postID": 28, 
        "quote": "Originally posted by Grachus: quote: Originally posted by SUNLINER81: quote: Originally posted by FlankerFlyer: quote: IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. Never saw the constitutionality in searching a car stopped for speeding anyway. Your right, this power was grossly abused by many officers and departments What I was always curious about, were \"motor homes\", that were a person's actual residence, as say in the case of a retired person or couple... If there was an \"open container\" or a fire arm in the vehicle, which was a place of residence, would it be a violation of \"unlawful search and seizure\" to bust someone, for the open container or firearm, as this was also their place of residence... One wonders... Respectfully, SUNLINER81 You should have been a lawyer.... (No insult intended) I have no idea, but isn't it true that you're not allowed to ride in the home; you have to be in the cab when moving? If (notice the \"if\") this is true, how would the cops notice an open container? Dave", 
        "reply": " Don't know but there are a lot of people that do and it was a law, in California, that you could ride in a truck camper, if there was a means of two way communication between those in the camper and those in the cab of the truck, i.e. the driver, my Dad used to have a truck camper and I used to ride in it, thought it was neat to ride back there and you used to see kids riding in the \"cab over\" and watching as they went down the road... Like I say, I don't know now and I'm just curious about it... Respectfully, SUNLINER81", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-23 18:08:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I'm not sure if there is a problem caused by other agencies but I know when I searched cars, it was either; Search incident to an arrest....I could search the immediate area of the person being arrested, basically a reasonable distance that the person could toss evidence if stopped. However, if the car were going to be seized, then the entire car gets searched, period. The other is simply \"Conscent\". Many drivers feel they can't say \"No\" when asked for permission to search. Frankly, I was always surprised at those who conscented knowing they had drugs in the car. Often times when a driver says no, the next step for the officer would be to run a dog around the vehicle and see if it alerts to narcotics. If it does, there's your PC to search without conscent. Now the catch is, what length of time is reasonable to have a driver wait for a dog to arrive onscene. That one is up to the courts to decide. Don", 
        "intTime": 20090424, 
        "postID": 29, 
        "quote": "", 
        "reply": "I'm not sure if there is a problem caused by other agencies but I know when I searched cars, it was either; Search incident to an arrest....I could search the immediate area of the person being arrested, basically a reasonable distance that the person could toss evidence if stopped. However, if the car were going to be seized, then the entire car gets searched, period. The other is simply \"Conscent\". Many drivers feel they can't say \"No\" when asked for permission to search. Frankly, I was always surprised at those who conscented knowing they had drugs in the car. Often times when a driver says no, the next step for the officer would be to run a dog around the vehicle and see if it alerts to narcotics. If it does, there's your PC to search without conscent. Now the catch is, what length of time is reasonable to have a driver wait for a dog to arrive onscene. That one is up to the courts to decide. Don", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-24 03:59:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "This is a two edged sword. I enjoy hearing time and time again of the Highway PAtrol stopping some car for speeding or a bad lane change, and finding out the there is a ton of cocaine inside begin shipped across our state - - At the same time, I don't want some cop pulling me over for a ticket, then demanding that I allow my car to be search, even though I would never have anything inside of an illegal nature. Search without probable cause or warrant goes against the privacy and protection guaranteed in the Constitution to a free people. Wars were fought to keep and maintain those rights - - Yet, I have a son who is a policeman, and I want him to help stop the illegal drug and other activity that is hurting our state and nation - - If you tie the hands of the police, only the creeps and crooks benefit - YUK!! Wandering and Wondering", 
        "intTime": 20090424, 
        "postID": 30, 
        "quote": "", 
        "reply": "This is a two edged sword. I enjoy hearing time and time again of the Highway PAtrol stopping some car for speeding or a bad lane change, and finding out the there is a ton of cocaine inside begin shipped across our state - - At the same time, I don't want some cop pulling me over for a ticket, then demanding that I allow my car to be search, even though I would never have anything inside of an illegal nature. Search without probable cause or warrant goes against the privacy and protection guaranteed in the Constitution to a free people. Wars were fought to keep and maintain those rights - - Yet, I have a son who is a policeman, and I want him to help stop the illegal drug and other activity that is hurting our state and nation - - If you tie the hands of the police, only the creeps and crooks benefit - YUK!! Wandering and Wondering", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-24 12:54:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "Bottom-line, if a cop stops me for a traffic violation he has no damn right to search my vehicle....bring the damn dog cause you're not getting in here.", 
        "intTime": 20090424, 
        "postID": 31, 
        "quote": "", 
        "reply": "Bottom-line, if a cop stops me for a traffic violation he has no damn right to search my vehicle....bring the damn dog cause you're not getting in here.", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-24 12:58:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Why even bother searching a car if you don't have a reason to? If there's no reasonable suspicion, write the stupid ticket and get going so you can pull someone else over for speeding and make your county money.", 
        "intTime": 20090424, 
        "postID": 32, 
        "quote": "", 
        "reply": "Why even bother searching a car if you don't have a reason to? If there's no reasonable suspicion, write the stupid ticket and get going so you can pull someone else over for speeding and make your county money.", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-24 13:31:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. It happened to me. A police officer pulled me over because my registration sticker was expired , I had new registratioon, just hadn't had the time to put the new sticker on. Even after he verified I was registrared, he asked if he could search my bag inside my car and my car. I felt I had no choice and gave in. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090424, 
        "postID": 33, 
        "quote": "Originally posted by rayld2: quote: Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers.", 
        "reply": " It happened to me. A police officer pulled me over because my registration sticker was expired , I had new registratioon, just hadn't had the time to put the new sticker on. Even after he verified I was registrared, he asked if he could search my bag inside my car and my car. I felt I had no choice and gave in. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-24 13:41:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: [ It happened to me. A police officer pulled me over because my registration sticker was expired , I had new registratioon, just hadn't had the time to put the new sticker on. Even after he verified I was registrared, he asked if he could search my bag inside my car and my car. I felt I had no choice and gave in. Civil Liberties experts caution not to resist such an illegal search. They recomend that you tell the police that \"you will comply with this illegal search.\" Just to let them know that YOU KNOW they are violating the law. I've followed this advice. Giving the above statement in a perfectly civil manner. One time they searched my car anyway, one time they backed off. Dave", 
        "intTime": 20090424, 
        "postID": 34, 
        "quote": "Originally posted by L0A1: [ It happened to me. A police officer pulled me over because my registration sticker was expired , I had new registratioon, just hadn't had the time to put the new sticker on. Even after he verified I was registrared, he asked if he could search my bag inside my car and my car. I felt I had no choice and gave in.", 
        "reply": " Civil Liberties experts caution not to resist such an illegal search. They recomend that you tell the police that \"you will comply with this illegal search.\" Just to let them know that YOU KNOW they are violating the law. I've followed this advice. Giving the above statement in a perfectly civil manner. One time they searched my car anyway, one time they backed off. Dave", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-24 13:53:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Just to let them know that YOU KNOW they are violating the law. I've followed this advice. Giving the above statement in a perfectly civil manner. One time they searched my car anyway, one time they backed off. Dave They're the ones with the guns. If you're going to stand there and argue over your rights you are an idiot. Wait until it's over and go through the proper legal channels afterward.", 
        "intTime": 20090424, 
        "postID": 35, 
        "quote": "Originally posted by Grachus: Just to let them know that YOU KNOW they are violating the law. I've followed this advice. Giving the above statement in a perfectly civil manner. One time they searched my car anyway, one time they backed off. Dave", 
        "reply": " They're the ones with the guns. If you're going to stand there and argue over your rights you are an idiot. Wait until it's over and go through the proper legal channels afterward.", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-24 14:08:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Grachus: Just to let them know that YOU KNOW they are violating the law. I've followed this advice. Giving the above statement in a perfectly civil manner. One time they searched my car anyway, one time they backed off. Dave They're the ones with the guns. If you're going to stand there and argue over your rights you are an idiot. Wait until it's over and go through the proper legal channels afterward. im sure this is a good deterent for those commiting crimes to know they will not be searched on small charges especially drugs, many states are now legalizing small amounts whats next???? airport searches to be stopped", 
        "intTime": 20090425, 
        "postID": 36, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Grachus: Just to let them know that YOU KNOW they are violating the law. I've followed this advice. Giving the above statement in a perfectly civil manner. One time they searched my car anyway, one time they backed off. Dave They're the ones with the guns. If you're going to stand there and argue over your rights you are an idiot. Wait until it's over and go through the proper legal channels afterward.", 
        "reply": " im sure this is a good deterent for those commiting crimes to know they will not be searched on small charges especially drugs, many states are now legalizing small amounts whats next???? airport searches to be stopped", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-25 18:39:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: whats next???? airport searches to be stopped Constitutionally, they are extremely questionable, but you are buying a service from someone who has the right to refuse service. They could simply turn away anyone who refuses to cooperate . . . Wandering and Wondering", 
        "intTime": 20090425, 
        "postID": 37, 
        "quote": "whats next???? airport searches to be stopped", 
        "reply": " Constitutionally, they are extremely questionable, but you are buying a service from someone who has the right to refuse service. They could simply turn away anyone who refuses to cooperate . . . Wandering and Wondering", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-25 19:35:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" As a former law enforcement officer, I am actually proud of the USSC for this. I have been seeing way too many SILAS searches based on poop. Law enforcement has used that SILAS to death. It is about time. Now maybe they will start having to do some law enforcement and not just \"hunting\" for the almighty twinkie ! One or two downsides however are as follow: Now, with the gun nexus as the ultimate probable cause, EVERY single time you get stopped, the cop is going to ask you if you have a gun in the car, regardless if it is not in your manual possession, but THEY will have search your car to find that out since of course they will not be able to take YOUR word for it! So, it is good in a way since an upstanding citizen can get a concealed weapons permit (except in liberal states where guns are evil anyway)then you can keep it on you or right next to you CONCEALED, where a criminal won't get away with it!! About d*** time !!!!!! If it is in proximity to your wife, child, or friend, they are in violation unless they have a concealed weapons license. I feel sorry for all you people who want to be able to protect yourself in liberal states like Massachusetts or New York... NOT !! Move away from the libidiot areas.", 
        "intTime": 20090425, 
        "postID": 38, 
        "quote": "Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\"", 
        "reply": " As a former law enforcement officer, I am actually proud of the USSC for this. I have been seeing way too many SILAS searches based on poop. Law enforcement has used that SILAS to death. It is about time. Now maybe they will start having to do some law enforcement and not just \"hunting\" for the almighty twinkie ! One or two downsides however are as follow: Now, with the gun nexus as the ultimate probable cause, EVERY single time you get stopped, the cop is going to ask you if you have a gun in the car, regardless if it is not in your manual possession, but THEY will have search your car to find that out since of course they will not be able to take YOUR word for it! So, it is good in a way since an upstanding citizen can get a concealed weapons permit (except in liberal states where guns are evil anyway)then you can keep it on you or right next to you CONCEALED, where a criminal won't get away with it!! About d*** time !!!!!! If it is in proximity to your wife, child, or friend, they are in violation unless they have a concealed weapons license. I feel sorry for all you people who want to be able to protect yourself in liberal states like Massachusetts or New York... NOT !! Move away from the libidiot areas.", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-25 20:26:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "SP_Five_O"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by rayld2: quote: Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. I agree with you and I applaud the SP for making such a ruling. More rulings like this need to take place...like tasering people for no reason.", 
        "intTime": 20090425, 
        "postID": 39, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by rayld2: quote: Originally posted by Anbar7: The Supreme Court put a new limit on police searches of cars Tuesday, saying that \"countless individuals guilty of nothing more serious than a traffic violation\" have had their vehicles searched in violation of their rights. In a 5-4 decision, the justices set aside a 1981 opinion that had given police broad authority to search cars whenever they made an arrest. Instead, the justices said that an arresting officer could search a vehicle only if weapons were potentially in reach of the suspect or if there was reason to believe that the car contained evidence related to the arrest. For example, if the driver was arrested in a drug crime, the car could be searched for drugs. more here: \"http://www.latimes.com/news/nationworld/nation/la-na-scotus-carsearch22-2009apr22,0,1967319.story\" IMO some police officers brought this on themselves by repeatedly abusing this power (searching just for the heck of it) and have now made it harder for ALL police officers. I agree with you and I applaud the SP for making such a ruling. More rulings like this need to take place...like tasering people for no reason.", 
        "reply": "", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-25 20:28:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "SP_Five_O"
    }, 
    {
        "content": "quote: Originally posted by PSimon572: Now they need to revisit illegal check points. Quick stopping people without probable cause. Did you know, for instance in Florida, a check point stop allows the police to ONLY check safety issues such as a DUI (limited to obvious usually), equipment like lights and tires, drivers license check, but not insurance, registration (making you produce it when it is on your tag - not their alleged reason for stopping you anyway), and they can't investigate criminal activity unless it knocks their eyes out (no searches allowed without consent, but they usually get that consent sometimes by insinuating a search warrant will be promptly obtained within minutes, and you have to wait, which is not true!! Unless they have a reasonable suspicion (easily done admittedly) then they need to pass you on. If a judge finds out that their alleged PC was weak for a search though(during a check point stop only), he will throw it out. Check points will probably remain, but maybe they will be more limited. They are a main source of getting DUI's and drivers license violations, both of which MADD adores, so go figure. No USSC justice wants to be blamed by MADD's network of being light on DUI's.", 
        "intTime": 20090425, 
        "postID": 40, 
        "quote": "Originally posted by PSimon572: Now they need to revisit illegal check points. Quick stopping people without probable cause.", 
        "reply": " Did you know, for instance in Florida, a check point stop allows the police to ONLY check safety issues such as a DUI (limited to obvious usually), equipment like lights and tires, drivers license check, but not insurance, registration (making you produce it when it is on your tag - not their alleged reason for stopping you anyway), and they can't investigate criminal activity unless it knocks their eyes out (no searches allowed without consent, but they usually get that consent sometimes by insinuating a search warrant will be promptly obtained within minutes, and you have to wait, which is not true!! Unless they have a reasonable suspicion (easily done admittedly) then they need to pass you on. If a judge finds out that their alleged PC was weak for a search though(during a check point stop only), he will throw it out. Check points will probably remain, but maybe they will be more limited. They are a main source of getting DUI's and drivers license violations, both of which MADD adores, so go figure. No USSC justice wants to be blamed by MADD's network of being light on DUI's.", 
        "threadID": "672198221_4630064122001", 
        "time": "2009-04-25 20:40:00", 
        "title": "Supreme Court scales back police right to search cars", 
        "userID": "SP_Five_O"
    }
]