[
    {
        "content": "SEEKONK, Mass. -- Shane Murphy, the second-in-command aboard the American merchant ship seized by pirates, lashed out at Rush Limbaugh for the talk show host's racial characterization in discussing the rescue of the ship's captain by the Navy. Murphy, who returned to his Seekonk, Mass., home Friday, called Limbaugh a purveyor of \"hate speech.\" In commenting on the rescue of Capt. Richard Phillips by the Navy Seals who shot and killed the three Somali pirates who were holding him captive, Limbaugh generated controversy when he called the pirates \"black teenagers.\" \"There you have it, three teenagers shot on the high seas at the order of President Obama,\" said Limbaugh according to a transcript of an April 14 broadcast on his Web site. \"Just imagine the hue and cry had a Republican president ordered the shooting of black teenagers on the high seas,\" Limbaugh said. Murphy said Limbaugh's remarks were unacceptable. \"It feels great to be home,\" Murphy said. \"With the exception of Rush Limbaugh who is trying to make this into a race issue. It's disgusting.\" \"The president did the right thing. It's a war. It's about good versus evil. And what you (Limbaugh) said is evil, that is hate speech. I won't tolerate it,\" Murphy said. Murphy said he and his family have had a difficult time since his release and return to the United States. The intense public attention on the rescue of the crew of the Maersk Alabama has made adjustment to a normal family life difficult, he said. \"We have not been left alone. We have not been allowed to go out and even do routine things,\" Murphy said. Murphy, who took command of the ship after Phillips was taken hostage, said he and his family are trying to get through it all. http://www.thebostonchannel.com/news/19273935/detail.html Must not be a ditto head.", 
        "intTime": 20090425, 
        "postID": 1, 
        "quote": "", 
        "reply": "SEEKONK, Mass. -- Shane Murphy, the second-in-command aboard the American merchant ship seized by pirates, lashed out at Rush Limbaugh for the talk show host's racial characterization in discussing the rescue of the ship's captain by the Navy. Murphy, who returned to his Seekonk, Mass., home Friday, called Limbaugh a purveyor of \"hate speech.\" In commenting on the rescue of Capt. Richard Phillips by the Navy Seals who shot and killed the three Somali pirates who were holding him captive, Limbaugh generated controversy when he called the pirates \"black teenagers.\" \"There you have it, three teenagers shot on the high seas at the order of President Obama,\" said Limbaugh according to a transcript of an April 14 broadcast on his Web site. \"Just imagine the hue and cry had a Republican president ordered the shooting of black teenagers on the high seas,\" Limbaugh said. Murphy said Limbaugh's remarks were unacceptable. \"It feels great to be home,\" Murphy said. \"With the exception of Rush Limbaugh who is trying to make this into a race issue. It's disgusting.\" \"The president did the right thing. It's a war. It's about good versus evil. And what you (Limbaugh) said is evil, that is hate speech. I won't tolerate it,\" Murphy said. Murphy said he and his family have had a difficult time since his release and return to the United States. The intense public attention on the rescue of the crew of the Maersk Alabama has made adjustment to a normal family life difficult, he said. \"We have not been left alone. We have not been allowed to go out and even do routine things,\" Murphy said. Murphy, who took command of the ship after Phillips was taken hostage, said he and his family are trying to get through it all. http://www.thebostonchannel.com/news/19273935/detail.html Must not be a ditto head.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 01:35:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Limbaugh needs to STFU. Then again, he makes a living off of making stupid, outrageous comments... Wonder why he never goes after jews?", 
        "intTime": 20090425, 
        "postID": 2, 
        "quote": "", 
        "reply": "Limbaugh needs to STFU. Then again, he makes a living off of making stupid, outrageous comments... Wonder why he never goes after jews?", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 01:50:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: SEEKONK, Mass. -- Shane Murphy, the second-in-command aboard the American merchant ship seized by pirates, lashed out at Rush Limbaugh for the talk show host's racial characterization in discussing the rescue of the ship's captain by the Navy. Murphy, who returned to his Seekonk, Mass., home Friday, called Limbaugh a purveyor of \"hate speech.\" In commenting on the rescue of Capt. Richard Phillips by the Navy Seals who shot and killed the three Somali pirates who were holding him captive, Limbaugh generated controversy when he called the pirates \"black teenagers.\" \"There you have it, three teenagers shot on the high seas at the order of President Obama,\" said Limbaugh according to a transcript of an April 14 broadcast on his Web site. \"Just imagine the hue and cry had a Republican president ordered the shooting of black teenagers on the high seas,\" Limbaugh said. Murphy said Limbaugh's remarks were unacceptable. \"It feels great to be home,\" Murphy said. \"With the exception of Rush Limbaugh who is trying to make this into a race issue. It's disgusting.\" \"The president did the right thing. It's a war. It's about good versus evil. And what you (Limbaugh) said is evil, that is hate speech. I won't tolerate it,\" Murphy said. Murphy said he and his family have had a difficult time since his release and return to the United States. The intense public attention on the rescue of the crew of the Maersk Alabama has made adjustment to a normal family life difficult, he said. \"We have not been left alone. We have not been allowed to go out and even do routine things,\" Murphy said. Murphy, who took command of the ship after Phillips was taken hostage, said he and his family are trying to get through it all. http://www.thebostonchannel.com/news/19273935/detail.html Must not be a ditto head. More proof that Limbaugh is a fool.", 
        "intTime": 20090425, 
        "postID": 3, 
        "quote": "Originally posted by jdksfcret: SEEKONK, Mass. -- Shane Murphy, the second-in-command aboard the American merchant ship seized by pirates, lashed out at Rush Limbaugh for the talk show host's racial characterization in discussing the rescue of the ship's captain by the Navy. Murphy, who returned to his Seekonk, Mass., home Friday, called Limbaugh a purveyor of \"hate speech.\" In commenting on the rescue of Capt. Richard Phillips by the Navy Seals who shot and killed the three Somali pirates who were holding him captive, Limbaugh generated controversy when he called the pirates \"black teenagers.\" \"There you have it, three teenagers shot on the high seas at the order of President Obama,\" said Limbaugh according to a transcript of an April 14 broadcast on his Web site. \"Just imagine the hue and cry had a Republican president ordered the shooting of black teenagers on the high seas,\" Limbaugh said. Murphy said Limbaugh's remarks were unacceptable. \"It feels great to be home,\" Murphy said. \"With the exception of Rush Limbaugh who is trying to make this into a race issue. It's disgusting.\" \"The president did the right thing. It's a war. It's about good versus evil. And what you (Limbaugh) said is evil, that is hate speech. I won't tolerate it,\" Murphy said. Murphy said he and his family have had a difficult time since his release and return to the United States. The intense public attention on the rescue of the crew of the Maersk Alabama has made adjustment to a normal family life difficult, he said. \"We have not been left alone. We have not been allowed to go out and even do routine things,\" Murphy said. Murphy, who took command of the ship after Phillips was taken hostage, said he and his family are trying to get through it all. http://www.thebostonchannel.com/news/19273935/detail.html Must not be a ditto head.", 
        "reply": " More proof that Limbaugh is a fool.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 04:26:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Well thats what they were. Maybe he needs to go back to sea and try it all over again.", 
        "intTime": 20090425, 
        "postID": 4, 
        "quote": "", 
        "reply": "Well thats what they were. Maybe he needs to go back to sea and try it all over again.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 04:30:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Duster6"
    }, 
    {
        "content": "Their color is irrelevant, Duster - as is their age. What IS relevant is that they are (were) PIRATES. Had Rash said, \"If a Republican President had ordered the shooting of PIRATES on the high seas ...\" there would be no controversy, because such an order is appropriate presidential reaction to piracy on the high seas. But then, he would never have said that, because he lives for controversy and publicity.", 
        "intTime": 20090425, 
        "postID": 5, 
        "quote": "", 
        "reply": "Their color is irrelevant, Duster - as is their age. What IS relevant is that they are (were) PIRATES. Had Rash said, \"If a Republican President had ordered the shooting of PIRATES on the high seas ...\" there would be no controversy, because such an order is appropriate presidential reaction to piracy on the high seas. But then, he would never have said that, because he lives for controversy and publicity.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 04:41:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "Yeah but that RADICAL RIGHT WINGED Drug Addict Pill Popper was refering to it much more that.", 
        "intTime": 20090425, 
        "postID": 6, 
        "quote": "", 
        "reply": "Yeah but that RADICAL RIGHT WINGED Drug Addict Pill Popper was refering to it much more that.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 05:02:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Well thats what they were. Maybe he needs to go back to sea and try it all over again. The racist aspect of Limbaughs remarks are total. He said plain out, that if a White man had given the order to shoot, he would have been labeled a racist for killing Black teenagers. You buy this? In addition he continiously refers to the Somali Pirates as \"Community Organisers,\" and the \"natural allies of Obama.\" If you don't believe that, take a look at his rants - I am NOT exagerating! Dave", 
        "intTime": 20090425, 
        "postID": 7, 
        "quote": "Originally posted by Duster6: Well thats what they were. Maybe he needs to go back to sea and try it all over again.", 
        "reply": " The racist aspect of Limbaughs remarks are total. He said plain out, that if a White man had given the order to shoot, he would have been labeled a racist for killing Black teenagers. You buy this? In addition he continiously refers to the Somali Pirates as \"Community Organisers,\" and the \"natural allies of Obama.\" If you don't believe that, take a look at his rants - I am NOT exagerating! Dave", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 09:23:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Grachus"
    }, 
    {
        "content": "First, Rush has NO power. He may influence people, but he truly has no power. For all you folks geting in an upraor about what he says. You play right into the fools plans. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090425, 
        "postID": 8, 
        "quote": "", 
        "reply": "First, Rush has NO power. He may influence people, but he truly has no power. For all you folks geting in an upraor about what he says. You play right into the fools plans. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 09:43:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Duster6: Well thats what they were. Maybe he needs to go back to sea and try it all over again. The racist aspect of Limbaughs remarks are total. He said plain out, that if a White man had given the order to shoot, he would have been labeled a racist for killing Black teenagers. You buy this? In addition he continiously refers to the Somali Pirates as \"Community Organisers,\" and the \"natural allies of Obama.\" If you don't believe that, take a look at his rants - I am NOT exagerating! Dave He didn't say that there would have been a public outcry from the left if a white Prez had given the order to shoot black teenage pirates, he said there'd have been one if a Republican Prez had done so. I happen to agree with him. I also don't understand how Rush's description of the pirates as \"black teenagers\" is \"racist\" or \"hate speech\" in any way. They were black teenagers!", 
        "intTime": 20090425, 
        "postID": 9, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Duster6: Well thats what they were. Maybe he needs to go back to sea and try it all over again. The racist aspect of Limbaughs remarks are total. He said plain out, that if a White man had given the order to shoot, he would have been labeled a racist for killing Black teenagers. You buy this? In addition he continiously refers to the Somali Pirates as \"Community Organisers,\" and the \"natural allies of Obama.\" If you don't believe that, take a look at his rants - I am NOT exagerating! Dave", 
        "reply": " He didn't say that there would have been a public outcry from the left if a white Prez had given the order to shoot black teenage pirates, he said there'd have been one if a Republican Prez had done so. I happen to agree with him. I also don't understand how Rush's description of the pirates as \"black teenagers\" is \"racist\" or \"hate speech\" in any way. They were black teenagers!", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 10:46:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Who cares what a \"junkie\" like Limbaugh has to say ... At least the Seaman Murphy isn't cowering at Limbaugh's feet begging for his forgiveness, like others from a certain political party do ... lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090425, 
        "postID": 10, 
        "quote": "", 
        "reply": "Who cares what a \"junkie\" like Limbaugh has to say ... At least the Seaman Murphy isn't cowering at Limbaugh's feet begging for his forgiveness, like others from a certain political party do ... lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 10:50:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Lush Rimbaugh isn't trying to 'racialize' anything he's trying to politicize it. The colour of any involved is of minor import when it comes to being a REAL American.", 
        "intTime": 20090425, 
        "postID": 11, 
        "quote": "", 
        "reply": "Lush Rimbaugh isn't trying to 'racialize' anything he's trying to politicize it. The colour of any involved is of minor import when it comes to being a REAL American.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 11:18:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by Grachus: The racist aspect of Limbaughs remarks are total. He said plain out, that if a White man had given the order to shoot, he would have been labeled a racist for killing Black teenagers. You buy this? In addition he continiously refers to the Somali Pirates as \"Community Organisers,\" and the \"natural allies of Obama.\" If you don't believe that, take a look at his rants - I am NOT exagerating! Dave quote: Originally posted by shades_of_grey: He didn't say that there would have been a public outcry from the left if a white Prez had given the order to shoot black teenage pirates, he said there'd have been one if a Republican Prez had done so. I happen to agree with him. I also don't understand how Rush's description of the pirates as \"black teenagers\" is \"racist\" or \"hate speech\" in any way. They were black teenagers! \"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh And you AGREE with this!!!! Dave", 
        "intTime": 20090425, 
        "postID": 12, 
        "quote": "Originally posted by Grachus: The racist aspect of Limbaughs remarks are total. He said plain out, that if a White man had given the order to shoot, he would have been labeled a racist for killing Black teenagers. You buy this? In addition he continiously refers to the Somali Pirates as \"Community Organisers,\" and the \"natural allies of Obama.\" If you don't believe that, take a look at his rants - I am NOT exagerating! Dave", 
        "reply": " quote: Originally posted by shades_of_grey: He didn't say that there would have been a public outcry from the left if a white Prez had given the order to shoot black teenage pirates, he said there'd have been one if a Republican Prez had done so. I happen to agree with him. I also don't understand how Rush's description of the pirates as \"black teenagers\" is \"racist\" or \"hate speech\" in any way. They were black teenagers! \"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh And you AGREE with this!!!! Dave", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 11:22:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Who cares what a \"junkie\" like Limbaugh has to say ... At least the Seaman Murphy isn't cowering at Limbaugh's feet begging for his forgiveness, like others from a certain political party do ... lol Physician heal thyself!... Respectfully, SUNLINER81", 
        "intTime": 20090425, 
        "postID": 13, 
        "quote": "Originally posted by jack_flats: Who cares what a \"junkie\" like Limbaugh has to say ... At least the Seaman Murphy isn't cowering at Limbaugh's feet begging for his forgiveness, like others from a certain political party do ... lol", 
        "reply": " Physician heal thyself!... Respectfully, SUNLINER81", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 11:24:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Limbaugh's comments were accurate. They were black, they were teenagers, and Obama ordered them assassinated. Where's the \"hate\" speech in those remarks? \"The World's Finest\"", 
        "intTime": 20090425, 
        "postID": 14, 
        "quote": "", 
        "reply": "Limbaugh's comments were accurate. They were black, they were teenagers, and Obama ordered them assassinated. Where's the \"hate\" speech in those remarks? \"The World's Finest\"", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 11:43:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Limbaugh's comments were accurate. They were black, they were teenagers, and Obama ordered them assassinated. Where's the \"hate\" speech in those remarks? quote: \"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh To imply that people on THIS BOARD would be calling President Bush a criminal for killing \"Black teenagers\" is over the top. It's a disgusting attack on Obama, and everyone else who cheered the Seals. Mr. Bush was the one who ordered our Navy to patrol the coast in the first place - Post where anyone here, or the Net referred to this as a racist act on his part aimed at Black People? The amount of HS that you guys are ready to swallow always amazes me. Dave", 
        "intTime": 20090425, 
        "postID": 15, 
        "quote": "Originally posted by Kegler300: Limbaugh's comments were accurate. They were black, they were teenagers, and Obama ordered them assassinated. Where's the \"hate\" speech in those remarks?", 
        "reply": " quote: \"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh To imply that people on THIS BOARD would be calling President Bush a criminal for killing \"Black teenagers\" is over the top. It's a disgusting attack on Obama, and everyone else who cheered the Seals. Mr. Bush was the one who ordered our Navy to patrol the coast in the first place - Post where anyone here, or the Net referred to this as a racist act on his part aimed at Black People? The amount of HS that you guys are ready to swallow always amazes me. Dave", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 11:55:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Grachus"
    }, 
    {
        "content": "Ummm....were the pirates in question \"black teenagers?\" They were? OK. What are we complaining about, then? Some hre need to be reminded that merely expressing the fact that some people are of a certain race is not evidence of racism. Racism is the belief that one race is inherently superior to another. If Mr. Limbaugh did not express that, and I have read nothing in this thread suggesting that he did, then some of you need to STFU.", 
        "intTime": 20090425, 
        "postID": 16, 
        "quote": "", 
        "reply": "Ummm....were the pirates in question \"black teenagers?\" They were? OK. What are we complaining about, then? Some hre need to be reminded that merely expressing the fact that some people are of a certain race is not evidence of racism. Racism is the belief that one race is inherently superior to another. If Mr. Limbaugh did not express that, and I have read nothing in this thread suggesting that he did, then some of you need to STFU.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 14:19:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: Ummm....were the pirates in question \"black teenagers?\" They were? OK. What are we complaining about, then? Some hre need to be reminded that merely expressing the fact that some people are of a certain race is not evidence of racism. Racism is the belief that one race is inherently superior to another. If Mr. Limbaugh did not express that, and I have read nothing in this thread suggesting that he did, then some of you need to STFU. To say that I would have complained if Mr. Bush killed these pirates, whereas I'm NOT complaining about Obama doing it - Is in fact to claim that I make my decisions based on race. It was Limbaugh who emphasizes the race of these pirates - When ultimately a pirate is a pirate is a pirate. Why is race relevant to the discussion at all? Because Limbaugh says it is? Is he \"informing\" us of something we didn't know? Dave", 
        "intTime": 20090425, 
        "postID": 17, 
        "quote": "Originally posted by Bleah: Ummm....were the pirates in question \"black teenagers?\" They were? OK. What are we complaining about, then? Some hre need to be reminded that merely expressing the fact that some people are of a certain race is not evidence of racism. Racism is the belief that one race is inherently superior to another. If Mr. Limbaugh did not express that, and I have read nothing in this thread suggesting that he did, then some of you need to STFU.", 
        "reply": " To say that I would have complained if Mr. Bush killed these pirates, whereas I'm NOT complaining about Obama doing it - Is in fact to claim that I make my decisions based on race. It was Limbaugh who emphasizes the race of these pirates - When ultimately a pirate is a pirate is a pirate. Why is race relevant to the discussion at all? Because Limbaugh says it is? Is he \"informing\" us of something we didn't know? Dave", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 15:07:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Grachus"
    }, 
    {
        "content": "Rush....That`s right big guy....rush rush away,...Ya know, That guy is soooo predictable,..not to mention afraid...of ME...he`ll tell ya,...That phoney B*st*rd stays just inside FCC guidelines to convey what he really wants his follower to say for him,...he implies, suggests, then relies on the ignorance of his followers, useing messages sent subblibblibblibly or blub blub bluberly..whatevea.....to gain poularity on the speakings of the foolish that buy his BS !! Guessing what he meant ....makes him popular !! So why does he run from OddBall ?? Someone bring that sunditch here and I`ll show ya !", 
        "intTime": 20090425, 
        "postID": 18, 
        "quote": "", 
        "reply": "Rush....That`s right big guy....rush rush away,...Ya know, That guy is soooo predictable,..not to mention afraid...of ME...he`ll tell ya,...That phoney B*st*rd stays just inside FCC guidelines to convey what he really wants his follower to say for him,...he implies, suggests, then relies on the ignorance of his followers, useing messages sent subblibblibblibly or blub blub bluberly..whatevea.....to gain poularity on the speakings of the foolish that buy his BS !! Guessing what he meant ....makes him popular !! So why does he run from OddBall ?? Someone bring that sunditch here and I`ll show ya !", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 15:41:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "\"Yet the charges that he is a racist because the victims of the hurricane were, for the most part, black and poor, are nothing more than political propaganda by the Bush-haters on the left. You only have to look at where these comments are coming from to see that they are nothing more than political rhetoric. One group that is promulgating the \"Bush as racist\" mantra is comprised of those who are in the race business; the Al Sharptons and the Jesse Jacksons. The other group that was quick off the mark to go after Bush was, unsurprisingly, the political sophisticates of Hollywood.\" from: \"\"http://canadafreepress.com/2005/weinreb091205.htm And from the unbiased tompain website: \"\"http://www.tompaine.com/articles/2005/09/14/the_inequality_president.php No, of course there'd be no accusations of raceism, DEM'S never bring THAT up, do they?", 
        "intTime": 20090425, 
        "postID": 19, 
        "quote": "", 
        "reply": "\"Yet the charges that he is a racist because the victims of the hurricane were, for the most part, black and poor, are nothing more than political propaganda by the Bush-haters on the left. You only have to look at where these comments are coming from to see that they are nothing more than political rhetoric. One group that is promulgating the \"Bush as racist\" mantra is comprised of those who are in the race business; the Al Sharptons and the Jesse Jacksons. The other group that was quick off the mark to go after Bush was, unsurprisingly, the political sophisticates of Hollywood.\" from: \"\"http://canadafreepress.com/2005/weinreb091205.htm And from the unbiased tompain website: \"\"http://www.tompaine.com/articles/2005/09/14/the_inequality_president.php No, of course there'd be no accusations of raceism, DEM'S never bring THAT up, do they?", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 16:06:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: \"Yet the charges that he is a racist because the victims of the hurricane were, for the most part, black and poor, are nothing more than political propaganda by the Bush-haters on the left. You only have to look at where these comments are coming from to see that they are nothing more than political rhetoric. One group that is promulgating the \"Bush as racist\" mantra is comprised of those who are in the race business; the Al Sharptons and the Jesse Jacksons. The other group that was quick off the mark to go after Bush was, unsurprisingly, the political sophisticates of Hollywood.\" from: \"\"http://canadafreepress.com/2005/weinreb091205.htm And from the unbiased tompain website: \"\"http://www.tompaine.com/articles/2005/09/14/the_inequality_president.php No, of course there'd be no accusations of raceism, DEM'S never bring THAT up, do they? I dunno Peter - Is ANYTHING you mentioned above on this thread? Defending Mr. Bush against the charges of racism brought against him here... I've heard of changing the topic, but with the above you just plain ignore it. Dave", 
        "intTime": 20090425, 
        "postID": 20, 
        "quote": "Originally posted by peter3_1: \"Yet the charges that he is a racist because the victims of the hurricane were, for the most part, black and poor, are nothing more than political propaganda by the Bush-haters on the left. You only have to look at where these comments are coming from to see that they are nothing more than political rhetoric. One group that is promulgating the \"Bush as racist\" mantra is comprised of those who are in the race business; the Al Sharptons and the Jesse Jacksons. The other group that was quick off the mark to go after Bush was, unsurprisingly, the political sophisticates of Hollywood.\" from: \"\"http://canadafreepress.com/2005/weinreb091205.htm And from the unbiased tompain website: \"\"http://www.tompaine.com/articles/2005/09/14/the_inequality_president.php No, of course there'd be no accusations of raceism, DEM'S never bring THAT up, do they?", 
        "reply": " I dunno Peter - Is ANYTHING you mentioned above on this thread? Defending Mr. Bush against the charges of racism brought against him here... I've heard of changing the topic, but with the above you just plain ignore it. Dave", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 16:21:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Grachus"
    }, 
    {
        "content": "SEEKONK, Mass. -- Shane Murphy, the second-in-command aboard the American merchant ship seized by pirates, lashed out at Rush Limbaugh for the talk show host's racial characterization in discussing the rescue of the ship's captain by the Navy. Murphy, who returned to his Seekonk, Mass., home Friday, called Limbaugh a purveyor of \"hate speech.\" In commenting on the rescue of Capt. Richard Phillips by the Navy Seals who shot and killed the three Somali pirates who were holding him captive, Limbaugh generated controversy when he called the pirates \"black teenagers.\" \"There you have it, three teenagers shot on the high seas at the order of President Obama,\" said Limbaugh according to a transcript of an April 14 broadcast on his Web site. \"Just imagine the hue and cry had a Republican president ordered the shooting of black teenagers on the high seas,\" Limbaugh said. Murphy said Limbaugh's remarks were unacceptable. \"It feels great to be home,\" Murphy said. \"With the exception of Rush Limbaugh who is trying to make this into a race issue. It's disgusting.\" \"The president did the right thing. It's a war. It's about good versus evil. And what you (Limbaugh) said is evil, that is hate speech. I won't tolerate it,\" Murphy said. Murphy said he and his family have had a difficult time since his release and return to the United States. The intense public attention on the rescue of the crew of the Maersk Alabama has made adjustment to a normal family life difficult, he said. \"We have not been left alone. We have not been allowed to go out and even do routine things,\" Murphy said. Murphy, who took command of the ship after Phillips was taken hostage, said he and his family are trying to get through it all. http://www.thebostonchannel.com/news/19273935/detail.html Must not be a ditto head.", 
        "intTime": 20090425, 
        "postID": 21, 
        "quote": "", 
        "reply": "SEEKONK, Mass. -- Shane Murphy, the second-in-command aboard the American merchant ship seized by pirates, lashed out at Rush Limbaugh for the talk show host's racial characterization in discussing the rescue of the ship's captain by the Navy. Murphy, who returned to his Seekonk, Mass., home Friday, called Limbaugh a purveyor of \"hate speech.\" In commenting on the rescue of Capt. Richard Phillips by the Navy Seals who shot and killed the three Somali pirates who were holding him captive, Limbaugh generated controversy when he called the pirates \"black teenagers.\" \"There you have it, three teenagers shot on the high seas at the order of President Obama,\" said Limbaugh according to a transcript of an April 14 broadcast on his Web site. \"Just imagine the hue and cry had a Republican president ordered the shooting of black teenagers on the high seas,\" Limbaugh said. Murphy said Limbaugh's remarks were unacceptable. \"It feels great to be home,\" Murphy said. \"With the exception of Rush Limbaugh who is trying to make this into a race issue. It's disgusting.\" \"The president did the right thing. It's a war. It's about good versus evil. And what you (Limbaugh) said is evil, that is hate speech. I won't tolerate it,\" Murphy said. Murphy said he and his family have had a difficult time since his release and return to the United States. The intense public attention on the rescue of the crew of the Maersk Alabama has made adjustment to a normal family life difficult, he said. \"We have not been left alone. We have not been allowed to go out and even do routine things,\" Murphy said. Murphy, who took command of the ship after Phillips was taken hostage, said he and his family are trying to get through it all. http://www.thebostonchannel.com/news/19273935/detail.html Must not be a ditto head.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 01:35:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Limbaugh needs to STFU. Then again, he makes a living off of making stupid, outrageous comments... Wonder why he never goes after jews?", 
        "intTime": 20090425, 
        "postID": 22, 
        "quote": "", 
        "reply": "Limbaugh needs to STFU. Then again, he makes a living off of making stupid, outrageous comments... Wonder why he never goes after jews?", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 01:50:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: SEEKONK, Mass. -- Shane Murphy, the second-in-command aboard the American merchant ship seized by pirates, lashed out at Rush Limbaugh for the talk show host's racial characterization in discussing the rescue of the ship's captain by the Navy. Murphy, who returned to his Seekonk, Mass., home Friday, called Limbaugh a purveyor of \"hate speech.\" In commenting on the rescue of Capt. Richard Phillips by the Navy Seals who shot and killed the three Somali pirates who were holding him captive, Limbaugh generated controversy when he called the pirates \"black teenagers.\" \"There you have it, three teenagers shot on the high seas at the order of President Obama,\" said Limbaugh according to a transcript of an April 14 broadcast on his Web site. \"Just imagine the hue and cry had a Republican president ordered the shooting of black teenagers on the high seas,\" Limbaugh said. Murphy said Limbaugh's remarks were unacceptable. \"It feels great to be home,\" Murphy said. \"With the exception of Rush Limbaugh who is trying to make this into a race issue. It's disgusting.\" \"The president did the right thing. It's a war. It's about good versus evil. And what you (Limbaugh) said is evil, that is hate speech. I won't tolerate it,\" Murphy said. Murphy said he and his family have had a difficult time since his release and return to the United States. The intense public attention on the rescue of the crew of the Maersk Alabama has made adjustment to a normal family life difficult, he said. \"We have not been left alone. We have not been allowed to go out and even do routine things,\" Murphy said. Murphy, who took command of the ship after Phillips was taken hostage, said he and his family are trying to get through it all. http://www.thebostonchannel.com/news/19273935/detail.html Must not be a ditto head. More proof that Limbaugh is a fool.", 
        "intTime": 20090425, 
        "postID": 23, 
        "quote": "Originally posted by jdksfcret: SEEKONK, Mass. -- Shane Murphy, the second-in-command aboard the American merchant ship seized by pirates, lashed out at Rush Limbaugh for the talk show host's racial characterization in discussing the rescue of the ship's captain by the Navy. Murphy, who returned to his Seekonk, Mass., home Friday, called Limbaugh a purveyor of \"hate speech.\" In commenting on the rescue of Capt. Richard Phillips by the Navy Seals who shot and killed the three Somali pirates who were holding him captive, Limbaugh generated controversy when he called the pirates \"black teenagers.\" \"There you have it, three teenagers shot on the high seas at the order of President Obama,\" said Limbaugh according to a transcript of an April 14 broadcast on his Web site. \"Just imagine the hue and cry had a Republican president ordered the shooting of black teenagers on the high seas,\" Limbaugh said. Murphy said Limbaugh's remarks were unacceptable. \"It feels great to be home,\" Murphy said. \"With the exception of Rush Limbaugh who is trying to make this into a race issue. It's disgusting.\" \"The president did the right thing. It's a war. It's about good versus evil. And what you (Limbaugh) said is evil, that is hate speech. I won't tolerate it,\" Murphy said. Murphy said he and his family have had a difficult time since his release and return to the United States. The intense public attention on the rescue of the crew of the Maersk Alabama has made adjustment to a normal family life difficult, he said. \"We have not been left alone. We have not been allowed to go out and even do routine things,\" Murphy said. Murphy, who took command of the ship after Phillips was taken hostage, said he and his family are trying to get through it all. http://www.thebostonchannel.com/news/19273935/detail.html Must not be a ditto head.", 
        "reply": " More proof that Limbaugh is a fool.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 04:26:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Well thats what they were. Maybe he needs to go back to sea and try it all over again.", 
        "intTime": 20090425, 
        "postID": 24, 
        "quote": "", 
        "reply": "Well thats what they were. Maybe he needs to go back to sea and try it all over again.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 04:30:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Duster6"
    }, 
    {
        "content": "Their color is irrelevant, Duster - as is their age. What IS relevant is that they are (were) PIRATES. Had Rash said, \"If a Republican President had ordered the shooting of PIRATES on the high seas ...\" there would be no controversy, because such an order is appropriate presidential reaction to piracy on the high seas. But then, he would never have said that, because he lives for controversy and publicity.", 
        "intTime": 20090425, 
        "postID": 25, 
        "quote": "", 
        "reply": "Their color is irrelevant, Duster - as is their age. What IS relevant is that they are (were) PIRATES. Had Rash said, \"If a Republican President had ordered the shooting of PIRATES on the high seas ...\" there would be no controversy, because such an order is appropriate presidential reaction to piracy on the high seas. But then, he would never have said that, because he lives for controversy and publicity.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 04:41:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "Yeah but that RADICAL RIGHT WINGED Drug Addict Pill Popper was refering to it much more that.", 
        "intTime": 20090425, 
        "postID": 26, 
        "quote": "", 
        "reply": "Yeah but that RADICAL RIGHT WINGED Drug Addict Pill Popper was refering to it much more that.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 05:02:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Well thats what they were. Maybe he needs to go back to sea and try it all over again. The racist aspect of Limbaughs remarks are total. He said plain out, that if a White man had given the order to shoot, he would have been labeled a racist for killing Black teenagers. You buy this? In addition he continiously refers to the Somali Pirates as \"Community Organisers,\" and the \"natural allies of Obama.\" If you don't believe that, take a look at his rants - I am NOT exagerating! Dave", 
        "intTime": 20090425, 
        "postID": 27, 
        "quote": "Originally posted by Duster6: Well thats what they were. Maybe he needs to go back to sea and try it all over again.", 
        "reply": " The racist aspect of Limbaughs remarks are total. He said plain out, that if a White man had given the order to shoot, he would have been labeled a racist for killing Black teenagers. You buy this? In addition he continiously refers to the Somali Pirates as \"Community Organisers,\" and the \"natural allies of Obama.\" If you don't believe that, take a look at his rants - I am NOT exagerating! Dave", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 09:23:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Grachus"
    }, 
    {
        "content": "First, Rush has NO power. He may influence people, but he truly has no power. For all you folks geting in an upraor about what he says. You play right into the fools plans. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090425, 
        "postID": 28, 
        "quote": "", 
        "reply": "First, Rush has NO power. He may influence people, but he truly has no power. For all you folks geting in an upraor about what he says. You play right into the fools plans. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 09:43:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Duster6: Well thats what they were. Maybe he needs to go back to sea and try it all over again. The racist aspect of Limbaughs remarks are total. He said plain out, that if a White man had given the order to shoot, he would have been labeled a racist for killing Black teenagers. You buy this? In addition he continiously refers to the Somali Pirates as \"Community Organisers,\" and the \"natural allies of Obama.\" If you don't believe that, take a look at his rants - I am NOT exagerating! Dave He didn't say that there would have been a public outcry from the left if a white Prez had given the order to shoot black teenage pirates, he said there'd have been one if a Republican Prez had done so. I happen to agree with him. I also don't understand how Rush's description of the pirates as \"black teenagers\" is \"racist\" or \"hate speech\" in any way. They were black teenagers!", 
        "intTime": 20090425, 
        "postID": 29, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Duster6: Well thats what they were. Maybe he needs to go back to sea and try it all over again. The racist aspect of Limbaughs remarks are total. He said plain out, that if a White man had given the order to shoot, he would have been labeled a racist for killing Black teenagers. You buy this? In addition he continiously refers to the Somali Pirates as \"Community Organisers,\" and the \"natural allies of Obama.\" If you don't believe that, take a look at his rants - I am NOT exagerating! Dave", 
        "reply": " He didn't say that there would have been a public outcry from the left if a white Prez had given the order to shoot black teenage pirates, he said there'd have been one if a Republican Prez had done so. I happen to agree with him. I also don't understand how Rush's description of the pirates as \"black teenagers\" is \"racist\" or \"hate speech\" in any way. They were black teenagers!", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 10:46:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Who cares what a \"junkie\" like Limbaugh has to say ... At least the Seaman Murphy isn't cowering at Limbaugh's feet begging for his forgiveness, like others from a certain political party do ... lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090425, 
        "postID": 30, 
        "quote": "", 
        "reply": "Who cares what a \"junkie\" like Limbaugh has to say ... At least the Seaman Murphy isn't cowering at Limbaugh's feet begging for his forgiveness, like others from a certain political party do ... lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 10:50:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Lush Rimbaugh isn't trying to 'racialize' anything he's trying to politicize it. The colour of any involved is of minor import when it comes to being a REAL American.", 
        "intTime": 20090425, 
        "postID": 31, 
        "quote": "", 
        "reply": "Lush Rimbaugh isn't trying to 'racialize' anything he's trying to politicize it. The colour of any involved is of minor import when it comes to being a REAL American.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 11:18:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by Grachus: The racist aspect of Limbaughs remarks are total. He said plain out, that if a White man had given the order to shoot, he would have been labeled a racist for killing Black teenagers. You buy this? In addition he continiously refers to the Somali Pirates as \"Community Organisers,\" and the \"natural allies of Obama.\" If you don't believe that, take a look at his rants - I am NOT exagerating! Dave quote: Originally posted by shades_of_grey: He didn't say that there would have been a public outcry from the left if a white Prez had given the order to shoot black teenage pirates, he said there'd have been one if a Republican Prez had done so. I happen to agree with him. I also don't understand how Rush's description of the pirates as \"black teenagers\" is \"racist\" or \"hate speech\" in any way. They were black teenagers! \"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh And you AGREE with this!!!! Dave", 
        "intTime": 20090425, 
        "postID": 32, 
        "quote": "Originally posted by Grachus: The racist aspect of Limbaughs remarks are total. He said plain out, that if a White man had given the order to shoot, he would have been labeled a racist for killing Black teenagers. You buy this? In addition he continiously refers to the Somali Pirates as \"Community Organisers,\" and the \"natural allies of Obama.\" If you don't believe that, take a look at his rants - I am NOT exagerating! Dave", 
        "reply": " quote: Originally posted by shades_of_grey: He didn't say that there would have been a public outcry from the left if a white Prez had given the order to shoot black teenage pirates, he said there'd have been one if a Republican Prez had done so. I happen to agree with him. I also don't understand how Rush's description of the pirates as \"black teenagers\" is \"racist\" or \"hate speech\" in any way. They were black teenagers! \"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh And you AGREE with this!!!! Dave", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 11:22:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Who cares what a \"junkie\" like Limbaugh has to say ... At least the Seaman Murphy isn't cowering at Limbaugh's feet begging for his forgiveness, like others from a certain political party do ... lol Physician heal thyself!... Respectfully, SUNLINER81", 
        "intTime": 20090425, 
        "postID": 33, 
        "quote": "Originally posted by jack_flats: Who cares what a \"junkie\" like Limbaugh has to say ... At least the Seaman Murphy isn't cowering at Limbaugh's feet begging for his forgiveness, like others from a certain political party do ... lol", 
        "reply": " Physician heal thyself!... Respectfully, SUNLINER81", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 11:24:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Limbaugh's comments were accurate. They were black, they were teenagers, and Obama ordered them assassinated. Where's the \"hate\" speech in those remarks? \"The World's Finest\"", 
        "intTime": 20090425, 
        "postID": 34, 
        "quote": "", 
        "reply": "Limbaugh's comments were accurate. They were black, they were teenagers, and Obama ordered them assassinated. Where's the \"hate\" speech in those remarks? \"The World's Finest\"", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 11:43:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Limbaugh's comments were accurate. They were black, they were teenagers, and Obama ordered them assassinated. Where's the \"hate\" speech in those remarks? quote: \"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh To imply that people on THIS BOARD would be calling President Bush a criminal for killing \"Black teenagers\" is over the top. It's a disgusting attack on Obama, and everyone else who cheered the Seals. Mr. Bush was the one who ordered our Navy to patrol the coast in the first place - Post where anyone here, or the Net referred to this as a racist act on his part aimed at Black People? The amount of HS that you guys are ready to swallow always amazes me. Dave", 
        "intTime": 20090425, 
        "postID": 35, 
        "quote": "Originally posted by Kegler300: Limbaugh's comments were accurate. They were black, they were teenagers, and Obama ordered them assassinated. Where's the \"hate\" speech in those remarks?", 
        "reply": " quote: \"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh To imply that people on THIS BOARD would be calling President Bush a criminal for killing \"Black teenagers\" is over the top. It's a disgusting attack on Obama, and everyone else who cheered the Seals. Mr. Bush was the one who ordered our Navy to patrol the coast in the first place - Post where anyone here, or the Net referred to this as a racist act on his part aimed at Black People? The amount of HS that you guys are ready to swallow always amazes me. Dave", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 11:55:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Grachus"
    }, 
    {
        "content": "Ummm....were the pirates in question \"black teenagers?\" They were? OK. What are we complaining about, then? Some hre need to be reminded that merely expressing the fact that some people are of a certain race is not evidence of racism. Racism is the belief that one race is inherently superior to another. If Mr. Limbaugh did not express that, and I have read nothing in this thread suggesting that he did, then some of you need to STFU.", 
        "intTime": 20090425, 
        "postID": 36, 
        "quote": "", 
        "reply": "Ummm....were the pirates in question \"black teenagers?\" They were? OK. What are we complaining about, then? Some hre need to be reminded that merely expressing the fact that some people are of a certain race is not evidence of racism. Racism is the belief that one race is inherently superior to another. If Mr. Limbaugh did not express that, and I have read nothing in this thread suggesting that he did, then some of you need to STFU.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 14:19:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: Ummm....were the pirates in question \"black teenagers?\" They were? OK. What are we complaining about, then? Some hre need to be reminded that merely expressing the fact that some people are of a certain race is not evidence of racism. Racism is the belief that one race is inherently superior to another. If Mr. Limbaugh did not express that, and I have read nothing in this thread suggesting that he did, then some of you need to STFU. To say that I would have complained if Mr. Bush killed these pirates, whereas I'm NOT complaining about Obama doing it - Is in fact to claim that I make my decisions based on race. It was Limbaugh who emphasizes the race of these pirates - When ultimately a pirate is a pirate is a pirate. Why is race relevant to the discussion at all? Because Limbaugh says it is? Is he \"informing\" us of something we didn't know? Dave", 
        "intTime": 20090425, 
        "postID": 37, 
        "quote": "Originally posted by Bleah: Ummm....were the pirates in question \"black teenagers?\" They were? OK. What are we complaining about, then? Some hre need to be reminded that merely expressing the fact that some people are of a certain race is not evidence of racism. Racism is the belief that one race is inherently superior to another. If Mr. Limbaugh did not express that, and I have read nothing in this thread suggesting that he did, then some of you need to STFU.", 
        "reply": " To say that I would have complained if Mr. Bush killed these pirates, whereas I'm NOT complaining about Obama doing it - Is in fact to claim that I make my decisions based on race. It was Limbaugh who emphasizes the race of these pirates - When ultimately a pirate is a pirate is a pirate. Why is race relevant to the discussion at all? Because Limbaugh says it is? Is he \"informing\" us of something we didn't know? Dave", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 15:07:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Grachus"
    }, 
    {
        "content": "Rush....That`s right big guy....rush rush away,...Ya know, That guy is soooo predictable,..not to mention afraid...of ME...he`ll tell ya,...That phoney B*st*rd stays just inside FCC guidelines to convey what he really wants his follower to say for him,...he implies, suggests, then relies on the ignorance of his followers, useing messages sent subblibblibblibly or blub blub bluberly..whatevea.....to gain poularity on the speakings of the foolish that buy his BS !! Guessing what he meant ....makes him popular !! So why does he run from OddBall ?? Someone bring that sunditch here and I`ll show ya !", 
        "intTime": 20090425, 
        "postID": 38, 
        "quote": "", 
        "reply": "Rush....That`s right big guy....rush rush away,...Ya know, That guy is soooo predictable,..not to mention afraid...of ME...he`ll tell ya,...That phoney B*st*rd stays just inside FCC guidelines to convey what he really wants his follower to say for him,...he implies, suggests, then relies on the ignorance of his followers, useing messages sent subblibblibblibly or blub blub bluberly..whatevea.....to gain poularity on the speakings of the foolish that buy his BS !! Guessing what he meant ....makes him popular !! So why does he run from OddBall ?? Someone bring that sunditch here and I`ll show ya !", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 15:41:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "\"Yet the charges that he is a racist because the victims of the hurricane were, for the most part, black and poor, are nothing more than political propaganda by the Bush-haters on the left. You only have to look at where these comments are coming from to see that they are nothing more than political rhetoric. One group that is promulgating the \"Bush as racist\" mantra is comprised of those who are in the race business; the Al Sharptons and the Jesse Jacksons. The other group that was quick off the mark to go after Bush was, unsurprisingly, the political sophisticates of Hollywood.\" from: \"\"http://canadafreepress.com/2005/weinreb091205.htm And from the unbiased tompain website: \"\"http://www.tompaine.com/articles/2005/09/14/the_inequality_president.php No, of course there'd be no accusations of raceism, DEM'S never bring THAT up, do they?", 
        "intTime": 20090425, 
        "postID": 39, 
        "quote": "", 
        "reply": "\"Yet the charges that he is a racist because the victims of the hurricane were, for the most part, black and poor, are nothing more than political propaganda by the Bush-haters on the left. You only have to look at where these comments are coming from to see that they are nothing more than political rhetoric. One group that is promulgating the \"Bush as racist\" mantra is comprised of those who are in the race business; the Al Sharptons and the Jesse Jacksons. The other group that was quick off the mark to go after Bush was, unsurprisingly, the political sophisticates of Hollywood.\" from: \"\"http://canadafreepress.com/2005/weinreb091205.htm And from the unbiased tompain website: \"\"http://www.tompaine.com/articles/2005/09/14/the_inequality_president.php No, of course there'd be no accusations of raceism, DEM'S never bring THAT up, do they?", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 16:06:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: \"Yet the charges that he is a racist because the victims of the hurricane were, for the most part, black and poor, are nothing more than political propaganda by the Bush-haters on the left. You only have to look at where these comments are coming from to see that they are nothing more than political rhetoric. One group that is promulgating the \"Bush as racist\" mantra is comprised of those who are in the race business; the Al Sharptons and the Jesse Jacksons. The other group that was quick off the mark to go after Bush was, unsurprisingly, the political sophisticates of Hollywood.\" from: \"\"http://canadafreepress.com/2005/weinreb091205.htm And from the unbiased tompain website: \"\"http://www.tompaine.com/articles/2005/09/14/the_inequality_president.php No, of course there'd be no accusations of raceism, DEM'S never bring THAT up, do they? I dunno Peter - Is ANYTHING you mentioned above on this thread? Defending Mr. Bush against the charges of racism brought against him here... I've heard of changing the topic, but with the above you just plain ignore it. Dave", 
        "intTime": 20090425, 
        "postID": 40, 
        "quote": "Originally posted by peter3_1: \"Yet the charges that he is a racist because the victims of the hurricane were, for the most part, black and poor, are nothing more than political propaganda by the Bush-haters on the left. You only have to look at where these comments are coming from to see that they are nothing more than political rhetoric. One group that is promulgating the \"Bush as racist\" mantra is comprised of those who are in the race business; the Al Sharptons and the Jesse Jacksons. The other group that was quick off the mark to go after Bush was, unsurprisingly, the political sophisticates of Hollywood.\" from: \"\"http://canadafreepress.com/2005/weinreb091205.htm And from the unbiased tompain website: \"\"http://www.tompaine.com/articles/2005/09/14/the_inequality_president.php No, of course there'd be no accusations of raceism, DEM'S never bring THAT up, do they?", 
        "reply": " I dunno Peter - Is ANYTHING you mentioned above on this thread? Defending Mr. Bush against the charges of racism brought against him here... I've heard of changing the topic, but with the above you just plain ignore it. Dave", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 16:21:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Grachus"
    }, 
    {
        "content": "SEEKONK, Mass. -- Shane Murphy, the second-in-command aboard the American merchant ship seized by pirates, lashed out at Rush Limbaugh for the talk show host's racial characterization in discussing the rescue of the ship's captain by the Navy. Murphy, who returned to his Seekonk, Mass., home Friday, called Limbaugh a purveyor of \"hate speech.\" In commenting on the rescue of Capt. Richard Phillips by the Navy Seals who shot and killed the three Somali pirates who were holding him captive, Limbaugh generated controversy when he called the pirates \"black teenagers.\" \"There you have it, three teenagers shot on the high seas at the order of President Obama,\" said Limbaugh according to a transcript of an April 14 broadcast on his Web site. \"Just imagine the hue and cry had a Republican president ordered the shooting of black teenagers on the high seas,\" Limbaugh said. Murphy said Limbaugh's remarks were unacceptable. \"It feels great to be home,\" Murphy said. \"With the exception of Rush Limbaugh who is trying to make this into a race issue. It's disgusting.\" \"The president did the right thing. It's a war. It's about good versus evil. And what you (Limbaugh) said is evil, that is hate speech. I won't tolerate it,\" Murphy said. Murphy said he and his family have had a difficult time since his release and return to the United States. The intense public attention on the rescue of the crew of the Maersk Alabama has made adjustment to a normal family life difficult, he said. \"We have not been left alone. We have not been allowed to go out and even do routine things,\" Murphy said. Murphy, who took command of the ship after Phillips was taken hostage, said he and his family are trying to get through it all. http://www.thebostonchannel.com/news/19273935/detail.html Must not be a ditto head.", 
        "intTime": 20090425, 
        "postID": 41, 
        "quote": "", 
        "reply": "SEEKONK, Mass. -- Shane Murphy, the second-in-command aboard the American merchant ship seized by pirates, lashed out at Rush Limbaugh for the talk show host's racial characterization in discussing the rescue of the ship's captain by the Navy. Murphy, who returned to his Seekonk, Mass., home Friday, called Limbaugh a purveyor of \"hate speech.\" In commenting on the rescue of Capt. Richard Phillips by the Navy Seals who shot and killed the three Somali pirates who were holding him captive, Limbaugh generated controversy when he called the pirates \"black teenagers.\" \"There you have it, three teenagers shot on the high seas at the order of President Obama,\" said Limbaugh according to a transcript of an April 14 broadcast on his Web site. \"Just imagine the hue and cry had a Republican president ordered the shooting of black teenagers on the high seas,\" Limbaugh said. Murphy said Limbaugh's remarks were unacceptable. \"It feels great to be home,\" Murphy said. \"With the exception of Rush Limbaugh who is trying to make this into a race issue. It's disgusting.\" \"The president did the right thing. It's a war. It's about good versus evil. And what you (Limbaugh) said is evil, that is hate speech. I won't tolerate it,\" Murphy said. Murphy said he and his family have had a difficult time since his release and return to the United States. The intense public attention on the rescue of the crew of the Maersk Alabama has made adjustment to a normal family life difficult, he said. \"We have not been left alone. We have not been allowed to go out and even do routine things,\" Murphy said. Murphy, who took command of the ship after Phillips was taken hostage, said he and his family are trying to get through it all. http://www.thebostonchannel.com/news/19273935/detail.html Must not be a ditto head.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 01:35:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Limbaugh needs to STFU. Then again, he makes a living off of making stupid, outrageous comments... Wonder why he never goes after jews?", 
        "intTime": 20090425, 
        "postID": 42, 
        "quote": "", 
        "reply": "Limbaugh needs to STFU. Then again, he makes a living off of making stupid, outrageous comments... Wonder why he never goes after jews?", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 01:50:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: SEEKONK, Mass. -- Shane Murphy, the second-in-command aboard the American merchant ship seized by pirates, lashed out at Rush Limbaugh for the talk show host's racial characterization in discussing the rescue of the ship's captain by the Navy. Murphy, who returned to his Seekonk, Mass., home Friday, called Limbaugh a purveyor of \"hate speech.\" In commenting on the rescue of Capt. Richard Phillips by the Navy Seals who shot and killed the three Somali pirates who were holding him captive, Limbaugh generated controversy when he called the pirates \"black teenagers.\" \"There you have it, three teenagers shot on the high seas at the order of President Obama,\" said Limbaugh according to a transcript of an April 14 broadcast on his Web site. \"Just imagine the hue and cry had a Republican president ordered the shooting of black teenagers on the high seas,\" Limbaugh said. Murphy said Limbaugh's remarks were unacceptable. \"It feels great to be home,\" Murphy said. \"With the exception of Rush Limbaugh who is trying to make this into a race issue. It's disgusting.\" \"The president did the right thing. It's a war. It's about good versus evil. And what you (Limbaugh) said is evil, that is hate speech. I won't tolerate it,\" Murphy said. Murphy said he and his family have had a difficult time since his release and return to the United States. The intense public attention on the rescue of the crew of the Maersk Alabama has made adjustment to a normal family life difficult, he said. \"We have not been left alone. We have not been allowed to go out and even do routine things,\" Murphy said. Murphy, who took command of the ship after Phillips was taken hostage, said he and his family are trying to get through it all. http://www.thebostonchannel.com/news/19273935/detail.html Must not be a ditto head. More proof that Limbaugh is a fool.", 
        "intTime": 20090425, 
        "postID": 43, 
        "quote": "Originally posted by jdksfcret: SEEKONK, Mass. -- Shane Murphy, the second-in-command aboard the American merchant ship seized by pirates, lashed out at Rush Limbaugh for the talk show host's racial characterization in discussing the rescue of the ship's captain by the Navy. Murphy, who returned to his Seekonk, Mass., home Friday, called Limbaugh a purveyor of \"hate speech.\" In commenting on the rescue of Capt. Richard Phillips by the Navy Seals who shot and killed the three Somali pirates who were holding him captive, Limbaugh generated controversy when he called the pirates \"black teenagers.\" \"There you have it, three teenagers shot on the high seas at the order of President Obama,\" said Limbaugh according to a transcript of an April 14 broadcast on his Web site. \"Just imagine the hue and cry had a Republican president ordered the shooting of black teenagers on the high seas,\" Limbaugh said. Murphy said Limbaugh's remarks were unacceptable. \"It feels great to be home,\" Murphy said. \"With the exception of Rush Limbaugh who is trying to make this into a race issue. It's disgusting.\" \"The president did the right thing. It's a war. It's about good versus evil. And what you (Limbaugh) said is evil, that is hate speech. I won't tolerate it,\" Murphy said. Murphy said he and his family have had a difficult time since his release and return to the United States. The intense public attention on the rescue of the crew of the Maersk Alabama has made adjustment to a normal family life difficult, he said. \"We have not been left alone. We have not been allowed to go out and even do routine things,\" Murphy said. Murphy, who took command of the ship after Phillips was taken hostage, said he and his family are trying to get through it all. http://www.thebostonchannel.com/news/19273935/detail.html Must not be a ditto head.", 
        "reply": " More proof that Limbaugh is a fool.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 04:26:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Well thats what they were. Maybe he needs to go back to sea and try it all over again.", 
        "intTime": 20090425, 
        "postID": 44, 
        "quote": "", 
        "reply": "Well thats what they were. Maybe he needs to go back to sea and try it all over again.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 04:30:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Duster6"
    }, 
    {
        "content": "Their color is irrelevant, Duster - as is their age. What IS relevant is that they are (were) PIRATES. Had Rash said, \"If a Republican President had ordered the shooting of PIRATES on the high seas ...\" there would be no controversy, because such an order is appropriate presidential reaction to piracy on the high seas. But then, he would never have said that, because he lives for controversy and publicity.", 
        "intTime": 20090425, 
        "postID": 45, 
        "quote": "", 
        "reply": "Their color is irrelevant, Duster - as is their age. What IS relevant is that they are (were) PIRATES. Had Rash said, \"If a Republican President had ordered the shooting of PIRATES on the high seas ...\" there would be no controversy, because such an order is appropriate presidential reaction to piracy on the high seas. But then, he would never have said that, because he lives for controversy and publicity.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 04:41:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "Yeah but that RADICAL RIGHT WINGED Drug Addict Pill Popper was refering to it much more that.", 
        "intTime": 20090425, 
        "postID": 46, 
        "quote": "", 
        "reply": "Yeah but that RADICAL RIGHT WINGED Drug Addict Pill Popper was refering to it much more that.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 05:02:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Well thats what they were. Maybe he needs to go back to sea and try it all over again. The racist aspect of Limbaughs remarks are total. He said plain out, that if a White man had given the order to shoot, he would have been labeled a racist for killing Black teenagers. You buy this? In addition he continiously refers to the Somali Pirates as \"Community Organisers,\" and the \"natural allies of Obama.\" If you don't believe that, take a look at his rants - I am NOT exagerating! Dave", 
        "intTime": 20090425, 
        "postID": 47, 
        "quote": "Originally posted by Duster6: Well thats what they were. Maybe he needs to go back to sea and try it all over again.", 
        "reply": " The racist aspect of Limbaughs remarks are total. He said plain out, that if a White man had given the order to shoot, he would have been labeled a racist for killing Black teenagers. You buy this? In addition he continiously refers to the Somali Pirates as \"Community Organisers,\" and the \"natural allies of Obama.\" If you don't believe that, take a look at his rants - I am NOT exagerating! Dave", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 09:23:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Grachus"
    }, 
    {
        "content": "First, Rush has NO power. He may influence people, but he truly has no power. For all you folks geting in an upraor about what he says. You play right into the fools plans. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090425, 
        "postID": 48, 
        "quote": "", 
        "reply": "First, Rush has NO power. He may influence people, but he truly has no power. For all you folks geting in an upraor about what he says. You play right into the fools plans. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 09:43:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Duster6: Well thats what they were. Maybe he needs to go back to sea and try it all over again. The racist aspect of Limbaughs remarks are total. He said plain out, that if a White man had given the order to shoot, he would have been labeled a racist for killing Black teenagers. You buy this? In addition he continiously refers to the Somali Pirates as \"Community Organisers,\" and the \"natural allies of Obama.\" If you don't believe that, take a look at his rants - I am NOT exagerating! Dave He didn't say that there would have been a public outcry from the left if a white Prez had given the order to shoot black teenage pirates, he said there'd have been one if a Republican Prez had done so. I happen to agree with him. I also don't understand how Rush's description of the pirates as \"black teenagers\" is \"racist\" or \"hate speech\" in any way. They were black teenagers!", 
        "intTime": 20090425, 
        "postID": 49, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Duster6: Well thats what they were. Maybe he needs to go back to sea and try it all over again. The racist aspect of Limbaughs remarks are total. He said plain out, that if a White man had given the order to shoot, he would have been labeled a racist for killing Black teenagers. You buy this? In addition he continiously refers to the Somali Pirates as \"Community Organisers,\" and the \"natural allies of Obama.\" If you don't believe that, take a look at his rants - I am NOT exagerating! Dave", 
        "reply": " He didn't say that there would have been a public outcry from the left if a white Prez had given the order to shoot black teenage pirates, he said there'd have been one if a Republican Prez had done so. I happen to agree with him. I also don't understand how Rush's description of the pirates as \"black teenagers\" is \"racist\" or \"hate speech\" in any way. They were black teenagers!", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 10:46:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Who cares what a \"junkie\" like Limbaugh has to say ... At least the Seaman Murphy isn't cowering at Limbaugh's feet begging for his forgiveness, like others from a certain political party do ... lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090425, 
        "postID": 50, 
        "quote": "", 
        "reply": "Who cares what a \"junkie\" like Limbaugh has to say ... At least the Seaman Murphy isn't cowering at Limbaugh's feet begging for his forgiveness, like others from a certain political party do ... lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 10:50:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Lush Rimbaugh isn't trying to 'racialize' anything he's trying to politicize it. The colour of any involved is of minor import when it comes to being a REAL American.", 
        "intTime": 20090425, 
        "postID": 51, 
        "quote": "", 
        "reply": "Lush Rimbaugh isn't trying to 'racialize' anything he's trying to politicize it. The colour of any involved is of minor import when it comes to being a REAL American.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 11:18:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by Grachus: The racist aspect of Limbaughs remarks are total. He said plain out, that if a White man had given the order to shoot, he would have been labeled a racist for killing Black teenagers. You buy this? In addition he continiously refers to the Somali Pirates as \"Community Organisers,\" and the \"natural allies of Obama.\" If you don't believe that, take a look at his rants - I am NOT exagerating! Dave quote: Originally posted by shades_of_grey: He didn't say that there would have been a public outcry from the left if a white Prez had given the order to shoot black teenage pirates, he said there'd have been one if a Republican Prez had done so. I happen to agree with him. I also don't understand how Rush's description of the pirates as \"black teenagers\" is \"racist\" or \"hate speech\" in any way. They were black teenagers! \"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh And you AGREE with this!!!! Dave", 
        "intTime": 20090425, 
        "postID": 52, 
        "quote": "Originally posted by Grachus: The racist aspect of Limbaughs remarks are total. He said plain out, that if a White man had given the order to shoot, he would have been labeled a racist for killing Black teenagers. You buy this? In addition he continiously refers to the Somali Pirates as \"Community Organisers,\" and the \"natural allies of Obama.\" If you don't believe that, take a look at his rants - I am NOT exagerating! Dave", 
        "reply": " quote: Originally posted by shades_of_grey: He didn't say that there would have been a public outcry from the left if a white Prez had given the order to shoot black teenage pirates, he said there'd have been one if a Republican Prez had done so. I happen to agree with him. I also don't understand how Rush's description of the pirates as \"black teenagers\" is \"racist\" or \"hate speech\" in any way. They were black teenagers! \"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh And you AGREE with this!!!! Dave", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 11:22:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: Who cares what a \"junkie\" like Limbaugh has to say ... At least the Seaman Murphy isn't cowering at Limbaugh's feet begging for his forgiveness, like others from a certain political party do ... lol Physician heal thyself!... Respectfully, SUNLINER81", 
        "intTime": 20090425, 
        "postID": 53, 
        "quote": "Originally posted by jack_flats: Who cares what a \"junkie\" like Limbaugh has to say ... At least the Seaman Murphy isn't cowering at Limbaugh's feet begging for his forgiveness, like others from a certain political party do ... lol", 
        "reply": " Physician heal thyself!... Respectfully, SUNLINER81", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 11:24:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Limbaugh's comments were accurate. They were black, they were teenagers, and Obama ordered them assassinated. Where's the \"hate\" speech in those remarks? \"The World's Finest\"", 
        "intTime": 20090425, 
        "postID": 54, 
        "quote": "", 
        "reply": "Limbaugh's comments were accurate. They were black, they were teenagers, and Obama ordered them assassinated. Where's the \"hate\" speech in those remarks? \"The World's Finest\"", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 11:43:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Limbaugh's comments were accurate. They were black, they were teenagers, and Obama ordered them assassinated. Where's the \"hate\" speech in those remarks? quote: \"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh To imply that people on THIS BOARD would be calling President Bush a criminal for killing \"Black teenagers\" is over the top. It's a disgusting attack on Obama, and everyone else who cheered the Seals. Mr. Bush was the one who ordered our Navy to patrol the coast in the first place - Post where anyone here, or the Net referred to this as a racist act on his part aimed at Black People? The amount of HS that you guys are ready to swallow always amazes me. Dave", 
        "intTime": 20090425, 
        "postID": 55, 
        "quote": "Originally posted by Kegler300: Limbaugh's comments were accurate. They were black, they were teenagers, and Obama ordered them assassinated. Where's the \"hate\" speech in those remarks?", 
        "reply": " quote: \"If you let George Bush's Navy gun down three black teenagers in the open sea and there would have been hell to pay.\" Rush Limbaugh. \"Now, just imaging the hue and cry had a Republican president ordered added the shooting of black teenagers on the high seas.\" Rush Limbaugh To imply that people on THIS BOARD would be calling President Bush a criminal for killing \"Black teenagers\" is over the top. It's a disgusting attack on Obama, and everyone else who cheered the Seals. Mr. Bush was the one who ordered our Navy to patrol the coast in the first place - Post where anyone here, or the Net referred to this as a racist act on his part aimed at Black People? The amount of HS that you guys are ready to swallow always amazes me. Dave", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 11:55:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Grachus"
    }, 
    {
        "content": "Ummm....were the pirates in question \"black teenagers?\" They were? OK. What are we complaining about, then? Some hre need to be reminded that merely expressing the fact that some people are of a certain race is not evidence of racism. Racism is the belief that one race is inherently superior to another. If Mr. Limbaugh did not express that, and I have read nothing in this thread suggesting that he did, then some of you need to STFU.", 
        "intTime": 20090425, 
        "postID": 56, 
        "quote": "", 
        "reply": "Ummm....were the pirates in question \"black teenagers?\" They were? OK. What are we complaining about, then? Some hre need to be reminded that merely expressing the fact that some people are of a certain race is not evidence of racism. Racism is the belief that one race is inherently superior to another. If Mr. Limbaugh did not express that, and I have read nothing in this thread suggesting that he did, then some of you need to STFU.", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 14:19:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: Originally posted by Bleah: Ummm....were the pirates in question \"black teenagers?\" They were? OK. What are we complaining about, then? Some hre need to be reminded that merely expressing the fact that some people are of a certain race is not evidence of racism. Racism is the belief that one race is inherently superior to another. If Mr. Limbaugh did not express that, and I have read nothing in this thread suggesting that he did, then some of you need to STFU. To say that I would have complained if Mr. Bush killed these pirates, whereas I'm NOT complaining about Obama doing it - Is in fact to claim that I make my decisions based on race. It was Limbaugh who emphasizes the race of these pirates - When ultimately a pirate is a pirate is a pirate. Why is race relevant to the discussion at all? Because Limbaugh says it is? Is he \"informing\" us of something we didn't know? Dave", 
        "intTime": 20090425, 
        "postID": 57, 
        "quote": "Originally posted by Bleah: Ummm....were the pirates in question \"black teenagers?\" They were? OK. What are we complaining about, then? Some hre need to be reminded that merely expressing the fact that some people are of a certain race is not evidence of racism. Racism is the belief that one race is inherently superior to another. If Mr. Limbaugh did not express that, and I have read nothing in this thread suggesting that he did, then some of you need to STFU.", 
        "reply": " To say that I would have complained if Mr. Bush killed these pirates, whereas I'm NOT complaining about Obama doing it - Is in fact to claim that I make my decisions based on race. It was Limbaugh who emphasizes the race of these pirates - When ultimately a pirate is a pirate is a pirate. Why is race relevant to the discussion at all? Because Limbaugh says it is? Is he \"informing\" us of something we didn't know? Dave", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 15:07:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Grachus"
    }, 
    {
        "content": "Rush....That`s right big guy....rush rush away,...Ya know, That guy is soooo predictable,..not to mention afraid...of ME...he`ll tell ya,...That phoney B*st*rd stays just inside FCC guidelines to convey what he really wants his follower to say for him,...he implies, suggests, then relies on the ignorance of his followers, useing messages sent subblibblibblibly or blub blub bluberly..whatevea.....to gain poularity on the speakings of the foolish that buy his BS !! Guessing what he meant ....makes him popular !! So why does he run from OddBall ?? Someone bring that sunditch here and I`ll show ya !", 
        "intTime": 20090425, 
        "postID": 58, 
        "quote": "", 
        "reply": "Rush....That`s right big guy....rush rush away,...Ya know, That guy is soooo predictable,..not to mention afraid...of ME...he`ll tell ya,...That phoney B*st*rd stays just inside FCC guidelines to convey what he really wants his follower to say for him,...he implies, suggests, then relies on the ignorance of his followers, useing messages sent subblibblibblibly or blub blub bluberly..whatevea.....to gain poularity on the speakings of the foolish that buy his BS !! Guessing what he meant ....makes him popular !! So why does he run from OddBall ?? Someone bring that sunditch here and I`ll show ya !", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 15:41:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "\"Yet the charges that he is a racist because the victims of the hurricane were, for the most part, black and poor, are nothing more than political propaganda by the Bush-haters on the left. You only have to look at where these comments are coming from to see that they are nothing more than political rhetoric. One group that is promulgating the \"Bush as racist\" mantra is comprised of those who are in the race business; the Al Sharptons and the Jesse Jacksons. The other group that was quick off the mark to go after Bush was, unsurprisingly, the political sophisticates of Hollywood.\" from: \"\"http://canadafreepress.com/2005/weinreb091205.htm And from the unbiased tompain website: \"\"http://www.tompaine.com/articles/2005/09/14/the_inequality_president.php No, of course there'd be no accusations of raceism, DEM'S never bring THAT up, do they?", 
        "intTime": 20090425, 
        "postID": 59, 
        "quote": "", 
        "reply": "\"Yet the charges that he is a racist because the victims of the hurricane were, for the most part, black and poor, are nothing more than political propaganda by the Bush-haters on the left. You only have to look at where these comments are coming from to see that they are nothing more than political rhetoric. One group that is promulgating the \"Bush as racist\" mantra is comprised of those who are in the race business; the Al Sharptons and the Jesse Jacksons. The other group that was quick off the mark to go after Bush was, unsurprisingly, the political sophisticates of Hollywood.\" from: \"\"http://canadafreepress.com/2005/weinreb091205.htm And from the unbiased tompain website: \"\"http://www.tompaine.com/articles/2005/09/14/the_inequality_president.php No, of course there'd be no accusations of raceism, DEM'S never bring THAT up, do they?", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 16:06:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: \"Yet the charges that he is a racist because the victims of the hurricane were, for the most part, black and poor, are nothing more than political propaganda by the Bush-haters on the left. You only have to look at where these comments are coming from to see that they are nothing more than political rhetoric. One group that is promulgating the \"Bush as racist\" mantra is comprised of those who are in the race business; the Al Sharptons and the Jesse Jacksons. The other group that was quick off the mark to go after Bush was, unsurprisingly, the political sophisticates of Hollywood.\" from: \"\"http://canadafreepress.com/2005/weinreb091205.htm And from the unbiased tompain website: \"\"http://www.tompaine.com/articles/2005/09/14/the_inequality_president.php No, of course there'd be no accusations of raceism, DEM'S never bring THAT up, do they? I dunno Peter - Is ANYTHING you mentioned above on this thread? Defending Mr. Bush against the charges of racism brought against him here... I've heard of changing the topic, but with the above you just plain ignore it. Dave", 
        "intTime": 20090425, 
        "postID": 60, 
        "quote": "Originally posted by peter3_1: \"Yet the charges that he is a racist because the victims of the hurricane were, for the most part, black and poor, are nothing more than political propaganda by the Bush-haters on the left. You only have to look at where these comments are coming from to see that they are nothing more than political rhetoric. One group that is promulgating the \"Bush as racist\" mantra is comprised of those who are in the race business; the Al Sharptons and the Jesse Jacksons. The other group that was quick off the mark to go after Bush was, unsurprisingly, the political sophisticates of Hollywood.\" from: \"\"http://canadafreepress.com/2005/weinreb091205.htm And from the unbiased tompain website: \"\"http://www.tompaine.com/articles/2005/09/14/the_inequality_president.php No, of course there'd be no accusations of raceism, DEM'S never bring THAT up, do they?", 
        "reply": " I dunno Peter - Is ANYTHING you mentioned above on this thread? Defending Mr. Bush against the charges of racism brought against him here... I've heard of changing the topic, but with the above you just plain ignore it. Dave", 
        "threadID": "672198221_2530027122001", 
        "time": "2009-04-25 16:21:00", 
        "title": "Freed Pirate Hostage Accuses Limbaugh Of 'Hate Speech'", 
        "userID": "Grachus"
    }
]