[
    {
        "content": "Brilliant! 'http://www.telegraph.co.uk/news/worldnews/northamerica/usa/barackobama/5096803/Barack-Obama-rejects-Normandy-trip-to-avoid-offending-Germany.html' quote: White House officials travelled to France at the start of March to discuss a visit by Mr Obama to Omaha Beach, the site of the American Cemetery, established in 1944 just after D-Day and where 9,387 American personnel are buried. Among them is Theodore Roosevelt Jr the eldest son of the 26th US President. French officials and senior American military officers walked with White House staff through the cemetery discussing how the two presidents might follow the same route. But even before their trip, the White House had decided that Mr Obama would not travel there this week. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\". A White House spokesman in London declined to comment. Last month, White House officials briefed that a Normandy visit had been considered but it had not been logistically possible. Mr Obama will arrive in Strasbourg on Friday for the Nato summit. He will hold a meeting with Mr Sarkozy and a brief press appearance in Strasbourg and then fly to Baden-Baden to do exactly the same with Chancellor Merkel of Germany. He will then fly to Prague on Saturday.", 
        "intTime": 20090407, 
        "postID": 1, 
        "quote": "White House officials travelled to France at the start of March to discuss a visit by Mr Obama to Omaha Beach, the site of the American Cemetery, established in 1944 just after D-Day and where 9,387 American personnel are buried. Among them is Theodore Roosevelt Jr the eldest son of the 26th US President. French officials and senior American military officers walked with White House staff through the cemetery discussing how the two presidents might follow the same route. But even before their trip, the White House had decided that Mr Obama would not travel there this week. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\". A White House spokesman in London declined to comment. Last month, White House officials briefed that a Normandy visit had been considered but it had not been logistically possible. Mr Obama will arrive in Strasbourg on Friday for the Nato summit. He will hold a meeting with Mr Sarkozy and a brief press appearance in Strasbourg and then fly to Baden-Baden to do exactly the same with Chancellor Merkel of Germany. He will then fly to Prague on Saturday.", 
        "reply": "Brilliant! 'http://www.telegraph.co.uk/news/worldnews/northamerica/usa/barackobama/5096803/Barack-Obama-rejects-Normandy-trip-to-avoid-offending-Germany.html' ", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:26:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I think you're twisting this a bit, Gunny... \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda...During this trip, we wanted to maintain a balance between the British, German and France\". It appears that the French wanted to use the cemetery for Sarkozy's purposes, but the Americans said no. It looked to me as though Obama was conscious about giving everyone equal time during the period of the NATO Summit and didn't want to appear to favor one nation over the other. Where did you see the sensitivity toward the Germans?", 
        "intTime": 20090407, 
        "postID": 2, 
        "quote": "", 
        "reply": "I think you're twisting this a bit, Gunny... \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda...During this trip, we wanted to maintain a balance between the British, German and France\". It appears that the French wanted to use the cemetery for Sarkozy's purposes, but the Americans said no. It looked to me as though Obama was conscious about giving everyone equal time during the period of the NATO Summit and didn't want to appear to favor one nation over the other. Where did you see the sensitivity toward the Germans?", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:46:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090407, 
        "postID": 3, 
        "quote": "Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda.", 
        "reply": " How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:48:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead.", 
        "intTime": 20090407, 
        "postID": 4, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part.", 
        "reply": " Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:51:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090407, 
        "postID": 5, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead.", 
        "reply": " He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:53:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited.", 
        "intTime": 20090407, 
        "postID": 6, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them.", 
        "reply": " I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 13:00:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "If he went people would be screaming about it being a photo op, if he doesn't go people get upset about that.", 
        "intTime": 20090407, 
        "postID": 7, 
        "quote": "", 
        "reply": "If he went people would be screaming about it being a photo op, if he doesn't go people get upset about that.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 13:06:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\" So I guess you missed reading that part. Maybe I should of said bowing to the Germans and the British? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090407, 
        "postID": 8, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited.", 
        "reply": " \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\" So I guess you missed reading that part. Maybe I should of said bowing to the Germans and the British? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 13:19:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Anbar7"
    }, 
    {
        "content": "I think he need to take a course in History 101, me thinks.....", 
        "intTime": 20090407, 
        "postID": 9, 
        "quote": "", 
        "reply": "I think he need to take a course in History 101, me thinks.....", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 18:46:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\" So I guess you missed reading that part. Maybe I should of said bowing to the Germans and the British? I read the entire article. Again, it seems as though he may have been trying not to give the impression of playing favorites by taking more time with one over the other. Also, keep in mind that his visit to England was not connected to the NATO Summit in Strasbourg; it was part of the G20.", 
        "intTime": 20090407, 
        "postID": 10, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\" So I guess you missed reading that part. Maybe I should of said bowing to the Germans and the British?", 
        "reply": " I read the entire article. Again, it seems as though he may have been trying not to give the impression of playing favorites by taking more time with one over the other. Also, keep in mind that his visit to England was not connected to the NATO Summit in Strasbourg; it was part of the G20.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 18:51:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Migbuster: I think he need to take a course in History 101, me thinks..... Care to elaborate on that?", 
        "intTime": 20090407, 
        "postID": 11, 
        "quote": "Originally posted by Migbuster: I think he need to take a course in History 101, me thinks.....", 
        "reply": " Care to elaborate on that?", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 18:52:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "I think He does not understand The history of WW2 and NORMANDY...JMHO.", 
        "intTime": 20090407, 
        "postID": 12, 
        "quote": "", 
        "reply": "I think He does not understand The history of WW2 and NORMANDY...JMHO.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 18:57:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Migbuster"
    }, 
    {
        "content": "Skipping a visit to the Normandy WW2 burials of AMERICAN soldiers is a slap in the face. What was he thinking? And don't re write what his official appologist told you to write.", 
        "intTime": 20090407, 
        "postID": 13, 
        "quote": "", 
        "reply": "Skipping a visit to the Normandy WW2 burials of AMERICAN soldiers is a slap in the face. What was he thinking? And don't re write what his official appologist told you to write.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 19:15:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "peter3_1"
    }, 
    {
        "content": "Pictured above, R-wingers twist the news.", 
        "intTime": 20090407, 
        "postID": 14, 
        "quote": "", 
        "reply": "Pictured above, R-wingers twist the news.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 19:35:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Skipping a visit to the Normandy WW2 burials of AMERICAN soldiers is a slap in the face. What was he thinking? And don't re write what his official appologist told you to write. How exactly is it a slap in the face? He took the time to visit troops in Iraq, he has been to Arlington, and has shown a lot of concern for the military. He can't go to everything he is asked to appear for, and I would bet he will be in Normandy in June for the 65th anniversary.", 
        "intTime": 20090407, 
        "postID": 15, 
        "quote": "Originally posted by peter3_1: Skipping a visit to the Normandy WW2 burials of AMERICAN soldiers is a slap in the face. What was he thinking? And don't re write what his official appologist told you to write.", 
        "reply": " How exactly is it a slap in the face? He took the time to visit troops in Iraq, he has been to Arlington, and has shown a lot of concern for the military. He can't go to everything he is asked to appear for, and I would bet he will be in Normandy in June for the 65th anniversary.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 19:41:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Obama cancelled his trip to Normandy beach 'cause his staff forgot to plant stones for him to make a cross with.", 
        "intTime": 20090407, 
        "postID": 16, 
        "quote": "", 
        "reply": "Obama cancelled his trip to Normandy beach 'cause his staff forgot to plant stones for him to make a cross with.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 19:47:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "badmac933"
    }, 
    {
        "content": "I stand by my President. He can always go next year or the year after. Like he said to that kid the other day, being President is like steering a super tanker. One makes small, steady turns but in the end he gets to where he is going.", 
        "intTime": 20090407, 
        "postID": 17, 
        "quote": "", 
        "reply": "I stand by my President. He can always go next year or the year after. Like he said to that kid the other day, being President is like steering a super tanker. One makes small, steady turns but in the end he gets to where he is going.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 20:07:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I stand by my President. He can always go next year or the year after. Like he said to that kid the other day, being President is like steering a super tanker. One makes small, steady turns but in the end he gets to where he is going. How profound.", 
        "intTime": 20090407, 
        "postID": 18, 
        "quote": "Originally posted by Duster6: I stand by my President. He can always go next year or the year after. Like he said to that kid the other day, being President is like steering a super tanker. One makes small, steady turns but in the end he gets to where he is going.", 
        "reply": " How profound.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 20:12:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "badmac933"
    }, 
    {
        "content": "Better a US President avoid a trip full of logistical challenges than come off as a shrub like the last idiot...", 
        "intTime": 20090407, 
        "postID": 19, 
        "quote": "", 
        "reply": "Better a US President avoid a trip full of logistical challenges than come off as a shrub like the last idiot...", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 20:12:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Migbuster: I think He does not understand The history of WW2 and NORMANDY...JMHO. Based on what?", 
        "intTime": 20090407, 
        "postID": 20, 
        "quote": "Originally posted by Migbuster: I think He does not understand The history of WW2 and NORMANDY...JMHO.", 
        "reply": " Based on what?", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 20:39:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Brilliant! 'http://www.telegraph.co.uk/news/worldnews/northamerica/usa/barackobama/5096803/Barack-Obama-rejects-Normandy-trip-to-avoid-offending-Germany.html' quote: White House officials travelled to France at the start of March to discuss a visit by Mr Obama to Omaha Beach, the site of the American Cemetery, established in 1944 just after D-Day and where 9,387 American personnel are buried. Among them is Theodore Roosevelt Jr the eldest son of the 26th US President. French officials and senior American military officers walked with White House staff through the cemetery discussing how the two presidents might follow the same route. But even before their trip, the White House had decided that Mr Obama would not travel there this week. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\". A White House spokesman in London declined to comment. Last month, White House officials briefed that a Normandy visit had been considered but it had not been logistically possible. Mr Obama will arrive in Strasbourg on Friday for the Nato summit. He will hold a meeting with Mr Sarkozy and a brief press appearance in Strasbourg and then fly to Baden-Baden to do exactly the same with Chancellor Merkel of Germany. He will then fly to Prague on Saturday.", 
        "intTime": 20090407, 
        "postID": 21, 
        "quote": "White House officials travelled to France at the start of March to discuss a visit by Mr Obama to Omaha Beach, the site of the American Cemetery, established in 1944 just after D-Day and where 9,387 American personnel are buried. Among them is Theodore Roosevelt Jr the eldest son of the 26th US President. French officials and senior American military officers walked with White House staff through the cemetery discussing how the two presidents might follow the same route. But even before their trip, the White House had decided that Mr Obama would not travel there this week. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\". A White House spokesman in London declined to comment. Last month, White House officials briefed that a Normandy visit had been considered but it had not been logistically possible. Mr Obama will arrive in Strasbourg on Friday for the Nato summit. He will hold a meeting with Mr Sarkozy and a brief press appearance in Strasbourg and then fly to Baden-Baden to do exactly the same with Chancellor Merkel of Germany. He will then fly to Prague on Saturday.", 
        "reply": "Brilliant! 'http://www.telegraph.co.uk/news/worldnews/northamerica/usa/barackobama/5096803/Barack-Obama-rejects-Normandy-trip-to-avoid-offending-Germany.html' ", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:26:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I think you're twisting this a bit, Gunny... \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda...During this trip, we wanted to maintain a balance between the British, German and France\". It appears that the French wanted to use the cemetery for Sarkozy's purposes, but the Americans said no. It looked to me as though Obama was conscious about giving everyone equal time during the period of the NATO Summit and didn't want to appear to favor one nation over the other. Where did you see the sensitivity toward the Germans?", 
        "intTime": 20090407, 
        "postID": 22, 
        "quote": "", 
        "reply": "I think you're twisting this a bit, Gunny... \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda...During this trip, we wanted to maintain a balance between the British, German and France\". It appears that the French wanted to use the cemetery for Sarkozy's purposes, but the Americans said no. It looked to me as though Obama was conscious about giving everyone equal time during the period of the NATO Summit and didn't want to appear to favor one nation over the other. Where did you see the sensitivity toward the Germans?", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:46:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090407, 
        "postID": 23, 
        "quote": "Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda.", 
        "reply": " How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:48:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead.", 
        "intTime": 20090407, 
        "postID": 24, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part.", 
        "reply": " Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:51:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090407, 
        "postID": 25, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead.", 
        "reply": " He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:53:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited.", 
        "intTime": 20090407, 
        "postID": 26, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them.", 
        "reply": " I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 13:00:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "If he went people would be screaming about it being a photo op, if he doesn't go people get upset about that.", 
        "intTime": 20090407, 
        "postID": 27, 
        "quote": "", 
        "reply": "If he went people would be screaming about it being a photo op, if he doesn't go people get upset about that.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 13:06:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\" So I guess you missed reading that part. Maybe I should of said bowing to the Germans and the British? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090407, 
        "postID": 28, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited.", 
        "reply": " \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\" So I guess you missed reading that part. Maybe I should of said bowing to the Germans and the British? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 13:19:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Anbar7"
    }, 
    {
        "content": "I think he need to take a course in History 101, me thinks.....", 
        "intTime": 20090407, 
        "postID": 29, 
        "quote": "", 
        "reply": "I think he need to take a course in History 101, me thinks.....", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 18:46:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\" So I guess you missed reading that part. Maybe I should of said bowing to the Germans and the British? I read the entire article. Again, it seems as though he may have been trying not to give the impression of playing favorites by taking more time with one over the other. Also, keep in mind that his visit to England was not connected to the NATO Summit in Strasbourg; it was part of the G20.", 
        "intTime": 20090407, 
        "postID": 30, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\" So I guess you missed reading that part. Maybe I should of said bowing to the Germans and the British?", 
        "reply": " I read the entire article. Again, it seems as though he may have been trying not to give the impression of playing favorites by taking more time with one over the other. Also, keep in mind that his visit to England was not connected to the NATO Summit in Strasbourg; it was part of the G20.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 18:51:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Migbuster: I think he need to take a course in History 101, me thinks..... Care to elaborate on that?", 
        "intTime": 20090407, 
        "postID": 31, 
        "quote": "Originally posted by Migbuster: I think he need to take a course in History 101, me thinks.....", 
        "reply": " Care to elaborate on that?", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 18:52:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "I think He does not understand The history of WW2 and NORMANDY...JMHO.", 
        "intTime": 20090407, 
        "postID": 32, 
        "quote": "", 
        "reply": "I think He does not understand The history of WW2 and NORMANDY...JMHO.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 18:57:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Migbuster"
    }, 
    {
        "content": "Skipping a visit to the Normandy WW2 burials of AMERICAN soldiers is a slap in the face. What was he thinking? And don't re write what his official appologist told you to write.", 
        "intTime": 20090407, 
        "postID": 33, 
        "quote": "", 
        "reply": "Skipping a visit to the Normandy WW2 burials of AMERICAN soldiers is a slap in the face. What was he thinking? And don't re write what his official appologist told you to write.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 19:15:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "peter3_1"
    }, 
    {
        "content": "Pictured above, R-wingers twist the news.", 
        "intTime": 20090407, 
        "postID": 34, 
        "quote": "", 
        "reply": "Pictured above, R-wingers twist the news.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 19:35:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Skipping a visit to the Normandy WW2 burials of AMERICAN soldiers is a slap in the face. What was he thinking? And don't re write what his official appologist told you to write. How exactly is it a slap in the face? He took the time to visit troops in Iraq, he has been to Arlington, and has shown a lot of concern for the military. He can't go to everything he is asked to appear for, and I would bet he will be in Normandy in June for the 65th anniversary.", 
        "intTime": 20090407, 
        "postID": 35, 
        "quote": "Originally posted by peter3_1: Skipping a visit to the Normandy WW2 burials of AMERICAN soldiers is a slap in the face. What was he thinking? And don't re write what his official appologist told you to write.", 
        "reply": " How exactly is it a slap in the face? He took the time to visit troops in Iraq, he has been to Arlington, and has shown a lot of concern for the military. He can't go to everything he is asked to appear for, and I would bet he will be in Normandy in June for the 65th anniversary.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 19:41:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Obama cancelled his trip to Normandy beach 'cause his staff forgot to plant stones for him to make a cross with.", 
        "intTime": 20090407, 
        "postID": 36, 
        "quote": "", 
        "reply": "Obama cancelled his trip to Normandy beach 'cause his staff forgot to plant stones for him to make a cross with.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 19:47:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "badmac933"
    }, 
    {
        "content": "I stand by my President. He can always go next year or the year after. Like he said to that kid the other day, being President is like steering a super tanker. One makes small, steady turns but in the end he gets to where he is going.", 
        "intTime": 20090407, 
        "postID": 37, 
        "quote": "", 
        "reply": "I stand by my President. He can always go next year or the year after. Like he said to that kid the other day, being President is like steering a super tanker. One makes small, steady turns but in the end he gets to where he is going.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 20:07:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I stand by my President. He can always go next year or the year after. Like he said to that kid the other day, being President is like steering a super tanker. One makes small, steady turns but in the end he gets to where he is going. How profound.", 
        "intTime": 20090407, 
        "postID": 38, 
        "quote": "Originally posted by Duster6: I stand by my President. He can always go next year or the year after. Like he said to that kid the other day, being President is like steering a super tanker. One makes small, steady turns but in the end he gets to where he is going.", 
        "reply": " How profound.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 20:12:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "badmac933"
    }, 
    {
        "content": "Better a US President avoid a trip full of logistical challenges than come off as a shrub like the last idiot...", 
        "intTime": 20090407, 
        "postID": 39, 
        "quote": "", 
        "reply": "Better a US President avoid a trip full of logistical challenges than come off as a shrub like the last idiot...", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 20:12:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Migbuster: I think He does not understand The history of WW2 and NORMANDY...JMHO. Based on what?", 
        "intTime": 20090407, 
        "postID": 40, 
        "quote": "Originally posted by Migbuster: I think He does not understand The history of WW2 and NORMANDY...JMHO.", 
        "reply": " Based on what?", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 20:39:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Brilliant! 'http://www.telegraph.co.uk/news/worldnews/northamerica/usa/barackobama/5096803/Barack-Obama-rejects-Normandy-trip-to-avoid-offending-Germany.html' quote: White House officials travelled to France at the start of March to discuss a visit by Mr Obama to Omaha Beach, the site of the American Cemetery, established in 1944 just after D-Day and where 9,387 American personnel are buried. Among them is Theodore Roosevelt Jr the eldest son of the 26th US President. French officials and senior American military officers walked with White House staff through the cemetery discussing how the two presidents might follow the same route. But even before their trip, the White House had decided that Mr Obama would not travel there this week. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\". A White House spokesman in London declined to comment. Last month, White House officials briefed that a Normandy visit had been considered but it had not been logistically possible. Mr Obama will arrive in Strasbourg on Friday for the Nato summit. He will hold a meeting with Mr Sarkozy and a brief press appearance in Strasbourg and then fly to Baden-Baden to do exactly the same with Chancellor Merkel of Germany. He will then fly to Prague on Saturday.", 
        "intTime": 20090407, 
        "postID": 41, 
        "quote": "White House officials travelled to France at the start of March to discuss a visit by Mr Obama to Omaha Beach, the site of the American Cemetery, established in 1944 just after D-Day and where 9,387 American personnel are buried. Among them is Theodore Roosevelt Jr the eldest son of the 26th US President. French officials and senior American military officers walked with White House staff through the cemetery discussing how the two presidents might follow the same route. But even before their trip, the White House had decided that Mr Obama would not travel there this week. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\". A White House spokesman in London declined to comment. Last month, White House officials briefed that a Normandy visit had been considered but it had not been logistically possible. Mr Obama will arrive in Strasbourg on Friday for the Nato summit. He will hold a meeting with Mr Sarkozy and a brief press appearance in Strasbourg and then fly to Baden-Baden to do exactly the same with Chancellor Merkel of Germany. He will then fly to Prague on Saturday.", 
        "reply": "Brilliant! 'http://www.telegraph.co.uk/news/worldnews/northamerica/usa/barackobama/5096803/Barack-Obama-rejects-Normandy-trip-to-avoid-offending-Germany.html' ", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:26:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I think you're twisting this a bit, Gunny... \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda...During this trip, we wanted to maintain a balance between the British, German and France\". It appears that the French wanted to use the cemetery for Sarkozy's purposes, but the Americans said no. It looked to me as though Obama was conscious about giving everyone equal time during the period of the NATO Summit and didn't want to appear to favor one nation over the other. Where did you see the sensitivity toward the Germans?", 
        "intTime": 20090407, 
        "postID": 42, 
        "quote": "", 
        "reply": "I think you're twisting this a bit, Gunny... \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda...During this trip, we wanted to maintain a balance between the British, German and France\". It appears that the French wanted to use the cemetery for Sarkozy's purposes, but the Americans said no. It looked to me as though Obama was conscious about giving everyone equal time during the period of the NATO Summit and didn't want to appear to favor one nation over the other. Where did you see the sensitivity toward the Germans?", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:46:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090407, 
        "postID": 43, 
        "quote": "Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda.", 
        "reply": " How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:48:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead.", 
        "intTime": 20090407, 
        "postID": 44, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part.", 
        "reply": " Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:51:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090407, 
        "postID": 45, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead.", 
        "reply": " He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:53:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited.", 
        "intTime": 20090407, 
        "postID": 46, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them.", 
        "reply": " I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 13:00:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "If he went people would be screaming about it being a photo op, if he doesn't go people get upset about that.", 
        "intTime": 20090407, 
        "postID": 47, 
        "quote": "", 
        "reply": "If he went people would be screaming about it being a photo op, if he doesn't go people get upset about that.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 13:06:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\" So I guess you missed reading that part. Maybe I should of said bowing to the Germans and the British? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090407, 
        "postID": 48, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited.", 
        "reply": " \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\" So I guess you missed reading that part. Maybe I should of said bowing to the Germans and the British? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 13:19:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Anbar7"
    }, 
    {
        "content": "I think he need to take a course in History 101, me thinks.....", 
        "intTime": 20090407, 
        "postID": 49, 
        "quote": "", 
        "reply": "I think he need to take a course in History 101, me thinks.....", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 18:46:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\" So I guess you missed reading that part. Maybe I should of said bowing to the Germans and the British? I read the entire article. Again, it seems as though he may have been trying not to give the impression of playing favorites by taking more time with one over the other. Also, keep in mind that his visit to England was not connected to the NATO Summit in Strasbourg; it was part of the G20.", 
        "intTime": 20090407, 
        "postID": 50, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\" So I guess you missed reading that part. Maybe I should of said bowing to the Germans and the British?", 
        "reply": " I read the entire article. Again, it seems as though he may have been trying not to give the impression of playing favorites by taking more time with one over the other. Also, keep in mind that his visit to England was not connected to the NATO Summit in Strasbourg; it was part of the G20.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 18:51:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Migbuster: I think he need to take a course in History 101, me thinks..... Care to elaborate on that?", 
        "intTime": 20090407, 
        "postID": 51, 
        "quote": "Originally posted by Migbuster: I think he need to take a course in History 101, me thinks.....", 
        "reply": " Care to elaborate on that?", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 18:52:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "I think He does not understand The history of WW2 and NORMANDY...JMHO.", 
        "intTime": 20090407, 
        "postID": 52, 
        "quote": "", 
        "reply": "I think He does not understand The history of WW2 and NORMANDY...JMHO.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 18:57:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Migbuster"
    }, 
    {
        "content": "Skipping a visit to the Normandy WW2 burials of AMERICAN soldiers is a slap in the face. What was he thinking? And don't re write what his official appologist told you to write.", 
        "intTime": 20090407, 
        "postID": 53, 
        "quote": "", 
        "reply": "Skipping a visit to the Normandy WW2 burials of AMERICAN soldiers is a slap in the face. What was he thinking? And don't re write what his official appologist told you to write.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 19:15:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "peter3_1"
    }, 
    {
        "content": "Pictured above, R-wingers twist the news.", 
        "intTime": 20090407, 
        "postID": 54, 
        "quote": "", 
        "reply": "Pictured above, R-wingers twist the news.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 19:35:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Skipping a visit to the Normandy WW2 burials of AMERICAN soldiers is a slap in the face. What was he thinking? And don't re write what his official appologist told you to write. How exactly is it a slap in the face? He took the time to visit troops in Iraq, he has been to Arlington, and has shown a lot of concern for the military. He can't go to everything he is asked to appear for, and I would bet he will be in Normandy in June for the 65th anniversary.", 
        "intTime": 20090407, 
        "postID": 55, 
        "quote": "Originally posted by peter3_1: Skipping a visit to the Normandy WW2 burials of AMERICAN soldiers is a slap in the face. What was he thinking? And don't re write what his official appologist told you to write.", 
        "reply": " How exactly is it a slap in the face? He took the time to visit troops in Iraq, he has been to Arlington, and has shown a lot of concern for the military. He can't go to everything he is asked to appear for, and I would bet he will be in Normandy in June for the 65th anniversary.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 19:41:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Obama cancelled his trip to Normandy beach 'cause his staff forgot to plant stones for him to make a cross with.", 
        "intTime": 20090407, 
        "postID": 56, 
        "quote": "", 
        "reply": "Obama cancelled his trip to Normandy beach 'cause his staff forgot to plant stones for him to make a cross with.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 19:47:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "badmac933"
    }, 
    {
        "content": "I stand by my President. He can always go next year or the year after. Like he said to that kid the other day, being President is like steering a super tanker. One makes small, steady turns but in the end he gets to where he is going.", 
        "intTime": 20090407, 
        "postID": 57, 
        "quote": "", 
        "reply": "I stand by my President. He can always go next year or the year after. Like he said to that kid the other day, being President is like steering a super tanker. One makes small, steady turns but in the end he gets to where he is going.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 20:07:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I stand by my President. He can always go next year or the year after. Like he said to that kid the other day, being President is like steering a super tanker. One makes small, steady turns but in the end he gets to where he is going. How profound.", 
        "intTime": 20090407, 
        "postID": 58, 
        "quote": "Originally posted by Duster6: I stand by my President. He can always go next year or the year after. Like he said to that kid the other day, being President is like steering a super tanker. One makes small, steady turns but in the end he gets to where he is going.", 
        "reply": " How profound.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 20:12:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "badmac933"
    }, 
    {
        "content": "Better a US President avoid a trip full of logistical challenges than come off as a shrub like the last idiot...", 
        "intTime": 20090407, 
        "postID": 59, 
        "quote": "", 
        "reply": "Better a US President avoid a trip full of logistical challenges than come off as a shrub like the last idiot...", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 20:12:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Migbuster: I think He does not understand The history of WW2 and NORMANDY...JMHO. Based on what?", 
        "intTime": 20090407, 
        "postID": 60, 
        "quote": "Originally posted by Migbuster: I think He does not understand The history of WW2 and NORMANDY...JMHO.", 
        "reply": " Based on what?", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 20:39:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Brilliant! 'http://www.telegraph.co.uk/news/worldnews/northamerica/usa/barackobama/5096803/Barack-Obama-rejects-Normandy-trip-to-avoid-offending-Germany.html' quote: White House officials travelled to France at the start of March to discuss a visit by Mr Obama to Omaha Beach, the site of the American Cemetery, established in 1944 just after D-Day and where 9,387 American personnel are buried. Among them is Theodore Roosevelt Jr the eldest son of the 26th US President. French officials and senior American military officers walked with White House staff through the cemetery discussing how the two presidents might follow the same route. But even before their trip, the White House had decided that Mr Obama would not travel there this week. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\". A White House spokesman in London declined to comment. Last month, White House officials briefed that a Normandy visit had been considered but it had not been logistically possible. Mr Obama will arrive in Strasbourg on Friday for the Nato summit. He will hold a meeting with Mr Sarkozy and a brief press appearance in Strasbourg and then fly to Baden-Baden to do exactly the same with Chancellor Merkel of Germany. He will then fly to Prague on Saturday.", 
        "intTime": 20090407, 
        "postID": 61, 
        "quote": "White House officials travelled to France at the start of March to discuss a visit by Mr Obama to Omaha Beach, the site of the American Cemetery, established in 1944 just after D-Day and where 9,387 American personnel are buried. Among them is Theodore Roosevelt Jr the eldest son of the 26th US President. French officials and senior American military officers walked with White House staff through the cemetery discussing how the two presidents might follow the same route. But even before their trip, the White House had decided that Mr Obama would not travel there this week. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\". A White House spokesman in London declined to comment. Last month, White House officials briefed that a Normandy visit had been considered but it had not been logistically possible. Mr Obama will arrive in Strasbourg on Friday for the Nato summit. He will hold a meeting with Mr Sarkozy and a brief press appearance in Strasbourg and then fly to Baden-Baden to do exactly the same with Chancellor Merkel of Germany. He will then fly to Prague on Saturday.", 
        "reply": "Brilliant! 'http://www.telegraph.co.uk/news/worldnews/northamerica/usa/barackobama/5096803/Barack-Obama-rejects-Normandy-trip-to-avoid-offending-Germany.html' ", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:26:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "I think you're twisting this a bit, Gunny... \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda...During this trip, we wanted to maintain a balance between the British, German and France\". It appears that the French wanted to use the cemetery for Sarkozy's purposes, but the Americans said no. It looked to me as though Obama was conscious about giving everyone equal time during the period of the NATO Summit and didn't want to appear to favor one nation over the other. Where did you see the sensitivity toward the Germans?", 
        "intTime": 20090407, 
        "postID": 62, 
        "quote": "", 
        "reply": "I think you're twisting this a bit, Gunny... \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda...During this trip, we wanted to maintain a balance between the British, German and France\". It appears that the French wanted to use the cemetery for Sarkozy's purposes, but the Americans said no. It looked to me as though Obama was conscious about giving everyone equal time during the period of the NATO Summit and didn't want to appear to favor one nation over the other. Where did you see the sensitivity toward the Germans?", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:46:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090407, 
        "postID": 63, 
        "quote": "Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda.", 
        "reply": " How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:48:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead.", 
        "intTime": 20090407, 
        "postID": 64, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part.", 
        "reply": " Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:51:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090407, 
        "postID": 65, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead.", 
        "reply": " He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 12:53:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited.", 
        "intTime": 20090407, 
        "postID": 66, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them.", 
        "reply": " I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 13:00:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "If he went people would be screaming about it being a photo op, if he doesn't go people get upset about that.", 
        "intTime": 20090407, 
        "postID": 67, 
        "quote": "", 
        "reply": "If he went people would be screaming about it being a photo op, if he doesn't go people get upset about that.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 13:06:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\" So I guess you missed reading that part. Maybe I should of said bowing to the Germans and the British? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090407, 
        "postID": 68, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited.", 
        "reply": " \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\" So I guess you missed reading that part. Maybe I should of said bowing to the Germans and the British? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 13:19:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Anbar7"
    }, 
    {
        "content": "I think he need to take a course in History 101, me thinks.....", 
        "intTime": 20090407, 
        "postID": 69, 
        "quote": "", 
        "reply": "I think he need to take a course in History 101, me thinks.....", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 18:46:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Migbuster"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\" So I guess you missed reading that part. Maybe I should of said bowing to the Germans and the British? I read the entire article. Again, it seems as though he may have been trying not to give the impression of playing favorites by taking more time with one over the other. Also, keep in mind that his visit to England was not connected to the NATO Summit in Strasbourg; it was part of the G20.", 
        "intTime": 20090407, 
        "postID": 70, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by mcgreer: quote: Originally posted by Anbar7: quote: Originally posted by GunnyRet03: \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. How ignorant is he. Special treatment to France? He would be visiting an American Cemetery and that is special treatment. That is just stupid on Obama's administration part. Again - it wouldn't have been a matter of Obama \"visiting\" the cemetery; it was more a photo op for the French president. The French asked if he could walk the cemetery grounds with Sarkozy. So, how would you have felt if the President would have allowed himself to be used in such a manner? Don't worry - June's only a couple of months off. I suspect that Obama will be in Normandy for the D-Day commemoration. Then, he'll be going in memory of our war dead. He could still go, but not walk with the Pres. Hey, if he goes in June then good on him, but this makes it sound like he is bowing to Germany cus he doesn't want to offend them. I missed the part where he was kowtowing to the Germans. Can you point that out to me? I know how the author of the article titled the story. You have to read the rest of the article. Some highlights: \"...Mr Sarkozy is said by French officials to be piqued that Gordon Brown became the first European leader to meet Mr Obama and was then lavished with praise by him at a 50-minute joint press conference in London on Wednesday. The French president tried unsuccessfully to meet Mr Obama before he was sworn in after the G20 summit in Washington last November, even stationing a French military plane on 24-hour standby nearby to whisk him to Chicago should the then US president-elect change his mind. He had also hoped Mr Obama would agree to a meeting before attending the G20 summit in London on April 3. The French had suggested that Mr Obama fly from London to Normandy on Friday morning for a stop before the Nato summit. Instead, he is going directly to Strasbourg....\" The article goes on to state that Sarkozy's senior aide said that Obama had agreed to come back in June; the White House will not confirm that (for obvious reasons). So, as you can see, Monsieur Sarkozy wants more of the President's time than he was willing to give. But I don't get the Germany piece...read the whole article. I guess if Sarkozy wants to split hairs: The UK often doesn't consider itself part of Europe. So, visiting Brown first would not have made Sarko the second European leader Obama visited. \"It wasn't going to happen,\" said an American official in Washington. \"We went through the motions to placate President Sarkozy but giving special treatment to France was not on our agenda. \"During this trip, we wanted to maintain a balance between the British, German and France\" So I guess you missed reading that part. Maybe I should of said bowing to the Germans and the British?", 
        "reply": " I read the entire article. Again, it seems as though he may have been trying not to give the impression of playing favorites by taking more time with one over the other. Also, keep in mind that his visit to England was not connected to the NATO Summit in Strasbourg; it was part of the G20.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 18:51:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Migbuster: I think he need to take a course in History 101, me thinks..... Care to elaborate on that?", 
        "intTime": 20090407, 
        "postID": 71, 
        "quote": "Originally posted by Migbuster: I think he need to take a course in History 101, me thinks.....", 
        "reply": " Care to elaborate on that?", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 18:52:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }, 
    {
        "content": "I think He does not understand The history of WW2 and NORMANDY...JMHO.", 
        "intTime": 20090407, 
        "postID": 72, 
        "quote": "", 
        "reply": "I think He does not understand The history of WW2 and NORMANDY...JMHO.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 18:57:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Migbuster"
    }, 
    {
        "content": "Skipping a visit to the Normandy WW2 burials of AMERICAN soldiers is a slap in the face. What was he thinking? And don't re write what his official appologist told you to write.", 
        "intTime": 20090407, 
        "postID": 73, 
        "quote": "", 
        "reply": "Skipping a visit to the Normandy WW2 burials of AMERICAN soldiers is a slap in the face. What was he thinking? And don't re write what his official appologist told you to write.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 19:15:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "peter3_1"
    }, 
    {
        "content": "Pictured above, R-wingers twist the news.", 
        "intTime": 20090407, 
        "postID": 74, 
        "quote": "", 
        "reply": "Pictured above, R-wingers twist the news.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 19:35:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Skipping a visit to the Normandy WW2 burials of AMERICAN soldiers is a slap in the face. What was he thinking? And don't re write what his official appologist told you to write. How exactly is it a slap in the face? He took the time to visit troops in Iraq, he has been to Arlington, and has shown a lot of concern for the military. He can't go to everything he is asked to appear for, and I would bet he will be in Normandy in June for the 65th anniversary.", 
        "intTime": 20090407, 
        "postID": 75, 
        "quote": "Originally posted by peter3_1: Skipping a visit to the Normandy WW2 burials of AMERICAN soldiers is a slap in the face. What was he thinking? And don't re write what his official appologist told you to write.", 
        "reply": " How exactly is it a slap in the face? He took the time to visit troops in Iraq, he has been to Arlington, and has shown a lot of concern for the military. He can't go to everything he is asked to appear for, and I would bet he will be in Normandy in June for the 65th anniversary.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 19:41:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Obama cancelled his trip to Normandy beach 'cause his staff forgot to plant stones for him to make a cross with.", 
        "intTime": 20090407, 
        "postID": 76, 
        "quote": "", 
        "reply": "Obama cancelled his trip to Normandy beach 'cause his staff forgot to plant stones for him to make a cross with.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 19:47:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "badmac933"
    }, 
    {
        "content": "I stand by my President. He can always go next year or the year after. Like he said to that kid the other day, being President is like steering a super tanker. One makes small, steady turns but in the end he gets to where he is going.", 
        "intTime": 20090407, 
        "postID": 77, 
        "quote": "", 
        "reply": "I stand by my President. He can always go next year or the year after. Like he said to that kid the other day, being President is like steering a super tanker. One makes small, steady turns but in the end he gets to where he is going.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 20:07:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I stand by my President. He can always go next year or the year after. Like he said to that kid the other day, being President is like steering a super tanker. One makes small, steady turns but in the end he gets to where he is going. How profound.", 
        "intTime": 20090407, 
        "postID": 78, 
        "quote": "Originally posted by Duster6: I stand by my President. He can always go next year or the year after. Like he said to that kid the other day, being President is like steering a super tanker. One makes small, steady turns but in the end he gets to where he is going.", 
        "reply": " How profound.", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 20:12:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "badmac933"
    }, 
    {
        "content": "Better a US President avoid a trip full of logistical challenges than come off as a shrub like the last idiot...", 
        "intTime": 20090407, 
        "postID": 79, 
        "quote": "", 
        "reply": "Better a US President avoid a trip full of logistical challenges than come off as a shrub like the last idiot...", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 20:12:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Migbuster: I think He does not understand The history of WW2 and NORMANDY...JMHO. Based on what?", 
        "intTime": 20090407, 
        "postID": 80, 
        "quote": "Originally posted by Migbuster: I think He does not understand The history of WW2 and NORMANDY...JMHO.", 
        "reply": " Based on what?", 
        "threadID": "672198221_5860080022001", 
        "time": "2009-04-07 20:39:00", 
        "title": "Barack Obama rejects Normandy trip to avoid offending Germany", 
        "userID": "mcgreer"
    }
]