[
    {
        "content": "GITMO TERRORIST DETAINEES Why are people so worried as to what will happen and where to terrorists in GITMO will go after we shut it down, when to solution is so simple. The Liberal Elite Democrats, from Hollywood to Wall Street to Main Street, along with the Elite Liberal media personalities and politicians, all have extra homes and some huge mansions that sit empty most of the time, so the solution is that we place ankle bracelets on the terrorists, and place then under house arrest, using the homes of all the Elite Liberals Democrats that feel that GITMO should be closed because the terrorists are not properly detained. Chris Mathews from MSNBC Hardball has a big mouth and always has something to say about GITMO, and how it should be shut down, so I am sure he would not mind having a fellow Elite Liberal Terrorist in his home for house arrest. WAKE UP PEOPLE!!! Think about the consequences when GITMO gets shut down. When these Muslim Terrorists hit the United States again it will be ten times more destructive and deadly than September 11, 2001. Is that what you want? Your son, your daughter, your wife or husband could be the next victim at the hands of these savages that have no regard for human life. Their only concern is to kill infidels, anyone non-Muslim, while blowing themselves up in order to go to ALLAH and get 72 virgins. WAKE UP AND SMELL THE COFFEE AMERICA!", 
        "intTime": 20090520, 
        "postID": 1, 
        "quote": "", 
        "reply": "GITMO TERRORIST DETAINEES Why are people so worried as to what will happen and where to terrorists in GITMO will go after we shut it down, when to solution is so simple. The Liberal Elite Democrats, from Hollywood to Wall Street to Main Street, along with the Elite Liberal media personalities and politicians, all have extra homes and some huge mansions that sit empty most of the time, so the solution is that we place ankle bracelets on the terrorists, and place then under house arrest, using the homes of all the Elite Liberals Democrats that feel that GITMO should be closed because the terrorists are not properly detained. Chris Mathews from MSNBC Hardball has a big mouth and always has something to say about GITMO, and how it should be shut down, so I am sure he would not mind having a fellow Elite Liberal Terrorist in his home for house arrest. WAKE UP PEOPLE!!! Think about the consequences when GITMO gets shut down. When these Muslim Terrorists hit the United States again it will be ten times more destructive and deadly than September 11, 2001. Is that what you want? Your son, your daughter, your wife or husband could be the next victim at the hands of these savages that have no regard for human life. Their only concern is to kill infidels, anyone non-Muslim, while blowing themselves up in order to go to ALLAH and get 72 virgins. WAKE UP AND SMELL THE COFFEE AMERICA!", 
        "threadID": "672198221_2710028322001", 
        "time": "2009-05-20 18:44:00", 
        "title": "GITMO DETAINEES", 
        "userID": "seretisnotes"
    }, 
    {
        "content": "quote: Why are people so worried as to what will happen and where to terrorists in GITMO will go after we shut it down, when to solution is so simple. They ain't it just turned in to a big political weapon for Reps VS Dems with the Rep Talking Heads mustering controversy, fear and provocation against Omaba and the Dems because they are still crying they lost. It's politics man and people either play the game or really believe the BS coming from these people. No free nation and specially not this country should ever give up what freedom we have left over fear. If we do, what's the point? The Reps couldn't properly handle a situation so they are doing what they can to ensure Obama does not either, even if it is just a perception which is what all this is really about. They should be more afraid and concerned about the mexican drug war and the gangs in this country over these idiots. That itself proves it's just partisan bashing and nothing else. Your sounding like them too. The best thing the government can do for us is protect our borders, do intel, stop it when they can and let law biding American Citizens protect themselves. This BS of we better stand in line and wait for our turn to get a bullet in the back of our head has to stop.", 
        "intTime": 20090520, 
        "postID": 2, 
        "quote": "Why are people so worried as to what will happen and where to terrorists in GITMO will go after we shut it down, when to solution is so simple.", 
        "reply": " They ain't it just turned in to a big political weapon for Reps VS Dems with the Rep Talking Heads mustering controversy, fear and provocation against Omaba and the Dems because they are still crying they lost. It's politics man and people either play the game or really believe the BS coming from these people. No free nation and specially not this country should ever give up what freedom we have left over fear. If we do, what's the point? The Reps couldn't properly handle a situation so they are doing what they can to ensure Obama does not either, even if it is just a perception which is what all this is really about. They should be more afraid and concerned about the mexican drug war and the gangs in this country over these idiots. That itself proves it's just partisan bashing and nothing else. Your sounding like them too. The best thing the government can do for us is protect our borders, do intel, stop it when they can and let law biding American Citizens protect themselves. This BS of we better stand in line and wait for our turn to get a bullet in the back of our head has to stop.", 
        "threadID": "672198221_2710028322001", 
        "time": "2009-05-20 19:00:00", 
        "title": "GITMO DETAINEES", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I think it is pretty funny the Dems shot Gitmo down today and wont support Obama wanting to bring them here. What is it they say \"not in my back yard\" I can hear it now... to the Dems... ... OK, you want to bring them here? Then they have to go to your state . lol Obama who???? LOL", 
        "intTime": 20090520, 
        "postID": 3, 
        "quote": "", 
        "reply": "I think it is pretty funny the Dems shot Gitmo down today and wont support Obama wanting to bring them here. What is it they say \"not in my back yard\" I can hear it now... to the Dems... ... OK, you want to bring them here? Then they have to go to your state . lol Obama who???? LOL", 
        "threadID": "672198221_2710028322001", 
        "time": "2009-05-20 19:12:00", 
        "title": "GITMO DETAINEES", 
        "userID": "usa_girl"
    }, 
    {
        "content": "Anyone who goes around saying that President Obama is going to release terrorist on to American soil and give them welfare is lying.", 
        "intTime": 20090520, 
        "postID": 4, 
        "quote": "", 
        "reply": "Anyone who goes around saying that President Obama is going to release terrorist on to American soil and give them welfare is lying.", 
        "threadID": "672198221_2710028322001", 
        "time": "2009-05-20 22:59:00", 
        "title": "GITMO DETAINEES", 
        "userID": "xerello"
    }, 
    {
        "content": "\"The World's Finest\"", 
        "intTime": 20090521, 
        "postID": 5, 
        "quote": "", 
        "reply": "\"The World's Finest\"", 
        "threadID": "672198221_2710028322001", 
        "time": "2009-05-21 03:45:00", 
        "title": "GITMO DETAINEES", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: This is an excellent plan too....these guys use to say Bush had no plan Already past the future", 
        "intTime": 20090521, 
        "postID": 6, 
        "quote": "Originally posted by Kegler300:", 
        "reply": " This is an excellent plan too....these guys use to say Bush had no plan Already past the future", 
        "threadID": "672198221_2710028322001", 
        "time": "2009-05-21 04:16:00", 
        "title": "GITMO DETAINEES", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: I think it is pretty funny the Dems shot Gitmo down today and wont support Obama wanting to bring them here. What is it they say \"not in my back yard\" I can hear it now... to the Dems... ... OK, you want to bring them here? Then they have to go to your state . lol Obama who???? LOL Already past the future", 
        "intTime": 20090521, 
        "postID": 7, 
        "quote": "Originally posted by usa_girl: I think it is pretty funny the Dems shot Gitmo down today and wont support Obama wanting to bring them here. What is it they say \"not in my back yard\" I can hear it now... to the Dems... ... OK, you want to bring them here? Then they have to go to your state . lol Obama who???? LOL", 
        "reply": " Already past the future", 
        "threadID": "672198221_2710028322001", 
        "time": "2009-05-21 04:17:00", 
        "title": "GITMO DETAINEES", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by seretisnotes: GITMO TERRORIST DETAINEES Why are people so worried as to what will happen and where to terrorists in GITMO will go after we shut it down, when to solution is so simple. The Liberal Elite Democrats, from Hollywood to Wall Street to Main Street, along with the Elite Liberal media personalities and politicians, all have extra homes and some huge mansions that sit empty most of the time, so the solution is that we place ankle bracelets on the terrorists, and place then under house arrest, using the homes of all the Elite Liberals Democrats that feel that GITMO should be closed because the terrorists are not properly detained. Chris Mathews from MSNBC Hardball has a big mouth and always has something to say about GITMO, and how it should be shut down, so I am sure he would not mind having a fellow Elite Liberal Terrorist in his home for house arrest. WAKE UP PEOPLE!!! Think about the consequences when GITMO gets shut down. When these Muslim Terrorists hit the United States again it will be ten times more destructive and deadly than September 11, 2001. Is that what you want? Your son, your daughter, your wife or husband could be the next victim at the hands of these savages that have no regard for human life. Their only concern is to kill infidels, anyone non-Muslim, while blowing themselves up in order to go to ALLAH and get 72 virgins. WAKE UP AND SMELL THE COFFEE AMERICA! Nice job of fear mongering! Rush would be proud. You elevate this swill of human society to the level of \"super villain\", how pathetic. We've dealt with mass murders, child rapists, cannibals and all forms of scum for lots of years. What exactly makes these people more dangerous than some of the people we have nicely locked away? Your imagination maybe?", 
        "intTime": 20090521, 
        "postID": 8, 
        "quote": "Originally posted by seretisnotes: GITMO TERRORIST DETAINEES Why are people so worried as to what will happen and where to terrorists in GITMO will go after we shut it down, when to solution is so simple. The Liberal Elite Democrats, from Hollywood to Wall Street to Main Street, along with the Elite Liberal media personalities and politicians, all have extra homes and some huge mansions that sit empty most of the time, so the solution is that we place ankle bracelets on the terrorists, and place then under house arrest, using the homes of all the Elite Liberals Democrats that feel that GITMO should be closed because the terrorists are not properly detained. Chris Mathews from MSNBC Hardball has a big mouth and always has something to say about GITMO, and how it should be shut down, so I am sure he would not mind having a fellow Elite Liberal Terrorist in his home for house arrest. WAKE UP PEOPLE!!! Think about the consequences when GITMO gets shut down. When these Muslim Terrorists hit the United States again it will be ten times more destructive and deadly than September 11, 2001. Is that what you want? Your son, your daughter, your wife or husband could be the next victim at the hands of these savages that have no regard for human life. Their only concern is to kill infidels, anyone non-Muslim, while blowing themselves up in order to go to ALLAH and get 72 virgins. WAKE UP AND SMELL THE COFFEE AMERICA!", 
        "reply": " Nice job of fear mongering! Rush would be proud. You elevate this swill of human society to the level of \"super villain\", how pathetic. We've dealt with mass murders, child rapists, cannibals and all forms of scum for lots of years. What exactly makes these people more dangerous than some of the people we have nicely locked away? Your imagination maybe?", 
        "threadID": "672198221_2710028322001", 
        "time": "2009-05-21 07:04:00", 
        "title": "GITMO DETAINEES", 
        "userID": "Ol_Doc"
    }
]