[
    {
        "content": "\" George W. Bush's Justice Department said subjecting a person to the near drowning of waterboarding was not a crime and didn't even cause pain, but Ronald Reagan's Justice Department thought otherwise, prosecuting a Texas sheriff and three deputies for using the practice to get confessions.\" \"http://www.truthout.org/042709J\"", 
        "intTime": 20090429, 
        "postID": 1, 
        "quote": "", 
        "reply": "\" George W. Bush's Justice Department said subjecting a person to the near drowning of waterboarding was not a crime and didn't even cause pain, but Ronald Reagan's Justice Department thought otherwise, prosecuting a Texas sheriff and three deputies for using the practice to get confessions.\" \"http://www.truthout.org/042709J\"", 
        "threadID": "672198221_6120001222001", 
        "time": "2009-04-29 14:50:00", 
        "title": "Reagan's DOJ Prosecuted Texas Sheriff for Waterboarding Prisoners", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \" George W. Bush's Justice Department said subjecting a person to the near drowning of waterboarding was not a crime and didn't even cause pain, but Ronald Reagan's Justice Department thought otherwise, prosecuting a Texas sheriff and three deputies for using the practice to get confessions.\" \"http://www.truthout.org/042709J\" Right. We as Americans are supposed to be better than this. What a lot of people are doing is \"disappearing\" the past. How many times on this subject have people on this forum said, \"Show me where it is illegal to torture!\" As if we hadn't had war crimes trials for the Japanese or the Germans (not that they waterboarded). It is as if Stalinism had replaced the American Spirit. It is as if people just want to not think at all. \"Bush is strong, Cheney is strong. That is all I need to know.\" Well, Stalin was strong too, and that is why a lot of Russians still revere him. They don't have the examples of our patriot fathers to illumine their path. What Sam Adams said applies to them: If ye love wealth better than liberty, the tranquility of servitude than the animated contest of freedom, go from us in peace. We ask not your counsels or arms. Crouch down and lick the hands which feed you. May your chains sit lightly upon you, and may posterity forget that you were our countrymen!” And there are a LOT of people like that on this forum. Walt", 
        "intTime": 20090429, 
        "postID": 2, 
        "quote": "Originally posted by crackerjacks61: \" George W. Bush's Justice Department said subjecting a person to the near drowning of waterboarding was not a crime and didn't even cause pain, but Ronald Reagan's Justice Department thought otherwise, prosecuting a Texas sheriff and three deputies for using the practice to get confessions.\" \"http://www.truthout.org/042709J\"", 
        "reply": " Right. We as Americans are supposed to be better than this. What a lot of people are doing is \"disappearing\" the past. How many times on this subject have people on this forum said, \"Show me where it is illegal to torture!\" As if we hadn't had war crimes trials for the Japanese or the Germans (not that they waterboarded). It is as if Stalinism had replaced the American Spirit. It is as if people just want to not think at all. \"Bush is strong, Cheney is strong. That is all I need to know.\" Well, Stalin was strong too, and that is why a lot of Russians still revere him. They don't have the examples of our patriot fathers to illumine their path. What Sam Adams said applies to them: If ye love wealth better than liberty, the tranquility of servitude than the animated contest of freedom, go from us in peace. We ask not your counsels or arms. Crouch down and lick the hands which feed you. May your chains sit lightly upon you, and may posterity forget that you were our countrymen!” And there are a LOT of people like that on this forum. Walt", 
        "threadID": "672198221_6120001222001", 
        "time": "2009-04-29 15:23:00", 
        "title": "Reagan's DOJ Prosecuted Texas Sheriff for Waterboarding Prisoners", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "kick that dead horse in the arss he aint that dead.", 
        "intTime": 20090429, 
        "postID": 3, 
        "quote": "", 
        "reply": "kick that dead horse in the arss he aint that dead.", 
        "threadID": "672198221_6120001222001", 
        "time": "2009-04-29 15:45:00", 
        "title": "Reagan's DOJ Prosecuted Texas Sheriff for Waterboarding Prisoners", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "\"Cases of waterboarding have occurred on U.S. soil, as well. In 1983, Texas Sheriff James Parker was charged, along with three of his deputies, for handcuffing prisoners to chairs, placing towels over their faces, and pouring water on the cloth until they gave what the officers considered to be confessions. The sheriff and his deputies were all convicted and sentenced to four years in prison\". \"http://www.npr.org/templates/story/story.php?storyId=15886834 Federal court due to the Civil Rights violation and a Sheriff of the county demands non-prejudice court/judge , nothing about waterboarding. Could have been a good ole fashion kick in the groin. Four years is a far cry from ten that truthout tried to scam on us. Doubt if Reagan or anyone outside of the county knew what was happening.", 
        "intTime": 20090429, 
        "postID": 4, 
        "quote": "", 
        "reply": "\"Cases of waterboarding have occurred on U.S. soil, as well. In 1983, Texas Sheriff James Parker was charged, along with three of his deputies, for handcuffing prisoners to chairs, placing towels over their faces, and pouring water on the cloth until they gave what the officers considered to be confessions. The sheriff and his deputies were all convicted and sentenced to four years in prison\". \"http://www.npr.org/templates/story/story.php?storyId=15886834 Federal court due to the Civil Rights violation and a Sheriff of the county demands non-prejudice court/judge , nothing about waterboarding. Could have been a good ole fashion kick in the groin. Four years is a far cry from ten that truthout tried to scam on us. Doubt if Reagan or anyone outside of the county knew what was happening.", 
        "threadID": "672198221_6120001222001", 
        "time": "2009-04-29 18:43:00", 
        "title": "Reagan's DOJ Prosecuted Texas Sheriff for Waterboarding Prisoners", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: \"Cases of waterboarding have occurred on U.S. soil, as well. In 1983, Texas Sheriff James Parker was charged, along with three of his deputies, for handcuffing prisoners to chairs, placing towels over their faces, and pouring water on the cloth until they gave what the officers considered to be confessions. The sheriff and his deputies were all convicted and sentenced to four years in prison\". \"http://www.npr.org/templates/story/story.php?storyId=15886834 Federal court due to the Civil Rights violation and a Sheriff of the county demands non-prejudice court/judge , nothing about waterboarding. Could have been a good ole fashion kick in the groin. Four years is a far cry from ten that truthout tried to scam on us. Doubt if Reagan or anyone outside of the county knew what was happening. Lawyers for those waterboarded on Bush's order can make those same arguments. But you missed the point any way. Judge Bybee in his memo said the situation had never come up before when 3 clicks on Google would have shown it had. Thanks for bumping the thread. It is an important issue. Walt", 
        "intTime": 20090429, 
        "postID": 5, 
        "quote": "Originally posted by rayevinsonsr: \"Cases of waterboarding have occurred on U.S. soil, as well. In 1983, Texas Sheriff James Parker was charged, along with three of his deputies, for handcuffing prisoners to chairs, placing towels over their faces, and pouring water on the cloth until they gave what the officers considered to be confessions. The sheriff and his deputies were all convicted and sentenced to four years in prison\". \"http://www.npr.org/templates/story/story.php?storyId=15886834 Federal court due to the Civil Rights violation and a Sheriff of the county demands non-prejudice court/judge , nothing about waterboarding. Could have been a good ole fashion kick in the groin. Four years is a far cry from ten that truthout tried to scam on us. Doubt if Reagan or anyone outside of the county knew what was happening.", 
        "reply": " Lawyers for those waterboarded on Bush's order can make those same arguments. But you missed the point any way. Judge Bybee in his memo said the situation had never come up before when 3 clicks on Google would have shown it had. Thanks for bumping the thread. It is an important issue. Walt", 
        "threadID": "672198221_6120001222001", 
        "time": "2009-04-29 19:14:00", 
        "title": "Reagan's DOJ Prosecuted Texas Sheriff for Waterboarding Prisoners", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by rayevinsonsr: \"Cases of waterboarding have occurred on U.S. soil, as well. In 1983, Texas Sheriff James Parker was charged, along with three of his deputies, for handcuffing prisoners to chairs, placing towels over their faces, and pouring water on the cloth until they gave what the officers considered to be confessions. The sheriff and his deputies were all convicted and sentenced to four years in prison\". \"http://www.npr.org/templates/story/story.php?storyId=15886834 Federal court due to the Civil Rights violation and a Sheriff of the county demands non-prejudice court/judge , nothing about waterboarding. Could have been a good ole fashion kick in the groin. Four years is a far cry from ten that truthout tried to scam on us. Doubt if Reagan or anyone outside of the county knew what was happening. Lawyers for those waterboarded on Bush's order can make those same arguments. But you missed the point any way. Judge Bybee in his memo said the situation had never come up before when 3 clicks on Google would have shown it had. Thanks for bumping the thread. It is an important issue. Walt It's funny that unless something is specifically named as being torture (and NOTHING actually is specifically named) then if we say it's not torture, therefore it isn't. How about the \"Bastinado?\" That's where you tie someone down and whack the soles of their feet. Done properly it leaves no marks. So if the Bush administration used it, and said thjis isn't torture, then by definition it isn't? Ray has his head in the sand on this one. He obviously believes in \"the power of the word.\" Someone said it ain't torture, therefore by definition it can't be torture. Which of couse means that everyone convicted in American Courts should have been pardoned by the President. Dave", 
        "intTime": 20090430, 
        "postID": 6, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by rayevinsonsr: \"Cases of waterboarding have occurred on U.S. soil, as well. In 1983, Texas Sheriff James Parker was charged, along with three of his deputies, for handcuffing prisoners to chairs, placing towels over their faces, and pouring water on the cloth until they gave what the officers considered to be confessions. The sheriff and his deputies were all convicted and sentenced to four years in prison\". \"http://www.npr.org/templates/story/story.php?storyId=15886834 Federal court due to the Civil Rights violation and a Sheriff of the county demands non-prejudice court/judge , nothing about waterboarding. Could have been a good ole fashion kick in the groin. Four years is a far cry from ten that truthout tried to scam on us. Doubt if Reagan or anyone outside of the county knew what was happening. Lawyers for those waterboarded on Bush's order can make those same arguments. But you missed the point any way. Judge Bybee in his memo said the situation had never come up before when 3 clicks on Google would have shown it had. Thanks for bumping the thread. It is an important issue. Walt", 
        "reply": " It's funny that unless something is specifically named as being torture (and NOTHING actually is specifically named) then if we say it's not torture, therefore it isn't. How about the \"Bastinado?\" That's where you tie someone down and whack the soles of their feet. Done properly it leaves no marks. So if the Bush administration used it, and said thjis isn't torture, then by definition it isn't? Ray has his head in the sand on this one. He obviously believes in \"the power of the word.\" Someone said it ain't torture, therefore by definition it can't be torture. Which of couse means that everyone convicted in American Courts should have been pardoned by the President. Dave", 
        "threadID": "672198221_6120001222001", 
        "time": "2009-04-30 10:45:00", 
        "title": "Reagan's DOJ Prosecuted Texas Sheriff for Waterboarding Prisoners", 
        "userID": "Grachus"
    }, 
    {
        "content": "Just a simple question, were they convicted of torture or coercing a confession? Would it be torture to inject someone with sodium amytal? It would absolutly be tossed out of court if the confession was obtained this way, and the interogator could be charged as well. I don't want to get into the waterboarding is torture or not. This thread is about waterboarding being a crime. The crime was coercing a confession, not the means. They should have been convicted of the same crime for using a phonebook to extract the confession.", 
        "intTime": 20090430, 
        "postID": 7, 
        "quote": "", 
        "reply": "Just a simple question, were they convicted of torture or coercing a confession? Would it be torture to inject someone with sodium amytal? It would absolutly be tossed out of court if the confession was obtained this way, and the interogator could be charged as well. I don't want to get into the waterboarding is torture or not. This thread is about waterboarding being a crime. The crime was coercing a confession, not the means. They should have been convicted of the same crime for using a phonebook to extract the confession.", 
        "threadID": "672198221_6120001222001", 
        "time": "2009-04-30 11:30:00", 
        "title": "Reagan's DOJ Prosecuted Texas Sheriff for Waterboarding Prisoners", 
        "userID": "sgt_posty"
    }, 
    {
        "content": "quote: Originally posted by sgt_posty: Just a simple question, were they convicted of torture or coercing a confession? Would it be torture to inject someone with sodium amytal? It would absolutly be tossed out of court if the confession was obtained this way, and the interogator could be charged as well. I don't want to get into the waterboarding is torture or not. This thread is about waterboarding being a crime. The crime was coercing a confession, not the means. They should have been convicted of the same crime for using a phonebook to extract the confession. Yes, and for the Office of Legal Counsel in the Executive Branch of our government to okay torture to get confessions throws them back to the Spanish Inquisition, because in this country, torture has always been a no-go. It is prohibited in the Bill of Rights too: \"Excessive bail shall not be required, nor excessive fines imposed, nor cruel and unusual punishments inflicted.\" These guys were -lawyers-, had taken oaths to uphold and defend the Constitution. They need to go to prison or words mean nothing. Walt", 
        "intTime": 20090430, 
        "postID": 8, 
        "quote": "Originally posted by sgt_posty: Just a simple question, were they convicted of torture or coercing a confession? Would it be torture to inject someone with sodium amytal? It would absolutly be tossed out of court if the confession was obtained this way, and the interogator could be charged as well. I don't want to get into the waterboarding is torture or not. This thread is about waterboarding being a crime. The crime was coercing a confession, not the means. They should have been convicted of the same crime for using a phonebook to extract the confession.", 
        "reply": " Yes, and for the Office of Legal Counsel in the Executive Branch of our government to okay torture to get confessions throws them back to the Spanish Inquisition, because in this country, torture has always been a no-go. It is prohibited in the Bill of Rights too: \"Excessive bail shall not be required, nor excessive fines imposed, nor cruel and unusual punishments inflicted.\" These guys were -lawyers-, had taken oaths to uphold and defend the Constitution. They need to go to prison or words mean nothing. Walt", 
        "threadID": "672198221_6120001222001", 
        "time": "2009-04-30 11:35:00", 
        "title": "Reagan's DOJ Prosecuted Texas Sheriff for Waterboarding Prisoners", 
        "userID": "WhiskeyPapa"
    }
]