[
    {
        "content": "\"The Obama's administration's leading plan to fix General Motors Corp. and Chrysler LLC would use bankruptcy filings to purge the ailing companies of their biggest problems, including bondholder debt and retiree health-care costs, according to people familiar with the matter.\" \"http://online.wsj.com/article/SB123841609048669495.html\"", 
        "intTime": 20090330, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"The Obama's administration's leading plan to fix General Motors Corp. and Chrysler LLC would use bankruptcy filings to purge the ailing companies of their biggest problems, including bondholder debt and retiree health-care costs, according to people familiar with the matter.\" \"http://online.wsj.com/article/SB123841609048669495.html\"", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 15:23:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "A different story from another source? (Quote)Obama said the companies and the government might have to consider \"using our bankruptcy code\" to help the companies restructure more efficiently. He said any such action would take place \"with the backing of the U.S. government.\" The Obama administration, however, has decided not to require the automakers to immediately repay government loan money they previously received, since that would force both companies into Chapter 11 bankruptcy. A senior administration official told FOX News, \"calling in the loans would not be a productive exercise for the American taxpayer since the companies don't have the money [to repay the loans] and it would simply put the companies into uncontrolled Chapter 11.\" A senior official said, \"bankruptcy is not the goal,\" although there may be a \"role for a court-supervised process to effect the restructuring ... different from Chapter 11.\"(Quote) \"http://www.foxnews.com/politics/first100days/2009/03/30/obama-auto/\" But in either case, isn't it interesting that all this guidance is comming from 'people' who have NEVER run a business?", 
        "intTime": 20090330, 
        "postID": 2, 
        "quote": "", 
        "reply": "A different story from another source? (Quote)Obama said the companies and the government might have to consider \"using our bankruptcy code\" to help the companies restructure more efficiently. He said any such action would take place \"with the backing of the U.S. government.\" The Obama administration, however, has decided not to require the automakers to immediately repay government loan money they previously received, since that would force both companies into Chapter 11 bankruptcy. A senior administration official told FOX News, \"calling in the loans would not be a productive exercise for the American taxpayer since the companies don't have the money [to repay the loans] and it would simply put the companies into uncontrolled Chapter 11.\" A senior official said, \"bankruptcy is not the goal,\" although there may be a \"role for a court-supervised process to effect the restructuring ... different from Chapter 11.\"(Quote) \"http://www.foxnews.com/politics/first100days/2009/03/30/obama-auto/\" But in either case, isn't it interesting that all this guidance is comming from 'people' who have NEVER run a business?", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 17:12:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "busnrete8"
    }, 
    {
        "content": "I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090330, 
        "postID": 3, 
        "quote": "", 
        "reply": "I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 17:19:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? As much as I agree with GM going the bankruptcy route, you are correct on the double standard. Why?", 
        "intTime": 20090330, 
        "postID": 4, 
        "quote": "Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards???", 
        "reply": " As much as I agree with GM going the bankruptcy route, you are correct on the double standard. Why?", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 17:23:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "sw614"
    }, 
    {
        "content": "Squaring up a political campaign favor maybe?", 
        "intTime": 20090330, 
        "postID": 5, 
        "quote": "", 
        "reply": "Squaring up a political campaign favor maybe?", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 18:39:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? WOW LOA even the UAW agrees with you. \"http://finance.yahoo.com/news/Workers-say-Obama-treated-apf-14789941.html\" But I hate to tell them, I do not feel sorry for them locals in detroit what so ever. They screwed all the other little locals for years now it's thier turn. To bad so sad what comes around goes around \"brother\". Welcome to the party pal. That's not directed toward you LOA, that's directed to my X \"brothers\".", 
        "intTime": 20090330, 
        "postID": 6, 
        "quote": "Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards???", 
        "reply": " WOW LOA even the UAW agrees with you. \"http://finance.yahoo.com/news/Workers-say-Obama-treated-apf-14789941.html\" But I hate to tell them, I do not feel sorry for them locals in detroit what so ever. They screwed all the other little locals for years now it's thier turn. To bad so sad what comes around goes around \"brother\". Welcome to the party pal. That's not directed toward you LOA, that's directed to my X \"brothers\".", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 18:50:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "If GM goes under I'm going to buy me a Vette and put it in storage for 10 years then let Hewlett Jackson sell it for me for a cool profit.", 
        "intTime": 20090330, 
        "postID": 7, 
        "quote": "", 
        "reply": "If GM goes under I'm going to buy me a Vette and put it in storage for 10 years then let Hewlett Jackson sell it for me for a cool profit.", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 18:52:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "Duster6"
    }, 
    {
        "content": "I have the hunch, GM and Chrysler will be put into bankruptcy, no matter what... Guess the unions are gonna be upset with their \"man\" in the White House... Oh well, another campaign promise bites the dust... Respectfully, SUNLINER81", 
        "intTime": 20090330, 
        "postID": 8, 
        "quote": "", 
        "reply": "I have the hunch, GM and Chrysler will be put into bankruptcy, no matter what... Guess the unions are gonna be upset with their \"man\" in the White House... Oh well, another campaign promise bites the dust... Respectfully, SUNLINER81", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 19:03:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? As much as I agree with GM going the bankruptcy route, you are correct on the double standard. Why? PAYOLA", 
        "intTime": 20090330, 
        "postID": 9, 
        "quote": "Originally posted by sw614: quote: Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? As much as I agree with GM going the bankruptcy route, you are correct on the double standard. Why?", 
        "reply": " PAYOLA", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 19:15:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"The Obama's administration's leading plan to fix General Motors Corp. and Chrysler LLC would use bankruptcy filings to purge the ailing companies of their biggest problems, including bondholder debt and retiree health-care costs, according to people familiar with the matter.\" \"http://online.wsj.com/article/SB123841609048669495.html\" sorta goes along with his plan to bankrupt the whole country!", 
        "intTime": 20090330, 
        "postID": 10, 
        "quote": "Originally posted by crackerjacks61: \"The Obama's administration's leading plan to fix General Motors Corp. and Chrysler LLC would use bankruptcy filings to purge the ailing companies of their biggest problems, including bondholder debt and retiree health-care costs, according to people familiar with the matter.\" \"http://online.wsj.com/article/SB123841609048669495.html\"", 
        "reply": " sorta goes along with his plan to bankrupt the whole country!", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 19:36:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"The Obama's administration's leading plan to fix General Motors Corp. and Chrysler LLC would use bankruptcy filings to purge the ailing companies of their biggest problems, including bondholder debt and retiree health-care costs, according to people familiar with the matter.\" \"http://online.wsj.com/article/SB123841609048669495.html\" sorta goes along with his plan to bankrupt the whole country! Bush bankrupted the country. Obama inherited his mess and is trying to do something about it. Rome wasn't built in a day, nor will this mess be sorted out in a day. Have patience because there is no other answer but to do what is being done right now, and at least this President is trying, as compared to his predecessor who sat on his hands and let it all happen. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090330, 
        "postID": 11, 
        "quote": "Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"The Obama's administration's leading plan to fix General Motors Corp. and Chrysler LLC would use bankruptcy filings to purge the ailing companies of their biggest problems, including bondholder debt and retiree health-care costs, according to people familiar with the matter.\" \"http://online.wsj.com/article/SB123841609048669495.html\" sorta goes along with his plan to bankrupt the whole country!", 
        "reply": " Bush bankrupted the country. Obama inherited his mess and is trying to do something about it. Rome wasn't built in a day, nor will this mess be sorted out in a day. Have patience because there is no other answer but to do what is being done right now, and at least this President is trying, as compared to his predecessor who sat on his hands and let it all happen. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 20:04:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"The Obama's administration's leading plan to fix General Motors Corp. and Chrysler LLC would use bankruptcy filings to purge the ailing companies of their biggest problems, including bondholder debt and retiree health-care costs, according to people familiar with the matter.\" \"http://online.wsj.com/article/SB123841609048669495.html\" sorta goes along with his plan to bankrupt the whole country! Bush bankrupted the country. Obama inherited his mess and is trying to do something about it. Rome wasn't built in a day, nor will this mess be sorted out in a day. Have patience because there is no other answer but to do what is being done right now, and at least this President is trying, as compared to his predecessor who sat on his hands and let it all happen. As you say, Rome wasn't built in a day, nor did it fall in one. Thinking that the prediciment we are in came about in 8 years ignores all the contributing factors to the nituation and will doom us to keep mrepeating the mistakes. The beginning of the equation that culminated in all this started over 30+ years ago, maybe more.", 
        "intTime": 20090330, 
        "postID": 12, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"The Obama's administration's leading plan to fix General Motors Corp. and Chrysler LLC would use bankruptcy filings to purge the ailing companies of their biggest problems, including bondholder debt and retiree health-care costs, according to people familiar with the matter.\" \"http://online.wsj.com/article/SB123841609048669495.html\" sorta goes along with his plan to bankrupt the whole country! Bush bankrupted the country. Obama inherited his mess and is trying to do something about it. Rome wasn't built in a day, nor will this mess be sorted out in a day. Have patience because there is no other answer but to do what is being done right now, and at least this President is trying, as compared to his predecessor who sat on his hands and let it all happen.", 
        "reply": " As you say, Rome wasn't built in a day, nor did it fall in one. Thinking that the prediciment we are in came about in 8 years ignores all the contributing factors to the nituation and will doom us to keep mrepeating the mistakes. The beginning of the equation that culminated in all this started over 30+ years ago, maybe more.", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 20:16:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "sw614"
    }, 
    {
        "content": "Chrysler has been on the brink for years. They were bought by Daimler for $36 billion, but sold to Cerberus for 6 billion. The worst part is they have what seems to be one of the most active R&D departments, but like GM they are stuck with the flagship Chrysler brand along with Dodge and Jeep. Perhaps the biggest mistake they made was in 2001 when the got rid of Plymouth and the base model vehicles like the Voyager minivan. They have concentrated heavily on the high end, and in 2004 turned the midsize SUV Durango into the full size it is now. I have an 04 Durango and it is great, but the fuel economy is horrible. The Dodge Ram trucks are very good, but that niche is a very competive market with GM and Ford. The best thing that could happen to Chrysler would be a merger with GM. They could keep the Dodge and Jeep brands, drop Chrysler since most Chrysler products are also released in some form by Dodge. The Ram trucks would have to be dropped leaving GM with new models like the Charger and Jeep Wrangler.", 
        "intTime": 20090330, 
        "postID": 13, 
        "quote": "", 
        "reply": "Chrysler has been on the brink for years. They were bought by Daimler for $36 billion, but sold to Cerberus for 6 billion. The worst part is they have what seems to be one of the most active R&D departments, but like GM they are stuck with the flagship Chrysler brand along with Dodge and Jeep. Perhaps the biggest mistake they made was in 2001 when the got rid of Plymouth and the base model vehicles like the Voyager minivan. They have concentrated heavily on the high end, and in 2004 turned the midsize SUV Durango into the full size it is now. I have an 04 Durango and it is great, but the fuel economy is horrible. The Dodge Ram trucks are very good, but that niche is a very competive market with GM and Ford. The best thing that could happen to Chrysler would be a merger with GM. They could keep the Dodge and Jeep brands, drop Chrysler since most Chrysler products are also released in some form by Dodge. The Ram trucks would have to be dropped leaving GM with new models like the Charger and Jeep Wrangler.", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 22:19:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Poor Obama. He didn't know what he was getting into. Everything that he has done so far is a by product of the evil Bush empire. Even though I'm making more money now under Obama and I don't have to do anything for it, it just shows up in my pay check and in the mail. Obama can smile and give money away at the same time. Now thats good if you ask me. However, I don't have any young kids to worry about.", 
        "intTime": 20090331, 
        "postID": 14, 
        "quote": "", 
        "reply": "Poor Obama. He didn't know what he was getting into. Everything that he has done so far is a by product of the evil Bush empire. Even though I'm making more money now under Obama and I don't have to do anything for it, it just shows up in my pay check and in the mail. Obama can smile and give money away at the same time. Now thats good if you ask me. However, I don't have any young kids to worry about.", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-31 04:38:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "Duster6"
    }, 
    {
        "content": "Meanwhile the stock market took a nose dive. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 15, 
        "quote": "", 
        "reply": "Meanwhile the stock market took a nose dive. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-31 06:36:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: You do not have a departing flight! Please select a flight & re-submit your document. Thank you. The president's plan for General Motors and Chrysler, announced yesterday, continues to get top billing in the press. Obama took a hard stance with the struggling automakers, giving GM 60 days to come up with a viable, not to mention drastic, restructuring plan, and Chrysler 30 days. If the companies fail to do this, he would allow them to file for bankruptcy. The New York Times reports that, as a result, the United Automobile Workers, which along with bondholders has thus far \"balked\" at the GM's demands, \"will be asked to make even bigger concessions on a new wage and benefits contract and health benefits for retirees. Bondholders will most likely be forced to accept a deep discount on the price of their debt as well as agree to take GM stock in lieu of debt repayments.\" In addition, Chrysler must merge with Fiat by April 30, Obama said. The Wall Street Journal concludes that Obama's plan stems not only from his interest in saving jobs but also from the chance to push \"other policy prescriptions, in particular creating a ‘company of the future' with clean and energy-efficient vehicles, a frequent campaign theme during Mr. Obama's quest for the presidency.\" The plan, it says, is also \"fraught with political risk and controversy\" as it is now obvious that the administration will be taking its largest role yet in the operations of the automakers, a role that \"dwarfs that of any other company receiving U.S. aid.\" (....) +http://www.reuters.com/article/bigMoney/idUS118748959020090331", 
        "intTime": 20090331, 
        "postID": 16, 
        "quote": "You do not have a departing flight! Please select a flight & re-submit your document. Thank you. The president's plan for General Motors and Chrysler, announced yesterday, continues to get top billing in the press. Obama took a hard stance with the struggling automakers, giving GM 60 days to come up with a viable, not to mention drastic, restructuring plan, and Chrysler 30 days. If the companies fail to do this, he would allow them to file for bankruptcy. The New York Times reports that, as a result, the United Automobile Workers, which along with bondholders has thus far \"balked\" at the GM's demands, \"will be asked to make even bigger concessions on a new wage and benefits contract and health benefits for retirees. Bondholders will most likely be forced to accept a deep discount on the price of their debt as well as agree to take GM stock in lieu of debt repayments.\" In addition, Chrysler must merge with Fiat by April 30, Obama said. The Wall Street Journal concludes that Obama's plan stems not only from his interest in saving jobs but also from the chance to push \"other policy prescriptions, in particular creating a ‘company of the future' with clean and energy-efficient vehicles, a frequent campaign theme during Mr. Obama's quest for the presidency.\" The plan, it says, is also \"fraught with political risk and controversy\" as it is now obvious that the administration will be taking its largest role yet in the operations of the automakers, a role that \"dwarfs that of any other company receiving U.S. aid.\" (....)", 
        "reply": " +http://www.reuters.com/article/bigMoney/idUS118748959020090331", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-31 07:14:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? WOW LOA even the UAW agrees with you. \"http://finance.yahoo.com/news/Workers-say-Obama-treated-apf-14789941.html\" But I hate to tell them, I do not feel sorry for them locals in detroit what so ever. They screwed all the other little locals for years now it's thier turn. To bad so sad what comes around goes around \"brother\". Welcome to the party pal. That's not directed toward you LOA, that's directed to my X \"brothers\". I understand where you are going. The problem I have is strictly the double standard. I say follow the money, it will probably take us to the answer of why this double standard is so rampant. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090331, 
        "postID": 17, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? WOW LOA even the UAW agrees with you. \"http://finance.yahoo.com/news/Workers-say-Obama-treated-apf-14789941.html\" But I hate to tell them, I do not feel sorry for them locals in detroit what so ever. They screwed all the other little locals for years now it's thier turn. To bad so sad what comes around goes around \"brother\". Welcome to the party pal. That's not directed toward you LOA, that's directed to my X \"brothers\".", 
        "reply": " I understand where you are going. The problem I have is strictly the double standard. I say follow the money, it will probably take us to the answer of why this double standard is so rampant. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-31 07:36:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? WOW LOA even the UAW agrees with you. \"http://finance.yahoo.com/news/Workers-say-Obama-treated-apf-14789941.html\" But I hate to tell them, I do not feel sorry for them locals in detroit what so ever. They screwed all the other little locals for years now it's thier turn. To bad so sad what comes around goes around \"brother\". Welcome to the party pal. That's not directed toward you LOA, that's directed to my X \"brothers\". I understand where you are going. The problem I have is strictly the double standard. I say follow the money, it will probably take us to the answer of why this double standard is so rampant. Apparently AIG is too big to fail (according to both Bush & Obama admin).......IMHO, they are just too big period!", 
        "intTime": 20090331, 
        "postID": 18, 
        "quote": "Originally posted by L0A1: quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? WOW LOA even the UAW agrees with you. \"http://finance.yahoo.com/news/Workers-say-Obama-treated-apf-14789941.html\" But I hate to tell them, I do not feel sorry for them locals in detroit what so ever. They screwed all the other little locals for years now it's thier turn. To bad so sad what comes around goes around \"brother\". Welcome to the party pal. That's not directed toward you LOA, that's directed to my X \"brothers\". I understand where you are going. The problem I have is strictly the double standard. I say follow the money, it will probably take us to the answer of why this double standard is so rampant.", 
        "reply": " Apparently AIG is too big to fail (according to both Bush & Obama admin).......IMHO, they are just too big period!", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-31 07:41:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "Knele"
    }, 
    {
        "content": "Why is the motor industry under this kind of pressure, but the banks and insurance companies can get away with murder? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 19, 
        "quote": "", 
        "reply": "Why is the motor industry under this kind of pressure, but the banks and insurance companies can get away with murder? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-31 07:41:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Why is the motor industry under this kind of pressure, but the banks and insurance companies can get away with murder? Follow the money. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090331, 
        "postID": 20, 
        "quote": "Originally posted by Anbar7: Why is the motor industry under this kind of pressure, but the banks and insurance companies can get away with murder?", 
        "reply": " Follow the money. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-31 07:44:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "L0A1"
    }, 
    {
        "content": "\"The Obama's administration's leading plan to fix General Motors Corp. and Chrysler LLC would use bankruptcy filings to purge the ailing companies of their biggest problems, including bondholder debt and retiree health-care costs, according to people familiar with the matter.\" \"http://online.wsj.com/article/SB123841609048669495.html\"", 
        "intTime": 20090330, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"The Obama's administration's leading plan to fix General Motors Corp. and Chrysler LLC would use bankruptcy filings to purge the ailing companies of their biggest problems, including bondholder debt and retiree health-care costs, according to people familiar with the matter.\" \"http://online.wsj.com/article/SB123841609048669495.html\"", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 15:23:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "A different story from another source? (Quote)Obama said the companies and the government might have to consider \"using our bankruptcy code\" to help the companies restructure more efficiently. He said any such action would take place \"with the backing of the U.S. government.\" The Obama administration, however, has decided not to require the automakers to immediately repay government loan money they previously received, since that would force both companies into Chapter 11 bankruptcy. A senior administration official told FOX News, \"calling in the loans would not be a productive exercise for the American taxpayer since the companies don't have the money [to repay the loans] and it would simply put the companies into uncontrolled Chapter 11.\" A senior official said, \"bankruptcy is not the goal,\" although there may be a \"role for a court-supervised process to effect the restructuring ... different from Chapter 11.\"(Quote) \"http://www.foxnews.com/politics/first100days/2009/03/30/obama-auto/\" But in either case, isn't it interesting that all this guidance is comming from 'people' who have NEVER run a business?", 
        "intTime": 20090330, 
        "postID": 22, 
        "quote": "", 
        "reply": "A different story from another source? (Quote)Obama said the companies and the government might have to consider \"using our bankruptcy code\" to help the companies restructure more efficiently. He said any such action would take place \"with the backing of the U.S. government.\" The Obama administration, however, has decided not to require the automakers to immediately repay government loan money they previously received, since that would force both companies into Chapter 11 bankruptcy. A senior administration official told FOX News, \"calling in the loans would not be a productive exercise for the American taxpayer since the companies don't have the money [to repay the loans] and it would simply put the companies into uncontrolled Chapter 11.\" A senior official said, \"bankruptcy is not the goal,\" although there may be a \"role for a court-supervised process to effect the restructuring ... different from Chapter 11.\"(Quote) \"http://www.foxnews.com/politics/first100days/2009/03/30/obama-auto/\" But in either case, isn't it interesting that all this guidance is comming from 'people' who have NEVER run a business?", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 17:12:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "busnrete8"
    }, 
    {
        "content": "I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090330, 
        "postID": 23, 
        "quote": "", 
        "reply": "I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 17:19:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? As much as I agree with GM going the bankruptcy route, you are correct on the double standard. Why?", 
        "intTime": 20090330, 
        "postID": 24, 
        "quote": "Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards???", 
        "reply": " As much as I agree with GM going the bankruptcy route, you are correct on the double standard. Why?", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 17:23:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "sw614"
    }, 
    {
        "content": "Squaring up a political campaign favor maybe?", 
        "intTime": 20090330, 
        "postID": 25, 
        "quote": "", 
        "reply": "Squaring up a political campaign favor maybe?", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 18:39:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? WOW LOA even the UAW agrees with you. \"http://finance.yahoo.com/news/Workers-say-Obama-treated-apf-14789941.html\" But I hate to tell them, I do not feel sorry for them locals in detroit what so ever. They screwed all the other little locals for years now it's thier turn. To bad so sad what comes around goes around \"brother\". Welcome to the party pal. That's not directed toward you LOA, that's directed to my X \"brothers\".", 
        "intTime": 20090330, 
        "postID": 26, 
        "quote": "Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards???", 
        "reply": " WOW LOA even the UAW agrees with you. \"http://finance.yahoo.com/news/Workers-say-Obama-treated-apf-14789941.html\" But I hate to tell them, I do not feel sorry for them locals in detroit what so ever. They screwed all the other little locals for years now it's thier turn. To bad so sad what comes around goes around \"brother\". Welcome to the party pal. That's not directed toward you LOA, that's directed to my X \"brothers\".", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 18:50:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "If GM goes under I'm going to buy me a Vette and put it in storage for 10 years then let Hewlett Jackson sell it for me for a cool profit.", 
        "intTime": 20090330, 
        "postID": 27, 
        "quote": "", 
        "reply": "If GM goes under I'm going to buy me a Vette and put it in storage for 10 years then let Hewlett Jackson sell it for me for a cool profit.", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 18:52:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "Duster6"
    }, 
    {
        "content": "I have the hunch, GM and Chrysler will be put into bankruptcy, no matter what... Guess the unions are gonna be upset with their \"man\" in the White House... Oh well, another campaign promise bites the dust... Respectfully, SUNLINER81", 
        "intTime": 20090330, 
        "postID": 28, 
        "quote": "", 
        "reply": "I have the hunch, GM and Chrysler will be put into bankruptcy, no matter what... Guess the unions are gonna be upset with their \"man\" in the White House... Oh well, another campaign promise bites the dust... Respectfully, SUNLINER81", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 19:03:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? As much as I agree with GM going the bankruptcy route, you are correct on the double standard. Why? PAYOLA", 
        "intTime": 20090330, 
        "postID": 29, 
        "quote": "Originally posted by sw614: quote: Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? As much as I agree with GM going the bankruptcy route, you are correct on the double standard. Why?", 
        "reply": " PAYOLA", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 19:15:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"The Obama's administration's leading plan to fix General Motors Corp. and Chrysler LLC would use bankruptcy filings to purge the ailing companies of their biggest problems, including bondholder debt and retiree health-care costs, according to people familiar with the matter.\" \"http://online.wsj.com/article/SB123841609048669495.html\" sorta goes along with his plan to bankrupt the whole country!", 
        "intTime": 20090330, 
        "postID": 30, 
        "quote": "Originally posted by crackerjacks61: \"The Obama's administration's leading plan to fix General Motors Corp. and Chrysler LLC would use bankruptcy filings to purge the ailing companies of their biggest problems, including bondholder debt and retiree health-care costs, according to people familiar with the matter.\" \"http://online.wsj.com/article/SB123841609048669495.html\"", 
        "reply": " sorta goes along with his plan to bankrupt the whole country!", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 19:36:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"The Obama's administration's leading plan to fix General Motors Corp. and Chrysler LLC would use bankruptcy filings to purge the ailing companies of their biggest problems, including bondholder debt and retiree health-care costs, according to people familiar with the matter.\" \"http://online.wsj.com/article/SB123841609048669495.html\" sorta goes along with his plan to bankrupt the whole country! Bush bankrupted the country. Obama inherited his mess and is trying to do something about it. Rome wasn't built in a day, nor will this mess be sorted out in a day. Have patience because there is no other answer but to do what is being done right now, and at least this President is trying, as compared to his predecessor who sat on his hands and let it all happen. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090330, 
        "postID": 31, 
        "quote": "Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"The Obama's administration's leading plan to fix General Motors Corp. and Chrysler LLC would use bankruptcy filings to purge the ailing companies of their biggest problems, including bondholder debt and retiree health-care costs, according to people familiar with the matter.\" \"http://online.wsj.com/article/SB123841609048669495.html\" sorta goes along with his plan to bankrupt the whole country!", 
        "reply": " Bush bankrupted the country. Obama inherited his mess and is trying to do something about it. Rome wasn't built in a day, nor will this mess be sorted out in a day. Have patience because there is no other answer but to do what is being done right now, and at least this President is trying, as compared to his predecessor who sat on his hands and let it all happen. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 20:04:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"The Obama's administration's leading plan to fix General Motors Corp. and Chrysler LLC would use bankruptcy filings to purge the ailing companies of their biggest problems, including bondholder debt and retiree health-care costs, according to people familiar with the matter.\" \"http://online.wsj.com/article/SB123841609048669495.html\" sorta goes along with his plan to bankrupt the whole country! Bush bankrupted the country. Obama inherited his mess and is trying to do something about it. Rome wasn't built in a day, nor will this mess be sorted out in a day. Have patience because there is no other answer but to do what is being done right now, and at least this President is trying, as compared to his predecessor who sat on his hands and let it all happen. As you say, Rome wasn't built in a day, nor did it fall in one. Thinking that the prediciment we are in came about in 8 years ignores all the contributing factors to the nituation and will doom us to keep mrepeating the mistakes. The beginning of the equation that culminated in all this started over 30+ years ago, maybe more.", 
        "intTime": 20090330, 
        "postID": 32, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by EAG154: quote: Originally posted by crackerjacks61: \"The Obama's administration's leading plan to fix General Motors Corp. and Chrysler LLC would use bankruptcy filings to purge the ailing companies of their biggest problems, including bondholder debt and retiree health-care costs, according to people familiar with the matter.\" \"http://online.wsj.com/article/SB123841609048669495.html\" sorta goes along with his plan to bankrupt the whole country! Bush bankrupted the country. Obama inherited his mess and is trying to do something about it. Rome wasn't built in a day, nor will this mess be sorted out in a day. Have patience because there is no other answer but to do what is being done right now, and at least this President is trying, as compared to his predecessor who sat on his hands and let it all happen.", 
        "reply": " As you say, Rome wasn't built in a day, nor did it fall in one. Thinking that the prediciment we are in came about in 8 years ignores all the contributing factors to the nituation and will doom us to keep mrepeating the mistakes. The beginning of the equation that culminated in all this started over 30+ years ago, maybe more.", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 20:16:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "sw614"
    }, 
    {
        "content": "Chrysler has been on the brink for years. They were bought by Daimler for $36 billion, but sold to Cerberus for 6 billion. The worst part is they have what seems to be one of the most active R&D departments, but like GM they are stuck with the flagship Chrysler brand along with Dodge and Jeep. Perhaps the biggest mistake they made was in 2001 when the got rid of Plymouth and the base model vehicles like the Voyager minivan. They have concentrated heavily on the high end, and in 2004 turned the midsize SUV Durango into the full size it is now. I have an 04 Durango and it is great, but the fuel economy is horrible. The Dodge Ram trucks are very good, but that niche is a very competive market with GM and Ford. The best thing that could happen to Chrysler would be a merger with GM. They could keep the Dodge and Jeep brands, drop Chrysler since most Chrysler products are also released in some form by Dodge. The Ram trucks would have to be dropped leaving GM with new models like the Charger and Jeep Wrangler.", 
        "intTime": 20090330, 
        "postID": 33, 
        "quote": "", 
        "reply": "Chrysler has been on the brink for years. They were bought by Daimler for $36 billion, but sold to Cerberus for 6 billion. The worst part is they have what seems to be one of the most active R&D departments, but like GM they are stuck with the flagship Chrysler brand along with Dodge and Jeep. Perhaps the biggest mistake they made was in 2001 when the got rid of Plymouth and the base model vehicles like the Voyager minivan. They have concentrated heavily on the high end, and in 2004 turned the midsize SUV Durango into the full size it is now. I have an 04 Durango and it is great, but the fuel economy is horrible. The Dodge Ram trucks are very good, but that niche is a very competive market with GM and Ford. The best thing that could happen to Chrysler would be a merger with GM. They could keep the Dodge and Jeep brands, drop Chrysler since most Chrysler products are also released in some form by Dodge. The Ram trucks would have to be dropped leaving GM with new models like the Charger and Jeep Wrangler.", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-30 22:19:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "nspreitler"
    }, 
    {
        "content": "Poor Obama. He didn't know what he was getting into. Everything that he has done so far is a by product of the evil Bush empire. Even though I'm making more money now under Obama and I don't have to do anything for it, it just shows up in my pay check and in the mail. Obama can smile and give money away at the same time. Now thats good if you ask me. However, I don't have any young kids to worry about.", 
        "intTime": 20090331, 
        "postID": 34, 
        "quote": "", 
        "reply": "Poor Obama. He didn't know what he was getting into. Everything that he has done so far is a by product of the evil Bush empire. Even though I'm making more money now under Obama and I don't have to do anything for it, it just shows up in my pay check and in the mail. Obama can smile and give money away at the same time. Now thats good if you ask me. However, I don't have any young kids to worry about.", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-31 04:38:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "Duster6"
    }, 
    {
        "content": "Meanwhile the stock market took a nose dive. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 35, 
        "quote": "", 
        "reply": "Meanwhile the stock market took a nose dive. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-31 06:36:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: You do not have a departing flight! Please select a flight & re-submit your document. Thank you. The president's plan for General Motors and Chrysler, announced yesterday, continues to get top billing in the press. Obama took a hard stance with the struggling automakers, giving GM 60 days to come up with a viable, not to mention drastic, restructuring plan, and Chrysler 30 days. If the companies fail to do this, he would allow them to file for bankruptcy. The New York Times reports that, as a result, the United Automobile Workers, which along with bondholders has thus far \"balked\" at the GM's demands, \"will be asked to make even bigger concessions on a new wage and benefits contract and health benefits for retirees. Bondholders will most likely be forced to accept a deep discount on the price of their debt as well as agree to take GM stock in lieu of debt repayments.\" In addition, Chrysler must merge with Fiat by April 30, Obama said. The Wall Street Journal concludes that Obama's plan stems not only from his interest in saving jobs but also from the chance to push \"other policy prescriptions, in particular creating a ‘company of the future' with clean and energy-efficient vehicles, a frequent campaign theme during Mr. Obama's quest for the presidency.\" The plan, it says, is also \"fraught with political risk and controversy\" as it is now obvious that the administration will be taking its largest role yet in the operations of the automakers, a role that \"dwarfs that of any other company receiving U.S. aid.\" (....) +http://www.reuters.com/article/bigMoney/idUS118748959020090331", 
        "intTime": 20090331, 
        "postID": 36, 
        "quote": "You do not have a departing flight! Please select a flight & re-submit your document. Thank you. The president's plan for General Motors and Chrysler, announced yesterday, continues to get top billing in the press. Obama took a hard stance with the struggling automakers, giving GM 60 days to come up with a viable, not to mention drastic, restructuring plan, and Chrysler 30 days. If the companies fail to do this, he would allow them to file for bankruptcy. The New York Times reports that, as a result, the United Automobile Workers, which along with bondholders has thus far \"balked\" at the GM's demands, \"will be asked to make even bigger concessions on a new wage and benefits contract and health benefits for retirees. Bondholders will most likely be forced to accept a deep discount on the price of their debt as well as agree to take GM stock in lieu of debt repayments.\" In addition, Chrysler must merge with Fiat by April 30, Obama said. The Wall Street Journal concludes that Obama's plan stems not only from his interest in saving jobs but also from the chance to push \"other policy prescriptions, in particular creating a ‘company of the future' with clean and energy-efficient vehicles, a frequent campaign theme during Mr. Obama's quest for the presidency.\" The plan, it says, is also \"fraught with political risk and controversy\" as it is now obvious that the administration will be taking its largest role yet in the operations of the automakers, a role that \"dwarfs that of any other company receiving U.S. aid.\" (....)", 
        "reply": " +http://www.reuters.com/article/bigMoney/idUS118748959020090331", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-31 07:14:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? WOW LOA even the UAW agrees with you. \"http://finance.yahoo.com/news/Workers-say-Obama-treated-apf-14789941.html\" But I hate to tell them, I do not feel sorry for them locals in detroit what so ever. They screwed all the other little locals for years now it's thier turn. To bad so sad what comes around goes around \"brother\". Welcome to the party pal. That's not directed toward you LOA, that's directed to my X \"brothers\". I understand where you are going. The problem I have is strictly the double standard. I say follow the money, it will probably take us to the answer of why this double standard is so rampant. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090331, 
        "postID": 37, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? WOW LOA even the UAW agrees with you. \"http://finance.yahoo.com/news/Workers-say-Obama-treated-apf-14789941.html\" But I hate to tell them, I do not feel sorry for them locals in detroit what so ever. They screwed all the other little locals for years now it's thier turn. To bad so sad what comes around goes around \"brother\". Welcome to the party pal. That's not directed toward you LOA, that's directed to my X \"brothers\".", 
        "reply": " I understand where you are going. The problem I have is strictly the double standard. I say follow the money, it will probably take us to the answer of why this double standard is so rampant. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-31 07:36:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? WOW LOA even the UAW agrees with you. \"http://finance.yahoo.com/news/Workers-say-Obama-treated-apf-14789941.html\" But I hate to tell them, I do not feel sorry for them locals in detroit what so ever. They screwed all the other little locals for years now it's thier turn. To bad so sad what comes around goes around \"brother\". Welcome to the party pal. That's not directed toward you LOA, that's directed to my X \"brothers\". I understand where you are going. The problem I have is strictly the double standard. I say follow the money, it will probably take us to the answer of why this double standard is so rampant. Apparently AIG is too big to fail (according to both Bush & Obama admin).......IMHO, they are just too big period!", 
        "intTime": 20090331, 
        "postID": 38, 
        "quote": "Originally posted by L0A1: quote: Originally posted by crackerjacks61: quote: Originally posted by L0A1: I am still confused on how President Obama gives GM CEO his walking papers but freely hands out billions to AIG and other Banks. What's up with the double blatant standards??? WOW LOA even the UAW agrees with you. \"http://finance.yahoo.com/news/Workers-say-Obama-treated-apf-14789941.html\" But I hate to tell them, I do not feel sorry for them locals in detroit what so ever. They screwed all the other little locals for years now it's thier turn. To bad so sad what comes around goes around \"brother\". Welcome to the party pal. That's not directed toward you LOA, that's directed to my X \"brothers\". I understand where you are going. The problem I have is strictly the double standard. I say follow the money, it will probably take us to the answer of why this double standard is so rampant.", 
        "reply": " Apparently AIG is too big to fail (according to both Bush & Obama admin).......IMHO, they are just too big period!", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-31 07:41:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "Knele"
    }, 
    {
        "content": "Why is the motor industry under this kind of pressure, but the banks and insurance companies can get away with murder? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090331, 
        "postID": 39, 
        "quote": "", 
        "reply": "Why is the motor industry under this kind of pressure, but the banks and insurance companies can get away with murder? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-31 07:41:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Why is the motor industry under this kind of pressure, but the banks and insurance companies can get away with murder? Follow the money. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090331, 
        "postID": 40, 
        "quote": "Originally posted by Anbar7: Why is the motor industry under this kind of pressure, but the banks and insurance companies can get away with murder?", 
        "reply": " Follow the money. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6800083912001", 
        "time": "2009-03-31 07:44:00", 
        "title": "Obama Favors Bankruptcy For GM", 
        "userID": "L0A1"
    }
]