[
    {
        "content": "quote: China will boost military spending by 14.9% this year despite the economic slowdown, continuing a run of double-digit increases that have unsettled the US and Asian neighbours. The spokesman for the National People's Congress – China's rubber-stamp parliament, which begins its annual session tomorrow – told reporters it was a \"modest\" increase which would increase capabilities and improve conditions for the 2.3 million members of the world's largest army. Li Zhaoxing said defence spending will reach 480.6bn yuan (£50bn), 62.5bn yuan more than 2008. But the rise is slightly below last year's 17.6% increase – and the total is still dwarfed by US military spending. The Stockholm International Peace Research Institute (SIPRI) estimates that even when comparative buying power is considered, China spent the equivalent of $140bn (£99bn) in 2007, to America's $547bn. The UK spent the equivalent of $54bn. SIPRI suggests defence spending in China has risen threefold in real terms over the last decade. Chinese officials argue that heavy investment is needed to modernise its military after years of financial neglect and in the light of other countries' increasing capabilities and China's growing responsibilities. It has begun contributing to peacekeeping efforts and recently sent ships to join the taskforce battling Somalian pirates. Li said the rise would mainly go towards raising wages and conditions, improving the military's hi-tech ability and enhancing its emergency response capabilities in \"disaster relief, fighting terrorism, maintaining stability and other non-warfare military operations +http://www.guardian.co.uk/world/2009/mar/04/china-boosts-military-spending", 
        "intTime": 20090304, 
        "postID": 1, 
        "quote": "China will boost military spending by 14.9% this year despite the economic slowdown, continuing a run of double-digit increases that have unsettled the US and Asian neighbours. The spokesman for the National People's Congress – China's rubber-stamp parliament, which begins its annual session tomorrow – told reporters it was a \"modest\" increase which would increase capabilities and improve conditions for the 2.3 million members of the world's largest army. Li Zhaoxing said defence spending will reach 480.6bn yuan (£50bn), 62.5bn yuan more than 2008. But the rise is slightly below last year's 17.6% increase – and the total is still dwarfed by US military spending. The Stockholm International Peace Research Institute (SIPRI) estimates that even when comparative buying power is considered, China spent the equivalent of $140bn (£99bn) in 2007, to America's $547bn. The UK spent the equivalent of $54bn. SIPRI suggests defence spending in China has risen threefold in real terms over the last decade. Chinese officials argue that heavy investment is needed to modernise its military after years of financial neglect and in the light of other countries' increasing capabilities and China's growing responsibilities. It has begun contributing to peacekeeping efforts and recently sent ships to join the taskforce battling Somalian pirates. Li said the rise would mainly go towards raising wages and conditions, improving the military's hi-tech ability and enhancing its emergency response capabilities in \"disaster relief, fighting terrorism, maintaining stability and other non-warfare military operations", 
        "reply": " +http://www.guardian.co.uk/world/2009/mar/04/china-boosts-military-spending", 
        "threadID": "672198221_8350088612001", 
        "time": "2009-03-04 09:01:00", 
        "title": "China announces double-digit military spending boost", 
        "userID": "Knele"
    }
]