[
    {
        "content": "Michael Savage has been named as one of 16 people in the entire world who are not allowed to enter Britain. Good to see they still have their priorities. Millions of listeners tune into him daily. \"\"\"http://www.independent.co.uk/news/uk/politics/16-banned-from-britain-named-and-shamed-1679127.html Don't agree with him on everything by a long shot but a lot of Americans say they do. My political barb is I know a lot of people in America will be happy about this. Coming soon to the shores near you...", 
        "intTime": 20090505, 
        "postID": 1, 
        "quote": "", 
        "reply": "Michael Savage has been named as one of 16 people in the entire world who are not allowed to enter Britain. Good to see they still have their priorities. Millions of listeners tune into him daily. \"\"\"http://www.independent.co.uk/news/uk/politics/16-banned-from-britain-named-and-shamed-1679127.html Don't agree with him on everything by a long shot but a lot of Americans say they do. My political barb is I know a lot of people in America will be happy about this. Coming soon to the shores near you...", 
        "threadID": "672198221_3230055222001", 
        "time": "2009-05-05 10:06:00", 
        "title": "British Bans millions of Americans", 
        "userID": "ACR26"
    }, 
    {
        "content": "Savage is apparently going to sue the Home Secretary for Defamation of Character. Which leaves me in a bit of a bind, because while I loathe and detest Jaqui Smith I find Mr Savage equally detestable and the cretin called her the \"Home Secretary of England\" on the is morning which demonstrates that not only is he a vicious git he's also ignorant.", 
        "intTime": 20090506, 
        "postID": 2, 
        "quote": "", 
        "reply": "Savage is apparently going to sue the Home Secretary for Defamation of Character. Which leaves me in a bit of a bind, because while I loathe and detest Jaqui Smith I find Mr Savage equally detestable and the cretin called her the \"Home Secretary of England\" on the is morning which demonstrates that not only is he a vicious git he's also ignorant.", 
        "threadID": "672198221_3230055222001", 
        "time": "2009-05-06 11:37:00", 
        "title": "British Bans millions of Americans", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "LOL, I wish I could list some folks that weren't allowed to step foot in the US. I would have some fun. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 3, 
        "quote": "", 
        "reply": "LOL, I wish I could list some folks that weren't allowed to step foot in the US. I would have some fun. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3230055222001", 
        "time": "2009-05-06 11:45:00", 
        "title": "British Bans millions of Americans", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: Savage is apparently going to sue the Home Secretary for Defamation of Character. Which leaves me in a bit of a bind, because while I loathe and detest Jaqui Smith I find Mr Savage equally detestable and the cretin called her the \"Home Secretary of England\" on the is morning which demonstrates that not only is he a vicious git he's also ignorant. But he is fun to listen to. Just for FYI, what is the proper form of address for Ms. Smith?", 
        "intTime": 20090506, 
        "postID": 4, 
        "quote": "Originally posted by Bladensburg: Savage is apparently going to sue the Home Secretary for Defamation of Character. Which leaves me in a bit of a bind, because while I loathe and detest Jaqui Smith I find Mr Savage equally detestable and the cretin called her the \"Home Secretary of England\" on the is morning which demonstrates that not only is he a vicious git he's also ignorant.", 
        "reply": " But he is fun to listen to. Just for FYI, what is the proper form of address for Ms. Smith?", 
        "threadID": "672198221_3230055222001", 
        "time": "2009-05-06 12:04:00", 
        "title": "British Bans millions of Americans", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Michael Savage has been named as one of 16 people in the entire world who are not allowed to enter Britain. Good to see they still have their priorities. Millions of listeners tune into him daily. \"\"\"http://www.independent.co.uk/news/uk/politics/16-banned-from-britain-named-and-shamed-1679127.html Don't agree with him on everything by a long shot but a lot of Americans say they do. My political barb is I know a lot of people in America will be happy about this. Coming soon to the shores near you... So why does your title say millions? And kindly show me where you stood up and objected to cat Stevens being banned from the USA? -- Savage", 
        "intTime": 20090506, 
        "postID": 5, 
        "quote": "Originally posted by ACR26: Michael Savage has been named as one of 16 people in the entire world who are not allowed to enter Britain. Good to see they still have their priorities. Millions of listeners tune into him daily. \"\"\"http://www.independent.co.uk/news/uk/politics/16-banned-from-britain-named-and-shamed-1679127.html Don't agree with him on everything by a long shot but a lot of Americans say they do. My political barb is I know a lot of people in America will be happy about this. Coming soon to the shores near you...", 
        "reply": " So why does your title say millions? And kindly show me where you stood up and objected to cat Stevens being banned from the USA? -- Savage", 
        "threadID": "672198221_3230055222001", 
        "time": "2009-05-06 12:14:00", 
        "title": "British Bans millions of Americans", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: Originally posted by L0A1: LOL, I wish I could list some folks that weren't allowed to step foot in the US. I would have some fun. I agree with you there. And, there are many that are here I wish was there. Not a bad idea I guess, except we have that First Amendment thing that keeps popping up. So we're stuck with him and Rush and anyone with strange idea. They been running news about the Preacher Fred Phelps from Kansas today, top of my list. Jessie Jackson, Sharpton, Jeremiah Wright, Michael Pfleger on and on.", 
        "intTime": 20090506, 
        "postID": 6, 
        "quote": "Originally posted by L0A1: LOL, I wish I could list some folks that weren't allowed to step foot in the US. I would have some fun.", 
        "reply": " I agree with you there. And, there are many that are here I wish was there. Not a bad idea I guess, except we have that First Amendment thing that keeps popping up. So we're stuck with him and Rush and anyone with strange idea. They been running news about the Preacher Fred Phelps from Kansas today, top of my list. Jessie Jackson, Sharpton, Jeremiah Wright, Michael Pfleger on and on.", 
        "threadID": "672198221_3230055222001", 
        "time": "2009-05-06 12:20:00", 
        "title": "British Bans millions of Americans", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: Savage is apparently going to sue the Home Secretary for Defamation of Character. Which leaves me in a bit of a bind, because while I loathe and detest Jaqui Smith I find Mr Savage equally detestable and the cretin called her the \"Home Secretary of England\" on the is morning which demonstrates that not only is he a vicious git he's also ignorant. For the benifit of us ignorant colonials whats the proper term?", 
        "intTime": 20090506, 
        "postID": 7, 
        "quote": "Originally posted by Bladensburg: Savage is apparently going to sue the Home Secretary for Defamation of Character. Which leaves me in a bit of a bind, because while I loathe and detest Jaqui Smith I find Mr Savage equally detestable and the cretin called her the \"Home Secretary of England\" on the is morning which demonstrates that not only is he a vicious git he's also ignorant.", 
        "reply": " For the benifit of us ignorant colonials whats the proper term?", 
        "threadID": "672198221_3230055222001", 
        "time": "2009-05-06 13:11:00", 
        "title": "British Bans millions of Americans", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by shuman14: quote: Originally posted by Bladensburg: Savage is apparently going to sue the Home Secretary for Defamation of Character. Which leaves me in a bit of a bind, because while I loathe and detest Jaqui Smith I find Mr Savage equally detestable and the cretin called her the \"Home Secretary of England\" on the is morning which demonstrates that not only is he a vicious git he's also ignorant. But he is fun to listen to. Just for FYI, what is the proper form of address for Ms. Smith? Oi you, halfwit. It was more that she's the British or UK Home Secretary rather English - it's probably a minor point to most foreigners (and indeed it was to many Britons for a while post Union) but Britain includes Scotland and Northern Ireland as well as England.", 
        "intTime": 20090506, 
        "postID": 8, 
        "quote": "Originally posted by shuman14: quote: Originally posted by Bladensburg: Savage is apparently going to sue the Home Secretary for Defamation of Character. Which leaves me in a bit of a bind, because while I loathe and detest Jaqui Smith I find Mr Savage equally detestable and the cretin called her the \"Home Secretary of England\" on the is morning which demonstrates that not only is he a vicious git he's also ignorant. But he is fun to listen to. Just for FYI, what is the proper form of address for Ms. Smith?", 
        "reply": " Oi you, halfwit. It was more that she's the British or UK Home Secretary rather English - it's probably a minor point to most foreigners (and indeed it was to many Britons for a while post Union) but Britain includes Scotland and Northern Ireland as well as England.", 
        "threadID": "672198221_3230055222001", 
        "time": "2009-05-06 13:26:00", 
        "title": "British Bans millions of Americans", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: not only is he a vicious git he's also ignorant. Which is what makes his show fun!", 
        "intTime": 20090506, 
        "postID": 9, 
        "quote": "Originally posted by Bladensburg: not only is he a vicious git he's also ignorant.", 
        "reply": " Which is what makes his show fun!", 
        "threadID": "672198221_3230055222001", 
        "time": "2009-05-06 13:49:00", 
        "title": "British Bans millions of Americans", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: Originally posted by L0A1: LOL, I wish I could list some folks that weren't allowed to step foot in the US. I would have some fun. I agree with you there. And, there are many that are here I wish was there. Not a bad idea I guess, except we have that First Amendment thing that keeps popping up. So we're stuck with him and Rush and anyone with strange idea. They been running news about the Preacher Fred Phelps from Kansas today, top of my list. Jessie Jackson, Sharpton, Jeremiah Wright, Michael Pfleger on and on. With enough time and research I bet we could top 1 million lol. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 10, 
        "quote": "Originally posted by rayevinsonsr: quote: Originally posted by L0A1: LOL, I wish I could list some folks that weren't allowed to step foot in the US. I would have some fun. I agree with you there. And, there are many that are here I wish was there. Not a bad idea I guess, except we have that First Amendment thing that keeps popping up. So we're stuck with him and Rush and anyone with strange idea. They been running news about the Preacher Fred Phelps from Kansas today, top of my list. Jessie Jackson, Sharpton, Jeremiah Wright, Michael Pfleger on and on.", 
        "reply": " With enough time and research I bet we could top 1 million lol. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3230055222001", 
        "time": "2009-05-06 13:51:00", 
        "title": "British Bans millions of Americans", 
        "userID": "L0A1"
    }, 
    {
        "content": "Hey! It's their Island... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "intTime": 20090506, 
        "postID": 11, 
        "quote": "", 
        "reply": "Hey! It's their Island... Quantum materiae materietur marmota monax si marmota monax materiam possit materiari?", 
        "threadID": "672198221_3230055222001", 
        "time": "2009-05-06 14:26:00", 
        "title": "British Bans millions of Americans", 
        "userID": "sargeant_green"
    }, 
    {
        "content": "quote: So why does your title say millions? And kindly show me where you stood up and objected to cat Stevens being banned from the USA? Because millions listen to him and a lot agree with him. Why did they ban him? His views on homosexuality, radical islam, etc. Yet they have thousands who protest the form of gov calling for shria law etc. Savage to the best of my knowledge does not speak of violence towards anyone. I have heard his show an many occasions and have never heard him speak about violence. Cat Stevens do not know enough facts at the time although I do know a bureaucracy was involved. And it dealt with some of his statements towards fatwa and his name linked to a known terrorist. So…what the is the comparison?", 
        "intTime": 20090506, 
        "postID": 12, 
        "quote": "So why does your title say millions? And kindly show me where you stood up and objected to cat Stevens being banned from the USA?", 
        "reply": " Because millions listen to him and a lot agree with him. Why did they ban him? His views on homosexuality, radical islam, etc. Yet they have thousands who protest the form of gov calling for shria law etc. Savage to the best of my knowledge does not speak of violence towards anyone. I have heard his show an many occasions and have never heard him speak about violence. Cat Stevens do not know enough facts at the time although I do know a bureaucracy was involved. And it dealt with some of his statements towards fatwa and his name linked to a known terrorist. So…what the is the comparison?", 
        "threadID": "672198221_3230055222001", 
        "time": "2009-05-06 16:15:00", 
        "title": "British Bans millions of Americans", 
        "userID": "ACR26"
    }, 
    {
        "content": "No-one actually know why they banned Savage, not least because as far as anyone can tell he never had any intention of visiting the UK. There was a moderately amusing item on the end of Newsnight tonight in which a government MP tried - and failed miserably - to defend this ban. It was pointed out that while Savage is patently a complete and utter arrsehole of the first water. He is nothing more than a bit of a gobshi'ite and that unlike Americans most Britons, regardless of political affiliation (even many Sun readers!) would - after listening to his rants - simply say, \"w@^k£r\" and ignore him. Most of the what he comes out with is after all self-evidently bollocks. In fact nobody had ever heard of Savage until this. It will be interesting to see what he says if he ever gets his day in court, while he's probably not as bad as any of the others on the Home Office's D-List any barrister worth his salt will make him look a complete git.", 
        "intTime": 20090506, 
        "postID": 13, 
        "quote": "", 
        "reply": "No-one actually know why they banned Savage, not least because as far as anyone can tell he never had any intention of visiting the UK. There was a moderately amusing item on the end of Newsnight tonight in which a government MP tried - and failed miserably - to defend this ban. It was pointed out that while Savage is patently a complete and utter arrsehole of the first water. He is nothing more than a bit of a gobshi'ite and that unlike Americans most Britons, regardless of political affiliation (even many Sun readers!) would - after listening to his rants - simply say, \"w@^k£r\" and ignore him. Most of the what he comes out with is after all self-evidently bollocks. In fact nobody had ever heard of Savage until this. It will be interesting to see what he says if he ever gets his day in court, while he's probably not as bad as any of the others on the Home Office's D-List any barrister worth his salt will make him look a complete git.", 
        "threadID": "672198221_3230055222001", 
        "time": "2009-05-06 16:33:00", 
        "title": "British Bans millions of Americans", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "They had him appear on Fox at night a couple of times years ago and he bombed. Since I don't listen too well with deaf ears I guess I'm not missing much. Out of San Fransico I'd imagine a selected listening audience. Hell of an education. \"http://en.wikipedia.org/wiki/Michael_Savage_(commentator)", 
        "intTime": 20090506, 
        "postID": 14, 
        "quote": "", 
        "reply": "They had him appear on Fox at night a couple of times years ago and he bombed. Since I don't listen too well with deaf ears I guess I'm not missing much. Out of San Fransico I'd imagine a selected listening audience. Hell of an education. \"http://en.wikipedia.org/wiki/Michael_Savage_(commentator)", 
        "threadID": "672198221_3230055222001", 
        "time": "2009-05-06 17:50:00", 
        "title": "British Bans millions of Americans", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "I always feel a little dirty after being forced to agree with Mr. Savage, but this is one of those rare cases where I do. The ban is absurd; and, not only is it a joke and a miscarriage of justice, it is defamatory when the crimes of the other persons on this list are considered. Mr. Savage has vile opinions and a big mouth, but is not a terrorist or mass murderer like the others on the list. I suspect he was banned because of his words against Muslims. The radical Muslims are gettin pretty good at lawfare in the UK, and seem to have successfully used the weenie Labour government of Great Britain to shut up their opponents in the past.", 
        "intTime": 20090506, 
        "postID": 15, 
        "quote": "", 
        "reply": "I always feel a little dirty after being forced to agree with Mr. Savage, but this is one of those rare cases where I do. The ban is absurd; and, not only is it a joke and a miscarriage of justice, it is defamatory when the crimes of the other persons on this list are considered. Mr. Savage has vile opinions and a big mouth, but is not a terrorist or mass murderer like the others on the list. I suspect he was banned because of his words against Muslims. The radical Muslims are gettin pretty good at lawfare in the UK, and seem to have successfully used the weenie Labour government of Great Britain to shut up their opponents in the past.", 
        "threadID": "672198221_3230055222001", 
        "time": "2009-05-06 18:57:00", 
        "title": "British Bans millions of Americans", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: I always feel a little dirty after being forced to agree with Mr. Savage, but this is one of those rare cases where I do. The ban is absurd; and, not only is it a joke and a miscarriage of justice, it is defamatory when the crimes of the other persons on this list are considered. Mr. Savage has vile opinions and a big mouth, but is not a terrorist or mass murderer like the others on the list. I suspect he was banned because of his words against Muslims. The radical Muslims are gettin pretty good at lawfare in the UK, and seem to have successfully used the weenie Labour government of Great Britain to shut up their opponents in the past. Thanks. I could not figure out how to say what I felt when I think of savage. I do know I rarely agree with him. But when I do, I do not feel better for it.", 
        "intTime": 20090506, 
        "postID": 16, 
        "quote": "I always feel a little dirty after being forced to agree with Mr. Savage, but this is one of those rare cases where I do. The ban is absurd; and, not only is it a joke and a miscarriage of justice, it is defamatory when the crimes of the other persons on this list are considered. Mr. Savage has vile opinions and a big mouth, but is not a terrorist or mass murderer like the others on the list. I suspect he was banned because of his words against Muslims. The radical Muslims are gettin pretty good at lawfare in the UK, and seem to have successfully used the weenie Labour government of Great Britain to shut up their opponents in the past.", 
        "reply": " Thanks. I could not figure out how to say what I felt when I think of savage. I do know I rarely agree with him. But when I do, I do not feel better for it.", 
        "threadID": "672198221_3230055222001", 
        "time": "2009-05-06 19:26:00", 
        "title": "British Bans millions of Americans", 
        "userID": "ACR26"
    }
]