[
    {
        "content": "I know a lot of you folks out there wished her the worse, but guess what, the worse ain't happening. Donald Trump defended her stance on Gay marraige and said she could keep her crown. \\ \"http://www3.signonsandiego.com/stories/2009/may/12/bn12prejean094235/?metro&zIndex=97998\" Good for her! Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 1, 
        "quote": "", 
        "reply": "I know a lot of you folks out there wished her the worse, but guess what, the worse ain't happening. Donald Trump defended her stance on Gay marraige and said she could keep her crown. \\ \"http://www3.signonsandiego.com/stories/2009/may/12/bn12prejean094235/?metro&zIndex=97998\" Good for her! Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 10:37:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "L0A1"
    }, 
    {
        "content": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090512, 
        "postID": 2, 
        "quote": "", 
        "reply": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 10:54:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "NSNN"
    }, 
    {
        "content": "Sweet, now I can get back to having a life.", 
        "intTime": 20090512, 
        "postID": 3, 
        "quote": "", 
        "reply": "Sweet, now I can get back to having a life.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 11:10:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "xnavycg"
    }, 
    {
        "content": "LOL....When are the gays ever going to learn? No one cares about your cause....", 
        "intTime": 20090512, 
        "postID": 4, 
        "quote": "", 
        "reply": "LOL....When are the gays ever going to learn? No one cares about your cause....", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 11:18:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause.... Though many do not want marraige redefined, most of the folks I talked to said they would support civil unions with the same rights as married folks. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 5, 
        "quote": "Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause....", 
        "reply": " Though many do not want marraige redefined, most of the folks I talked to said they would support civil unions with the same rights as married folks. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 11:37:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: Sweet, now I can get back to having a life. It never effected my life. I felt she was singled out because of her belief. Nothing more. Miss Rhode Island's photo's were much more racier, yet not a peep from the MSM or Left wingers. Again a double standard. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 6, 
        "quote": "Originally posted by xnavycg: Sweet, now I can get back to having a life.", 
        "reply": " It never effected my life. I felt she was singled out because of her belief. Nothing more. Miss Rhode Island's photo's were much more racier, yet not a peep from the MSM or Left wingers. Again a double standard. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 11:39:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause.... Though many do not want marraige redefined, most of the folks I talked to said they would support civil unions with the same rights as married folks. Question were Civil Unions/Marriages allowed in the Pre Christian Roman Empire/Ancient Greek Culture its especially noteworthy when in fact it wasn't taboo as its considered today to have homosexual tendancies by the public? And I agree it was defiantly a double standard by gay rights activists/Tinsletown Gutterwood folks.", 
        "intTime": 20090512, 
        "postID": 7, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause.... Though many do not want marraige redefined, most of the folks I talked to said they would support civil unions with the same rights as married folks.", 
        "reply": " Question were Civil Unions/Marriages allowed in the Pre Christian Roman Empire/Ancient Greek Culture its especially noteworthy when in fact it wasn't taboo as its considered today to have homosexual tendancies by the public? And I agree it was defiantly a double standard by gay rights activists/Tinsletown Gutterwood folks.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 12:21:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause.... Way to miss the point and make an ignorant comment at the same time.", 
        "intTime": 20090512, 
        "postID": 8, 
        "quote": "Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause....", 
        "reply": " Way to miss the point and make an ignorant comment at the same time.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 12:29:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause.... Way to miss the point and make an ignorant comment at the same time. I can say the same thing for your last post in the \"National Health Insurance\" topic.", 
        "intTime": 20090512, 
        "postID": 9, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause.... Way to miss the point and make an ignorant comment at the same time.", 
        "reply": " I can say the same thing for your last post in the \"National Health Insurance\" topic.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:03:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "stec74"
    }, 
    {
        "content": "yeah, if there's anyone I want defending marriage it's Trump with his 8 ex-wives and a fake-boobed bimbo. lame. Don't kid yourselves. He kept her around because he was loving the publicity.", 
        "intTime": 20090512, 
        "postID": 10, 
        "quote": "", 
        "reply": "yeah, if there's anyone I want defending marriage it's Trump with his 8 ex-wives and a fake-boobed bimbo. lame. Don't kid yourselves. He kept her around because he was loving the publicity.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:14:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: yeah, if there's anyone I want defending marriage it's Trump with his 8 ex-wives and a fake-boobed bimbo. lame. Don't kid yourselves. He kept her around because he was loving the publicity. Topic had nothing to do with Trumps view on marriage, stay on topic stop the distracting. He quote President Obama's view of the Gay Marraige issue. President Obama even stated that it should be betwen a man and a women. Guesss you want to argue that as well? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 11, 
        "quote": "Originally posted by Frank_A_Valdez: yeah, if there's anyone I want defending marriage it's Trump with his 8 ex-wives and a fake-boobed bimbo. lame. Don't kid yourselves. He kept her around because he was loving the publicity.", 
        "reply": " Topic had nothing to do with Trumps view on marriage, stay on topic stop the distracting. He quote President Obama's view of the Gay Marraige issue. President Obama even stated that it should be betwen a man and a women. Guesss you want to argue that as well? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:17:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "L0A1"
    }, 
    {
        "content": "The fact of the matter is he couldn't care less about anything other than the buzz. Anything to keep his name out there- c'mon. He's probably BEGGING her to go out and make some more stupid comments to roil up more controversy. When has anybody paid so much attention to the Miss USA pageant before? Build a buzz-- will he or won't he? when is Trump going to have his say! keep everyone on tenterhooks. Lol. you conservatives are so desperate for validation you'll resort to Trump and his stellar track record re: marriage! lol. lol. I honestly can't hold in the laughter.", 
        "intTime": 20090512, 
        "postID": 12, 
        "quote": "", 
        "reply": "The fact of the matter is he couldn't care less about anything other than the buzz. Anything to keep his name out there- c'mon. He's probably BEGGING her to go out and make some more stupid comments to roil up more controversy. When has anybody paid so much attention to the Miss USA pageant before? Build a buzz-- will he or won't he? when is Trump going to have his say! keep everyone on tenterhooks. Lol. you conservatives are so desperate for validation you'll resort to Trump and his stellar track record re: marriage! lol. lol. I honestly can't hold in the laughter.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:35:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: The fact of the matter is he couldn't care less about anything other than the buzz. Anything to keep his name out there- c'mon. He's probably BEGGING her to go out and make some more stupid comments to roil up more controversy. When has anybody paid so much attention to the Miss USA pageant before? Build a buzz-- will he or won't he? when is Trump going to have his say! keep everyone on tenterhooks. Lol. you conservatives are so desperate for validation you'll resort to Trump and his stellar track record re: marriage! lol. lol. I honestly can't hold in the laughter. Again, you missed the point. This wasn't about conservative beliefs, this was about her RIGHT TO FREEDOM OF SPEECH. I see you LEECHING onto the political thing again. Can you stay off your partisan wagon and actually post something related to the topic. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 13, 
        "quote": "Originally posted by Frank_A_Valdez: The fact of the matter is he couldn't care less about anything other than the buzz. Anything to keep his name out there- c'mon. He's probably BEGGING her to go out and make some more stupid comments to roil up more controversy. When has anybody paid so much attention to the Miss USA pageant before? Build a buzz-- will he or won't he? when is Trump going to have his say! keep everyone on tenterhooks. Lol. you conservatives are so desperate for validation you'll resort to Trump and his stellar track record re: marriage! lol. lol. I honestly can't hold in the laughter.", 
        "reply": " Again, you missed the point. This wasn't about conservative beliefs, this was about her RIGHT TO FREEDOM OF SPEECH. I see you LEECHING onto the political thing again. Can you stay off your partisan wagon and actually post something related to the topic. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:41:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Again a double standard. double standard? Tell me it ain't so.... I am shocked to think there is such a thing... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090512, 
        "postID": 14, 
        "quote": "Originally posted by L0A1: Again a double standard.", 
        "reply": " double standard? Tell me it ain't so.... I am shocked to think there is such a thing... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:52:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant.", 
        "intTime": 20090512, 
        "postID": 15, 
        "quote": "Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet.", 
        "reply": "While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following?  <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:53:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant. Trump and company investigated it all and pretty much said the media and left wingers were blowing it out of proportions. She had NO NUDE photos like what was being reported. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 16, 
        "quote": "Originally posted by 1WW: While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant.", 
        "reply": " Trump and company investigated it all and pretty much said the media and left wingers were blowing it out of proportions. She had NO NUDE photos like what was being reported. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 14:02:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by 1WW: While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant. Trump and company investigated it all and pretty much said the media and left wingers were blowing it out of proportions. She had NO NUDE photos like what was being reported. I maintain that the controversy was not about her \"freedom of speech.\" The issue: had she broken her contract because she had taken part in speaking engagements that were not cleared/approved by the Miss California Pageant officials? Trump -- the publicity pig -- had to turn it into a circus. And yeah, I watched part of it live ... The only thing missing were waving flags, a marching band, and the Blue Angels.", 
        "intTime": 20090512, 
        "postID": 17, 
        "quote": "Originally posted by L0A1: quote: Originally posted by 1WW: While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant. Trump and company investigated it all and pretty much said the media and left wingers were blowing it out of proportions. She had NO NUDE photos like what was being reported.", 
        "reply": " I maintain that the controversy was not about her \"freedom of speech.\" The issue: had she broken her contract because she had taken part in speaking engagements that were not cleared/approved by the Miss California Pageant officials? Trump -- the publicity pig -- had to turn it into a circus. And yeah, I watched part of it live ... The only thing missing were waving flags, a marching band, and the Blue Angels.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 14:15:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "1WW"
    }, 
    {
        "content": "I wonder what the Taliban think of all this fuss over gay marriage?", 
        "intTime": 20090512, 
        "postID": 18, 
        "quote": "", 
        "reply": "I wonder what the Taliban think of all this fuss over gay marriage?", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 14:30:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by L0A1: quote: Originally posted by 1WW: While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant. Trump and company investigated it all and pretty much said the media and left wingers were blowing it out of proportions. She had NO NUDE photos like what was being reported. I maintain that the controversy was not about her \"freedom of speech.\" The issue: had she broken her contract because she had taken part in speaking engagements that were not cleared/approved by the Miss California Pageant officials? Trump -- the publicity pig -- had to turn it into a circus. And yeah, I watched part of it live ... The only thing missing were waving flags, a marching band, and the Blue Angels. The photos would have never surfaced if she hadn't practiced her freedom of speech during the pageant. She wouldn't have had the speaking engagements if her comments weren't blown out of proportion by the people who were trying to discredit her. So, yes, this issue is about her practicing her freedom of speech. Because if she would have \"checked her beliefs at the door\" no one would have cared anything about her. Oh, and in order for Trump to be considered a \"publicity pig\" all he was missing was a jar of grey poupon mustard, a couple of dozen teleprompters, and a \"request\" to interrupt primetime television programming at a cost of hundreds of millions in ad revenues to the broadcast networks.", 
        "intTime": 20090512, 
        "postID": 19, 
        "quote": "Originally posted by 1WW: quote: Originally posted by L0A1: quote: Originally posted by 1WW: While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant. Trump and company investigated it all and pretty much said the media and left wingers were blowing it out of proportions. She had NO NUDE photos like what was being reported. I maintain that the controversy was not about her \"freedom of speech.\" The issue: had she broken her contract because she had taken part in speaking engagements that were not cleared/approved by the Miss California Pageant officials? Trump -- the publicity pig -- had to turn it into a circus. And yeah, I watched part of it live ... The only thing missing were waving flags, a marching band, and the Blue Angels.", 
        "reply": " The photos would have never surfaced if she hadn't practiced her freedom of speech during the pageant. She wouldn't have had the speaking engagements if her comments weren't blown out of proportion by the people who were trying to discredit her. So, yes, this issue is about her practicing her freedom of speech. Because if she would have \"checked her beliefs at the door\" no one would have cared anything about her. Oh, and in order for Trump to be considered a \"publicity pig\" all he was missing was a jar of grey poupon mustard, a couple of dozen teleprompters, and a \"request\" to interrupt primetime television programming at a cost of hundreds of millions in ad revenues to the broadcast networks.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 14:37:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I know a lot of you folks out there wished her the worse, but guess what, the worse ain't happening. Donald Trump defended her stance on Gay marraige and said she could keep her crown. \\ \"http://www3.signonsandiego.com/stories/2009/may/12/bn12prejean094235/?metro&zIndex=97998\" Good for her! 1. I could care less about that event or mrs whomever. 2. It's entertainment, that's all it is. I think at one time it use to be legitimate ,not any more. 3. How is this news?", 
        "intTime": 20090512, 
        "postID": 20, 
        "quote": "Originally posted by L0A1: I know a lot of you folks out there wished her the worse, but guess what, the worse ain't happening. Donald Trump defended her stance on Gay marraige and said she could keep her crown. \\ \"http://www3.signonsandiego.com/stories/2009/may/12/bn12prejean094235/?metro&zIndex=97998\" Good for her!", 
        "reply": " 1. I could care less about that event or mrs whomever. 2. It's entertainment, that's all it is. I think at one time it use to be legitimate ,not any more. 3. How is this news?", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 14:43:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I know a lot of you folks out there wished her the worse, but guess what, the worse ain't happening. Donald Trump defended her stance on Gay marraige and said she could keep her crown. \\ \"http://www3.signonsandiego.com/stories/2009/may/12/bn12prejean094235/?metro&zIndex=97998\" Good for her! Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 21, 
        "quote": "", 
        "reply": "I know a lot of you folks out there wished her the worse, but guess what, the worse ain't happening. Donald Trump defended her stance on Gay marraige and said she could keep her crown. \\ \"http://www3.signonsandiego.com/stories/2009/may/12/bn12prejean094235/?metro&zIndex=97998\" Good for her! Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 10:37:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "L0A1"
    }, 
    {
        "content": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090512, 
        "postID": 22, 
        "quote": "", 
        "reply": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 10:54:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "NSNN"
    }, 
    {
        "content": "Sweet, now I can get back to having a life.", 
        "intTime": 20090512, 
        "postID": 23, 
        "quote": "", 
        "reply": "Sweet, now I can get back to having a life.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 11:10:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "xnavycg"
    }, 
    {
        "content": "LOL....When are the gays ever going to learn? No one cares about your cause....", 
        "intTime": 20090512, 
        "postID": 24, 
        "quote": "", 
        "reply": "LOL....When are the gays ever going to learn? No one cares about your cause....", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 11:18:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause.... Though many do not want marraige redefined, most of the folks I talked to said they would support civil unions with the same rights as married folks. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 25, 
        "quote": "Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause....", 
        "reply": " Though many do not want marraige redefined, most of the folks I talked to said they would support civil unions with the same rights as married folks. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 11:37:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: Sweet, now I can get back to having a life. It never effected my life. I felt she was singled out because of her belief. Nothing more. Miss Rhode Island's photo's were much more racier, yet not a peep from the MSM or Left wingers. Again a double standard. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 26, 
        "quote": "Originally posted by xnavycg: Sweet, now I can get back to having a life.", 
        "reply": " It never effected my life. I felt she was singled out because of her belief. Nothing more. Miss Rhode Island's photo's were much more racier, yet not a peep from the MSM or Left wingers. Again a double standard. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 11:39:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause.... Though many do not want marraige redefined, most of the folks I talked to said they would support civil unions with the same rights as married folks. Question were Civil Unions/Marriages allowed in the Pre Christian Roman Empire/Ancient Greek Culture its especially noteworthy when in fact it wasn't taboo as its considered today to have homosexual tendancies by the public? And I agree it was defiantly a double standard by gay rights activists/Tinsletown Gutterwood folks.", 
        "intTime": 20090512, 
        "postID": 27, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause.... Though many do not want marraige redefined, most of the folks I talked to said they would support civil unions with the same rights as married folks.", 
        "reply": " Question were Civil Unions/Marriages allowed in the Pre Christian Roman Empire/Ancient Greek Culture its especially noteworthy when in fact it wasn't taboo as its considered today to have homosexual tendancies by the public? And I agree it was defiantly a double standard by gay rights activists/Tinsletown Gutterwood folks.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 12:21:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause.... Way to miss the point and make an ignorant comment at the same time.", 
        "intTime": 20090512, 
        "postID": 28, 
        "quote": "Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause....", 
        "reply": " Way to miss the point and make an ignorant comment at the same time.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 12:29:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause.... Way to miss the point and make an ignorant comment at the same time. I can say the same thing for your last post in the \"National Health Insurance\" topic.", 
        "intTime": 20090512, 
        "postID": 29, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause.... Way to miss the point and make an ignorant comment at the same time.", 
        "reply": " I can say the same thing for your last post in the \"National Health Insurance\" topic.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:03:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "stec74"
    }, 
    {
        "content": "yeah, if there's anyone I want defending marriage it's Trump with his 8 ex-wives and a fake-boobed bimbo. lame. Don't kid yourselves. He kept her around because he was loving the publicity.", 
        "intTime": 20090512, 
        "postID": 30, 
        "quote": "", 
        "reply": "yeah, if there's anyone I want defending marriage it's Trump with his 8 ex-wives and a fake-boobed bimbo. lame. Don't kid yourselves. He kept her around because he was loving the publicity.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:14:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: yeah, if there's anyone I want defending marriage it's Trump with his 8 ex-wives and a fake-boobed bimbo. lame. Don't kid yourselves. He kept her around because he was loving the publicity. Topic had nothing to do with Trumps view on marriage, stay on topic stop the distracting. He quote President Obama's view of the Gay Marraige issue. President Obama even stated that it should be betwen a man and a women. Guesss you want to argue that as well? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 31, 
        "quote": "Originally posted by Frank_A_Valdez: yeah, if there's anyone I want defending marriage it's Trump with his 8 ex-wives and a fake-boobed bimbo. lame. Don't kid yourselves. He kept her around because he was loving the publicity.", 
        "reply": " Topic had nothing to do with Trumps view on marriage, stay on topic stop the distracting. He quote President Obama's view of the Gay Marraige issue. President Obama even stated that it should be betwen a man and a women. Guesss you want to argue that as well? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:17:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "L0A1"
    }, 
    {
        "content": "The fact of the matter is he couldn't care less about anything other than the buzz. Anything to keep his name out there- c'mon. He's probably BEGGING her to go out and make some more stupid comments to roil up more controversy. When has anybody paid so much attention to the Miss USA pageant before? Build a buzz-- will he or won't he? when is Trump going to have his say! keep everyone on tenterhooks. Lol. you conservatives are so desperate for validation you'll resort to Trump and his stellar track record re: marriage! lol. lol. I honestly can't hold in the laughter.", 
        "intTime": 20090512, 
        "postID": 32, 
        "quote": "", 
        "reply": "The fact of the matter is he couldn't care less about anything other than the buzz. Anything to keep his name out there- c'mon. He's probably BEGGING her to go out and make some more stupid comments to roil up more controversy. When has anybody paid so much attention to the Miss USA pageant before? Build a buzz-- will he or won't he? when is Trump going to have his say! keep everyone on tenterhooks. Lol. you conservatives are so desperate for validation you'll resort to Trump and his stellar track record re: marriage! lol. lol. I honestly can't hold in the laughter.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:35:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: The fact of the matter is he couldn't care less about anything other than the buzz. Anything to keep his name out there- c'mon. He's probably BEGGING her to go out and make some more stupid comments to roil up more controversy. When has anybody paid so much attention to the Miss USA pageant before? Build a buzz-- will he or won't he? when is Trump going to have his say! keep everyone on tenterhooks. Lol. you conservatives are so desperate for validation you'll resort to Trump and his stellar track record re: marriage! lol. lol. I honestly can't hold in the laughter. Again, you missed the point. This wasn't about conservative beliefs, this was about her RIGHT TO FREEDOM OF SPEECH. I see you LEECHING onto the political thing again. Can you stay off your partisan wagon and actually post something related to the topic. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 33, 
        "quote": "Originally posted by Frank_A_Valdez: The fact of the matter is he couldn't care less about anything other than the buzz. Anything to keep his name out there- c'mon. He's probably BEGGING her to go out and make some more stupid comments to roil up more controversy. When has anybody paid so much attention to the Miss USA pageant before? Build a buzz-- will he or won't he? when is Trump going to have his say! keep everyone on tenterhooks. Lol. you conservatives are so desperate for validation you'll resort to Trump and his stellar track record re: marriage! lol. lol. I honestly can't hold in the laughter.", 
        "reply": " Again, you missed the point. This wasn't about conservative beliefs, this was about her RIGHT TO FREEDOM OF SPEECH. I see you LEECHING onto the political thing again. Can you stay off your partisan wagon and actually post something related to the topic. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:41:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Again a double standard. double standard? Tell me it ain't so.... I am shocked to think there is such a thing... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090512, 
        "postID": 34, 
        "quote": "Originally posted by L0A1: Again a double standard.", 
        "reply": " double standard? Tell me it ain't so.... I am shocked to think there is such a thing... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:52:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant.", 
        "intTime": 20090512, 
        "postID": 35, 
        "quote": "Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet.", 
        "reply": "While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following?  <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:53:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant. Trump and company investigated it all and pretty much said the media and left wingers were blowing it out of proportions. She had NO NUDE photos like what was being reported. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 36, 
        "quote": "Originally posted by 1WW: While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant.", 
        "reply": " Trump and company investigated it all and pretty much said the media and left wingers were blowing it out of proportions. She had NO NUDE photos like what was being reported. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 14:02:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by 1WW: While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant. Trump and company investigated it all and pretty much said the media and left wingers were blowing it out of proportions. She had NO NUDE photos like what was being reported. I maintain that the controversy was not about her \"freedom of speech.\" The issue: had she broken her contract because she had taken part in speaking engagements that were not cleared/approved by the Miss California Pageant officials? Trump -- the publicity pig -- had to turn it into a circus. And yeah, I watched part of it live ... The only thing missing were waving flags, a marching band, and the Blue Angels.", 
        "intTime": 20090512, 
        "postID": 37, 
        "quote": "Originally posted by L0A1: quote: Originally posted by 1WW: While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant. Trump and company investigated it all and pretty much said the media and left wingers were blowing it out of proportions. She had NO NUDE photos like what was being reported.", 
        "reply": " I maintain that the controversy was not about her \"freedom of speech.\" The issue: had she broken her contract because she had taken part in speaking engagements that were not cleared/approved by the Miss California Pageant officials? Trump -- the publicity pig -- had to turn it into a circus. And yeah, I watched part of it live ... The only thing missing were waving flags, a marching band, and the Blue Angels.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 14:15:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "1WW"
    }, 
    {
        "content": "I wonder what the Taliban think of all this fuss over gay marriage?", 
        "intTime": 20090512, 
        "postID": 38, 
        "quote": "", 
        "reply": "I wonder what the Taliban think of all this fuss over gay marriage?", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 14:30:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by L0A1: quote: Originally posted by 1WW: While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant. Trump and company investigated it all and pretty much said the media and left wingers were blowing it out of proportions. She had NO NUDE photos like what was being reported. I maintain that the controversy was not about her \"freedom of speech.\" The issue: had she broken her contract because she had taken part in speaking engagements that were not cleared/approved by the Miss California Pageant officials? Trump -- the publicity pig -- had to turn it into a circus. And yeah, I watched part of it live ... The only thing missing were waving flags, a marching band, and the Blue Angels. The photos would have never surfaced if she hadn't practiced her freedom of speech during the pageant. She wouldn't have had the speaking engagements if her comments weren't blown out of proportion by the people who were trying to discredit her. So, yes, this issue is about her practicing her freedom of speech. Because if she would have \"checked her beliefs at the door\" no one would have cared anything about her. Oh, and in order for Trump to be considered a \"publicity pig\" all he was missing was a jar of grey poupon mustard, a couple of dozen teleprompters, and a \"request\" to interrupt primetime television programming at a cost of hundreds of millions in ad revenues to the broadcast networks.", 
        "intTime": 20090512, 
        "postID": 39, 
        "quote": "Originally posted by 1WW: quote: Originally posted by L0A1: quote: Originally posted by 1WW: While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant. Trump and company investigated it all and pretty much said the media and left wingers were blowing it out of proportions. She had NO NUDE photos like what was being reported. I maintain that the controversy was not about her \"freedom of speech.\" The issue: had she broken her contract because she had taken part in speaking engagements that were not cleared/approved by the Miss California Pageant officials? Trump -- the publicity pig -- had to turn it into a circus. And yeah, I watched part of it live ... The only thing missing were waving flags, a marching band, and the Blue Angels.", 
        "reply": " The photos would have never surfaced if she hadn't practiced her freedom of speech during the pageant. She wouldn't have had the speaking engagements if her comments weren't blown out of proportion by the people who were trying to discredit her. So, yes, this issue is about her practicing her freedom of speech. Because if she would have \"checked her beliefs at the door\" no one would have cared anything about her. Oh, and in order for Trump to be considered a \"publicity pig\" all he was missing was a jar of grey poupon mustard, a couple of dozen teleprompters, and a \"request\" to interrupt primetime television programming at a cost of hundreds of millions in ad revenues to the broadcast networks.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 14:37:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I know a lot of you folks out there wished her the worse, but guess what, the worse ain't happening. Donald Trump defended her stance on Gay marraige and said she could keep her crown. \\ \"http://www3.signonsandiego.com/stories/2009/may/12/bn12prejean094235/?metro&zIndex=97998\" Good for her! 1. I could care less about that event or mrs whomever. 2. It's entertainment, that's all it is. I think at one time it use to be legitimate ,not any more. 3. How is this news?", 
        "intTime": 20090512, 
        "postID": 40, 
        "quote": "Originally posted by L0A1: I know a lot of you folks out there wished her the worse, but guess what, the worse ain't happening. Donald Trump defended her stance on Gay marraige and said she could keep her crown. \\ \"http://www3.signonsandiego.com/stories/2009/may/12/bn12prejean094235/?metro&zIndex=97998\" Good for her!", 
        "reply": " 1. I could care less about that event or mrs whomever. 2. It's entertainment, that's all it is. I think at one time it use to be legitimate ,not any more. 3. How is this news?", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 14:43:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I know a lot of you folks out there wished her the worse, but guess what, the worse ain't happening. Donald Trump defended her stance on Gay marraige and said she could keep her crown. \\ \"http://www3.signonsandiego.com/stories/2009/may/12/bn12prejean094235/?metro&zIndex=97998\" Good for her! Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 41, 
        "quote": "", 
        "reply": "I know a lot of you folks out there wished her the worse, but guess what, the worse ain't happening. Donald Trump defended her stance on Gay marraige and said she could keep her crown. \\ \"http://www3.signonsandiego.com/stories/2009/may/12/bn12prejean094235/?metro&zIndex=97998\" Good for her! Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 10:37:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "L0A1"
    }, 
    {
        "content": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090512, 
        "postID": 42, 
        "quote": "", 
        "reply": "\"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 10:54:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "NSNN"
    }, 
    {
        "content": "Sweet, now I can get back to having a life.", 
        "intTime": 20090512, 
        "postID": 43, 
        "quote": "", 
        "reply": "Sweet, now I can get back to having a life.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 11:10:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "xnavycg"
    }, 
    {
        "content": "LOL....When are the gays ever going to learn? No one cares about your cause....", 
        "intTime": 20090512, 
        "postID": 44, 
        "quote": "", 
        "reply": "LOL....When are the gays ever going to learn? No one cares about your cause....", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 11:18:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause.... Though many do not want marraige redefined, most of the folks I talked to said they would support civil unions with the same rights as married folks. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 45, 
        "quote": "Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause....", 
        "reply": " Though many do not want marraige redefined, most of the folks I talked to said they would support civil unions with the same rights as married folks. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 11:37:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by xnavycg: Sweet, now I can get back to having a life. It never effected my life. I felt she was singled out because of her belief. Nothing more. Miss Rhode Island's photo's were much more racier, yet not a peep from the MSM or Left wingers. Again a double standard. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 46, 
        "quote": "Originally posted by xnavycg: Sweet, now I can get back to having a life.", 
        "reply": " It never effected my life. I felt she was singled out because of her belief. Nothing more. Miss Rhode Island's photo's were much more racier, yet not a peep from the MSM or Left wingers. Again a double standard. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 11:39:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause.... Though many do not want marraige redefined, most of the folks I talked to said they would support civil unions with the same rights as married folks. Question were Civil Unions/Marriages allowed in the Pre Christian Roman Empire/Ancient Greek Culture its especially noteworthy when in fact it wasn't taboo as its considered today to have homosexual tendancies by the public? And I agree it was defiantly a double standard by gay rights activists/Tinsletown Gutterwood folks.", 
        "intTime": 20090512, 
        "postID": 47, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause.... Though many do not want marraige redefined, most of the folks I talked to said they would support civil unions with the same rights as married folks.", 
        "reply": " Question were Civil Unions/Marriages allowed in the Pre Christian Roman Empire/Ancient Greek Culture its especially noteworthy when in fact it wasn't taboo as its considered today to have homosexual tendancies by the public? And I agree it was defiantly a double standard by gay rights activists/Tinsletown Gutterwood folks.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 12:21:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause.... Way to miss the point and make an ignorant comment at the same time.", 
        "intTime": 20090512, 
        "postID": 48, 
        "quote": "Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause....", 
        "reply": " Way to miss the point and make an ignorant comment at the same time.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 12:29:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause.... Way to miss the point and make an ignorant comment at the same time. I can say the same thing for your last post in the \"National Health Insurance\" topic.", 
        "intTime": 20090512, 
        "postID": 49, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Irwin_R_Schyster: LOL....When are the gays ever going to learn? No one cares about your cause.... Way to miss the point and make an ignorant comment at the same time.", 
        "reply": " I can say the same thing for your last post in the \"National Health Insurance\" topic.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:03:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "stec74"
    }, 
    {
        "content": "yeah, if there's anyone I want defending marriage it's Trump with his 8 ex-wives and a fake-boobed bimbo. lame. Don't kid yourselves. He kept her around because he was loving the publicity.", 
        "intTime": 20090512, 
        "postID": 50, 
        "quote": "", 
        "reply": "yeah, if there's anyone I want defending marriage it's Trump with his 8 ex-wives and a fake-boobed bimbo. lame. Don't kid yourselves. He kept her around because he was loving the publicity.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:14:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: yeah, if there's anyone I want defending marriage it's Trump with his 8 ex-wives and a fake-boobed bimbo. lame. Don't kid yourselves. He kept her around because he was loving the publicity. Topic had nothing to do with Trumps view on marriage, stay on topic stop the distracting. He quote President Obama's view of the Gay Marraige issue. President Obama even stated that it should be betwen a man and a women. Guesss you want to argue that as well? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 51, 
        "quote": "Originally posted by Frank_A_Valdez: yeah, if there's anyone I want defending marriage it's Trump with his 8 ex-wives and a fake-boobed bimbo. lame. Don't kid yourselves. He kept her around because he was loving the publicity.", 
        "reply": " Topic had nothing to do with Trumps view on marriage, stay on topic stop the distracting. He quote President Obama's view of the Gay Marraige issue. President Obama even stated that it should be betwen a man and a women. Guesss you want to argue that as well? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:17:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "L0A1"
    }, 
    {
        "content": "The fact of the matter is he couldn't care less about anything other than the buzz. Anything to keep his name out there- c'mon. He's probably BEGGING her to go out and make some more stupid comments to roil up more controversy. When has anybody paid so much attention to the Miss USA pageant before? Build a buzz-- will he or won't he? when is Trump going to have his say! keep everyone on tenterhooks. Lol. you conservatives are so desperate for validation you'll resort to Trump and his stellar track record re: marriage! lol. lol. I honestly can't hold in the laughter.", 
        "intTime": 20090512, 
        "postID": 52, 
        "quote": "", 
        "reply": "The fact of the matter is he couldn't care less about anything other than the buzz. Anything to keep his name out there- c'mon. He's probably BEGGING her to go out and make some more stupid comments to roil up more controversy. When has anybody paid so much attention to the Miss USA pageant before? Build a buzz-- will he or won't he? when is Trump going to have his say! keep everyone on tenterhooks. Lol. you conservatives are so desperate for validation you'll resort to Trump and his stellar track record re: marriage! lol. lol. I honestly can't hold in the laughter.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:35:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "Frank_A_Valdez"
    }, 
    {
        "content": "quote: Originally posted by Frank_A_Valdez: The fact of the matter is he couldn't care less about anything other than the buzz. Anything to keep his name out there- c'mon. He's probably BEGGING her to go out and make some more stupid comments to roil up more controversy. When has anybody paid so much attention to the Miss USA pageant before? Build a buzz-- will he or won't he? when is Trump going to have his say! keep everyone on tenterhooks. Lol. you conservatives are so desperate for validation you'll resort to Trump and his stellar track record re: marriage! lol. lol. I honestly can't hold in the laughter. Again, you missed the point. This wasn't about conservative beliefs, this was about her RIGHT TO FREEDOM OF SPEECH. I see you LEECHING onto the political thing again. Can you stay off your partisan wagon and actually post something related to the topic. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 53, 
        "quote": "Originally posted by Frank_A_Valdez: The fact of the matter is he couldn't care less about anything other than the buzz. Anything to keep his name out there- c'mon. He's probably BEGGING her to go out and make some more stupid comments to roil up more controversy. When has anybody paid so much attention to the Miss USA pageant before? Build a buzz-- will he or won't he? when is Trump going to have his say! keep everyone on tenterhooks. Lol. you conservatives are so desperate for validation you'll resort to Trump and his stellar track record re: marriage! lol. lol. I honestly can't hold in the laughter.", 
        "reply": " Again, you missed the point. This wasn't about conservative beliefs, this was about her RIGHT TO FREEDOM OF SPEECH. I see you LEECHING onto the political thing again. Can you stay off your partisan wagon and actually post something related to the topic. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:41:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Again a double standard. double standard? Tell me it ain't so.... I am shocked to think there is such a thing... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090512, 
        "postID": 54, 
        "quote": "Originally posted by L0A1: Again a double standard.", 
        "reply": " double standard? Tell me it ain't so.... I am shocked to think there is such a thing... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:52:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant.", 
        "intTime": 20090512, 
        "postID": 55, 
        "quote": "Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet.", 
        "reply": "While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following?  <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 13:53:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "1WW"
    }, 
    {
        "content": "quote: Originally posted by 1WW: While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant. Trump and company investigated it all and pretty much said the media and left wingers were blowing it out of proportions. She had NO NUDE photos like what was being reported. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090512, 
        "postID": 56, 
        "quote": "Originally posted by 1WW: While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant.", 
        "reply": " Trump and company investigated it all and pretty much said the media and left wingers were blowing it out of proportions. She had NO NUDE photos like what was being reported. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 14:02:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by 1WW: While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant. Trump and company investigated it all and pretty much said the media and left wingers were blowing it out of proportions. She had NO NUDE photos like what was being reported. I maintain that the controversy was not about her \"freedom of speech.\" The issue: had she broken her contract because she had taken part in speaking engagements that were not cleared/approved by the Miss California Pageant officials? Trump -- the publicity pig -- had to turn it into a circus. And yeah, I watched part of it live ... The only thing missing were waving flags, a marching band, and the Blue Angels.", 
        "intTime": 20090512, 
        "postID": 57, 
        "quote": "Originally posted by L0A1: quote: Originally posted by 1WW: While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant. Trump and company investigated it all and pretty much said the media and left wingers were blowing it out of proportions. She had NO NUDE photos like what was being reported.", 
        "reply": " I maintain that the controversy was not about her \"freedom of speech.\" The issue: had she broken her contract because she had taken part in speaking engagements that were not cleared/approved by the Miss California Pageant officials? Trump -- the publicity pig -- had to turn it into a circus. And yeah, I watched part of it live ... The only thing missing were waving flags, a marching band, and the Blue Angels.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 14:15:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "1WW"
    }, 
    {
        "content": "I wonder what the Taliban think of all this fuss over gay marriage?", 
        "intTime": 20090512, 
        "postID": 58, 
        "quote": "", 
        "reply": "I wonder what the Taliban think of all this fuss over gay marriage?", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 14:30:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by 1WW: quote: Originally posted by L0A1: quote: Originally posted by 1WW: While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant. Trump and company investigated it all and pretty much said the media and left wingers were blowing it out of proportions. She had NO NUDE photos like what was being reported. I maintain that the controversy was not about her \"freedom of speech.\" The issue: had she broken her contract because she had taken part in speaking engagements that were not cleared/approved by the Miss California Pageant officials? Trump -- the publicity pig -- had to turn it into a circus. And yeah, I watched part of it live ... The only thing missing were waving flags, a marching band, and the Blue Angels. The photos would have never surfaced if she hadn't practiced her freedom of speech during the pageant. She wouldn't have had the speaking engagements if her comments weren't blown out of proportion by the people who were trying to discredit her. So, yes, this issue is about her practicing her freedom of speech. Because if she would have \"checked her beliefs at the door\" no one would have cared anything about her. Oh, and in order for Trump to be considered a \"publicity pig\" all he was missing was a jar of grey poupon mustard, a couple of dozen teleprompters, and a \"request\" to interrupt primetime television programming at a cost of hundreds of millions in ad revenues to the broadcast networks.", 
        "intTime": 20090512, 
        "postID": 59, 
        "quote": "Originally posted by 1WW: quote: Originally posted by L0A1: quote: Originally posted by 1WW: While it can be said that Carrie Prejean's career has actually been given a boost because of this \"controversy\" ... wasn't the reason her \"crown\" was jeopardy the following? quote: Neal said Tuesday that Prejean had run afoul of several parts of the 12-page contract that all prospective contestants were required to sign before competing in the November state contest. The detailed document -- which gives pageant officials nearly unlimited control of the title holder's activities -- prohibits Miss California from making personal appearances, giving interviews or making commercials without permission from pageant officials, Us confirms. In the last two weeks, Prejean, 21, has made televised appearances at her local church in San Diego and on behalf of the National Organization for Marriage, a group opposed to same-sex marriage. The contract also contains a clause asking participants to acknowledge whether they have conducted themselves \"in accordance with the highest ethical and moral standards.\" As an example, it asks if they have ever been photographed nude or partially nude. On Monday, racy photos of Prejean -- wearing nothing but pink underwear and covering her breast with her back turned -- were leaked on the Internet. <http://www.usmagazine.com/news/miss-california-officials-might-strip-carrie-prejean-of-title-200955> The controversy wasn't a \"freedom of speech\" issue, though Trump -- the publicity pig -- turned it into that. The question was whether she had broken her contract with the Miss California pageant. Trump and company investigated it all and pretty much said the media and left wingers were blowing it out of proportions. She had NO NUDE photos like what was being reported. I maintain that the controversy was not about her \"freedom of speech.\" The issue: had she broken her contract because she had taken part in speaking engagements that were not cleared/approved by the Miss California Pageant officials? Trump -- the publicity pig -- had to turn it into a circus. And yeah, I watched part of it live ... The only thing missing were waving flags, a marching band, and the Blue Angels.", 
        "reply": " The photos would have never surfaced if she hadn't practiced her freedom of speech during the pageant. She wouldn't have had the speaking engagements if her comments weren't blown out of proportion by the people who were trying to discredit her. So, yes, this issue is about her practicing her freedom of speech. Because if she would have \"checked her beliefs at the door\" no one would have cared anything about her. Oh, and in order for Trump to be considered a \"publicity pig\" all he was missing was a jar of grey poupon mustard, a couple of dozen teleprompters, and a \"request\" to interrupt primetime television programming at a cost of hundreds of millions in ad revenues to the broadcast networks.", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 14:37:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by L0A1: I know a lot of you folks out there wished her the worse, but guess what, the worse ain't happening. Donald Trump defended her stance on Gay marraige and said she could keep her crown. \\ \"http://www3.signonsandiego.com/stories/2009/may/12/bn12prejean094235/?metro&zIndex=97998\" Good for her! 1. I could care less about that event or mrs whomever. 2. It's entertainment, that's all it is. I think at one time it use to be legitimate ,not any more. 3. How is this news?", 
        "intTime": 20090512, 
        "postID": 60, 
        "quote": "Originally posted by L0A1: I know a lot of you folks out there wished her the worse, but guess what, the worse ain't happening. Donald Trump defended her stance on Gay marraige and said she could keep her crown. \\ \"http://www3.signonsandiego.com/stories/2009/may/12/bn12prejean094235/?metro&zIndex=97998\" Good for her!", 
        "reply": " 1. I could care less about that event or mrs whomever. 2. It's entertainment, that's all it is. I think at one time it use to be legitimate ,not any more. 3. How is this news?", 
        "threadID": "672198221_8520031322001", 
        "time": "2009-05-12 14:43:00", 
        "title": "Miss California keeps her Crown, Donald Trump has Spoken.", 
        "userID": "crackerjacks61"
    }
]