[
    {
        "content": "Health and Human Services nominee, Kahtleen Sebelius just got finished paying more than $7000.00 in unpaid back taxes. Her husband is a Federal Judge! Now I can see why Obama is spending Trillions of our money in hopes that our economy will recover. If all the Democraps pay their unpaid taxes up maybe that will put a few trillion back into our Federal budget?", 
        "intTime": 20090401, 
        "postID": 1, 
        "quote": "", 
        "reply": "Health and Human Services nominee, Kahtleen Sebelius just got finished paying more than $7000.00 in unpaid back taxes. Her husband is a Federal Judge! Now I can see why Obama is spending Trillions of our money in hopes that our economy will recover. If all the Democraps pay their unpaid taxes up maybe that will put a few trillion back into our Federal budget?", 
        "threadID": "672198221_5980005912001", 
        "time": "2009-04-01 03:01:00", 
        "title": "Another Obama pick has to pay up back taxes.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Sarah Palin owed thousands in back taxes but I bet you voted for her. Even John McCain owed back taxes. I guess those two get a pass though, right? This message has been edited. Last edited by: jrnh5150, Wed 01 April 2009 03:44 AM \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090401, 
        "postID": 2, 
        "quote": "", 
        "reply": "Sarah Palin owed thousands in back taxes but I bet you voted for her. Even John McCain owed back taxes. I guess those two get a pass though, right? This message has been edited. Last edited by: jrnh5150, Wed 01 April 2009 03:44 AM \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "672198221_5980005912001", 
        "time": "2009-04-01 03:20:00", 
        "title": "Another Obama pick has to pay up back taxes.", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "Yes I did vote for her. Not because she owed back taxes but because she was smart and had many years of experience and leadership skills. Besides her back taxes were a result of H&R Block screwing up not her.", 
        "intTime": 20090401, 
        "postID": 3, 
        "quote": "", 
        "reply": "Yes I did vote for her. Not because she owed back taxes but because she was smart and had many years of experience and leadership skills. Besides her back taxes were a result of H&R Block screwing up not her.", 
        "threadID": "672198221_5980005912001", 
        "time": "2009-04-01 03:40:00", 
        "title": "Another Obama pick has to pay up back taxes.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Yes I did vote for her. Not because she owed back taxes but because she was smart and had many years of experience and leadership skills. Besides her back taxes were a result of H&R Block screwing up not her. Is she not responsible for her own taxes??? She signed the form didn't she? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090401, 
        "postID": 4, 
        "quote": "Originally posted by Duster6: Yes I did vote for her. Not because she owed back taxes but because she was smart and had many years of experience and leadership skills. Besides her back taxes were a result of H&R Block screwing up not her.", 
        "reply": " Is she not responsible for her own taxes??? She signed the form didn't she? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "672198221_5980005912001", 
        "time": "2009-04-01 03:45:00", 
        "title": "Another Obama pick has to pay up back taxes.", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "If one has a lot of personal financial activity going on, it's pretty simple to miss a total of $7k over a period of three years. And for the Sebelius family, $7000 is nothing. To her credit, she did a scrub to make sure everything was okay - far as I'm concerned, no one should be howling about such a relatively small amount.", 
        "intTime": 20090401, 
        "postID": 5, 
        "quote": "", 
        "reply": "If one has a lot of personal financial activity going on, it's pretty simple to miss a total of $7k over a period of three years. And for the Sebelius family, $7000 is nothing. To her credit, she did a scrub to make sure everything was okay - far as I'm concerned, no one should be howling about such a relatively small amount.", 
        "threadID": "672198221_5980005912001", 
        "time": "2009-04-01 04:08:00", 
        "title": "Another Obama pick has to pay up back taxes.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by jrnh5150: quote: Originally posted by Duster6: Yes I did vote for her. Not because she owed back taxes but because she was smart and had many years of experience and leadership skills. Besides her back taxes were a result of H&R Block screwing up not her. Is she not responsible for her own taxes??? She signed the form didn't she? Yes she did but she signed with the assumption that the preparer knew what he was doing. Unlike me, I lie and cheat every year hoping I won't get caught. So far I have only been caught two times in the past 33 years.", 
        "intTime": 20090401, 
        "postID": 6, 
        "quote": "Originally posted by jrnh5150: quote: Originally posted by Duster6: Yes I did vote for her. Not because she owed back taxes but because she was smart and had many years of experience and leadership skills. Besides her back taxes were a result of H&R Block screwing up not her. Is she not responsible for her own taxes??? She signed the form didn't she?", 
        "reply": " Yes she did but she signed with the assumption that the preparer knew what he was doing. Unlike me, I lie and cheat every year hoping I won't get caught. So far I have only been caught two times in the past 33 years.", 
        "threadID": "672198221_5980005912001", 
        "time": "2009-04-01 05:34:00", 
        "title": "Another Obama pick has to pay up back taxes.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by jrnh5150: quote: Originally posted by Duster6: Yes I did vote for her. Not because she owed back taxes but because she was smart and had many years of experience and leadership skills. Besides her back taxes were a result of H&R Block screwing up not her. Is she not responsible for her own taxes??? She signed the form didn't she? Yes she did but she signed with the assumption that the preparer knew what he was doing. Unlike me, I lie and cheat every year hoping I won't get caught. So far I have only been caught two times in the past 33 years. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090402, 
        "postID": 7, 
        "quote": "Originally posted by Duster6: quote: Originally posted by jrnh5150: quote: Originally posted by Duster6: Yes I did vote for her. Not because she owed back taxes but because she was smart and had many years of experience and leadership skills. Besides her back taxes were a result of H&R Block screwing up not her. Is she not responsible for her own taxes??? She signed the form didn't she? Yes she did but she signed with the assumption that the preparer knew what he was doing. Unlike me, I lie and cheat every year hoping I won't get caught. So far I have only been caught two times in the past 33 years.", 
        "reply": " \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "672198221_5980005912001", 
        "time": "2009-04-02 12:13:00", 
        "title": "Another Obama pick has to pay up back taxes.", 
        "userID": "jrnh5150"
    }
]