[
    {
        "content": "OMAHA, Neb. -- Tim Mechaley trained fellow Marines to fire .50-caliber machine guns. He qualified as a marksman. He fought in the battle for Fallujah and received a combat medal with a \"V\" for valor. Back home, he uses a rifle for target shooting. Yet, when Mechaley sought to buy a 9-mm Ruger pistol for protection at his midtown apartment, the Omaha Police Department rejected his application for a gun permit. \"I was trusted by the {federal} government to carry a loaded weapon, but now I am not allowed to purchase one by my local government,\" he said. Mechaley, 32, has received counseling for post-traumatic stress disorder related to his service in Iraq. While completing an application for a gun permit, he responded \"yes\" to a question that asked whether he was being treated for a mental disorder. \"I circled yes because I wanted to be completely honest,\" he said. As explanation, he wrote \"PTSD from Iraq Marine combat veteran\" on the form. Mechaley's application on Jan. 10 was rejected, he was told, because of that answer. After talking with police, Mechaley said he had been \"too truthful\" on the application. Read the rest here \"http://www.military.com/news/article/vet-denied-gun-permit-over-ptsd-care.html?col=1186032366495\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090307, 
        "postID": 1, 
        "quote": "", 
        "reply": "OMAHA, Neb. -- Tim Mechaley trained fellow Marines to fire .50-caliber machine guns. He qualified as a marksman. He fought in the battle for Fallujah and received a combat medal with a \"V\" for valor. Back home, he uses a rifle for target shooting. Yet, when Mechaley sought to buy a 9-mm Ruger pistol for protection at his midtown apartment, the Omaha Police Department rejected his application for a gun permit. \"I was trusted by the {federal} government to carry a loaded weapon, but now I am not allowed to purchase one by my local government,\" he said. Mechaley, 32, has received counseling for post-traumatic stress disorder related to his service in Iraq. While completing an application for a gun permit, he responded \"yes\" to a question that asked whether he was being treated for a mental disorder. \"I circled yes because I wanted to be completely honest,\" he said. As explanation, he wrote \"PTSD from Iraq Marine combat veteran\" on the form. Mechaley's application on Jan. 10 was rejected, he was told, because of that answer. After talking with police, Mechaley said he had been \"too truthful\" on the application. Read the rest here \"http://www.military.com/news/article/vet-denied-gun-permit-over-ptsd-care.html?col=1186032366495\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-07 20:00:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "Anbar7"
    }, 
    {
        "content": "What do ya'll think? I don't believe that it should have gone like that. If it got out that everybody who had PTSD could not own a gun, I wouldn't put down on the form that I did. Mechaley has a point when he says that he was trusted by the government to carry a loaded weapon, but can't buy one from his local government. Don't think it is right. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090307, 
        "postID": 2, 
        "quote": "", 
        "reply": "What do ya'll think? I don't believe that it should have gone like that. If it got out that everybody who had PTSD could not own a gun, I wouldn't put down on the form that I did. Mechaley has a point when he says that he was trusted by the government to carry a loaded weapon, but can't buy one from his local government. Don't think it is right. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-07 20:02:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "Anbar7"
    }, 
    {
        "content": "you did right by being truthful - always be that.. but what did you expect? The rules are the rules and the line has to be drawn somewhere... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090307, 
        "postID": 3, 
        "quote": "", 
        "reply": "you did right by being truthful - always be that.. but what did you expect? The rules are the rules and the line has to be drawn somewhere... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-07 20:05:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "I was diagnosed as having symptoms of PTSD about 15 years ago. Don't receive any compensation for it, but I get 30% for being blind in one eye and other ****e. I have had a concealed weapons permit in 3 different states, including Florida where I was diagnosed with PTSD. My wife and friends know of the really stupid stuff I have done before I was treated with medications. That's behind me now. But having PTSD didn't make me stupid. Each time I fill out any form that asks if I have a \"mental condition\", \"disorder\", or whatever, DO YOU THINK I'M GOING ANSWER \"YES\"? Yeah sure I want to stand straight and look the guy in the eye and tell the truth. But there would be a real good chance I would not receive the gun, or be issued the permit. Life sucks. Deal with it.", 
        "intTime": 20090307, 
        "postID": 4, 
        "quote": "", 
        "reply": "I was diagnosed as having symptoms of PTSD about 15 years ago. Don't receive any compensation for it, but I get 30% for being blind in one eye and other ****e. I have had a concealed weapons permit in 3 different states, including Florida where I was diagnosed with PTSD. My wife and friends know of the really stupid stuff I have done before I was treated with medications. That's behind me now. But having PTSD didn't make me stupid. Each time I fill out any form that asks if I have a \"mental condition\", \"disorder\", or whatever, DO YOU THINK I'M GOING ANSWER \"YES\"? Yeah sure I want to stand straight and look the guy in the eye and tell the truth. But there would be a real good chance I would not receive the gun, or be issued the permit. Life sucks. Deal with it.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-07 20:34:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "badmac933"
    }, 
    {
        "content": "Some states are what they call a \"Shall Issue\" state. What that means is that unless there is a reason NOT to give you a permit (felony, domestic conviction, etc...) they by law have to give you the permit. Perhaps Nebraska is not one of those States? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090307, 
        "postID": 5, 
        "quote": "", 
        "reply": "Some states are what they call a \"Shall Issue\" state. What that means is that unless there is a reason NOT to give you a permit (felony, domestic conviction, etc...) they by law have to give you the permit. Perhaps Nebraska is not one of those States? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-07 23:30:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "quote: Originally posted by jrnh5150: Some states are what they call a \"Shall Issue\" state. What that means is that unless there is a reason NOT to give you a permit (felony, domestic conviction, etc...) they by law have to give you the permit. Perhaps Nebraska is not one of those States? Or perhaps they consider PTSD to be one of those reasons to not give a permit.", 
        "intTime": 20090307, 
        "postID": 6, 
        "quote": "Originally posted by jrnh5150: Some states are what they call a \"Shall Issue\" state. What that means is that unless there is a reason NOT to give you a permit (felony, domestic conviction, etc...) they by law have to give you the permit. Perhaps Nebraska is not one of those States?", 
        "reply": " Or perhaps they consider PTSD to be one of those reasons to not give a permit.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-07 23:43:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Omaha PD is just avoiding potential future lawsuits. Understandable.", 
        "intTime": 20090308, 
        "postID": 7, 
        "quote": "", 
        "reply": "Omaha PD is just avoiding potential future lawsuits. Understandable.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 05:47:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "vsibaby"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: What do ya'll think? I don't believe that it should have gone like that. If it got out that everybody who had PTSD could not own a gun, I wouldn't put down on the form that I did. Mechaley has a point when he says that he was trusted by the government to carry a loaded weapon, but can't buy one from his local government. Don't think it is right. Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not?", 
        "intTime": 20090308, 
        "postID": 8, 
        "quote": "Originally posted by Anbar7: What do ya'll think? I don't believe that it should have gone like that. If it got out that everybody who had PTSD could not own a gun, I wouldn't put down on the form that I did. Mechaley has a point when he says that he was trusted by the government to carry a loaded weapon, but can't buy one from his local government. Don't think it is right.", 
        "reply": " Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not?", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 06:06:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Well, then I guess if he wanted one from Omaha, GEN Ham (CG of USAREUR) probably wouldn't be able to get one. He and another GO went public with their own mental health issues after deployments and their subsequent counseling (I don't know for a fact if he was diagnosed with PTSD, but from his own descriptions, it's a fairly safe bet). That was their own effort to get the Army to come around to reality and stop stigmatizing those who seek mental health counseling. Having PTSD isn't inherently any more dangerous than having TB. Both conditions can be dangerous to others under certain circumstances, but not all those with PTSD ever require hospitalization, multiple medications or other factors that can make the diagnosis riskier. Those with severe PTSD are more likely to harm themselves than others. I am generally in favor of gun control, but this is not a second amendment issue - it's a matter of a Nanny State run amok. Give the guy his permit!", 
        "intTime": 20090308, 
        "postID": 9, 
        "quote": "", 
        "reply": "Well, then I guess if he wanted one from Omaha, GEN Ham (CG of USAREUR) probably wouldn't be able to get one. He and another GO went public with their own mental health issues after deployments and their subsequent counseling (I don't know for a fact if he was diagnosed with PTSD, but from his own descriptions, it's a fairly safe bet). That was their own effort to get the Army to come around to reality and stop stigmatizing those who seek mental health counseling. Having PTSD isn't inherently any more dangerous than having TB. Both conditions can be dangerous to others under certain circumstances, but not all those with PTSD ever require hospitalization, multiple medications or other factors that can make the diagnosis riskier. Those with severe PTSD are more likely to harm themselves than others. I am generally in favor of gun control, but this is not a second amendment issue - it's a matter of a Nanny State run amok. Give the guy his permit!", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 06:09:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not? ABSOLUTELY NOT!!! SOME of those with PTSD are mentally unstable (they usually have other issues as well, such as alcohol or substance abuse, or other mental health diagnoses) ... MOST are quite mentally stable, but need help dealing with the anxiety, hypervigilance, nightmares, and feelings that are involved with PTSD.", 
        "intTime": 20090308, 
        "postID": 10, 
        "quote": "Originally posted by crackerjacks61: Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not?", 
        "reply": " ABSOLUTELY NOT!!! SOME of those with PTSD are mentally unstable (they usually have other issues as well, such as alcohol or substance abuse, or other mental health diagnoses) ... MOST are quite mentally stable, but need help dealing with the anxiety, hypervigilance, nightmares, and feelings that are involved with PTSD.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 06:12:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: quote: Originally posted by crackerjacks61: Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not? ABSOLUTELY NOT!!! SOME of those with PTSD are mentally unstable (they usually have other issues as well, such as alcohol or substance abuse, or other mental health diagnoses) ... MOST are quite mentally stable, but need help dealing with the anxiety, hypervigilance, nightmares, and feelings that are involved with PTSD. And how is the issuing authority supposed to determine which the individual is? One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090308, 
        "postID": 11, 
        "quote": "Originally posted by Cider33_Alpha: quote: Originally posted by crackerjacks61: Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not? ABSOLUTELY NOT!!! SOME of those with PTSD are mentally unstable (they usually have other issues as well, such as alcohol or substance abuse, or other mental health diagnoses) ... MOST are quite mentally stable, but need help dealing with the anxiety, hypervigilance, nightmares, and feelings that are involved with PTSD.", 
        "reply": " And how is the issuing authority supposed to determine which the individual is? One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 10:48:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "I'd bet damn near anything that if govt made PTSD a reason not to be able to own a firearm, PTSD would drop off like a current graph of the stock market. This may be the cure for PTSD, OR a lot of people with PTSD would not seek help and that would be tragic. I know a few people diagnosed with PTSD and they have all their wits about them, I'd go shooting with them, no problem.", 
        "intTime": 20090308, 
        "postID": 12, 
        "quote": "", 
        "reply": "I'd bet damn near anything that if govt made PTSD a reason not to be able to own a firearm, PTSD would drop off like a current graph of the stock market. This may be the cure for PTSD, OR a lot of people with PTSD would not seek help and that would be tragic. I know a few people diagnosed with PTSD and they have all their wits about them, I'd go shooting with them, no problem.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 11:07:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Anbar7: What do ya'll think? I don't believe that it should have gone like that. If it got out that everybody who had PTSD could not own a gun, I wouldn't put down on the form that I did. Mechaley has a point when he says that he was trusted by the government to carry a loaded weapon, but can't buy one from his local government. Don't think it is right. Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not? . I think it depends on the severity of the PTSD. I don't believe all PTSD cases are going to go out and dig a fighting hole in their front yard and defend it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090308, 
        "postID": 13, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Anbar7: What do ya'll think? I don't believe that it should have gone like that. If it got out that everybody who had PTSD could not own a gun, I wouldn't put down on the form that I did. Mechaley has a point when he says that he was trusted by the government to carry a loaded weapon, but can't buy one from his local government. Don't think it is right. Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not?", 
        "reply": " . I think it depends on the severity of the PTSD. I don't believe all PTSD cases are going to go out and dig a fighting hole in their front yard and defend it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 14:53:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: I'd bet damn near anything that if govt made PTSD a reason not to be able to own a firearm, PTSD would drop off like a current graph of the stock market. This may be the cure for PTSD, OR a lot of people with PTSD would not seek help and that would be tragic. I know a few people diagnosed with PTSD and they have all their wits about them, I'd go shooting with them, no problem. My thoughts exactly. But I wanted to hear someone else say it as well. I think PTSD has become just another victim for some abusers to get a free ride. It's ashame too, because I am sure there really are people out there that could use the help. The freeloaders always ruin everthing that has good intentions.", 
        "intTime": 20090308, 
        "postID": 14, 
        "quote": "Originally posted by BAGodbehere: I'd bet damn near anything that if govt made PTSD a reason not to be able to own a firearm, PTSD would drop off like a current graph of the stock market. This may be the cure for PTSD, OR a lot of people with PTSD would not seek help and that would be tragic. I know a few people diagnosed with PTSD and they have all their wits about them, I'd go shooting with them, no problem.", 
        "reply": " My thoughts exactly. But I wanted to hear someone else say it as well. I think PTSD has become just another victim for some abusers to get a free ride. It's ashame too, because I am sure there really are people out there that could use the help. The freeloaders always ruin everthing that has good intentions.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 15:28:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "This is ridiculous! I know people who have PTSD and are in the Army right now. I'd trust every one of them, and apparently Uncle Sam thinks the same way. If we want to take guns away from everyone that has some issue like that, then we'd better kick out half the people in our military.", 
        "intTime": 20090308, 
        "postID": 15, 
        "quote": "", 
        "reply": "This is ridiculous! I know people who have PTSD and are in the Army right now. I'd trust every one of them, and apparently Uncle Sam thinks the same way. If we want to take guns away from everyone that has some issue like that, then we'd better kick out half the people in our military.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 16:01:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "Philhelm"
    }, 
    {
        "content": "Philhelm; Very good point. Here is another one also. What about the Veteran who has had a gun permit for more than 20 years and then one day he is diagnosed with PTSD? Do they not give him one than? I know many a Vietnam Vets that lived with their nightmares for 20 even 30 years before something triggered a reaction inside of them.", 
        "intTime": 20090308, 
        "postID": 16, 
        "quote": "", 
        "reply": "Philhelm; Very good point. Here is another one also. What about the Veteran who has had a gun permit for more than 20 years and then one day he is diagnosed with PTSD? Do they not give him one than? I know many a Vietnam Vets that lived with their nightmares for 20 even 30 years before something triggered a reaction inside of them.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 16:17:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by Cider33_Alpha: quote: Originally posted by crackerjacks61: Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not? ABSOLUTELY NOT!!! SOME of those with PTSD are mentally unstable (they usually have other issues as well, such as alcohol or substance abuse, or other mental health diagnoses) ... MOST are quite mentally stable, but need help dealing with the anxiety, hypervigilance, nightmares, and feelings that are involved with PTSD. And how is the issuing authority supposed to determine which the individual is? Well, since we are talking about denying someone a Constitutionally guaranteed right, it would be incumbent upon the state to actually find out. If they are not sure then they have no basis to deny.", 
        "intTime": 20090308, 
        "postID": 17, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by Cider33_Alpha: quote: Originally posted by crackerjacks61: Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not? ABSOLUTELY NOT!!! SOME of those with PTSD are mentally unstable (they usually have other issues as well, such as alcohol or substance abuse, or other mental health diagnoses) ... MOST are quite mentally stable, but need help dealing with the anxiety, hypervigilance, nightmares, and feelings that are involved with PTSD. And how is the issuing authority supposed to determine which the individual is?", 
        "reply": " Well, since we are talking about denying someone a Constitutionally guaranteed right, it would be incumbent upon the state to actually find out. If they are not sure then they have no basis to deny.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 21:13:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "thorin001"
    }, 
    {
        "content": "I realize this sounds a bit grade school like for an answer but wouldn't a note/report from the doctor clear up this mess. This is what I am basing my opinion on.... Back in 2003, I was going through a horrible divorce with my unfaithful wife. I brought much of my stress from home into my job of Federal Law Enforcement. My boss became greatly concerned with my level of stress. He took my firearms from me and ordered me to see a doctor. She ran me through a series of psych tests and eventually reported back to my boss that she deemed me to be under stress but not a threat to anyone. I got my weapons back immediately after I was cleared. I would think something like that would clear anyone being held back from gun ownership due to PTSD. Don", 
        "intTime": 20090309, 
        "postID": 18, 
        "quote": "", 
        "reply": "I realize this sounds a bit grade school like for an answer but wouldn't a note/report from the doctor clear up this mess. This is what I am basing my opinion on.... Back in 2003, I was going through a horrible divorce with my unfaithful wife. I brought much of my stress from home into my job of Federal Law Enforcement. My boss became greatly concerned with my level of stress. He took my firearms from me and ordered me to see a doctor. She ran me through a series of psych tests and eventually reported back to my boss that she deemed me to be under stress but not a threat to anyone. I got my weapons back immediately after I was cleared. I would think something like that would clear anyone being held back from gun ownership due to PTSD. Don", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-09 08:00:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Don, there ya go, problem solved, I agree with you.", 
        "intTime": 20090309, 
        "postID": 19, 
        "quote": "", 
        "reply": "Don, there ya go, problem solved, I agree with you.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-09 10:03:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Unfortunetly, many people still consider PTSD as the same as \"going postal\".", 
        "intTime": 20090309, 
        "postID": 20, 
        "quote": "", 
        "reply": "Unfortunetly, many people still consider PTSD as the same as \"going postal\".", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-09 10:21:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "OMAHA, Neb. -- Tim Mechaley trained fellow Marines to fire .50-caliber machine guns. He qualified as a marksman. He fought in the battle for Fallujah and received a combat medal with a \"V\" for valor. Back home, he uses a rifle for target shooting. Yet, when Mechaley sought to buy a 9-mm Ruger pistol for protection at his midtown apartment, the Omaha Police Department rejected his application for a gun permit. \"I was trusted by the {federal} government to carry a loaded weapon, but now I am not allowed to purchase one by my local government,\" he said. Mechaley, 32, has received counseling for post-traumatic stress disorder related to his service in Iraq. While completing an application for a gun permit, he responded \"yes\" to a question that asked whether he was being treated for a mental disorder. \"I circled yes because I wanted to be completely honest,\" he said. As explanation, he wrote \"PTSD from Iraq Marine combat veteran\" on the form. Mechaley's application on Jan. 10 was rejected, he was told, because of that answer. After talking with police, Mechaley said he had been \"too truthful\" on the application. Read the rest here \"http://www.military.com/news/article/vet-denied-gun-permit-over-ptsd-care.html?col=1186032366495\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090307, 
        "postID": 21, 
        "quote": "", 
        "reply": "OMAHA, Neb. -- Tim Mechaley trained fellow Marines to fire .50-caliber machine guns. He qualified as a marksman. He fought in the battle for Fallujah and received a combat medal with a \"V\" for valor. Back home, he uses a rifle for target shooting. Yet, when Mechaley sought to buy a 9-mm Ruger pistol for protection at his midtown apartment, the Omaha Police Department rejected his application for a gun permit. \"I was trusted by the {federal} government to carry a loaded weapon, but now I am not allowed to purchase one by my local government,\" he said. Mechaley, 32, has received counseling for post-traumatic stress disorder related to his service in Iraq. While completing an application for a gun permit, he responded \"yes\" to a question that asked whether he was being treated for a mental disorder. \"I circled yes because I wanted to be completely honest,\" he said. As explanation, he wrote \"PTSD from Iraq Marine combat veteran\" on the form. Mechaley's application on Jan. 10 was rejected, he was told, because of that answer. After talking with police, Mechaley said he had been \"too truthful\" on the application. Read the rest here \"http://www.military.com/news/article/vet-denied-gun-permit-over-ptsd-care.html?col=1186032366495\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-07 20:00:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "Anbar7"
    }, 
    {
        "content": "What do ya'll think? I don't believe that it should have gone like that. If it got out that everybody who had PTSD could not own a gun, I wouldn't put down on the form that I did. Mechaley has a point when he says that he was trusted by the government to carry a loaded weapon, but can't buy one from his local government. Don't think it is right. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090307, 
        "postID": 22, 
        "quote": "", 
        "reply": "What do ya'll think? I don't believe that it should have gone like that. If it got out that everybody who had PTSD could not own a gun, I wouldn't put down on the form that I did. Mechaley has a point when he says that he was trusted by the government to carry a loaded weapon, but can't buy one from his local government. Don't think it is right. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-07 20:02:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "Anbar7"
    }, 
    {
        "content": "you did right by being truthful - always be that.. but what did you expect? The rules are the rules and the line has to be drawn somewhere... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090307, 
        "postID": 23, 
        "quote": "", 
        "reply": "you did right by being truthful - always be that.. but what did you expect? The rules are the rules and the line has to be drawn somewhere... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-07 20:05:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "I was diagnosed as having symptoms of PTSD about 15 years ago. Don't receive any compensation for it, but I get 30% for being blind in one eye and other ****e. I have had a concealed weapons permit in 3 different states, including Florida where I was diagnosed with PTSD. My wife and friends know of the really stupid stuff I have done before I was treated with medications. That's behind me now. But having PTSD didn't make me stupid. Each time I fill out any form that asks if I have a \"mental condition\", \"disorder\", or whatever, DO YOU THINK I'M GOING ANSWER \"YES\"? Yeah sure I want to stand straight and look the guy in the eye and tell the truth. But there would be a real good chance I would not receive the gun, or be issued the permit. Life sucks. Deal with it.", 
        "intTime": 20090307, 
        "postID": 24, 
        "quote": "", 
        "reply": "I was diagnosed as having symptoms of PTSD about 15 years ago. Don't receive any compensation for it, but I get 30% for being blind in one eye and other ****e. I have had a concealed weapons permit in 3 different states, including Florida where I was diagnosed with PTSD. My wife and friends know of the really stupid stuff I have done before I was treated with medications. That's behind me now. But having PTSD didn't make me stupid. Each time I fill out any form that asks if I have a \"mental condition\", \"disorder\", or whatever, DO YOU THINK I'M GOING ANSWER \"YES\"? Yeah sure I want to stand straight and look the guy in the eye and tell the truth. But there would be a real good chance I would not receive the gun, or be issued the permit. Life sucks. Deal with it.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-07 20:34:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "badmac933"
    }, 
    {
        "content": "Some states are what they call a \"Shall Issue\" state. What that means is that unless there is a reason NOT to give you a permit (felony, domestic conviction, etc...) they by law have to give you the permit. Perhaps Nebraska is not one of those States? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090307, 
        "postID": 25, 
        "quote": "", 
        "reply": "Some states are what they call a \"Shall Issue\" state. What that means is that unless there is a reason NOT to give you a permit (felony, domestic conviction, etc...) they by law have to give you the permit. Perhaps Nebraska is not one of those States? \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-07 23:30:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "jrnh5150"
    }, 
    {
        "content": "quote: Originally posted by jrnh5150: Some states are what they call a \"Shall Issue\" state. What that means is that unless there is a reason NOT to give you a permit (felony, domestic conviction, etc...) they by law have to give you the permit. Perhaps Nebraska is not one of those States? Or perhaps they consider PTSD to be one of those reasons to not give a permit.", 
        "intTime": 20090307, 
        "postID": 26, 
        "quote": "Originally posted by jrnh5150: Some states are what they call a \"Shall Issue\" state. What that means is that unless there is a reason NOT to give you a permit (felony, domestic conviction, etc...) they by law have to give you the permit. Perhaps Nebraska is not one of those States?", 
        "reply": " Or perhaps they consider PTSD to be one of those reasons to not give a permit.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-07 23:43:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Omaha PD is just avoiding potential future lawsuits. Understandable.", 
        "intTime": 20090308, 
        "postID": 27, 
        "quote": "", 
        "reply": "Omaha PD is just avoiding potential future lawsuits. Understandable.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 05:47:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "vsibaby"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: What do ya'll think? I don't believe that it should have gone like that. If it got out that everybody who had PTSD could not own a gun, I wouldn't put down on the form that I did. Mechaley has a point when he says that he was trusted by the government to carry a loaded weapon, but can't buy one from his local government. Don't think it is right. Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not?", 
        "intTime": 20090308, 
        "postID": 28, 
        "quote": "Originally posted by Anbar7: What do ya'll think? I don't believe that it should have gone like that. If it got out that everybody who had PTSD could not own a gun, I wouldn't put down on the form that I did. Mechaley has a point when he says that he was trusted by the government to carry a loaded weapon, but can't buy one from his local government. Don't think it is right.", 
        "reply": " Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not?", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 06:06:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Well, then I guess if he wanted one from Omaha, GEN Ham (CG of USAREUR) probably wouldn't be able to get one. He and another GO went public with their own mental health issues after deployments and their subsequent counseling (I don't know for a fact if he was diagnosed with PTSD, but from his own descriptions, it's a fairly safe bet). That was their own effort to get the Army to come around to reality and stop stigmatizing those who seek mental health counseling. Having PTSD isn't inherently any more dangerous than having TB. Both conditions can be dangerous to others under certain circumstances, but not all those with PTSD ever require hospitalization, multiple medications or other factors that can make the diagnosis riskier. Those with severe PTSD are more likely to harm themselves than others. I am generally in favor of gun control, but this is not a second amendment issue - it's a matter of a Nanny State run amok. Give the guy his permit!", 
        "intTime": 20090308, 
        "postID": 29, 
        "quote": "", 
        "reply": "Well, then I guess if he wanted one from Omaha, GEN Ham (CG of USAREUR) probably wouldn't be able to get one. He and another GO went public with their own mental health issues after deployments and their subsequent counseling (I don't know for a fact if he was diagnosed with PTSD, but from his own descriptions, it's a fairly safe bet). That was their own effort to get the Army to come around to reality and stop stigmatizing those who seek mental health counseling. Having PTSD isn't inherently any more dangerous than having TB. Both conditions can be dangerous to others under certain circumstances, but not all those with PTSD ever require hospitalization, multiple medications or other factors that can make the diagnosis riskier. Those with severe PTSD are more likely to harm themselves than others. I am generally in favor of gun control, but this is not a second amendment issue - it's a matter of a Nanny State run amok. Give the guy his permit!", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 06:09:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not? ABSOLUTELY NOT!!! SOME of those with PTSD are mentally unstable (they usually have other issues as well, such as alcohol or substance abuse, or other mental health diagnoses) ... MOST are quite mentally stable, but need help dealing with the anxiety, hypervigilance, nightmares, and feelings that are involved with PTSD.", 
        "intTime": 20090308, 
        "postID": 30, 
        "quote": "Originally posted by crackerjacks61: Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not?", 
        "reply": " ABSOLUTELY NOT!!! SOME of those with PTSD are mentally unstable (they usually have other issues as well, such as alcohol or substance abuse, or other mental health diagnoses) ... MOST are quite mentally stable, but need help dealing with the anxiety, hypervigilance, nightmares, and feelings that are involved with PTSD.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 06:12:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: quote: Originally posted by crackerjacks61: Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not? ABSOLUTELY NOT!!! SOME of those with PTSD are mentally unstable (they usually have other issues as well, such as alcohol or substance abuse, or other mental health diagnoses) ... MOST are quite mentally stable, but need help dealing with the anxiety, hypervigilance, nightmares, and feelings that are involved with PTSD. And how is the issuing authority supposed to determine which the individual is? One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090308, 
        "postID": 31, 
        "quote": "Originally posted by Cider33_Alpha: quote: Originally posted by crackerjacks61: Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not? ABSOLUTELY NOT!!! SOME of those with PTSD are mentally unstable (they usually have other issues as well, such as alcohol or substance abuse, or other mental health diagnoses) ... MOST are quite mentally stable, but need help dealing with the anxiety, hypervigilance, nightmares, and feelings that are involved with PTSD.", 
        "reply": " And how is the issuing authority supposed to determine which the individual is? One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 10:48:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "I'd bet damn near anything that if govt made PTSD a reason not to be able to own a firearm, PTSD would drop off like a current graph of the stock market. This may be the cure for PTSD, OR a lot of people with PTSD would not seek help and that would be tragic. I know a few people diagnosed with PTSD and they have all their wits about them, I'd go shooting with them, no problem.", 
        "intTime": 20090308, 
        "postID": 32, 
        "quote": "", 
        "reply": "I'd bet damn near anything that if govt made PTSD a reason not to be able to own a firearm, PTSD would drop off like a current graph of the stock market. This may be the cure for PTSD, OR a lot of people with PTSD would not seek help and that would be tragic. I know a few people diagnosed with PTSD and they have all their wits about them, I'd go shooting with them, no problem.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 11:07:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Anbar7: What do ya'll think? I don't believe that it should have gone like that. If it got out that everybody who had PTSD could not own a gun, I wouldn't put down on the form that I did. Mechaley has a point when he says that he was trusted by the government to carry a loaded weapon, but can't buy one from his local government. Don't think it is right. Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not? . I think it depends on the severity of the PTSD. I don't believe all PTSD cases are going to go out and dig a fighting hole in their front yard and defend it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090308, 
        "postID": 33, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Anbar7: What do ya'll think? I don't believe that it should have gone like that. If it got out that everybody who had PTSD could not own a gun, I wouldn't put down on the form that I did. Mechaley has a point when he says that he was trusted by the government to carry a loaded weapon, but can't buy one from his local government. Don't think it is right. Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not?", 
        "reply": " . I think it depends on the severity of the PTSD. I don't believe all PTSD cases are going to go out and dig a fighting hole in their front yard and defend it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 14:53:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: I'd bet damn near anything that if govt made PTSD a reason not to be able to own a firearm, PTSD would drop off like a current graph of the stock market. This may be the cure for PTSD, OR a lot of people with PTSD would not seek help and that would be tragic. I know a few people diagnosed with PTSD and they have all their wits about them, I'd go shooting with them, no problem. My thoughts exactly. But I wanted to hear someone else say it as well. I think PTSD has become just another victim for some abusers to get a free ride. It's ashame too, because I am sure there really are people out there that could use the help. The freeloaders always ruin everthing that has good intentions.", 
        "intTime": 20090308, 
        "postID": 34, 
        "quote": "Originally posted by BAGodbehere: I'd bet damn near anything that if govt made PTSD a reason not to be able to own a firearm, PTSD would drop off like a current graph of the stock market. This may be the cure for PTSD, OR a lot of people with PTSD would not seek help and that would be tragic. I know a few people diagnosed with PTSD and they have all their wits about them, I'd go shooting with them, no problem.", 
        "reply": " My thoughts exactly. But I wanted to hear someone else say it as well. I think PTSD has become just another victim for some abusers to get a free ride. It's ashame too, because I am sure there really are people out there that could use the help. The freeloaders always ruin everthing that has good intentions.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 15:28:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "This is ridiculous! I know people who have PTSD and are in the Army right now. I'd trust every one of them, and apparently Uncle Sam thinks the same way. If we want to take guns away from everyone that has some issue like that, then we'd better kick out half the people in our military.", 
        "intTime": 20090308, 
        "postID": 35, 
        "quote": "", 
        "reply": "This is ridiculous! I know people who have PTSD and are in the Army right now. I'd trust every one of them, and apparently Uncle Sam thinks the same way. If we want to take guns away from everyone that has some issue like that, then we'd better kick out half the people in our military.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 16:01:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "Philhelm"
    }, 
    {
        "content": "Philhelm; Very good point. Here is another one also. What about the Veteran who has had a gun permit for more than 20 years and then one day he is diagnosed with PTSD? Do they not give him one than? I know many a Vietnam Vets that lived with their nightmares for 20 even 30 years before something triggered a reaction inside of them.", 
        "intTime": 20090308, 
        "postID": 36, 
        "quote": "", 
        "reply": "Philhelm; Very good point. Here is another one also. What about the Veteran who has had a gun permit for more than 20 years and then one day he is diagnosed with PTSD? Do they not give him one than? I know many a Vietnam Vets that lived with their nightmares for 20 even 30 years before something triggered a reaction inside of them.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 16:17:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by Cider33_Alpha: quote: Originally posted by crackerjacks61: Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not? ABSOLUTELY NOT!!! SOME of those with PTSD are mentally unstable (they usually have other issues as well, such as alcohol or substance abuse, or other mental health diagnoses) ... MOST are quite mentally stable, but need help dealing with the anxiety, hypervigilance, nightmares, and feelings that are involved with PTSD. And how is the issuing authority supposed to determine which the individual is? Well, since we are talking about denying someone a Constitutionally guaranteed right, it would be incumbent upon the state to actually find out. If they are not sure then they have no basis to deny.", 
        "intTime": 20090308, 
        "postID": 37, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by Cider33_Alpha: quote: Originally posted by crackerjacks61: Mental instability is a reason to deny gun ownership and/or license. PTSD falls within the catagory does it not? ABSOLUTELY NOT!!! SOME of those with PTSD are mentally unstable (they usually have other issues as well, such as alcohol or substance abuse, or other mental health diagnoses) ... MOST are quite mentally stable, but need help dealing with the anxiety, hypervigilance, nightmares, and feelings that are involved with PTSD. And how is the issuing authority supposed to determine which the individual is?", 
        "reply": " Well, since we are talking about denying someone a Constitutionally guaranteed right, it would be incumbent upon the state to actually find out. If they are not sure then they have no basis to deny.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-08 21:13:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "thorin001"
    }, 
    {
        "content": "I realize this sounds a bit grade school like for an answer but wouldn't a note/report from the doctor clear up this mess. This is what I am basing my opinion on.... Back in 2003, I was going through a horrible divorce with my unfaithful wife. I brought much of my stress from home into my job of Federal Law Enforcement. My boss became greatly concerned with my level of stress. He took my firearms from me and ordered me to see a doctor. She ran me through a series of psych tests and eventually reported back to my boss that she deemed me to be under stress but not a threat to anyone. I got my weapons back immediately after I was cleared. I would think something like that would clear anyone being held back from gun ownership due to PTSD. Don", 
        "intTime": 20090309, 
        "postID": 38, 
        "quote": "", 
        "reply": "I realize this sounds a bit grade school like for an answer but wouldn't a note/report from the doctor clear up this mess. This is what I am basing my opinion on.... Back in 2003, I was going through a horrible divorce with my unfaithful wife. I brought much of my stress from home into my job of Federal Law Enforcement. My boss became greatly concerned with my level of stress. He took my firearms from me and ordered me to see a doctor. She ran me through a series of psych tests and eventually reported back to my boss that she deemed me to be under stress but not a threat to anyone. I got my weapons back immediately after I was cleared. I would think something like that would clear anyone being held back from gun ownership due to PTSD. Don", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-09 08:00:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Don, there ya go, problem solved, I agree with you.", 
        "intTime": 20090309, 
        "postID": 39, 
        "quote": "", 
        "reply": "Don, there ya go, problem solved, I agree with you.", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-09 10:03:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Unfortunetly, many people still consider PTSD as the same as \"going postal\".", 
        "intTime": 20090309, 
        "postID": 40, 
        "quote": "", 
        "reply": "Unfortunetly, many people still consider PTSD as the same as \"going postal\".", 
        "threadID": "672198221_5090022712001", 
        "time": "2009-03-09 10:21:00", 
        "title": "Vet Denied Gun Permit Over PTSD Care", 
        "userID": "SignalSgtWilliams"
    }
]