[
    {
        "content": "\"http://www.masslive.com/hampfrank/republican/index.ssf?/base/news-19/1241162246224680.xml&coll=1\" WASHINGTON - President Barack Obama forced Chrysler into federal bankruptcy protection on Thursday so it could pursue a life-saving alliance with the Italian automaker Fiat, in yet another extraordinary intervention into private industry by the federal government. Flanked by his automobile task force of Cabinet secretaries and business advisers, Obama announced a plan that would allow the United Automobile Workers retirement plan to take control of Chrysler, with Fiat and the United States as junior partners. The government would lend about $8 billion more to the company, on top of the $4 billion it had already provided. Your Tax Dollars at work You wanted change you got it",
        "intTime": 20090501,
        "postID": 1,
        "quote": "",
        "reply": "\"http://www.masslive.com/hampfrank/republican/index.ssf?/base/news-19/1241162246224680.xml&coll=1\" WASHINGTON - President Barack Obama forced Chrysler into federal bankruptcy protection on Thursday so it could pursue a life-saving alliance with the Italian automaker Fiat, in yet another extraordinary intervention into private industry by the federal government. Flanked by his automobile task force of Cabinet secretaries and business advisers, Obama announced a plan that would allow the United Automobile Workers retirement plan to take control of Chrysler, with Fiat and the United States as junior partners. The government would lend about $8 billion more to the company, on top of the $4 billion it had already provided. Your Tax Dollars at work You wanted change you got it",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 06:39:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "ss_287"
    },
    {
        "content": "quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks.",
        "intTime": 20090501,
        "postID": 2,
        "quote": "Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it",
        "reply": " If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 07:03:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "mrmixitup"
    },
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue.",
        "intTime": 20090501,
        "postID": 3,
        "quote": "Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks.",
        "reply": " If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 07:08:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "adminnco1"
    },
    {
        "content": "We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us.",
        "intTime": 20090501,
        "postID": 4,
        "quote": "",
        "reply": "We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 07:09:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "Vanir97"
    },
    {
        "content": "quote: Originally posted by Vanir97: We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us. You're blaming this on liberals? Chrysler has been a failure since it went private in the 1970's. It's just been one failure after another since 1979. NOTHING COULD OR WOULD HAVE SAVED CHRYSLER They will fail again no matter who buys them because their cars stink and always will stink.",
        "intTime": 20090501,
        "postID": 5,
        "quote": "Originally posted by Vanir97: We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us.",
        "reply": " You're blaming this on liberals? Chrysler has been a failure since it went private in the 1970's. It's just been one failure after another since 1979. NOTHING COULD OR WOULD HAVE SAVED CHRYSLER They will fail again no matter who buys them because their cars stink and always will stink.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 07:21:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "mrmixitup"
    },
    {
        "content": "My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless?",
        "intTime": 20090501,
        "postID": 6,
        "quote": "",
        "reply": "My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless?",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 10:53:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "Bladensburg"
    },
    {
        "content": "quote: Originally posted by Bladensburg: My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless? President Obama said owners of Chrysler products have nothing to worry about. The government will handle it.",
        "intTime": 20090503,
        "postID": 7,
        "quote": "Originally posted by Bladensburg: My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless?",
        "reply": " President Obama said owners of Chrysler products have nothing to worry about. The government will handle it.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-03 21:18:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "scooter_mech"
    },
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue. We will not recover, till we disavow NAFTA and it's Asian counterparts and go back to the tariff system... This is all just an exercise in futility, till we realize and correct the problem that go us into this mess in the first place... Respectfully, SUNLINER81",
        "intTime": 20090503,
        "postID": 8,
        "quote": "Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue.",
        "reply": " We will not recover, till we disavow NAFTA and it's Asian counterparts and go back to the tariff system... This is all just an exercise in futility, till we realize and correct the problem that go us into this mess in the first place... Respectfully, SUNLINER81",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-03 21:28:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "SUNLINER81"
    },
    {
        "content": "I would not mind the government inserting itself in the daily operations of corporate America except for the history of government run commerce. The post office and Amtrak are not exactly fine examples of the best run businesses.",
        "intTime": 20090503,
        "postID": 9,
        "quote": "",
        "reply": "I would not mind the government inserting itself in the daily operations of corporate America except for the history of government run commerce. The post office and Amtrak are not exactly fine examples of the best run businesses.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-03 21:38:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "M123Driver"
    },
    {
        "content": "quote: Originally posted by Bladensburg: My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless? So that's the guy who bought a Jeep last year! In all seriousness, his warranty will remain in effect. He's covered.",
        "intTime": 20090504,
        "postID": 10,
        "quote": "Originally posted by Bladensburg: My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless?",
        "reply": " So that's the guy who bought a Jeep last year! In all seriousness, his warranty will remain in effect. He's covered.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 04:33:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "mrmixitup"
    },
    {
        "content": "Can someone tell me why Fiat will own Chrysler. Who decided this? After giving Chrysler BILLIONS Fiat takes over without spending a dime? Seriously folks what the hell is going on?",
        "intTime": 20090504,
        "postID": 11,
        "quote": "",
        "reply": "Can someone tell me why Fiat will own Chrysler. Who decided this? After giving Chrysler BILLIONS Fiat takes over without spending a dime? Seriously folks what the hell is going on?",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 05:31:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "m1tom"
    },
    {
        "content": "If they'd cut their prices by half, they'd sell everything they've got, drive the competition (Toyota, etc) off or into bankruptcy and keep at least some cash flow going to keep going - too stupid to do it!! Better to close down and lay everybody off than cut everything back and stay afloat - duh!! Wandering and Wondering",
        "intTime": 20090504,
        "postID": 12,
        "quote": "",
        "reply": "If they'd cut their prices by half, they'd sell everything they've got, drive the competition (Toyota, etc) off or into bankruptcy and keep at least some cash flow going to keep going - too stupid to do it!! Better to close down and lay everybody off than cut everything back and stay afloat - duh!! Wandering and Wondering",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 05:34:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "greywolfghost"
    },
    {
        "content": "quote: Originally posted by Vanir97: We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us. Like the Reps would not have done the same thing? My hopes are that one day people will wake up..but I'm not holding my breath. We need someone TRULY conservative, even MUCH more so than Reagan at this stage of the game.",
        "intTime": 20090504,
        "postID": 13,
        "quote": "Originally posted by Vanir97: We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us.",
        "reply": " Like the Reps would not have done the same thing? My hopes are that one day people will wake up..but I'm not holding my breath. We need someone TRULY conservative, even MUCH more so than Reagan at this stage of the game.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 05:51:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. LOL The sales force where I used to work had Sebrings --about 500 of them -- and they were completely despised. Walt",
        "intTime": 20090504,
        "postID": 14,
        "quote": "Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks.",
        "reply": " LOL The sales force where I used to work had Sebrings --about 500 of them -- and they were completely despised. Walt",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 06:42:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "WhiskeyPapa"
    },
    {
        "content": "If I would win any Chrysler in some kind of lottery or prize I would pay the tax on it(of course nothing is free) and the next day it would be on the lemon lot at Camp Lejeune with a price so low that any PFC in the USMC could afford to buy it. This President and this country just cannot say the word \"NO\" unless something is totally screwed up. Then they stand on the roof tops and yell \" Yes, Yes, Yes\". My wife and I yesterday went to a large plant nursery to buy some mater plants and some flowers. I asked the woman at the cash resister if they had any Obama Plants and she asked what was that? I told her it was a money tree that kept coming back every year.",
        "intTime": 20090504,
        "postID": 15,
        "quote": "",
        "reply": "If I would win any Chrysler in some kind of lottery or prize I would pay the tax on it(of course nothing is free) and the next day it would be on the lemon lot at Camp Lejeune with a price so low that any PFC in the USMC could afford to buy it. This President and this country just cannot say the word \"NO\" unless something is totally screwed up. Then they stand on the roof tops and yell \" Yes, Yes, Yes\". My wife and I yesterday went to a large plant nursery to buy some mater plants and some flowers. I asked the woman at the cash resister if they had any Obama Plants and she asked what was that? I told her it was a money tree that kept coming back every year.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 06:48:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "Duster6"
    },
    {
        "content": "S/L You are always railing on and on about NAFTA and \"it's asian counterparts\" as the source of this problem. The moving of jobs to China or where ever is problem and many jobs, more manufacturing jobs than others have moved out of the US due to these trade deals. BUT THAT IS NOT THE PROBLEM with the US owned IE \"the Detroit three\" They are being competed with by \"foreign owned\" companies with US subsidaries, like Chrysler is about to become. These compaines are more competitive because they pay less to begin with. They don't give free medical to employees and all there dependends \"for life\" They don't pay the differential of un-employment everytime a plant shuts down like Detrioit does. They don't allow guys that reach 30 years at age 48 or whatever to retire then, almost 20 years earlier than normal getting full pay and that free medical for life. They don't have thousands of non-working \"job bank\" guys sitting around doing nothing, a lot of them actually sit at home all while earning full pay, getting that free medical and logging time toward that 30 years and day retirement at 48. These are US subsidaries of foreign companies an idea that for the most part has always been supported by whoever is going to get the jobs. For example Mobile AL. is all for Airbus coming in to make planes. Nafta and the other trade agreements do not in any way control or have any influence of foreign companies setting up shop in the US. A US company opening a plant in China or where ever a German or Japanese company opening a plant in the US do not fall under the authority of NAFTA or the other trades deals. You mention tarriffs, again if it is made in the US that is a non starter. Transplants that are here IMO are here and nothing can be done to un-ring that bell. To keep from getting more some kind of Federal law, piece meal state to state would never get it done, it would have to be enacted that would not allow ANY foriegn comany from coming to the US not just a law for auto plants, everything no matter what it is, anything short of that would never stand a court challenge. Is the US ready to bar ALL foreign investment in the US? I highly doubt it.",
        "intTime": 20090504,
        "postID": 16,
        "quote": "",
        "reply": "S/L You are always railing on and on about NAFTA and \"it's asian counterparts\" as the source of this problem. The moving of jobs to China or where ever is problem and many jobs, more manufacturing jobs than others have moved out of the US due to these trade deals. BUT THAT IS NOT THE PROBLEM with the US owned IE \"the Detroit three\" They are being competed with by \"foreign owned\" companies with US subsidaries, like Chrysler is about to become. These compaines are more competitive because they pay less to begin with. They don't give free medical to employees and all there dependends \"for life\" They don't pay the differential of un-employment everytime a plant shuts down like Detrioit does. They don't allow guys that reach 30 years at age 48 or whatever to retire then, almost 20 years earlier than normal getting full pay and that free medical for life. They don't have thousands of non-working \"job bank\" guys sitting around doing nothing, a lot of them actually sit at home all while earning full pay, getting that free medical and logging time toward that 30 years and day retirement at 48. These are US subsidaries of foreign companies an idea that for the most part has always been supported by whoever is going to get the jobs. For example Mobile AL. is all for Airbus coming in to make planes. Nafta and the other trade agreements do not in any way control or have any influence of foreign companies setting up shop in the US. A US company opening a plant in China or where ever a German or Japanese company opening a plant in the US do not fall under the authority of NAFTA or the other trades deals. You mention tarriffs, again if it is made in the US that is a non starter. Transplants that are here IMO are here and nothing can be done to un-ring that bell. To keep from getting more some kind of Federal law, piece meal state to state would never get it done, it would have to be enacted that would not allow ANY foriegn comany from coming to the US not just a law for auto plants, everything no matter what it is, anything short of that would never stand a court challenge. Is the US ready to bar ALL foreign investment in the US? I highly doubt it.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 09:00:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "ETCPJ"
    },
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue. We will not recover, till we disavow NAFTA and it's Asian counterparts and go back to the tariff system... This is all just an exercise in futility, till we realize and correct the problem that go us into this mess in the first place... Respectfully, SUNLINER81",
        "intTime": 20090504,
        "postID": 17,
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue. We will not recover, till we disavow NAFTA and it's Asian counterparts and go back to the tariff system... This is all just an exercise in futility, till we realize and correct the problem that go us into this mess in the first place... Respectfully, SUNLINER81",
        "reply": "",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 09:36:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "Ol_Doc"
    },
    {
        "content": "quote: Originally posted by ETCPJ: S/L You are always railing on and on about NAFTA and \"it's asian counterparts\" as the source of this problem. The moving of jobs to China or where ever is problem and many jobs, more manufacturing jobs than others have moved out of the US due to these trade deals. BUT THAT IS NOT THE PROBLEM with the US owned IE \"the Detroit three\" They are being competed with by \"foreign owned\" companies with US subsidaries, like Chrysler is about to become. These compaines are more competitive because they pay less to begin with. They don't give free medical to employees and all there dependends \"for life\" They don't pay the differential of un-employment everytime a plant shuts down like Detrioit does. They don't allow guys that reach 30 years at age 48 or whatever to retire then, almost 20 years earlier than normal getting full pay and that free medical for life. They don't have thousands of non-working \"job bank\" guys sitting around doing nothing, a lot of them actually sit at home all while earning full pay, getting that free medical and logging time toward that 30 years and day retirement at 48. These are US subsidaries of foreign companies an idea that for the most part has always been supported by whoever is going to get the jobs. For example Mobile AL. is all for Airbus coming in to make planes. Nafta and the other trade agreements do not in any way control or have any influence of foreign companies setting up shop in the US. A US company opening a plant in China or where ever a German or Japanese company opening a plant in the US do not fall under the authority of NAFTA or the other trades deals. You mention tarriffs, again if it is made in the US that is a non starter. Transplants that are here IMO are here and nothing can be done to un-ring that bell. To keep from getting more some kind of Federal law, piece meal state to state would never get it done, it would have to be enacted that would not allow ANY foriegn comany from coming to the US not just a law for auto plants, everything no matter what it is, anything short of that would never stand a court challenge. Is the US ready to bar ALL foreign investment in the US? I highly doubt it. It's called TARIFF, if it isn't made on American soil, with components manufactured on American soil, by American citizens, then slap TARIFFS on it!... Respectfully, SUNLINER81",
        "intTime": 20090508,
        "postID": 18,
        "quote": "Originally posted by ETCPJ: S/L You are always railing on and on about NAFTA and \"it's asian counterparts\" as the source of this problem. The moving of jobs to China or where ever is problem and many jobs, more manufacturing jobs than others have moved out of the US due to these trade deals. BUT THAT IS NOT THE PROBLEM with the US owned IE \"the Detroit three\" They are being competed with by \"foreign owned\" companies with US subsidaries, like Chrysler is about to become. These compaines are more competitive because they pay less to begin with. They don't give free medical to employees and all there dependends \"for life\" They don't pay the differential of un-employment everytime a plant shuts down like Detrioit does. They don't allow guys that reach 30 years at age 48 or whatever to retire then, almost 20 years earlier than normal getting full pay and that free medical for life. They don't have thousands of non-working \"job bank\" guys sitting around doing nothing, a lot of them actually sit at home all while earning full pay, getting that free medical and logging time toward that 30 years and day retirement at 48. These are US subsidaries of foreign companies an idea that for the most part has always been supported by whoever is going to get the jobs. For example Mobile AL. is all for Airbus coming in to make planes. Nafta and the other trade agreements do not in any way control or have any influence of foreign companies setting up shop in the US. A US company opening a plant in China or where ever a German or Japanese company opening a plant in the US do not fall under the authority of NAFTA or the other trades deals. You mention tarriffs, again if it is made in the US that is a non starter. Transplants that are here IMO are here and nothing can be done to un-ring that bell. To keep from getting more some kind of Federal law, piece meal state to state would never get it done, it would have to be enacted that would not allow ANY foriegn comany from coming to the US not just a law for auto plants, everything no matter what it is, anything short of that would never stand a court challenge. Is the US ready to bar ALL foreign investment in the US? I highly doubt it.",
        "reply": " It's called TARIFF, if it isn't made on American soil, with components manufactured on American soil, by American citizens, then slap TARIFFS on it!... Respectfully, SUNLINER81",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-08 20:10:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "SUNLINER81"
    },
    {
        "content": "heck if i filed bankruptcy ya think obama would send me a couple million heck I aint greedy D.J.",
        "intTime": 20090508,
        "postID": 19,
        "quote": "",
        "reply": "heck if i filed bankruptcy ya think obama would send me a couple million heck I aint greedy D.J.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-08 20:13:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "donniejanuarysr"
    },
    {
        "content": "quote: Originally posted by SUNLINER81: It's called TARIFF, if it isn't made on American soil, with components manufactured on American soil, by American citizens, then slap TARIFFS on it!... Respectfully, SUNLINER81 AND.....if the Owner's want to off-shore the labor and also squirrel their profits away in \"protected\" off-shore tax-shelters, then they get to go live there leaving their possessions behind and losing their citizenship! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine",
        "intTime": 20090509,
        "postID": 20,
        "quote": "Originally posted by SUNLINER81: It's called TARIFF, if it isn't made on American soil, with components manufactured on American soil, by American citizens, then slap TARIFFS on it!... Respectfully, SUNLINER81",
        "reply": " AND.....if the Owner's want to off-shore the labor and also squirrel their profits away in \"protected\" off-shore tax-shelters, then they get to go live there leaving their possessions behind and losing their citizenship! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-09 12:57:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "KJ1110"
    },
    {
        "content": "\"http://www.masslive.com/hampfrank/republican/index.ssf?/base/news-19/1241162246224680.xml&coll=1\" WASHINGTON - President Barack Obama forced Chrysler into federal bankruptcy protection on Thursday so it could pursue a life-saving alliance with the Italian automaker Fiat, in yet another extraordinary intervention into private industry by the federal government. Flanked by his automobile task force of Cabinet secretaries and business advisers, Obama announced a plan that would allow the United Automobile Workers retirement plan to take control of Chrysler, with Fiat and the United States as junior partners. The government would lend about $8 billion more to the company, on top of the $4 billion it had already provided. Your Tax Dollars at work You wanted change you got it",
        "intTime": 20090501,
        "postID": 21,
        "quote": "",
        "reply": "\"http://www.masslive.com/hampfrank/republican/index.ssf?/base/news-19/1241162246224680.xml&coll=1\" WASHINGTON - President Barack Obama forced Chrysler into federal bankruptcy protection on Thursday so it could pursue a life-saving alliance with the Italian automaker Fiat, in yet another extraordinary intervention into private industry by the federal government. Flanked by his automobile task force of Cabinet secretaries and business advisers, Obama announced a plan that would allow the United Automobile Workers retirement plan to take control of Chrysler, with Fiat and the United States as junior partners. The government would lend about $8 billion more to the company, on top of the $4 billion it had already provided. Your Tax Dollars at work You wanted change you got it",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 06:39:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "ss_287"
    },
    {
        "content": "quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks.",
        "intTime": 20090501,
        "postID": 22,
        "quote": "Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it",
        "reply": " If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 07:03:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "mrmixitup"
    },
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue.",
        "intTime": 20090501,
        "postID": 23,
        "quote": "Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks.",
        "reply": " If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 07:08:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "adminnco1"
    },
    {
        "content": "We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us.",
        "intTime": 20090501,
        "postID": 24,
        "quote": "",
        "reply": "We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 07:09:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "Vanir97"
    },
    {
        "content": "quote: Originally posted by Vanir97: We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us. You're blaming this on liberals? Chrysler has been a failure since it went private in the 1970's. It's just been one failure after another since 1979. NOTHING COULD OR WOULD HAVE SAVED CHRYSLER They will fail again no matter who buys them because their cars stink and always will stink.",
        "intTime": 20090501,
        "postID": 25,
        "quote": "Originally posted by Vanir97: We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us.",
        "reply": " You're blaming this on liberals? Chrysler has been a failure since it went private in the 1970's. It's just been one failure after another since 1979. NOTHING COULD OR WOULD HAVE SAVED CHRYSLER They will fail again no matter who buys them because their cars stink and always will stink.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 07:21:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "mrmixitup"
    },
    {
        "content": "My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless?",
        "intTime": 20090501,
        "postID": 26,
        "quote": "",
        "reply": "My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless?",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 10:53:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "Bladensburg"
    },
    {
        "content": "quote: Originally posted by Bladensburg: My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless? President Obama said owners of Chrysler products have nothing to worry about. The government will handle it.",
        "intTime": 20090503,
        "postID": 27,
        "quote": "Originally posted by Bladensburg: My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless?",
        "reply": " President Obama said owners of Chrysler products have nothing to worry about. The government will handle it.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-03 21:18:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "scooter_mech"
    },
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue. We will not recover, till we disavow NAFTA and it's Asian counterparts and go back to the tariff system... This is all just an exercise in futility, till we realize and correct the problem that go us into this mess in the first place... Respectfully, SUNLINER81",
        "intTime": 20090503,
        "postID": 28,
        "quote": "Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue.",
        "reply": " We will not recover, till we disavow NAFTA and it's Asian counterparts and go back to the tariff system... This is all just an exercise in futility, till we realize and correct the problem that go us into this mess in the first place... Respectfully, SUNLINER81",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-03 21:28:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "SUNLINER81"
    },
    {
        "content": "I would not mind the government inserting itself in the daily operations of corporate America except for the history of government run commerce. The post office and Amtrak are not exactly fine examples of the best run businesses.",
        "intTime": 20090503,
        "postID": 29,
        "quote": "",
        "reply": "I would not mind the government inserting itself in the daily operations of corporate America except for the history of government run commerce. The post office and Amtrak are not exactly fine examples of the best run businesses.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-03 21:38:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "M123Driver"
    },
    {
        "content": "quote: Originally posted by Bladensburg: My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless? So that's the guy who bought a Jeep last year! In all seriousness, his warranty will remain in effect. He's covered.",
        "intTime": 20090504,
        "postID": 30,
        "quote": "Originally posted by Bladensburg: My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless?",
        "reply": " So that's the guy who bought a Jeep last year! In all seriousness, his warranty will remain in effect. He's covered.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 04:33:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "mrmixitup"
    },
    {
        "content": "Can someone tell me why Fiat will own Chrysler. Who decided this? After giving Chrysler BILLIONS Fiat takes over without spending a dime? Seriously folks what the hell is going on?",
        "intTime": 20090504,
        "postID": 31,
        "quote": "",
        "reply": "Can someone tell me why Fiat will own Chrysler. Who decided this? After giving Chrysler BILLIONS Fiat takes over without spending a dime? Seriously folks what the hell is going on?",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 05:31:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "m1tom"
    },
    {
        "content": "If they'd cut their prices by half, they'd sell everything they've got, drive the competition (Toyota, etc) off or into bankruptcy and keep at least some cash flow going to keep going - too stupid to do it!! Better to close down and lay everybody off than cut everything back and stay afloat - duh!! Wandering and Wondering",
        "intTime": 20090504,
        "postID": 32,
        "quote": "",
        "reply": "If they'd cut their prices by half, they'd sell everything they've got, drive the competition (Toyota, etc) off or into bankruptcy and keep at least some cash flow going to keep going - too stupid to do it!! Better to close down and lay everybody off than cut everything back and stay afloat - duh!! Wandering and Wondering",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 05:34:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "greywolfghost"
    },
    {
        "content": "quote: Originally posted by Vanir97: We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us. Like the Reps would not have done the same thing? My hopes are that one day people will wake up..but I'm not holding my breath. We need someone TRULY conservative, even MUCH more so than Reagan at this stage of the game.",
        "intTime": 20090504,
        "postID": 33,
        "quote": "Originally posted by Vanir97: We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us.",
        "reply": " Like the Reps would not have done the same thing? My hopes are that one day people will wake up..but I'm not holding my breath. We need someone TRULY conservative, even MUCH more so than Reagan at this stage of the game.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 05:51:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. LOL The sales force where I used to work had Sebrings --about 500 of them -- and they were completely despised. Walt",
        "intTime": 20090504,
        "postID": 34,
        "quote": "Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks.",
        "reply": " LOL The sales force where I used to work had Sebrings --about 500 of them -- and they were completely despised. Walt",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 06:42:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "WhiskeyPapa"
    },
    {
        "content": "If I would win any Chrysler in some kind of lottery or prize I would pay the tax on it(of course nothing is free) and the next day it would be on the lemon lot at Camp Lejeune with a price so low that any PFC in the USMC could afford to buy it. This President and this country just cannot say the word \"NO\" unless something is totally screwed up. Then they stand on the roof tops and yell \" Yes, Yes, Yes\". My wife and I yesterday went to a large plant nursery to buy some mater plants and some flowers. I asked the woman at the cash resister if they had any Obama Plants and she asked what was that? I told her it was a money tree that kept coming back every year.",
        "intTime": 20090504,
        "postID": 35,
        "quote": "",
        "reply": "If I would win any Chrysler in some kind of lottery or prize I would pay the tax on it(of course nothing is free) and the next day it would be on the lemon lot at Camp Lejeune with a price so low that any PFC in the USMC could afford to buy it. This President and this country just cannot say the word \"NO\" unless something is totally screwed up. Then they stand on the roof tops and yell \" Yes, Yes, Yes\". My wife and I yesterday went to a large plant nursery to buy some mater plants and some flowers. I asked the woman at the cash resister if they had any Obama Plants and she asked what was that? I told her it was a money tree that kept coming back every year.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 06:48:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "Duster6"
    },
    {
        "content": "S/L You are always railing on and on about NAFTA and \"it's asian counterparts\" as the source of this problem. The moving of jobs to China or where ever is problem and many jobs, more manufacturing jobs than others have moved out of the US due to these trade deals. BUT THAT IS NOT THE PROBLEM with the US owned IE \"the Detroit three\" They are being competed with by \"foreign owned\" companies with US subsidaries, like Chrysler is about to become. These compaines are more competitive because they pay less to begin with. They don't give free medical to employees and all there dependends \"for life\" They don't pay the differential of un-employment everytime a plant shuts down like Detrioit does. They don't allow guys that reach 30 years at age 48 or whatever to retire then, almost 20 years earlier than normal getting full pay and that free medical for life. They don't have thousands of non-working \"job bank\" guys sitting around doing nothing, a lot of them actually sit at home all while earning full pay, getting that free medical and logging time toward that 30 years and day retirement at 48. These are US subsidaries of foreign companies an idea that for the most part has always been supported by whoever is going to get the jobs. For example Mobile AL. is all for Airbus coming in to make planes. Nafta and the other trade agreements do not in any way control or have any influence of foreign companies setting up shop in the US. A US company opening a plant in China or where ever a German or Japanese company opening a plant in the US do not fall under the authority of NAFTA or the other trades deals. You mention tarriffs, again if it is made in the US that is a non starter. Transplants that are here IMO are here and nothing can be done to un-ring that bell. To keep from getting more some kind of Federal law, piece meal state to state would never get it done, it would have to be enacted that would not allow ANY foriegn comany from coming to the US not just a law for auto plants, everything no matter what it is, anything short of that would never stand a court challenge. Is the US ready to bar ALL foreign investment in the US? I highly doubt it.",
        "intTime": 20090504,
        "postID": 36,
        "quote": "",
        "reply": "S/L You are always railing on and on about NAFTA and \"it's asian counterparts\" as the source of this problem. The moving of jobs to China or where ever is problem and many jobs, more manufacturing jobs than others have moved out of the US due to these trade deals. BUT THAT IS NOT THE PROBLEM with the US owned IE \"the Detroit three\" They are being competed with by \"foreign owned\" companies with US subsidaries, like Chrysler is about to become. These compaines are more competitive because they pay less to begin with. They don't give free medical to employees and all there dependends \"for life\" They don't pay the differential of un-employment everytime a plant shuts down like Detrioit does. They don't allow guys that reach 30 years at age 48 or whatever to retire then, almost 20 years earlier than normal getting full pay and that free medical for life. They don't have thousands of non-working \"job bank\" guys sitting around doing nothing, a lot of them actually sit at home all while earning full pay, getting that free medical and logging time toward that 30 years and day retirement at 48. These are US subsidaries of foreign companies an idea that for the most part has always been supported by whoever is going to get the jobs. For example Mobile AL. is all for Airbus coming in to make planes. Nafta and the other trade agreements do not in any way control or have any influence of foreign companies setting up shop in the US. A US company opening a plant in China or where ever a German or Japanese company opening a plant in the US do not fall under the authority of NAFTA or the other trades deals. You mention tarriffs, again if it is made in the US that is a non starter. Transplants that are here IMO are here and nothing can be done to un-ring that bell. To keep from getting more some kind of Federal law, piece meal state to state would never get it done, it would have to be enacted that would not allow ANY foriegn comany from coming to the US not just a law for auto plants, everything no matter what it is, anything short of that would never stand a court challenge. Is the US ready to bar ALL foreign investment in the US? I highly doubt it.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 09:00:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "ETCPJ"
    },
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue. We will not recover, till we disavow NAFTA and it's Asian counterparts and go back to the tariff system... This is all just an exercise in futility, till we realize and correct the problem that go us into this mess in the first place... Respectfully, SUNLINER81",
        "intTime": 20090504,
        "postID": 37,
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue. We will not recover, till we disavow NAFTA and it's Asian counterparts and go back to the tariff system... This is all just an exercise in futility, till we realize and correct the problem that go us into this mess in the first place... Respectfully, SUNLINER81",
        "reply": "",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 09:36:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "Ol_Doc"
    },
    {
        "content": "quote: Originally posted by ETCPJ: S/L You are always railing on and on about NAFTA and \"it's asian counterparts\" as the source of this problem. The moving of jobs to China or where ever is problem and many jobs, more manufacturing jobs than others have moved out of the US due to these trade deals. BUT THAT IS NOT THE PROBLEM with the US owned IE \"the Detroit three\" They are being competed with by \"foreign owned\" companies with US subsidaries, like Chrysler is about to become. These compaines are more competitive because they pay less to begin with. They don't give free medical to employees and all there dependends \"for life\" They don't pay the differential of un-employment everytime a plant shuts down like Detrioit does. They don't allow guys that reach 30 years at age 48 or whatever to retire then, almost 20 years earlier than normal getting full pay and that free medical for life. They don't have thousands of non-working \"job bank\" guys sitting around doing nothing, a lot of them actually sit at home all while earning full pay, getting that free medical and logging time toward that 30 years and day retirement at 48. These are US subsidaries of foreign companies an idea that for the most part has always been supported by whoever is going to get the jobs. For example Mobile AL. is all for Airbus coming in to make planes. Nafta and the other trade agreements do not in any way control or have any influence of foreign companies setting up shop in the US. A US company opening a plant in China or where ever a German or Japanese company opening a plant in the US do not fall under the authority of NAFTA or the other trades deals. You mention tarriffs, again if it is made in the US that is a non starter. Transplants that are here IMO are here and nothing can be done to un-ring that bell. To keep from getting more some kind of Federal law, piece meal state to state would never get it done, it would have to be enacted that would not allow ANY foriegn comany from coming to the US not just a law for auto plants, everything no matter what it is, anything short of that would never stand a court challenge. Is the US ready to bar ALL foreign investment in the US? I highly doubt it. It's called TARIFF, if it isn't made on American soil, with components manufactured on American soil, by American citizens, then slap TARIFFS on it!... Respectfully, SUNLINER81",
        "intTime": 20090508,
        "postID": 38,
        "quote": "Originally posted by ETCPJ: S/L You are always railing on and on about NAFTA and \"it's asian counterparts\" as the source of this problem. The moving of jobs to China or where ever is problem and many jobs, more manufacturing jobs than others have moved out of the US due to these trade deals. BUT THAT IS NOT THE PROBLEM with the US owned IE \"the Detroit three\" They are being competed with by \"foreign owned\" companies with US subsidaries, like Chrysler is about to become. These compaines are more competitive because they pay less to begin with. They don't give free medical to employees and all there dependends \"for life\" They don't pay the differential of un-employment everytime a plant shuts down like Detrioit does. They don't allow guys that reach 30 years at age 48 or whatever to retire then, almost 20 years earlier than normal getting full pay and that free medical for life. They don't have thousands of non-working \"job bank\" guys sitting around doing nothing, a lot of them actually sit at home all while earning full pay, getting that free medical and logging time toward that 30 years and day retirement at 48. These are US subsidaries of foreign companies an idea that for the most part has always been supported by whoever is going to get the jobs. For example Mobile AL. is all for Airbus coming in to make planes. Nafta and the other trade agreements do not in any way control or have any influence of foreign companies setting up shop in the US. A US company opening a plant in China or where ever a German or Japanese company opening a plant in the US do not fall under the authority of NAFTA or the other trades deals. You mention tarriffs, again if it is made in the US that is a non starter. Transplants that are here IMO are here and nothing can be done to un-ring that bell. To keep from getting more some kind of Federal law, piece meal state to state would never get it done, it would have to be enacted that would not allow ANY foriegn comany from coming to the US not just a law for auto plants, everything no matter what it is, anything short of that would never stand a court challenge. Is the US ready to bar ALL foreign investment in the US? I highly doubt it.",
        "reply": " It's called TARIFF, if it isn't made on American soil, with components manufactured on American soil, by American citizens, then slap TARIFFS on it!... Respectfully, SUNLINER81",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-08 20:10:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "SUNLINER81"
    },
    {
        "content": "heck if i filed bankruptcy ya think obama would send me a couple million heck I aint greedy D.J.",
        "intTime": 20090508,
        "postID": 39,
        "quote": "",
        "reply": "heck if i filed bankruptcy ya think obama would send me a couple million heck I aint greedy D.J.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-08 20:13:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "donniejanuarysr"
    },
    {
        "content": "quote: Originally posted by SUNLINER81: It's called TARIFF, if it isn't made on American soil, with components manufactured on American soil, by American citizens, then slap TARIFFS on it!... Respectfully, SUNLINER81 AND.....if the Owner's want to off-shore the labor and also squirrel their profits away in \"protected\" off-shore tax-shelters, then they get to go live there leaving their possessions behind and losing their citizenship! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine",
        "intTime": 20090509,
        "postID": 40,
        "quote": "Originally posted by SUNLINER81: It's called TARIFF, if it isn't made on American soil, with components manufactured on American soil, by American citizens, then slap TARIFFS on it!... Respectfully, SUNLINER81",
        "reply": " AND.....if the Owner's want to off-shore the labor and also squirrel their profits away in \"protected\" off-shore tax-shelters, then they get to go live there leaving their possessions behind and losing their citizenship! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-09 12:57:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "KJ1110"
    },
    {
        "content": "\"http://www.masslive.com/hampfrank/republican/index.ssf?/base/news-19/1241162246224680.xml&coll=1\" WASHINGTON - President Barack Obama forced Chrysler into federal bankruptcy protection on Thursday so it could pursue a life-saving alliance with the Italian automaker Fiat, in yet another extraordinary intervention into private industry by the federal government. Flanked by his automobile task force of Cabinet secretaries and business advisers, Obama announced a plan that would allow the United Automobile Workers retirement plan to take control of Chrysler, with Fiat and the United States as junior partners. The government would lend about $8 billion more to the company, on top of the $4 billion it had already provided. Your Tax Dollars at work You wanted change you got it",
        "intTime": 20090501,
        "postID": 41,
        "quote": "",
        "reply": "\"http://www.masslive.com/hampfrank/republican/index.ssf?/base/news-19/1241162246224680.xml&coll=1\" WASHINGTON - President Barack Obama forced Chrysler into federal bankruptcy protection on Thursday so it could pursue a life-saving alliance with the Italian automaker Fiat, in yet another extraordinary intervention into private industry by the federal government. Flanked by his automobile task force of Cabinet secretaries and business advisers, Obama announced a plan that would allow the United Automobile Workers retirement plan to take control of Chrysler, with Fiat and the United States as junior partners. The government would lend about $8 billion more to the company, on top of the $4 billion it had already provided. Your Tax Dollars at work You wanted change you got it",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 06:39:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "ss_287"
    },
    {
        "content": "quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks.",
        "intTime": 20090501,
        "postID": 42,
        "quote": "Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it",
        "reply": " If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 07:03:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "mrmixitup"
    },
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue.",
        "intTime": 20090501,
        "postID": 43,
        "quote": "Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks.",
        "reply": " If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 07:08:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "adminnco1"
    },
    {
        "content": "We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us.",
        "intTime": 20090501,
        "postID": 44,
        "quote": "",
        "reply": "We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 07:09:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "Vanir97"
    },
    {
        "content": "quote: Originally posted by Vanir97: We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us. You're blaming this on liberals? Chrysler has been a failure since it went private in the 1970's. It's just been one failure after another since 1979. NOTHING COULD OR WOULD HAVE SAVED CHRYSLER They will fail again no matter who buys them because their cars stink and always will stink.",
        "intTime": 20090501,
        "postID": 45,
        "quote": "Originally posted by Vanir97: We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us.",
        "reply": " You're blaming this on liberals? Chrysler has been a failure since it went private in the 1970's. It's just been one failure after another since 1979. NOTHING COULD OR WOULD HAVE SAVED CHRYSLER They will fail again no matter who buys them because their cars stink and always will stink.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 07:21:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "mrmixitup"
    },
    {
        "content": "My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless?",
        "intTime": 20090501,
        "postID": 46,
        "quote": "",
        "reply": "My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless?",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 10:53:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "Bladensburg"
    },
    {
        "content": "quote: Originally posted by Bladensburg: My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless? President Obama said owners of Chrysler products have nothing to worry about. The government will handle it.",
        "intTime": 20090503,
        "postID": 47,
        "quote": "Originally posted by Bladensburg: My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless?",
        "reply": " President Obama said owners of Chrysler products have nothing to worry about. The government will handle it.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-03 21:18:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "scooter_mech"
    },
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue. We will not recover, till we disavow NAFTA and it's Asian counterparts and go back to the tariff system... This is all just an exercise in futility, till we realize and correct the problem that go us into this mess in the first place... Respectfully, SUNLINER81",
        "intTime": 20090503,
        "postID": 48,
        "quote": "Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue.",
        "reply": " We will not recover, till we disavow NAFTA and it's Asian counterparts and go back to the tariff system... This is all just an exercise in futility, till we realize and correct the problem that go us into this mess in the first place... Respectfully, SUNLINER81",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-03 21:28:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "SUNLINER81"
    },
    {
        "content": "I would not mind the government inserting itself in the daily operations of corporate America except for the history of government run commerce. The post office and Amtrak are not exactly fine examples of the best run businesses.",
        "intTime": 20090503,
        "postID": 49,
        "quote": "",
        "reply": "I would not mind the government inserting itself in the daily operations of corporate America except for the history of government run commerce. The post office and Amtrak are not exactly fine examples of the best run businesses.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-03 21:38:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "M123Driver"
    },
    {
        "content": "quote: Originally posted by Bladensburg: My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless? So that's the guy who bought a Jeep last year! In all seriousness, his warranty will remain in effect. He's covered.",
        "intTime": 20090504,
        "postID": 50,
        "quote": "Originally posted by Bladensburg: My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless?",
        "reply": " So that's the guy who bought a Jeep last year! In all seriousness, his warranty will remain in effect. He's covered.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 04:33:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "mrmixitup"
    },
    {
        "content": "Can someone tell me why Fiat will own Chrysler. Who decided this? After giving Chrysler BILLIONS Fiat takes over without spending a dime? Seriously folks what the hell is going on?",
        "intTime": 20090504,
        "postID": 51,
        "quote": "",
        "reply": "Can someone tell me why Fiat will own Chrysler. Who decided this? After giving Chrysler BILLIONS Fiat takes over without spending a dime? Seriously folks what the hell is going on?",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 05:31:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "m1tom"
    },
    {
        "content": "If they'd cut their prices by half, they'd sell everything they've got, drive the competition (Toyota, etc) off or into bankruptcy and keep at least some cash flow going to keep going - too stupid to do it!! Better to close down and lay everybody off than cut everything back and stay afloat - duh!! Wandering and Wondering",
        "intTime": 20090504,
        "postID": 52,
        "quote": "",
        "reply": "If they'd cut their prices by half, they'd sell everything they've got, drive the competition (Toyota, etc) off or into bankruptcy and keep at least some cash flow going to keep going - too stupid to do it!! Better to close down and lay everybody off than cut everything back and stay afloat - duh!! Wandering and Wondering",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 05:34:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "greywolfghost"
    },
    {
        "content": "quote: Originally posted by Vanir97: We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us. Like the Reps would not have done the same thing? My hopes are that one day people will wake up..but I'm not holding my breath. We need someone TRULY conservative, even MUCH more so than Reagan at this stage of the game.",
        "intTime": 20090504,
        "postID": 53,
        "quote": "Originally posted by Vanir97: We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us.",
        "reply": " Like the Reps would not have done the same thing? My hopes are that one day people will wake up..but I'm not holding my breath. We need someone TRULY conservative, even MUCH more so than Reagan at this stage of the game.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 05:51:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. LOL The sales force where I used to work had Sebrings --about 500 of them -- and they were completely despised. Walt",
        "intTime": 20090504,
        "postID": 54,
        "quote": "Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks.",
        "reply": " LOL The sales force where I used to work had Sebrings --about 500 of them -- and they were completely despised. Walt",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 06:42:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "WhiskeyPapa"
    },
    {
        "content": "If I would win any Chrysler in some kind of lottery or prize I would pay the tax on it(of course nothing is free) and the next day it would be on the lemon lot at Camp Lejeune with a price so low that any PFC in the USMC could afford to buy it. This President and this country just cannot say the word \"NO\" unless something is totally screwed up. Then they stand on the roof tops and yell \" Yes, Yes, Yes\". My wife and I yesterday went to a large plant nursery to buy some mater plants and some flowers. I asked the woman at the cash resister if they had any Obama Plants and she asked what was that? I told her it was a money tree that kept coming back every year.",
        "intTime": 20090504,
        "postID": 55,
        "quote": "",
        "reply": "If I would win any Chrysler in some kind of lottery or prize I would pay the tax on it(of course nothing is free) and the next day it would be on the lemon lot at Camp Lejeune with a price so low that any PFC in the USMC could afford to buy it. This President and this country just cannot say the word \"NO\" unless something is totally screwed up. Then they stand on the roof tops and yell \" Yes, Yes, Yes\". My wife and I yesterday went to a large plant nursery to buy some mater plants and some flowers. I asked the woman at the cash resister if they had any Obama Plants and she asked what was that? I told her it was a money tree that kept coming back every year.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 06:48:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "Duster6"
    },
    {
        "content": "S/L You are always railing on and on about NAFTA and \"it's asian counterparts\" as the source of this problem. The moving of jobs to China or where ever is problem and many jobs, more manufacturing jobs than others have moved out of the US due to these trade deals. BUT THAT IS NOT THE PROBLEM with the US owned IE \"the Detroit three\" They are being competed with by \"foreign owned\" companies with US subsidaries, like Chrysler is about to become. These compaines are more competitive because they pay less to begin with. They don't give free medical to employees and all there dependends \"for life\" They don't pay the differential of un-employment everytime a plant shuts down like Detrioit does. They don't allow guys that reach 30 years at age 48 or whatever to retire then, almost 20 years earlier than normal getting full pay and that free medical for life. They don't have thousands of non-working \"job bank\" guys sitting around doing nothing, a lot of them actually sit at home all while earning full pay, getting that free medical and logging time toward that 30 years and day retirement at 48. These are US subsidaries of foreign companies an idea that for the most part has always been supported by whoever is going to get the jobs. For example Mobile AL. is all for Airbus coming in to make planes. Nafta and the other trade agreements do not in any way control or have any influence of foreign companies setting up shop in the US. A US company opening a plant in China or where ever a German or Japanese company opening a plant in the US do not fall under the authority of NAFTA or the other trades deals. You mention tarriffs, again if it is made in the US that is a non starter. Transplants that are here IMO are here and nothing can be done to un-ring that bell. To keep from getting more some kind of Federal law, piece meal state to state would never get it done, it would have to be enacted that would not allow ANY foriegn comany from coming to the US not just a law for auto plants, everything no matter what it is, anything short of that would never stand a court challenge. Is the US ready to bar ALL foreign investment in the US? I highly doubt it.",
        "intTime": 20090504,
        "postID": 56,
        "quote": "",
        "reply": "S/L You are always railing on and on about NAFTA and \"it's asian counterparts\" as the source of this problem. The moving of jobs to China or where ever is problem and many jobs, more manufacturing jobs than others have moved out of the US due to these trade deals. BUT THAT IS NOT THE PROBLEM with the US owned IE \"the Detroit three\" They are being competed with by \"foreign owned\" companies with US subsidaries, like Chrysler is about to become. These compaines are more competitive because they pay less to begin with. They don't give free medical to employees and all there dependends \"for life\" They don't pay the differential of un-employment everytime a plant shuts down like Detrioit does. They don't allow guys that reach 30 years at age 48 or whatever to retire then, almost 20 years earlier than normal getting full pay and that free medical for life. They don't have thousands of non-working \"job bank\" guys sitting around doing nothing, a lot of them actually sit at home all while earning full pay, getting that free medical and logging time toward that 30 years and day retirement at 48. These are US subsidaries of foreign companies an idea that for the most part has always been supported by whoever is going to get the jobs. For example Mobile AL. is all for Airbus coming in to make planes. Nafta and the other trade agreements do not in any way control or have any influence of foreign companies setting up shop in the US. A US company opening a plant in China or where ever a German or Japanese company opening a plant in the US do not fall under the authority of NAFTA or the other trades deals. You mention tarriffs, again if it is made in the US that is a non starter. Transplants that are here IMO are here and nothing can be done to un-ring that bell. To keep from getting more some kind of Federal law, piece meal state to state would never get it done, it would have to be enacted that would not allow ANY foriegn comany from coming to the US not just a law for auto plants, everything no matter what it is, anything short of that would never stand a court challenge. Is the US ready to bar ALL foreign investment in the US? I highly doubt it.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 09:00:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "ETCPJ"
    },
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue. We will not recover, till we disavow NAFTA and it's Asian counterparts and go back to the tariff system... This is all just an exercise in futility, till we realize and correct the problem that go us into this mess in the first place... Respectfully, SUNLINER81",
        "intTime": 20090504,
        "postID": 57,
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue. We will not recover, till we disavow NAFTA and it's Asian counterparts and go back to the tariff system... This is all just an exercise in futility, till we realize and correct the problem that go us into this mess in the first place... Respectfully, SUNLINER81",
        "reply": "",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 09:36:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "Ol_Doc"
    },
    {
        "content": "quote: Originally posted by ETCPJ: S/L You are always railing on and on about NAFTA and \"it's asian counterparts\" as the source of this problem. The moving of jobs to China or where ever is problem and many jobs, more manufacturing jobs than others have moved out of the US due to these trade deals. BUT THAT IS NOT THE PROBLEM with the US owned IE \"the Detroit three\" They are being competed with by \"foreign owned\" companies with US subsidaries, like Chrysler is about to become. These compaines are more competitive because they pay less to begin with. They don't give free medical to employees and all there dependends \"for life\" They don't pay the differential of un-employment everytime a plant shuts down like Detrioit does. They don't allow guys that reach 30 years at age 48 or whatever to retire then, almost 20 years earlier than normal getting full pay and that free medical for life. They don't have thousands of non-working \"job bank\" guys sitting around doing nothing, a lot of them actually sit at home all while earning full pay, getting that free medical and logging time toward that 30 years and day retirement at 48. These are US subsidaries of foreign companies an idea that for the most part has always been supported by whoever is going to get the jobs. For example Mobile AL. is all for Airbus coming in to make planes. Nafta and the other trade agreements do not in any way control or have any influence of foreign companies setting up shop in the US. A US company opening a plant in China or where ever a German or Japanese company opening a plant in the US do not fall under the authority of NAFTA or the other trades deals. You mention tarriffs, again if it is made in the US that is a non starter. Transplants that are here IMO are here and nothing can be done to un-ring that bell. To keep from getting more some kind of Federal law, piece meal state to state would never get it done, it would have to be enacted that would not allow ANY foriegn comany from coming to the US not just a law for auto plants, everything no matter what it is, anything short of that would never stand a court challenge. Is the US ready to bar ALL foreign investment in the US? I highly doubt it. It's called TARIFF, if it isn't made on American soil, with components manufactured on American soil, by American citizens, then slap TARIFFS on it!... Respectfully, SUNLINER81",
        "intTime": 20090508,
        "postID": 58,
        "quote": "Originally posted by ETCPJ: S/L You are always railing on and on about NAFTA and \"it's asian counterparts\" as the source of this problem. The moving of jobs to China or where ever is problem and many jobs, more manufacturing jobs than others have moved out of the US due to these trade deals. BUT THAT IS NOT THE PROBLEM with the US owned IE \"the Detroit three\" They are being competed with by \"foreign owned\" companies with US subsidaries, like Chrysler is about to become. These compaines are more competitive because they pay less to begin with. They don't give free medical to employees and all there dependends \"for life\" They don't pay the differential of un-employment everytime a plant shuts down like Detrioit does. They don't allow guys that reach 30 years at age 48 or whatever to retire then, almost 20 years earlier than normal getting full pay and that free medical for life. They don't have thousands of non-working \"job bank\" guys sitting around doing nothing, a lot of them actually sit at home all while earning full pay, getting that free medical and logging time toward that 30 years and day retirement at 48. These are US subsidaries of foreign companies an idea that for the most part has always been supported by whoever is going to get the jobs. For example Mobile AL. is all for Airbus coming in to make planes. Nafta and the other trade agreements do not in any way control or have any influence of foreign companies setting up shop in the US. A US company opening a plant in China or where ever a German or Japanese company opening a plant in the US do not fall under the authority of NAFTA or the other trades deals. You mention tarriffs, again if it is made in the US that is a non starter. Transplants that are here IMO are here and nothing can be done to un-ring that bell. To keep from getting more some kind of Federal law, piece meal state to state would never get it done, it would have to be enacted that would not allow ANY foriegn comany from coming to the US not just a law for auto plants, everything no matter what it is, anything short of that would never stand a court challenge. Is the US ready to bar ALL foreign investment in the US? I highly doubt it.",
        "reply": " It's called TARIFF, if it isn't made on American soil, with components manufactured on American soil, by American citizens, then slap TARIFFS on it!... Respectfully, SUNLINER81",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-08 20:10:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "SUNLINER81"
    },
    {
        "content": "heck if i filed bankruptcy ya think obama would send me a couple million heck I aint greedy D.J.",
        "intTime": 20090508,
        "postID": 59,
        "quote": "",
        "reply": "heck if i filed bankruptcy ya think obama would send me a couple million heck I aint greedy D.J.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-08 20:13:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "donniejanuarysr"
    },
    {
        "content": "quote: Originally posted by SUNLINER81: It's called TARIFF, if it isn't made on American soil, with components manufactured on American soil, by American citizens, then slap TARIFFS on it!... Respectfully, SUNLINER81 AND.....if the Owner's want to off-shore the labor and also squirrel their profits away in \"protected\" off-shore tax-shelters, then they get to go live there leaving their possessions behind and losing their citizenship! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine",
        "intTime": 20090509,
        "postID": 60,
        "quote": "Originally posted by SUNLINER81: It's called TARIFF, if it isn't made on American soil, with components manufactured on American soil, by American citizens, then slap TARIFFS on it!... Respectfully, SUNLINER81",
        "reply": " AND.....if the Owner's want to off-shore the labor and also squirrel their profits away in \"protected\" off-shore tax-shelters, then they get to go live there leaving their possessions behind and losing their citizenship! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-09 12:57:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "KJ1110"
    },
    {
        "content": "\"http://www.masslive.com/hampfrank/republican/index.ssf?/base/news-19/1241162246224680.xml&coll=1\" WASHINGTON - President Barack Obama forced Chrysler into federal bankruptcy protection on Thursday so it could pursue a life-saving alliance with the Italian automaker Fiat, in yet another extraordinary intervention into private industry by the federal government. Flanked by his automobile task force of Cabinet secretaries and business advisers, Obama announced a plan that would allow the United Automobile Workers retirement plan to take control of Chrysler, with Fiat and the United States as junior partners. The government would lend about $8 billion more to the company, on top of the $4 billion it had already provided. Your Tax Dollars at work You wanted change you got it",
        "intTime": 20090501,
        "postID": 61,
        "quote": "",
        "reply": "\"http://www.masslive.com/hampfrank/republican/index.ssf?/base/news-19/1241162246224680.xml&coll=1\" WASHINGTON - President Barack Obama forced Chrysler into federal bankruptcy protection on Thursday so it could pursue a life-saving alliance with the Italian automaker Fiat, in yet another extraordinary intervention into private industry by the federal government. Flanked by his automobile task force of Cabinet secretaries and business advisers, Obama announced a plan that would allow the United Automobile Workers retirement plan to take control of Chrysler, with Fiat and the United States as junior partners. The government would lend about $8 billion more to the company, on top of the $4 billion it had already provided. Your Tax Dollars at work You wanted change you got it",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 06:39:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "ss_287"
    },
    {
        "content": "quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks.",
        "intTime": 20090501,
        "postID": 62,
        "quote": "Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it",
        "reply": " If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 07:03:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "mrmixitup"
    },
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue.",
        "intTime": 20090501,
        "postID": 63,
        "quote": "Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks.",
        "reply": " If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 07:08:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "adminnco1"
    },
    {
        "content": "We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us.",
        "intTime": 20090501,
        "postID": 64,
        "quote": "",
        "reply": "We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 07:09:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "Vanir97"
    },
    {
        "content": "quote: Originally posted by Vanir97: We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us. You're blaming this on liberals? Chrysler has been a failure since it went private in the 1970's. It's just been one failure after another since 1979. NOTHING COULD OR WOULD HAVE SAVED CHRYSLER They will fail again no matter who buys them because their cars stink and always will stink.",
        "intTime": 20090501,
        "postID": 65,
        "quote": "Originally posted by Vanir97: We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us.",
        "reply": " You're blaming this on liberals? Chrysler has been a failure since it went private in the 1970's. It's just been one failure after another since 1979. NOTHING COULD OR WOULD HAVE SAVED CHRYSLER They will fail again no matter who buys them because their cars stink and always will stink.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 07:21:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "mrmixitup"
    },
    {
        "content": "My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless?",
        "intTime": 20090501,
        "postID": 66,
        "quote": "",
        "reply": "My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless?",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-01 10:53:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "Bladensburg"
    },
    {
        "content": "quote: Originally posted by Bladensburg: My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless? President Obama said owners of Chrysler products have nothing to worry about. The government will handle it.",
        "intTime": 20090503,
        "postID": 67,
        "quote": "Originally posted by Bladensburg: My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless?",
        "reply": " President Obama said owners of Chrysler products have nothing to worry about. The government will handle it.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-03 21:18:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "scooter_mech"
    },
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue. We will not recover, till we disavow NAFTA and it's Asian counterparts and go back to the tariff system... This is all just an exercise in futility, till we realize and correct the problem that go us into this mess in the first place... Respectfully, SUNLINER81",
        "intTime": 20090503,
        "postID": 68,
        "quote": "Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue.",
        "reply": " We will not recover, till we disavow NAFTA and it's Asian counterparts and go back to the tariff system... This is all just an exercise in futility, till we realize and correct the problem that go us into this mess in the first place... Respectfully, SUNLINER81",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-03 21:28:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "SUNLINER81"
    },
    {
        "content": "I would not mind the government inserting itself in the daily operations of corporate America except for the history of government run commerce. The post office and Amtrak are not exactly fine examples of the best run businesses.",
        "intTime": 20090503,
        "postID": 69,
        "quote": "",
        "reply": "I would not mind the government inserting itself in the daily operations of corporate America except for the history of government run commerce. The post office and Amtrak are not exactly fine examples of the best run businesses.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-03 21:38:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "M123Driver"
    },
    {
        "content": "quote: Originally posted by Bladensburg: My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless? So that's the guy who bought a Jeep last year! In all seriousness, his warranty will remain in effect. He's covered.",
        "intTime": 20090504,
        "postID": 70,
        "quote": "Originally posted by Bladensburg: My mate's just bought a new Jeep, am I right in assuming that his warranty is now worthless?",
        "reply": " So that's the guy who bought a Jeep last year! In all seriousness, his warranty will remain in effect. He's covered.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 04:33:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "mrmixitup"
    },
    {
        "content": "Can someone tell me why Fiat will own Chrysler. Who decided this? After giving Chrysler BILLIONS Fiat takes over without spending a dime? Seriously folks what the hell is going on?",
        "intTime": 20090504,
        "postID": 71,
        "quote": "",
        "reply": "Can someone tell me why Fiat will own Chrysler. Who decided this? After giving Chrysler BILLIONS Fiat takes over without spending a dime? Seriously folks what the hell is going on?",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 05:31:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "m1tom"
    },
    {
        "content": "If they'd cut their prices by half, they'd sell everything they've got, drive the competition (Toyota, etc) off or into bankruptcy and keep at least some cash flow going to keep going - too stupid to do it!! Better to close down and lay everybody off than cut everything back and stay afloat - duh!! Wandering and Wondering",
        "intTime": 20090504,
        "postID": 72,
        "quote": "",
        "reply": "If they'd cut their prices by half, they'd sell everything they've got, drive the competition (Toyota, etc) off or into bankruptcy and keep at least some cash flow going to keep going - too stupid to do it!! Better to close down and lay everybody off than cut everything back and stay afloat - duh!! Wandering and Wondering",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 05:34:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "greywolfghost"
    },
    {
        "content": "quote: Originally posted by Vanir97: We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us. Like the Reps would not have done the same thing? My hopes are that one day people will wake up..but I'm not holding my breath. We need someone TRULY conservative, even MUCH more so than Reagan at this stage of the game.",
        "intTime": 20090504,
        "postID": 73,
        "quote": "Originally posted by Vanir97: We are certainly lucky to have the liberals in charge of the Government. I wake up each morning and wonder what they will screw up today. The way we are headed we will have a completely bankrupt country within a year. We had better learn to speak chinese because they will own us.",
        "reply": " Like the Reps would not have done the same thing? My hopes are that one day people will wake up..but I'm not holding my breath. We need someone TRULY conservative, even MUCH more so than Reagan at this stage of the game.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 05:51:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. LOL The sales force where I used to work had Sebrings --about 500 of them -- and they were completely despised. Walt",
        "intTime": 20090504,
        "postID": 74,
        "quote": "Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks.",
        "reply": " LOL The sales force where I used to work had Sebrings --about 500 of them -- and they were completely despised. Walt",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 06:42:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "WhiskeyPapa"
    },
    {
        "content": "If I would win any Chrysler in some kind of lottery or prize I would pay the tax on it(of course nothing is free) and the next day it would be on the lemon lot at Camp Lejeune with a price so low that any PFC in the USMC could afford to buy it. This President and this country just cannot say the word \"NO\" unless something is totally screwed up. Then they stand on the roof tops and yell \" Yes, Yes, Yes\". My wife and I yesterday went to a large plant nursery to buy some mater plants and some flowers. I asked the woman at the cash resister if they had any Obama Plants and she asked what was that? I told her it was a money tree that kept coming back every year.",
        "intTime": 20090504,
        "postID": 75,
        "quote": "",
        "reply": "If I would win any Chrysler in some kind of lottery or prize I would pay the tax on it(of course nothing is free) and the next day it would be on the lemon lot at Camp Lejeune with a price so low that any PFC in the USMC could afford to buy it. This President and this country just cannot say the word \"NO\" unless something is totally screwed up. Then they stand on the roof tops and yell \" Yes, Yes, Yes\". My wife and I yesterday went to a large plant nursery to buy some mater plants and some flowers. I asked the woman at the cash resister if they had any Obama Plants and she asked what was that? I told her it was a money tree that kept coming back every year.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 06:48:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "Duster6"
    },
    {
        "content": "S/L You are always railing on and on about NAFTA and \"it's asian counterparts\" as the source of this problem. The moving of jobs to China or where ever is problem and many jobs, more manufacturing jobs than others have moved out of the US due to these trade deals. BUT THAT IS NOT THE PROBLEM with the US owned IE \"the Detroit three\" They are being competed with by \"foreign owned\" companies with US subsidaries, like Chrysler is about to become. These compaines are more competitive because they pay less to begin with. They don't give free medical to employees and all there dependends \"for life\" They don't pay the differential of un-employment everytime a plant shuts down like Detrioit does. They don't allow guys that reach 30 years at age 48 or whatever to retire then, almost 20 years earlier than normal getting full pay and that free medical for life. They don't have thousands of non-working \"job bank\" guys sitting around doing nothing, a lot of them actually sit at home all while earning full pay, getting that free medical and logging time toward that 30 years and day retirement at 48. These are US subsidaries of foreign companies an idea that for the most part has always been supported by whoever is going to get the jobs. For example Mobile AL. is all for Airbus coming in to make planes. Nafta and the other trade agreements do not in any way control or have any influence of foreign companies setting up shop in the US. A US company opening a plant in China or where ever a German or Japanese company opening a plant in the US do not fall under the authority of NAFTA or the other trades deals. You mention tarriffs, again if it is made in the US that is a non starter. Transplants that are here IMO are here and nothing can be done to un-ring that bell. To keep from getting more some kind of Federal law, piece meal state to state would never get it done, it would have to be enacted that would not allow ANY foriegn comany from coming to the US not just a law for auto plants, everything no matter what it is, anything short of that would never stand a court challenge. Is the US ready to bar ALL foreign investment in the US? I highly doubt it.",
        "intTime": 20090504,
        "postID": 76,
        "quote": "",
        "reply": "S/L You are always railing on and on about NAFTA and \"it's asian counterparts\" as the source of this problem. The moving of jobs to China or where ever is problem and many jobs, more manufacturing jobs than others have moved out of the US due to these trade deals. BUT THAT IS NOT THE PROBLEM with the US owned IE \"the Detroit three\" They are being competed with by \"foreign owned\" companies with US subsidaries, like Chrysler is about to become. These compaines are more competitive because they pay less to begin with. They don't give free medical to employees and all there dependends \"for life\" They don't pay the differential of un-employment everytime a plant shuts down like Detrioit does. They don't allow guys that reach 30 years at age 48 or whatever to retire then, almost 20 years earlier than normal getting full pay and that free medical for life. They don't have thousands of non-working \"job bank\" guys sitting around doing nothing, a lot of them actually sit at home all while earning full pay, getting that free medical and logging time toward that 30 years and day retirement at 48. These are US subsidaries of foreign companies an idea that for the most part has always been supported by whoever is going to get the jobs. For example Mobile AL. is all for Airbus coming in to make planes. Nafta and the other trade agreements do not in any way control or have any influence of foreign companies setting up shop in the US. A US company opening a plant in China or where ever a German or Japanese company opening a plant in the US do not fall under the authority of NAFTA or the other trades deals. You mention tarriffs, again if it is made in the US that is a non starter. Transplants that are here IMO are here and nothing can be done to un-ring that bell. To keep from getting more some kind of Federal law, piece meal state to state would never get it done, it would have to be enacted that would not allow ANY foriegn comany from coming to the US not just a law for auto plants, everything no matter what it is, anything short of that would never stand a court challenge. Is the US ready to bar ALL foreign investment in the US? I highly doubt it.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 09:00:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "ETCPJ"
    },
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue. We will not recover, till we disavow NAFTA and it's Asian counterparts and go back to the tariff system... This is all just an exercise in futility, till we realize and correct the problem that go us into this mess in the first place... Respectfully, SUNLINER81",
        "intTime": 20090504,
        "postID": 77,
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by adminnco1: quote: Originally posted by mrmixitup: quote: Originally posted by ss_287: Your Tax Dollars at work You wanted change you got it If we didn't loan them money, people would be complaining that our government didn't do enough to save it. People aren't happy either way. This also isn't the first time the government has lent money to Chrysler. This also doesn't mean Chrysler is done for, it's going to reorganize so it can fail again in 10 years because the Sebring still sucks. If we didn't \"loan\" them the money the union would takes its votes elsewhere. As long as the UAW can produce as it did last November the support of the Democratic Party will continue. We will not recover, till we disavow NAFTA and it's Asian counterparts and go back to the tariff system... This is all just an exercise in futility, till we realize and correct the problem that go us into this mess in the first place... Respectfully, SUNLINER81",
        "reply": "",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-04 09:36:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "Ol_Doc"
    },
    {
        "content": "quote: Originally posted by ETCPJ: S/L You are always railing on and on about NAFTA and \"it's asian counterparts\" as the source of this problem. The moving of jobs to China or where ever is problem and many jobs, more manufacturing jobs than others have moved out of the US due to these trade deals. BUT THAT IS NOT THE PROBLEM with the US owned IE \"the Detroit three\" They are being competed with by \"foreign owned\" companies with US subsidaries, like Chrysler is about to become. These compaines are more competitive because they pay less to begin with. They don't give free medical to employees and all there dependends \"for life\" They don't pay the differential of un-employment everytime a plant shuts down like Detrioit does. They don't allow guys that reach 30 years at age 48 or whatever to retire then, almost 20 years earlier than normal getting full pay and that free medical for life. They don't have thousands of non-working \"job bank\" guys sitting around doing nothing, a lot of them actually sit at home all while earning full pay, getting that free medical and logging time toward that 30 years and day retirement at 48. These are US subsidaries of foreign companies an idea that for the most part has always been supported by whoever is going to get the jobs. For example Mobile AL. is all for Airbus coming in to make planes. Nafta and the other trade agreements do not in any way control or have any influence of foreign companies setting up shop in the US. A US company opening a plant in China or where ever a German or Japanese company opening a plant in the US do not fall under the authority of NAFTA or the other trades deals. You mention tarriffs, again if it is made in the US that is a non starter. Transplants that are here IMO are here and nothing can be done to un-ring that bell. To keep from getting more some kind of Federal law, piece meal state to state would never get it done, it would have to be enacted that would not allow ANY foriegn comany from coming to the US not just a law for auto plants, everything no matter what it is, anything short of that would never stand a court challenge. Is the US ready to bar ALL foreign investment in the US? I highly doubt it. It's called TARIFF, if it isn't made on American soil, with components manufactured on American soil, by American citizens, then slap TARIFFS on it!... Respectfully, SUNLINER81",
        "intTime": 20090508,
        "postID": 78,
        "quote": "Originally posted by ETCPJ: S/L You are always railing on and on about NAFTA and \"it's asian counterparts\" as the source of this problem. The moving of jobs to China or where ever is problem and many jobs, more manufacturing jobs than others have moved out of the US due to these trade deals. BUT THAT IS NOT THE PROBLEM with the US owned IE \"the Detroit three\" They are being competed with by \"foreign owned\" companies with US subsidaries, like Chrysler is about to become. These compaines are more competitive because they pay less to begin with. They don't give free medical to employees and all there dependends \"for life\" They don't pay the differential of un-employment everytime a plant shuts down like Detrioit does. They don't allow guys that reach 30 years at age 48 or whatever to retire then, almost 20 years earlier than normal getting full pay and that free medical for life. They don't have thousands of non-working \"job bank\" guys sitting around doing nothing, a lot of them actually sit at home all while earning full pay, getting that free medical and logging time toward that 30 years and day retirement at 48. These are US subsidaries of foreign companies an idea that for the most part has always been supported by whoever is going to get the jobs. For example Mobile AL. is all for Airbus coming in to make planes. Nafta and the other trade agreements do not in any way control or have any influence of foreign companies setting up shop in the US. A US company opening a plant in China or where ever a German or Japanese company opening a plant in the US do not fall under the authority of NAFTA or the other trades deals. You mention tarriffs, again if it is made in the US that is a non starter. Transplants that are here IMO are here and nothing can be done to un-ring that bell. To keep from getting more some kind of Federal law, piece meal state to state would never get it done, it would have to be enacted that would not allow ANY foriegn comany from coming to the US not just a law for auto plants, everything no matter what it is, anything short of that would never stand a court challenge. Is the US ready to bar ALL foreign investment in the US? I highly doubt it.",
        "reply": " It's called TARIFF, if it isn't made on American soil, with components manufactured on American soil, by American citizens, then slap TARIFFS on it!... Respectfully, SUNLINER81",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-08 20:10:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "SUNLINER81"
    },
    {
        "content": "heck if i filed bankruptcy ya think obama would send me a couple million heck I aint greedy D.J.",
        "intTime": 20090508,
        "postID": 79,
        "quote": "",
        "reply": "heck if i filed bankruptcy ya think obama would send me a couple million heck I aint greedy D.J.",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-08 20:13:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "donniejanuarysr"
    },
    {
        "content": "quote: Originally posted by SUNLINER81: It's called TARIFF, if it isn't made on American soil, with components manufactured on American soil, by American citizens, then slap TARIFFS on it!... Respectfully, SUNLINER81 AND.....if the Owner's want to off-shore the labor and also squirrel their profits away in \"protected\" off-shore tax-shelters, then they get to go live there leaving their possessions behind and losing their citizenship! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine",
        "intTime": 20090509,
        "postID": 80,
        "quote": "Originally posted by SUNLINER81: It's called TARIFF, if it isn't made on American soil, with components manufactured on American soil, by American citizens, then slap TARIFFS on it!... Respectfully, SUNLINER81",
        "reply": " AND.....if the Owner's want to off-shore the labor and also squirrel their profits away in \"protected\" off-shore tax-shelters, then they get to go live there leaving their possessions behind and losing their citizenship! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine",
        "threadID": "672198221_9400042222001",
        "time": "2009-05-09 12:57:00",
        "title": "Chrysler files for Chapter 11 and will get 8B funding",
        "userID": "KJ1110"
    }
]