[
    {
        "content": "Here's one for your morning laugh: \"http://www.nbclosangeles.com/news/local/Reporter-Dragged-Kicking-and-Screaming-From-Near-Air-Force-One-.html?corder=reverse&pg=8\" quote: A reporter for a small newspaper was forcibly removed from a press area near Air Force One shortly before President Barack Obama arrived at Los Angeles International Airport to depart California early Thursday. Airport security officers carried the woman away by the feet and arms as she protested her removal. She later identified herself as Brenda Lee, a writer for the Georgia Informer in Macon and said she has White House press credentials. The newspaper's Web site says it is a monthly publication, and a Brenda Lee column is posted on it. quote: Lee said in a telephone interview with The Associated Press that she wanted to hand Obama a letter urging him \"to take a stand for traditional marriage.\" She said she asked a Secret Service agent to give the president her letter, but he refused and referred her to a White House staffer. Lee said she refused to give the staffer the letter. \"I said, 'I'll take my chances if (the president) comes by here,'\" said Lee, who identified herself as a Roman Catholic priestess who lives in Anaheim, Calif. \"He became annoyed that I wouldn't give him the letter.\" Since when did Catholicism have Priestesses? quote: Lee, who said this was the second presidential event she has covered, was later released. It'll also be your last I'm glad the Secret Service is doing a good job keeping these loons from the President",
        "intTime": 20090529,
        "postID": 1,
        "quote": "A reporter for a small newspaper was forcibly removed from a press area near Air Force One shortly before President Barack Obama arrived at Los Angeles International Airport to depart California early Thursday. Airport security officers carried the woman away by the feet and arms as she protested her removal. She later identified herself as Brenda Lee, a writer for the Georgia Informer in Macon and said she has White House press credentials. The newspaper's Web site says it is a monthly publication, and a Brenda Lee column is posted on it.",
        "reply": "Here's one for your morning laugh: \"http://www.nbclosangeles.com/news/local/Reporter-Dragged-Kicking-and-Screaming-From-Near-Air-Force-One-.html?corder=reverse&pg=8\"  quote: Lee said in a telephone interview with The Associated Press that she wanted to hand Obama a letter urging him \"to take a stand for traditional marriage.\" She said she asked a Secret Service agent to give the president her letter, but he refused and referred her to a White House staffer. Lee said she refused to give the staffer the letter. \"I said, 'I'll take my chances if (the president) comes by here,'\" said Lee, who identified herself as a Roman Catholic priestess who lives in Anaheim, Calif. \"He became annoyed that I wouldn't give him the letter.\" Since when did Catholicism have Priestesses? quote: Lee, who said this was the second presidential event she has covered, was later released. It'll also be your last I'm glad the Secret Service is doing a good job keeping these loons from the President",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 05:12:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "PhoenixDark"
    },
    {
        "content": "Bet it was the last one she ever covers as well. Secret Service, doing their job as usual.",
        "intTime": 20090529,
        "postID": 2,
        "quote": "",
        "reply": "Bet it was the last one she ever covers as well. Secret Service, doing their job as usual.",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 05:57:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "LineDoggie"
    },
    {
        "content": "Gald it didn't happen when President Bush was in office. The cries of racism would still be heard. BTW - she a relative or friend of McKinney????? Just wondering.......",
        "intTime": 20090529,
        "postID": 3,
        "quote": "",
        "reply": "Gald it didn't happen when President Bush was in office. The cries of racism would still be heard. BTW - she a relative or friend of McKinney????? Just wondering.......",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 05:58:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "sw614"
    },
    {
        "content": "For a second, I thought that was Michelle... \"The World's Finest\"",
        "intTime": 20090529,
        "postID": 4,
        "quote": "",
        "reply": "For a second, I thought that was Michelle... \"The World's Finest\"",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 06:05:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "Kegler300"
    },
    {
        "content": "quote: Originally posted by Kegler300: For a second, I thought that was Michelle... Omg..",
        "intTime": 20090529,
        "postID": 5,
        "quote": "Originally posted by Kegler300: For a second, I thought that was Michelle...",
        "reply": " Omg..",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 06:16:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "MrsCamo"
    },
    {
        "content": "quote: Originally posted by Kegler300: For a second, I thought that was Michelle... Nope, the ankles aren't big enough.",
        "intTime": 20090529,
        "postID": 6,
        "quote": "Originally posted by Kegler300: For a second, I thought that was Michelle...",
        "reply": " Nope, the ankles aren't big enough.",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 09:48:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "shuman14"
    },
    {
        "content": "quote: Originally posted by Kegler300: For a second, I thought that was Michelle... now that was funny.",
        "intTime": 20090529,
        "postID": 7,
        "quote": "Originally posted by Kegler300: For a second, I thought that was Michelle...",
        "reply": " now that was funny.",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 10:00:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "usa_girl"
    },
    {
        "content": "What a selfish woman.",
        "intTime": 20090529,
        "postID": 8,
        "quote": "",
        "reply": "What a selfish woman.",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 14:33:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "mrmixitup"
    },
    {
        "content": "quote: Originally posted by mrmixitup: What a selfish woman. Right on cue. God, this PC Culture is driving me MAD...",
        "intTime": 20090529,
        "postID": 9,
        "quote": "Originally posted by mrmixitup: What a selfish woman.",
        "reply": " Right on cue. God, this PC Culture is driving me MAD...",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 14:40:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "Irwin_R_Schyster"
    },
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by mrmixitup: What a selfish woman. Right on cue. God, this PC Culture is driving me MAD... Huh? I wasn't complementing the woman. I was calling her selfish. I also think her actions were those of a spoiled idiot. What did you think I meant?",
        "intTime": 20090529,
        "postID": 10,
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by mrmixitup: What a selfish woman. Right on cue. God, this PC Culture is driving me MAD...",
        "reply": " Huh? I wasn't complementing the woman. I was calling her selfish. I also think her actions were those of a spoiled idiot. What did you think I meant?",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 16:39:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "mrmixitup"
    },
    {
        "content": "Just another homophobic bigot - who believed her homophobic bigotry gives her special status and can allow her to threaten the President of the United States to his face. Ever notice how American homophobic bigots believe they are the American mainstream and every American who isn't a homophobic bigot is out of the mainstream? Protecting the President of the United States from fruit loops and nut-cases - just a normal \"day on the job\" for the Secret Service's Presidential Protection Detail.",
        "intTime": 20090529,
        "postID": 11,
        "quote": "",
        "reply": "Just another homophobic bigot - who believed her homophobic bigotry gives her special status and can allow her to threaten the President of the United States to his face. Ever notice how American homophobic bigots believe they are the American mainstream and every American who isn't a homophobic bigot is out of the mainstream? Protecting the President of the United States from fruit loops and nut-cases - just a normal \"day on the job\" for the Secret Service's Presidential Protection Detail.",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 17:08:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "Fightdirector"
    },
    {
        "content": "Why didn't the Secret Service break her legs and punch her four times in the mouth? Where is Black Water when you need them?",
        "intTime": 20090529,
        "postID": 12,
        "quote": "",
        "reply": "Why didn't the Secret Service break her legs and punch her four times in the mouth? Where is Black Water when you need them?",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 17:16:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Fightdirector: Just another homophobic bigot - who believed her homophobic bigotry gives her special status and can allow her to threaten the President of the United States to his face. Ever notice how American homophobic bigots believe they are the American mainstream and every American who isn't a homophobic bigot is out of the mainstream? Protecting the President of the United States from fruit loops and nut-cases - just a normal \"day on the job\" for the Secret Service's Presidential Protection Detail. I like the fact that anyone with a different opinion then you have is a homophobic bigot. I guess if you don't have an actual point to make then calling names is a suitable substitute. This is a story of one whacked out lady, who happens to believe in the actual definition of marriage, and you have to try and hijack the thread to try and further the homosexual agenda.",
        "intTime": 20090529,
        "postID": 13,
        "quote": "Originally posted by Fightdirector: Just another homophobic bigot - who believed her homophobic bigotry gives her special status and can allow her to threaten the President of the United States to his face. Ever notice how American homophobic bigots believe they are the American mainstream and every American who isn't a homophobic bigot is out of the mainstream? Protecting the President of the United States from fruit loops and nut-cases - just a normal \"day on the job\" for the Secret Service's Presidential Protection Detail.",
        "reply": " I like the fact that anyone with a different opinion then you have is a homophobic bigot. I guess if you don't have an actual point to make then calling names is a suitable substitute. This is a story of one whacked out lady, who happens to believe in the actual definition of marriage, and you have to try and hijack the thread to try and further the homosexual agenda.",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 20:04:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "iamgonzo"
    },
    {
        "content": "I believe I shall remind certain posters of this woman every time they attempt to claim that the self-titled \"Perez Hilton\" is speaking for me.",
        "intTime": 20090529,
        "postID": 14,
        "quote": "",
        "reply": "I believe I shall remind certain posters of this woman every time they attempt to claim that the self-titled \"Perez Hilton\" is speaking for me.",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 20:09:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "Bleah"
    },
    {
        "content": "quote: Originally posted by iamgonzo: This is a story of one whacked out lady, who happens to believe in the actual definition of marriage... A whacked out lady who happens to believe in HER definition of marriage, not necessarily the ACTUAL definition of marriage. I've been married twice (to two different women)and hope to marry my girlfriend in the near future - and my definition of marriage and her definition of marriage are definitely not identical. One element of her being \"whacked out\" (to use your term) is that she believes her definition of marriage is the ONLY definition of marriage - and she, in her own mind, believes she has the \"right\" to assault the President of the United States to prove it. The Secret Service was correct in removing her.",
        "intTime": 20090529,
        "postID": 15,
        "quote": "Originally posted by iamgonzo: This is a story of one whacked out lady, who happens to believe in the actual definition of marriage...",
        "reply": " A whacked out lady who happens to believe in HER definition of marriage, not necessarily the ACTUAL definition of marriage. I've been married twice (to two different women)and hope to marry my girlfriend in the near future - and my definition of marriage and her definition of marriage are definitely not identical. One element of her being \"whacked out\" (to use your term) is that she believes her definition of marriage is the ONLY definition of marriage - and she, in her own mind, believes she has the \"right\" to assault the President of the United States to prove it. The Secret Service was correct in removing her.",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 20:17:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "Fightdirector"
    },
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by iamgonzo: This is a story of one whacked out lady, who happens to believe in the actual definition of marriage... A whacked out lady who happens to believe in HER definition of marriage, not necessarily the ACTUAL definition of marriage. I've been married twice (to two different women)and hope to marry my girlfriend in the near future - and my definition of marriage and her definition of marriage are definitely not identical. One element of her being \"whacked out\" (to use your term) is that she believes her definition of marriage is the ONLY definition of marriage - and she, in her own mind, believes she has the \"right\" to assault the President of the United States to prove it. The Secret Service was correct in removing her. Some stranger comes knocking at my door demanding I read her letters? I'm calling the cops, Who TF does she think she is? But somehow or other Mr. Obama, menaced by assassination threats from every quarter, MUST listen to every nut job who comes out of the looney bin to speak to him personally. These people have got to be kidding. Dave",
        "intTime": 20090529,
        "postID": 16,
        "quote": "Originally posted by Fightdirector: quote: Originally posted by iamgonzo: This is a story of one whacked out lady, who happens to believe in the actual definition of marriage... A whacked out lady who happens to believe in HER definition of marriage, not necessarily the ACTUAL definition of marriage. I've been married twice (to two different women)and hope to marry my girlfriend in the near future - and my definition of marriage and her definition of marriage are definitely not identical. One element of her being \"whacked out\" (to use your term) is that she believes her definition of marriage is the ONLY definition of marriage - and she, in her own mind, believes she has the \"right\" to assault the President of the United States to prove it. The Secret Service was correct in removing her.",
        "reply": " Some stranger comes knocking at my door demanding I read her letters? I'm calling the cops, Who TF does she think she is? But somehow or other Mr. Obama, menaced by assassination threats from every quarter, MUST listen to every nut job who comes out of the looney bin to speak to him personally. These people have got to be kidding. Dave",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 20:21:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Fightdirector: Just another homophobic bigot - who believed her homophobic bigotry gives her special status and can allow her to threaten the President of the United States to his face. Ever notice how American homophobic bigots believe they are the American mainstream and every American who isn't a homophobic bigot is out of the mainstream? Protecting the President of the United States from fruit loops and nut-cases - just a normal \"day on the job\" for the Secret Service's Presidential Protection Detail. You know she is homophobic, how?... Respectfully, SUNLINER81",
        "intTime": 20090529,
        "postID": 17,
        "quote": "Originally posted by Fightdirector: Just another homophobic bigot - who believed her homophobic bigotry gives her special status and can allow her to threaten the President of the United States to his face. Ever notice how American homophobic bigots believe they are the American mainstream and every American who isn't a homophobic bigot is out of the mainstream? Protecting the President of the United States from fruit loops and nut-cases - just a normal \"day on the job\" for the Secret Service's Presidential Protection Detail.",
        "reply": " You know she is homophobic, how?... Respectfully, SUNLINER81",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 20:24:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "SUNLINER81"
    },
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by iamgonzo: This is a story of one whacked out lady, who happens to believe in the actual definition of marriage... A whacked out lady who happens to believe in HER definition of marriage, not necessarily the ACTUAL definition of marriage. I've been married twice (to two different women)and hope to marry my girlfriend in the near future - and my definition of marriage and her definition of marriage are definitely not identical. One element of her being \"whacked out\" (to use your term) is that she believes her definition of marriage is the ONLY definition of marriage - and she, in her own mind, believes she has the \"right\" to assault the President of the United States to prove it. The Secret Service was correct in removing her. Why didn't they ask if they could take the letter for \"examination\" and actually examine it and then keep a very close eye on the whacko, even whackos have the right to free speech... Everyone assumes quite a bit about this woman but maybe this is about FREE SPEECH... One wonders... Respectfully, SUNLINER81",
        "intTime": 20090529,
        "postID": 18,
        "quote": "Originally posted by Fightdirector: quote: Originally posted by iamgonzo: This is a story of one whacked out lady, who happens to believe in the actual definition of marriage... A whacked out lady who happens to believe in HER definition of marriage, not necessarily the ACTUAL definition of marriage. I've been married twice (to two different women)and hope to marry my girlfriend in the near future - and my definition of marriage and her definition of marriage are definitely not identical. One element of her being \"whacked out\" (to use your term) is that she believes her definition of marriage is the ONLY definition of marriage - and she, in her own mind, believes she has the \"right\" to assault the President of the United States to prove it. The Secret Service was correct in removing her.",
        "reply": " Why didn't they ask if they could take the letter for \"examination\" and actually examine it and then keep a very close eye on the whacko, even whackos have the right to free speech... Everyone assumes quite a bit about this woman but maybe this is about FREE SPEECH... One wonders... Respectfully, SUNLINER81",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 20:28:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "SUNLINER81"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Fightdirector: quote: Originally posted by iamgonzo: This is a story of one whacked out lady, who happens to believe in the actual definition of marriage... A whacked out lady who happens to believe in HER definition of marriage, not necessarily the ACTUAL definition of marriage. I've been married twice (to two different women)and hope to marry my girlfriend in the near future - and my definition of marriage and her definition of marriage are definitely not identical. One element of her being \"whacked out\" (to use your term) is that she believes her definition of marriage is the ONLY definition of marriage - and she, in her own mind, believes she has the \"right\" to assault the President of the United States to prove it. The Secret Service was correct in removing her. Some stranger comes knocking at my door demanding I read her letters? I'm calling the cops, Who TF does she think she is? But somehow or other Mr. Obama, menaced by assassination threats from every quarter, MUST listen to every nut job who comes out of the looney bin to speak to him personally. These people have got to be kidding. Dave I realize times have changed but, it used to be that any citizen could walk up to and into the White House and request an audience with the President... Too bad we don't live in similar times... Wonder what happened to us?... Respectfully, SUNLINER81",
        "intTime": 20090529,
        "postID": 19,
        "quote": "Originally posted by Grachus: quote: Originally posted by Fightdirector: quote: Originally posted by iamgonzo: This is a story of one whacked out lady, who happens to believe in the actual definition of marriage... A whacked out lady who happens to believe in HER definition of marriage, not necessarily the ACTUAL definition of marriage. I've been married twice (to two different women)and hope to marry my girlfriend in the near future - and my definition of marriage and her definition of marriage are definitely not identical. One element of her being \"whacked out\" (to use your term) is that she believes her definition of marriage is the ONLY definition of marriage - and she, in her own mind, believes she has the \"right\" to assault the President of the United States to prove it. The Secret Service was correct in removing her. Some stranger comes knocking at my door demanding I read her letters? I'm calling the cops, Who TF does she think she is? But somehow or other Mr. Obama, menaced by assassination threats from every quarter, MUST listen to every nut job who comes out of the looney bin to speak to him personally. These people have got to be kidding. Dave",
        "reply": " I realize times have changed but, it used to be that any citizen could walk up to and into the White House and request an audience with the President... Too bad we don't live in similar times... Wonder what happened to us?... Respectfully, SUNLINER81",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 20:32:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "SUNLINER81"
    },
    {
        "content": "quote: Originally posted by SUNLINER81: Why didn't they ask if they could take the letter for \"examination\" and actually examine it and then keep a very close eye on the whacko, even whackos have the right to free speech... Everyone assumes quite a bit about this woman but maybe this is about FREE SPEECH... One wonders... Respectfully, SUNLINER81 According to the article I read earlier today, she refused to give it to a member of his staff. Besides, the claim to be a \"Roman Catholic Priestess\" is enough to raise a red flag among security personnel that they are dealing with a weirdo at best, and a possible threat at worst. Free speech is not a guarantee that anyone, even an elected official, will pay attention to you.",
        "intTime": 20090529,
        "postID": 20,
        "quote": "Originally posted by SUNLINER81: Why didn't they ask if they could take the letter for \"examination\" and actually examine it and then keep a very close eye on the whacko, even whackos have the right to free speech... Everyone assumes quite a bit about this woman but maybe this is about FREE SPEECH... One wonders... Respectfully, SUNLINER81",
        "reply": " According to the article I read earlier today, she refused to give it to a member of his staff. Besides, the claim to be a \"Roman Catholic Priestess\" is enough to raise a red flag among security personnel that they are dealing with a weirdo at best, and a possible threat at worst. Free speech is not a guarantee that anyone, even an elected official, will pay attention to you.",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 20:33:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "Bleah"
    },
    {
        "content": "Here's one for your morning laugh: \"http://www.nbclosangeles.com/news/local/Reporter-Dragged-Kicking-and-Screaming-From-Near-Air-Force-One-.html?corder=reverse&pg=8\" quote: A reporter for a small newspaper was forcibly removed from a press area near Air Force One shortly before President Barack Obama arrived at Los Angeles International Airport to depart California early Thursday. Airport security officers carried the woman away by the feet and arms as she protested her removal. She later identified herself as Brenda Lee, a writer for the Georgia Informer in Macon and said she has White House press credentials. The newspaper's Web site says it is a monthly publication, and a Brenda Lee column is posted on it. quote: Lee said in a telephone interview with The Associated Press that she wanted to hand Obama a letter urging him \"to take a stand for traditional marriage.\" She said she asked a Secret Service agent to give the president her letter, but he refused and referred her to a White House staffer. Lee said she refused to give the staffer the letter. \"I said, 'I'll take my chances if (the president) comes by here,'\" said Lee, who identified herself as a Roman Catholic priestess who lives in Anaheim, Calif. \"He became annoyed that I wouldn't give him the letter.\" Since when did Catholicism have Priestesses? quote: Lee, who said this was the second presidential event she has covered, was later released. It'll also be your last I'm glad the Secret Service is doing a good job keeping these loons from the President",
        "intTime": 20090529,
        "postID": 21,
        "quote": "A reporter for a small newspaper was forcibly removed from a press area near Air Force One shortly before President Barack Obama arrived at Los Angeles International Airport to depart California early Thursday. Airport security officers carried the woman away by the feet and arms as she protested her removal. She later identified herself as Brenda Lee, a writer for the Georgia Informer in Macon and said she has White House press credentials. The newspaper's Web site says it is a monthly publication, and a Brenda Lee column is posted on it.",
        "reply": "Here's one for your morning laugh: \"http://www.nbclosangeles.com/news/local/Reporter-Dragged-Kicking-and-Screaming-From-Near-Air-Force-One-.html?corder=reverse&pg=8\"  quote: Lee said in a telephone interview with The Associated Press that she wanted to hand Obama a letter urging him \"to take a stand for traditional marriage.\" She said she asked a Secret Service agent to give the president her letter, but he refused and referred her to a White House staffer. Lee said she refused to give the staffer the letter. \"I said, 'I'll take my chances if (the president) comes by here,'\" said Lee, who identified herself as a Roman Catholic priestess who lives in Anaheim, Calif. \"He became annoyed that I wouldn't give him the letter.\" Since when did Catholicism have Priestesses? quote: Lee, who said this was the second presidential event she has covered, was later released. It'll also be your last I'm glad the Secret Service is doing a good job keeping these loons from the President",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 05:12:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "PhoenixDark"
    },
    {
        "content": "Bet it was the last one she ever covers as well. Secret Service, doing their job as usual.",
        "intTime": 20090529,
        "postID": 22,
        "quote": "",
        "reply": "Bet it was the last one she ever covers as well. Secret Service, doing their job as usual.",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 05:57:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "LineDoggie"
    },
    {
        "content": "Gald it didn't happen when President Bush was in office. The cries of racism would still be heard. BTW - she a relative or friend of McKinney????? Just wondering.......",
        "intTime": 20090529,
        "postID": 23,
        "quote": "",
        "reply": "Gald it didn't happen when President Bush was in office. The cries of racism would still be heard. BTW - she a relative or friend of McKinney????? Just wondering.......",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 05:58:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "sw614"
    },
    {
        "content": "For a second, I thought that was Michelle... \"The World's Finest\"",
        "intTime": 20090529,
        "postID": 24,
        "quote": "",
        "reply": "For a second, I thought that was Michelle... \"The World's Finest\"",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 06:05:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "Kegler300"
    },
    {
        "content": "quote: Originally posted by Kegler300: For a second, I thought that was Michelle... Omg..",
        "intTime": 20090529,
        "postID": 25,
        "quote": "Originally posted by Kegler300: For a second, I thought that was Michelle...",
        "reply": " Omg..",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 06:16:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "MrsCamo"
    },
    {
        "content": "quote: Originally posted by Kegler300: For a second, I thought that was Michelle... Nope, the ankles aren't big enough.",
        "intTime": 20090529,
        "postID": 26,
        "quote": "Originally posted by Kegler300: For a second, I thought that was Michelle...",
        "reply": " Nope, the ankles aren't big enough.",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 09:48:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "shuman14"
    },
    {
        "content": "quote: Originally posted by Kegler300: For a second, I thought that was Michelle... now that was funny.",
        "intTime": 20090529,
        "postID": 27,
        "quote": "Originally posted by Kegler300: For a second, I thought that was Michelle...",
        "reply": " now that was funny.",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 10:00:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "usa_girl"
    },
    {
        "content": "What a selfish woman.",
        "intTime": 20090529,
        "postID": 28,
        "quote": "",
        "reply": "What a selfish woman.",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 14:33:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "mrmixitup"
    },
    {
        "content": "quote: Originally posted by mrmixitup: What a selfish woman. Right on cue. God, this PC Culture is driving me MAD...",
        "intTime": 20090529,
        "postID": 29,
        "quote": "Originally posted by mrmixitup: What a selfish woman.",
        "reply": " Right on cue. God, this PC Culture is driving me MAD...",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 14:40:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "Irwin_R_Schyster"
    },
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by mrmixitup: What a selfish woman. Right on cue. God, this PC Culture is driving me MAD... Huh? I wasn't complementing the woman. I was calling her selfish. I also think her actions were those of a spoiled idiot. What did you think I meant?",
        "intTime": 20090529,
        "postID": 30,
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by mrmixitup: What a selfish woman. Right on cue. God, this PC Culture is driving me MAD...",
        "reply": " Huh? I wasn't complementing the woman. I was calling her selfish. I also think her actions were those of a spoiled idiot. What did you think I meant?",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 16:39:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "mrmixitup"
    },
    {
        "content": "Just another homophobic bigot - who believed her homophobic bigotry gives her special status and can allow her to threaten the President of the United States to his face. Ever notice how American homophobic bigots believe they are the American mainstream and every American who isn't a homophobic bigot is out of the mainstream? Protecting the President of the United States from fruit loops and nut-cases - just a normal \"day on the job\" for the Secret Service's Presidential Protection Detail.",
        "intTime": 20090529,
        "postID": 31,
        "quote": "",
        "reply": "Just another homophobic bigot - who believed her homophobic bigotry gives her special status and can allow her to threaten the President of the United States to his face. Ever notice how American homophobic bigots believe they are the American mainstream and every American who isn't a homophobic bigot is out of the mainstream? Protecting the President of the United States from fruit loops and nut-cases - just a normal \"day on the job\" for the Secret Service's Presidential Protection Detail.",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 17:08:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "Fightdirector"
    },
    {
        "content": "Why didn't the Secret Service break her legs and punch her four times in the mouth? Where is Black Water when you need them?",
        "intTime": 20090529,
        "postID": 32,
        "quote": "",
        "reply": "Why didn't the Secret Service break her legs and punch her four times in the mouth? Where is Black Water when you need them?",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 17:16:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Fightdirector: Just another homophobic bigot - who believed her homophobic bigotry gives her special status and can allow her to threaten the President of the United States to his face. Ever notice how American homophobic bigots believe they are the American mainstream and every American who isn't a homophobic bigot is out of the mainstream? Protecting the President of the United States from fruit loops and nut-cases - just a normal \"day on the job\" for the Secret Service's Presidential Protection Detail. I like the fact that anyone with a different opinion then you have is a homophobic bigot. I guess if you don't have an actual point to make then calling names is a suitable substitute. This is a story of one whacked out lady, who happens to believe in the actual definition of marriage, and you have to try and hijack the thread to try and further the homosexual agenda.",
        "intTime": 20090529,
        "postID": 33,
        "quote": "Originally posted by Fightdirector: Just another homophobic bigot - who believed her homophobic bigotry gives her special status and can allow her to threaten the President of the United States to his face. Ever notice how American homophobic bigots believe they are the American mainstream and every American who isn't a homophobic bigot is out of the mainstream? Protecting the President of the United States from fruit loops and nut-cases - just a normal \"day on the job\" for the Secret Service's Presidential Protection Detail.",
        "reply": " I like the fact that anyone with a different opinion then you have is a homophobic bigot. I guess if you don't have an actual point to make then calling names is a suitable substitute. This is a story of one whacked out lady, who happens to believe in the actual definition of marriage, and you have to try and hijack the thread to try and further the homosexual agenda.",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 20:04:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "iamgonzo"
    },
    {
        "content": "I believe I shall remind certain posters of this woman every time they attempt to claim that the self-titled \"Perez Hilton\" is speaking for me.",
        "intTime": 20090529,
        "postID": 34,
        "quote": "",
        "reply": "I believe I shall remind certain posters of this woman every time they attempt to claim that the self-titled \"Perez Hilton\" is speaking for me.",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 20:09:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "Bleah"
    },
    {
        "content": "quote: Originally posted by iamgonzo: This is a story of one whacked out lady, who happens to believe in the actual definition of marriage... A whacked out lady who happens to believe in HER definition of marriage, not necessarily the ACTUAL definition of marriage. I've been married twice (to two different women)and hope to marry my girlfriend in the near future - and my definition of marriage and her definition of marriage are definitely not identical. One element of her being \"whacked out\" (to use your term) is that she believes her definition of marriage is the ONLY definition of marriage - and she, in her own mind, believes she has the \"right\" to assault the President of the United States to prove it. The Secret Service was correct in removing her.",
        "intTime": 20090529,
        "postID": 35,
        "quote": "Originally posted by iamgonzo: This is a story of one whacked out lady, who happens to believe in the actual definition of marriage...",
        "reply": " A whacked out lady who happens to believe in HER definition of marriage, not necessarily the ACTUAL definition of marriage. I've been married twice (to two different women)and hope to marry my girlfriend in the near future - and my definition of marriage and her definition of marriage are definitely not identical. One element of her being \"whacked out\" (to use your term) is that she believes her definition of marriage is the ONLY definition of marriage - and she, in her own mind, believes she has the \"right\" to assault the President of the United States to prove it. The Secret Service was correct in removing her.",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 20:17:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "Fightdirector"
    },
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by iamgonzo: This is a story of one whacked out lady, who happens to believe in the actual definition of marriage... A whacked out lady who happens to believe in HER definition of marriage, not necessarily the ACTUAL definition of marriage. I've been married twice (to two different women)and hope to marry my girlfriend in the near future - and my definition of marriage and her definition of marriage are definitely not identical. One element of her being \"whacked out\" (to use your term) is that she believes her definition of marriage is the ONLY definition of marriage - and she, in her own mind, believes she has the \"right\" to assault the President of the United States to prove it. The Secret Service was correct in removing her. Some stranger comes knocking at my door demanding I read her letters? I'm calling the cops, Who TF does she think she is? But somehow or other Mr. Obama, menaced by assassination threats from every quarter, MUST listen to every nut job who comes out of the looney bin to speak to him personally. These people have got to be kidding. Dave",
        "intTime": 20090529,
        "postID": 36,
        "quote": "Originally posted by Fightdirector: quote: Originally posted by iamgonzo: This is a story of one whacked out lady, who happens to believe in the actual definition of marriage... A whacked out lady who happens to believe in HER definition of marriage, not necessarily the ACTUAL definition of marriage. I've been married twice (to two different women)and hope to marry my girlfriend in the near future - and my definition of marriage and her definition of marriage are definitely not identical. One element of her being \"whacked out\" (to use your term) is that she believes her definition of marriage is the ONLY definition of marriage - and she, in her own mind, believes she has the \"right\" to assault the President of the United States to prove it. The Secret Service was correct in removing her.",
        "reply": " Some stranger comes knocking at my door demanding I read her letters? I'm calling the cops, Who TF does she think she is? But somehow or other Mr. Obama, menaced by assassination threats from every quarter, MUST listen to every nut job who comes out of the looney bin to speak to him personally. These people have got to be kidding. Dave",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 20:21:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Fightdirector: Just another homophobic bigot - who believed her homophobic bigotry gives her special status and can allow her to threaten the President of the United States to his face. Ever notice how American homophobic bigots believe they are the American mainstream and every American who isn't a homophobic bigot is out of the mainstream? Protecting the President of the United States from fruit loops and nut-cases - just a normal \"day on the job\" for the Secret Service's Presidential Protection Detail. You know she is homophobic, how?... Respectfully, SUNLINER81",
        "intTime": 20090529,
        "postID": 37,
        "quote": "Originally posted by Fightdirector: Just another homophobic bigot - who believed her homophobic bigotry gives her special status and can allow her to threaten the President of the United States to his face. Ever notice how American homophobic bigots believe they are the American mainstream and every American who isn't a homophobic bigot is out of the mainstream? Protecting the President of the United States from fruit loops and nut-cases - just a normal \"day on the job\" for the Secret Service's Presidential Protection Detail.",
        "reply": " You know she is homophobic, how?... Respectfully, SUNLINER81",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 20:24:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "SUNLINER81"
    },
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by iamgonzo: This is a story of one whacked out lady, who happens to believe in the actual definition of marriage... A whacked out lady who happens to believe in HER definition of marriage, not necessarily the ACTUAL definition of marriage. I've been married twice (to two different women)and hope to marry my girlfriend in the near future - and my definition of marriage and her definition of marriage are definitely not identical. One element of her being \"whacked out\" (to use your term) is that she believes her definition of marriage is the ONLY definition of marriage - and she, in her own mind, believes she has the \"right\" to assault the President of the United States to prove it. The Secret Service was correct in removing her. Why didn't they ask if they could take the letter for \"examination\" and actually examine it and then keep a very close eye on the whacko, even whackos have the right to free speech... Everyone assumes quite a bit about this woman but maybe this is about FREE SPEECH... One wonders... Respectfully, SUNLINER81",
        "intTime": 20090529,
        "postID": 38,
        "quote": "Originally posted by Fightdirector: quote: Originally posted by iamgonzo: This is a story of one whacked out lady, who happens to believe in the actual definition of marriage... A whacked out lady who happens to believe in HER definition of marriage, not necessarily the ACTUAL definition of marriage. I've been married twice (to two different women)and hope to marry my girlfriend in the near future - and my definition of marriage and her definition of marriage are definitely not identical. One element of her being \"whacked out\" (to use your term) is that she believes her definition of marriage is the ONLY definition of marriage - and she, in her own mind, believes she has the \"right\" to assault the President of the United States to prove it. The Secret Service was correct in removing her.",
        "reply": " Why didn't they ask if they could take the letter for \"examination\" and actually examine it and then keep a very close eye on the whacko, even whackos have the right to free speech... Everyone assumes quite a bit about this woman but maybe this is about FREE SPEECH... One wonders... Respectfully, SUNLINER81",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 20:28:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "SUNLINER81"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Fightdirector: quote: Originally posted by iamgonzo: This is a story of one whacked out lady, who happens to believe in the actual definition of marriage... A whacked out lady who happens to believe in HER definition of marriage, not necessarily the ACTUAL definition of marriage. I've been married twice (to two different women)and hope to marry my girlfriend in the near future - and my definition of marriage and her definition of marriage are definitely not identical. One element of her being \"whacked out\" (to use your term) is that she believes her definition of marriage is the ONLY definition of marriage - and she, in her own mind, believes she has the \"right\" to assault the President of the United States to prove it. The Secret Service was correct in removing her. Some stranger comes knocking at my door demanding I read her letters? I'm calling the cops, Who TF does she think she is? But somehow or other Mr. Obama, menaced by assassination threats from every quarter, MUST listen to every nut job who comes out of the looney bin to speak to him personally. These people have got to be kidding. Dave I realize times have changed but, it used to be that any citizen could walk up to and into the White House and request an audience with the President... Too bad we don't live in similar times... Wonder what happened to us?... Respectfully, SUNLINER81",
        "intTime": 20090529,
        "postID": 39,
        "quote": "Originally posted by Grachus: quote: Originally posted by Fightdirector: quote: Originally posted by iamgonzo: This is a story of one whacked out lady, who happens to believe in the actual definition of marriage... A whacked out lady who happens to believe in HER definition of marriage, not necessarily the ACTUAL definition of marriage. I've been married twice (to two different women)and hope to marry my girlfriend in the near future - and my definition of marriage and her definition of marriage are definitely not identical. One element of her being \"whacked out\" (to use your term) is that she believes her definition of marriage is the ONLY definition of marriage - and she, in her own mind, believes she has the \"right\" to assault the President of the United States to prove it. The Secret Service was correct in removing her. Some stranger comes knocking at my door demanding I read her letters? I'm calling the cops, Who TF does she think she is? But somehow or other Mr. Obama, menaced by assassination threats from every quarter, MUST listen to every nut job who comes out of the looney bin to speak to him personally. These people have got to be kidding. Dave",
        "reply": " I realize times have changed but, it used to be that any citizen could walk up to and into the White House and request an audience with the President... Too bad we don't live in similar times... Wonder what happened to us?... Respectfully, SUNLINER81",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 20:32:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "SUNLINER81"
    },
    {
        "content": "quote: Originally posted by SUNLINER81: Why didn't they ask if they could take the letter for \"examination\" and actually examine it and then keep a very close eye on the whacko, even whackos have the right to free speech... Everyone assumes quite a bit about this woman but maybe this is about FREE SPEECH... One wonders... Respectfully, SUNLINER81 According to the article I read earlier today, she refused to give it to a member of his staff. Besides, the claim to be a \"Roman Catholic Priestess\" is enough to raise a red flag among security personnel that they are dealing with a weirdo at best, and a possible threat at worst. Free speech is not a guarantee that anyone, even an elected official, will pay attention to you.",
        "intTime": 20090529,
        "postID": 40,
        "quote": "Originally posted by SUNLINER81: Why didn't they ask if they could take the letter for \"examination\" and actually examine it and then keep a very close eye on the whacko, even whackos have the right to free speech... Everyone assumes quite a bit about this woman but maybe this is about FREE SPEECH... One wonders... Respectfully, SUNLINER81",
        "reply": " According to the article I read earlier today, she refused to give it to a member of his staff. Besides, the claim to be a \"Roman Catholic Priestess\" is enough to raise a red flag among security personnel that they are dealing with a weirdo at best, and a possible threat at worst. Free speech is not a guarantee that anyone, even an elected official, will pay attention to you.",
        "threadID": "672198221_8840065422001",
        "time": "2009-05-29 20:33:00",
        "title": "Kicking and Screaming Journalist Carried Away From AF1 By Secret Service",
        "userID": "Bleah"
    }
]