[
    {
        "content": "quote: TEL AVIV -- The Israeli Almagor Terrorist Victims’ Association is about to file a lawsuit against NATO officials who gave the green light for the bombing of Serbia in 1999. The association elected to take the move in response to the decision by Judge Fernando Andreu of the Spanish Audencia Nacional (National Court) to launch an investigation into Israel's bombing of Gaza in 2002, when one Hamas leader was killed and 14 people were wounded. In the suit, Almagor cites the names of a number of high-profile Spaniards, including EU High Representative for Foreign and Security Policy Javier Solana, who was NATO secretary general from 1995 to 1999, as well as the names of certain officials from other European countries and the United States. Almagor Director Meir Indor told the media in Israel that the lawsuit would be completed shortly. He confirmed that the Serbian case might open a Pandora's Box, which could make certain individuals think twice before deciding to accept any lawsuits that the Palestinians filed against Israel. “We see this as a case highlighting the double standards of Europeans who are accusing Israel of war crimes, while at the same time, those very same countries, as part of NATO, committed crimes that were a lot worse,“ Indor said. He stressed that every European NATO member-state would be mentioned and that the suit would be filed in every country that decided to file similar actions against Israel for war crimes recently committed either in the aforesaid case, or, more recently, during the Israeli offensive in Gaza at the turn of the year. (....) Although I do believe there are some unanswered questions regarding our (NATO) bombing of Serbia in 1999; this is nothing more than political posturing. +http://www.b92.net/eng/news/politics-article.php?yyyy=2009&mm=05&dd=05&nav_id=58945 This message has been edited. Last edited by: NSNN, Tue 05 May 2009 05:05 AM \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090505, 
        "postID": 1, 
        "quote": "TEL AVIV -- The Israeli Almagor Terrorist Victims’ Association is about to file a lawsuit against NATO officials who gave the green light for the bombing of Serbia in 1999. The association elected to take the move in response to the decision by Judge Fernando Andreu of the Spanish Audencia Nacional (National Court) to launch an investigation into Israel's bombing of Gaza in 2002, when one Hamas leader was killed and 14 people were wounded. In the suit, Almagor cites the names of a number of high-profile Spaniards, including EU High Representative for Foreign and Security Policy Javier Solana, who was NATO secretary general from 1995 to 1999, as well as the names of certain officials from other European countries and the United States. Almagor Director Meir Indor told the media in Israel that the lawsuit would be completed shortly. He confirmed that the Serbian case might open a Pandora's Box, which could make certain individuals think twice before deciding to accept any lawsuits that the Palestinians filed against Israel. “We see this as a case highlighting the double standards of Europeans who are accusing Israel of war crimes, while at the same time, those very same countries, as part of NATO, committed crimes that were a lot worse,“ Indor said. He stressed that every European NATO member-state would be mentioned and that the suit would be filed in every country that decided to file similar actions against Israel for war crimes recently committed either in the aforesaid case, or, more recently, during the Israeli offensive in Gaza at the turn of the year. (....)", 
        "reply": " Although I do believe there are some unanswered questions regarding our (NATO) bombing of Serbia in 1999; this is nothing more than political posturing. +http://www.b92.net/eng/news/politics-article.php?yyyy=2009&mm=05&dd=05&nav_id=58945 This message has been edited. Last edited by: NSNN, Tue 05 May 2009 05:05 AM \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_4820025222001", 
        "time": "2009-05-05 04:42:00", 
        "title": "Isrealis to sue NATO for 1999 air strikes", 
        "userID": "NSNN"
    }, 
    {
        "content": "There are two kinds of bombing done to-day. There's bombing done in self-defence, or in defence of someone who can't defend themselves. It's 'necessary', done with care by professional 'good guys' and not intended to hurt anybody. It's 'good' bombing. There is the kind of bombing that's unnecessary, done by evil, incompetent amateurs and only intended to kill or hurt people. That's 'bad' bombing. The world should recognize the difference and leave good bombers alone. Geez!", 
        "intTime": 20090505, 
        "postID": 2, 
        "quote": "", 
        "reply": "There are two kinds of bombing done to-day. There's bombing done in self-defence, or in defence of someone who can't defend themselves. It's 'necessary', done with care by professional 'good guys' and not intended to hurt anybody. It's 'good' bombing. There is the kind of bombing that's unnecessary, done by evil, incompetent amateurs and only intended to kill or hurt people. That's 'bad' bombing. The world should recognize the difference and leave good bombers alone. Geez!", 
        "threadID": "672198221_4820025222001", 
        "time": "2009-05-05 07:31:00", 
        "title": "Isrealis to sue NATO for 1999 air strikes", 
        "userID": "popsiq"
    }
]