[
    {
        "content": "RE: http://www.military.com/NewsContent/0,13319,96821,00.html I've been trying to go into the military for months but they won't recruit me.", 
        "intTime": 20090407, 
        "postID": 1, 
        "quote": "", 
        "reply": "RE: http://www.military.com/NewsContent/0,13319,96821,00.html I've been trying to go into the military for months but they won't recruit me.", 
        "threadID": "672198221_5980080022001", 
        "time": "2009-04-07 13:02:00", 
        "title": "Active Duty Recruiting Exceeds Goals", 
        "userID": "17205350"
    }, 
    {
        "content": "Then whats going on with Army recruiters and suicide?", 
        "intTime": 20090407, 
        "postID": 2, 
        "quote": "", 
        "reply": "Then whats going on with Army recruiters and suicide?", 
        "threadID": "672198221_5980080022001", 
        "time": "2009-04-07 14:03:00", 
        "title": "Active Duty Recruiting Exceeds Goals", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I don't trust the military's recruiting numbers at all. They used to release them immediately to the press in the first week of the month. Now, they have to be reviewed by the Recruiting Command and Pentagon first. Also, I don't know how the Army Reserve is recruiting more people since they are losing more recruiters every year and gaining none in return. I also don't know how the Reserve plans to expand when they can't even maintain their current numbers. Trying to find the current number of Soldiers in the Army Reserve is like trying to find Bin Laden. The National Guard has already been in hot water for lying about their recruiting numbers and lying about their readiness.", 
        "intTime": 20090407, 
        "postID": 3, 
        "quote": "", 
        "reply": "I don't trust the military's recruiting numbers at all. They used to release them immediately to the press in the first week of the month. Now, they have to be reviewed by the Recruiting Command and Pentagon first. Also, I don't know how the Army Reserve is recruiting more people since they are losing more recruiters every year and gaining none in return. I also don't know how the Reserve plans to expand when they can't even maintain their current numbers. Trying to find the current number of Soldiers in the Army Reserve is like trying to find Bin Laden. The National Guard has already been in hot water for lying about their recruiting numbers and lying about their readiness.", 
        "threadID": "672198221_5980080022001", 
        "time": "2009-04-07 14:54:00", 
        "title": "Active Duty Recruiting Exceeds Goals", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Just read the article: quote: Originally posted in the Article: The Army Reserve recruited more than 2,100 members in April, 83 percent of its goal. I'm actually surprised they did that well. It's going to be a really crappy next year for AGR Recruiters. Expect more stress as the existing recruiters are pushed fanatically to not only recruit the minimum, but be pushed to go above that. Pretty sure the AGR Program is below 70% strength on recruiters. They will likely just put Active Duty recruiters into the jobs. Nice band-aid!!", 
        "intTime": 20090407, 
        "postID": 4, 
        "quote": "Originally posted in the Article: The Army Reserve recruited more than 2,100 members in April, 83 percent of its goal.", 
        "reply": "Just read the article:  I'm actually surprised they did that well. It's going to be a really crappy next year for AGR Recruiters. Expect more stress as the existing recruiters are pushed fanatically to not only recruit the minimum, but be pushed to go above that. Pretty sure the AGR Program is below 70% strength on recruiters. They will likely just put Active Duty recruiters into the jobs. Nice band-aid!!", 
        "threadID": "672198221_5980080022001", 
        "time": "2009-04-07 15:00:00", 
        "title": "Active Duty Recruiting Exceeds Goals", 
        "userID": "mrmixitup"
    }
]