[
    {
        "content": "\"http://www.politico.com/blogs/glennthrush/0509/Panetta_to_CIA_employees_We_told_Pelosi_the_truth.html?showall\" President Obama appointed CIA Director Leon Panetta released the following memo to CIA employees friday. quote: Message from the Director: Turning Down the Volume There is a long tradition in Washington of making political hay out of our business. It predates my service with this great institution, and it will be around long after I’m gone. But the political debates about interrogation reached a new decibel level yesterday when the CIA was accused of misleading Congress. Let me be clear: It is not our policy or practice to mislead Congress. That is against our laws and our values. As the Agency indicated previously in response to Congressional inquiries, our contemporaneous records from September 2002 indicate that CIA officers briefed truthfully on the interrogation of Abu Zubaydah, describing “the enhanced techniques that had been employed.” Ultimately, it is up to Congress to evaluate all the evidence and reach its own conclusions about what happened. My advice — indeed, my direction — to you is straightforward: ignore the noise and stay focused on your mission. We have too much work to do to be distracted from our job of protecting this country. We are an Agency of high integrity, professionalism, and dedication. Our task is to tell it like it is — even if that’s not what people always want to hear. Keep it up. Our national security depends on it. So a career democrat is now saying that the CIA told the truth. Hmmm, who should we believe?", 
        "intTime": 20090515, 
        "postID": 1, 
        "quote": "Message from the Director: Turning Down the Volume There is a long tradition in Washington of making political hay out of our business. It predates my service with this great institution, and it will be around long after I’m gone. But the political debates about interrogation reached a new decibel level yesterday when the CIA was accused of misleading Congress. Let me be clear: It is not our policy or practice to mislead Congress. That is against our laws and our values. As the Agency indicated previously in response to Congressional inquiries, our contemporaneous records from September 2002 indicate that CIA officers briefed truthfully on the interrogation of Abu Zubaydah, describing “the enhanced techniques that had been employed.” Ultimately, it is up to Congress to evaluate all the evidence and reach its own conclusions about what happened. My advice — indeed, my direction — to you is straightforward: ignore the noise and stay focused on your mission. We have too much work to do to be distracted from our job of protecting this country. We are an Agency of high integrity, professionalism, and dedication. Our task is to tell it like it is — even if that’s not what people always want to hear. Keep it up. Our national security depends on it.", 
        "reply": "\"http://www.politico.com/blogs/glennthrush/0509/Panetta_to_CIA_employees_We_told_Pelosi_the_truth.html?showall\" President Obama appointed CIA Director Leon Panetta released the following memo to CIA employees friday.  So a career democrat is now saying that the CIA told the truth. Hmmm, who should we believe?", 
        "threadID": "672198221_6640004322001", 
        "time": "2009-05-15 15:53:00", 
        "title": "Panetta to CIA employees: We told Pelosi the truth", 
        "userID": "stec74"
    }, 
    {
        "content": "Nancy Pelosi of course. She has the proof. Just read the TOP SECRET notes that were taken that day back in 2002. (If they haven't already disappeared).", 
        "intTime": 20090515, 
        "postID": 2, 
        "quote": "", 
        "reply": "Nancy Pelosi of course. She has the proof. Just read the TOP SECRET notes that were taken that day back in 2002. (If they haven't already disappeared).", 
        "threadID": "672198221_6640004322001", 
        "time": "2009-05-15 16:10:00", 
        "title": "Panetta to CIA employees: We told Pelosi the truth", 
        "userID": "Duster6"
    }, 
    {
        "content": "The CIA also provided Secretary of State Colin Powell the \"truth\" about WMD's in Iraq and even provided him the aerial photo's and intelligence that he used in front of the UN to prove his case in the run-up to the war. Of course, those photos and the information Powell received from the CIA proved to be false. I believe the Madame Speaker is telling the truth, and the CIA has purposely mislead both her and Chairman Graham on torture, as they both now allege. Why should the American people now believe the Bush run CIA? Time for Leon Panetta to step down. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090515, 
        "postID": 3, 
        "quote": "", 
        "reply": "The CIA also provided Secretary of State Colin Powell the \"truth\" about WMD's in Iraq and even provided him the aerial photo's and intelligence that he used in front of the UN to prove his case in the run-up to the war. Of course, those photos and the information Powell received from the CIA proved to be false. I believe the Madame Speaker is telling the truth, and the CIA has purposely mislead both her and Chairman Graham on torture, as they both now allege. Why should the American people now believe the Bush run CIA? Time for Leon Panetta to step down. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6640004322001", 
        "time": "2009-05-15 16:16:00", 
        "title": "Panetta to CIA employees: We told Pelosi the truth", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: The CIA also provided Secretary of State Colin Powell the \"truth\" about WMD's in Iraq and even provided him the aerial photo's and intelligence that he used in front of the UN to prove his case in the run-up to the war. Of course, those photos and the information Powell received from the CIA proved to be false. I believe the Madame Speaker is telling the truth, and the CIA has purposely mislead both her and Chairman Graham on torture, as they both now allege. Why should the American people now believe the Bush run CIA? Time for Leon Panetta to step down. LOL... Where o where is President Obama?? You would think a democratic President would have issued a statement of support for HIS House Speaker by now, you know, the person third in line for the Presidency.. LOL....lovin it", 
        "intTime": 20090515, 
        "postID": 4, 
        "quote": "Originally posted by jack_flats: The CIA also provided Secretary of State Colin Powell the \"truth\" about WMD's in Iraq and even provided him the aerial photo's and intelligence that he used in front of the UN to prove his case in the run-up to the war. Of course, those photos and the information Powell received from the CIA proved to be false. I believe the Madame Speaker is telling the truth, and the CIA has purposely mislead both her and Chairman Graham on torture, as they both now allege. Why should the American people now believe the Bush run CIA? Time for Leon Panetta to step down.", 
        "reply": " LOL... Where o where is President Obama?? You would think a democratic President would have issued a statement of support for HIS House Speaker by now, you know, the person third in line for the Presidency.. LOL....lovin it", 
        "threadID": "672198221_6640004322001", 
        "time": "2009-05-15 16:40:00", 
        "title": "Panetta to CIA employees: We told Pelosi the truth", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Nancy Pelosi of course. She has the proof. Just read the TOP SECRET notes that were taken that day back in 2002. (If they haven't already disappeared). Tsk, tsk, the rules forbid taking notes... Dave", 
        "intTime": 20090515, 
        "postID": 5, 
        "quote": "Originally posted by Duster6: Nancy Pelosi of course. She has the proof. Just read the TOP SECRET notes that were taken that day back in 2002. (If they haven't already disappeared).", 
        "reply": " Tsk, tsk, the rules forbid taking notes... Dave", 
        "threadID": "672198221_6640004322001", 
        "time": "2009-05-15 16:52:00", 
        "title": "Panetta to CIA employees: We told Pelosi the truth", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by jack_flats: The CIA also provided Secretary of State Colin Powell the \"truth\" about WMD's in Iraq and even provided him the aerial photo's and intelligence that he used in front of the UN to prove his case in the run-up to the war. Of course, those photos and the information Powell received from the CIA proved to be false. I believe the Madame Speaker is telling the truth, and the CIA has purposely mislead both her and Chairman Graham on torture, as they both now allege. Why should the American people now believe the Bush run CIA? Time for Leon Panetta to step down. LOL... Where o where is President Obama?? You would think a democratic President would have issued a statement of support for HIS House Speaker by now, you know, the person third in line for the Presidency.. LOL....lovin it This is a legislative matter being that Speaker Pelosi is in the Legislative branch, better known as \"Separation of Powers.\" Whatever the POTUS would say in this situation, would not be good. The matter will sort itself out well without POTUS interference. It is interesting watching government work, isn't it? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090515, 
        "postID": 6, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by jack_flats: The CIA also provided Secretary of State Colin Powell the \"truth\" about WMD's in Iraq and even provided him the aerial photo's and intelligence that he used in front of the UN to prove his case in the run-up to the war. Of course, those photos and the information Powell received from the CIA proved to be false. I believe the Madame Speaker is telling the truth, and the CIA has purposely mislead both her and Chairman Graham on torture, as they both now allege. Why should the American people now believe the Bush run CIA? Time for Leon Panetta to step down. LOL... Where o where is President Obama?? You would think a democratic President would have issued a statement of support for HIS House Speaker by now, you know, the person third in line for the Presidency.. LOL....lovin it", 
        "reply": " This is a legislative matter being that Speaker Pelosi is in the Legislative branch, better known as \"Separation of Powers.\" Whatever the POTUS would say in this situation, would not be good. The matter will sort itself out well without POTUS interference. It is interesting watching government work, isn't it? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6640004322001", 
        "time": "2009-05-15 16:54:00", 
        "title": "Panetta to CIA employees: We told Pelosi the truth", 
        "userID": "jack_flats"
    }, 
    {
        "content": "The point is when did the waterboarding start and who started it? The current round of fogging simply masks the essential point. When Congress was briefed is consequential only insofar as the waterboarding had already begun (months previously?); someone had approved it, and the technique had been discussed at a higher level, somewhere. Or was it just Bubba and the boyz trying 'something' and achieving outstanding results? Then there are some indications that the 'Bubba effect' was wide-spread - everybody simultaneously getting a 'good idea'? In the cause of good, democracy, liberty, justice, motherhood etc, etc, of course.", 
        "intTime": 20090517, 
        "postID": 7, 
        "quote": "", 
        "reply": "The point is when did the waterboarding start and who started it? The current round of fogging simply masks the essential point. When Congress was briefed is consequential only insofar as the waterboarding had already begun (months previously?); someone had approved it, and the technique had been discussed at a higher level, somewhere. Or was it just Bubba and the boyz trying 'something' and achieving outstanding results? Then there are some indications that the 'Bubba effect' was wide-spread - everybody simultaneously getting a 'good idea'? In the cause of good, democracy, liberty, justice, motherhood etc, etc, of course.", 
        "threadID": "672198221_6640004322001", 
        "time": "2009-05-17 07:15:00", 
        "title": "Panetta to CIA employees: We told Pelosi the truth", 
        "userID": "popsiq"
    }, 
    {
        "content": "Maybe it the Shindane Arone effect? Done for Ann Murray, Maple Syrup, Old time Hockey, eh?", 
        "intTime": 20090517, 
        "postID": 8, 
        "quote": "", 
        "reply": "Maybe it the Shindane Arone effect? Done for Ann Murray, Maple Syrup, Old time Hockey, eh?", 
        "threadID": "672198221_6640004322001", 
        "time": "2009-05-17 07:30:00", 
        "title": "Panetta to CIA employees: We told Pelosi the truth", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Maybe it the Shindane Arone effect? Done for Ann Murray, Maple Syrup, Old time Hockey, eh? You mean Shidane Arone vs the Paras? Object lesson in using 'professionals'.", 
        "intTime": 20090517, 
        "postID": 9, 
        "quote": "Originally posted by LineDoggie: Maybe it the Shindane Arone effect? Done for Ann Murray, Maple Syrup, Old time Hockey, eh?", 
        "reply": " You mean Shidane Arone vs the Paras? Object lesson in using 'professionals'.", 
        "threadID": "672198221_6640004322001", 
        "time": "2009-05-17 07:44:00", 
        "title": "Panetta to CIA employees: We told Pelosi the truth", 
        "userID": "popsiq"
    }, 
    {
        "content": "The job of the Legislative Branch is to check the power of the Executive Branch. The Senate has done a poor job over the last decade or so and I'm sick of their excuses. If they claim Bush lied, they are at least as much at fault because it's their job to fact check. They always go with the political tide (the war in Iraq, torture, etc.) and then blame the President when it becomes politically expediant. This is not to say that on a given topic, the President isn't at fault, it's just that the Legislative branch takes no responsibility.", 
        "intTime": 20090517, 
        "postID": 10, 
        "quote": "", 
        "reply": "The job of the Legislative Branch is to check the power of the Executive Branch. The Senate has done a poor job over the last decade or so and I'm sick of their excuses. If they claim Bush lied, they are at least as much at fault because it's their job to fact check. They always go with the political tide (the war in Iraq, torture, etc.) and then blame the President when it becomes politically expediant. This is not to say that on a given topic, the President isn't at fault, it's just that the Legislative branch takes no responsibility.", 
        "threadID": "672198221_6640004322001", 
        "time": "2009-05-17 10:23:00", 
        "title": "Panetta to CIA employees: We told Pelosi the truth", 
        "userID": "foxred03"
    }, 
    {
        "content": "\"Waterboarding\" was in use and well known in the military at least in 1966. That would be the L. B. Johnson Admin.. and there's this: \"\"http://www.washingtonpost.com/wp-dyn/content/article/2006/10/04/AR2006100402005.html Note that the WW2 information neglects to STRESS that it was a civilian the Japansses officer was convicted of interogating, that the Japaneese method included closing off the nose and pouring water down the mouth ae one tried to breath ( and the \"water cure\" as they termed it, had even harsher methods that are not contemplated in modern useage) often resulting in death. Where should we start the \"investigation\" FDR, Harry Truman, Eisenhower etc ADDING rtthe Banana to our Republic as the left wing seems desperate to do?", 
        "intTime": 20090517, 
        "postID": 11, 
        "quote": "", 
        "reply": "\"Waterboarding\" was in use and well known in the military at least in 1966. That would be the L. B. Johnson Admin.. and there's this: \"\"http://www.washingtonpost.com/wp-dyn/content/article/2006/10/04/AR2006100402005.html Note that the WW2 information neglects to STRESS that it was a civilian the Japansses officer was convicted of interogating, that the Japaneese method included closing off the nose and pouring water down the mouth ae one tried to breath ( and the \"water cure\" as they termed it, had even harsher methods that are not contemplated in modern useage) often resulting in death. Where should we start the \"investigation\" FDR, Harry Truman, Eisenhower etc ADDING rtthe Banana to our Republic as the left wing seems desperate to do?", 
        "threadID": "672198221_6640004322001", 
        "time": "2009-05-17 11:26:00", 
        "title": "Panetta to CIA employees: We told Pelosi the truth", 
        "userID": "peter3_1"
    }
]