[
    {
        "content": "Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\"", 
        "intTime": 20090514, 
        "postID": 1, 
        "quote": "", 
        "reply": "Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\"", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 14:40:00", 
        "title": "Who is lieing??", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\" Nope, she has gone over the edge. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 2, 
        "quote": "Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\"", 
        "reply": " Nope, she has gone over the edge. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 14:43:00", 
        "title": "Who is lieing??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\" Nope, she has gone over the edge. I dont discount that, and if so she certainly dont need to be in that position a second longer. So lets read the transcripts and cart her off to a mental institution or jail. If she lied so blantently about something that could so easily be proven, then yes she lost it and must be removed.", 
        "intTime": 20090514, 
        "postID": 3, 
        "quote": "Originally posted by L0A1: quote: Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\" Nope, she has gone over the edge.", 
        "reply": " I dont discount that, and if so she certainly dont need to be in that position a second longer. So lets read the transcripts and cart her off to a mental institution or jail. If she lied so blantently about something that could so easily be proven, then yes she lost it and must be removed.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 14:57:00", 
        "title": "Who is lieing??", 
        "userID": "john2x"
    }, 
    {
        "content": "It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case.", 
        "intTime": 20090514, 
        "postID": 4, 
        "quote": "", 
        "reply": "It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 17:37:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\" Or she is \"ratting out\" her cohorts in crime to cover her one-eight-zero relative bearing... Respectfully, SUNLINER81", 
        "intTime": 20090514, 
        "postID": 5, 
        "quote": "Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\"", 
        "reply": " Or she is \"ratting out\" her cohorts in crime to cover her one-eight-zero relative bearing... Respectfully, SUNLINER81", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 17:49:00", 
        "title": "Who is lieing??", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case. Appoint a \"non partisan\" investigation committee, chaired by Senator John S. McCain III... Respectfully, SUNLINER81", 
        "intTime": 20090514, 
        "postID": 6, 
        "quote": "Originally posted by usa_girl: It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case.", 
        "reply": " Appoint a \"non partisan\" investigation committee, chaired by Senator John S. McCain III... Respectfully, SUNLINER81", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 17:50:00", 
        "title": "Who is lieing??", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war.", 
        "intTime": 20090514, 
        "postID": 7, 
        "quote": "", 
        "reply": "Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:00:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war. He's also BTDT, been there and done that... I believe that given his POW status and that he was tortured at the hands of the enemy, people will believe him, regardless his party affiliation... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090514, 
        "postID": 8, 
        "quote": "Originally posted by usa_girl: Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war.", 
        "reply": " He's also BTDT, been there and done that... I believe that given his POW status and that he was tortured at the hands of the enemy, people will believe him, regardless his party affiliation... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:03:00", 
        "title": "Who is lieing??", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here?", 
        "intTime": 20090514, 
        "postID": 9, 
        "quote": "", 
        "reply": "It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here?", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:13:00", 
        "title": "Who is lieing??", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by SUNLINER81: quote: Originally posted by usa_girl: It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case. Appoint a \"non partisan\" investigation committee, chaired by Senator John S. McCain III... Respectfully, SUNLINER81 I'll serve on it. You have a built in bias which McCain lacks. You believe in waterboarding, he doesn't. Dave", 
        "intTime": 20090514, 
        "postID": 10, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by SUNLINER81: quote: Originally posted by usa_girl: It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case. Appoint a \"non partisan\" investigation committee, chaired by Senator John S. McCain III... Respectfully, SUNLINER81 I'll serve on it.", 
        "reply": " You have a built in bias which McCain lacks. You believe in waterboarding, he doesn't. Dave", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:16:00", 
        "title": "Who is lieing??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by usa_girl: Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war. He's also BTDT, been there and done that... I believe that given his POW status and that he was tortured at the hands of the enemy, people will believe him, regardless his party affiliation... IMHO... Respectfully, SUNLINER81 Good choice! I'll go along with that. Dave", 
        "intTime": 20090514, 
        "postID": 11, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by usa_girl: Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war. He's also BTDT, been there and done that... I believe that given his POW status and that he was tortured at the hands of the enemy, people will believe him, regardless his party affiliation... IMHO... Respectfully, SUNLINER81", 
        "reply": " Good choice! I'll go along with that. Dave", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:17:00", 
        "title": "Who is lieing??", 
        "userID": "Grachus"
    }, 
    {
        "content": "yes, as I mentioned before, I did not have an issue with waterboarding, but I did not know it was against the law. I could never be mean to McCain after all he went through and what he did for our country. I would always have to give him that respect. And I have to say, I did not like it when I watched the movie and saw what they did to him Only if I am honest....I did not think at the time I was watching that, we should not be mean to them because two wrongs don't make a right... I thought...get in there America and make them sorry they ever messed with us. Bad huh? It is easy for me to sit here and try to use reasoning to understand the issue of right and wrong, in the big picture, after the fact, etc In the heat of the moment, I think I would understand and forgive those for making mistakes and doing whatever it took to keep us safe. I think this would have been more of an issue for me if we had gone out and done this for no good reason at all... but there was a reason we acted or over reacted and that was 9/11....never forget", 
        "intTime": 20090514, 
        "postID": 12, 
        "quote": "", 
        "reply": "yes, as I mentioned before, I did not have an issue with waterboarding, but I did not know it was against the law. I could never be mean to McCain after all he went through and what he did for our country. I would always have to give him that respect. And I have to say, I did not like it when I watched the movie and saw what they did to him Only if I am honest....I did not think at the time I was watching that, we should not be mean to them because two wrongs don't make a right... I thought...get in there America and make them sorry they ever messed with us. Bad huh? It is easy for me to sit here and try to use reasoning to understand the issue of right and wrong, in the big picture, after the fact, etc In the heat of the moment, I think I would understand and forgive those for making mistakes and doing whatever it took to keep us safe. I think this would have been more of an issue for me if we had gone out and done this for no good reason at all... but there was a reason we acted or over reacted and that was 9/11....never forget", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:19:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here? I agree and disagree. Those who ordered and carried out a decision have the greatest culpability. Those who knowlingly went along also bear responsibility, even if it's less. While I personally lean toward giving her a bye, I certainly can be wrong. Let the chips fall where they may. Dave", 
        "intTime": 20090514, 
        "postID": 13, 
        "quote": "Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here?", 
        "reply": " I agree and disagree. Those who ordered and carried out a decision have the greatest culpability. Those who knowlingly went along also bear responsibility, even if it's less. While I personally lean toward giving her a bye, I certainly can be wrong. Let the chips fall where they may. Dave", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:22:00", 
        "title": "Who is lieing??", 
        "userID": "Grachus"
    }, 
    {
        "content": "It's time people stopped hiding behind the events of 11 Sep 01. We were asleep at the switch, the bad guys got in, and that's how it happened. Piling all these layers over it as we have over the past eight years does not speak well of us as a nation. And it certainly looks bad when we allow ourselves to compromise our principles as a result. It's very easy to get lazy and make excuses to justify illegal behavior, when we should be doing the right thing. And we know what the right thing is - we codified it. Ronald Reagan knew what the right thing was - he signed the public law that was informed by the Geneva Conventions. Not a single illegal act that has been done in the name of 9/11, despite the claim that \"it works\", is justifiable when one takes the long view of those actions and their effect on our society internally and externally. And it's very disheartening to see that we have wasted so much time and effort with distractions that make us look even smaller as a people. Again - why is Nancy Pelosi an issue? So, she \"lied\". I can think of all the people who were at the tip of the spear who lied also - and they were the ones who decided that our values and principles were secondary to their personal desires. So, again: It matters not what you personally think is permissible. We are allegedly a nation of laws, not of men. We don't wake up and decide which laws we're going to abide by and which ones are impediments to our motivations. Ladies and gentlemen, that's what criminals do. That's what psychopaths do. Have we become those things?", 
        "intTime": 20090514, 
        "postID": 14, 
        "quote": "", 
        "reply": "It's time people stopped hiding behind the events of 11 Sep 01. We were asleep at the switch, the bad guys got in, and that's how it happened. Piling all these layers over it as we have over the past eight years does not speak well of us as a nation. And it certainly looks bad when we allow ourselves to compromise our principles as a result. It's very easy to get lazy and make excuses to justify illegal behavior, when we should be doing the right thing. And we know what the right thing is - we codified it. Ronald Reagan knew what the right thing was - he signed the public law that was informed by the Geneva Conventions. Not a single illegal act that has been done in the name of 9/11, despite the claim that \"it works\", is justifiable when one takes the long view of those actions and their effect on our society internally and externally. And it's very disheartening to see that we have wasted so much time and effort with distractions that make us look even smaller as a people. Again - why is Nancy Pelosi an issue? So, she \"lied\". I can think of all the people who were at the tip of the spear who lied also - and they were the ones who decided that our values and principles were secondary to their personal desires. So, again: It matters not what you personally think is permissible. We are allegedly a nation of laws, not of men. We don't wake up and decide which laws we're going to abide by and which ones are impediments to our motivations. Ladies and gentlemen, that's what criminals do. That's what psychopaths do. Have we become those things?", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:31:00", 
        "title": "Who is lieing??", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here? By her own admission... Respectfully, SUNLINER81", 
        "intTime": 20090514, 
        "postID": 15, 
        "quote": "Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here?", 
        "reply": " By her own admission... Respectfully, SUNLINER81", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:50:00", 
        "title": "Who is lieing??", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here? By her own admission... Respectfully, SUNLINER81 So, all the other guys are off the hook now. It's all Pelosi's fault - yes?", 
        "intTime": 20090514, 
        "postID": 16, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here? By her own admission... Respectfully, SUNLINER81", 
        "reply": " So, all the other guys are off the hook now. It's all Pelosi's fault - yes?", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:53:00", 
        "title": "Who is lieing??", 
        "userID": "mcgreer"
    }, 
    {
        "content": "hi mcgreer why is it everyone wants to give nancy a pass for being apart of a lie allowed illegal actions to take place? She is the speaker of the house and had a duty to keep the checks and balance in place. They are suppose to check the Pres and they dropped the ball and they want to blame it now on the CIA and intel. Well, then I am sure Bush and his people would like to go back and blame the intel and Hillary and anyone else who suggested that weapons were there and he/we needed to act. Maybe he would not have even gone to war if not for the false assumptions of weapons? I think they all have to fall and we need to clean house.", 
        "intTime": 20090514, 
        "postID": 17, 
        "quote": "", 
        "reply": "hi mcgreer why is it everyone wants to give nancy a pass for being apart of a lie allowed illegal actions to take place? She is the speaker of the house and had a duty to keep the checks and balance in place. They are suppose to check the Pres and they dropped the ball and they want to blame it now on the CIA and intel. Well, then I am sure Bush and his people would like to go back and blame the intel and Hillary and anyone else who suggested that weapons were there and he/we needed to act. Maybe he would not have even gone to war if not for the false assumptions of weapons? I think they all have to fall and we need to clean house.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:56:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: hi mcgreer why is it everyone wants to give nancy a pass for being apart of a lie allowed illegal actions to take place? She is the speaker of the house and had a duty to keep the checks and balance in place. They are suppose to check the Pres and they dropped the ball and they want to blame it now on the CIA and intel. Well, then I am sure Bush and his people would like to go back and blame the intel and Hillary and anyone else who suggested that weapons were there and he/we needed to act. Maybe he would not have even gone to war if not for the false assumptions of weapons? I think they all have to fall and we need to clean house. I am astounded at the idea that you and millions of other people allow yourselves to be influenced by this nonsense that is nothing more than a distraction from doing the job we do with all other allegations of serious crimes in our country. Pelosi is irrelevant. And if I have to explain why that is, there's a very large problem.", 
        "intTime": 20090514, 
        "postID": 18, 
        "quote": "Originally posted by usa_girl: hi mcgreer why is it everyone wants to give nancy a pass for being apart of a lie allowed illegal actions to take place? She is the speaker of the house and had a duty to keep the checks and balance in place. They are suppose to check the Pres and they dropped the ball and they want to blame it now on the CIA and intel. Well, then I am sure Bush and his people would like to go back and blame the intel and Hillary and anyone else who suggested that weapons were there and he/we needed to act. Maybe he would not have even gone to war if not for the false assumptions of weapons? I think they all have to fall and we need to clean house.", 
        "reply": " I am astounded at the idea that you and millions of other people allow yourselves to be influenced by this nonsense that is nothing more than a distraction from doing the job we do with all other allegations of serious crimes in our country. Pelosi is irrelevant. And if I have to explain why that is, there's a very large problem.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 19:03:00", 
        "title": "Who is lieing??", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Well, you don't have to explain anything to me. I am just on the outside looking in and listening and watching both parties. It just seems to me, that only the Dem's part in this seems to be irrelevant. I think everybody on both sides are very relevant.", 
        "intTime": 20090514, 
        "postID": 19, 
        "quote": "", 
        "reply": "Well, you don't have to explain anything to me. I am just on the outside looking in and listening and watching both parties. It just seems to me, that only the Dem's part in this seems to be irrelevant. I think everybody on both sides are very relevant.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 19:17:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\"", 
        "intTime": 20090514, 
        "postID": 20, 
        "quote": "", 
        "reply": "Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\"", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 14:40:00", 
        "title": "Who is lieing??", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\" Nope, she has gone over the edge. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 21, 
        "quote": "Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\"", 
        "reply": " Nope, she has gone over the edge. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 14:43:00", 
        "title": "Who is lieing??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\" Nope, she has gone over the edge. I dont discount that, and if so she certainly dont need to be in that position a second longer. So lets read the transcripts and cart her off to a mental institution or jail. If she lied so blantently about something that could so easily be proven, then yes she lost it and must be removed.", 
        "intTime": 20090514, 
        "postID": 22, 
        "quote": "Originally posted by L0A1: quote: Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\" Nope, she has gone over the edge.", 
        "reply": " I dont discount that, and if so she certainly dont need to be in that position a second longer. So lets read the transcripts and cart her off to a mental institution or jail. If she lied so blantently about something that could so easily be proven, then yes she lost it and must be removed.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 14:57:00", 
        "title": "Who is lieing??", 
        "userID": "john2x"
    }, 
    {
        "content": "It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case.", 
        "intTime": 20090514, 
        "postID": 23, 
        "quote": "", 
        "reply": "It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 17:37:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\" Or she is \"ratting out\" her cohorts in crime to cover her one-eight-zero relative bearing... Respectfully, SUNLINER81", 
        "intTime": 20090514, 
        "postID": 24, 
        "quote": "Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\"", 
        "reply": " Or she is \"ratting out\" her cohorts in crime to cover her one-eight-zero relative bearing... Respectfully, SUNLINER81", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 17:49:00", 
        "title": "Who is lieing??", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case. Appoint a \"non partisan\" investigation committee, chaired by Senator John S. McCain III... Respectfully, SUNLINER81", 
        "intTime": 20090514, 
        "postID": 25, 
        "quote": "Originally posted by usa_girl: It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case.", 
        "reply": " Appoint a \"non partisan\" investigation committee, chaired by Senator John S. McCain III... Respectfully, SUNLINER81", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 17:50:00", 
        "title": "Who is lieing??", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war.", 
        "intTime": 20090514, 
        "postID": 26, 
        "quote": "", 
        "reply": "Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:00:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war. He's also BTDT, been there and done that... I believe that given his POW status and that he was tortured at the hands of the enemy, people will believe him, regardless his party affiliation... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090514, 
        "postID": 27, 
        "quote": "Originally posted by usa_girl: Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war.", 
        "reply": " He's also BTDT, been there and done that... I believe that given his POW status and that he was tortured at the hands of the enemy, people will believe him, regardless his party affiliation... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:03:00", 
        "title": "Who is lieing??", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here?", 
        "intTime": 20090514, 
        "postID": 28, 
        "quote": "", 
        "reply": "It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here?", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:13:00", 
        "title": "Who is lieing??", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by SUNLINER81: quote: Originally posted by usa_girl: It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case. Appoint a \"non partisan\" investigation committee, chaired by Senator John S. McCain III... Respectfully, SUNLINER81 I'll serve on it. You have a built in bias which McCain lacks. You believe in waterboarding, he doesn't. Dave", 
        "intTime": 20090514, 
        "postID": 29, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by SUNLINER81: quote: Originally posted by usa_girl: It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case. Appoint a \"non partisan\" investigation committee, chaired by Senator John S. McCain III... Respectfully, SUNLINER81 I'll serve on it.", 
        "reply": " You have a built in bias which McCain lacks. You believe in waterboarding, he doesn't. Dave", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:16:00", 
        "title": "Who is lieing??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by usa_girl: Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war. He's also BTDT, been there and done that... I believe that given his POW status and that he was tortured at the hands of the enemy, people will believe him, regardless his party affiliation... IMHO... Respectfully, SUNLINER81 Good choice! I'll go along with that. Dave", 
        "intTime": 20090514, 
        "postID": 30, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by usa_girl: Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war. He's also BTDT, been there and done that... I believe that given his POW status and that he was tortured at the hands of the enemy, people will believe him, regardless his party affiliation... IMHO... Respectfully, SUNLINER81", 
        "reply": " Good choice! I'll go along with that. Dave", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:17:00", 
        "title": "Who is lieing??", 
        "userID": "Grachus"
    }, 
    {
        "content": "yes, as I mentioned before, I did not have an issue with waterboarding, but I did not know it was against the law. I could never be mean to McCain after all he went through and what he did for our country. I would always have to give him that respect. And I have to say, I did not like it when I watched the movie and saw what they did to him Only if I am honest....I did not think at the time I was watching that, we should not be mean to them because two wrongs don't make a right... I thought...get in there America and make them sorry they ever messed with us. Bad huh? It is easy for me to sit here and try to use reasoning to understand the issue of right and wrong, in the big picture, after the fact, etc In the heat of the moment, I think I would understand and forgive those for making mistakes and doing whatever it took to keep us safe. I think this would have been more of an issue for me if we had gone out and done this for no good reason at all... but there was a reason we acted or over reacted and that was 9/11....never forget", 
        "intTime": 20090514, 
        "postID": 31, 
        "quote": "", 
        "reply": "yes, as I mentioned before, I did not have an issue with waterboarding, but I did not know it was against the law. I could never be mean to McCain after all he went through and what he did for our country. I would always have to give him that respect. And I have to say, I did not like it when I watched the movie and saw what they did to him Only if I am honest....I did not think at the time I was watching that, we should not be mean to them because two wrongs don't make a right... I thought...get in there America and make them sorry they ever messed with us. Bad huh? It is easy for me to sit here and try to use reasoning to understand the issue of right and wrong, in the big picture, after the fact, etc In the heat of the moment, I think I would understand and forgive those for making mistakes and doing whatever it took to keep us safe. I think this would have been more of an issue for me if we had gone out and done this for no good reason at all... but there was a reason we acted or over reacted and that was 9/11....never forget", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:19:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here? I agree and disagree. Those who ordered and carried out a decision have the greatest culpability. Those who knowlingly went along also bear responsibility, even if it's less. While I personally lean toward giving her a bye, I certainly can be wrong. Let the chips fall where they may. Dave", 
        "intTime": 20090514, 
        "postID": 32, 
        "quote": "Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here?", 
        "reply": " I agree and disagree. Those who ordered and carried out a decision have the greatest culpability. Those who knowlingly went along also bear responsibility, even if it's less. While I personally lean toward giving her a bye, I certainly can be wrong. Let the chips fall where they may. Dave", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:22:00", 
        "title": "Who is lieing??", 
        "userID": "Grachus"
    }, 
    {
        "content": "It's time people stopped hiding behind the events of 11 Sep 01. We were asleep at the switch, the bad guys got in, and that's how it happened. Piling all these layers over it as we have over the past eight years does not speak well of us as a nation. And it certainly looks bad when we allow ourselves to compromise our principles as a result. It's very easy to get lazy and make excuses to justify illegal behavior, when we should be doing the right thing. And we know what the right thing is - we codified it. Ronald Reagan knew what the right thing was - he signed the public law that was informed by the Geneva Conventions. Not a single illegal act that has been done in the name of 9/11, despite the claim that \"it works\", is justifiable when one takes the long view of those actions and their effect on our society internally and externally. And it's very disheartening to see that we have wasted so much time and effort with distractions that make us look even smaller as a people. Again - why is Nancy Pelosi an issue? So, she \"lied\". I can think of all the people who were at the tip of the spear who lied also - and they were the ones who decided that our values and principles were secondary to their personal desires. So, again: It matters not what you personally think is permissible. We are allegedly a nation of laws, not of men. We don't wake up and decide which laws we're going to abide by and which ones are impediments to our motivations. Ladies and gentlemen, that's what criminals do. That's what psychopaths do. Have we become those things?", 
        "intTime": 20090514, 
        "postID": 33, 
        "quote": "", 
        "reply": "It's time people stopped hiding behind the events of 11 Sep 01. We were asleep at the switch, the bad guys got in, and that's how it happened. Piling all these layers over it as we have over the past eight years does not speak well of us as a nation. And it certainly looks bad when we allow ourselves to compromise our principles as a result. It's very easy to get lazy and make excuses to justify illegal behavior, when we should be doing the right thing. And we know what the right thing is - we codified it. Ronald Reagan knew what the right thing was - he signed the public law that was informed by the Geneva Conventions. Not a single illegal act that has been done in the name of 9/11, despite the claim that \"it works\", is justifiable when one takes the long view of those actions and their effect on our society internally and externally. And it's very disheartening to see that we have wasted so much time and effort with distractions that make us look even smaller as a people. Again - why is Nancy Pelosi an issue? So, she \"lied\". I can think of all the people who were at the tip of the spear who lied also - and they were the ones who decided that our values and principles were secondary to their personal desires. So, again: It matters not what you personally think is permissible. We are allegedly a nation of laws, not of men. We don't wake up and decide which laws we're going to abide by and which ones are impediments to our motivations. Ladies and gentlemen, that's what criminals do. That's what psychopaths do. Have we become those things?", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:31:00", 
        "title": "Who is lieing??", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here? By her own admission... Respectfully, SUNLINER81", 
        "intTime": 20090514, 
        "postID": 34, 
        "quote": "Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here?", 
        "reply": " By her own admission... Respectfully, SUNLINER81", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:50:00", 
        "title": "Who is lieing??", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here? By her own admission... Respectfully, SUNLINER81 So, all the other guys are off the hook now. It's all Pelosi's fault - yes?", 
        "intTime": 20090514, 
        "postID": 35, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here? By her own admission... Respectfully, SUNLINER81", 
        "reply": " So, all the other guys are off the hook now. It's all Pelosi's fault - yes?", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:53:00", 
        "title": "Who is lieing??", 
        "userID": "mcgreer"
    }, 
    {
        "content": "hi mcgreer why is it everyone wants to give nancy a pass for being apart of a lie allowed illegal actions to take place? She is the speaker of the house and had a duty to keep the checks and balance in place. They are suppose to check the Pres and they dropped the ball and they want to blame it now on the CIA and intel. Well, then I am sure Bush and his people would like to go back and blame the intel and Hillary and anyone else who suggested that weapons were there and he/we needed to act. Maybe he would not have even gone to war if not for the false assumptions of weapons? I think they all have to fall and we need to clean house.", 
        "intTime": 20090514, 
        "postID": 36, 
        "quote": "", 
        "reply": "hi mcgreer why is it everyone wants to give nancy a pass for being apart of a lie allowed illegal actions to take place? She is the speaker of the house and had a duty to keep the checks and balance in place. They are suppose to check the Pres and they dropped the ball and they want to blame it now on the CIA and intel. Well, then I am sure Bush and his people would like to go back and blame the intel and Hillary and anyone else who suggested that weapons were there and he/we needed to act. Maybe he would not have even gone to war if not for the false assumptions of weapons? I think they all have to fall and we need to clean house.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:56:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: hi mcgreer why is it everyone wants to give nancy a pass for being apart of a lie allowed illegal actions to take place? She is the speaker of the house and had a duty to keep the checks and balance in place. They are suppose to check the Pres and they dropped the ball and they want to blame it now on the CIA and intel. Well, then I am sure Bush and his people would like to go back and blame the intel and Hillary and anyone else who suggested that weapons were there and he/we needed to act. Maybe he would not have even gone to war if not for the false assumptions of weapons? I think they all have to fall and we need to clean house. I am astounded at the idea that you and millions of other people allow yourselves to be influenced by this nonsense that is nothing more than a distraction from doing the job we do with all other allegations of serious crimes in our country. Pelosi is irrelevant. And if I have to explain why that is, there's a very large problem.", 
        "intTime": 20090514, 
        "postID": 37, 
        "quote": "Originally posted by usa_girl: hi mcgreer why is it everyone wants to give nancy a pass for being apart of a lie allowed illegal actions to take place? She is the speaker of the house and had a duty to keep the checks and balance in place. They are suppose to check the Pres and they dropped the ball and they want to blame it now on the CIA and intel. Well, then I am sure Bush and his people would like to go back and blame the intel and Hillary and anyone else who suggested that weapons were there and he/we needed to act. Maybe he would not have even gone to war if not for the false assumptions of weapons? I think they all have to fall and we need to clean house.", 
        "reply": " I am astounded at the idea that you and millions of other people allow yourselves to be influenced by this nonsense that is nothing more than a distraction from doing the job we do with all other allegations of serious crimes in our country. Pelosi is irrelevant. And if I have to explain why that is, there's a very large problem.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 19:03:00", 
        "title": "Who is lieing??", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Well, you don't have to explain anything to me. I am just on the outside looking in and listening and watching both parties. It just seems to me, that only the Dem's part in this seems to be irrelevant. I think everybody on both sides are very relevant.", 
        "intTime": 20090514, 
        "postID": 38, 
        "quote": "", 
        "reply": "Well, you don't have to explain anything to me. I am just on the outside looking in and listening and watching both parties. It just seems to me, that only the Dem's part in this seems to be irrelevant. I think everybody on both sides are very relevant.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 19:17:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\"", 
        "intTime": 20090514, 
        "postID": 39, 
        "quote": "", 
        "reply": "Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\"", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 14:40:00", 
        "title": "Who is lieing??", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\" Nope, she has gone over the edge. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 40, 
        "quote": "Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\"", 
        "reply": " Nope, she has gone over the edge. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 14:43:00", 
        "title": "Who is lieing??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\" Nope, she has gone over the edge. I dont discount that, and if so she certainly dont need to be in that position a second longer. So lets read the transcripts and cart her off to a mental institution or jail. If she lied so blantently about something that could so easily be proven, then yes she lost it and must be removed.", 
        "intTime": 20090514, 
        "postID": 41, 
        "quote": "Originally posted by L0A1: quote: Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\" Nope, she has gone over the edge.", 
        "reply": " I dont discount that, and if so she certainly dont need to be in that position a second longer. So lets read the transcripts and cart her off to a mental institution or jail. If she lied so blantently about something that could so easily be proven, then yes she lost it and must be removed.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 14:57:00", 
        "title": "Who is lieing??", 
        "userID": "john2x"
    }, 
    {
        "content": "It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case.", 
        "intTime": 20090514, 
        "postID": 42, 
        "quote": "", 
        "reply": "It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 17:37:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\" Or she is \"ratting out\" her cohorts in crime to cover her one-eight-zero relative bearing... Respectfully, SUNLINER81", 
        "intTime": 20090514, 
        "postID": 43, 
        "quote": "Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\"", 
        "reply": " Or she is \"ratting out\" her cohorts in crime to cover her one-eight-zero relative bearing... Respectfully, SUNLINER81", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 17:49:00", 
        "title": "Who is lieing??", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case. Appoint a \"non partisan\" investigation committee, chaired by Senator John S. McCain III... Respectfully, SUNLINER81", 
        "intTime": 20090514, 
        "postID": 44, 
        "quote": "Originally posted by usa_girl: It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case.", 
        "reply": " Appoint a \"non partisan\" investigation committee, chaired by Senator John S. McCain III... Respectfully, SUNLINER81", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 17:50:00", 
        "title": "Who is lieing??", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war.", 
        "intTime": 20090514, 
        "postID": 45, 
        "quote": "", 
        "reply": "Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:00:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war. He's also BTDT, been there and done that... I believe that given his POW status and that he was tortured at the hands of the enemy, people will believe him, regardless his party affiliation... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090514, 
        "postID": 46, 
        "quote": "Originally posted by usa_girl: Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war.", 
        "reply": " He's also BTDT, been there and done that... I believe that given his POW status and that he was tortured at the hands of the enemy, people will believe him, regardless his party affiliation... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:03:00", 
        "title": "Who is lieing??", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here?", 
        "intTime": 20090514, 
        "postID": 47, 
        "quote": "", 
        "reply": "It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here?", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:13:00", 
        "title": "Who is lieing??", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by SUNLINER81: quote: Originally posted by usa_girl: It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case. Appoint a \"non partisan\" investigation committee, chaired by Senator John S. McCain III... Respectfully, SUNLINER81 I'll serve on it. You have a built in bias which McCain lacks. You believe in waterboarding, he doesn't. Dave", 
        "intTime": 20090514, 
        "postID": 48, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by SUNLINER81: quote: Originally posted by usa_girl: It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case. Appoint a \"non partisan\" investigation committee, chaired by Senator John S. McCain III... Respectfully, SUNLINER81 I'll serve on it.", 
        "reply": " You have a built in bias which McCain lacks. You believe in waterboarding, he doesn't. Dave", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:16:00", 
        "title": "Who is lieing??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by usa_girl: Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war. He's also BTDT, been there and done that... I believe that given his POW status and that he was tortured at the hands of the enemy, people will believe him, regardless his party affiliation... IMHO... Respectfully, SUNLINER81 Good choice! I'll go along with that. Dave", 
        "intTime": 20090514, 
        "postID": 49, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by usa_girl: Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war. He's also BTDT, been there and done that... I believe that given his POW status and that he was tortured at the hands of the enemy, people will believe him, regardless his party affiliation... IMHO... Respectfully, SUNLINER81", 
        "reply": " Good choice! I'll go along with that. Dave", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:17:00", 
        "title": "Who is lieing??", 
        "userID": "Grachus"
    }, 
    {
        "content": "yes, as I mentioned before, I did not have an issue with waterboarding, but I did not know it was against the law. I could never be mean to McCain after all he went through and what he did for our country. I would always have to give him that respect. And I have to say, I did not like it when I watched the movie and saw what they did to him Only if I am honest....I did not think at the time I was watching that, we should not be mean to them because two wrongs don't make a right... I thought...get in there America and make them sorry they ever messed with us. Bad huh? It is easy for me to sit here and try to use reasoning to understand the issue of right and wrong, in the big picture, after the fact, etc In the heat of the moment, I think I would understand and forgive those for making mistakes and doing whatever it took to keep us safe. I think this would have been more of an issue for me if we had gone out and done this for no good reason at all... but there was a reason we acted or over reacted and that was 9/11....never forget", 
        "intTime": 20090514, 
        "postID": 50, 
        "quote": "", 
        "reply": "yes, as I mentioned before, I did not have an issue with waterboarding, but I did not know it was against the law. I could never be mean to McCain after all he went through and what he did for our country. I would always have to give him that respect. And I have to say, I did not like it when I watched the movie and saw what they did to him Only if I am honest....I did not think at the time I was watching that, we should not be mean to them because two wrongs don't make a right... I thought...get in there America and make them sorry they ever messed with us. Bad huh? It is easy for me to sit here and try to use reasoning to understand the issue of right and wrong, in the big picture, after the fact, etc In the heat of the moment, I think I would understand and forgive those for making mistakes and doing whatever it took to keep us safe. I think this would have been more of an issue for me if we had gone out and done this for no good reason at all... but there was a reason we acted or over reacted and that was 9/11....never forget", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:19:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here? I agree and disagree. Those who ordered and carried out a decision have the greatest culpability. Those who knowlingly went along also bear responsibility, even if it's less. While I personally lean toward giving her a bye, I certainly can be wrong. Let the chips fall where they may. Dave", 
        "intTime": 20090514, 
        "postID": 51, 
        "quote": "Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here?", 
        "reply": " I agree and disagree. Those who ordered and carried out a decision have the greatest culpability. Those who knowlingly went along also bear responsibility, even if it's less. While I personally lean toward giving her a bye, I certainly can be wrong. Let the chips fall where they may. Dave", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:22:00", 
        "title": "Who is lieing??", 
        "userID": "Grachus"
    }, 
    {
        "content": "It's time people stopped hiding behind the events of 11 Sep 01. We were asleep at the switch, the bad guys got in, and that's how it happened. Piling all these layers over it as we have over the past eight years does not speak well of us as a nation. And it certainly looks bad when we allow ourselves to compromise our principles as a result. It's very easy to get lazy and make excuses to justify illegal behavior, when we should be doing the right thing. And we know what the right thing is - we codified it. Ronald Reagan knew what the right thing was - he signed the public law that was informed by the Geneva Conventions. Not a single illegal act that has been done in the name of 9/11, despite the claim that \"it works\", is justifiable when one takes the long view of those actions and their effect on our society internally and externally. And it's very disheartening to see that we have wasted so much time and effort with distractions that make us look even smaller as a people. Again - why is Nancy Pelosi an issue? So, she \"lied\". I can think of all the people who were at the tip of the spear who lied also - and they were the ones who decided that our values and principles were secondary to their personal desires. So, again: It matters not what you personally think is permissible. We are allegedly a nation of laws, not of men. We don't wake up and decide which laws we're going to abide by and which ones are impediments to our motivations. Ladies and gentlemen, that's what criminals do. That's what psychopaths do. Have we become those things?", 
        "intTime": 20090514, 
        "postID": 52, 
        "quote": "", 
        "reply": "It's time people stopped hiding behind the events of 11 Sep 01. We were asleep at the switch, the bad guys got in, and that's how it happened. Piling all these layers over it as we have over the past eight years does not speak well of us as a nation. And it certainly looks bad when we allow ourselves to compromise our principles as a result. It's very easy to get lazy and make excuses to justify illegal behavior, when we should be doing the right thing. And we know what the right thing is - we codified it. Ronald Reagan knew what the right thing was - he signed the public law that was informed by the Geneva Conventions. Not a single illegal act that has been done in the name of 9/11, despite the claim that \"it works\", is justifiable when one takes the long view of those actions and their effect on our society internally and externally. And it's very disheartening to see that we have wasted so much time and effort with distractions that make us look even smaller as a people. Again - why is Nancy Pelosi an issue? So, she \"lied\". I can think of all the people who were at the tip of the spear who lied also - and they were the ones who decided that our values and principles were secondary to their personal desires. So, again: It matters not what you personally think is permissible. We are allegedly a nation of laws, not of men. We don't wake up and decide which laws we're going to abide by and which ones are impediments to our motivations. Ladies and gentlemen, that's what criminals do. That's what psychopaths do. Have we become those things?", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:31:00", 
        "title": "Who is lieing??", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here? By her own admission... Respectfully, SUNLINER81", 
        "intTime": 20090514, 
        "postID": 53, 
        "quote": "Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here?", 
        "reply": " By her own admission... Respectfully, SUNLINER81", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:50:00", 
        "title": "Who is lieing??", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here? By her own admission... Respectfully, SUNLINER81 So, all the other guys are off the hook now. It's all Pelosi's fault - yes?", 
        "intTime": 20090514, 
        "postID": 54, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here? By her own admission... Respectfully, SUNLINER81", 
        "reply": " So, all the other guys are off the hook now. It's all Pelosi's fault - yes?", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:53:00", 
        "title": "Who is lieing??", 
        "userID": "mcgreer"
    }, 
    {
        "content": "hi mcgreer why is it everyone wants to give nancy a pass for being apart of a lie allowed illegal actions to take place? She is the speaker of the house and had a duty to keep the checks and balance in place. They are suppose to check the Pres and they dropped the ball and they want to blame it now on the CIA and intel. Well, then I am sure Bush and his people would like to go back and blame the intel and Hillary and anyone else who suggested that weapons were there and he/we needed to act. Maybe he would not have even gone to war if not for the false assumptions of weapons? I think they all have to fall and we need to clean house.", 
        "intTime": 20090514, 
        "postID": 55, 
        "quote": "", 
        "reply": "hi mcgreer why is it everyone wants to give nancy a pass for being apart of a lie allowed illegal actions to take place? She is the speaker of the house and had a duty to keep the checks and balance in place. They are suppose to check the Pres and they dropped the ball and they want to blame it now on the CIA and intel. Well, then I am sure Bush and his people would like to go back and blame the intel and Hillary and anyone else who suggested that weapons were there and he/we needed to act. Maybe he would not have even gone to war if not for the false assumptions of weapons? I think they all have to fall and we need to clean house.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:56:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: hi mcgreer why is it everyone wants to give nancy a pass for being apart of a lie allowed illegal actions to take place? She is the speaker of the house and had a duty to keep the checks and balance in place. They are suppose to check the Pres and they dropped the ball and they want to blame it now on the CIA and intel. Well, then I am sure Bush and his people would like to go back and blame the intel and Hillary and anyone else who suggested that weapons were there and he/we needed to act. Maybe he would not have even gone to war if not for the false assumptions of weapons? I think they all have to fall and we need to clean house. I am astounded at the idea that you and millions of other people allow yourselves to be influenced by this nonsense that is nothing more than a distraction from doing the job we do with all other allegations of serious crimes in our country. Pelosi is irrelevant. And if I have to explain why that is, there's a very large problem.", 
        "intTime": 20090514, 
        "postID": 56, 
        "quote": "Originally posted by usa_girl: hi mcgreer why is it everyone wants to give nancy a pass for being apart of a lie allowed illegal actions to take place? She is the speaker of the house and had a duty to keep the checks and balance in place. They are suppose to check the Pres and they dropped the ball and they want to blame it now on the CIA and intel. Well, then I am sure Bush and his people would like to go back and blame the intel and Hillary and anyone else who suggested that weapons were there and he/we needed to act. Maybe he would not have even gone to war if not for the false assumptions of weapons? I think they all have to fall and we need to clean house.", 
        "reply": " I am astounded at the idea that you and millions of other people allow yourselves to be influenced by this nonsense that is nothing more than a distraction from doing the job we do with all other allegations of serious crimes in our country. Pelosi is irrelevant. And if I have to explain why that is, there's a very large problem.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 19:03:00", 
        "title": "Who is lieing??", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Well, you don't have to explain anything to me. I am just on the outside looking in and listening and watching both parties. It just seems to me, that only the Dem's part in this seems to be irrelevant. I think everybody on both sides are very relevant.", 
        "intTime": 20090514, 
        "postID": 57, 
        "quote": "", 
        "reply": "Well, you don't have to explain anything to me. I am just on the outside looking in and listening and watching both parties. It just seems to me, that only the Dem's part in this seems to be irrelevant. I think everybody on both sides are very relevant.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 19:17:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\"", 
        "intTime": 20090514, 
        "postID": 58, 
        "quote": "", 
        "reply": "Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\"", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 14:40:00", 
        "title": "Who is lieing??", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\" Nope, she has gone over the edge. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090514, 
        "postID": 59, 
        "quote": "Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\"", 
        "reply": " Nope, she has gone over the edge. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 14:43:00", 
        "title": "Who is lieing??", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\" Nope, she has gone over the edge. I dont discount that, and if so she certainly dont need to be in that position a second longer. So lets read the transcripts and cart her off to a mental institution or jail. If she lied so blantently about something that could so easily be proven, then yes she lost it and must be removed.", 
        "intTime": 20090514, 
        "postID": 60, 
        "quote": "Originally posted by L0A1: quote: Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\" Nope, she has gone over the edge.", 
        "reply": " I dont discount that, and if so she certainly dont need to be in that position a second longer. So lets read the transcripts and cart her off to a mental institution or jail. If she lied so blantently about something that could so easily be proven, then yes she lost it and must be removed.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 14:57:00", 
        "title": "Who is lieing??", 
        "userID": "john2x"
    }, 
    {
        "content": "It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case.", 
        "intTime": 20090514, 
        "postID": 61, 
        "quote": "", 
        "reply": "It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 17:37:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\" Or she is \"ratting out\" her cohorts in crime to cover her one-eight-zero relative bearing... Respectfully, SUNLINER81", 
        "intTime": 20090514, 
        "postID": 62, 
        "quote": "Originally posted by john2x: Both sides now have taken firm irrevocable positions. Some one needs to go to jail Both cant be telling the truth? Pelosi Says release the transcripts of the briefing,She claims she was assured that waterboarding was not being used and the transcripts would prove that. Why would she lie about something that could so easily be proven. So why not release the transcript and then put one of them in Jail? Im no fan of Pelosi but common sense tells me that she wouldnt be asking for a release of the briefing transcript that would show she was assured waterboarding specifically was not being employed unless it was true. A ten minuit investigation would produce a criminal. \"http://www.cfiflistmanager.org/pelosimemos1be.html\"", 
        "reply": " Or she is \"ratting out\" her cohorts in crime to cover her one-eight-zero relative bearing... Respectfully, SUNLINER81", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 17:49:00", 
        "title": "Who is lieing??", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case. Appoint a \"non partisan\" investigation committee, chaired by Senator John S. McCain III... Respectfully, SUNLINER81", 
        "intTime": 20090514, 
        "postID": 63, 
        "quote": "Originally posted by usa_girl: It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case.", 
        "reply": " Appoint a \"non partisan\" investigation committee, chaired by Senator John S. McCain III... Respectfully, SUNLINER81", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 17:50:00", 
        "title": "Who is lieing??", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war.", 
        "intTime": 20090514, 
        "postID": 64, 
        "quote": "", 
        "reply": "Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:00:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war. He's also BTDT, been there and done that... I believe that given his POW status and that he was tortured at the hands of the enemy, people will believe him, regardless his party affiliation... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090514, 
        "postID": 65, 
        "quote": "Originally posted by usa_girl: Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war.", 
        "reply": " He's also BTDT, been there and done that... I believe that given his POW status and that he was tortured at the hands of the enemy, people will believe him, regardless his party affiliation... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:03:00", 
        "title": "Who is lieing??", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here?", 
        "intTime": 20090514, 
        "postID": 66, 
        "quote": "", 
        "reply": "It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here?", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:13:00", 
        "title": "Who is lieing??", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: Originally posted by SUNLINER81: quote: Originally posted by usa_girl: It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case. Appoint a \"non partisan\" investigation committee, chaired by Senator John S. McCain III... Respectfully, SUNLINER81 I'll serve on it. You have a built in bias which McCain lacks. You believe in waterboarding, he doesn't. Dave", 
        "intTime": 20090514, 
        "postID": 67, 
        "quote": "Originally posted by klassylady25: quote: Originally posted by SUNLINER81: quote: Originally posted by usa_girl: It is outrageous on both sides. I am sure Bush had enough people working for him to tell him that waterboarding was illegal, yes? And he would do it anyway? They will say, they hired an outside company to handle that stuff and the hire up did not know what was going on, so maybe Rummy will have to be the fall guy on all of this. Cheny is a lot of things, but stupid? Nope. I can't see him allowing his name to be on any document that would have him do jail time. That is why you see him out in the media getting his side of this out. He will go out fighting. As for the other side, first they went along with it, then nancy claims she flat out did not know anything about it and now she was mislead which leads you to believe that she did know forms of torture were being used or extreme methods and was lied to about waterboarding. I kinda agree with everyone saying let all the documents be released and we can see in writing who was where and who knew what. But you can't have Obama in the middle allowing only documents that support the Dems claims be let out. He has to let the other side have a fair chance to defend their actions or prove their case. Appoint a \"non partisan\" investigation committee, chaired by Senator John S. McCain III... Respectfully, SUNLINER81 I'll serve on it.", 
        "reply": " You have a built in bias which McCain lacks. You believe in waterboarding, he doesn't. Dave", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:16:00", 
        "title": "Who is lieing??", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by usa_girl: Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war. He's also BTDT, been there and done that... I believe that given his POW status and that he was tortured at the hands of the enemy, people will believe him, regardless his party affiliation... IMHO... Respectfully, SUNLINER81 Good choice! I'll go along with that. Dave", 
        "intTime": 20090514, 
        "postID": 68, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by usa_girl: Good person Sunliner. But if the committee let's Bush have a pass, they will just say McCain was a Rep ... I think he would be good because he is totally against waterboarding and is for America and knows what it takes to win a war. He's also BTDT, been there and done that... I believe that given his POW status and that he was tortured at the hands of the enemy, people will believe him, regardless his party affiliation... IMHO... Respectfully, SUNLINER81", 
        "reply": " Good choice! I'll go along with that. Dave", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:17:00", 
        "title": "Who is lieing??", 
        "userID": "Grachus"
    }, 
    {
        "content": "yes, as I mentioned before, I did not have an issue with waterboarding, but I did not know it was against the law. I could never be mean to McCain after all he went through and what he did for our country. I would always have to give him that respect. And I have to say, I did not like it when I watched the movie and saw what they did to him Only if I am honest....I did not think at the time I was watching that, we should not be mean to them because two wrongs don't make a right... I thought...get in there America and make them sorry they ever messed with us. Bad huh? It is easy for me to sit here and try to use reasoning to understand the issue of right and wrong, in the big picture, after the fact, etc In the heat of the moment, I think I would understand and forgive those for making mistakes and doing whatever it took to keep us safe. I think this would have been more of an issue for me if we had gone out and done this for no good reason at all... but there was a reason we acted or over reacted and that was 9/11....never forget", 
        "intTime": 20090514, 
        "postID": 69, 
        "quote": "", 
        "reply": "yes, as I mentioned before, I did not have an issue with waterboarding, but I did not know it was against the law. I could never be mean to McCain after all he went through and what he did for our country. I would always have to give him that respect. And I have to say, I did not like it when I watched the movie and saw what they did to him Only if I am honest....I did not think at the time I was watching that, we should not be mean to them because two wrongs don't make a right... I thought...get in there America and make them sorry they ever messed with us. Bad huh? It is easy for me to sit here and try to use reasoning to understand the issue of right and wrong, in the big picture, after the fact, etc In the heat of the moment, I think I would understand and forgive those for making mistakes and doing whatever it took to keep us safe. I think this would have been more of an issue for me if we had gone out and done this for no good reason at all... but there was a reason we acted or over reacted and that was 9/11....never forget", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:19:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here? I agree and disagree. Those who ordered and carried out a decision have the greatest culpability. Those who knowlingly went along also bear responsibility, even if it's less. While I personally lean toward giving her a bye, I certainly can be wrong. Let the chips fall where they may. Dave", 
        "intTime": 20090514, 
        "postID": 70, 
        "quote": "Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here?", 
        "reply": " I agree and disagree. Those who ordered and carried out a decision have the greatest culpability. Those who knowlingly went along also bear responsibility, even if it's less. While I personally lean toward giving her a bye, I certainly can be wrong. Let the chips fall where they may. Dave", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:22:00", 
        "title": "Who is lieing??", 
        "userID": "Grachus"
    }, 
    {
        "content": "It's time people stopped hiding behind the events of 11 Sep 01. We were asleep at the switch, the bad guys got in, and that's how it happened. Piling all these layers over it as we have over the past eight years does not speak well of us as a nation. And it certainly looks bad when we allow ourselves to compromise our principles as a result. It's very easy to get lazy and make excuses to justify illegal behavior, when we should be doing the right thing. And we know what the right thing is - we codified it. Ronald Reagan knew what the right thing was - he signed the public law that was informed by the Geneva Conventions. Not a single illegal act that has been done in the name of 9/11, despite the claim that \"it works\", is justifiable when one takes the long view of those actions and their effect on our society internally and externally. And it's very disheartening to see that we have wasted so much time and effort with distractions that make us look even smaller as a people. Again - why is Nancy Pelosi an issue? So, she \"lied\". I can think of all the people who were at the tip of the spear who lied also - and they were the ones who decided that our values and principles were secondary to their personal desires. So, again: It matters not what you personally think is permissible. We are allegedly a nation of laws, not of men. We don't wake up and decide which laws we're going to abide by and which ones are impediments to our motivations. Ladies and gentlemen, that's what criminals do. That's what psychopaths do. Have we become those things?", 
        "intTime": 20090514, 
        "postID": 71, 
        "quote": "", 
        "reply": "It's time people stopped hiding behind the events of 11 Sep 01. We were asleep at the switch, the bad guys got in, and that's how it happened. Piling all these layers over it as we have over the past eight years does not speak well of us as a nation. And it certainly looks bad when we allow ourselves to compromise our principles as a result. It's very easy to get lazy and make excuses to justify illegal behavior, when we should be doing the right thing. And we know what the right thing is - we codified it. Ronald Reagan knew what the right thing was - he signed the public law that was informed by the Geneva Conventions. Not a single illegal act that has been done in the name of 9/11, despite the claim that \"it works\", is justifiable when one takes the long view of those actions and their effect on our society internally and externally. And it's very disheartening to see that we have wasted so much time and effort with distractions that make us look even smaller as a people. Again - why is Nancy Pelosi an issue? So, she \"lied\". I can think of all the people who were at the tip of the spear who lied also - and they were the ones who decided that our values and principles were secondary to their personal desires. So, again: It matters not what you personally think is permissible. We are allegedly a nation of laws, not of men. We don't wake up and decide which laws we're going to abide by and which ones are impediments to our motivations. Ladies and gentlemen, that's what criminals do. That's what psychopaths do. Have we become those things?", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:31:00", 
        "title": "Who is lieing??", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here? By her own admission... Respectfully, SUNLINER81", 
        "intTime": 20090514, 
        "postID": 72, 
        "quote": "Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here?", 
        "reply": " By her own admission... Respectfully, SUNLINER81", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:50:00", 
        "title": "Who is lieing??", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here? By her own admission... Respectfully, SUNLINER81 So, all the other guys are off the hook now. It's all Pelosi's fault - yes?", 
        "intTime": 20090514, 
        "postID": 73, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by mcgreer: It's really unfortunate to see how dumbed down and gullible Americans have become. I don't care about Speaker Pelosi one way or the other; however, she wrote no memo, was not an advisor concerning policy/policies that led to the writing of a memo or memos, and as the leader of the party that was in the minority during a time of very aggressive partisanism, wouldn't have been able to do anything to halt the practices sanctioned by a memo. So, why, exactly, is she relevant here? By her own admission... Respectfully, SUNLINER81", 
        "reply": " So, all the other guys are off the hook now. It's all Pelosi's fault - yes?", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:53:00", 
        "title": "Who is lieing??", 
        "userID": "mcgreer"
    }, 
    {
        "content": "hi mcgreer why is it everyone wants to give nancy a pass for being apart of a lie allowed illegal actions to take place? She is the speaker of the house and had a duty to keep the checks and balance in place. They are suppose to check the Pres and they dropped the ball and they want to blame it now on the CIA and intel. Well, then I am sure Bush and his people would like to go back and blame the intel and Hillary and anyone else who suggested that weapons were there and he/we needed to act. Maybe he would not have even gone to war if not for the false assumptions of weapons? I think they all have to fall and we need to clean house.", 
        "intTime": 20090514, 
        "postID": 74, 
        "quote": "", 
        "reply": "hi mcgreer why is it everyone wants to give nancy a pass for being apart of a lie allowed illegal actions to take place? She is the speaker of the house and had a duty to keep the checks and balance in place. They are suppose to check the Pres and they dropped the ball and they want to blame it now on the CIA and intel. Well, then I am sure Bush and his people would like to go back and blame the intel and Hillary and anyone else who suggested that weapons were there and he/we needed to act. Maybe he would not have even gone to war if not for the false assumptions of weapons? I think they all have to fall and we need to clean house.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 18:56:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: hi mcgreer why is it everyone wants to give nancy a pass for being apart of a lie allowed illegal actions to take place? She is the speaker of the house and had a duty to keep the checks and balance in place. They are suppose to check the Pres and they dropped the ball and they want to blame it now on the CIA and intel. Well, then I am sure Bush and his people would like to go back and blame the intel and Hillary and anyone else who suggested that weapons were there and he/we needed to act. Maybe he would not have even gone to war if not for the false assumptions of weapons? I think they all have to fall and we need to clean house. I am astounded at the idea that you and millions of other people allow yourselves to be influenced by this nonsense that is nothing more than a distraction from doing the job we do with all other allegations of serious crimes in our country. Pelosi is irrelevant. And if I have to explain why that is, there's a very large problem.", 
        "intTime": 20090514, 
        "postID": 75, 
        "quote": "Originally posted by usa_girl: hi mcgreer why is it everyone wants to give nancy a pass for being apart of a lie allowed illegal actions to take place? She is the speaker of the house and had a duty to keep the checks and balance in place. They are suppose to check the Pres and they dropped the ball and they want to blame it now on the CIA and intel. Well, then I am sure Bush and his people would like to go back and blame the intel and Hillary and anyone else who suggested that weapons were there and he/we needed to act. Maybe he would not have even gone to war if not for the false assumptions of weapons? I think they all have to fall and we need to clean house.", 
        "reply": " I am astounded at the idea that you and millions of other people allow yourselves to be influenced by this nonsense that is nothing more than a distraction from doing the job we do with all other allegations of serious crimes in our country. Pelosi is irrelevant. And if I have to explain why that is, there's a very large problem.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 19:03:00", 
        "title": "Who is lieing??", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Well, you don't have to explain anything to me. I am just on the outside looking in and listening and watching both parties. It just seems to me, that only the Dem's part in this seems to be irrelevant. I think everybody on both sides are very relevant.", 
        "intTime": 20090514, 
        "postID": 76, 
        "quote": "", 
        "reply": "Well, you don't have to explain anything to me. I am just on the outside looking in and listening and watching both parties. It just seems to me, that only the Dem's part in this seems to be irrelevant. I think everybody on both sides are very relevant.", 
        "threadID": "672198221_4300023322001", 
        "time": "2009-05-14 19:17:00", 
        "title": "Who is lieing??", 
        "userID": "usa_girl"
    }
]