[
    {
        "content": "quote: (New York Daily News, March 27, 2009, Pg. 6) President Barack Obama will hit the beaches of Normandy on June 6 to commemorate the 65th anniversary of World War II’s D-Day landings, French officials said. During the presidential campaign, Obama often talked about his maternal grandfather’s Army service during World War II and the sacrifices that generation made. quote: Obama to Woo European Public on Overseas Trip(Wall Street Journal, March 27, 2009, Pg. 8) President Barack Obama, heading overseas for the first time as president next week, aims to use a combination of summit protocol and campaign flash to corral support for his programs. Facing political headwinds but with a European public still on his side, Obama will attend three high-profile international events: the meeting of Group of 20 nations that kicks off Wednesday evening in London, a NATO meeting at the end of the week and a European Union-U.S. summit in Prague on April 5. He also intends to extend his efforts beyond official meetings. He will hold a town hall-style meeting at a sports arena in Strasbourg, France, European diplomatic officials said. And the White House is looking for a site in Prague for the first public foreign-policy speech of Obama’s presidency. Out*******standing!", 
        "intTime": 20090327, 
        "postID": 1, 
        "quote": "(New York Daily News, March 27, 2009, Pg. 6) President Barack Obama will hit the beaches of Normandy on June 6 to commemorate the 65th anniversary of World War II’s D-Day landings, French officials said. During the presidential campaign, Obama often talked about his maternal grandfather’s Army service during World War II and the sacrifices that generation made.", 
        "reply": " quote: Obama to Woo European Public on Overseas Trip(Wall Street Journal, March 27, 2009, Pg. 8) President Barack Obama, heading overseas for the first time as president next week, aims to use a combination of summit protocol and campaign flash to corral support for his programs. Facing political headwinds but with a European public still on his side, Obama will attend three high-profile international events: the meeting of Group of 20 nations that kicks off Wednesday evening in London, a NATO meeting at the end of the week and a European Union-U.S. summit in Prague on April 5. He also intends to extend his efforts beyond official meetings. He will hold a town hall-style meeting at a sports arena in Strasbourg, France, European diplomatic officials said. And the White House is looking for a site in Prague for the first public foreign-policy speech of Obama’s presidency. Out*******standing!", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-27 07:21:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "Knele"
    }, 
    {
        "content": "BTDT XXXhttp://www.youtube.com/watch?v=rBeyZAmmJNgXXX We're here to mark that day in history when the Allied armies joined in battle to reclaim this continent to liberty. For four long years, much of Europe had been under a terrible shadow. Free nations had fallen, Jews cried out in the camps, millions cried out for liberation. Europe was enslaved, and the world prayed for its rescue. Here in Normandy the rescue began. Here the Allies stood and fought against tyranny in a giant undertaking unparalleled in human history. We stand on a lonely, windswept point on the northern shore of France. The air is soft, but 40 years ago at this moment, the air was dense with smoke and the cries of men, and the air was filled with the crack of rifle fire and the roar of cannon. At dawn, on the morning of the 6th of June, 1944, 225 Rangers jumped off the British landing craft and ran to the bottom of these cliffs. Their mission was one of the most difficult and daring of the invasion: to climb these sheer and desolate cliffs and take out the enemy guns. The Allies had been told that some of the mightiest of these guns were here and they would be trained on the beaches to stop the Allied advance. The Rangers looked up and saw the enemy soldiers--the edge of the cliffs shooting down at them with machine guns and throwing grenades. And the American Rangers began to climb. They shot rope ladders over the face of these cliffs and began to pull themselves up. When one Ranger fell, another would take his place. When one rope was cut, a Ranger would grab another and begin his climb again. They climbed, shot back, and held their footing. Soon, one by one, the Rangers pulled themselves over the top, and in seizing the firm land at the top of these cliffs, they began to seize back the continent of Europe. Two hundred and twenty-five came here. After two days of fighting, only 90 could still bear arms. Behind me is a memorial that symbolizes the Ranger daggers that were thrust into the top of these cliffs. And before me are the men who put them there. These are the boys of Pointe du Hoc. These are the men who took the cliffs. These are the champions who helped free a continent. These are the heroes who helped end a war. Gentlemen, I look at you and I think of the words of Stephen Spender's poem. You are men who in your \"lives fought for life . . . and left the vivid air signed with your honor.'' I think I know what you may be thinking right now--thinking, \"We were just part of a bigger effort; everyone was brave that day.'' Well, everyone was. Do you remember the story of Bill Millin of the 51st Highlanders? Forty years ago today, British troops were pinned down near a bridge, waiting desperately for help. Suddenly, they heard the sound of bagpipes, and some thought they were dreaming. Well, they weren't. They looked up and saw Bill Millin with his bagpipes, leading the reinforcements and ignoring the smack of the bullets into the ground around him. Lord Lovat was with him--Lord Lovat of Scotland, who calmly announced when he got to the bridge, \"Sorry I'm a few minutes late,'' as if he'd been delayed by a traffic jam, when in truth he'd just come from the bloody fighting on Sword Beach, which he and his men had just taken. There was the impossible valor of the Poles who threw themselves between the enemy and the rest of Europe as the invasion took hold, and the unsurpassed courage of the Canadians who had already seen the horrors of war on this coast. They knew what awaited them there, but they would not be deterred. And once they hit Juno Beach, they never looked back. All of these men were part of a rollcall of honor with names that spoke of a pride as bright as the colors they bore: the Royal Winnipeg Rifles, Poland's 24th Lancers, the Royal Scots Fusiliers, the Screaming Eagles, the Yeomen of England's armored divisions, the forces of Free France, the Coast Guard's \"Matchbox Fleet'' and you, the American Rangers. Forty summers have passed since the battle that you fought here. You were young the day you took these cliffs; some of you were hardly more than boys, with the deepest joys of life before you. Yet, you risked everything here. Why? Why did you do it? What impelled you to put aside the instinct for self-preservation and risk your lives to take these cliffs? What inspired all the men of the armies that met here? We look at you, and somehow we know the answer. It was faith and belief; it was loyalty and love. The men of Normandy had faith that what they were doing was right, faith that they fought for all humanity, faith that a just God would grant them mercy on this beachhead or on the next. It was the deep knowledge--and pray God we have not lost it--that there is a profound, moral difference between the use of force for liberation and the use of force for conquest. You were here to liberate, not to conquer, and so you and those others did not doubt your cause. And you were right not to doubt. You all knew that some things are worth dying for. One's country is worth dying for, and democracy is worth dying for, because it's the most deeply honorable form of government ever devised by man. All of you loved liberty. All of you were willing to fight tyranny, and you knew the people of your countries were behind you. The Americans who fought here that morning knew word of the invasion was spreading through the darkness back home. They thought--or felt in their hearts, though they couldn't know in fact, that in Georgia they were filling the churches at 4 a.m., in Kansas they were kneeling on their porches and praying, and in Philadelphia they were ringing the Liberty Bell. Something else helped the men of D-Day: their rock-hard belief that Providence would have a great hand in the events that would unfold here; that God was an ally in this great cause. And so, the night before the invasion, when Colonel Wolverton asked his parachute troops to kneel with him in prayer he told them: Do not bow your heads, but look up so you can see God and ask His blessing in what we're about to do. Also that night, General Matthew Ridgway on his cot, listening in the darkness for the promise God made to Joshua: \"I will not fail thee nor forsake thee.'' These are the things that impelled them; these are the things that shaped the unity of the Allies. When the war was over, there were lives to be rebuilt and governments to be returned to the people. There were nations to be reborn. Above all, there was a new peace to be assured. These were huge and daunting tasks. But the Allies summoned strength from the faith, belief, loyalty, and love of those who fell here. They rebuilt a new Europe together. There was first a great reconciliation among those who had been enemies, all of whom had suffered so greatly. The United States did its part, creating the Marshall Plan to help rebuild our allies and our former enemies. The Marshall Plan led to the Atlantic alliance--a great alliance that serves to this day as our shield for freedom, for prosperity, and for peace. In spite of our great efforts and successes, not all that followed the end of the war was happy or planned. Some liberated countries were lost. The great sadness of this loss echoes down to our own time in the streets of Warsaw, Prague, and East Berlin. Soviet troops that came to the center of this continent did not leave when peace came. They're still there, uninvited, unwanted, unyielding, almost 40 years after the war. Because of this, Allied forces still stand on this continent. Today, as 40 years ago, our armies are here for only one purpose--to protect and defend democracy. The only territories we hold are memorials like this one and graveyards where our heroes rest. We in America have learned bitter lessons from two World Wars: It is better to be here ready to protect the peace than to take blind shelter across the sea, rushing to respond only after freedom is lost. We've learned that isolationism never was and never will be an acceptable response to tyrannical governments with an expansionist intent. But we try always to be prepared for peace; prepared to deter aggression; prepared to negotiate the reduction of arms; and, yes, prepared to reach out again in the spirit of reconciliation. In truth, there is no reconciliation we would welcome more than a reconciliation with the Soviet Union, so, together, we can lessen the risks of war, now and forever. It's fitting to remember here the great losses also suffered by the Russian people during World War II: 20 million perished, a terrible price that testifies to all the world the necessity of ending war. I tell you from my heart that we in the United States do not want war. We want to wipe from the face of the Earth the terrible weapons that man now has in his hands. And I tell you, we are ready to seize that beachhead. We look for some sign from the Soviet Union that they are willing to move forward, that they share our desire and love for peace, and that they will give up the ways of conquest. There must be a changing there that will allow us to turn our hope into action. We will pray forever that some day that changing will come. But for now, particularly today, it is good and fitting to renew our commitment to each other, to our freedom, and to the alliance that protects it. We are bound today by what bound us 40 years ago, the same loyalties, traditions, and beliefs. We're bound by reality. The strength of America's allies is vital to the United States, and the American security guarantee is essential to the continued freedom of Europe's democracies. We were with you then; we are with you now. Your hopes are our hopes, and your destiny is our destiny. Here, in this place where the West held together, let us make a vow to our dead. Let us show them by our actions that we understand what they died for. Let our actions say to them the words for which Matthew Ridgway listened: \"I will not fail thee nor forsake thee.'' Strengthened by their courage, heartened by their value [valor], and borne by their memory, let us continue to stand for the ideals for which they lived and died. Thank you very much, and God bless you all.", 
        "intTime": 20090327, 
        "postID": 2, 
        "quote": "", 
        "reply": "BTDT XXXhttp://www.youtube.com/watch?v=rBeyZAmmJNgXXX We're here to mark that day in history when the Allied armies joined in battle to reclaim this continent to liberty. For four long years, much of Europe had been under a terrible shadow. Free nations had fallen, Jews cried out in the camps, millions cried out for liberation. Europe was enslaved, and the world prayed for its rescue. Here in Normandy the rescue began. Here the Allies stood and fought against tyranny in a giant undertaking unparalleled in human history. We stand on a lonely, windswept point on the northern shore of France. The air is soft, but 40 years ago at this moment, the air was dense with smoke and the cries of men, and the air was filled with the crack of rifle fire and the roar of cannon. At dawn, on the morning of the 6th of June, 1944, 225 Rangers jumped off the British landing craft and ran to the bottom of these cliffs. Their mission was one of the most difficult and daring of the invasion: to climb these sheer and desolate cliffs and take out the enemy guns. The Allies had been told that some of the mightiest of these guns were here and they would be trained on the beaches to stop the Allied advance. The Rangers looked up and saw the enemy soldiers--the edge of the cliffs shooting down at them with machine guns and throwing grenades. And the American Rangers began to climb. They shot rope ladders over the face of these cliffs and began to pull themselves up. When one Ranger fell, another would take his place. When one rope was cut, a Ranger would grab another and begin his climb again. They climbed, shot back, and held their footing. Soon, one by one, the Rangers pulled themselves over the top, and in seizing the firm land at the top of these cliffs, they began to seize back the continent of Europe. Two hundred and twenty-five came here. After two days of fighting, only 90 could still bear arms. Behind me is a memorial that symbolizes the Ranger daggers that were thrust into the top of these cliffs. And before me are the men who put them there. These are the boys of Pointe du Hoc. These are the men who took the cliffs. These are the champions who helped free a continent. These are the heroes who helped end a war. Gentlemen, I look at you and I think of the words of Stephen Spender's poem. You are men who in your \"lives fought for life . . . and left the vivid air signed with your honor.'' I think I know what you may be thinking right now--thinking, \"We were just part of a bigger effort; everyone was brave that day.'' Well, everyone was. Do you remember the story of Bill Millin of the 51st Highlanders? Forty years ago today, British troops were pinned down near a bridge, waiting desperately for help. Suddenly, they heard the sound of bagpipes, and some thought they were dreaming. Well, they weren't. They looked up and saw Bill Millin with his bagpipes, leading the reinforcements and ignoring the smack of the bullets into the ground around him. Lord Lovat was with him--Lord Lovat of Scotland, who calmly announced when he got to the bridge, \"Sorry I'm a few minutes late,'' as if he'd been delayed by a traffic jam, when in truth he'd just come from the bloody fighting on Sword Beach, which he and his men had just taken. There was the impossible valor of the Poles who threw themselves between the enemy and the rest of Europe as the invasion took hold, and the unsurpassed courage of the Canadians who had already seen the horrors of war on this coast. They knew what awaited them there, but they would not be deterred. And once they hit Juno Beach, they never looked back. All of these men were part of a rollcall of honor with names that spoke of a pride as bright as the colors they bore: the Royal Winnipeg Rifles, Poland's 24th Lancers, the Royal Scots Fusiliers, the Screaming Eagles, the Yeomen of England's armored divisions, the forces of Free France, the Coast Guard's \"Matchbox Fleet'' and you, the American Rangers. Forty summers have passed since the battle that you fought here. You were young the day you took these cliffs; some of you were hardly more than boys, with the deepest joys of life before you. Yet, you risked everything here. Why? Why did you do it? What impelled you to put aside the instinct for self-preservation and risk your lives to take these cliffs? What inspired all the men of the armies that met here? We look at you, and somehow we know the answer. It was faith and belief; it was loyalty and love. The men of Normandy had faith that what they were doing was right, faith that they fought for all humanity, faith that a just God would grant them mercy on this beachhead or on the next. It was the deep knowledge--and pray God we have not lost it--that there is a profound, moral difference between the use of force for liberation and the use of force for conquest. You were here to liberate, not to conquer, and so you and those others did not doubt your cause. And you were right not to doubt. You all knew that some things are worth dying for. One's country is worth dying for, and democracy is worth dying for, because it's the most deeply honorable form of government ever devised by man. All of you loved liberty. All of you were willing to fight tyranny, and you knew the people of your countries were behind you. The Americans who fought here that morning knew word of the invasion was spreading through the darkness back home. They thought--or felt in their hearts, though they couldn't know in fact, that in Georgia they were filling the churches at 4 a.m., in Kansas they were kneeling on their porches and praying, and in Philadelphia they were ringing the Liberty Bell. Something else helped the men of D-Day: their rock-hard belief that Providence would have a great hand in the events that would unfold here; that God was an ally in this great cause. And so, the night before the invasion, when Colonel Wolverton asked his parachute troops to kneel with him in prayer he told them: Do not bow your heads, but look up so you can see God and ask His blessing in what we're about to do. Also that night, General Matthew Ridgway on his cot, listening in the darkness for the promise God made to Joshua: \"I will not fail thee nor forsake thee.'' These are the things that impelled them; these are the things that shaped the unity of the Allies. When the war was over, there were lives to be rebuilt and governments to be returned to the people. There were nations to be reborn. Above all, there was a new peace to be assured. These were huge and daunting tasks. But the Allies summoned strength from the faith, belief, loyalty, and love of those who fell here. They rebuilt a new Europe together. There was first a great reconciliation among those who had been enemies, all of whom had suffered so greatly. The United States did its part, creating the Marshall Plan to help rebuild our allies and our former enemies. The Marshall Plan led to the Atlantic alliance--a great alliance that serves to this day as our shield for freedom, for prosperity, and for peace. In spite of our great efforts and successes, not all that followed the end of the war was happy or planned. Some liberated countries were lost. The great sadness of this loss echoes down to our own time in the streets of Warsaw, Prague, and East Berlin. Soviet troops that came to the center of this continent did not leave when peace came. They're still there, uninvited, unwanted, unyielding, almost 40 years after the war. Because of this, Allied forces still stand on this continent. Today, as 40 years ago, our armies are here for only one purpose--to protect and defend democracy. The only territories we hold are memorials like this one and graveyards where our heroes rest. We in America have learned bitter lessons from two World Wars: It is better to be here ready to protect the peace than to take blind shelter across the sea, rushing to respond only after freedom is lost. We've learned that isolationism never was and never will be an acceptable response to tyrannical governments with an expansionist intent. But we try always to be prepared for peace; prepared to deter aggression; prepared to negotiate the reduction of arms; and, yes, prepared to reach out again in the spirit of reconciliation. In truth, there is no reconciliation we would welcome more than a reconciliation with the Soviet Union, so, together, we can lessen the risks of war, now and forever. It's fitting to remember here the great losses also suffered by the Russian people during World War II: 20 million perished, a terrible price that testifies to all the world the necessity of ending war. I tell you from my heart that we in the United States do not want war. We want to wipe from the face of the Earth the terrible weapons that man now has in his hands. And I tell you, we are ready to seize that beachhead. We look for some sign from the Soviet Union that they are willing to move forward, that they share our desire and love for peace, and that they will give up the ways of conquest. There must be a changing there that will allow us to turn our hope into action. We will pray forever that some day that changing will come. But for now, particularly today, it is good and fitting to renew our commitment to each other, to our freedom, and to the alliance that protects it. We are bound today by what bound us 40 years ago, the same loyalties, traditions, and beliefs. We're bound by reality. The strength of America's allies is vital to the United States, and the American security guarantee is essential to the continued freedom of Europe's democracies. We were with you then; we are with you now. Your hopes are our hopes, and your destiny is our destiny. Here, in this place where the West held together, let us make a vow to our dead. Let us show them by our actions that we understand what they died for. Let our actions say to them the words for which Matthew Ridgway listened: \"I will not fail thee nor forsake thee.'' Strengthened by their courage, heartened by their value [valor], and borne by their memory, let us continue to stand for the ideals for which they lived and died. Thank you very much, and God bless you all.", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-27 12:44:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: BTDT XXXhttp://www.youtube.com/watch?v=rBeyZAmmJNgXXX We're here to mark that day in history when the Allied armies joined in battle to reclaim this continent to liberty. For four long years, much of Europe had been under a terrible shadow. Free nations had fallen, Jews cried out in the camps, millions cried out for liberation. Europe was enslaved, and the world prayed for its rescue. Here in Normandy the rescue began. Here the Allies stood and fought against tyranny in a giant undertaking unparalleled in human history. We stand on a lonely, windswept point on the northern shore of France. The air is soft, but 40 years ago at this moment, the air was dense with smoke and the cries of men, and the air was filled with the crack of rifle fire and the roar of cannon. At dawn, on the morning of the 6th of June, 1944, 225 Rangers jumped off the British landing craft and ran to the bottom of these cliffs. Their mission was one of the most difficult and daring of the invasion: to climb these sheer and desolate cliffs and take out the enemy guns. The Allies had been told that some of the mightiest of these guns were here and they would be trained on the beaches to stop the Allied advance. The Rangers looked up and saw the enemy soldiers--the edge of the cliffs shooting down at them with machine guns and throwing grenades. And the American Rangers began to climb. They shot rope ladders over the face of these cliffs and began to pull themselves up. When one Ranger fell, another would take his place. When one rope was cut, a Ranger would grab another and begin his climb again. They climbed, shot back, and held their footing. Soon, one by one, the Rangers pulled themselves over the top, and in seizing the firm land at the top of these cliffs, they began to seize back the continent of Europe. Two hundred and twenty-five came here. After two days of fighting, only 90 could still bear arms. Behind me is a memorial that symbolizes the Ranger daggers that were thrust into the top of these cliffs. And before me are the men who put them there. These are the boys of Pointe du Hoc. These are the men who took the cliffs. These are the champions who helped free a continent. These are the heroes who helped end a war. Gentlemen, I look at you and I think of the words of Stephen Spender's poem. You are men who in your \"lives fought for life . . . and left the vivid air signed with your honor.'' I think I know what you may be thinking right now--thinking, \"We were just part of a bigger effort; everyone was brave that day.'' Well, everyone was. Do you remember the story of Bill Millin of the 51st Highlanders? Forty years ago today, British troops were pinned down near a bridge, waiting desperately for help. Suddenly, they heard the sound of bagpipes, and some thought they were dreaming. Well, they weren't. They looked up and saw Bill Millin with his bagpipes, leading the reinforcements and ignoring the smack of the bullets into the ground around him. Lord Lovat was with him--Lord Lovat of Scotland, who calmly announced when he got to the bridge, \"Sorry I'm a few minutes late,'' as if he'd been delayed by a traffic jam, when in truth he'd just come from the bloody fighting on Sword Beach, which he and his men had just taken. There was the impossible valor of the Poles who threw themselves between the enemy and the rest of Europe as the invasion took hold, and the unsurpassed courage of the Canadians who had already seen the horrors of war on this coast. They knew what awaited them there, but they would not be deterred. And once they hit Juno Beach, they never looked back. All of these men were part of a rollcall of honor with names that spoke of a pride as bright as the colors they bore: the Royal Winnipeg Rifles, Poland's 24th Lancers, the Royal Scots Fusiliers, the Screaming Eagles, the Yeomen of England's armored divisions, the forces of Free France, the Coast Guard's \"Matchbox Fleet'' and you, the American Rangers. Forty summers have passed since the battle that you fought here. You were young the day you took these cliffs; some of you were hardly more than boys, with the deepest joys of life before you. Yet, you risked everything here. Why? Why did you do it? What impelled you to put aside the instinct for self-preservation and risk your lives to take these cliffs? What inspired all the men of the armies that met here? We look at you, and somehow we know the answer. It was faith and belief; it was loyalty and love. The men of Normandy had faith that what they were doing was right, faith that they fought for all humanity, faith that a just God would grant them mercy on this beachhead or on the next. It was the deep knowledge--and pray God we have not lost it--that there is a profound, moral difference between the use of force for liberation and the use of force for conquest. You were here to liberate, not to conquer, and so you and those others did not doubt your cause. And you were right not to doubt. You all knew that some things are worth dying for. One's country is worth dying for, and democracy is worth dying for, because it's the most deeply honorable form of government ever devised by man. All of you loved liberty. All of you were willing to fight tyranny, and you knew the people of your countries were behind you. The Americans who fought here that morning knew word of the invasion was spreading through the darkness back home. They thought--or felt in their hearts, though they couldn't know in fact, that in Georgia they were filling the churches at 4 a.m., in Kansas they were kneeling on their porches and praying, and in Philadelphia they were ringing the Liberty Bell. Something else helped the men of D-Day: their rock-hard belief that Providence would have a great hand in the events that would unfold here; that God was an ally in this great cause. And so, the night before the invasion, when Colonel Wolverton asked his parachute troops to kneel with him in prayer he told them: Do not bow your heads, but look up so you can see God and ask His blessing in what we're about to do. Also that night, General Matthew Ridgway on his cot, listening in the darkness for the promise God made to Joshua: \"I will not fail thee nor forsake thee.'' These are the things that impelled them; these are the things that shaped the unity of the Allies. When the war was over, there were lives to be rebuilt and governments to be returned to the people. There were nations to be reborn. Above all, there was a new peace to be assured. These were huge and daunting tasks. But the Allies summoned strength from the faith, belief, loyalty, and love of those who fell here. They rebuilt a new Europe together. There was first a great reconciliation among those who had been enemies, all of whom had suffered so greatly. The United States did its part, creating the Marshall Plan to help rebuild our allies and our former enemies. The Marshall Plan led to the Atlantic alliance--a great alliance that serves to this day as our shield for freedom, for prosperity, and for peace. In spite of our great efforts and successes, not all that followed the end of the war was happy or planned. Some liberated countries were lost. The great sadness of this loss echoes down to our own time in the streets of Warsaw, Prague, and East Berlin. Soviet troops that came to the center of this continent did not leave when peace came. They're still there, uninvited, unwanted, unyielding, almost 40 years after the war. Because of this, Allied forces still stand on this continent. Today, as 40 years ago, our armies are here for only one purpose--to protect and defend democracy. The only territories we hold are memorials like this one and graveyards where our heroes rest. We in America have learned bitter lessons from two World Wars: It is better to be here ready to protect the peace than to take blind shelter across the sea, rushing to respond only after freedom is lost. We've learned that isolationism never was and never will be an acceptable response to tyrannical governments with an expansionist intent. But we try always to be prepared for peace; prepared to deter aggression; prepared to negotiate the reduction of arms; and, yes, prepared to reach out again in the spirit of reconciliation. In truth, there is no reconciliation we would welcome more than a reconciliation with the Soviet Union, so, together, we can lessen the risks of war, now and forever. It's fitting to remember here the great losses also suffered by the Russian people during World War II: 20 million perished, a terrible price that testifies to all the world the necessity of ending war. I tell you from my heart that we in the United States do not want war. We want to wipe from the face of the Earth the terrible weapons that man now has in his hands. And I tell you, we are ready to seize that beachhead. We look for some sign from the Soviet Union that they are willing to move forward, that they share our desire and love for peace, and that they will give up the ways of conquest. There must be a changing there that will allow us to turn our hope into action. We will pray forever that some day that changing will come. But for now, particularly today, it is good and fitting to renew our commitment to each other, to our freedom, and to the alliance that protects it. We are bound today by what bound us 40 years ago, the same loyalties, traditions, and beliefs. We're bound by reality. The strength of America's allies is vital to the United States, and the American security guarantee is essential to the continued freedom of Europe's democracies. We were with you then; we are with you now. Your hopes are our hopes, and your destiny is our destiny. Here, in this place where the West held together, let us make a vow to our dead. Let us show them by our actions that we understand what they died for. Let our actions say to them the words for which Matthew Ridgway listened: \"I will not fail thee nor forsake thee.'' Strengthened by their courage, heartened by their value [valor], and borne by their memory, let us continue to stand for the ideals for which they lived and died. Thank you very much, and God bless you all. Ya President Reagan did more for peace on this planet than any other man! Mr. Gorbachev tear down this wall", 
        "intTime": 20090327, 
        "postID": 3, 
        "quote": "Originally posted by LineDoggie: BTDT XXXhttp://www.youtube.com/watch?v=rBeyZAmmJNgXXX We're here to mark that day in history when the Allied armies joined in battle to reclaim this continent to liberty. For four long years, much of Europe had been under a terrible shadow. Free nations had fallen, Jews cried out in the camps, millions cried out for liberation. Europe was enslaved, and the world prayed for its rescue. Here in Normandy the rescue began. Here the Allies stood and fought against tyranny in a giant undertaking unparalleled in human history. We stand on a lonely, windswept point on the northern shore of France. The air is soft, but 40 years ago at this moment, the air was dense with smoke and the cries of men, and the air was filled with the crack of rifle fire and the roar of cannon. At dawn, on the morning of the 6th of June, 1944, 225 Rangers jumped off the British landing craft and ran to the bottom of these cliffs. Their mission was one of the most difficult and daring of the invasion: to climb these sheer and desolate cliffs and take out the enemy guns. The Allies had been told that some of the mightiest of these guns were here and they would be trained on the beaches to stop the Allied advance. The Rangers looked up and saw the enemy soldiers--the edge of the cliffs shooting down at them with machine guns and throwing grenades. And the American Rangers began to climb. They shot rope ladders over the face of these cliffs and began to pull themselves up. When one Ranger fell, another would take his place. When one rope was cut, a Ranger would grab another and begin his climb again. They climbed, shot back, and held their footing. Soon, one by one, the Rangers pulled themselves over the top, and in seizing the firm land at the top of these cliffs, they began to seize back the continent of Europe. Two hundred and twenty-five came here. After two days of fighting, only 90 could still bear arms. Behind me is a memorial that symbolizes the Ranger daggers that were thrust into the top of these cliffs. And before me are the men who put them there. These are the boys of Pointe du Hoc. These are the men who took the cliffs. These are the champions who helped free a continent. These are the heroes who helped end a war. Gentlemen, I look at you and I think of the words of Stephen Spender's poem. You are men who in your \"lives fought for life . . . and left the vivid air signed with your honor.'' I think I know what you may be thinking right now--thinking, \"We were just part of a bigger effort; everyone was brave that day.'' Well, everyone was. Do you remember the story of Bill Millin of the 51st Highlanders? Forty years ago today, British troops were pinned down near a bridge, waiting desperately for help. Suddenly, they heard the sound of bagpipes, and some thought they were dreaming. Well, they weren't. They looked up and saw Bill Millin with his bagpipes, leading the reinforcements and ignoring the smack of the bullets into the ground around him. Lord Lovat was with him--Lord Lovat of Scotland, who calmly announced when he got to the bridge, \"Sorry I'm a few minutes late,'' as if he'd been delayed by a traffic jam, when in truth he'd just come from the bloody fighting on Sword Beach, which he and his men had just taken. There was the impossible valor of the Poles who threw themselves between the enemy and the rest of Europe as the invasion took hold, and the unsurpassed courage of the Canadians who had already seen the horrors of war on this coast. They knew what awaited them there, but they would not be deterred. And once they hit Juno Beach, they never looked back. All of these men were part of a rollcall of honor with names that spoke of a pride as bright as the colors they bore: the Royal Winnipeg Rifles, Poland's 24th Lancers, the Royal Scots Fusiliers, the Screaming Eagles, the Yeomen of England's armored divisions, the forces of Free France, the Coast Guard's \"Matchbox Fleet'' and you, the American Rangers. Forty summers have passed since the battle that you fought here. You were young the day you took these cliffs; some of you were hardly more than boys, with the deepest joys of life before you. Yet, you risked everything here. Why? Why did you do it? What impelled you to put aside the instinct for self-preservation and risk your lives to take these cliffs? What inspired all the men of the armies that met here? We look at you, and somehow we know the answer. It was faith and belief; it was loyalty and love. The men of Normandy had faith that what they were doing was right, faith that they fought for all humanity, faith that a just God would grant them mercy on this beachhead or on the next. It was the deep knowledge--and pray God we have not lost it--that there is a profound, moral difference between the use of force for liberation and the use of force for conquest. You were here to liberate, not to conquer, and so you and those others did not doubt your cause. And you were right not to doubt. You all knew that some things are worth dying for. One's country is worth dying for, and democracy is worth dying for, because it's the most deeply honorable form of government ever devised by man. All of you loved liberty. All of you were willing to fight tyranny, and you knew the people of your countries were behind you. The Americans who fought here that morning knew word of the invasion was spreading through the darkness back home. They thought--or felt in their hearts, though they couldn't know in fact, that in Georgia they were filling the churches at 4 a.m., in Kansas they were kneeling on their porches and praying, and in Philadelphia they were ringing the Liberty Bell. Something else helped the men of D-Day: their rock-hard belief that Providence would have a great hand in the events that would unfold here; that God was an ally in this great cause. And so, the night before the invasion, when Colonel Wolverton asked his parachute troops to kneel with him in prayer he told them: Do not bow your heads, but look up so you can see God and ask His blessing in what we're about to do. Also that night, General Matthew Ridgway on his cot, listening in the darkness for the promise God made to Joshua: \"I will not fail thee nor forsake thee.'' These are the things that impelled them; these are the things that shaped the unity of the Allies. When the war was over, there were lives to be rebuilt and governments to be returned to the people. There were nations to be reborn. Above all, there was a new peace to be assured. These were huge and daunting tasks. But the Allies summoned strength from the faith, belief, loyalty, and love of those who fell here. They rebuilt a new Europe together. There was first a great reconciliation among those who had been enemies, all of whom had suffered so greatly. The United States did its part, creating the Marshall Plan to help rebuild our allies and our former enemies. The Marshall Plan led to the Atlantic alliance--a great alliance that serves to this day as our shield for freedom, for prosperity, and for peace. In spite of our great efforts and successes, not all that followed the end of the war was happy or planned. Some liberated countries were lost. The great sadness of this loss echoes down to our own time in the streets of Warsaw, Prague, and East Berlin. Soviet troops that came to the center of this continent did not leave when peace came. They're still there, uninvited, unwanted, unyielding, almost 40 years after the war. Because of this, Allied forces still stand on this continent. Today, as 40 years ago, our armies are here for only one purpose--to protect and defend democracy. The only territories we hold are memorials like this one and graveyards where our heroes rest. We in America have learned bitter lessons from two World Wars: It is better to be here ready to protect the peace than to take blind shelter across the sea, rushing to respond only after freedom is lost. We've learned that isolationism never was and never will be an acceptable response to tyrannical governments with an expansionist intent. But we try always to be prepared for peace; prepared to deter aggression; prepared to negotiate the reduction of arms; and, yes, prepared to reach out again in the spirit of reconciliation. In truth, there is no reconciliation we would welcome more than a reconciliation with the Soviet Union, so, together, we can lessen the risks of war, now and forever. It's fitting to remember here the great losses also suffered by the Russian people during World War II: 20 million perished, a terrible price that testifies to all the world the necessity of ending war. I tell you from my heart that we in the United States do not want war. We want to wipe from the face of the Earth the terrible weapons that man now has in his hands. And I tell you, we are ready to seize that beachhead. We look for some sign from the Soviet Union that they are willing to move forward, that they share our desire and love for peace, and that they will give up the ways of conquest. There must be a changing there that will allow us to turn our hope into action. We will pray forever that some day that changing will come. But for now, particularly today, it is good and fitting to renew our commitment to each other, to our freedom, and to the alliance that protects it. We are bound today by what bound us 40 years ago, the same loyalties, traditions, and beliefs. We're bound by reality. The strength of America's allies is vital to the United States, and the American security guarantee is essential to the continued freedom of Europe's democracies. We were with you then; we are with you now. Your hopes are our hopes, and your destiny is our destiny. Here, in this place where the West held together, let us make a vow to our dead. Let us show them by our actions that we understand what they died for. Let our actions say to them the words for which Matthew Ridgway listened: \"I will not fail thee nor forsake thee.'' Strengthened by their courage, heartened by their value [valor], and borne by their memory, let us continue to stand for the ideals for which they lived and died. Thank you very much, and God bless you all.", 
        "reply": " Ya President Reagan did more for peace on this planet than any other man! Mr. Gorbachev tear down this wall", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-27 17:21:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "EAG154"
    }, 
    {
        "content": "For example, he did...? Gorbachev didn't tear it down. The German people did, on their own accord.", 
        "intTime": 20090327, 
        "postID": 4, 
        "quote": "", 
        "reply": "For example, he did...? Gorbachev didn't tear it down. The German people did, on their own accord.", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-27 17:57:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: For example, he did...? Gorbachev didn't tear it down. The German people did, on their own accord. let's see ha, ya, but, President Reagan said Mr. Gorbachev tear down this wall, yupers!", 
        "intTime": 20090327, 
        "postID": 5, 
        "quote": "Originally posted by mcgreer: For example, he did...? Gorbachev didn't tear it down. The German people did, on their own accord.", 
        "reply": " let's see ha, ya, but, President Reagan said Mr. Gorbachev tear down this wall, yupers!", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-27 19:25:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "EAG154"
    }, 
    {
        "content": "Yeah, Reagan said that but if it hadn't have been for Carter, Gorbachev would have laughed in his face. And do you know why? Afghanistan. It was Carter who lured the USSR into A-stan tus giving them their own Vietnam. It wasn't \"Star Wars\" that scared the USSR; then Reagan said \"Mr. G. tear down this wall.\", the USSR was almost bankrupt because of A-stan. Their military was in shreds and their country starving - they had no choice but to \"tear down that wall\" because they could no longer maintain it.", 
        "intTime": 20090327, 
        "postID": 6, 
        "quote": "", 
        "reply": "Yeah, Reagan said that but if it hadn't have been for Carter, Gorbachev would have laughed in his face. And do you know why? Afghanistan. It was Carter who lured the USSR into A-stan tus giving them their own Vietnam. It wasn't \"Star Wars\" that scared the USSR; then Reagan said \"Mr. G. tear down this wall.\", the USSR was almost bankrupt because of A-stan. Their military was in shreds and their country starving - they had no choice but to \"tear down that wall\" because they could no longer maintain it.", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-27 19:37:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "entmjzi"
    }, 
    {
        "content": "What broke the Soviets was Reagans build up of our military, the Soviets tried to match us and went bankrupt, had nothing to do with Carter!", 
        "intTime": 20090327, 
        "postID": 7, 
        "quote": "", 
        "reply": "What broke the Soviets was Reagans build up of our military, the Soviets tried to match us and went bankrupt, had nothing to do with Carter!", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-27 20:33:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "EAG154"
    }, 
    {
        "content": "One of the big blows for them was Afghanistan. Gorbachev, the reformer, also came along during that period. He and his foreign minister Shevardnadze developed policies that granted the Warsaw Pact countries more self-determination. It was informally referred to as the \"Sinatra Doctrine\", as those countries could conduct their internal affairs \"their way.\" When grassroots movements toward democratization started to develop in those countries, the Soviets would not intervene and left local Communist leaders to their own devices. The Soviets had been hurting for quite some time. Their system was so grossly inefficient and their economic policies could no longer sustain the Soviet Union. Add the openness that was fostered by the principles of glasnost and perestroika, and largely peaceful revolutions breaking out among the satellites (there was violence in Uzbekistan and Azerbajian), and pop! went the Soviet Union. Reagan had nothing to do with any of this.", 
        "intTime": 20090327, 
        "postID": 8, 
        "quote": "", 
        "reply": "One of the big blows for them was Afghanistan. Gorbachev, the reformer, also came along during that period. He and his foreign minister Shevardnadze developed policies that granted the Warsaw Pact countries more self-determination. It was informally referred to as the \"Sinatra Doctrine\", as those countries could conduct their internal affairs \"their way.\" When grassroots movements toward democratization started to develop in those countries, the Soviets would not intervene and left local Communist leaders to their own devices. The Soviets had been hurting for quite some time. Their system was so grossly inefficient and their economic policies could no longer sustain the Soviet Union. Add the openness that was fostered by the principles of glasnost and perestroika, and largely peaceful revolutions breaking out among the satellites (there was violence in Uzbekistan and Azerbajian), and pop! went the Soviet Union. Reagan had nothing to do with any of this.", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-27 22:23:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by entmjzi: Yeah, Reagan said that but if it hadn't have been for Carter, Gorbachev would have laughed in his face. And do you know why? Afghanistan. It was Carter who lured the USSR into A-stan tus giving them their own Vietnam. It wasn't \"Star Wars\" that scared the USSR; then Reagan said \"Mr. G. tear down this wall.\", the USSR was almost bankrupt because of A-stan. Their military was in shreds and their country starving - they had no choice but to \"tear down that wall\" because they could no longer maintain it. Whatever the reasons Maa'm, I assure you it wasn't because of Jimmy Carter.", 
        "intTime": 20090327, 
        "postID": 9, 
        "quote": "Originally posted by entmjzi: Yeah, Reagan said that but if it hadn't have been for Carter, Gorbachev would have laughed in his face. And do you know why? Afghanistan. It was Carter who lured the USSR into A-stan tus giving them their own Vietnam. It wasn't \"Star Wars\" that scared the USSR; then Reagan said \"Mr. G. tear down this wall.\", the USSR was almost bankrupt because of A-stan. Their military was in shreds and their country starving - they had no choice but to \"tear down that wall\" because they could no longer maintain it.", 
        "reply": " Whatever the reasons Maa'm, I assure you it wasn't because of Jimmy Carter.", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-27 22:31:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "JustanotherGI"
    }, 
    {
        "content": "quote: Originally posted by JustanotherGI: quote: Originally posted by entmjzi: Yeah, Reagan said that but if it hadn't have been for Carter, Gorbachev would have laughed in his face. And do you know why? Afghanistan. It was Carter who lured the USSR into A-stan tus giving them their own Vietnam. It wasn't \"Star Wars\" that scared the USSR; then Reagan said \"Mr. G. tear down this wall.\", the USSR was almost bankrupt because of A-stan. Their military was in shreds and their country starving - they had no choice but to \"tear down that wall\" because they could no longer maintain it. Whatever the reasons Maa'm, I assure you it wasn't because of Jimmy Carter. From a 1998 interview with Brzezinski, Carter's national security advisor: Question: The former director of the CIA, Robert Gates, stated in his memoirs [\"From the Shadows\"], that American intelligence services began to aid the Mujahadeen in Afghanistan 6 months before the Soviet intervention. In this period you were the national security adviser to President Carter. You therefore played a role in this affair. Is that correct? Brzezinski: Yes. According to the official version of history, CIA aid to the Mujahadeen began during 1980, that is to say, after the Soviet army invaded Afghanistan, 24 Dec 1979. But the reality, secretly guarded until now, is completely otherwise: Indeed, it was July 3, 1979 that President Carter signed the first directive for secret aid to the opponents of the pro-Soviet regime in Kabul. And that very day, I wrote a note to the president in which I explained to him that in my opinion this aid was going to induce a Soviet military intervention. Q: Despite this risk, you were an advocate of this covert action. But perhaps you yourself desired this Soviet entry into war and looked to provoke it? B: It isn't quite that. We didn't push the Russians to intervene, but we knowingly increased the probability that they would. Q: When the Soviets justified their intervention by asserting that they intended to fight against a secret involvement of the United States in Afghanistan, people didn't believe them. However, there was a basis of truth. You don't regret anything today? B: Regret what? That secret operation was an excellent idea. It had the effect of drawing the Russians into the Afghan trap and you want me to regret it? The day that the Soviets officially crossed the border, I wrote to President Carter: We now have the opportunity of giving to the USSR its Vietnam war. Indeed, for almost 10 years, Moscow had to carry on a war unsupportable by the government, a conflict that brought about the demoralization and finally the breakup of the Soviet empire... A timeline: \"http://www.historycommons.org/context.jsp?item=a122679memotocarter\"", 
        "intTime": 20090327, 
        "postID": 10, 
        "quote": "Originally posted by JustanotherGI: quote: Originally posted by entmjzi: Yeah, Reagan said that but if it hadn't have been for Carter, Gorbachev would have laughed in his face. And do you know why? Afghanistan. It was Carter who lured the USSR into A-stan tus giving them their own Vietnam. It wasn't \"Star Wars\" that scared the USSR; then Reagan said \"Mr. G. tear down this wall.\", the USSR was almost bankrupt because of A-stan. Their military was in shreds and their country starving - they had no choice but to \"tear down that wall\" because they could no longer maintain it. Whatever the reasons Maa'm, I assure you it wasn't because of Jimmy Carter.", 
        "reply": " From a 1998 interview with Brzezinski, Carter's national security advisor: Question: The former director of the CIA, Robert Gates, stated in his memoirs [\"From the Shadows\"], that American intelligence services began to aid the Mujahadeen in Afghanistan 6 months before the Soviet intervention. In this period you were the national security adviser to President Carter. You therefore played a role in this affair. Is that correct? Brzezinski: Yes. According to the official version of history, CIA aid to the Mujahadeen began during 1980, that is to say, after the Soviet army invaded Afghanistan, 24 Dec 1979. But the reality, secretly guarded until now, is completely otherwise: Indeed, it was July 3, 1979 that President Carter signed the first directive for secret aid to the opponents of the pro-Soviet regime in Kabul. And that very day, I wrote a note to the president in which I explained to him that in my opinion this aid was going to induce a Soviet military intervention. Q: Despite this risk, you were an advocate of this covert action. But perhaps you yourself desired this Soviet entry into war and looked to provoke it? B: It isn't quite that. We didn't push the Russians to intervene, but we knowingly increased the probability that they would. Q: When the Soviets justified their intervention by asserting that they intended to fight against a secret involvement of the United States in Afghanistan, people didn't believe them. However, there was a basis of truth. You don't regret anything today? B: Regret what? That secret operation was an excellent idea. It had the effect of drawing the Russians into the Afghan trap and you want me to regret it? The day that the Soviets officially crossed the border, I wrote to President Carter: We now have the opportunity of giving to the USSR its Vietnam war. Indeed, for almost 10 years, Moscow had to carry on a war unsupportable by the government, a conflict that brought about the demoralization and finally the breakup of the Soviet empire... A timeline: \"http://www.historycommons.org/context.jsp?item=a122679memotocarter\"", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-27 23:21:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "mcgreer"
    }, 
    {
        "content": "McGreer, that is some good stuff there but it is preliminary. Although it had an impact on the Soviet Unions demise there can be no doubt that Reagan is the man responsible for the ultimate collapse of the Soviet Union. Now the Soviets are trying to return the favor, with luck and a handful of politicians the Soviets will fail once agian, I pray. IMHO", 
        "intTime": 20090328, 
        "postID": 11, 
        "quote": "", 
        "reply": "McGreer, that is some good stuff there but it is preliminary. Although it had an impact on the Soviet Unions demise there can be no doubt that Reagan is the man responsible for the ultimate collapse of the Soviet Union. Now the Soviets are trying to return the favor, with luck and a handful of politicians the Soviets will fail once agian, I pray. IMHO", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-28 00:27:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Cant see any relevance to the topic, but Regan’s visit was 20 years ago?", 
        "intTime": 20090328, 
        "postID": 12, 
        "quote": "", 
        "reply": "Cant see any relevance to the topic, but Regan’s visit was 20 years ago?", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-28 05:20:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "Knele"
    }, 
    {
        "content": "Obama can visit all the war memorials and veteran cemetary's for media spotlight, what I wait to see is sponsorship for military benefits, a way to thank them for their service. But so far he had attempted to have them pay for their service connectted health care quote: Veterans Affairs Secretary Eric Shinseki confirmed Tuesday that the Obama administration is considering a controversial plan to make veterans pay for treatment of service-related injuries with private insurance. . . . due to pressure from veterans groups and some senators he scrapped the plan. I suspect we will have a long wait for his military support", 
        "intTime": 20090328, 
        "postID": 13, 
        "quote": "Veterans Affairs Secretary Eric Shinseki confirmed Tuesday that the Obama administration is considering a controversial plan to make veterans pay for treatment of service-related injuries with private insurance. . . .", 
        "reply": "Obama can visit all the war memorials and veteran cemetary's for media spotlight, what I wait to see is sponsorship for military benefits, a way to thank them for their service. But so far he had attempted to have them pay for their service connectted health care  due to pressure from veterans groups and some senators he scrapped the plan. I suspect we will have a long wait for his military support", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-28 05:38:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by ss_287: And if he didn’t visit, and paid his respects you’d give him **** about that too!", 
        "intTime": 20090328, 
        "postID": 14, 
        "quote": "Originally posted by ss_287:", 
        "reply": " And if he didn’t visit, and paid his respects you’d give him **** about that too!", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-28 06:17:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: McGreer, that is some good stuff there but it is preliminary. Although it had an impact on the Soviet Unions demise there can be no doubt that Reagan is the man responsible for the ultimate collapse of the Soviet Union. Now the Soviets are trying to return the favor, with luck and a handful of politicians the Soviets will fail once agian, I pray. IMHO OK - if there's \"no doubt\", where's your empirical evidence? I can say that there's \"no doubt\" that pigs fly. Without proof, I have no credibility. I provided facts - how about you?", 
        "intTime": 20090328, 
        "postID": 15, 
        "quote": "Originally posted by BAGodbehere: McGreer, that is some good stuff there but it is preliminary. Although it had an impact on the Soviet Unions demise there can be no doubt that Reagan is the man responsible for the ultimate collapse of the Soviet Union. Now the Soviets are trying to return the favor, with luck and a handful of politicians the Soviets will fail once agian, I pray. IMHO", 
        "reply": " OK - if there's \"no doubt\", where's your empirical evidence? I can say that there's \"no doubt\" that pigs fly. Without proof, I have no credibility. I provided facts - how about you?", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-28 06:36:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "mcgreer"
    }, 
    {
        "content": "McGreer, I never said what you wrote is wrong. \"Empirical evidence\"? nice, I like that one, think I'll start using it. All one has to do is type into their search engine \"Reagan Soviet Collapse\" and thousands of articles will come up on Reagans involvement, pro and con. Sorry but I'm not gonna go thru them just to put up catchy phrases. Why do you always ask for such things? Your a smart guy, C'mon. We all know pretty much what happened (okay, not all) figure of speech. I do think Carters Administration had a hand in getting the Soviets to engage in war against Afganistan. Truman with his containment policies, Carters luring the Soviets into Afganistan, Reagan with peace thru strength. A good reason I think for the collapse of the Soviet Union is from the Soviets themselves, their lack of freedom. In my opinion there is nothing stronger then the mind of free men. The Soviets with their lack there of were doomed. Communism is great until you run out of other peoples money and without the freedom to create wealth, other peoples money eventually runs out.", 
        "intTime": 20090328, 
        "postID": 16, 
        "quote": "", 
        "reply": "McGreer, I never said what you wrote is wrong. \"Empirical evidence\"? nice, I like that one, think I'll start using it. All one has to do is type into their search engine \"Reagan Soviet Collapse\" and thousands of articles will come up on Reagans involvement, pro and con. Sorry but I'm not gonna go thru them just to put up catchy phrases. Why do you always ask for such things? Your a smart guy, C'mon. We all know pretty much what happened (okay, not all) figure of speech. I do think Carters Administration had a hand in getting the Soviets to engage in war against Afganistan. Truman with his containment policies, Carters luring the Soviets into Afganistan, Reagan with peace thru strength. A good reason I think for the collapse of the Soviet Union is from the Soviets themselves, their lack of freedom. In my opinion there is nothing stronger then the mind of free men. The Soviets with their lack there of were doomed. Communism is great until you run out of other peoples money and without the freedom to create wealth, other peoples money eventually runs out.", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-28 08:00:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Good for Obama. I would like to think every US President would visit there sometime while in office. Don", 
        "intTime": 20090328, 
        "postID": 17, 
        "quote": "", 
        "reply": "Good for Obama. I would like to think every US President would visit there sometime while in office. Don", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-28 09:15:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Obama can visit all the war memorials and veteran cemetary's for media spotlight, what I wait to see is sponsorship for military benefits, a way to thank them for their service. But so far he had attempted to have them pay for their service connectted health care quote: Originally posted by Knele: quote: Originally posted by ss_287: And if he didn’t visit, and paid his respects you’d give him **** about that too! until he makes a valid commitment to support this nations military and especially our wounded vetreans I will, If he had he would have stoped at the military while campaigning in Germany quote: July 25 (Bloomberg) -- Democratic presidential candidate Barack Obama canceled a visit to wounded American soldiers at a U.S. military base in southwest Germany Actions speak louder than words", 
        "intTime": 20090329, 
        "postID": 18, 
        "quote": "Obama can visit all the war memorials and veteran cemetary's for media spotlight, what I wait to see is sponsorship for military benefits, a way to thank them for their service. But so far he had attempted to have them pay for their service connectted health care", 
        "reply": " quote: Originally posted by Knele: quote: Originally posted by ss_287: And if he didn’t visit, and paid his respects you’d give him **** about that too! until he makes a valid commitment to support this nations military and especially our wounded vetreans I will, If he had he would have stoped at the military while campaigning in Germany quote: July 25 (Bloomberg) -- Democratic presidential candidate Barack Obama canceled a visit to wounded American soldiers at a U.S. military base in southwest Germany Actions speak louder than words", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-29 06:33:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by ss_287: quote: Obama can visit all the war memorials and veteran cemetary's for media spotlight, what I wait to see is sponsorship for military benefits, a way to thank them for their service. But so far he had attempted to have them pay for their service connectted health care quote: Originally posted by Knele: quote: Originally posted by ss_287: And if he didn’t visit, and paid his respects you’d give him **** about that too! until he makes a valid commitment to support this nations military and especially our wounded vetreans I will, If he had he would have stoped at the military while campaigning in Germany quote: July 25 (Bloomberg) -- Democratic presidential candidate Barack Obama canceled a visit to wounded American soldiers at a U.S. military base in southwest Germany Actions speak louder than words Thank you for proving my point! You’re just looking for an excuse to bash the President! This was a year ago (and would have been inappropriate even if he did go) and has since, along with the first lady, showed ample respect for our troops! As far as I am concerned, so far he has done more for the troops in 60 days that Bush did in 8 years…..for starters he didn’t get over 4000 killed and 45,000+ of our troops wounded because “God told him so”!", 
        "intTime": 20090329, 
        "postID": 19, 
        "quote": "Originally posted by ss_287: quote: Obama can visit all the war memorials and veteran cemetary's for media spotlight, what I wait to see is sponsorship for military benefits, a way to thank them for their service. But so far he had attempted to have them pay for their service connectted health care quote: Originally posted by Knele: quote: Originally posted by ss_287: And if he didn’t visit, and paid his respects you’d give him **** about that too! until he makes a valid commitment to support this nations military and especially our wounded vetreans I will, If he had he would have stoped at the military while campaigning in Germany quote: July 25 (Bloomberg) -- Democratic presidential candidate Barack Obama canceled a visit to wounded American soldiers at a U.S. military base in southwest Germany Actions speak louder than words", 
        "reply": " Thank you for proving my point! You’re just looking for an excuse to bash the President! This was a year ago (and would have been inappropriate even if he did go) and has since, along with the first lady, showed ample respect for our troops! As far as I am concerned, so far he has done more for the troops in 60 days that Bush did in 8 years…..for starters he didn’t get over 4000 killed and 45,000+ of our troops wounded because “God told him so”!", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-29 08:10:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: BTDT So F'ing what? Regan went to France, does that mean that no other President should ever go there? There is nothing Obama can do right to you or most of the people who post on Mil.com. No big surprise there. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "intTime": 20090329, 
        "postID": 20, 
        "quote": "Originally posted by LineDoggie: BTDT", 
        "reply": " So F'ing what? Regan went to France, does that mean that no other President should ever go there? There is nothing Obama can do right to you or most of the people who post on Mil.com. No big surprise there. \"The price of freedom is eternal vigilance.\" Thomas Jefferson", 
        "threadID": "672198221_4630070912001", 
        "time": "2009-03-29 22:28:00", 
        "title": "Obama Planning Normandy Visit", 
        "userID": "jrnh5150"
    }
]