[
    {
        "content": "RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger.",
        "intTime": 20090425,
        "postID": 1,
        "quote": "",
        "reply": "RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger.",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-25 06:18:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "Bill_Fold"
    },
    {
        "content": "quote: Originally posted by Bill_Fold: RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger. You are probably correct. However, I recall a portion of the Kings Bay subs transfered to the west coast to keep an eye on them anyway!",
        "intTime": 20090425,
        "postID": 2,
        "quote": "Originally posted by Bill_Fold: RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger.",
        "reply": " You are probably correct. However, I recall a portion of the Kings Bay subs transfered to the west coast to keep an eye on them anyway!",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-25 06:21:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "busnrete8"
    },
    {
        "content": "We need aircraft carriers to effectively field a high performance jet in that region. China does not. We have our fleet spread out all over the world. China does not. We have to transit choke points. China has to close them. We are far from the battlespace. China is close. The real crux of all of this is that we are vulnerable (as pertains to this conversation), and China is not. They do not want a world-spanning super-navy to challenge ours; rather, they want a world class regional navy that can stop ours from achieving our objectives in a small defined area. They are doing a damned good job of that - in fact, my guess is that the only thing preventing them from temporary parity/superiority is their training and doctrine. Refusal to see China as an emerging naval power that can threaten our regional superiority is wishful thinking.",
        "intTime": 20090425,
        "postID": 3,
        "quote": "",
        "reply": "We need aircraft carriers to effectively field a high performance jet in that region. China does not. We have our fleet spread out all over the world. China does not. We have to transit choke points. China has to close them. We are far from the battlespace. China is close. The real crux of all of this is that we are vulnerable (as pertains to this conversation), and China is not. They do not want a world-spanning super-navy to challenge ours; rather, they want a world class regional navy that can stop ours from achieving our objectives in a small defined area. They are doing a damned good job of that - in fact, my guess is that the only thing preventing them from temporary parity/superiority is their training and doctrine. Refusal to see China as an emerging naval power that can threaten our regional superiority is wishful thinking.",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-25 06:36:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "Bleah"
    },
    {
        "content": "quote: Originally posted by Bill_Fold: RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger. Not a paper tiger, a kitten. It would be foolish to assume that China will never be a threat. Their modernization and buildup is moving forward at a breakneck pace and good ol Norman says it will be a decade or more before...totally missing the point I think. Unlike the US, China has no desire to project military power accross the world, they simply want to control their periphery as the Russians do. In South America, they already have a large foothold economically while the US largely ignored it. While the USN could deny oil imports from South America and the Carribean, The areas under development in the South China sea as well as a new pipeline from Russia provide alternatives that can prevent such a denial from crushing them economically in any conflict. Within that same decade, China will be able to completely deny outsiders from their sphere of influence and will be able to take back Taiwan without worry of US interference. The USN may be large but will the USN's entire fleet be dispatched to China? Im just saying, dont be so stupid as to think China is not a threat. Maybe not yet but soon while Obama dismantles the US military",
        "intTime": 20090425,
        "postID": 4,
        "quote": "Originally posted by Bill_Fold: RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger.",
        "reply": " Not a paper tiger, a kitten. It would be foolish to assume that China will never be a threat. Their modernization and buildup is moving forward at a breakneck pace and good ol Norman says it will be a decade or more before...totally missing the point I think. Unlike the US, China has no desire to project military power accross the world, they simply want to control their periphery as the Russians do. In South America, they already have a large foothold economically while the US largely ignored it. While the USN could deny oil imports from South America and the Carribean, The areas under development in the South China sea as well as a new pipeline from Russia provide alternatives that can prevent such a denial from crushing them economically in any conflict. Within that same decade, China will be able to completely deny outsiders from their sphere of influence and will be able to take back Taiwan without worry of US interference. The USN may be large but will the USN's entire fleet be dispatched to China? Im just saying, dont be so stupid as to think China is not a threat. Maybe not yet but soon while Obama dismantles the US military",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-25 06:44:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "FlankerFlyer"
    },
    {
        "content": "I saw Chinas` latest show and tell, and you know what,...Ship numbers and Tec. ordinance don`t dictate yours or their Navys` survivability. It really don`t. In a small and defined area,..your ship type and direct volume fires...do. Projection power needs Tec. ordinance, and numbers allow multiple presance, but in confinement,...type and volume does the best work !! China still relies almost soly on rockets for anti shipping. The reason China will be a major threat, is cuz no-one has survivability and volume anymore !! But we`ll see !!",
        "intTime": 20090425,
        "postID": 5,
        "quote": "",
        "reply": "I saw Chinas` latest show and tell, and you know what,...Ship numbers and Tec. ordinance don`t dictate yours or their Navys` survivability. It really don`t. In a small and defined area,..your ship type and direct volume fires...do. Projection power needs Tec. ordinance, and numbers allow multiple presance, but in confinement,...type and volume does the best work !! China still relies almost soly on rockets for anti shipping. The reason China will be a major threat, is cuz no-one has survivability and volume anymore !! But we`ll see !!",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-25 07:34:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "OddBall1st"
    },
    {
        "content": "quote: Originally posted by Bill_Fold: RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger. I think both you and the article writer really underestimate the Chinese Navy, or the rest of the PLA for that matter. That same kind of complacency is what led the US military back then to underestimate the Japanese just before the Pacific War began, making them ill-prepared for a contingency like the Dec.7, 1941 attack on Pearl Harbour. Here are a couple of earlier threads on both here and the US_China section of military.com to get you up to speed: \"Chinese Navy (PLAN) 60th Anniversary sees PRC showcase naval might\" thread of military.com \"PLAN Admiral vows to accelerate naval buildup\" thread of military.com \"Chinese Navy (PLAN) begins training carrier aviators\" thread of military.com \"China seriously considering carriers thread\" of military.com Furthermore, that formerly derelict ex-Soviet Russian carrier Varyag which was towed to Shanghai/Dalian to originally be a floating casino has since been put under government control and is now being refurbished to become a full operational carrier. The Varyag has been renamed Shi Lang/施琅, or the name of the Qing Dynasty general who helped conquer Taiwan from Ming rebels in the 1600s. How ironic, since the PRC/mainland China has vowed to one day retake Taiwan/the ROC, by force, if the Taipei government does not reunify with China peacefully. ++www.varyagworld.com And as started in one of the threads above, the PRC/China has also begun construction of two home-built carriers this year as well. quote: From the Asahi Shimbun newspaper of Japan: China to start construction of 1st aircraft carriers next year BY KENJI MINEMURA, THE ASAHI SHIMBUN BEIJING--China will begin construction of the country's first domestically produced aircraft carriers in Shanghai next year, with an eye to completing two mid-sized carriers by 2015, military and shipbuilding sources said. Beijing is also expected to complete work on a never-finished former Soviet aircraft carrier moored in the northeastern port of Dalian, to provide training for carrier-based pilots and crew. The two 50,000- to 60,000-ton carriers will rely on conventional propulsion systems, not nuclear power. They will be assigned to the People's Liberation Army Navy south sea fleet, tasked with patrolling the South China Sea, sources said...",
        "intTime": 20090425,
        "postID": 6,
        "quote": "Originally posted by Bill_Fold: RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger.",
        "reply": " I think both you and the article writer really underestimate the Chinese Navy, or the rest of the PLA for that matter. That same kind of complacency is what led the US military back then to underestimate the Japanese just before the Pacific War began, making them ill-prepared for a contingency like the Dec.7, 1941 attack on Pearl Harbour. Here are a couple of earlier threads on both here and the US_China section of military.com to get you up to speed: \"Chinese Navy (PLAN) 60th Anniversary sees PRC showcase naval might\" thread of military.com \"PLAN Admiral vows to accelerate naval buildup\" thread of military.com \"Chinese Navy (PLAN) begins training carrier aviators\" thread of military.com \"China seriously considering carriers thread\" of military.com Furthermore, that formerly derelict ex-Soviet Russian carrier Varyag which was towed to Shanghai/Dalian to originally be a floating casino has since been put under government control and is now being refurbished to become a full operational carrier. The Varyag has been renamed Shi Lang/施琅, or the name of the Qing Dynasty general who helped conquer Taiwan from Ming rebels in the 1600s. How ironic, since the PRC/mainland China has vowed to one day retake Taiwan/the ROC, by force, if the Taipei government does not reunify with China peacefully. ++www.varyagworld.com And as started in one of the threads above, the PRC/China has also begun construction of two home-built carriers this year as well. quote: From the Asahi Shimbun newspaper of Japan: China to start construction of 1st aircraft carriers next year BY KENJI MINEMURA, THE ASAHI SHIMBUN BEIJING--China will begin construction of the country's first domestically produced aircraft carriers in Shanghai next year, with an eye to completing two mid-sized carriers by 2015, military and shipbuilding sources said. Beijing is also expected to complete work on a never-finished former Soviet aircraft carrier moored in the northeastern port of Dalian, to provide training for carrier-based pilots and crew. The two 50,000- to 60,000-ton carriers will rely on conventional propulsion systems, not nuclear power. They will be assigned to the People's Liberation Army Navy south sea fleet, tasked with patrolling the South China Sea, sources said...",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-25 09:26:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "Comparing the Chinese Navy to the US Navy is like comparing a tugg boat to a Nimitz class Supercarrier Let China build a world class regional Navy, doesnt matter, we'll still crush them head to head...",
        "intTime": 20090425,
        "postID": 7,
        "quote": "",
        "reply": "Comparing the Chinese Navy to the US Navy is like comparing a tugg boat to a Nimitz class Supercarrier Let China build a world class regional Navy, doesnt matter, we'll still crush them head to head...",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-25 12:01:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "Irwin_R_Schyster"
    },
    {
        "content": "Canuck_Centaur: If everything you read on my blog you have already seen elsewhere, why do you read my blog? You are wrong again with respect to the Chinese Navy rehabilitating the unfinished Russian carrier VARYAG. She has been sitting at the same pier in Dalian for several years--she has been painted but no work has been done on her. The carrier is readily visible from a nearby commercial hotel. Why would the Chinese Navy go to the expense of rehabilitating and sending to sea a carrier that was designed more than 40 years ago--and has never had her engines, controls, radars, and many other important features installed. The cost of producing and installing those compoients would probably be more than building a new carrier as those suppliers are mostly no longer in business (in Russia and the Ukraine), and if they are they no longer produce suitable systems for that particular design. Rather, the Chinese Navy has used the VARYAG as a schoolroom for naval architects interested in carrier design. As for the Chinese now building two 50-60,000 ton carriers--wrong again. Satellite photography (some of which is commercially available) of the two or three yards in China that could construct such ships show no activity that would indicate carrier programs are underway; similarly, the firms that could produce such items as aircraft elevators for carriers show no such projects on their order books. It is difficult to build a carrier in secret. Could you share with us some of the \"sources\" that you quote? Yes, China will undoubtedly build aircraft carriers in the future. But reports that they are now building them--and some \"unnamed sources\" tell of a 100,000-ton nuclear ship being constructed--are premature. Norman",
        "intTime": 20090426,
        "postID": 8,
        "quote": "",
        "reply": "Canuck_Centaur: If everything you read on my blog you have already seen elsewhere, why do you read my blog? You are wrong again with respect to the Chinese Navy rehabilitating the unfinished Russian carrier VARYAG. She has been sitting at the same pier in Dalian for several years--she has been painted but no work has been done on her. The carrier is readily visible from a nearby commercial hotel. Why would the Chinese Navy go to the expense of rehabilitating and sending to sea a carrier that was designed more than 40 years ago--and has never had her engines, controls, radars, and many other important features installed. The cost of producing and installing those compoients would probably be more than building a new carrier as those suppliers are mostly no longer in business (in Russia and the Ukraine), and if they are they no longer produce suitable systems for that particular design. Rather, the Chinese Navy has used the VARYAG as a schoolroom for naval architects interested in carrier design. As for the Chinese now building two 50-60,000 ton carriers--wrong again. Satellite photography (some of which is commercially available) of the two or three yards in China that could construct such ships show no activity that would indicate carrier programs are underway; similarly, the firms that could produce such items as aircraft elevators for carriers show no such projects on their order books. It is difficult to build a carrier in secret. Could you share with us some of the \"sources\" that you quote? Yes, China will undoubtedly build aircraft carriers in the future. But reports that they are now building them--and some \"unnamed sources\" tell of a 100,000-ton nuclear ship being constructed--are premature. Norman",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-26 10:37:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "10016566"
    },
    {
        "content": "quote: As for the Chinese now building two 50-60,000 ton carriers--wrong again. Satellite photography (some of which is commercially available) of the two or three yards in China that could construct such ships show no activity that would indicate carrier programs are underway; similarly, the firms that could produce such items as aircraft elevators for carriers show no such projects on their order books. norm, you think they would send you an email telling you about it? It is difficult to build a carrier in secret. Could you share with us some of the \"sources\" that you quote? Yes, China will undoubtedly build aircraft carriers in the future. But reports that they are now building them--and some \"unnamed sources\" tell of a 100,000-ton nuclear ship being constructed--are premature. With respect, Norman, A new shipyard capable of handling ships of this size, in excess of 50,000 tons displacement and 1,000 feet in length, looks to have been built on an island off Shanghai. Satellite imagery shows that there is much activity there but no keel has been laid although it seems preparations are being made to do just that. China has managed to keep a high level of secrecy building submarines and there is no reason to think that they cant pull off major component construction in a similar manner. We can agree that just being able to build an aircraft carrier in no way comes close to being able to effectively operate one well enough to be a credible threat to the USN but by the next decade they will be taking great pains to attempt to get into a combat capable mode. 2015 may be a bit premature but they will get it done. Also, I can confirm that nothing special is going on with the Varyag except with the possible name change but that doesnt mean anything either. What is interesting is that the J-11BS has been seen at CFTE last week which is the second domestically produced Flanker clone which is supposed to be a heavy, multi-role strike aircraft like the F-15E and supposedly the \"naval flanker\" variant J-11BJ is expected by 2010 so why would they be investing in Naval aircraft if they didnt plan on having an aircraft carrier by 2015 for the aircraft to be serial produced and ready by then? Additionally, if the stepped up production of the Yuan class sub is any indication(already 3rd boat nearing completion in less than 4 years)the Chinese may be able to pull off an ambitious carrier project in a similar speedy manner as well. I still wouldnt rule out using the Varyag as a testing/training ship.",
        "intTime": 20090426,
        "postID": 9,
        "quote": "As for the Chinese now building two 50-60,000 ton carriers--wrong again. Satellite photography (some of which is commercially available) of the two or three yards in China that could construct such ships show no activity that would indicate carrier programs are underway; similarly, the firms that could produce such items as aircraft elevators for carriers show no such projects on their order books. norm, you think they would send you an email telling you about it? It is difficult to build a carrier in secret. Could you share with us some of the \"sources\" that you quote? Yes, China will undoubtedly build aircraft carriers in the future. But reports that they are now building them--and some \"unnamed sources\" tell of a 100,000-ton nuclear ship being constructed--are premature.",
        "reply": " With respect, Norman, A new shipyard capable of handling ships of this size, in excess of 50,000 tons displacement and 1,000 feet in length, looks to have been built on an island off Shanghai. Satellite imagery shows that there is much activity there but no keel has been laid although it seems preparations are being made to do just that. China has managed to keep a high level of secrecy building submarines and there is no reason to think that they cant pull off major component construction in a similar manner. We can agree that just being able to build an aircraft carrier in no way comes close to being able to effectively operate one well enough to be a credible threat to the USN but by the next decade they will be taking great pains to attempt to get into a combat capable mode. 2015 may be a bit premature but they will get it done. Also, I can confirm that nothing special is going on with the Varyag except with the possible name change but that doesnt mean anything either. What is interesting is that the J-11BS has been seen at CFTE last week which is the second domestically produced Flanker clone which is supposed to be a heavy, multi-role strike aircraft like the F-15E and supposedly the \"naval flanker\" variant J-11BJ is expected by 2010 so why would they be investing in Naval aircraft if they didnt plan on having an aircraft carrier by 2015 for the aircraft to be serial produced and ready by then? Additionally, if the stepped up production of the Yuan class sub is any indication(already 3rd boat nearing completion in less than 4 years)the Chinese may be able to pull off an ambitious carrier project in a similar speedy manner as well. I still wouldnt rule out using the Varyag as a testing/training ship.",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-26 11:58:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "FlankerFlyer"
    },
    {
        "content": "China's navy appears to be constructed and oriented on the soth east asian rim basin...they definitely want to be a regional naval power, especially in regards to other nations competing for nautral resources in the region. Alternatively, China does want to keep Tiwan in its sights, however with U.S. naval presence in the region, military atagonism towards Tiwan can be checked. The real issue is \"anticipating\" what China's future political and military objectives will be over the horizon. For example: history has shown the build up of the Japanese navy in the 1890's (during the first Sino-Japanese War for control of Korea), to war with the Russians in 1903, and eventually to the attack on Pearl Harbor in 1941. We need to understand what China's political, economic, and military priorities are in order to understand HOW they will grow their military!! A comprehensive assessment will lay out the framework from which to predict future hostilities!!! In the meantime we need to maintain our engagement with their military and continue to conduct joint exercises to continue to assess what their capabilities are.",
        "intTime": 20090426,
        "postID": 10,
        "quote": "",
        "reply": "China's navy appears to be constructed and oriented on the soth east asian rim basin...they definitely want to be a regional naval power, especially in regards to other nations competing for nautral resources in the region. Alternatively, China does want to keep Tiwan in its sights, however with U.S. naval presence in the region, military atagonism towards Tiwan can be checked. The real issue is \"anticipating\" what China's future political and military objectives will be over the horizon. For example: history has shown the build up of the Japanese navy in the 1890's (during the first Sino-Japanese War for control of Korea), to war with the Russians in 1903, and eventually to the attack on Pearl Harbor in 1941. We need to understand what China's political, economic, and military priorities are in order to understand HOW they will grow their military!! A comprehensive assessment will lay out the framework from which to predict future hostilities!!! In the meantime we need to maintain our engagement with their military and continue to conduct joint exercises to continue to assess what their capabilities are.",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-26 12:12:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "DShirley"
    },
    {
        "content": "America's costly naval philosophy was rooted in enforcing influence off its two (three?) oceanic coasts. This has been extended futher afield from time to time in defense of American interests. To such an extent that, to-day, Amercia maintains fleets in most of the worlds' oceans and well-trafficked seas. China has no such defense needs, she has no political interests abroad in need of protection. 90 percent of the resources she needs are located in Asia. What's the need to waste resources in a naval race with America? They realise there is no need for two 'world cops', just the necessity of defending against another police action. China may be a 'paper tiger', but they've proven to be far from stupid - why waste steel when they get what they want through influence? This message has been edited. Last edited by: popsiq, Sun 26 April 2009 12:47 PM",
        "intTime": 20090426,
        "postID": 11,
        "quote": "",
        "reply": "America's costly naval philosophy was rooted in enforcing influence off its two (three?) oceanic coasts. This has been extended futher afield from time to time in defense of American interests. To such an extent that, to-day, Amercia maintains fleets in most of the worlds' oceans and well-trafficked seas. China has no such defense needs, she has no political interests abroad in need of protection. 90 percent of the resources she needs are located in Asia. What's the need to waste resources in a naval race with America? They realise there is no need for two 'world cops', just the necessity of defending against another police action. China may be a 'paper tiger', but they've proven to be far from stupid - why waste steel when they get what they want through influence? This message has been edited. Last edited by: popsiq, Sun 26 April 2009 12:47 PM",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-26 12:29:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "popsiq"
    },
    {
        "content": "All: Much, much easier to build submarines \"in secret\"--under cover, etc. Not possible to build a carrier \"indoors,\" not even in the giant covered building ways at Sverdovinsk and Komsomolsk, which Stalin had erected to build battleships side-by-side. Again, China does want carriers and will undoubtedly build some in the future. But there are ample classified and open source indications that demonstrate conclusively that such a construction effort has not yet begun. Again, for a decade there have been reports that the VARYAG is \"being completed\" by China, yet absolutely no work on the ship has been observed (other than a decent paint job). For example, to install engines would require cutting upon the flight deck! The Chinese \"elevator companies\" that could build flight-deck lifts for future carriers are well known in the West, work with Western companies, and there would be indications if such work were being undertaken. Rather, expect to see Chinese observers aboard the new, Russian-buiult carrier when she becomes operational. Norman Norman",
        "intTime": 20090426,
        "postID": 12,
        "quote": "",
        "reply": "All: Much, much easier to build submarines \"in secret\"--under cover, etc. Not possible to build a carrier \"indoors,\" not even in the giant covered building ways at Sverdovinsk and Komsomolsk, which Stalin had erected to build battleships side-by-side. Again, China does want carriers and will undoubtedly build some in the future. But there are ample classified and open source indications that demonstrate conclusively that such a construction effort has not yet begun. Again, for a decade there have been reports that the VARYAG is \"being completed\" by China, yet absolutely no work on the ship has been observed (other than a decent paint job). For example, to install engines would require cutting upon the flight deck! The Chinese \"elevator companies\" that could build flight-deck lifts for future carriers are well known in the West, work with Western companies, and there would be indications if such work were being undertaken. Rather, expect to see Chinese observers aboard the new, Russian-buiult carrier when she becomes operational. Norman Norman",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-26 21:48:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "10016566"
    },
    {
        "content": "quote: Originally posted by Bleah: We need aircraft carriers to effectively field a high performance jet in that region. China does not. We have our fleet spread out all over the world. China does not. We have to transit choke points. China has to close them. We are far from the battlespace. China is close. The real crux of all of this is that we are vulnerable (as pertains to this conversation), and China is not. They do not want a world-spanning super-navy to challenge ours; rather, they want a world class regional navy that can stop ours from achieving our objectives in a small defined area. They are doing a damned good job of that - in fact, my guess is that the only thing preventing them from temporary parity/superiority is their training and doctrine. Refusal to see China as an emerging naval power that can threaten our regional superiority is wishful thinking. This is all too true. I'm sure everyone here knows the vurnabilaty of shipping lanes through the region. The \"Old Men\" in China sure do. They can pick a time when the USN is too commited in another area, and then make their move. CoordOPS, with the massive PLA on land, supported by the PLA Navy cutting off Sea Lanes of Communication and Support. This was a major concern when I retired in '93, now it is complicated by the massive transfer of technoligy and manafacturing and shipbuilding to China.",
        "intTime": 20090427,
        "postID": 13,
        "quote": "Originally posted by Bleah: We need aircraft carriers to effectively field a high performance jet in that region. China does not. We have our fleet spread out all over the world. China does not. We have to transit choke points. China has to close them. We are far from the battlespace. China is close. The real crux of all of this is that we are vulnerable (as pertains to this conversation), and China is not. They do not want a world-spanning super-navy to challenge ours; rather, they want a world class regional navy that can stop ours from achieving our objectives in a small defined area. They are doing a damned good job of that - in fact, my guess is that the only thing preventing them from temporary parity/superiority is their training and doctrine. Refusal to see China as an emerging naval power that can threaten our regional superiority is wishful thinking.",
        "reply": " This is all too true. I'm sure everyone here knows the vurnabilaty of shipping lanes through the region. The \"Old Men\" in China sure do. They can pick a time when the USN is too commited in another area, and then make their move. CoordOPS, with the massive PLA on land, supported by the PLA Navy cutting off Sea Lanes of Communication and Support. This was a major concern when I retired in '93, now it is complicated by the massive transfer of technoligy and manafacturing and shipbuilding to China.",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-27 05:50:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "AWCPelton"
    },
    {
        "content": "Interesting as I read this story history comes back to haunt me. Why does Dec 07, 1941 come into my memory? The USA scoffed at the Japanese Navy and their ability to successfully reach the assets of the USA, meaning Pearl Harbor. We were remiss once, shame on us, remiss twice, we will be history as we know it today. We can never throw caution to the wind, never underestimate another country (as 9/11 showed us) and believe only ½ what we can see. The instant we don’t keep our guard up and our powder dry, we will be talking a different language. Kinda like what is slowly happening today…Spanish becoming the predominate language and we just sit and allow it to happen. We are even facilitating it!! Can we as a nation really be that asleep at the wheel? Is our head really stuck that deep in the sand that we are oblivious to what is happening at our Southern Boarder and in our Nations Capitol? Did our Leader really bow to another nations King? Did he say we are not a Christian nation? Is all this a really bad dream where the thousands of lives were given and 233 years invested to us to where we are headed today? If ever in history it has been needed more then show me…Until then, please GOD BLESS ANERICA.",
        "intTime": 20090427,
        "postID": 14,
        "quote": "",
        "reply": "Interesting as I read this story history comes back to haunt me. Why does Dec 07, 1941 come into my memory? The USA scoffed at the Japanese Navy and their ability to successfully reach the assets of the USA, meaning Pearl Harbor. We were remiss once, shame on us, remiss twice, we will be history as we know it today. We can never throw caution to the wind, never underestimate another country (as 9/11 showed us) and believe only ½ what we can see. The instant we don’t keep our guard up and our powder dry, we will be talking a different language. Kinda like what is slowly happening today…Spanish becoming the predominate language and we just sit and allow it to happen. We are even facilitating it!! Can we as a nation really be that asleep at the wheel? Is our head really stuck that deep in the sand that we are oblivious to what is happening at our Southern Boarder and in our Nations Capitol? Did our Leader really bow to another nations King? Did he say we are not a Christian nation? Is all this a really bad dream where the thousands of lives were given and 233 years invested to us to where we are headed today? If ever in history it has been needed more then show me…Until then, please GOD BLESS ANERICA.",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-27 08:00:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "F22Flighttester"
    },
    {
        "content": "It's also true that we cannot go spending ourselves into oblivion by seeing every potential rival as the next Japan. That is an equally misguided way of thinking and can be harmful as well.",
        "intTime": 20090427,
        "postID": 15,
        "quote": "",
        "reply": "It's also true that we cannot go spending ourselves into oblivion by seeing every potential rival as the next Japan. That is an equally misguided way of thinking and can be harmful as well.",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-27 08:41:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by Bleah: We need aircraft carriers to effectively field a high performance jet in that region. China does not. We have our fleet spread out all over the world. China does not. We have to transit choke points. China has to close them. We are far from the battlespace. China is close. The real crux of all of this is that we are vulnerable (as pertains to this conversation), and China is not. They do not want a world-spanning super-navy to challenge ours; rather, they want a world class regional navy that can stop ours from achieving our objectives in a small defined area. They are doing a damned good job of that - in fact, my guess is that the only thing preventing them from temporary parity/superiority is their training and doctrine. Refusal to see China as an emerging naval power that can threaten our regional superiority is wishful thinking. Already past the future",
        "intTime": 20090427,
        "postID": 16,
        "quote": "Originally posted by Bleah: We need aircraft carriers to effectively field a high performance jet in that region. China does not. We have our fleet spread out all over the world. China does not. We have to transit choke points. China has to close them. We are far from the battlespace. China is close. The real crux of all of this is that we are vulnerable (as pertains to this conversation), and China is not. They do not want a world-spanning super-navy to challenge ours; rather, they want a world class regional navy that can stop ours from achieving our objectives in a small defined area. They are doing a damned good job of that - in fact, my guess is that the only thing preventing them from temporary parity/superiority is their training and doctrine. Refusal to see China as an emerging naval power that can threaten our regional superiority is wishful thinking.",
        "reply": " Already past the future",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-27 16:27:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "6486143"
    },
    {
        "content": "quote: Originally posted by Bill_Fold: RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger. You can still bleed to death from a nasty papercut Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090427,
        "postID": 17,
        "quote": "Originally posted by Bill_Fold: RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger.",
        "reply": " You can still bleed to death from a nasty papercut Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-27 16:29:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "L0A1"
    },
    {
        "content": "Most non-military serving newspaper journalists and Hollywood actors would not know a Battleship from a rowboat. Does anyone have a lead on a story I barely heard about Turkey building parts for the F22 with Chinese parts that make the aircraft vulnerable? If true that is the most idiotic thing I have ever heard of...allowing the enemy to build parts of your weapons system. Let me know where I can read the lowdown on this so I will be actually informed. Tell me it ain't true!",
        "intTime": 20090427,
        "postID": 18,
        "quote": "",
        "reply": "Most non-military serving newspaper journalists and Hollywood actors would not know a Battleship from a rowboat. Does anyone have a lead on a story I barely heard about Turkey building parts for the F22 with Chinese parts that make the aircraft vulnerable? If true that is the most idiotic thing I have ever heard of...allowing the enemy to build parts of your weapons system. Let me know where I can read the lowdown on this so I will be actually informed. Tell me it ain't true!",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-27 17:07:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "BigTBird"
    },
    {
        "content": "Most Military personel don`t know that even when the air has been nuteralized by solar flares or ionized by bombs so electricity cannot flow....the coal burrning Battleships of the Great White Fleet will be fully operational and still keep comming !! They had it right the first time !!",
        "intTime": 20090427,
        "postID": 19,
        "quote": "",
        "reply": "Most Military personel don`t know that even when the air has been nuteralized by solar flares or ionized by bombs so electricity cannot flow....the coal burrning Battleships of the Great White Fleet will be fully operational and still keep comming !! They had it right the first time !!",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-27 17:22:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "OddBall1st"
    },
    {
        "content": "quote: Originally posted by Bleah: We need aircraft carriers to effectively field a high performance jet in that region. China does not. We have our fleet spread out all over the world. China does not. We have to transit choke points. China has to close them. We are far from the battlespace. China is close. The real crux of all of this is that we are vulnerable (as pertains to this conversation), and China is not. They do not want a world-spanning super-navy to challenge ours; rather, they want a world class regional navy that can stop ours from achieving our objectives in a small defined area. They are doing a damned good job of that - in fact, my guess is that the only thing preventing them from temporary parity/superiority is their training and doctrine. Refusal to see China as an emerging naval power that can threaten our regional superiority is wishful thinking. They have a Secret Weapon we have no control over, cannot reason with, or counter. O.B.A.M.A.. They are the lender, We are the borrower. They can raise the interest. They can raise the rent. They can cash in.",
        "intTime": 20090427,
        "postID": 20,
        "quote": "Originally posted by Bleah: We need aircraft carriers to effectively field a high performance jet in that region. China does not. We have our fleet spread out all over the world. China does not. We have to transit choke points. China has to close them. We are far from the battlespace. China is close. The real crux of all of this is that we are vulnerable (as pertains to this conversation), and China is not. They do not want a world-spanning super-navy to challenge ours; rather, they want a world class regional navy that can stop ours from achieving our objectives in a small defined area. They are doing a damned good job of that - in fact, my guess is that the only thing preventing them from temporary parity/superiority is their training and doctrine. Refusal to see China as an emerging naval power that can threaten our regional superiority is wishful thinking.",
        "reply": " They have a Secret Weapon we have no control over, cannot reason with, or counter. O.B.A.M.A.. They are the lender, We are the borrower. They can raise the interest. They can raise the rent. They can cash in.",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-27 17:46:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "AngryPuppy"
    },
    {
        "content": "RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger.",
        "intTime": 20090425,
        "postID": 21,
        "quote": "",
        "reply": "RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger.",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-25 06:18:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "Bill_Fold"
    },
    {
        "content": "quote: Originally posted by Bill_Fold: RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger. You are probably correct. However, I recall a portion of the Kings Bay subs transfered to the west coast to keep an eye on them anyway!",
        "intTime": 20090425,
        "postID": 22,
        "quote": "Originally posted by Bill_Fold: RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger.",
        "reply": " You are probably correct. However, I recall a portion of the Kings Bay subs transfered to the west coast to keep an eye on them anyway!",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-25 06:21:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "busnrete8"
    },
    {
        "content": "We need aircraft carriers to effectively field a high performance jet in that region. China does not. We have our fleet spread out all over the world. China does not. We have to transit choke points. China has to close them. We are far from the battlespace. China is close. The real crux of all of this is that we are vulnerable (as pertains to this conversation), and China is not. They do not want a world-spanning super-navy to challenge ours; rather, they want a world class regional navy that can stop ours from achieving our objectives in a small defined area. They are doing a damned good job of that - in fact, my guess is that the only thing preventing them from temporary parity/superiority is their training and doctrine. Refusal to see China as an emerging naval power that can threaten our regional superiority is wishful thinking.",
        "intTime": 20090425,
        "postID": 23,
        "quote": "",
        "reply": "We need aircraft carriers to effectively field a high performance jet in that region. China does not. We have our fleet spread out all over the world. China does not. We have to transit choke points. China has to close them. We are far from the battlespace. China is close. The real crux of all of this is that we are vulnerable (as pertains to this conversation), and China is not. They do not want a world-spanning super-navy to challenge ours; rather, they want a world class regional navy that can stop ours from achieving our objectives in a small defined area. They are doing a damned good job of that - in fact, my guess is that the only thing preventing them from temporary parity/superiority is their training and doctrine. Refusal to see China as an emerging naval power that can threaten our regional superiority is wishful thinking.",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-25 06:36:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "Bleah"
    },
    {
        "content": "quote: Originally posted by Bill_Fold: RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger. Not a paper tiger, a kitten. It would be foolish to assume that China will never be a threat. Their modernization and buildup is moving forward at a breakneck pace and good ol Norman says it will be a decade or more before...totally missing the point I think. Unlike the US, China has no desire to project military power accross the world, they simply want to control their periphery as the Russians do. In South America, they already have a large foothold economically while the US largely ignored it. While the USN could deny oil imports from South America and the Carribean, The areas under development in the South China sea as well as a new pipeline from Russia provide alternatives that can prevent such a denial from crushing them economically in any conflict. Within that same decade, China will be able to completely deny outsiders from their sphere of influence and will be able to take back Taiwan without worry of US interference. The USN may be large but will the USN's entire fleet be dispatched to China? Im just saying, dont be so stupid as to think China is not a threat. Maybe not yet but soon while Obama dismantles the US military",
        "intTime": 20090425,
        "postID": 24,
        "quote": "Originally posted by Bill_Fold: RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger.",
        "reply": " Not a paper tiger, a kitten. It would be foolish to assume that China will never be a threat. Their modernization and buildup is moving forward at a breakneck pace and good ol Norman says it will be a decade or more before...totally missing the point I think. Unlike the US, China has no desire to project military power accross the world, they simply want to control their periphery as the Russians do. In South America, they already have a large foothold economically while the US largely ignored it. While the USN could deny oil imports from South America and the Carribean, The areas under development in the South China sea as well as a new pipeline from Russia provide alternatives that can prevent such a denial from crushing them economically in any conflict. Within that same decade, China will be able to completely deny outsiders from their sphere of influence and will be able to take back Taiwan without worry of US interference. The USN may be large but will the USN's entire fleet be dispatched to China? Im just saying, dont be so stupid as to think China is not a threat. Maybe not yet but soon while Obama dismantles the US military",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-25 06:44:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "FlankerFlyer"
    },
    {
        "content": "I saw Chinas` latest show and tell, and you know what,...Ship numbers and Tec. ordinance don`t dictate yours or their Navys` survivability. It really don`t. In a small and defined area,..your ship type and direct volume fires...do. Projection power needs Tec. ordinance, and numbers allow multiple presance, but in confinement,...type and volume does the best work !! China still relies almost soly on rockets for anti shipping. The reason China will be a major threat, is cuz no-one has survivability and volume anymore !! But we`ll see !!",
        "intTime": 20090425,
        "postID": 25,
        "quote": "",
        "reply": "I saw Chinas` latest show and tell, and you know what,...Ship numbers and Tec. ordinance don`t dictate yours or their Navys` survivability. It really don`t. In a small and defined area,..your ship type and direct volume fires...do. Projection power needs Tec. ordinance, and numbers allow multiple presance, but in confinement,...type and volume does the best work !! China still relies almost soly on rockets for anti shipping. The reason China will be a major threat, is cuz no-one has survivability and volume anymore !! But we`ll see !!",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-25 07:34:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "OddBall1st"
    },
    {
        "content": "quote: Originally posted by Bill_Fold: RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger. I think both you and the article writer really underestimate the Chinese Navy, or the rest of the PLA for that matter. That same kind of complacency is what led the US military back then to underestimate the Japanese just before the Pacific War began, making them ill-prepared for a contingency like the Dec.7, 1941 attack on Pearl Harbour. Here are a couple of earlier threads on both here and the US_China section of military.com to get you up to speed: \"Chinese Navy (PLAN) 60th Anniversary sees PRC showcase naval might\" thread of military.com \"PLAN Admiral vows to accelerate naval buildup\" thread of military.com \"Chinese Navy (PLAN) begins training carrier aviators\" thread of military.com \"China seriously considering carriers thread\" of military.com Furthermore, that formerly derelict ex-Soviet Russian carrier Varyag which was towed to Shanghai/Dalian to originally be a floating casino has since been put under government control and is now being refurbished to become a full operational carrier. The Varyag has been renamed Shi Lang/施琅, or the name of the Qing Dynasty general who helped conquer Taiwan from Ming rebels in the 1600s. How ironic, since the PRC/mainland China has vowed to one day retake Taiwan/the ROC, by force, if the Taipei government does not reunify with China peacefully. ++www.varyagworld.com And as started in one of the threads above, the PRC/China has also begun construction of two home-built carriers this year as well. quote: From the Asahi Shimbun newspaper of Japan: China to start construction of 1st aircraft carriers next year BY KENJI MINEMURA, THE ASAHI SHIMBUN BEIJING--China will begin construction of the country's first domestically produced aircraft carriers in Shanghai next year, with an eye to completing two mid-sized carriers by 2015, military and shipbuilding sources said. Beijing is also expected to complete work on a never-finished former Soviet aircraft carrier moored in the northeastern port of Dalian, to provide training for carrier-based pilots and crew. The two 50,000- to 60,000-ton carriers will rely on conventional propulsion systems, not nuclear power. They will be assigned to the People's Liberation Army Navy south sea fleet, tasked with patrolling the South China Sea, sources said...",
        "intTime": 20090425,
        "postID": 26,
        "quote": "Originally posted by Bill_Fold: RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger.",
        "reply": " I think both you and the article writer really underestimate the Chinese Navy, or the rest of the PLA for that matter. That same kind of complacency is what led the US military back then to underestimate the Japanese just before the Pacific War began, making them ill-prepared for a contingency like the Dec.7, 1941 attack on Pearl Harbour. Here are a couple of earlier threads on both here and the US_China section of military.com to get you up to speed: \"Chinese Navy (PLAN) 60th Anniversary sees PRC showcase naval might\" thread of military.com \"PLAN Admiral vows to accelerate naval buildup\" thread of military.com \"Chinese Navy (PLAN) begins training carrier aviators\" thread of military.com \"China seriously considering carriers thread\" of military.com Furthermore, that formerly derelict ex-Soviet Russian carrier Varyag which was towed to Shanghai/Dalian to originally be a floating casino has since been put under government control and is now being refurbished to become a full operational carrier. The Varyag has been renamed Shi Lang/施琅, or the name of the Qing Dynasty general who helped conquer Taiwan from Ming rebels in the 1600s. How ironic, since the PRC/mainland China has vowed to one day retake Taiwan/the ROC, by force, if the Taipei government does not reunify with China peacefully. ++www.varyagworld.com And as started in one of the threads above, the PRC/China has also begun construction of two home-built carriers this year as well. quote: From the Asahi Shimbun newspaper of Japan: China to start construction of 1st aircraft carriers next year BY KENJI MINEMURA, THE ASAHI SHIMBUN BEIJING--China will begin construction of the country's first domestically produced aircraft carriers in Shanghai next year, with an eye to completing two mid-sized carriers by 2015, military and shipbuilding sources said. Beijing is also expected to complete work on a never-finished former Soviet aircraft carrier moored in the northeastern port of Dalian, to provide training for carrier-based pilots and crew. The two 50,000- to 60,000-ton carriers will rely on conventional propulsion systems, not nuclear power. They will be assigned to the People's Liberation Army Navy south sea fleet, tasked with patrolling the South China Sea, sources said...",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-25 09:26:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "Comparing the Chinese Navy to the US Navy is like comparing a tugg boat to a Nimitz class Supercarrier Let China build a world class regional Navy, doesnt matter, we'll still crush them head to head...",
        "intTime": 20090425,
        "postID": 27,
        "quote": "",
        "reply": "Comparing the Chinese Navy to the US Navy is like comparing a tugg boat to a Nimitz class Supercarrier Let China build a world class regional Navy, doesnt matter, we'll still crush them head to head...",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-25 12:01:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "Irwin_R_Schyster"
    },
    {
        "content": "Canuck_Centaur: If everything you read on my blog you have already seen elsewhere, why do you read my blog? You are wrong again with respect to the Chinese Navy rehabilitating the unfinished Russian carrier VARYAG. She has been sitting at the same pier in Dalian for several years--she has been painted but no work has been done on her. The carrier is readily visible from a nearby commercial hotel. Why would the Chinese Navy go to the expense of rehabilitating and sending to sea a carrier that was designed more than 40 years ago--and has never had her engines, controls, radars, and many other important features installed. The cost of producing and installing those compoients would probably be more than building a new carrier as those suppliers are mostly no longer in business (in Russia and the Ukraine), and if they are they no longer produce suitable systems for that particular design. Rather, the Chinese Navy has used the VARYAG as a schoolroom for naval architects interested in carrier design. As for the Chinese now building two 50-60,000 ton carriers--wrong again. Satellite photography (some of which is commercially available) of the two or three yards in China that could construct such ships show no activity that would indicate carrier programs are underway; similarly, the firms that could produce such items as aircraft elevators for carriers show no such projects on their order books. It is difficult to build a carrier in secret. Could you share with us some of the \"sources\" that you quote? Yes, China will undoubtedly build aircraft carriers in the future. But reports that they are now building them--and some \"unnamed sources\" tell of a 100,000-ton nuclear ship being constructed--are premature. Norman",
        "intTime": 20090426,
        "postID": 28,
        "quote": "",
        "reply": "Canuck_Centaur: If everything you read on my blog you have already seen elsewhere, why do you read my blog? You are wrong again with respect to the Chinese Navy rehabilitating the unfinished Russian carrier VARYAG. She has been sitting at the same pier in Dalian for several years--she has been painted but no work has been done on her. The carrier is readily visible from a nearby commercial hotel. Why would the Chinese Navy go to the expense of rehabilitating and sending to sea a carrier that was designed more than 40 years ago--and has never had her engines, controls, radars, and many other important features installed. The cost of producing and installing those compoients would probably be more than building a new carrier as those suppliers are mostly no longer in business (in Russia and the Ukraine), and if they are they no longer produce suitable systems for that particular design. Rather, the Chinese Navy has used the VARYAG as a schoolroom for naval architects interested in carrier design. As for the Chinese now building two 50-60,000 ton carriers--wrong again. Satellite photography (some of which is commercially available) of the two or three yards in China that could construct such ships show no activity that would indicate carrier programs are underway; similarly, the firms that could produce such items as aircraft elevators for carriers show no such projects on their order books. It is difficult to build a carrier in secret. Could you share with us some of the \"sources\" that you quote? Yes, China will undoubtedly build aircraft carriers in the future. But reports that they are now building them--and some \"unnamed sources\" tell of a 100,000-ton nuclear ship being constructed--are premature. Norman",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-26 10:37:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "10016566"
    },
    {
        "content": "quote: As for the Chinese now building two 50-60,000 ton carriers--wrong again. Satellite photography (some of which is commercially available) of the two or three yards in China that could construct such ships show no activity that would indicate carrier programs are underway; similarly, the firms that could produce such items as aircraft elevators for carriers show no such projects on their order books. norm, you think they would send you an email telling you about it? It is difficult to build a carrier in secret. Could you share with us some of the \"sources\" that you quote? Yes, China will undoubtedly build aircraft carriers in the future. But reports that they are now building them--and some \"unnamed sources\" tell of a 100,000-ton nuclear ship being constructed--are premature. With respect, Norman, A new shipyard capable of handling ships of this size, in excess of 50,000 tons displacement and 1,000 feet in length, looks to have been built on an island off Shanghai. Satellite imagery shows that there is much activity there but no keel has been laid although it seems preparations are being made to do just that. China has managed to keep a high level of secrecy building submarines and there is no reason to think that they cant pull off major component construction in a similar manner. We can agree that just being able to build an aircraft carrier in no way comes close to being able to effectively operate one well enough to be a credible threat to the USN but by the next decade they will be taking great pains to attempt to get into a combat capable mode. 2015 may be a bit premature but they will get it done. Also, I can confirm that nothing special is going on with the Varyag except with the possible name change but that doesnt mean anything either. What is interesting is that the J-11BS has been seen at CFTE last week which is the second domestically produced Flanker clone which is supposed to be a heavy, multi-role strike aircraft like the F-15E and supposedly the \"naval flanker\" variant J-11BJ is expected by 2010 so why would they be investing in Naval aircraft if they didnt plan on having an aircraft carrier by 2015 for the aircraft to be serial produced and ready by then? Additionally, if the stepped up production of the Yuan class sub is any indication(already 3rd boat nearing completion in less than 4 years)the Chinese may be able to pull off an ambitious carrier project in a similar speedy manner as well. I still wouldnt rule out using the Varyag as a testing/training ship.",
        "intTime": 20090426,
        "postID": 29,
        "quote": "As for the Chinese now building two 50-60,000 ton carriers--wrong again. Satellite photography (some of which is commercially available) of the two or three yards in China that could construct such ships show no activity that would indicate carrier programs are underway; similarly, the firms that could produce such items as aircraft elevators for carriers show no such projects on their order books. norm, you think they would send you an email telling you about it? It is difficult to build a carrier in secret. Could you share with us some of the \"sources\" that you quote? Yes, China will undoubtedly build aircraft carriers in the future. But reports that they are now building them--and some \"unnamed sources\" tell of a 100,000-ton nuclear ship being constructed--are premature.",
        "reply": " With respect, Norman, A new shipyard capable of handling ships of this size, in excess of 50,000 tons displacement and 1,000 feet in length, looks to have been built on an island off Shanghai. Satellite imagery shows that there is much activity there but no keel has been laid although it seems preparations are being made to do just that. China has managed to keep a high level of secrecy building submarines and there is no reason to think that they cant pull off major component construction in a similar manner. We can agree that just being able to build an aircraft carrier in no way comes close to being able to effectively operate one well enough to be a credible threat to the USN but by the next decade they will be taking great pains to attempt to get into a combat capable mode. 2015 may be a bit premature but they will get it done. Also, I can confirm that nothing special is going on with the Varyag except with the possible name change but that doesnt mean anything either. What is interesting is that the J-11BS has been seen at CFTE last week which is the second domestically produced Flanker clone which is supposed to be a heavy, multi-role strike aircraft like the F-15E and supposedly the \"naval flanker\" variant J-11BJ is expected by 2010 so why would they be investing in Naval aircraft if they didnt plan on having an aircraft carrier by 2015 for the aircraft to be serial produced and ready by then? Additionally, if the stepped up production of the Yuan class sub is any indication(already 3rd boat nearing completion in less than 4 years)the Chinese may be able to pull off an ambitious carrier project in a similar speedy manner as well. I still wouldnt rule out using the Varyag as a testing/training ship.",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-26 11:58:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "FlankerFlyer"
    },
    {
        "content": "China's navy appears to be constructed and oriented on the soth east asian rim basin...they definitely want to be a regional naval power, especially in regards to other nations competing for nautral resources in the region. Alternatively, China does want to keep Tiwan in its sights, however with U.S. naval presence in the region, military atagonism towards Tiwan can be checked. The real issue is \"anticipating\" what China's future political and military objectives will be over the horizon. For example: history has shown the build up of the Japanese navy in the 1890's (during the first Sino-Japanese War for control of Korea), to war with the Russians in 1903, and eventually to the attack on Pearl Harbor in 1941. We need to understand what China's political, economic, and military priorities are in order to understand HOW they will grow their military!! A comprehensive assessment will lay out the framework from which to predict future hostilities!!! In the meantime we need to maintain our engagement with their military and continue to conduct joint exercises to continue to assess what their capabilities are.",
        "intTime": 20090426,
        "postID": 30,
        "quote": "",
        "reply": "China's navy appears to be constructed and oriented on the soth east asian rim basin...they definitely want to be a regional naval power, especially in regards to other nations competing for nautral resources in the region. Alternatively, China does want to keep Tiwan in its sights, however with U.S. naval presence in the region, military atagonism towards Tiwan can be checked. The real issue is \"anticipating\" what China's future political and military objectives will be over the horizon. For example: history has shown the build up of the Japanese navy in the 1890's (during the first Sino-Japanese War for control of Korea), to war with the Russians in 1903, and eventually to the attack on Pearl Harbor in 1941. We need to understand what China's political, economic, and military priorities are in order to understand HOW they will grow their military!! A comprehensive assessment will lay out the framework from which to predict future hostilities!!! In the meantime we need to maintain our engagement with their military and continue to conduct joint exercises to continue to assess what their capabilities are.",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-26 12:12:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "DShirley"
    },
    {
        "content": "America's costly naval philosophy was rooted in enforcing influence off its two (three?) oceanic coasts. This has been extended futher afield from time to time in defense of American interests. To such an extent that, to-day, Amercia maintains fleets in most of the worlds' oceans and well-trafficked seas. China has no such defense needs, she has no political interests abroad in need of protection. 90 percent of the resources she needs are located in Asia. What's the need to waste resources in a naval race with America? They realise there is no need for two 'world cops', just the necessity of defending against another police action. China may be a 'paper tiger', but they've proven to be far from stupid - why waste steel when they get what they want through influence? This message has been edited. Last edited by: popsiq, Sun 26 April 2009 12:47 PM",
        "intTime": 20090426,
        "postID": 31,
        "quote": "",
        "reply": "America's costly naval philosophy was rooted in enforcing influence off its two (three?) oceanic coasts. This has been extended futher afield from time to time in defense of American interests. To such an extent that, to-day, Amercia maintains fleets in most of the worlds' oceans and well-trafficked seas. China has no such defense needs, she has no political interests abroad in need of protection. 90 percent of the resources she needs are located in Asia. What's the need to waste resources in a naval race with America? They realise there is no need for two 'world cops', just the necessity of defending against another police action. China may be a 'paper tiger', but they've proven to be far from stupid - why waste steel when they get what they want through influence? This message has been edited. Last edited by: popsiq, Sun 26 April 2009 12:47 PM",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-26 12:29:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "popsiq"
    },
    {
        "content": "All: Much, much easier to build submarines \"in secret\"--under cover, etc. Not possible to build a carrier \"indoors,\" not even in the giant covered building ways at Sverdovinsk and Komsomolsk, which Stalin had erected to build battleships side-by-side. Again, China does want carriers and will undoubtedly build some in the future. But there are ample classified and open source indications that demonstrate conclusively that such a construction effort has not yet begun. Again, for a decade there have been reports that the VARYAG is \"being completed\" by China, yet absolutely no work on the ship has been observed (other than a decent paint job). For example, to install engines would require cutting upon the flight deck! The Chinese \"elevator companies\" that could build flight-deck lifts for future carriers are well known in the West, work with Western companies, and there would be indications if such work were being undertaken. Rather, expect to see Chinese observers aboard the new, Russian-buiult carrier when she becomes operational. Norman Norman",
        "intTime": 20090426,
        "postID": 32,
        "quote": "",
        "reply": "All: Much, much easier to build submarines \"in secret\"--under cover, etc. Not possible to build a carrier \"indoors,\" not even in the giant covered building ways at Sverdovinsk and Komsomolsk, which Stalin had erected to build battleships side-by-side. Again, China does want carriers and will undoubtedly build some in the future. But there are ample classified and open source indications that demonstrate conclusively that such a construction effort has not yet begun. Again, for a decade there have been reports that the VARYAG is \"being completed\" by China, yet absolutely no work on the ship has been observed (other than a decent paint job). For example, to install engines would require cutting upon the flight deck! The Chinese \"elevator companies\" that could build flight-deck lifts for future carriers are well known in the West, work with Western companies, and there would be indications if such work were being undertaken. Rather, expect to see Chinese observers aboard the new, Russian-buiult carrier when she becomes operational. Norman Norman",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-26 21:48:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "10016566"
    },
    {
        "content": "quote: Originally posted by Bleah: We need aircraft carriers to effectively field a high performance jet in that region. China does not. We have our fleet spread out all over the world. China does not. We have to transit choke points. China has to close them. We are far from the battlespace. China is close. The real crux of all of this is that we are vulnerable (as pertains to this conversation), and China is not. They do not want a world-spanning super-navy to challenge ours; rather, they want a world class regional navy that can stop ours from achieving our objectives in a small defined area. They are doing a damned good job of that - in fact, my guess is that the only thing preventing them from temporary parity/superiority is their training and doctrine. Refusal to see China as an emerging naval power that can threaten our regional superiority is wishful thinking. This is all too true. I'm sure everyone here knows the vurnabilaty of shipping lanes through the region. The \"Old Men\" in China sure do. They can pick a time when the USN is too commited in another area, and then make their move. CoordOPS, with the massive PLA on land, supported by the PLA Navy cutting off Sea Lanes of Communication and Support. This was a major concern when I retired in '93, now it is complicated by the massive transfer of technoligy and manafacturing and shipbuilding to China.",
        "intTime": 20090427,
        "postID": 33,
        "quote": "Originally posted by Bleah: We need aircraft carriers to effectively field a high performance jet in that region. China does not. We have our fleet spread out all over the world. China does not. We have to transit choke points. China has to close them. We are far from the battlespace. China is close. The real crux of all of this is that we are vulnerable (as pertains to this conversation), and China is not. They do not want a world-spanning super-navy to challenge ours; rather, they want a world class regional navy that can stop ours from achieving our objectives in a small defined area. They are doing a damned good job of that - in fact, my guess is that the only thing preventing them from temporary parity/superiority is their training and doctrine. Refusal to see China as an emerging naval power that can threaten our regional superiority is wishful thinking.",
        "reply": " This is all too true. I'm sure everyone here knows the vurnabilaty of shipping lanes through the region. The \"Old Men\" in China sure do. They can pick a time when the USN is too commited in another area, and then make their move. CoordOPS, with the massive PLA on land, supported by the PLA Navy cutting off Sea Lanes of Communication and Support. This was a major concern when I retired in '93, now it is complicated by the massive transfer of technoligy and manafacturing and shipbuilding to China.",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-27 05:50:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "AWCPelton"
    },
    {
        "content": "Interesting as I read this story history comes back to haunt me. Why does Dec 07, 1941 come into my memory? The USA scoffed at the Japanese Navy and their ability to successfully reach the assets of the USA, meaning Pearl Harbor. We were remiss once, shame on us, remiss twice, we will be history as we know it today. We can never throw caution to the wind, never underestimate another country (as 9/11 showed us) and believe only ½ what we can see. The instant we don’t keep our guard up and our powder dry, we will be talking a different language. Kinda like what is slowly happening today…Spanish becoming the predominate language and we just sit and allow it to happen. We are even facilitating it!! Can we as a nation really be that asleep at the wheel? Is our head really stuck that deep in the sand that we are oblivious to what is happening at our Southern Boarder and in our Nations Capitol? Did our Leader really bow to another nations King? Did he say we are not a Christian nation? Is all this a really bad dream where the thousands of lives were given and 233 years invested to us to where we are headed today? If ever in history it has been needed more then show me…Until then, please GOD BLESS ANERICA.",
        "intTime": 20090427,
        "postID": 34,
        "quote": "",
        "reply": "Interesting as I read this story history comes back to haunt me. Why does Dec 07, 1941 come into my memory? The USA scoffed at the Japanese Navy and their ability to successfully reach the assets of the USA, meaning Pearl Harbor. We were remiss once, shame on us, remiss twice, we will be history as we know it today. We can never throw caution to the wind, never underestimate another country (as 9/11 showed us) and believe only ½ what we can see. The instant we don’t keep our guard up and our powder dry, we will be talking a different language. Kinda like what is slowly happening today…Spanish becoming the predominate language and we just sit and allow it to happen. We are even facilitating it!! Can we as a nation really be that asleep at the wheel? Is our head really stuck that deep in the sand that we are oblivious to what is happening at our Southern Boarder and in our Nations Capitol? Did our Leader really bow to another nations King? Did he say we are not a Christian nation? Is all this a really bad dream where the thousands of lives were given and 233 years invested to us to where we are headed today? If ever in history it has been needed more then show me…Until then, please GOD BLESS ANERICA.",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-27 08:00:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "F22Flighttester"
    },
    {
        "content": "It's also true that we cannot go spending ourselves into oblivion by seeing every potential rival as the next Japan. That is an equally misguided way of thinking and can be harmful as well.",
        "intTime": 20090427,
        "postID": 35,
        "quote": "",
        "reply": "It's also true that we cannot go spending ourselves into oblivion by seeing every potential rival as the next Japan. That is an equally misguided way of thinking and can be harmful as well.",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-27 08:41:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by Bleah: We need aircraft carriers to effectively field a high performance jet in that region. China does not. We have our fleet spread out all over the world. China does not. We have to transit choke points. China has to close them. We are far from the battlespace. China is close. The real crux of all of this is that we are vulnerable (as pertains to this conversation), and China is not. They do not want a world-spanning super-navy to challenge ours; rather, they want a world class regional navy that can stop ours from achieving our objectives in a small defined area. They are doing a damned good job of that - in fact, my guess is that the only thing preventing them from temporary parity/superiority is their training and doctrine. Refusal to see China as an emerging naval power that can threaten our regional superiority is wishful thinking. Already past the future",
        "intTime": 20090427,
        "postID": 36,
        "quote": "Originally posted by Bleah: We need aircraft carriers to effectively field a high performance jet in that region. China does not. We have our fleet spread out all over the world. China does not. We have to transit choke points. China has to close them. We are far from the battlespace. China is close. The real crux of all of this is that we are vulnerable (as pertains to this conversation), and China is not. They do not want a world-spanning super-navy to challenge ours; rather, they want a world class regional navy that can stop ours from achieving our objectives in a small defined area. They are doing a damned good job of that - in fact, my guess is that the only thing preventing them from temporary parity/superiority is their training and doctrine. Refusal to see China as an emerging naval power that can threaten our regional superiority is wishful thinking.",
        "reply": " Already past the future",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-27 16:27:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "6486143"
    },
    {
        "content": "quote: Originally posted by Bill_Fold: RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger. You can still bleed to death from a nasty papercut Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090427,
        "postID": 37,
        "quote": "Originally posted by Bill_Fold: RE: http://www.military.com/forums/0,15240,189740,00.html Funny, but so many other people said the exact same things a few days ago when this story first broke, including me. The Chinese Navy is a paper Tiger.",
        "reply": " You can still bleed to death from a nasty papercut Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-27 16:29:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "L0A1"
    },
    {
        "content": "Most non-military serving newspaper journalists and Hollywood actors would not know a Battleship from a rowboat. Does anyone have a lead on a story I barely heard about Turkey building parts for the F22 with Chinese parts that make the aircraft vulnerable? If true that is the most idiotic thing I have ever heard of...allowing the enemy to build parts of your weapons system. Let me know where I can read the lowdown on this so I will be actually informed. Tell me it ain't true!",
        "intTime": 20090427,
        "postID": 38,
        "quote": "",
        "reply": "Most non-military serving newspaper journalists and Hollywood actors would not know a Battleship from a rowboat. Does anyone have a lead on a story I barely heard about Turkey building parts for the F22 with Chinese parts that make the aircraft vulnerable? If true that is the most idiotic thing I have ever heard of...allowing the enemy to build parts of your weapons system. Let me know where I can read the lowdown on this so I will be actually informed. Tell me it ain't true!",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-27 17:07:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "BigTBird"
    },
    {
        "content": "Most Military personel don`t know that even when the air has been nuteralized by solar flares or ionized by bombs so electricity cannot flow....the coal burrning Battleships of the Great White Fleet will be fully operational and still keep comming !! They had it right the first time !!",
        "intTime": 20090427,
        "postID": 39,
        "quote": "",
        "reply": "Most Military personel don`t know that even when the air has been nuteralized by solar flares or ionized by bombs so electricity cannot flow....the coal burrning Battleships of the Great White Fleet will be fully operational and still keep comming !! They had it right the first time !!",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-27 17:22:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "OddBall1st"
    },
    {
        "content": "quote: Originally posted by Bleah: We need aircraft carriers to effectively field a high performance jet in that region. China does not. We have our fleet spread out all over the world. China does not. We have to transit choke points. China has to close them. We are far from the battlespace. China is close. The real crux of all of this is that we are vulnerable (as pertains to this conversation), and China is not. They do not want a world-spanning super-navy to challenge ours; rather, they want a world class regional navy that can stop ours from achieving our objectives in a small defined area. They are doing a damned good job of that - in fact, my guess is that the only thing preventing them from temporary parity/superiority is their training and doctrine. Refusal to see China as an emerging naval power that can threaten our regional superiority is wishful thinking. They have a Secret Weapon we have no control over, cannot reason with, or counter. O.B.A.M.A.. They are the lender, We are the borrower. They can raise the interest. They can raise the rent. They can cash in.",
        "intTime": 20090427,
        "postID": 40,
        "quote": "Originally posted by Bleah: We need aircraft carriers to effectively field a high performance jet in that region. China does not. We have our fleet spread out all over the world. China does not. We have to transit choke points. China has to close them. We are far from the battlespace. China is close. The real crux of all of this is that we are vulnerable (as pertains to this conversation), and China is not. They do not want a world-spanning super-navy to challenge ours; rather, they want a world class regional navy that can stop ours from achieving our objectives in a small defined area. They are doing a damned good job of that - in fact, my guess is that the only thing preventing them from temporary parity/superiority is their training and doctrine. Refusal to see China as an emerging naval power that can threaten our regional superiority is wishful thinking.",
        "reply": " They have a Secret Weapon we have no control over, cannot reason with, or counter. O.B.A.M.A.. They are the lender, We are the borrower. They can raise the interest. They can raise the rent. They can cash in.",
        "threadID": "672198221_8770027122001",
        "time": "2009-04-27 17:46:00",
        "title": "Chinese Navy - Paper Tiger",
        "userID": "AngryPuppy"
    }
]