[
    {
        "content": "RE: http://www.military.com/forums/0,15240,188987,00.html how in the hell is israel supporting Russia???? arent they our allies?..", 
        "intTime": 20090413, 
        "postID": 1, 
        "quote": "", 
        "reply": "RE: http://www.military.com/forums/0,15240,188987,00.html how in the hell is israel supporting Russia???? arent they our allies?..", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-13 14:52:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "bogotano"
    }, 
    {
        "content": "I am thinking Israel got some good details on the schematics of the nuke plants in Iran. That way when Iran loses the reactors Russia can start selling Iran more supplies ($$$) and Israel can show it can still mess up the Arabs (and Persians) countries.", 
        "intTime": 20090413, 
        "postID": 2, 
        "quote": "", 
        "reply": "I am thinking Israel got some good details on the schematics of the nuke plants in Iran. That way when Iran loses the reactors Russia can start selling Iran more supplies ($$$) and Israel can show it can still mess up the Arabs (and Persians) countries.", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-13 15:54:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "cdsteer"
    }, 
    {
        "content": "I don't think the word \"ally\" exists in the Yiddish/Hebraic languages. Israel is our \"ally\" only insofar as Israel's interests are served. Israel loves our monetary gifts, they love us when we fight their enemies for them, they love all the free military toys we give to them that they use to slaughter Palestinians, and they love us when we veto UN sanctions against their barbarism. At the same time they spy against us, are ungrateful toward us, and even murder our sailors in a blatant act of war, all the while spitting in our faces. Israel has no true allies, nor does she care to have allies. What has Israel ever done for the United States? Israel is a pariah among the world's nations.", 
        "intTime": 20090413, 
        "postID": 3, 
        "quote": "", 
        "reply": "I don't think the word \"ally\" exists in the Yiddish/Hebraic languages. Israel is our \"ally\" only insofar as Israel's interests are served. Israel loves our monetary gifts, they love us when we fight their enemies for them, they love all the free military toys we give to them that they use to slaughter Palestinians, and they love us when we veto UN sanctions against their barbarism. At the same time they spy against us, are ungrateful toward us, and even murder our sailors in a blatant act of war, all the while spitting in our faces. Israel has no true allies, nor does she care to have allies. What has Israel ever done for the United States? Israel is a pariah among the world's nations.", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-13 15:59:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "Misanthrope2"
    }, 
    {
        "content": "Gee - it seems like even the Russkies want to buy stuff that works Of course, maybe all the russians are doing is a reverse engineering scam similar to what the Chinese have been doing to them.", 
        "intTime": 20090413, 
        "postID": 4, 
        "quote": "", 
        "reply": "Gee - it seems like even the Russkies want to buy stuff that works Of course, maybe all the russians are doing is a reverse engineering scam similar to what the Chinese have been doing to them.", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-13 16:00:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "PolicyWonk"
    }, 
    {
        "content": "quote: Originally posted by Misanthrope2: I don't think the word \"ally\" exists in the Yiddish/Hebraic languages. Israel is our \"ally\" only insofar as Israel's interests are served. Israel loves our monetary gifts, they love us when we fight their enemies for them, they love all the free military toys we give to them that they use to slaughter Palestinians, and they love us when we veto UN sanctions against their barbarism. At the same time they spy against us, are ungrateful toward us, and even murder our sailors in a blatant act of war, all the while spitting in our faces. Israel has no true allies, nor does she care to have allies. What has Israel ever done for the United States? Israel is a pariah among the world's nations. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090413, 
        "postID": 5, 
        "quote": "Originally posted by Misanthrope2: I don't think the word \"ally\" exists in the Yiddish/Hebraic languages. Israel is our \"ally\" only insofar as Israel's interests are served. Israel loves our monetary gifts, they love us when we fight their enemies for them, they love all the free military toys we give to them that they use to slaughter Palestinians, and they love us when we veto UN sanctions against their barbarism. At the same time they spy against us, are ungrateful toward us, and even murder our sailors in a blatant act of war, all the while spitting in our faces. Israel has no true allies, nor does she care to have allies. What has Israel ever done for the United States? Israel is a pariah among the world's nations.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-13 16:17:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "NSNN"
    }, 
    {
        "content": "The sound of a shekel is motivation enough to make a deal...", 
        "intTime": 20090413, 
        "postID": 6, 
        "quote": "", 
        "reply": "The sound of a shekel is motivation enough to make a deal...", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-13 16:27:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by PolicyWonk: Gee - it seems like even the Russkies want to buy stuff that works Of course, maybe all the russians are doing is a reverse engineering scam similar to what the Chinese have been doing to them. actually, Israel sold them with full knowledge that Russia would do just that. Full tech transfer is included in the deal. Russian military leaders have been unsuccessful in getting funding to develop their own miniaturized UAVs until they seen how Georgia was able to get good intel using their own Israeli made UAVs. Now they simply dont want long lead times in developing their won and want to use the Israeli ones to demonstrate all the cool things that can be done with them.", 
        "intTime": 20090413, 
        "postID": 7, 
        "quote": "Originally posted by PolicyWonk: Gee - it seems like even the Russkies want to buy stuff that works Of course, maybe all the russians are doing is a reverse engineering scam similar to what the Chinese have been doing to them.", 
        "reply": " actually, Israel sold them with full knowledge that Russia would do just that. Full tech transfer is included in the deal. Russian military leaders have been unsuccessful in getting funding to develop their own miniaturized UAVs until they seen how Georgia was able to get good intel using their own Israeli made UAVs. Now they simply dont want long lead times in developing their won and want to use the Israeli ones to demonstrate all the cool things that can be done with them.", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-13 17:30:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Dumb,dumb,dumb whats next? Bombs", 
        "intTime": 20090413, 
        "postID": 8, 
        "quote": "", 
        "reply": "Dumb,dumb,dumb whats next? Bombs", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-13 20:43:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "20529853"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Misanthrope2: I don't think the word \"ally\" exists in the Yiddish/Hebraic languages. Israel is our \"ally\" only insofar as Israel's interests are served. Israel loves our monetary gifts, they love us when we fight their enemies for them, they love all the free military toys we give to them that they use to slaughter Palestinians, and they love us when we veto UN sanctions against their barbarism. At the same time they spy against us, are ungrateful toward us, and even murder our sailors in a blatant act of war, all the while spitting in our faces. Israel has no true allies, nor does she care to have allies. What has Israel ever done for the United States? Israel is a pariah among the world's nations. To both of you and to Irwin R Schwester. We have sold the planes to Russia in an effort to persuade them not to sell the AA missiles to Iran. So much for your empty accusations, and your petty bashing. You three are Pathetic, and in case of Misanthrope antisemitic as well. In case that you think that i choose to bash Misanthrope for being anti Israel, you are wrong. Misantrope believes that Protocols of Elders of Zion are REAL. link Misantrope: \"Sorry to disappoint you. I believe the Protocols are authentic. That doesn't make me an evil person. I don't wear armbands and do not belong to a militia. Hope you don't label me. I will not discuss the Protocols any further on this forum since it would get nasty.\"", 
        "intTime": 20090414, 
        "postID": 9, 
        "quote": "Originally posted by NSNN: quote: Originally posted by Misanthrope2: I don't think the word \"ally\" exists in the Yiddish/Hebraic languages. Israel is our \"ally\" only insofar as Israel's interests are served. Israel loves our monetary gifts, they love us when we fight their enemies for them, they love all the free military toys we give to them that they use to slaughter Palestinians, and they love us when we veto UN sanctions against their barbarism. At the same time they spy against us, are ungrateful toward us, and even murder our sailors in a blatant act of war, all the while spitting in our faces. Israel has no true allies, nor does she care to have allies. What has Israel ever done for the United States? Israel is a pariah among the world's nations.", 
        "reply": " To both of you and to Irwin R Schwester. We have sold the planes to Russia in an effort to persuade them not to sell the AA missiles to Iran. So much for your empty accusations, and your petty bashing. You three are Pathetic, and in case of Misanthrope antisemitic as well. In case that you think that i choose to bash Misanthrope for being anti Israel, you are wrong. Misantrope believes that Protocols of Elders of Zion are REAL. link Misantrope: \"Sorry to disappoint you. I believe the Protocols are authentic. That doesn't make me an evil person. I don't wear armbands and do not belong to a militia. Hope you don't label me. I will not discuss the Protocols any further on this forum since it would get nasty.\"", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 00:04:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "It could be they are going to do a little pirate hunting them selves, it would be good training.", 
        "intTime": 20090414, 
        "postID": 10, 
        "quote": "", 
        "reply": "It could be they are going to do a little pirate hunting them selves, it would be good training.", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 00:35:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "BAMBOOVIPER"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: To both of you and to Irwin R Schwester. We have sold the planes to Russia in an effort to persuade them not to sell the AA missiles to Iran. So much for your empty accusations, and your petty bashing. You three are Pathetic, and in case of Misanthrope antisemitic as well. In case that you think that i choose to bash Misanthrope for being anti Israel, you are wrong. Misantrope believes that Protocols of Elders of Zion are REAL. link Misantrope: \"Sorry to disappoint you. I believe the Protocols are authentic. That doesn't make me an evil person. I don't wear armbands and do not belong to a militia. Hope you don't label me. I will not discuss the Protocols any further on this forum since it would get nasty.\" TAHKMACTEP: Greetings! I am vehemently opposed to US military involvement in Iraq, Afghanistan and Pakistan, but that does not make me anti-American. One can be anti-Muslim, anti-Arab, anti-whatever, and it's quite acceptable. However, when one speaks out against Israel, one is automatically labeled anti-semitic, and that is cause for wailing and gnashing of teeth in your world. Like it or not, it's not \"yet\" a crime in the US to be anti-semitic. However, once pending hate-crime legislation is passed, it will then become a thought-crime to express anti-Israel views in this country. I'm impressed that you have saved my post from awhile back. That post was in response to \"OldMole\" expressing disappoint in me when I stated that I believed the Protocols were genuine. IMO, OldMole ranked in the top 2 or 3 posters ever on this forum. I deeply respected him and miss his words of wisdom. BTW, if I were to call another poster \"pathetic\", I'm sure I would be warned by the Mods. You'll probably get a pass.", 
        "intTime": 20090414, 
        "postID": 11, 
        "quote": "Originally posted by PanzerMeister: To both of you and to Irwin R Schwester. We have sold the planes to Russia in an effort to persuade them not to sell the AA missiles to Iran. So much for your empty accusations, and your petty bashing. You three are Pathetic, and in case of Misanthrope antisemitic as well. In case that you think that i choose to bash Misanthrope for being anti Israel, you are wrong. Misantrope believes that Protocols of Elders of Zion are REAL. link Misantrope: \"Sorry to disappoint you. I believe the Protocols are authentic. That doesn't make me an evil person. I don't wear armbands and do not belong to a militia. Hope you don't label me. I will not discuss the Protocols any further on this forum since it would get nasty.\"", 
        "reply": " TAHKMACTEP: Greetings! I am vehemently opposed to US military involvement in Iraq, Afghanistan and Pakistan, but that does not make me anti-American. One can be anti-Muslim, anti-Arab, anti-whatever, and it's quite acceptable. However, when one speaks out against Israel, one is automatically labeled anti-semitic, and that is cause for wailing and gnashing of teeth in your world. Like it or not, it's not \"yet\" a crime in the US to be anti-semitic. However, once pending hate-crime legislation is passed, it will then become a thought-crime to express anti-Israel views in this country. I'm impressed that you have saved my post from awhile back. That post was in response to \"OldMole\" expressing disappoint in me when I stated that I believed the Protocols were genuine. IMO, OldMole ranked in the top 2 or 3 posters ever on this forum. I deeply respected him and miss his words of wisdom. BTW, if I were to call another poster \"pathetic\", I'm sure I would be warned by the Mods. You'll probably get a pass.", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 03:27:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "Misanthrope2"
    }, 
    {
        "content": "Misanthrope: Posts of NSNN and IRS were pathetic, because they completely ignored other available sources, ignored the international situation, and rushed to make a comment. Usual NSNN behavior. Petty bashing at its finest. As for you, i have explained quite clearly why i consider you to be a judo-phobe. If you believe the crap which Elders of Zion sell, than you ARE a judo-phobe. It has nothing to do with your Anti-Israel views. If you had not noted i don't label NSNN as one, despite what he says. Just in order that we will be clear what you are believing in: \"http://en.wikipedia.org/wiki/The_Protocols_of_the_Elders_of_Zion\" Read it, and explain to me what label (if any) deserves someone that believes this crap.", 
        "intTime": 20090414, 
        "postID": 12, 
        "quote": "", 
        "reply": "Misanthrope: Posts of NSNN and IRS were pathetic, because they completely ignored other available sources, ignored the international situation, and rushed to make a comment. Usual NSNN behavior. Petty bashing at its finest. As for you, i have explained quite clearly why i consider you to be a judo-phobe. If you believe the crap which Elders of Zion sell, than you ARE a judo-phobe. It has nothing to do with your Anti-Israel views. If you had not noted i don't label NSNN as one, despite what he says. Just in order that we will be clear what you are believing in: \"http://en.wikipedia.org/wiki/The_Protocols_of_the_Elders_of_Zion\" Read it, and explain to me what label (if any) deserves someone that believes this crap.", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 03:40:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "What do elderly zionists and those with an unreasonable fear of a Japanese martial art have to do with the Russians buying glorified radio control models? Nither one, I'd bet, was on the sales team. Let's try to stay on topic.", 
        "intTime": 20090414, 
        "postID": 13, 
        "quote": "", 
        "reply": "What do elderly zionists and those with an unreasonable fear of a Japanese martial art have to do with the Russians buying glorified radio control models? Nither one, I'd bet, was on the sales team. Let's try to stay on topic.", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 05:18:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: We have sold the planes to Russia in an effort to persuade them not to sell the AA missiles to Iran. Russians are apparently getting a lot of play out of those S-300 systems.....first we scrap the ABM shield in E. Europe, and now Israel is selling sensitive equipment for the same purpose!Right...... Of the top of my head: - In 2002 Isreali Python 3 missiles photographed under the wings of Chinese F-8 fighters - F-10 multi-role fighter, is an almost identical version to the Lavi (joint Israeli-American design based upon the F-16 for manufacture in Israel, but financed mostly with American aid. $1.5 bilion to be exact) - in 1997 Iraq had deployed Israeli-developed, Chinese PL-8 missiles in the no-fly zones - in 2000 Israel tryes to sell the advanced Phalcon airborne radar to China! Drops it only after US Gov. finnaly shows some backbone..... ......and many more! I’m dying to hear your excuses for the above weapons sales/transfers. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090414, 
        "postID": 14, 
        "quote": "Originally posted by PanzerMeister: We have sold the planes to Russia in an effort to persuade them not to sell the AA missiles to Iran. Russians are apparently getting a lot of play out of those S-300 systems.....first we scrap the ABM shield in E. Europe, and now Israel is selling sensitive equipment for the same purpose!Right......", 
        "reply": " Of the top of my head: - In 2002 Isreali Python 3 missiles photographed under the wings of Chinese F-8 fighters - F-10 multi-role fighter, is an almost identical version to the Lavi (joint Israeli-American design based upon the F-16 for manufacture in Israel, but financed mostly with American aid. $1.5 bilion to be exact) - in 1997 Iraq had deployed Israeli-developed, Chinese PL-8 missiles in the no-fly zones - in 2000 Israel tryes to sell the advanced Phalcon airborne radar to China! Drops it only after US Gov. finnaly shows some backbone..... ......and many more! I’m dying to hear your excuses for the above weapons sales/transfers. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 05:24:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "NSNN"
    }, 
    {
        "content": "I do not have any excuses for technology transfer to China. I have stated many time previously that the only explanation for it is Israeli stupidity. Stop searching for something to bash me with, because you will be hard pressed to find anything useful. Our logic in selling the planes to Russians is as follows: We sell them the planes, and Russians will not (hopefully) sell AA missiles to Iran. It is very hard to understand, bu give it a try.", 
        "intTime": 20090414, 
        "postID": 15, 
        "quote": "", 
        "reply": "I do not have any excuses for technology transfer to China. I have stated many time previously that the only explanation for it is Israeli stupidity. Stop searching for something to bash me with, because you will be hard pressed to find anything useful. Our logic in selling the planes to Russians is as follows: We sell them the planes, and Russians will not (hopefully) sell AA missiles to Iran. It is very hard to understand, bu give it a try.", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 05:31:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "The Russians will reverse engineer them. The Israeli's are making money off of selling weaponry, tech. to potential enemies. I think we better take a hard look at our relations with Israel. Iam pro-Israeli, but not at my country's expense. The Chinese are stealing, dealing for watever Western tech they can get. Why is our \"ally\" helping them?", 
        "intTime": 20090414, 
        "postID": 16, 
        "quote": "", 
        "reply": "The Russians will reverse engineer them. The Israeli's are making money off of selling weaponry, tech. to potential enemies. I think we better take a hard look at our relations with Israel. Iam pro-Israeli, but not at my country's expense. The Chinese are stealing, dealing for watever Western tech they can get. Why is our \"ally\" helping them?", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 05:38:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "RHYNO506"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: I do not have any excuses for technology transfer to China. I have stated many time previously that the only explanation for it is Israeli stupidity. Stop searching for something to bash me with, because you will be hard pressed to find anything useful. Israel reverse engineering our (sensitive) military equipment and passing it on to our potential adversaries is hardly “useless” to me! Our logic in selling the planes to Russians is as follows: We sell them the planes, and Russians will not (hopefully) sell AA missiles to Iran. Russia has already pledged that it will not sell the S-300 to Iran if we scraped the ABM shield (which we most likely will)! Talk about completely ignoring other available sources, the international situation, and rushing to make a comment! It is very hard to understand, bu give it a try. I’ll help you explain ALL of those sales.....plain and simple: $$$$$$$! Or as Irwin eloquently put it “The sound of a shekel is motivation enough!” \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090414, 
        "postID": 17, 
        "quote": "Originally posted by PanzerMeister: I do not have any excuses for technology transfer to China. I have stated many time previously that the only explanation for it is Israeli stupidity. Stop searching for something to bash me with, because you will be hard pressed to find anything useful. Israel reverse engineering our (sensitive) military equipment and passing it on to our potential adversaries is hardly “useless” to me! Our logic in selling the planes to Russians is as follows: We sell them the planes, and Russians will not (hopefully) sell AA missiles to Iran. Russia has already pledged that it will not sell the S-300 to Iran if we scraped the ABM shield (which we most likely will)! Talk about completely ignoring other available sources, the international situation, and rushing to make a comment! It is very hard to understand, bu give it a try.", 
        "reply": " I’ll help you explain ALL of those sales.....plain and simple: $$$$$$$! Or as Irwin eloquently put it “The sound of a shekel is motivation enough!” \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 05:40:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "NSNN"
    }, 
    {
        "content": "\"http://news.walla.co.il/?w=/9/1468149\". Dashing all your hopes for a successful bash. It is in Hebrew. Short summary: \"We sell them the planes, and Russians will not (hopefully) sell AA missiles to Iran. Meanwhile Russia does not say yes or no to Israel regarding the deal with Iran\".", 
        "intTime": 20090414, 
        "postID": 18, 
        "quote": "", 
        "reply": "\"http://news.walla.co.il/?w=/9/1468149\". Dashing all your hopes for a successful bash. It is in Hebrew. Short summary: \"We sell them the planes, and Russians will not (hopefully) sell AA missiles to Iran. Meanwhile Russia does not say yes or no to Israel regarding the deal with Iran\".", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 06:15:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "Putin ...Don`t like Iran or N.Korea...and they know it !!", 
        "intTime": 20090414, 
        "postID": 19, 
        "quote": "", 
        "reply": "Putin ...Don`t like Iran or N.Korea...and they know it !!", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 06:34:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/9/1468149\". Dashing all your hopes for a successful bash. It is in Hebrew. Short summary: \"We sell them the planes, and Russians will not (hopefully) sell AA missiles to Iran. Meanwhile Russia does not say yes or no to Israel regarding the deal with Iran\". \"Hopefully???\"", 
        "intTime": 20090414, 
        "postID": 20, 
        "quote": "Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/9/1468149\". Dashing all your hopes for a successful bash. It is in Hebrew. Short summary: \"We sell them the planes, and Russians will not (hopefully) sell AA missiles to Iran. Meanwhile Russia does not say yes or no to Israel regarding the deal with Iran\".", 
        "reply": " \"Hopefully???\"", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 07:09:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "Motive25"
    }, 
    {
        "content": "RE: http://www.military.com/forums/0,15240,188987,00.html how in the hell is israel supporting Russia???? arent they our allies?..", 
        "intTime": 20090413, 
        "postID": 21, 
        "quote": "", 
        "reply": "RE: http://www.military.com/forums/0,15240,188987,00.html how in the hell is israel supporting Russia???? arent they our allies?..", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-13 14:52:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "bogotano"
    }, 
    {
        "content": "I am thinking Israel got some good details on the schematics of the nuke plants in Iran. That way when Iran loses the reactors Russia can start selling Iran more supplies ($$$) and Israel can show it can still mess up the Arabs (and Persians) countries.", 
        "intTime": 20090413, 
        "postID": 22, 
        "quote": "", 
        "reply": "I am thinking Israel got some good details on the schematics of the nuke plants in Iran. That way when Iran loses the reactors Russia can start selling Iran more supplies ($$$) and Israel can show it can still mess up the Arabs (and Persians) countries.", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-13 15:54:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "cdsteer"
    }, 
    {
        "content": "I don't think the word \"ally\" exists in the Yiddish/Hebraic languages. Israel is our \"ally\" only insofar as Israel's interests are served. Israel loves our monetary gifts, they love us when we fight their enemies for them, they love all the free military toys we give to them that they use to slaughter Palestinians, and they love us when we veto UN sanctions against their barbarism. At the same time they spy against us, are ungrateful toward us, and even murder our sailors in a blatant act of war, all the while spitting in our faces. Israel has no true allies, nor does she care to have allies. What has Israel ever done for the United States? Israel is a pariah among the world's nations.", 
        "intTime": 20090413, 
        "postID": 23, 
        "quote": "", 
        "reply": "I don't think the word \"ally\" exists in the Yiddish/Hebraic languages. Israel is our \"ally\" only insofar as Israel's interests are served. Israel loves our monetary gifts, they love us when we fight their enemies for them, they love all the free military toys we give to them that they use to slaughter Palestinians, and they love us when we veto UN sanctions against their barbarism. At the same time they spy against us, are ungrateful toward us, and even murder our sailors in a blatant act of war, all the while spitting in our faces. Israel has no true allies, nor does she care to have allies. What has Israel ever done for the United States? Israel is a pariah among the world's nations.", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-13 15:59:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "Misanthrope2"
    }, 
    {
        "content": "Gee - it seems like even the Russkies want to buy stuff that works Of course, maybe all the russians are doing is a reverse engineering scam similar to what the Chinese have been doing to them.", 
        "intTime": 20090413, 
        "postID": 24, 
        "quote": "", 
        "reply": "Gee - it seems like even the Russkies want to buy stuff that works Of course, maybe all the russians are doing is a reverse engineering scam similar to what the Chinese have been doing to them.", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-13 16:00:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "PolicyWonk"
    }, 
    {
        "content": "quote: Originally posted by Misanthrope2: I don't think the word \"ally\" exists in the Yiddish/Hebraic languages. Israel is our \"ally\" only insofar as Israel's interests are served. Israel loves our monetary gifts, they love us when we fight their enemies for them, they love all the free military toys we give to them that they use to slaughter Palestinians, and they love us when we veto UN sanctions against their barbarism. At the same time they spy against us, are ungrateful toward us, and even murder our sailors in a blatant act of war, all the while spitting in our faces. Israel has no true allies, nor does she care to have allies. What has Israel ever done for the United States? Israel is a pariah among the world's nations. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090413, 
        "postID": 25, 
        "quote": "Originally posted by Misanthrope2: I don't think the word \"ally\" exists in the Yiddish/Hebraic languages. Israel is our \"ally\" only insofar as Israel's interests are served. Israel loves our monetary gifts, they love us when we fight their enemies for them, they love all the free military toys we give to them that they use to slaughter Palestinians, and they love us when we veto UN sanctions against their barbarism. At the same time they spy against us, are ungrateful toward us, and even murder our sailors in a blatant act of war, all the while spitting in our faces. Israel has no true allies, nor does she care to have allies. What has Israel ever done for the United States? Israel is a pariah among the world's nations.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-13 16:17:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "NSNN"
    }, 
    {
        "content": "The sound of a shekel is motivation enough to make a deal...", 
        "intTime": 20090413, 
        "postID": 26, 
        "quote": "", 
        "reply": "The sound of a shekel is motivation enough to make a deal...", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-13 16:27:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by PolicyWonk: Gee - it seems like even the Russkies want to buy stuff that works Of course, maybe all the russians are doing is a reverse engineering scam similar to what the Chinese have been doing to them. actually, Israel sold them with full knowledge that Russia would do just that. Full tech transfer is included in the deal. Russian military leaders have been unsuccessful in getting funding to develop their own miniaturized UAVs until they seen how Georgia was able to get good intel using their own Israeli made UAVs. Now they simply dont want long lead times in developing their won and want to use the Israeli ones to demonstrate all the cool things that can be done with them.", 
        "intTime": 20090413, 
        "postID": 27, 
        "quote": "Originally posted by PolicyWonk: Gee - it seems like even the Russkies want to buy stuff that works Of course, maybe all the russians are doing is a reverse engineering scam similar to what the Chinese have been doing to them.", 
        "reply": " actually, Israel sold them with full knowledge that Russia would do just that. Full tech transfer is included in the deal. Russian military leaders have been unsuccessful in getting funding to develop their own miniaturized UAVs until they seen how Georgia was able to get good intel using their own Israeli made UAVs. Now they simply dont want long lead times in developing their won and want to use the Israeli ones to demonstrate all the cool things that can be done with them.", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-13 17:30:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Dumb,dumb,dumb whats next? Bombs", 
        "intTime": 20090413, 
        "postID": 28, 
        "quote": "", 
        "reply": "Dumb,dumb,dumb whats next? Bombs", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-13 20:43:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "20529853"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Misanthrope2: I don't think the word \"ally\" exists in the Yiddish/Hebraic languages. Israel is our \"ally\" only insofar as Israel's interests are served. Israel loves our monetary gifts, they love us when we fight their enemies for them, they love all the free military toys we give to them that they use to slaughter Palestinians, and they love us when we veto UN sanctions against their barbarism. At the same time they spy against us, are ungrateful toward us, and even murder our sailors in a blatant act of war, all the while spitting in our faces. Israel has no true allies, nor does she care to have allies. What has Israel ever done for the United States? Israel is a pariah among the world's nations. To both of you and to Irwin R Schwester. We have sold the planes to Russia in an effort to persuade them not to sell the AA missiles to Iran. So much for your empty accusations, and your petty bashing. You three are Pathetic, and in case of Misanthrope antisemitic as well. In case that you think that i choose to bash Misanthrope for being anti Israel, you are wrong. Misantrope believes that Protocols of Elders of Zion are REAL. link Misantrope: \"Sorry to disappoint you. I believe the Protocols are authentic. That doesn't make me an evil person. I don't wear armbands and do not belong to a militia. Hope you don't label me. I will not discuss the Protocols any further on this forum since it would get nasty.\"", 
        "intTime": 20090414, 
        "postID": 29, 
        "quote": "Originally posted by NSNN: quote: Originally posted by Misanthrope2: I don't think the word \"ally\" exists in the Yiddish/Hebraic languages. Israel is our \"ally\" only insofar as Israel's interests are served. Israel loves our monetary gifts, they love us when we fight their enemies for them, they love all the free military toys we give to them that they use to slaughter Palestinians, and they love us when we veto UN sanctions against their barbarism. At the same time they spy against us, are ungrateful toward us, and even murder our sailors in a blatant act of war, all the while spitting in our faces. Israel has no true allies, nor does she care to have allies. What has Israel ever done for the United States? Israel is a pariah among the world's nations.", 
        "reply": " To both of you and to Irwin R Schwester. We have sold the planes to Russia in an effort to persuade them not to sell the AA missiles to Iran. So much for your empty accusations, and your petty bashing. You three are Pathetic, and in case of Misanthrope antisemitic as well. In case that you think that i choose to bash Misanthrope for being anti Israel, you are wrong. Misantrope believes that Protocols of Elders of Zion are REAL. link Misantrope: \"Sorry to disappoint you. I believe the Protocols are authentic. That doesn't make me an evil person. I don't wear armbands and do not belong to a militia. Hope you don't label me. I will not discuss the Protocols any further on this forum since it would get nasty.\"", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 00:04:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "It could be they are going to do a little pirate hunting them selves, it would be good training.", 
        "intTime": 20090414, 
        "postID": 30, 
        "quote": "", 
        "reply": "It could be they are going to do a little pirate hunting them selves, it would be good training.", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 00:35:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "BAMBOOVIPER"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: To both of you and to Irwin R Schwester. We have sold the planes to Russia in an effort to persuade them not to sell the AA missiles to Iran. So much for your empty accusations, and your petty bashing. You three are Pathetic, and in case of Misanthrope antisemitic as well. In case that you think that i choose to bash Misanthrope for being anti Israel, you are wrong. Misantrope believes that Protocols of Elders of Zion are REAL. link Misantrope: \"Sorry to disappoint you. I believe the Protocols are authentic. That doesn't make me an evil person. I don't wear armbands and do not belong to a militia. Hope you don't label me. I will not discuss the Protocols any further on this forum since it would get nasty.\" TAHKMACTEP: Greetings! I am vehemently opposed to US military involvement in Iraq, Afghanistan and Pakistan, but that does not make me anti-American. One can be anti-Muslim, anti-Arab, anti-whatever, and it's quite acceptable. However, when one speaks out against Israel, one is automatically labeled anti-semitic, and that is cause for wailing and gnashing of teeth in your world. Like it or not, it's not \"yet\" a crime in the US to be anti-semitic. However, once pending hate-crime legislation is passed, it will then become a thought-crime to express anti-Israel views in this country. I'm impressed that you have saved my post from awhile back. That post was in response to \"OldMole\" expressing disappoint in me when I stated that I believed the Protocols were genuine. IMO, OldMole ranked in the top 2 or 3 posters ever on this forum. I deeply respected him and miss his words of wisdom. BTW, if I were to call another poster \"pathetic\", I'm sure I would be warned by the Mods. You'll probably get a pass.", 
        "intTime": 20090414, 
        "postID": 31, 
        "quote": "Originally posted by PanzerMeister: To both of you and to Irwin R Schwester. We have sold the planes to Russia in an effort to persuade them not to sell the AA missiles to Iran. So much for your empty accusations, and your petty bashing. You three are Pathetic, and in case of Misanthrope antisemitic as well. In case that you think that i choose to bash Misanthrope for being anti Israel, you are wrong. Misantrope believes that Protocols of Elders of Zion are REAL. link Misantrope: \"Sorry to disappoint you. I believe the Protocols are authentic. That doesn't make me an evil person. I don't wear armbands and do not belong to a militia. Hope you don't label me. I will not discuss the Protocols any further on this forum since it would get nasty.\"", 
        "reply": " TAHKMACTEP: Greetings! I am vehemently opposed to US military involvement in Iraq, Afghanistan and Pakistan, but that does not make me anti-American. One can be anti-Muslim, anti-Arab, anti-whatever, and it's quite acceptable. However, when one speaks out against Israel, one is automatically labeled anti-semitic, and that is cause for wailing and gnashing of teeth in your world. Like it or not, it's not \"yet\" a crime in the US to be anti-semitic. However, once pending hate-crime legislation is passed, it will then become a thought-crime to express anti-Israel views in this country. I'm impressed that you have saved my post from awhile back. That post was in response to \"OldMole\" expressing disappoint in me when I stated that I believed the Protocols were genuine. IMO, OldMole ranked in the top 2 or 3 posters ever on this forum. I deeply respected him and miss his words of wisdom. BTW, if I were to call another poster \"pathetic\", I'm sure I would be warned by the Mods. You'll probably get a pass.", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 03:27:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "Misanthrope2"
    }, 
    {
        "content": "Misanthrope: Posts of NSNN and IRS were pathetic, because they completely ignored other available sources, ignored the international situation, and rushed to make a comment. Usual NSNN behavior. Petty bashing at its finest. As for you, i have explained quite clearly why i consider you to be a judo-phobe. If you believe the crap which Elders of Zion sell, than you ARE a judo-phobe. It has nothing to do with your Anti-Israel views. If you had not noted i don't label NSNN as one, despite what he says. Just in order that we will be clear what you are believing in: \"http://en.wikipedia.org/wiki/The_Protocols_of_the_Elders_of_Zion\" Read it, and explain to me what label (if any) deserves someone that believes this crap.", 
        "intTime": 20090414, 
        "postID": 32, 
        "quote": "", 
        "reply": "Misanthrope: Posts of NSNN and IRS were pathetic, because they completely ignored other available sources, ignored the international situation, and rushed to make a comment. Usual NSNN behavior. Petty bashing at its finest. As for you, i have explained quite clearly why i consider you to be a judo-phobe. If you believe the crap which Elders of Zion sell, than you ARE a judo-phobe. It has nothing to do with your Anti-Israel views. If you had not noted i don't label NSNN as one, despite what he says. Just in order that we will be clear what you are believing in: \"http://en.wikipedia.org/wiki/The_Protocols_of_the_Elders_of_Zion\" Read it, and explain to me what label (if any) deserves someone that believes this crap.", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 03:40:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "What do elderly zionists and those with an unreasonable fear of a Japanese martial art have to do with the Russians buying glorified radio control models? Nither one, I'd bet, was on the sales team. Let's try to stay on topic.", 
        "intTime": 20090414, 
        "postID": 33, 
        "quote": "", 
        "reply": "What do elderly zionists and those with an unreasonable fear of a Japanese martial art have to do with the Russians buying glorified radio control models? Nither one, I'd bet, was on the sales team. Let's try to stay on topic.", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 05:18:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: We have sold the planes to Russia in an effort to persuade them not to sell the AA missiles to Iran. Russians are apparently getting a lot of play out of those S-300 systems.....first we scrap the ABM shield in E. Europe, and now Israel is selling sensitive equipment for the same purpose!Right...... Of the top of my head: - In 2002 Isreali Python 3 missiles photographed under the wings of Chinese F-8 fighters - F-10 multi-role fighter, is an almost identical version to the Lavi (joint Israeli-American design based upon the F-16 for manufacture in Israel, but financed mostly with American aid. $1.5 bilion to be exact) - in 1997 Iraq had deployed Israeli-developed, Chinese PL-8 missiles in the no-fly zones - in 2000 Israel tryes to sell the advanced Phalcon airborne radar to China! Drops it only after US Gov. finnaly shows some backbone..... ......and many more! I’m dying to hear your excuses for the above weapons sales/transfers. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090414, 
        "postID": 34, 
        "quote": "Originally posted by PanzerMeister: We have sold the planes to Russia in an effort to persuade them not to sell the AA missiles to Iran. Russians are apparently getting a lot of play out of those S-300 systems.....first we scrap the ABM shield in E. Europe, and now Israel is selling sensitive equipment for the same purpose!Right......", 
        "reply": " Of the top of my head: - In 2002 Isreali Python 3 missiles photographed under the wings of Chinese F-8 fighters - F-10 multi-role fighter, is an almost identical version to the Lavi (joint Israeli-American design based upon the F-16 for manufacture in Israel, but financed mostly with American aid. $1.5 bilion to be exact) - in 1997 Iraq had deployed Israeli-developed, Chinese PL-8 missiles in the no-fly zones - in 2000 Israel tryes to sell the advanced Phalcon airborne radar to China! Drops it only after US Gov. finnaly shows some backbone..... ......and many more! I’m dying to hear your excuses for the above weapons sales/transfers. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 05:24:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "NSNN"
    }, 
    {
        "content": "I do not have any excuses for technology transfer to China. I have stated many time previously that the only explanation for it is Israeli stupidity. Stop searching for something to bash me with, because you will be hard pressed to find anything useful. Our logic in selling the planes to Russians is as follows: We sell them the planes, and Russians will not (hopefully) sell AA missiles to Iran. It is very hard to understand, bu give it a try.", 
        "intTime": 20090414, 
        "postID": 35, 
        "quote": "", 
        "reply": "I do not have any excuses for technology transfer to China. I have stated many time previously that the only explanation for it is Israeli stupidity. Stop searching for something to bash me with, because you will be hard pressed to find anything useful. Our logic in selling the planes to Russians is as follows: We sell them the planes, and Russians will not (hopefully) sell AA missiles to Iran. It is very hard to understand, bu give it a try.", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 05:31:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "The Russians will reverse engineer them. The Israeli's are making money off of selling weaponry, tech. to potential enemies. I think we better take a hard look at our relations with Israel. Iam pro-Israeli, but not at my country's expense. The Chinese are stealing, dealing for watever Western tech they can get. Why is our \"ally\" helping them?", 
        "intTime": 20090414, 
        "postID": 36, 
        "quote": "", 
        "reply": "The Russians will reverse engineer them. The Israeli's are making money off of selling weaponry, tech. to potential enemies. I think we better take a hard look at our relations with Israel. Iam pro-Israeli, but not at my country's expense. The Chinese are stealing, dealing for watever Western tech they can get. Why is our \"ally\" helping them?", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 05:38:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "RHYNO506"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: I do not have any excuses for technology transfer to China. I have stated many time previously that the only explanation for it is Israeli stupidity. Stop searching for something to bash me with, because you will be hard pressed to find anything useful. Israel reverse engineering our (sensitive) military equipment and passing it on to our potential adversaries is hardly “useless” to me! Our logic in selling the planes to Russians is as follows: We sell them the planes, and Russians will not (hopefully) sell AA missiles to Iran. Russia has already pledged that it will not sell the S-300 to Iran if we scraped the ABM shield (which we most likely will)! Talk about completely ignoring other available sources, the international situation, and rushing to make a comment! It is very hard to understand, bu give it a try. I’ll help you explain ALL of those sales.....plain and simple: $$$$$$$! Or as Irwin eloquently put it “The sound of a shekel is motivation enough!” \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090414, 
        "postID": 37, 
        "quote": "Originally posted by PanzerMeister: I do not have any excuses for technology transfer to China. I have stated many time previously that the only explanation for it is Israeli stupidity. Stop searching for something to bash me with, because you will be hard pressed to find anything useful. Israel reverse engineering our (sensitive) military equipment and passing it on to our potential adversaries is hardly “useless” to me! Our logic in selling the planes to Russians is as follows: We sell them the planes, and Russians will not (hopefully) sell AA missiles to Iran. Russia has already pledged that it will not sell the S-300 to Iran if we scraped the ABM shield (which we most likely will)! Talk about completely ignoring other available sources, the international situation, and rushing to make a comment! It is very hard to understand, bu give it a try.", 
        "reply": " I’ll help you explain ALL of those sales.....plain and simple: $$$$$$$! Or as Irwin eloquently put it “The sound of a shekel is motivation enough!” \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 05:40:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "NSNN"
    }, 
    {
        "content": "\"http://news.walla.co.il/?w=/9/1468149\". Dashing all your hopes for a successful bash. It is in Hebrew. Short summary: \"We sell them the planes, and Russians will not (hopefully) sell AA missiles to Iran. Meanwhile Russia does not say yes or no to Israel regarding the deal with Iran\".", 
        "intTime": 20090414, 
        "postID": 38, 
        "quote": "", 
        "reply": "\"http://news.walla.co.il/?w=/9/1468149\". Dashing all your hopes for a successful bash. It is in Hebrew. Short summary: \"We sell them the planes, and Russians will not (hopefully) sell AA missiles to Iran. Meanwhile Russia does not say yes or no to Israel regarding the deal with Iran\".", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 06:15:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "Putin ...Don`t like Iran or N.Korea...and they know it !!", 
        "intTime": 20090414, 
        "postID": 39, 
        "quote": "", 
        "reply": "Putin ...Don`t like Iran or N.Korea...and they know it !!", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 06:34:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "OddBall1st"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/9/1468149\". Dashing all your hopes for a successful bash. It is in Hebrew. Short summary: \"We sell them the planes, and Russians will not (hopefully) sell AA missiles to Iran. Meanwhile Russia does not say yes or no to Israel regarding the deal with Iran\". \"Hopefully???\"", 
        "intTime": 20090414, 
        "postID": 40, 
        "quote": "Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/9/1468149\". Dashing all your hopes for a successful bash. It is in Hebrew. Short summary: \"We sell them the planes, and Russians will not (hopefully) sell AA missiles to Iran. Meanwhile Russia does not say yes or no to Israel regarding the deal with Iran\".", 
        "reply": " \"Hopefully???\"", 
        "threadID": "672198221_2000036022001", 
        "time": "2009-04-14 07:09:00", 
        "title": "Russia Purchases Spy Planes From Israel", 
        "userID": "Motive25"
    }
]