[
    {
        "content": "Rep. Tom Rooney (R-FL) offers an amendment to a hate crimes bill to protect people who are targets of violent crime because of their military service. Rep. Debbie Wasserman Schultz (D-FL) responds. House Judiciary Committe - April 22, 2009 \"http://www.youtube.com/watch?v=dvFsVgiy9EA\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090424, 
        "postID": 1, 
        "quote": "", 
        "reply": "Rep. Tom Rooney (R-FL) offers an amendment to a hate crimes bill to protect people who are targets of violent crime because of their military service. Rep. Debbie Wasserman Schultz (D-FL) responds. House Judiciary Committe - April 22, 2009 \"http://www.youtube.com/watch?v=dvFsVgiy9EA\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-04-24 14:59:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "Anbar7"
    }, 
    {
        "content": "I hate hate crimes bills. Every crime is a hate crime.", 
        "intTime": 20090424, 
        "postID": 2, 
        "quote": "", 
        "reply": "I hate hate crimes bills. Every crime is a hate crime.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-04-24 15:02:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: I hate hate crimes bills. Every crime is a hate crime. Not so, some people kill or do it because they like it, it gives them a thrill, not just because they hate someone. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090424, 
        "postID": 3, 
        "quote": "Originally posted by mrmixitup: I hate hate crimes bills. Every crime is a hate crime.", 
        "reply": " Not so, some people kill or do it because they like it, it gives them a thrill, not just because they hate someone. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-04-24 15:04:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "Anbar7"
    }, 
    {
        "content": "My god, dont you know Veterans arent on the Approved list of those who can be targets of Hate.", 
        "intTime": 20090424, 
        "postID": 4, 
        "quote": "", 
        "reply": "My god, dont you know Veterans arent on the Approved list of those who can be targets of Hate.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-04-24 15:25:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: http://www.youtube.com/watch?v=dvFsVgiy9EA This is a simple question to be resolved. Just how many veterans are targeted for attack because they ARE Veterans? If such attacks are statistically above the norm for violent assualts then she is wrong, and he's right. If such attacks are more or less non existant - Who needs another law? Dave", 
        "intTime": 20090424, 
        "postID": 5, 
        "quote": "http://www.youtube.com/watch?v=dvFsVgiy9EA", 
        "reply": " This is a simple question to be resolved. Just how many veterans are targeted for attack because they ARE Veterans? If such attacks are statistically above the norm for violent assualts then she is wrong, and he's right. If such attacks are more or less non existant - Who needs another law? Dave", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-04-24 15:38:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Rep. Tom Rooney (R-FL) offers an amendment to a hate crimes bill to protect people who are targets of violent crime because of their military service. Rep. Debbie Wasserman Schultz (D-FL) responds. House Judiciary Committe - April 22, 2009 \"http://www.youtube.com/watch?v=dvFsVgiy9EA\" Thirty-five to forty years too late...........", 
        "intTime": 20090424, 
        "postID": 6, 
        "quote": "Originally posted by Anbar7: Rep. Tom Rooney (R-FL) offers an amendment to a hate crimes bill to protect people who are targets of violent crime because of their military service. Rep. Debbie Wasserman Schultz (D-FL) responds. House Judiciary Committe - April 22, 2009 \"http://www.youtube.com/watch?v=dvFsVgiy9EA\"", 
        "reply": " Thirty-five to forty years too late...........", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-04-24 15:46:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Thought I would bring this back to show that Veterans are indeed not part of the Hate Crime Act. They may be due to race, religion, etc., but not because they are a Veteran. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090506, 
        "postID": 7, 
        "quote": "", 
        "reply": "Thought I would bring this back to show that Veterans are indeed not part of the Hate Crime Act. They may be due to race, religion, etc., but not because they are a Veteran. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 12:06:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: My god, dont you know Veterans arent on the Approved list of those who can be targets of Hate. Because they are NOT a GROUP that is often targeted for attacks BECAUSE of being veterans. The rational for hate crime laws is adding to the severity of a crime that has been committed (note NOT a crime by it's self) because of the GROUP the perp thinks the victim belongs to. The most common evidence used to show it is a hate crime are tings done or said by the perp during or about the crime. Hate crimes act are similar to the the different levels for killing someone with intent, etc chamging the severity. \"http://www.lectlaw.com\" quote: MANSLAUGHTER - The unlawful killing of a human being without malice or premeditation, either express or implied; distinguished from murder, which requires malicious intent. The distinctions between manslaughter and murder, consists in the following: In the former, though the act which occasions the death be unlawful, or likely to be attended with bodily mischief, yet the malice, either express or implied, which is the very essence of murder, is presumed to be wanting in manslaughter. quote: MURDER, FIRST DEGREE - In order for someone to be found guilty of first degree murder the government must prove that the person killed another person; the person killed the other person with malice aforethought; and the killing was premeditated. To kill with malice aforethought means to kill either deliberately and intentionally or recklessly with extreme disregard for human life. quote: MURDER, SECOND DEGREE - In order for someone to be found guilty of second degree murder the government must prove that the person killed another person; the person killed the other person with malice aforethought; and the killing was premeditated. Note that the elements are identical with those for 1st degree murder. The practical difference is the sentences are different. Which crime to charge is usually entirely up to the prosecutor¼s discretion.", 
        "intTime": 20090506, 
        "postID": 8, 
        "quote": "Originally posted by LineDoggie: My god, dont you know Veterans arent on the Approved list of those who can be targets of Hate.", 
        "reply": " Because they are NOT a GROUP that is often targeted for attacks BECAUSE of being veterans. The rational for hate crime laws is adding to the severity of a crime that has been committed (note NOT a crime by it's self) because of the GROUP the perp thinks the victim belongs to. The most common evidence used to show it is a hate crime are tings done or said by the perp during or about the crime. Hate crimes act are similar to the the different levels for killing someone with intent, etc chamging the severity. \"http://www.lectlaw.com\" quote: MANSLAUGHTER - The unlawful killing of a human being without malice or premeditation, either express or implied; distinguished from murder, which requires malicious intent. The distinctions between manslaughter and murder, consists in the following: In the former, though the act which occasions the death be unlawful, or likely to be attended with bodily mischief, yet the malice, either express or implied, which is the very essence of murder, is presumed to be wanting in manslaughter. quote: MURDER, FIRST DEGREE - In order for someone to be found guilty of first degree murder the government must prove that the person killed another person; the person killed the other person with malice aforethought; and the killing was premeditated. To kill with malice aforethought means to kill either deliberately and intentionally or recklessly with extreme disregard for human life. quote: MURDER, SECOND DEGREE - In order for someone to be found guilty of second degree murder the government must prove that the person killed another person; the person killed the other person with malice aforethought; and the killing was premeditated. Note that the elements are identical with those for 1st degree murder. The practical difference is the sentences are different. Which crime to charge is usually entirely up to the prosecutor¼s discretion.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 12:27:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Anbar7: Rep. Tom Rooney (R-FL) offers an amendment to a hate crimes bill to protect people who are targets of violent crime because of their military service. Rep. Debbie Wasserman Schultz (D-FL) responds. House Judiciary Committe - April 22, 2009 \"http://www.youtube.com/watch?v=dvFsVgiy9EA\" Thirty-five to forty years too late........... Bull, except in VERY RARE CASES the most violent things those anti-war protestor during the Vietnam war ear did was to spit.", 
        "intTime": 20090506, 
        "postID": 9, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by Anbar7: Rep. Tom Rooney (R-FL) offers an amendment to a hate crimes bill to protect people who are targets of violent crime because of their military service. Rep. Debbie Wasserman Schultz (D-FL) responds. House Judiciary Committe - April 22, 2009 \"http://www.youtube.com/watch?v=dvFsVgiy9EA\" Thirty-five to forty years too late...........", 
        "reply": " Bull, except in VERY RARE CASES the most violent things those anti-war protestor during the Vietnam war ear did was to spit.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 12:34:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mrmixitup: I hate hate crimes bills. Every crime is a hate crime. Not so, some people kill or do it because they like it, it gives them a thrill, not just because they hate someone. And some people assault and/or kill others, believing that they really didn't commit a crime because the person they assaulted or killed was a homosexual or Hispanic or Black or a woman - which means the assault or murder was justified. For those whose panties are in a bunch because veterans weren't included - if you're a gay veteran or a veteran who someone believes is gay, you're a heck of a lot more likely to be attacked or killed than just because you're a veteran.", 
        "intTime": 20090506, 
        "postID": 10, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mrmixitup: I hate hate crimes bills. Every crime is a hate crime. Not so, some people kill or do it because they like it, it gives them a thrill, not just because they hate someone.", 
        "reply": " And some people assault and/or kill others, believing that they really didn't commit a crime because the person they assaulted or killed was a homosexual or Hispanic or Black or a woman - which means the assault or murder was justified. For those whose panties are in a bunch because veterans weren't included - if you're a gay veteran or a veteran who someone believes is gay, you're a heck of a lot more likely to be attacked or killed than just because you're a veteran.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 12:52:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Concur, fightdirector.", 
        "intTime": 20090506, 
        "postID": 11, 
        "quote": "", 
        "reply": "Concur, fightdirector.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 13:29:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\"", 
        "intTime": 20090506, 
        "postID": 12, 
        "quote": "An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers.", 
        "reply": "From a few years back:  \"http://www.newsnet5.com/news/3747416/detail.html\"", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 19:17:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\" First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern. Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts.", 
        "intTime": 20090506, 
        "postID": 13, 
        "quote": "Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\"", 
        "reply": " First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern. Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 19:49:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\" First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern... Better let Janet Napolitano know that. Her DHS considers every vet a potential Tim McVeigh. quote: Originally posted by rayld2:...Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts. Oh is that what you think? Were you there, genius? People who actually were there say differently. I wonder who we should give more credence to?? Hmmmm.. tough one.", 
        "intTime": 20090506, 
        "postID": 14, 
        "quote": "Originally posted by rayld2: quote: Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\" First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern...", 
        "reply": " Better let Janet Napolitano know that. Her DHS considers every vet a potential Tim McVeigh. quote: Originally posted by rayld2:...Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts. Oh is that what you think? Were you there, genius? People who actually were there say differently. I wonder who we should give more credence to?? Hmmmm.. tough one.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 20:11:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\" First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern. Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts. So 1 or 2 instances out of 350,000,000 doesn't make a pattern, but 247 out of 350,000,000 does? 247 is the number of physical violence \"hate crimes\" committed against people because of their sexual orientation in 2007. This number is from the FBI's website and 2007 is the most current year available. \"http://www.fbi.gov/ucr/hc2007/table_04.htm\"", 
        "intTime": 20090506, 
        "postID": 15, 
        "quote": "Originally posted by rayld2: quote: Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\" First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern. Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts.", 
        "reply": " So 1 or 2 instances out of 350,000,000 doesn't make a pattern, but 247 out of 350,000,000 does? 247 is the number of physical violence \"hate crimes\" committed against people because of their sexual orientation in 2007. This number is from the FBI's website and 2007 is the most current year available. \"http://www.fbi.gov/ucr/hc2007/table_04.htm\"", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 20:54:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by Anbar7: quote: Originally posted by mrmixitup: I hate hate crimes bills. Every crime is a hate crime. Not so, some people kill or do it because they like it, it gives them a thrill, not just because they hate someone. And some people assault and/or kill others, believing that they really didn't commit a crime because the person they assaulted or killed was a homosexual or Hispanic or Black or a woman - which means the assault or murder was justified. For those whose panties are in a bunch because veterans weren't included - if you're a gay veteran or a veteran who someone believes is gay, you're a heck of a lot more likely to be attacked or killed than just because you're a veteran. We had an killing here in PA that involved some high school kids and an illegal immigrant. The two young men on trial were acquitted because the prosecution couldn’t prove beyond a reasonable doubt that the charges against the accused, third-degree murder and ethnic intimidation against the one and aggravated assault and ethnic intimidation against the other. Both were convicted of simple assault. Here is a link to the full story. http://www.pennlive.com/midstate/index.ssf/2009/05/no_verdict_yet_in_shenandoah_i.html I bring this into the discussion to point out two things, that crimes against a certain group still happen and that it is damn hard to prove that the crime was simply because of the victim’s race, sexual orientation, etc... There were some underlying currents that surely played a role in this incident, but the jury was not convinced that it went to the level of what the accused were charged with.", 
        "intTime": 20090506, 
        "postID": 16, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by Anbar7: quote: Originally posted by mrmixitup: I hate hate crimes bills. Every crime is a hate crime. Not so, some people kill or do it because they like it, it gives them a thrill, not just because they hate someone. And some people assault and/or kill others, believing that they really didn't commit a crime because the person they assaulted or killed was a homosexual or Hispanic or Black or a woman - which means the assault or murder was justified. For those whose panties are in a bunch because veterans weren't included - if you're a gay veteran or a veteran who someone believes is gay, you're a heck of a lot more likely to be attacked or killed than just because you're a veteran.", 
        "reply": " We had an killing here in PA that involved some high school kids and an illegal immigrant. The two young men on trial were acquitted because the prosecution couldn’t prove beyond a reasonable doubt that the charges against the accused, third-degree murder and ethnic intimidation against the one and aggravated assault and ethnic intimidation against the other. Both were convicted of simple assault. Here is a link to the full story. http://www.pennlive.com/midstate/index.ssf/2009/05/no_verdict_yet_in_shenandoah_i.html I bring this into the discussion to point out two things, that crimes against a certain group still happen and that it is damn hard to prove that the crime was simply because of the victim’s race, sexual orientation, etc... There were some underlying currents that surely played a role in this incident, but the jury was not convinced that it went to the level of what the accused were charged with.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 21:40:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Better let Janet Napolitano know that. Her DHS considers every vet a potential Tim McVeigh. no. Ironically, what she said is that vets would be targets of hate groups.", 
        "intTime": 20090506, 
        "postID": 17, 
        "quote": "Better let Janet Napolitano know that. Her DHS considers every vet a potential Tim McVeigh.", 
        "reply": " no. Ironically, what she said is that vets would be targets of hate groups.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 22:59:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Anbar7: Rep. Tom Rooney (R-FL) offers an amendment to a hate crimes bill to protect people who are targets of violent crime because of their military service. Rep. Debbie Wasserman Schultz (D-FL) responds. House Judiciary Committe - April 22, 2009 \"http://www.youtube.com/watch?v=dvFsVgiy9EA\" Thirty-five to forty years too late........... Bull, except in VERY RARE CASES the most violent things those anti-war protestor during the Vietnam war ear did was to spit. To a Viet Vet that is enough. Back then the Viet vet just went on his way but let it happen today and that Viet Vet will act with a punch in the protestor's face and a kick to their groin. Maybe because we're older now and don't give a rat's arse.", 
        "intTime": 20090507, 
        "postID": 18, 
        "quote": "Originally posted by rayld2: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Anbar7: Rep. Tom Rooney (R-FL) offers an amendment to a hate crimes bill to protect people who are targets of violent crime because of their military service. Rep. Debbie Wasserman Schultz (D-FL) responds. House Judiciary Committe - April 22, 2009 \"http://www.youtube.com/watch?v=dvFsVgiy9EA\" Thirty-five to forty years too late........... Bull, except in VERY RARE CASES the most violent things those anti-war protestor during the Vietnam war ear did was to spit.", 
        "reply": " To a Viet Vet that is enough. Back then the Viet vet just went on his way but let it happen today and that Viet Vet will act with a punch in the protestor's face and a kick to their groin. Maybe because we're older now and don't give a rat's arse.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-07 05:14:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by rayld2: quote: Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\" First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern. Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts. So 1 or 2 instances out of 350,000,000 doesn't make a pattern, but 247 out of 350,000,000 does? 247 is the number of physical violence \"hate crimes\" committed against people because of their sexual orientation in 2007. This number is from the FBI's website and 2007 is the most current year available. \"http://www.fbi.gov/ucr/hc2007/table_04.htm\" There are no organzied GROUPS preaching hate and violence against veterans JUST FOR BEING VETERANS but there are groups preaching hate and even violence against other groups (such as Homosexuals) just for being members of the group.", 
        "intTime": 20090507, 
        "postID": 19, 
        "quote": "Originally posted by stec74: quote: Originally posted by rayld2: quote: Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\" First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern. Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts. So 1 or 2 instances out of 350,000,000 doesn't make a pattern, but 247 out of 350,000,000 does? 247 is the number of physical violence \"hate crimes\" committed against people because of their sexual orientation in 2007. This number is from the FBI's website and 2007 is the most current year available. \"http://www.fbi.gov/ucr/hc2007/table_04.htm\"", 
        "reply": " There are no organzied GROUPS preaching hate and violence against veterans JUST FOR BEING VETERANS but there are groups preaching hate and even violence against other groups (such as Homosexuals) just for being members of the group.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-07 05:59:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by stec74: quote: Originally posted by rayld2: quote: Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\" First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern. Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts. So 1 or 2 instances out of 350,000,000 doesn't make a pattern, but 247 out of 350,000,000 does? 247 is the number of physical violence \"hate crimes\" committed against people because of their sexual orientation in 2007. This number is from the FBI's website and 2007 is the most current year available. \"http://www.fbi.gov/ucr/hc2007/table_04.htm\" There are no organzied GROUPS preaching hate and violence against veterans JUST FOR BEING VETERANS but there are groups preaching hate and even violence against other groups (such as Homosexuals) just for being members of the group. So now there has to be an organized effort against a particular class of people in order for it to be considered a \"hate crime\"? First, it was considered a \"hate crime\" because of the group the victim belongs to. Then, it was due to a pattern of violnece against a paricular group. Now, it is if there is an organized effort against that particular group. Too bad you aren't writing this legislation because it would never make it out of committee as much as your defintion of \"hate crimes\" keeps changing.", 
        "intTime": 20090507, 
        "postID": 20, 
        "quote": "Originally posted by rayld2: quote: Originally posted by stec74: quote: Originally posted by rayld2: quote: Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\" First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern. Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts. So 1 or 2 instances out of 350,000,000 doesn't make a pattern, but 247 out of 350,000,000 does? 247 is the number of physical violence \"hate crimes\" committed against people because of their sexual orientation in 2007. This number is from the FBI's website and 2007 is the most current year available. \"http://www.fbi.gov/ucr/hc2007/table_04.htm\" There are no organzied GROUPS preaching hate and violence against veterans JUST FOR BEING VETERANS but there are groups preaching hate and even violence against other groups (such as Homosexuals) just for being members of the group.", 
        "reply": " So now there has to be an organized effort against a particular class of people in order for it to be considered a \"hate crime\"? First, it was considered a \"hate crime\" because of the group the victim belongs to. Then, it was due to a pattern of violnece against a paricular group. Now, it is if there is an organized effort against that particular group. Too bad you aren't writing this legislation because it would never make it out of committee as much as your defintion of \"hate crimes\" keeps changing.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-07 06:21:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "stec74"
    }, 
    {
        "content": "Rep. Tom Rooney (R-FL) offers an amendment to a hate crimes bill to protect people who are targets of violent crime because of their military service. Rep. Debbie Wasserman Schultz (D-FL) responds. House Judiciary Committe - April 22, 2009 \"http://www.youtube.com/watch?v=dvFsVgiy9EA\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090424, 
        "postID": 21, 
        "quote": "", 
        "reply": "Rep. Tom Rooney (R-FL) offers an amendment to a hate crimes bill to protect people who are targets of violent crime because of their military service. Rep. Debbie Wasserman Schultz (D-FL) responds. House Judiciary Committe - April 22, 2009 \"http://www.youtube.com/watch?v=dvFsVgiy9EA\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-04-24 14:59:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "Anbar7"
    }, 
    {
        "content": "I hate hate crimes bills. Every crime is a hate crime.", 
        "intTime": 20090424, 
        "postID": 22, 
        "quote": "", 
        "reply": "I hate hate crimes bills. Every crime is a hate crime.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-04-24 15:02:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: I hate hate crimes bills. Every crime is a hate crime. Not so, some people kill or do it because they like it, it gives them a thrill, not just because they hate someone. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090424, 
        "postID": 23, 
        "quote": "Originally posted by mrmixitup: I hate hate crimes bills. Every crime is a hate crime.", 
        "reply": " Not so, some people kill or do it because they like it, it gives them a thrill, not just because they hate someone. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-04-24 15:04:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "Anbar7"
    }, 
    {
        "content": "My god, dont you know Veterans arent on the Approved list of those who can be targets of Hate.", 
        "intTime": 20090424, 
        "postID": 24, 
        "quote": "", 
        "reply": "My god, dont you know Veterans arent on the Approved list of those who can be targets of Hate.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-04-24 15:25:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: http://www.youtube.com/watch?v=dvFsVgiy9EA This is a simple question to be resolved. Just how many veterans are targeted for attack because they ARE Veterans? If such attacks are statistically above the norm for violent assualts then she is wrong, and he's right. If such attacks are more or less non existant - Who needs another law? Dave", 
        "intTime": 20090424, 
        "postID": 25, 
        "quote": "http://www.youtube.com/watch?v=dvFsVgiy9EA", 
        "reply": " This is a simple question to be resolved. Just how many veterans are targeted for attack because they ARE Veterans? If such attacks are statistically above the norm for violent assualts then she is wrong, and he's right. If such attacks are more or less non existant - Who needs another law? Dave", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-04-24 15:38:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Rep. Tom Rooney (R-FL) offers an amendment to a hate crimes bill to protect people who are targets of violent crime because of their military service. Rep. Debbie Wasserman Schultz (D-FL) responds. House Judiciary Committe - April 22, 2009 \"http://www.youtube.com/watch?v=dvFsVgiy9EA\" Thirty-five to forty years too late...........", 
        "intTime": 20090424, 
        "postID": 26, 
        "quote": "Originally posted by Anbar7: Rep. Tom Rooney (R-FL) offers an amendment to a hate crimes bill to protect people who are targets of violent crime because of their military service. Rep. Debbie Wasserman Schultz (D-FL) responds. House Judiciary Committe - April 22, 2009 \"http://www.youtube.com/watch?v=dvFsVgiy9EA\"", 
        "reply": " Thirty-five to forty years too late...........", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-04-24 15:46:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Thought I would bring this back to show that Veterans are indeed not part of the Hate Crime Act. They may be due to race, religion, etc., but not because they are a Veteran. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090506, 
        "postID": 27, 
        "quote": "", 
        "reply": "Thought I would bring this back to show that Veterans are indeed not part of the Hate Crime Act. They may be due to race, religion, etc., but not because they are a Veteran. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 12:06:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: My god, dont you know Veterans arent on the Approved list of those who can be targets of Hate. Because they are NOT a GROUP that is often targeted for attacks BECAUSE of being veterans. The rational for hate crime laws is adding to the severity of a crime that has been committed (note NOT a crime by it's self) because of the GROUP the perp thinks the victim belongs to. The most common evidence used to show it is a hate crime are tings done or said by the perp during or about the crime. Hate crimes act are similar to the the different levels for killing someone with intent, etc chamging the severity. \"http://www.lectlaw.com\" quote: MANSLAUGHTER - The unlawful killing of a human being without malice or premeditation, either express or implied; distinguished from murder, which requires malicious intent. The distinctions between manslaughter and murder, consists in the following: In the former, though the act which occasions the death be unlawful, or likely to be attended with bodily mischief, yet the malice, either express or implied, which is the very essence of murder, is presumed to be wanting in manslaughter. quote: MURDER, FIRST DEGREE - In order for someone to be found guilty of first degree murder the government must prove that the person killed another person; the person killed the other person with malice aforethought; and the killing was premeditated. To kill with malice aforethought means to kill either deliberately and intentionally or recklessly with extreme disregard for human life. quote: MURDER, SECOND DEGREE - In order for someone to be found guilty of second degree murder the government must prove that the person killed another person; the person killed the other person with malice aforethought; and the killing was premeditated. Note that the elements are identical with those for 1st degree murder. The practical difference is the sentences are different. Which crime to charge is usually entirely up to the prosecutor¼s discretion.", 
        "intTime": 20090506, 
        "postID": 28, 
        "quote": "Originally posted by LineDoggie: My god, dont you know Veterans arent on the Approved list of those who can be targets of Hate.", 
        "reply": " Because they are NOT a GROUP that is often targeted for attacks BECAUSE of being veterans. The rational for hate crime laws is adding to the severity of a crime that has been committed (note NOT a crime by it's self) because of the GROUP the perp thinks the victim belongs to. The most common evidence used to show it is a hate crime are tings done or said by the perp during or about the crime. Hate crimes act are similar to the the different levels for killing someone with intent, etc chamging the severity. \"http://www.lectlaw.com\" quote: MANSLAUGHTER - The unlawful killing of a human being without malice or premeditation, either express or implied; distinguished from murder, which requires malicious intent. The distinctions between manslaughter and murder, consists in the following: In the former, though the act which occasions the death be unlawful, or likely to be attended with bodily mischief, yet the malice, either express or implied, which is the very essence of murder, is presumed to be wanting in manslaughter. quote: MURDER, FIRST DEGREE - In order for someone to be found guilty of first degree murder the government must prove that the person killed another person; the person killed the other person with malice aforethought; and the killing was premeditated. To kill with malice aforethought means to kill either deliberately and intentionally or recklessly with extreme disregard for human life. quote: MURDER, SECOND DEGREE - In order for someone to be found guilty of second degree murder the government must prove that the person killed another person; the person killed the other person with malice aforethought; and the killing was premeditated. Note that the elements are identical with those for 1st degree murder. The practical difference is the sentences are different. Which crime to charge is usually entirely up to the prosecutor¼s discretion.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 12:27:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Anbar7: Rep. Tom Rooney (R-FL) offers an amendment to a hate crimes bill to protect people who are targets of violent crime because of their military service. Rep. Debbie Wasserman Schultz (D-FL) responds. House Judiciary Committe - April 22, 2009 \"http://www.youtube.com/watch?v=dvFsVgiy9EA\" Thirty-five to forty years too late........... Bull, except in VERY RARE CASES the most violent things those anti-war protestor during the Vietnam war ear did was to spit.", 
        "intTime": 20090506, 
        "postID": 29, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by Anbar7: Rep. Tom Rooney (R-FL) offers an amendment to a hate crimes bill to protect people who are targets of violent crime because of their military service. Rep. Debbie Wasserman Schultz (D-FL) responds. House Judiciary Committe - April 22, 2009 \"http://www.youtube.com/watch?v=dvFsVgiy9EA\" Thirty-five to forty years too late...........", 
        "reply": " Bull, except in VERY RARE CASES the most violent things those anti-war protestor during the Vietnam war ear did was to spit.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 12:34:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by mrmixitup: I hate hate crimes bills. Every crime is a hate crime. Not so, some people kill or do it because they like it, it gives them a thrill, not just because they hate someone. And some people assault and/or kill others, believing that they really didn't commit a crime because the person they assaulted or killed was a homosexual or Hispanic or Black or a woman - which means the assault or murder was justified. For those whose panties are in a bunch because veterans weren't included - if you're a gay veteran or a veteran who someone believes is gay, you're a heck of a lot more likely to be attacked or killed than just because you're a veteran.", 
        "intTime": 20090506, 
        "postID": 30, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by mrmixitup: I hate hate crimes bills. Every crime is a hate crime. Not so, some people kill or do it because they like it, it gives them a thrill, not just because they hate someone.", 
        "reply": " And some people assault and/or kill others, believing that they really didn't commit a crime because the person they assaulted or killed was a homosexual or Hispanic or Black or a woman - which means the assault or murder was justified. For those whose panties are in a bunch because veterans weren't included - if you're a gay veteran or a veteran who someone believes is gay, you're a heck of a lot more likely to be attacked or killed than just because you're a veteran.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 12:52:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Concur, fightdirector.", 
        "intTime": 20090506, 
        "postID": 31, 
        "quote": "", 
        "reply": "Concur, fightdirector.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 13:29:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\"", 
        "intTime": 20090506, 
        "postID": 32, 
        "quote": "An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers.", 
        "reply": "From a few years back:  \"http://www.newsnet5.com/news/3747416/detail.html\"", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 19:17:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\" First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern. Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts.", 
        "intTime": 20090506, 
        "postID": 33, 
        "quote": "Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\"", 
        "reply": " First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern. Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 19:49:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\" First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern... Better let Janet Napolitano know that. Her DHS considers every vet a potential Tim McVeigh. quote: Originally posted by rayld2:...Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts. Oh is that what you think? Were you there, genius? People who actually were there say differently. I wonder who we should give more credence to?? Hmmmm.. tough one.", 
        "intTime": 20090506, 
        "postID": 34, 
        "quote": "Originally posted by rayld2: quote: Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\" First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern...", 
        "reply": " Better let Janet Napolitano know that. Her DHS considers every vet a potential Tim McVeigh. quote: Originally posted by rayld2:...Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts. Oh is that what you think? Were you there, genius? People who actually were there say differently. I wonder who we should give more credence to?? Hmmmm.. tough one.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 20:11:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\" First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern. Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts. So 1 or 2 instances out of 350,000,000 doesn't make a pattern, but 247 out of 350,000,000 does? 247 is the number of physical violence \"hate crimes\" committed against people because of their sexual orientation in 2007. This number is from the FBI's website and 2007 is the most current year available. \"http://www.fbi.gov/ucr/hc2007/table_04.htm\"", 
        "intTime": 20090506, 
        "postID": 35, 
        "quote": "Originally posted by rayld2: quote: Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\" First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern. Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts.", 
        "reply": " So 1 or 2 instances out of 350,000,000 doesn't make a pattern, but 247 out of 350,000,000 does? 247 is the number of physical violence \"hate crimes\" committed against people because of their sexual orientation in 2007. This number is from the FBI's website and 2007 is the most current year available. \"http://www.fbi.gov/ucr/hc2007/table_04.htm\"", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 20:54:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by Anbar7: quote: Originally posted by mrmixitup: I hate hate crimes bills. Every crime is a hate crime. Not so, some people kill or do it because they like it, it gives them a thrill, not just because they hate someone. And some people assault and/or kill others, believing that they really didn't commit a crime because the person they assaulted or killed was a homosexual or Hispanic or Black or a woman - which means the assault or murder was justified. For those whose panties are in a bunch because veterans weren't included - if you're a gay veteran or a veteran who someone believes is gay, you're a heck of a lot more likely to be attacked or killed than just because you're a veteran. We had an killing here in PA that involved some high school kids and an illegal immigrant. The two young men on trial were acquitted because the prosecution couldn’t prove beyond a reasonable doubt that the charges against the accused, third-degree murder and ethnic intimidation against the one and aggravated assault and ethnic intimidation against the other. Both were convicted of simple assault. Here is a link to the full story. http://www.pennlive.com/midstate/index.ssf/2009/05/no_verdict_yet_in_shenandoah_i.html I bring this into the discussion to point out two things, that crimes against a certain group still happen and that it is damn hard to prove that the crime was simply because of the victim’s race, sexual orientation, etc... There were some underlying currents that surely played a role in this incident, but the jury was not convinced that it went to the level of what the accused were charged with.", 
        "intTime": 20090506, 
        "postID": 36, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by Anbar7: quote: Originally posted by mrmixitup: I hate hate crimes bills. Every crime is a hate crime. Not so, some people kill or do it because they like it, it gives them a thrill, not just because they hate someone. And some people assault and/or kill others, believing that they really didn't commit a crime because the person they assaulted or killed was a homosexual or Hispanic or Black or a woman - which means the assault or murder was justified. For those whose panties are in a bunch because veterans weren't included - if you're a gay veteran or a veteran who someone believes is gay, you're a heck of a lot more likely to be attacked or killed than just because you're a veteran.", 
        "reply": " We had an killing here in PA that involved some high school kids and an illegal immigrant. The two young men on trial were acquitted because the prosecution couldn’t prove beyond a reasonable doubt that the charges against the accused, third-degree murder and ethnic intimidation against the one and aggravated assault and ethnic intimidation against the other. Both were convicted of simple assault. Here is a link to the full story. http://www.pennlive.com/midstate/index.ssf/2009/05/no_verdict_yet_in_shenandoah_i.html I bring this into the discussion to point out two things, that crimes against a certain group still happen and that it is damn hard to prove that the crime was simply because of the victim’s race, sexual orientation, etc... There were some underlying currents that surely played a role in this incident, but the jury was not convinced that it went to the level of what the accused were charged with.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 21:40:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Better let Janet Napolitano know that. Her DHS considers every vet a potential Tim McVeigh. no. Ironically, what she said is that vets would be targets of hate groups.", 
        "intTime": 20090506, 
        "postID": 37, 
        "quote": "Better let Janet Napolitano know that. Her DHS considers every vet a potential Tim McVeigh.", 
        "reply": " no. Ironically, what she said is that vets would be targets of hate groups.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-06 22:59:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Anbar7: Rep. Tom Rooney (R-FL) offers an amendment to a hate crimes bill to protect people who are targets of violent crime because of their military service. Rep. Debbie Wasserman Schultz (D-FL) responds. House Judiciary Committe - April 22, 2009 \"http://www.youtube.com/watch?v=dvFsVgiy9EA\" Thirty-five to forty years too late........... Bull, except in VERY RARE CASES the most violent things those anti-war protestor during the Vietnam war ear did was to spit. To a Viet Vet that is enough. Back then the Viet vet just went on his way but let it happen today and that Viet Vet will act with a punch in the protestor's face and a kick to their groin. Maybe because we're older now and don't give a rat's arse.", 
        "intTime": 20090507, 
        "postID": 38, 
        "quote": "Originally posted by rayld2: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Anbar7: Rep. Tom Rooney (R-FL) offers an amendment to a hate crimes bill to protect people who are targets of violent crime because of their military service. Rep. Debbie Wasserman Schultz (D-FL) responds. House Judiciary Committe - April 22, 2009 \"http://www.youtube.com/watch?v=dvFsVgiy9EA\" Thirty-five to forty years too late........... Bull, except in VERY RARE CASES the most violent things those anti-war protestor during the Vietnam war ear did was to spit.", 
        "reply": " To a Viet Vet that is enough. Back then the Viet vet just went on his way but let it happen today and that Viet Vet will act with a punch in the protestor's face and a kick to their groin. Maybe because we're older now and don't give a rat's arse.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-07 05:14:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by rayld2: quote: Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\" First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern. Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts. So 1 or 2 instances out of 350,000,000 doesn't make a pattern, but 247 out of 350,000,000 does? 247 is the number of physical violence \"hate crimes\" committed against people because of their sexual orientation in 2007. This number is from the FBI's website and 2007 is the most current year available. \"http://www.fbi.gov/ucr/hc2007/table_04.htm\" There are no organzied GROUPS preaching hate and violence against veterans JUST FOR BEING VETERANS but there are groups preaching hate and even violence against other groups (such as Homosexuals) just for being members of the group.", 
        "intTime": 20090507, 
        "postID": 39, 
        "quote": "Originally posted by stec74: quote: Originally posted by rayld2: quote: Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\" First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern. Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts. So 1 or 2 instances out of 350,000,000 doesn't make a pattern, but 247 out of 350,000,000 does? 247 is the number of physical violence \"hate crimes\" committed against people because of their sexual orientation in 2007. This number is from the FBI's website and 2007 is the most current year available. \"http://www.fbi.gov/ucr/hc2007/table_04.htm\"", 
        "reply": " There are no organzied GROUPS preaching hate and violence against veterans JUST FOR BEING VETERANS but there are groups preaching hate and even violence against other groups (such as Homosexuals) just for being members of the group.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-07 05:59:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by stec74: quote: Originally posted by rayld2: quote: Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\" First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern. Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts. So 1 or 2 instances out of 350,000,000 doesn't make a pattern, but 247 out of 350,000,000 does? 247 is the number of physical violence \"hate crimes\" committed against people because of their sexual orientation in 2007. This number is from the FBI's website and 2007 is the most current year available. \"http://www.fbi.gov/ucr/hc2007/table_04.htm\" There are no organzied GROUPS preaching hate and violence against veterans JUST FOR BEING VETERANS but there are groups preaching hate and even violence against other groups (such as Homosexuals) just for being members of the group. So now there has to be an organized effort against a particular class of people in order for it to be considered a \"hate crime\"? First, it was considered a \"hate crime\" because of the group the victim belongs to. Then, it was due to a pattern of violnece against a paricular group. Now, it is if there is an organized effort against that particular group. Too bad you aren't writing this legislation because it would never make it out of committee as much as your defintion of \"hate crimes\" keeps changing.", 
        "intTime": 20090507, 
        "postID": 40, 
        "quote": "Originally posted by rayld2: quote: Originally posted by stec74: quote: Originally posted by rayld2: quote: Originally posted by stec74: From a few years back: quote: An Ohio soldier back from the war in Iraq said he was beaten at a concert because of what was printed on his T-shirt, WCMH-TV reported. Foster Barton Foster Barton, 19, of Grove City, received a Purple Heart for his military service in Iraq. He almost lost his leg last month after a Humvee he was riding in ran over a landmine. Barton said he was injured again Friday night in a crowded parking lot as he was leaving the Toby Keith concert at Germain Amphitheatre. The solider was injured so badly that he can't go back to Iraq as scheduled. \"I don't remember getting hit at all, really,\" said Barton, a member of the 1st Calvary Division. \"He hit me in the back of the head. I fell and hit the ground. I was knocked unconscious and he continued to punch and kick me on the ground.\" Barton and his family said he was beat up because he was wearing an Iraqi freedom T-shirt. \"It's not our fault,\" Barton said. \"I'm just doing a job.\" According to a Columbus police report, six witnesses who didn't know Barton said the person who beat him up was screaming profanities and making crude remarks about U.S. soldiers. \"http://www.newsnet5.com/news/3747416/detail.html\" First 1 or 2 isolated indents in a population of 300Mil does NOt make a pattern. Second Anti-Vet and Anti-war people being at a Toby Keith concert is unlikely. I think it is a LOT more likely he was picked just because he was seen as a easy target by some drunk AH looking to cause trouble and if the easy target had been wearing a code pink T shirt the attacker would have been screaming profanities and making crude remarks about anti-war protesters. ALWAYS go wth the SIMPLEST explaination that fits the facts. So 1 or 2 instances out of 350,000,000 doesn't make a pattern, but 247 out of 350,000,000 does? 247 is the number of physical violence \"hate crimes\" committed against people because of their sexual orientation in 2007. This number is from the FBI's website and 2007 is the most current year available. \"http://www.fbi.gov/ucr/hc2007/table_04.htm\" There are no organzied GROUPS preaching hate and violence against veterans JUST FOR BEING VETERANS but there are groups preaching hate and even violence against other groups (such as Homosexuals) just for being members of the group.", 
        "reply": " So now there has to be an organized effort against a particular class of people in order for it to be considered a \"hate crime\"? First, it was considered a \"hate crime\" because of the group the victim belongs to. Then, it was due to a pattern of violnece against a paricular group. Now, it is if there is an organized effort against that particular group. Too bad you aren't writing this legislation because it would never make it out of committee as much as your defintion of \"hate crimes\" keeps changing.", 
        "threadID": "672198221_8020096122001", 
        "time": "2009-05-07 06:21:00", 
        "title": "Rep. Debbie Wasserman Schultz (D-FL) says that Veterans are not targets of hate crime", 
        "userID": "stec74"
    }
]