[
    {
        "content": "RE: http://www.military.com/features/0,15240,187279,00.html The Air Farce wants yet another bomber!!! They have three already, while their tanker fleet is aging? Please correct me if I'm wrong, but doesn't one B2 have a price tag of 1/3 the cost of an Aircraft Carrier. Air Farce !!!!! get your head out of your BUTTTTT!", 
        "intTime": 20090323, 
        "postID": 1, 
        "quote": "", 
        "reply": "RE: http://www.military.com/features/0,15240,187279,00.html The Air Farce wants yet another bomber!!! They have three already, while their tanker fleet is aging? Please correct me if I'm wrong, but doesn't one B2 have a price tag of 1/3 the cost of an Aircraft Carrier. Air Farce !!!!! get your head out of your BUTTTTT!", 
        "threadID": "672198221_1220056812001", 
        "time": "2009-03-23 09:05:00", 
        "title": "DoD Cancellation Decisions Imminent", 
        "userID": "DocKem"
    }, 
    {
        "content": "quote: Originally posted by DocKem: Please correct me if I'm wrong, but doesn't one B2 have a price tag of 1/3 the cost of an Aircraft Carrier. Nearly 50%! B-2 is $2 billion, Nimitz Class ~$4.5 billion!", 
        "intTime": 20090323, 
        "postID": 2, 
        "quote": "Originally posted by DocKem: Please correct me if I'm wrong, but doesn't one B2 have a price tag of 1/3 the cost of an Aircraft Carrier.", 
        "reply": " Nearly 50%! B-2 is $2 billion, Nimitz Class ~$4.5 billion!", 
        "threadID": "672198221_1220056812001", 
        "time": "2009-03-23 09:37:00", 
        "title": "DoD Cancellation Decisions Imminent", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by DocKem: RE: http://www.military.com/features/0,15240,187279,00.html The Air Farce wants yet another bomber!!! They have three already, while their tanker fleet is aging? Please correct me if I'm wrong, but doesn't one B2 have a price tag of 1/3 the cost of an Aircraft Carrier. Air Farce !!!!! get your head out of your BUTTTTT! B-2 cost is irrelevant since we are not buying any more of them. Current force is only 20 airframes and by itself, is not sufficient. Yes, very expensive especially after procurement dropped from 300 to 132 to 75 to 21. B-1 enetered service in the mid 80s. Will be 40+ years old by the time it is replaced. Design dates to early 70s. B-52H entered service 62/63/64 timeframe. They will be approaching 60+ years old when they are replaced. Design dates to late 40s! How long do you want the USAF to fly current fleet? Pull their head out of their azz? How about you looking at requirements versus spouting off, that would be a start. Next bomber would come after at least the first batch of new tankers. KC-135 replacement is current number one procurement priority. Now if we could get Congress, DoD, and the USAF all on the same page and get it done. I am against splitting the KC-X as it will do nothing but increase costs. Buy the 767 to replace the KC-135E models and let KC-Y and KC-Z address the MRTT requirement.", 
        "intTime": 20090323, 
        "postID": 3, 
        "quote": "Originally posted by DocKem: RE: http://www.military.com/features/0,15240,187279,00.html The Air Farce wants yet another bomber!!! They have three already, while their tanker fleet is aging? Please correct me if I'm wrong, but doesn't one B2 have a price tag of 1/3 the cost of an Aircraft Carrier. Air Farce !!!!! get your head out of your BUTTTTT!", 
        "reply": " B-2 cost is irrelevant since we are not buying any more of them. Current force is only 20 airframes and by itself, is not sufficient. Yes, very expensive especially after procurement dropped from 300 to 132 to 75 to 21. B-1 enetered service in the mid 80s. Will be 40+ years old by the time it is replaced. Design dates to early 70s. B-52H entered service 62/63/64 timeframe. They will be approaching 60+ years old when they are replaced. Design dates to late 40s! How long do you want the USAF to fly current fleet? Pull their head out of their azz? How about you looking at requirements versus spouting off, that would be a start. Next bomber would come after at least the first batch of new tankers. KC-135 replacement is current number one procurement priority. Now if we could get Congress, DoD, and the USAF all on the same page and get it done. I am against splitting the KC-X as it will do nothing but increase costs. Buy the 767 to replace the KC-135E models and let KC-Y and KC-Z address the MRTT requirement.", 
        "threadID": "672198221_1220056812001", 
        "time": "2009-03-23 10:35:00", 
        "title": "DoD Cancellation Decisions Imminent", 
        "userID": "sw614"
    }, 
    {
        "content": "History does and is repeating itself. This is article proof. When President Jimmy Carter took office, he cancelled the B-1A Bomber Program. He also cancelled the AMST Program (the YC-14 & YC-15 Cargo aircraft) They were being flight tested and the program was in the decision making (of which to buy) when he ax fell. Now fast forward a few years beyond the Carter years, the B-1 was restarted, called the B-1B, it had refinements incorporated and cost twice as much as originally planned. Lockheed got a contract to enhance the C-5 and called it the C-5B. 50 more white elephants for the USAF. Yes it could do a lot but at what cost? After the C-5B days, came the C-17 built from the lessons learned from the AMST Program and the YC-15 test aircraft. Politics would not allow two cargo planes in production at the same time. The C-17 is different (bigger and updated) aircraft from the YC-15 but it costs a lot more too. The YC-15 was closer to the size of the C-130. The C-17 was built to fit in the hole between the C-141B and the C-5B. As you know, the C-130 is still here and now modern with the C-130J and the C-141B is retired, all of them. Does the USAF need another Bomber? Well if they do, it will not be a big one. It just may be a modified or extended FB-22. With the stealth and precision bomb capabilities available today allowing a 2000 lb bomb to be dropped down a chimney or into a cup of coffee from 30,000 ft they do not need dozens of carpet bombing aircraft. One can now do the destruction if many. Surgical precision bombing for today. Tomorrow, the laser will be the weapon of choice, both on the battle field and from the sky. Hide and watch for it is coming faster than you can imagine, and that is the truth too!", 
        "intTime": 20090323, 
        "postID": 4, 
        "quote": "", 
        "reply": "History does and is repeating itself. This is article proof. When President Jimmy Carter took office, he cancelled the B-1A Bomber Program. He also cancelled the AMST Program (the YC-14 & YC-15 Cargo aircraft) They were being flight tested and the program was in the decision making (of which to buy) when he ax fell. Now fast forward a few years beyond the Carter years, the B-1 was restarted, called the B-1B, it had refinements incorporated and cost twice as much as originally planned. Lockheed got a contract to enhance the C-5 and called it the C-5B. 50 more white elephants for the USAF. Yes it could do a lot but at what cost? After the C-5B days, came the C-17 built from the lessons learned from the AMST Program and the YC-15 test aircraft. Politics would not allow two cargo planes in production at the same time. The C-17 is different (bigger and updated) aircraft from the YC-15 but it costs a lot more too. The YC-15 was closer to the size of the C-130. The C-17 was built to fit in the hole between the C-141B and the C-5B. As you know, the C-130 is still here and now modern with the C-130J and the C-141B is retired, all of them. Does the USAF need another Bomber? Well if they do, it will not be a big one. It just may be a modified or extended FB-22. With the stealth and precision bomb capabilities available today allowing a 2000 lb bomb to be dropped down a chimney or into a cup of coffee from 30,000 ft they do not need dozens of carpet bombing aircraft. One can now do the destruction if many. Surgical precision bombing for today. Tomorrow, the laser will be the weapon of choice, both on the battle field and from the sky. Hide and watch for it is coming faster than you can imagine, and that is the truth too!", 
        "threadID": "672198221_1220056812001", 
        "time": "2009-03-23 12:01:00", 
        "title": "DoD Cancellation Decisions Imminent", 
        "userID": "F22Flighttester"
    }, 
    {
        "content": "I don't know about all that. Aren't they still using BUFF's to carpet bomb Taliban off the mountainsides?", 
        "intTime": 20090323, 
        "postID": 5, 
        "quote": "", 
        "reply": "I don't know about all that. Aren't they still using BUFF's to carpet bomb Taliban off the mountainsides?", 
        "threadID": "672198221_1220056812001", 
        "time": "2009-03-23 12:36:00", 
        "title": "DoD Cancellation Decisions Imminent", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by F22Flighttester: History does and is repeating itself. This is article proof. When President Jimmy Carter took office, he cancelled the B-1A Bomber Program. He also cancelled the AMST Program (the YC-14 & YC-15 Cargo aircraft) They were being flight tested and the program was in the decision making (of which to buy) when he ax fell. Now fast forward a few years beyond the Carter years, the B-1 was restarted, called the B-1B, it had refinements incorporated and cost twice as much as originally planned. Lockheed got a contract to enhance the C-5 and called it the C-5B. 50 more white elephants for the USAF. Yes it could do a lot but at what cost? After the C-5B days, came the C-17 built from the lessons learned from the AMST Program and the YC-15 test aircraft. Politics would not allow two cargo planes in production at the same time. The C-17 is different (bigger and updated) aircraft from the YC-15 but it costs a lot more too. The YC-15 was closer to the size of the C-130. The C-17 was built to fit in the hole between the C-141B and the C-5B. As you know, the C-130 is still here and now modern with the C-130J and the C-141B is retired, all of them. Does the USAF need another Bomber? Well if they do, it will not be a big one. It just may be a modified or extended FB-22. With the stealth and precision bomb capabilities available today allowing a 2000 lb bomb to be dropped down a chimney or into a cup of coffee from 30,000 ft they do not need dozens of carpet bombing aircraft. One can now do the destruction if many. Surgical precision bombing for today. Tomorrow, the laser will be the weapon of choice, both on the battle field and from the sky. Hide and watch for it is coming faster than you can imagine, and that is the truth too! F22 - good points about the YC-14 and -15. They would have been a good addition. Yep, the C-5B was strictly a political decisions. At least that is what we were briefed by our wing CC at Dover 25 or so years ago. When the last L-1011 rolled off the line it had a sign attached to the tailcone which said \"Thank You C-5B\". But remember when the C-5B was bought, C-5s were still priority B assets and considered national treasures by congress. Considering how we flew the wings (litterally and among other issues) off the C-141s, the C-17 was a good acft at the right time and is very good replacement for the C-141. I do not see a tactical airframe such as the FB-22 being the Next Generation Bomber, too few weapons and too little range. While it would be a nice asset to have, it would not meet the RFP standards IMHO. A B-1R was floated, but that too has gone in the \"decent idea but not what we want\" pile. The USAF wants an acft with long loiter time and extreme regional and/or intercontinental range with a 40,000 lb or more load IIRC. Something that could be stationed outside immediate conflict zone and operate with minimal tanker support. One thing that on-going operations has shown is that an acft with the capabilities of a B-1B is an incredible asset that can stay aloft for a long time and respond quickly.", 
        "intTime": 20090323, 
        "postID": 6, 
        "quote": "Originally posted by F22Flighttester: History does and is repeating itself. This is article proof. When President Jimmy Carter took office, he cancelled the B-1A Bomber Program. He also cancelled the AMST Program (the YC-14 & YC-15 Cargo aircraft) They were being flight tested and the program was in the decision making (of which to buy) when he ax fell. Now fast forward a few years beyond the Carter years, the B-1 was restarted, called the B-1B, it had refinements incorporated and cost twice as much as originally planned. Lockheed got a contract to enhance the C-5 and called it the C-5B. 50 more white elephants for the USAF. Yes it could do a lot but at what cost? After the C-5B days, came the C-17 built from the lessons learned from the AMST Program and the YC-15 test aircraft. Politics would not allow two cargo planes in production at the same time. The C-17 is different (bigger and updated) aircraft from the YC-15 but it costs a lot more too. The YC-15 was closer to the size of the C-130. The C-17 was built to fit in the hole between the C-141B and the C-5B. As you know, the C-130 is still here and now modern with the C-130J and the C-141B is retired, all of them. Does the USAF need another Bomber? Well if they do, it will not be a big one. It just may be a modified or extended FB-22. With the stealth and precision bomb capabilities available today allowing a 2000 lb bomb to be dropped down a chimney or into a cup of coffee from 30,000 ft they do not need dozens of carpet bombing aircraft. One can now do the destruction if many. Surgical precision bombing for today. Tomorrow, the laser will be the weapon of choice, both on the battle field and from the sky. Hide and watch for it is coming faster than you can imagine, and that is the truth too!", 
        "reply": " F22 - good points about the YC-14 and -15. They would have been a good addition. Yep, the C-5B was strictly a political decisions. At least that is what we were briefed by our wing CC at Dover 25 or so years ago. When the last L-1011 rolled off the line it had a sign attached to the tailcone which said \"Thank You C-5B\". But remember when the C-5B was bought, C-5s were still priority B assets and considered national treasures by congress. Considering how we flew the wings (litterally and among other issues) off the C-141s, the C-17 was a good acft at the right time and is very good replacement for the C-141. I do not see a tactical airframe such as the FB-22 being the Next Generation Bomber, too few weapons and too little range. While it would be a nice asset to have, it would not meet the RFP standards IMHO. A B-1R was floated, but that too has gone in the \"decent idea but not what we want\" pile. The USAF wants an acft with long loiter time and extreme regional and/or intercontinental range with a 40,000 lb or more load IIRC. Something that could be stationed outside immediate conflict zone and operate with minimal tanker support. One thing that on-going operations has shown is that an acft with the capabilities of a B-1B is an incredible asset that can stay aloft for a long time and respond quickly.", 
        "threadID": "672198221_1220056812001", 
        "time": "2009-03-23 12:38:00", 
        "title": "DoD Cancellation Decisions Imminent", 
        "userID": "sw614"
    }, 
    {
        "content": "For SW614 I find your comments interesting. Who really knows what the USAF will “TRY” to buy next. However, while testing the F-22, Lockheed floated the concept FB-22. It was greeted with keen interest in many USAF circles. The FB-22 is a bigger aircraft. More weapon bays, more fuel capacity. If you remember, or know, fuel consumption (or lack of) of the F-22 is noteworthy due to it not needing AB unless necessary. Kinda like the size of the FB-111. It takes so very long to design build test, retest, and then build a new aircraft that 20 years is not unrealistic. So many have no clue to what is involved. The AF has proven on station capabilities for long periods of time with their drones they use a lot in Afghanistan. Drone technology and capability is expanding as we speak. The drone will also replace the F-22 and F-35 if it ever gets into production. Take the human out and the plane can do so much more.", 
        "intTime": 20090323, 
        "postID": 7, 
        "quote": "", 
        "reply": "For SW614 I find your comments interesting. Who really knows what the USAF will “TRY” to buy next. However, while testing the F-22, Lockheed floated the concept FB-22. It was greeted with keen interest in many USAF circles. The FB-22 is a bigger aircraft. More weapon bays, more fuel capacity. If you remember, or know, fuel consumption (or lack of) of the F-22 is noteworthy due to it not needing AB unless necessary. Kinda like the size of the FB-111. It takes so very long to design build test, retest, and then build a new aircraft that 20 years is not unrealistic. So many have no clue to what is involved. The AF has proven on station capabilities for long periods of time with their drones they use a lot in Afghanistan. Drone technology and capability is expanding as we speak. The drone will also replace the F-22 and F-35 if it ever gets into production. Take the human out and the plane can do so much more.", 
        "threadID": "672198221_1220056812001", 
        "time": "2009-03-23 13:34:00", 
        "title": "DoD Cancellation Decisions Imminent", 
        "userID": "F22Flighttester"
    }, 
    {
        "content": "Unfortunately the response by Dockem is about what we can expect from the current administration and congress. \"Those B-52s and B-1s have been doing just fine. The Air Force just needs to take better care of them.\" \"Once we stop using them in Iraq they can last forever sitting in their hangars.\" Since the blue water Navy has not had a high profile part in the current war they too will be dismissed when they try to get more than the 280 or so ships they have been able to keep afloat. If the Generals and Admirals don't want to return to the hollow forces of the 70s they had better get their act together right now. They need to aggressively go after the multitude of problems with current procurement. Stop thinking like the check book is never empty and be realistic about what our troops really need and our Nation can afford in these economic times. Focus on the basics without all of the gold plated bells and whistles. Set a design and build to that standard without costly add ons and revisions once the contract is signed. Hold the builders to the price and timeline agreed to and levy substantial fines for over runs and missed milestones. This congress and administration are no friends to the military. They are in for some tough times ahead particularly with the money being spent on the so called stimulus program which is merely a Democrat vote buying binge. The Armed Forces will be reduced to begging for scraps.", 
        "intTime": 20090323, 
        "postID": 8, 
        "quote": "", 
        "reply": "Unfortunately the response by Dockem is about what we can expect from the current administration and congress. \"Those B-52s and B-1s have been doing just fine. The Air Force just needs to take better care of them.\" \"Once we stop using them in Iraq they can last forever sitting in their hangars.\" Since the blue water Navy has not had a high profile part in the current war they too will be dismissed when they try to get more than the 280 or so ships they have been able to keep afloat. If the Generals and Admirals don't want to return to the hollow forces of the 70s they had better get their act together right now. They need to aggressively go after the multitude of problems with current procurement. Stop thinking like the check book is never empty and be realistic about what our troops really need and our Nation can afford in these economic times. Focus on the basics without all of the gold plated bells and whistles. Set a design and build to that standard without costly add ons and revisions once the contract is signed. Hold the builders to the price and timeline agreed to and levy substantial fines for over runs and missed milestones. This congress and administration are no friends to the military. They are in for some tough times ahead particularly with the money being spent on the so called stimulus program which is merely a Democrat vote buying binge. The Armed Forces will be reduced to begging for scraps.", 
        "threadID": "672198221_1220056812001", 
        "time": "2009-03-23 13:37:00", 
        "title": "DoD Cancellation Decisions Imminent", 
        "userID": "M123Driver"
    }, 
    {
        "content": "quote: Originally posted by DocKem: RE: http://www.military.com/features/0,15240,187279,00.html The Air Farce wants yet another bomber!!! They have three already, while their tanker fleet is aging? Please correct me if I'm wrong, but doesn't one B2 have a price tag of 1/3 the cost of an Aircraft Carrier. Air Farce !!!!! get your head out of your BUTTTTT! Spoken like a true expert, NOT!... Respectfully, SUNLINER81", 
        "intTime": 20090323, 
        "postID": 9, 
        "quote": "Originally posted by DocKem: RE: http://www.military.com/features/0,15240,187279,00.html The Air Farce wants yet another bomber!!! They have three already, while their tanker fleet is aging? Please correct me if I'm wrong, but doesn't one B2 have a price tag of 1/3 the cost of an Aircraft Carrier. Air Farce !!!!! get your head out of your BUTTTTT!", 
        "reply": " Spoken like a true expert, NOT!... Respectfully, SUNLINER81", 
        "threadID": "672198221_1220056812001", 
        "time": "2009-03-23 13:44:00", 
        "title": "DoD Cancellation Decisions Imminent", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by DocKem: Please correct me if I'm wrong, but doesn't one B2 have a price tag of 1/3 the cost of an Aircraft Carrier. Nearly 50%! B-2 is $2 billion, Nimitz Class ~$4.5 billion! If you go on actual cost per air vehicle it is $737 million, it only AVERAGES the cost you sight if you AVERAGE each air vehicle throughout the cost of the entire program, parts, personnel, training, fuel, maintenance, OVER THE PROJECTED LIFE OF THE ENTIRE PROGRAM!... Next... Respectfully, SUNLINER81", 
        "intTime": 20090323, 
        "postID": 10, 
        "quote": "Originally posted by Knele: quote: Originally posted by DocKem: Please correct me if I'm wrong, but doesn't one B2 have a price tag of 1/3 the cost of an Aircraft Carrier. Nearly 50%! B-2 is $2 billion, Nimitz Class ~$4.5 billion!", 
        "reply": " If you go on actual cost per air vehicle it is $737 million, it only AVERAGES the cost you sight if you AVERAGE each air vehicle throughout the cost of the entire program, parts, personnel, training, fuel, maintenance, OVER THE PROJECTED LIFE OF THE ENTIRE PROGRAM!... Next... Respectfully, SUNLINER81", 
        "threadID": "672198221_1220056812001", 
        "time": "2009-03-23 13:48:00", 
        "title": "DoD Cancellation Decisions Imminent", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "The C-5 is probably the best investment the Air Force ever made, and the one they neglected the most. The plane is amazing, it will haul virtually anything to almost any airstrip and it has the range to get it there faster and with less support than a C-17. Yet the Air Force has never kept parts for it in the system, so when even minor maintenance is needed the plane gets stuck waiting for the part from CONUS. The C-17 is a fine medium airlifter, but with the limitations in height added with center wing tank it will never be able to replace the C-5. I would love to see a C-17 haul some of the loads the C-5 can carry, like two MH-53s.", 
        "intTime": 20090323, 
        "postID": 11, 
        "quote": "", 
        "reply": "The C-5 is probably the best investment the Air Force ever made, and the one they neglected the most. The plane is amazing, it will haul virtually anything to almost any airstrip and it has the range to get it there faster and with less support than a C-17. Yet the Air Force has never kept parts for it in the system, so when even minor maintenance is needed the plane gets stuck waiting for the part from CONUS. The C-17 is a fine medium airlifter, but with the limitations in height added with center wing tank it will never be able to replace the C-5. I would love to see a C-17 haul some of the loads the C-5 can carry, like two MH-53s.", 
        "threadID": "672198221_1220056812001", 
        "time": "2009-03-23 13:59:00", 
        "title": "DoD Cancellation Decisions Imminent", 
        "userID": "nspreitler"
    }, 
    {
        "content": "The Air force needs to have airframes capable of delivering both long and short range weapons remember the B-52 is antiquated and the airframes are detiorating. We must have a deterant capable of fast response in this milinum with the global threats of today. We need to maintain mobility necessary to move personnel and equipment anywhere in the world on short notice and to protect ourselves of any type of air assults.", 
        "intTime": 20090323, 
        "postID": 12, 
        "quote": "", 
        "reply": "The Air force needs to have airframes capable of delivering both long and short range weapons remember the B-52 is antiquated and the airframes are detiorating. We must have a deterant capable of fast response in this milinum with the global threats of today. We need to maintain mobility necessary to move personnel and equipment anywhere in the world on short notice and to protect ourselves of any type of air assults.", 
        "threadID": "672198221_1220056812001", 
        "time": "2009-03-23 15:43:00", 
        "title": "DoD Cancellation Decisions Imminent", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: The C-5 is probably the best investment the Air Force ever made, and the one they neglected the most. The plane is amazing, it will haul virtually anything to almost any airstrip and it has the range to get it there faster and with less support than a C-17. Yet the Air Force has never kept parts for it in the system, so when even minor maintenance is needed the plane gets stuck waiting for the part from CONUS. The C-17 is a fine medium airlifter, but with the limitations in height added with center wing tank it will never be able to replace the C-5. I would love to see a C-17 haul some of the loads the C-5 can carry, like two MH-53s. Yes, FRED can haul a lot of things a long way. But even with proper parts available, they still took an incredible amount of maintenance hours per flight hour, somewhere around 22-24 when I worked them. Lack of parts and cannabalization just made matters worse. Its sheer size also makes some maintenance in the field somewhat challanging. And can very quickly saturate a ramp at a FOB. It is also neat to land at a fighter base(especially one belonging to a sister service or an ally) and ask for gas. They send out a truck with 15K on board and after I was done laughing, I stated I needed 220K or whathaveyou. It also never failed that everytime I needed to pull a panel for access to something it was 20-30 feet in the air (or higher if working the elevators) and fastened with a hundred or so high torque screws. Now where is that darn Johnson bar...... The C-17 was never meant to compete/replace with the C-5. It was meant to complement it and the C-141 and eventually replacing the latter.", 
        "intTime": 20090323, 
        "postID": 13, 
        "quote": "Originally posted by nspreitler: The C-5 is probably the best investment the Air Force ever made, and the one they neglected the most. The plane is amazing, it will haul virtually anything to almost any airstrip and it has the range to get it there faster and with less support than a C-17. Yet the Air Force has never kept parts for it in the system, so when even minor maintenance is needed the plane gets stuck waiting for the part from CONUS. The C-17 is a fine medium airlifter, but with the limitations in height added with center wing tank it will never be able to replace the C-5. I would love to see a C-17 haul some of the loads the C-5 can carry, like two MH-53s.", 
        "reply": " Yes, FRED can haul a lot of things a long way. But even with proper parts available, they still took an incredible amount of maintenance hours per flight hour, somewhere around 22-24 when I worked them. Lack of parts and cannabalization just made matters worse. Its sheer size also makes some maintenance in the field somewhat challanging. And can very quickly saturate a ramp at a FOB. It is also neat to land at a fighter base(especially one belonging to a sister service or an ally) and ask for gas. They send out a truck with 15K on board and after I was done laughing, I stated I needed 220K or whathaveyou. It also never failed that everytime I needed to pull a panel for access to something it was 20-30 feet in the air (or higher if working the elevators) and fastened with a hundred or so high torque screws. Now where is that darn Johnson bar...... The C-17 was never meant to compete/replace with the C-5. It was meant to complement it and the C-141 and eventually replacing the latter.", 
        "threadID": "672198221_1220056812001", 
        "time": "2009-03-23 18:21:00", 
        "title": "DoD Cancellation Decisions Imminent", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by DocKem: Please correct me if I'm wrong, but doesn't one B2 have a price tag of 1/3 the cost of an Aircraft Carrier. Nearly 50%! B-2 is $2 billion, Nimitz Class ~$4.5 billion! CVN-78 about $2 billion higher. Then add cost of airwing.", 
        "intTime": 20090323, 
        "postID": 14, 
        "quote": "Originally posted by Knele: quote: Originally posted by DocKem: Please correct me if I'm wrong, but doesn't one B2 have a price tag of 1/3 the cost of an Aircraft Carrier. Nearly 50%! B-2 is $2 billion, Nimitz Class ~$4.5 billion!", 
        "reply": " CVN-78 about $2 billion higher. Then add cost of airwing.", 
        "threadID": "672198221_1220056812001", 
        "time": "2009-03-23 18:22:00", 
        "title": "DoD Cancellation Decisions Imminent", 
        "userID": "sw614"
    }
]