[
    {
        "content": "quote: WASHINGTON - President Barack Obama is leaving the door open to possible prosecution of Bush administration officials who devised harsh terrorism-era interrogation tactics. He also said today that he worries about the impact of high-intensity hearings on how detainees were treated under former President George W. Bush. But Obama did say, nevertheless, he could support a congressional investigation if it were conducted in a bipartisan way. Obama has said he does not support charging CIA agents and interrogators who took part in waterboarding and other harsh interrogation tactics, acting on advice from superiors that such practices were legal. But he also said that it is up to the attorney general whether to prosecute Bush administration lawyers who wrote the memos approving these tactics. Obama's chief of staff, Rahm Emanuel, had said this weekend that the Obama adminstration would not seek prosecution of the Bush administration lawyers. Last week, Obama's Justice Department published previously classified memos that described the Bush administration's legal justification for CIA interrogation techniques that included methods criticized as torture. Republican lawmakers and former CIA chiefs have criticized the release of the memos, contending that revealing the limits of interrogation techniques will hamper the effectiveness of interrogators. Yesterday Obama went to the spy agency's Virginia headquarters to defend his decision to release the memos and bolster the morale of its employees. \"I acted primarily because of the exceptional circumstances that surrounded these memos, particularly the fact that so much of the information was public,\" Obama said. He also said a court case was going to force the memos to be released and that much of what they contained had already been compromised through leaks to news media. The president urged the hundreds of CIA employees who gathered in a secure auditorium to ignore the recent controversy. \"Don't be discouraged by what's happened the last few weeks,\" he said. A round of cheers erupted when CIA Director Leon Panetta introduced Obama, who quickly reassured them that they had his backing. \"I know the last few days have been difficult,\" he said. \"You need to know you've got my full support.\" NO ONE should be above the law! +http://primebuzz.kcstar.com/?q=node/18142 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 1, 
        "quote": "WASHINGTON - President Barack Obama is leaving the door open to possible prosecution of Bush administration officials who devised harsh terrorism-era interrogation tactics. He also said today that he worries about the impact of high-intensity hearings on how detainees were treated under former President George W. Bush. But Obama did say, nevertheless, he could support a congressional investigation if it were conducted in a bipartisan way. Obama has said he does not support charging CIA agents and interrogators who took part in waterboarding and other harsh interrogation tactics, acting on advice from superiors that such practices were legal. But he also said that it is up to the attorney general whether to prosecute Bush administration lawyers who wrote the memos approving these tactics. Obama's chief of staff, Rahm Emanuel, had said this weekend that the Obama adminstration would not seek prosecution of the Bush administration lawyers. Last week, Obama's Justice Department published previously classified memos that described the Bush administration's legal justification for CIA interrogation techniques that included methods criticized as torture. Republican lawmakers and former CIA chiefs have criticized the release of the memos, contending that revealing the limits of interrogation techniques will hamper the effectiveness of interrogators. Yesterday Obama went to the spy agency's Virginia headquarters to defend his decision to release the memos and bolster the morale of its employees. \"I acted primarily because of the exceptional circumstances that surrounded these memos, particularly the fact that so much of the information was public,\" Obama said. He also said a court case was going to force the memos to be released and that much of what they contained had already been compromised through leaks to news media. The president urged the hundreds of CIA employees who gathered in a secure auditorium to ignore the recent controversy. \"Don't be discouraged by what's happened the last few weeks,\" he said. A round of cheers erupted when CIA Director Leon Panetta introduced Obama, who quickly reassured them that they had his backing. \"I know the last few days have been difficult,\" he said. \"You need to know you've got my full support.\"", 
        "reply": " NO ONE should be above the law! +http://primebuzz.kcstar.com/?q=node/18142 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:05:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "NSNN"
    }, 
    {
        "content": "Last time I checked we executed Nazi Guards just as well as the Nazi Leadership.... Now, i'm not trying to compare the Nazi government with the previous administration, but if they prosecute the people who authorized these techniques then how on earth will they not prosecute the grunt at the CIA?? Or those in the Military? Obama says one thing and does another in a matter of hours... ********", 
        "intTime": 20090421, 
        "postID": 2, 
        "quote": "", 
        "reply": "Last time I checked we executed Nazi Guards just as well as the Nazi Leadership.... Now, i'm not trying to compare the Nazi government with the previous administration, but if they prosecute the people who authorized these techniques then how on earth will they not prosecute the grunt at the CIA?? Or those in the Military? Obama says one thing and does another in a matter of hours... ********", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:10:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "more from the great divider...", 
        "intTime": 20090421, 
        "postID": 3, 
        "quote": "", 
        "reply": "more from the great divider...", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:21:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "outlaws93"
    }, 
    {
        "content": "David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters.", 
        "intTime": 20090421, 
        "postID": 4, 
        "quote": "", 
        "reply": "David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:27:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters. read the statement. It was Obama speaking, not Axelrod or the press secretary. Not wanting to agree with this \"above the law bull\" but I'd welcome a complete review of what information was given and the informants to the media that leaked information about national security. They ought to be shot. You'd be surprise at what the CIA (who were pizzed at releasing this info) and our young men and women do everyday that you will never learn of. Now you want to tied their hands behind their backs and you're going to end suffering another 911. Guaranteed.", 
        "intTime": 20090421, 
        "postID": 5, 
        "quote": "Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters.", 
        "reply": " read the statement. It was Obama speaking, not Axelrod or the press secretary. Not wanting to agree with this \"above the law bull\" but I'd welcome a complete review of what information was given and the informants to the media that leaked information about national security. They ought to be shot. You'd be surprise at what the CIA (who were pizzed at releasing this info) and our young men and women do everyday that you will never learn of. Now you want to tied their hands behind their backs and you're going to end suffering another 911. Guaranteed.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:37:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "I am really really curious about how there can be a \"congressional investigation\" (of an entirely partisan effort) conducted in a bipartisan way. It would be easier to get the stink out of sht than to get partisan politics out of Washington.", 
        "intTime": 20090421, 
        "postID": 6, 
        "quote": "", 
        "reply": "I am really really curious about how there can be a \"congressional investigation\" (of an entirely partisan effort) conducted in a bipartisan way. It would be easier to get the stink out of sht than to get partisan politics out of Washington.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:00:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters. read the statement. It was Obama speaking, not Axelrod or the press secretary. Not wanting to agree with this \"above the law bull\" but I'd welcome a complete review of what information was given and the informants to the media that leaked information about national security. They ought to be shot. You'd be surprise at what the CIA (who were pizzed at releasing this info) and our young men and women do everyday that you will never learn of. Now you want to tied their hands behind their backs and you're going to end suffering another 911. Guaranteed. If the previous administration had been totally and dead silent, I would still argue with you, but at least you would have a leg to stand on. But the previous administration systamatically leaked information, and systamatically lied about the entire affair. You have no problem with self serving leaks, All of your animosity is reserved for hearing the truth. This may come as a shock Ray, but I suspect that the American People as a Nation are as appalled as I am over this use of torture. So polls would indicate. \"http://www.globaldashboard.org/wp-content/uploads/wpo_torture_jun08_graph1.jpg\" The above reflects old polls that took place before these memos were released (Right, I know, releasing the memos is really treason) Well, sorry to let you know about this, but the American People are the ones who do the deciding in our country - And you are in a small minority. And your minority, has only one refrain: \"We like ignorance, we like ignorance. Telling us the truth is treason.\" And when the memo says that torture provided NO INFORMATION, you tell us that this proves that if we stop using it, we will get bombed. Dave", 
        "intTime": 20090421, 
        "postID": 7, 
        "quote": "Originally posted by rayevinsonsr: quote: Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters. read the statement. It was Obama speaking, not Axelrod or the press secretary. Not wanting to agree with this \"above the law bull\" but I'd welcome a complete review of what information was given and the informants to the media that leaked information about national security. They ought to be shot. You'd be surprise at what the CIA (who were pizzed at releasing this info) and our young men and women do everyday that you will never learn of. Now you want to tied their hands behind their backs and you're going to end suffering another 911. Guaranteed.", 
        "reply": " If the previous administration had been totally and dead silent, I would still argue with you, but at least you would have a leg to stand on. But the previous administration systamatically leaked information, and systamatically lied about the entire affair. You have no problem with self serving leaks, All of your animosity is reserved for hearing the truth. This may come as a shock Ray, but I suspect that the American People as a Nation are as appalled as I am over this use of torture. So polls would indicate. \"http://www.globaldashboard.org/wp-content/uploads/wpo_torture_jun08_graph1.jpg\" The above reflects old polls that took place before these memos were released (Right, I know, releasing the memos is really treason) Well, sorry to let you know about this, but the American People are the ones who do the deciding in our country - And you are in a small minority. And your minority, has only one refrain: \"We like ignorance, we like ignorance. Telling us the truth is treason.\" And when the memo says that torture provided NO INFORMATION, you tell us that this proves that if we stop using it, we will get bombed. Dave", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:04:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Grachus"
    }, 
    {
        "content": "An interesting thought was brought up on a Talk Radio yesterday. It probably would not be a good idea that this administration prosecute anyone from the Bush administration. Simply because the next time the Republican have control they could play tit for tat with the Obama administration when it leaves office and prosecute their official. As much as I would like to see Bush and his cronies go down, unless we want this to happen everytime one party gets control from the other it is best not done. Frisco", 
        "intTime": 20090421, 
        "postID": 8, 
        "quote": "", 
        "reply": "An interesting thought was brought up on a Talk Radio yesterday. It probably would not be a good idea that this administration prosecute anyone from the Bush administration. Simply because the next time the Republican have control they could play tit for tat with the Obama administration when it leaves office and prosecute their official. As much as I would like to see Bush and his cronies go down, unless we want this to happen everytime one party gets control from the other it is best not done. Frisco", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:06:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "FriscoLady01"
    }, 
    {
        "content": "quote: Originally posted by FriscoLady01: An interesting thought was brought up on a Talk Radio yesterday. It probably would not be a good idea that this administration prosecute anyone from the Bush administration. Simply because the next time the Republican have control they could play tit for tat with the Obama administration when it leaves office and prosecute their official. As much as I would like to see Bush and his cronies go down, unless we want this to happen everytime one party gets control from the other it is best not done. Frisco That probably only applies if the Obama Administration violates the Geneva Convension, The Constitution of the United States and Federal Law. On the other hand he might have already done that by taking prosecutions off the table.", 
        "intTime": 20090421, 
        "postID": 9, 
        "quote": "Originally posted by FriscoLady01: An interesting thought was brought up on a Talk Radio yesterday. It probably would not be a good idea that this administration prosecute anyone from the Bush administration. Simply because the next time the Republican have control they could play tit for tat with the Obama administration when it leaves office and prosecute their official. As much as I would like to see Bush and his cronies go down, unless we want this to happen everytime one party gets control from the other it is best not done. Frisco", 
        "reply": " That probably only applies if the Obama Administration violates the Geneva Convension, The Constitution of the United States and Federal Law. On the other hand he might have already done that by taking prosecutions off the table.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:29:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters. But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. And if those individuals choose to implicate Senior Bush Administration officials??? then I guess the chips have to fall as they may. Someone needs to set a very firm message that this sort of conduct is not to be tolerated... even if eyes have to get blackened.", 
        "intTime": 20090421, 
        "postID": 10, 
        "quote": "Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters.", 
        "reply": " But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. And if those individuals choose to implicate Senior Bush Administration officials??? then I guess the chips have to fall as they may. Someone needs to set a very firm message that this sort of conduct is not to be tolerated... even if eyes have to get blackened.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:39:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\"", 
        "intTime": 20090421, 
        "postID": 11, 
        "quote": "", 
        "reply": "Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\"", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:13:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\" Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding", 
        "intTime": 20090421, 
        "postID": 12, 
        "quote": "Originally posted by rayevinsonsr: Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\"", 
        "reply": " Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:16:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090421, 
        "postID": 13, 
        "quote": "Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used.", 
        "reply": " and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:17:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated.", 
        "intTime": 20090421, 
        "postID": 14, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh......", 
        "reply": " I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:21:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding Subject has been picked to death: Selective reading. If you looked at the procedures and the witness against the Japanese at trials you would find each and everyone was condemn for torture in which water cure was, or not part of it. Torture could be isolation for months, rat infestation, beating, breaking of bones, amputations etc. Making a general statement that they were convicted of waterboarding is untrue.", 
        "intTime": 20090421, 
        "postID": 15, 
        "quote": "Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding", 
        "reply": " Subject has been picked to death: Selective reading. If you looked at the procedures and the witness against the Japanese at trials you would find each and everyone was condemn for torture in which water cure was, or not part of it. Torture could be isolation for months, rat infestation, beating, breaking of bones, amputations etc. Making a general statement that they were convicted of waterboarding is untrue.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:25:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated. yepper, I think you are the correct one. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090421, 
        "postID": 16, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated.", 
        "reply": " yepper, I think you are the correct one. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:27:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by rayevinsonsr: Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\" Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding Ahh well we owe the Japanese an apology - Do we not? From their point of view, they just got bombed and had NO IDEA where the bombs came from. In order to \"save lives\" they decided to use \"harsh interogation\" methods. Why it sounds sooooooo just and fair. And then the kill joy Americans actually put them on trial and hung their sorry azzes. And can you believe it, I STILL think the verdict was just. Yeah, leftist that I am, I believe their acts were criminal, indefenisble, and just plain immoral - But then again, I'm a victim of US propaganda, which brain washed me into believing that America stands for better things. Dave", 
        "intTime": 20090421, 
        "postID": 17, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by rayevinsonsr: Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\" Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding", 
        "reply": " Ahh well we owe the Japanese an apology - Do we not? From their point of view, they just got bombed and had NO IDEA where the bombs came from. In order to \"save lives\" they decided to use \"harsh interogation\" methods. Why it sounds sooooooo just and fair. And then the kill joy Americans actually put them on trial and hung their sorry azzes. And can you believe it, I STILL think the verdict was just. Yeah, leftist that I am, I believe their acts were criminal, indefenisble, and just plain immoral - But then again, I'm a victim of US propaganda, which brain washed me into believing that America stands for better things. Dave", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:40:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding Subject has been picked to death: Selective reading. If you looked at the procedures and the witness against the Japanese at trials you would find each and everyone was condemn for torture in which water cure was, or not part of it. Torture could be isolation for months, rat infestation, beating, breaking of bones, amputations etc. Making a general statement that they were convicted of waterboarding is untrue. OK, are you saying before God and everyone that in your opinion, waterboarding is not torture?", 
        "intTime": 20090421, 
        "postID": 18, 
        "quote": "Originally posted by rayevinsonsr: quote: Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding Subject has been picked to death: Selective reading. If you looked at the procedures and the witness against the Japanese at trials you would find each and everyone was condemn for torture in which water cure was, or not part of it. Torture could be isolation for months, rat infestation, beating, breaking of bones, amputations etc. Making a general statement that they were convicted of waterboarding is untrue.", 
        "reply": " OK, are you saying before God and everyone that in your opinion, waterboarding is not torture?", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:43:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "Yes, Mr. Obama is doing his best to reduce the greatest nation on Earth into a Banana Republic. And he desperately needs YOUR HELP to continue spreading hate and deviciveness. So far, so good!", 
        "intTime": 20090421, 
        "postID": 19, 
        "quote": "", 
        "reply": "Yes, Mr. Obama is doing his best to reduce the greatest nation on Earth into a Banana Republic. And he desperately needs YOUR HELP to continue spreading hate and deviciveness. So far, so good!", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:43:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated. Regardless of who is what, and isn't what, the door is now open to prosecute those that would impliment and conduct criminal activity under the color of authority within the Office of the President of the United States. At this point the Obama Administration is ONLY talking about prosecuting those that actually committed the crime(s). Now if those people (that potentially come under indictment) decide later on to rat out the Cabinet or Office of the Vice President... well that issue will be decided at that point. So what do you guys think? Do you think the memo writing rats will turn on their old bosses? It could get kinda steamed if they do.", 
        "intTime": 20090421, 
        "postID": 20, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated.", 
        "reply": " Regardless of who is what, and isn't what, the door is now open to prosecute those that would impliment and conduct criminal activity under the color of authority within the Office of the President of the United States. At this point the Obama Administration is ONLY talking about prosecuting those that actually committed the crime(s). Now if those people (that potentially come under indictment) decide later on to rat out the Cabinet or Office of the Vice President... well that issue will be decided at that point. So what do you guys think? Do you think the memo writing rats will turn on their old bosses? It could get kinda steamed if they do.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 13:44:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: WASHINGTON - President Barack Obama is leaving the door open to possible prosecution of Bush administration officials who devised harsh terrorism-era interrogation tactics. He also said today that he worries about the impact of high-intensity hearings on how detainees were treated under former President George W. Bush. But Obama did say, nevertheless, he could support a congressional investigation if it were conducted in a bipartisan way. Obama has said he does not support charging CIA agents and interrogators who took part in waterboarding and other harsh interrogation tactics, acting on advice from superiors that such practices were legal. But he also said that it is up to the attorney general whether to prosecute Bush administration lawyers who wrote the memos approving these tactics. Obama's chief of staff, Rahm Emanuel, had said this weekend that the Obama adminstration would not seek prosecution of the Bush administration lawyers. Last week, Obama's Justice Department published previously classified memos that described the Bush administration's legal justification for CIA interrogation techniques that included methods criticized as torture. Republican lawmakers and former CIA chiefs have criticized the release of the memos, contending that revealing the limits of interrogation techniques will hamper the effectiveness of interrogators. Yesterday Obama went to the spy agency's Virginia headquarters to defend his decision to release the memos and bolster the morale of its employees. \"I acted primarily because of the exceptional circumstances that surrounded these memos, particularly the fact that so much of the information was public,\" Obama said. He also said a court case was going to force the memos to be released and that much of what they contained had already been compromised through leaks to news media. The president urged the hundreds of CIA employees who gathered in a secure auditorium to ignore the recent controversy. \"Don't be discouraged by what's happened the last few weeks,\" he said. A round of cheers erupted when CIA Director Leon Panetta introduced Obama, who quickly reassured them that they had his backing. \"I know the last few days have been difficult,\" he said. \"You need to know you've got my full support.\" NO ONE should be above the law! +http://primebuzz.kcstar.com/?q=node/18142 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 21, 
        "quote": "WASHINGTON - President Barack Obama is leaving the door open to possible prosecution of Bush administration officials who devised harsh terrorism-era interrogation tactics. He also said today that he worries about the impact of high-intensity hearings on how detainees were treated under former President George W. Bush. But Obama did say, nevertheless, he could support a congressional investigation if it were conducted in a bipartisan way. Obama has said he does not support charging CIA agents and interrogators who took part in waterboarding and other harsh interrogation tactics, acting on advice from superiors that such practices were legal. But he also said that it is up to the attorney general whether to prosecute Bush administration lawyers who wrote the memos approving these tactics. Obama's chief of staff, Rahm Emanuel, had said this weekend that the Obama adminstration would not seek prosecution of the Bush administration lawyers. Last week, Obama's Justice Department published previously classified memos that described the Bush administration's legal justification for CIA interrogation techniques that included methods criticized as torture. Republican lawmakers and former CIA chiefs have criticized the release of the memos, contending that revealing the limits of interrogation techniques will hamper the effectiveness of interrogators. Yesterday Obama went to the spy agency's Virginia headquarters to defend his decision to release the memos and bolster the morale of its employees. \"I acted primarily because of the exceptional circumstances that surrounded these memos, particularly the fact that so much of the information was public,\" Obama said. He also said a court case was going to force the memos to be released and that much of what they contained had already been compromised through leaks to news media. The president urged the hundreds of CIA employees who gathered in a secure auditorium to ignore the recent controversy. \"Don't be discouraged by what's happened the last few weeks,\" he said. A round of cheers erupted when CIA Director Leon Panetta introduced Obama, who quickly reassured them that they had his backing. \"I know the last few days have been difficult,\" he said. \"You need to know you've got my full support.\"", 
        "reply": " NO ONE should be above the law! +http://primebuzz.kcstar.com/?q=node/18142 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:05:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "NSNN"
    }, 
    {
        "content": "Last time I checked we executed Nazi Guards just as well as the Nazi Leadership.... Now, i'm not trying to compare the Nazi government with the previous administration, but if they prosecute the people who authorized these techniques then how on earth will they not prosecute the grunt at the CIA?? Or those in the Military? Obama says one thing and does another in a matter of hours... ********", 
        "intTime": 20090421, 
        "postID": 22, 
        "quote": "", 
        "reply": "Last time I checked we executed Nazi Guards just as well as the Nazi Leadership.... Now, i'm not trying to compare the Nazi government with the previous administration, but if they prosecute the people who authorized these techniques then how on earth will they not prosecute the grunt at the CIA?? Or those in the Military? Obama says one thing and does another in a matter of hours... ********", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:10:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "more from the great divider...", 
        "intTime": 20090421, 
        "postID": 23, 
        "quote": "", 
        "reply": "more from the great divider...", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:21:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "outlaws93"
    }, 
    {
        "content": "David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters.", 
        "intTime": 20090421, 
        "postID": 24, 
        "quote": "", 
        "reply": "David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:27:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters. read the statement. It was Obama speaking, not Axelrod or the press secretary. Not wanting to agree with this \"above the law bull\" but I'd welcome a complete review of what information was given and the informants to the media that leaked information about national security. They ought to be shot. You'd be surprise at what the CIA (who were pizzed at releasing this info) and our young men and women do everyday that you will never learn of. Now you want to tied their hands behind their backs and you're going to end suffering another 911. Guaranteed.", 
        "intTime": 20090421, 
        "postID": 25, 
        "quote": "Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters.", 
        "reply": " read the statement. It was Obama speaking, not Axelrod or the press secretary. Not wanting to agree with this \"above the law bull\" but I'd welcome a complete review of what information was given and the informants to the media that leaked information about national security. They ought to be shot. You'd be surprise at what the CIA (who were pizzed at releasing this info) and our young men and women do everyday that you will never learn of. Now you want to tied their hands behind their backs and you're going to end suffering another 911. Guaranteed.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:37:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "I am really really curious about how there can be a \"congressional investigation\" (of an entirely partisan effort) conducted in a bipartisan way. It would be easier to get the stink out of sht than to get partisan politics out of Washington.", 
        "intTime": 20090421, 
        "postID": 26, 
        "quote": "", 
        "reply": "I am really really curious about how there can be a \"congressional investigation\" (of an entirely partisan effort) conducted in a bipartisan way. It would be easier to get the stink out of sht than to get partisan politics out of Washington.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:00:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters. read the statement. It was Obama speaking, not Axelrod or the press secretary. Not wanting to agree with this \"above the law bull\" but I'd welcome a complete review of what information was given and the informants to the media that leaked information about national security. They ought to be shot. You'd be surprise at what the CIA (who were pizzed at releasing this info) and our young men and women do everyday that you will never learn of. Now you want to tied their hands behind their backs and you're going to end suffering another 911. Guaranteed. If the previous administration had been totally and dead silent, I would still argue with you, but at least you would have a leg to stand on. But the previous administration systamatically leaked information, and systamatically lied about the entire affair. You have no problem with self serving leaks, All of your animosity is reserved for hearing the truth. This may come as a shock Ray, but I suspect that the American People as a Nation are as appalled as I am over this use of torture. So polls would indicate. \"http://www.globaldashboard.org/wp-content/uploads/wpo_torture_jun08_graph1.jpg\" The above reflects old polls that took place before these memos were released (Right, I know, releasing the memos is really treason) Well, sorry to let you know about this, but the American People are the ones who do the deciding in our country - And you are in a small minority. And your minority, has only one refrain: \"We like ignorance, we like ignorance. Telling us the truth is treason.\" And when the memo says that torture provided NO INFORMATION, you tell us that this proves that if we stop using it, we will get bombed. Dave", 
        "intTime": 20090421, 
        "postID": 27, 
        "quote": "Originally posted by rayevinsonsr: quote: Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters. read the statement. It was Obama speaking, not Axelrod or the press secretary. Not wanting to agree with this \"above the law bull\" but I'd welcome a complete review of what information was given and the informants to the media that leaked information about national security. They ought to be shot. You'd be surprise at what the CIA (who were pizzed at releasing this info) and our young men and women do everyday that you will never learn of. Now you want to tied their hands behind their backs and you're going to end suffering another 911. Guaranteed.", 
        "reply": " If the previous administration had been totally and dead silent, I would still argue with you, but at least you would have a leg to stand on. But the previous administration systamatically leaked information, and systamatically lied about the entire affair. You have no problem with self serving leaks, All of your animosity is reserved for hearing the truth. This may come as a shock Ray, but I suspect that the American People as a Nation are as appalled as I am over this use of torture. So polls would indicate. \"http://www.globaldashboard.org/wp-content/uploads/wpo_torture_jun08_graph1.jpg\" The above reflects old polls that took place before these memos were released (Right, I know, releasing the memos is really treason) Well, sorry to let you know about this, but the American People are the ones who do the deciding in our country - And you are in a small minority. And your minority, has only one refrain: \"We like ignorance, we like ignorance. Telling us the truth is treason.\" And when the memo says that torture provided NO INFORMATION, you tell us that this proves that if we stop using it, we will get bombed. Dave", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:04:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Grachus"
    }, 
    {
        "content": "An interesting thought was brought up on a Talk Radio yesterday. It probably would not be a good idea that this administration prosecute anyone from the Bush administration. Simply because the next time the Republican have control they could play tit for tat with the Obama administration when it leaves office and prosecute their official. As much as I would like to see Bush and his cronies go down, unless we want this to happen everytime one party gets control from the other it is best not done. Frisco", 
        "intTime": 20090421, 
        "postID": 28, 
        "quote": "", 
        "reply": "An interesting thought was brought up on a Talk Radio yesterday. It probably would not be a good idea that this administration prosecute anyone from the Bush administration. Simply because the next time the Republican have control they could play tit for tat with the Obama administration when it leaves office and prosecute their official. As much as I would like to see Bush and his cronies go down, unless we want this to happen everytime one party gets control from the other it is best not done. Frisco", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:06:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "FriscoLady01"
    }, 
    {
        "content": "quote: Originally posted by FriscoLady01: An interesting thought was brought up on a Talk Radio yesterday. It probably would not be a good idea that this administration prosecute anyone from the Bush administration. Simply because the next time the Republican have control they could play tit for tat with the Obama administration when it leaves office and prosecute their official. As much as I would like to see Bush and his cronies go down, unless we want this to happen everytime one party gets control from the other it is best not done. Frisco That probably only applies if the Obama Administration violates the Geneva Convension, The Constitution of the United States and Federal Law. On the other hand he might have already done that by taking prosecutions off the table.", 
        "intTime": 20090421, 
        "postID": 29, 
        "quote": "Originally posted by FriscoLady01: An interesting thought was brought up on a Talk Radio yesterday. It probably would not be a good idea that this administration prosecute anyone from the Bush administration. Simply because the next time the Republican have control they could play tit for tat with the Obama administration when it leaves office and prosecute their official. As much as I would like to see Bush and his cronies go down, unless we want this to happen everytime one party gets control from the other it is best not done. Frisco", 
        "reply": " That probably only applies if the Obama Administration violates the Geneva Convension, The Constitution of the United States and Federal Law. On the other hand he might have already done that by taking prosecutions off the table.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:29:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters. But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. And if those individuals choose to implicate Senior Bush Administration officials??? then I guess the chips have to fall as they may. Someone needs to set a very firm message that this sort of conduct is not to be tolerated... even if eyes have to get blackened.", 
        "intTime": 20090421, 
        "postID": 30, 
        "quote": "Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters.", 
        "reply": " But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. And if those individuals choose to implicate Senior Bush Administration officials??? then I guess the chips have to fall as they may. Someone needs to set a very firm message that this sort of conduct is not to be tolerated... even if eyes have to get blackened.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:39:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\"", 
        "intTime": 20090421, 
        "postID": 31, 
        "quote": "", 
        "reply": "Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\"", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:13:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\" Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding", 
        "intTime": 20090421, 
        "postID": 32, 
        "quote": "Originally posted by rayevinsonsr: Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\"", 
        "reply": " Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:16:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090421, 
        "postID": 33, 
        "quote": "Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used.", 
        "reply": " and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:17:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated.", 
        "intTime": 20090421, 
        "postID": 34, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh......", 
        "reply": " I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:21:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding Subject has been picked to death: Selective reading. If you looked at the procedures and the witness against the Japanese at trials you would find each and everyone was condemn for torture in which water cure was, or not part of it. Torture could be isolation for months, rat infestation, beating, breaking of bones, amputations etc. Making a general statement that they were convicted of waterboarding is untrue.", 
        "intTime": 20090421, 
        "postID": 35, 
        "quote": "Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding", 
        "reply": " Subject has been picked to death: Selective reading. If you looked at the procedures and the witness against the Japanese at trials you would find each and everyone was condemn for torture in which water cure was, or not part of it. Torture could be isolation for months, rat infestation, beating, breaking of bones, amputations etc. Making a general statement that they were convicted of waterboarding is untrue.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:25:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated. yepper, I think you are the correct one. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090421, 
        "postID": 36, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated.", 
        "reply": " yepper, I think you are the correct one. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:27:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by rayevinsonsr: Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\" Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding Ahh well we owe the Japanese an apology - Do we not? From their point of view, they just got bombed and had NO IDEA where the bombs came from. In order to \"save lives\" they decided to use \"harsh interogation\" methods. Why it sounds sooooooo just and fair. And then the kill joy Americans actually put them on trial and hung their sorry azzes. And can you believe it, I STILL think the verdict was just. Yeah, leftist that I am, I believe their acts were criminal, indefenisble, and just plain immoral - But then again, I'm a victim of US propaganda, which brain washed me into believing that America stands for better things. Dave", 
        "intTime": 20090421, 
        "postID": 37, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by rayevinsonsr: Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\" Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding", 
        "reply": " Ahh well we owe the Japanese an apology - Do we not? From their point of view, they just got bombed and had NO IDEA where the bombs came from. In order to \"save lives\" they decided to use \"harsh interogation\" methods. Why it sounds sooooooo just and fair. And then the kill joy Americans actually put them on trial and hung their sorry azzes. And can you believe it, I STILL think the verdict was just. Yeah, leftist that I am, I believe their acts were criminal, indefenisble, and just plain immoral - But then again, I'm a victim of US propaganda, which brain washed me into believing that America stands for better things. Dave", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:40:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding Subject has been picked to death: Selective reading. If you looked at the procedures and the witness against the Japanese at trials you would find each and everyone was condemn for torture in which water cure was, or not part of it. Torture could be isolation for months, rat infestation, beating, breaking of bones, amputations etc. Making a general statement that they were convicted of waterboarding is untrue. OK, are you saying before God and everyone that in your opinion, waterboarding is not torture?", 
        "intTime": 20090421, 
        "postID": 38, 
        "quote": "Originally posted by rayevinsonsr: quote: Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding Subject has been picked to death: Selective reading. If you looked at the procedures and the witness against the Japanese at trials you would find each and everyone was condemn for torture in which water cure was, or not part of it. Torture could be isolation for months, rat infestation, beating, breaking of bones, amputations etc. Making a general statement that they were convicted of waterboarding is untrue.", 
        "reply": " OK, are you saying before God and everyone that in your opinion, waterboarding is not torture?", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:43:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "Yes, Mr. Obama is doing his best to reduce the greatest nation on Earth into a Banana Republic. And he desperately needs YOUR HELP to continue spreading hate and deviciveness. So far, so good!", 
        "intTime": 20090421, 
        "postID": 39, 
        "quote": "", 
        "reply": "Yes, Mr. Obama is doing his best to reduce the greatest nation on Earth into a Banana Republic. And he desperately needs YOUR HELP to continue spreading hate and deviciveness. So far, so good!", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:43:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated. Regardless of who is what, and isn't what, the door is now open to prosecute those that would impliment and conduct criminal activity under the color of authority within the Office of the President of the United States. At this point the Obama Administration is ONLY talking about prosecuting those that actually committed the crime(s). Now if those people (that potentially come under indictment) decide later on to rat out the Cabinet or Office of the Vice President... well that issue will be decided at that point. So what do you guys think? Do you think the memo writing rats will turn on their old bosses? It could get kinda steamed if they do.", 
        "intTime": 20090421, 
        "postID": 40, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated.", 
        "reply": " Regardless of who is what, and isn't what, the door is now open to prosecute those that would impliment and conduct criminal activity under the color of authority within the Office of the President of the United States. At this point the Obama Administration is ONLY talking about prosecuting those that actually committed the crime(s). Now if those people (that potentially come under indictment) decide later on to rat out the Cabinet or Office of the Vice President... well that issue will be decided at that point. So what do you guys think? Do you think the memo writing rats will turn on their old bosses? It could get kinda steamed if they do.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 13:44:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: WASHINGTON - President Barack Obama is leaving the door open to possible prosecution of Bush administration officials who devised harsh terrorism-era interrogation tactics. He also said today that he worries about the impact of high-intensity hearings on how detainees were treated under former President George W. Bush. But Obama did say, nevertheless, he could support a congressional investigation if it were conducted in a bipartisan way. Obama has said he does not support charging CIA agents and interrogators who took part in waterboarding and other harsh interrogation tactics, acting on advice from superiors that such practices were legal. But he also said that it is up to the attorney general whether to prosecute Bush administration lawyers who wrote the memos approving these tactics. Obama's chief of staff, Rahm Emanuel, had said this weekend that the Obama adminstration would not seek prosecution of the Bush administration lawyers. Last week, Obama's Justice Department published previously classified memos that described the Bush administration's legal justification for CIA interrogation techniques that included methods criticized as torture. Republican lawmakers and former CIA chiefs have criticized the release of the memos, contending that revealing the limits of interrogation techniques will hamper the effectiveness of interrogators. Yesterday Obama went to the spy agency's Virginia headquarters to defend his decision to release the memos and bolster the morale of its employees. \"I acted primarily because of the exceptional circumstances that surrounded these memos, particularly the fact that so much of the information was public,\" Obama said. He also said a court case was going to force the memos to be released and that much of what they contained had already been compromised through leaks to news media. The president urged the hundreds of CIA employees who gathered in a secure auditorium to ignore the recent controversy. \"Don't be discouraged by what's happened the last few weeks,\" he said. A round of cheers erupted when CIA Director Leon Panetta introduced Obama, who quickly reassured them that they had his backing. \"I know the last few days have been difficult,\" he said. \"You need to know you've got my full support.\" NO ONE should be above the law! +http://primebuzz.kcstar.com/?q=node/18142 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 41, 
        "quote": "WASHINGTON - President Barack Obama is leaving the door open to possible prosecution of Bush administration officials who devised harsh terrorism-era interrogation tactics. He also said today that he worries about the impact of high-intensity hearings on how detainees were treated under former President George W. Bush. But Obama did say, nevertheless, he could support a congressional investigation if it were conducted in a bipartisan way. Obama has said he does not support charging CIA agents and interrogators who took part in waterboarding and other harsh interrogation tactics, acting on advice from superiors that such practices were legal. But he also said that it is up to the attorney general whether to prosecute Bush administration lawyers who wrote the memos approving these tactics. Obama's chief of staff, Rahm Emanuel, had said this weekend that the Obama adminstration would not seek prosecution of the Bush administration lawyers. Last week, Obama's Justice Department published previously classified memos that described the Bush administration's legal justification for CIA interrogation techniques that included methods criticized as torture. Republican lawmakers and former CIA chiefs have criticized the release of the memos, contending that revealing the limits of interrogation techniques will hamper the effectiveness of interrogators. Yesterday Obama went to the spy agency's Virginia headquarters to defend his decision to release the memos and bolster the morale of its employees. \"I acted primarily because of the exceptional circumstances that surrounded these memos, particularly the fact that so much of the information was public,\" Obama said. He also said a court case was going to force the memos to be released and that much of what they contained had already been compromised through leaks to news media. The president urged the hundreds of CIA employees who gathered in a secure auditorium to ignore the recent controversy. \"Don't be discouraged by what's happened the last few weeks,\" he said. A round of cheers erupted when CIA Director Leon Panetta introduced Obama, who quickly reassured them that they had his backing. \"I know the last few days have been difficult,\" he said. \"You need to know you've got my full support.\"", 
        "reply": " NO ONE should be above the law! +http://primebuzz.kcstar.com/?q=node/18142 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:05:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "NSNN"
    }, 
    {
        "content": "Last time I checked we executed Nazi Guards just as well as the Nazi Leadership.... Now, i'm not trying to compare the Nazi government with the previous administration, but if they prosecute the people who authorized these techniques then how on earth will they not prosecute the grunt at the CIA?? Or those in the Military? Obama says one thing and does another in a matter of hours... ********", 
        "intTime": 20090421, 
        "postID": 42, 
        "quote": "", 
        "reply": "Last time I checked we executed Nazi Guards just as well as the Nazi Leadership.... Now, i'm not trying to compare the Nazi government with the previous administration, but if they prosecute the people who authorized these techniques then how on earth will they not prosecute the grunt at the CIA?? Or those in the Military? Obama says one thing and does another in a matter of hours... ********", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:10:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "more from the great divider...", 
        "intTime": 20090421, 
        "postID": 43, 
        "quote": "", 
        "reply": "more from the great divider...", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:21:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "outlaws93"
    }, 
    {
        "content": "David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters.", 
        "intTime": 20090421, 
        "postID": 44, 
        "quote": "", 
        "reply": "David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:27:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters. read the statement. It was Obama speaking, not Axelrod or the press secretary. Not wanting to agree with this \"above the law bull\" but I'd welcome a complete review of what information was given and the informants to the media that leaked information about national security. They ought to be shot. You'd be surprise at what the CIA (who were pizzed at releasing this info) and our young men and women do everyday that you will never learn of. Now you want to tied their hands behind their backs and you're going to end suffering another 911. Guaranteed.", 
        "intTime": 20090421, 
        "postID": 45, 
        "quote": "Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters.", 
        "reply": " read the statement. It was Obama speaking, not Axelrod or the press secretary. Not wanting to agree with this \"above the law bull\" but I'd welcome a complete review of what information was given and the informants to the media that leaked information about national security. They ought to be shot. You'd be surprise at what the CIA (who were pizzed at releasing this info) and our young men and women do everyday that you will never learn of. Now you want to tied their hands behind their backs and you're going to end suffering another 911. Guaranteed.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:37:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "I am really really curious about how there can be a \"congressional investigation\" (of an entirely partisan effort) conducted in a bipartisan way. It would be easier to get the stink out of sht than to get partisan politics out of Washington.", 
        "intTime": 20090421, 
        "postID": 46, 
        "quote": "", 
        "reply": "I am really really curious about how there can be a \"congressional investigation\" (of an entirely partisan effort) conducted in a bipartisan way. It would be easier to get the stink out of sht than to get partisan politics out of Washington.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:00:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters. read the statement. It was Obama speaking, not Axelrod or the press secretary. Not wanting to agree with this \"above the law bull\" but I'd welcome a complete review of what information was given and the informants to the media that leaked information about national security. They ought to be shot. You'd be surprise at what the CIA (who were pizzed at releasing this info) and our young men and women do everyday that you will never learn of. Now you want to tied their hands behind their backs and you're going to end suffering another 911. Guaranteed. If the previous administration had been totally and dead silent, I would still argue with you, but at least you would have a leg to stand on. But the previous administration systamatically leaked information, and systamatically lied about the entire affair. You have no problem with self serving leaks, All of your animosity is reserved for hearing the truth. This may come as a shock Ray, but I suspect that the American People as a Nation are as appalled as I am over this use of torture. So polls would indicate. \"http://www.globaldashboard.org/wp-content/uploads/wpo_torture_jun08_graph1.jpg\" The above reflects old polls that took place before these memos were released (Right, I know, releasing the memos is really treason) Well, sorry to let you know about this, but the American People are the ones who do the deciding in our country - And you are in a small minority. And your minority, has only one refrain: \"We like ignorance, we like ignorance. Telling us the truth is treason.\" And when the memo says that torture provided NO INFORMATION, you tell us that this proves that if we stop using it, we will get bombed. Dave", 
        "intTime": 20090421, 
        "postID": 47, 
        "quote": "Originally posted by rayevinsonsr: quote: Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters. read the statement. It was Obama speaking, not Axelrod or the press secretary. Not wanting to agree with this \"above the law bull\" but I'd welcome a complete review of what information was given and the informants to the media that leaked information about national security. They ought to be shot. You'd be surprise at what the CIA (who were pizzed at releasing this info) and our young men and women do everyday that you will never learn of. Now you want to tied their hands behind their backs and you're going to end suffering another 911. Guaranteed.", 
        "reply": " If the previous administration had been totally and dead silent, I would still argue with you, but at least you would have a leg to stand on. But the previous administration systamatically leaked information, and systamatically lied about the entire affair. You have no problem with self serving leaks, All of your animosity is reserved for hearing the truth. This may come as a shock Ray, but I suspect that the American People as a Nation are as appalled as I am over this use of torture. So polls would indicate. \"http://www.globaldashboard.org/wp-content/uploads/wpo_torture_jun08_graph1.jpg\" The above reflects old polls that took place before these memos were released (Right, I know, releasing the memos is really treason) Well, sorry to let you know about this, but the American People are the ones who do the deciding in our country - And you are in a small minority. And your minority, has only one refrain: \"We like ignorance, we like ignorance. Telling us the truth is treason.\" And when the memo says that torture provided NO INFORMATION, you tell us that this proves that if we stop using it, we will get bombed. Dave", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:04:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Grachus"
    }, 
    {
        "content": "An interesting thought was brought up on a Talk Radio yesterday. It probably would not be a good idea that this administration prosecute anyone from the Bush administration. Simply because the next time the Republican have control they could play tit for tat with the Obama administration when it leaves office and prosecute their official. As much as I would like to see Bush and his cronies go down, unless we want this to happen everytime one party gets control from the other it is best not done. Frisco", 
        "intTime": 20090421, 
        "postID": 48, 
        "quote": "", 
        "reply": "An interesting thought was brought up on a Talk Radio yesterday. It probably would not be a good idea that this administration prosecute anyone from the Bush administration. Simply because the next time the Republican have control they could play tit for tat with the Obama administration when it leaves office and prosecute their official. As much as I would like to see Bush and his cronies go down, unless we want this to happen everytime one party gets control from the other it is best not done. Frisco", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:06:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "FriscoLady01"
    }, 
    {
        "content": "quote: Originally posted by FriscoLady01: An interesting thought was brought up on a Talk Radio yesterday. It probably would not be a good idea that this administration prosecute anyone from the Bush administration. Simply because the next time the Republican have control they could play tit for tat with the Obama administration when it leaves office and prosecute their official. As much as I would like to see Bush and his cronies go down, unless we want this to happen everytime one party gets control from the other it is best not done. Frisco That probably only applies if the Obama Administration violates the Geneva Convension, The Constitution of the United States and Federal Law. On the other hand he might have already done that by taking prosecutions off the table.", 
        "intTime": 20090421, 
        "postID": 49, 
        "quote": "Originally posted by FriscoLady01: An interesting thought was brought up on a Talk Radio yesterday. It probably would not be a good idea that this administration prosecute anyone from the Bush administration. Simply because the next time the Republican have control they could play tit for tat with the Obama administration when it leaves office and prosecute their official. As much as I would like to see Bush and his cronies go down, unless we want this to happen everytime one party gets control from the other it is best not done. Frisco", 
        "reply": " That probably only applies if the Obama Administration violates the Geneva Convension, The Constitution of the United States and Federal Law. On the other hand he might have already done that by taking prosecutions off the table.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:29:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters. But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. And if those individuals choose to implicate Senior Bush Administration officials??? then I guess the chips have to fall as they may. Someone needs to set a very firm message that this sort of conduct is not to be tolerated... even if eyes have to get blackened.", 
        "intTime": 20090421, 
        "postID": 50, 
        "quote": "Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters.", 
        "reply": " But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. And if those individuals choose to implicate Senior Bush Administration officials??? then I guess the chips have to fall as they may. Someone needs to set a very firm message that this sort of conduct is not to be tolerated... even if eyes have to get blackened.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:39:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\"", 
        "intTime": 20090421, 
        "postID": 51, 
        "quote": "", 
        "reply": "Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\"", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:13:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\" Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding", 
        "intTime": 20090421, 
        "postID": 52, 
        "quote": "Originally posted by rayevinsonsr: Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\"", 
        "reply": " Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:16:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090421, 
        "postID": 53, 
        "quote": "Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used.", 
        "reply": " and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:17:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated.", 
        "intTime": 20090421, 
        "postID": 54, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh......", 
        "reply": " I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:21:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding Subject has been picked to death: Selective reading. If you looked at the procedures and the witness against the Japanese at trials you would find each and everyone was condemn for torture in which water cure was, or not part of it. Torture could be isolation for months, rat infestation, beating, breaking of bones, amputations etc. Making a general statement that they were convicted of waterboarding is untrue.", 
        "intTime": 20090421, 
        "postID": 55, 
        "quote": "Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding", 
        "reply": " Subject has been picked to death: Selective reading. If you looked at the procedures and the witness against the Japanese at trials you would find each and everyone was condemn for torture in which water cure was, or not part of it. Torture could be isolation for months, rat infestation, beating, breaking of bones, amputations etc. Making a general statement that they were convicted of waterboarding is untrue.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:25:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated. yepper, I think you are the correct one. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090421, 
        "postID": 56, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated.", 
        "reply": " yepper, I think you are the correct one. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:27:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by rayevinsonsr: Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\" Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding Ahh well we owe the Japanese an apology - Do we not? From their point of view, they just got bombed and had NO IDEA where the bombs came from. In order to \"save lives\" they decided to use \"harsh interogation\" methods. Why it sounds sooooooo just and fair. And then the kill joy Americans actually put them on trial and hung their sorry azzes. And can you believe it, I STILL think the verdict was just. Yeah, leftist that I am, I believe their acts were criminal, indefenisble, and just plain immoral - But then again, I'm a victim of US propaganda, which brain washed me into believing that America stands for better things. Dave", 
        "intTime": 20090421, 
        "postID": 57, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by rayevinsonsr: Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\" Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding", 
        "reply": " Ahh well we owe the Japanese an apology - Do we not? From their point of view, they just got bombed and had NO IDEA where the bombs came from. In order to \"save lives\" they decided to use \"harsh interogation\" methods. Why it sounds sooooooo just and fair. And then the kill joy Americans actually put them on trial and hung their sorry azzes. And can you believe it, I STILL think the verdict was just. Yeah, leftist that I am, I believe their acts were criminal, indefenisble, and just plain immoral - But then again, I'm a victim of US propaganda, which brain washed me into believing that America stands for better things. Dave", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:40:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding Subject has been picked to death: Selective reading. If you looked at the procedures and the witness against the Japanese at trials you would find each and everyone was condemn for torture in which water cure was, or not part of it. Torture could be isolation for months, rat infestation, beating, breaking of bones, amputations etc. Making a general statement that they were convicted of waterboarding is untrue. OK, are you saying before God and everyone that in your opinion, waterboarding is not torture?", 
        "intTime": 20090421, 
        "postID": 58, 
        "quote": "Originally posted by rayevinsonsr: quote: Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding Subject has been picked to death: Selective reading. If you looked at the procedures and the witness against the Japanese at trials you would find each and everyone was condemn for torture in which water cure was, or not part of it. Torture could be isolation for months, rat infestation, beating, breaking of bones, amputations etc. Making a general statement that they were convicted of waterboarding is untrue.", 
        "reply": " OK, are you saying before God and everyone that in your opinion, waterboarding is not torture?", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:43:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "Yes, Mr. Obama is doing his best to reduce the greatest nation on Earth into a Banana Republic. And he desperately needs YOUR HELP to continue spreading hate and deviciveness. So far, so good!", 
        "intTime": 20090421, 
        "postID": 59, 
        "quote": "", 
        "reply": "Yes, Mr. Obama is doing his best to reduce the greatest nation on Earth into a Banana Republic. And he desperately needs YOUR HELP to continue spreading hate and deviciveness. So far, so good!", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:43:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated. Regardless of who is what, and isn't what, the door is now open to prosecute those that would impliment and conduct criminal activity under the color of authority within the Office of the President of the United States. At this point the Obama Administration is ONLY talking about prosecuting those that actually committed the crime(s). Now if those people (that potentially come under indictment) decide later on to rat out the Cabinet or Office of the Vice President... well that issue will be decided at that point. So what do you guys think? Do you think the memo writing rats will turn on their old bosses? It could get kinda steamed if they do.", 
        "intTime": 20090421, 
        "postID": 60, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated.", 
        "reply": " Regardless of who is what, and isn't what, the door is now open to prosecute those that would impliment and conduct criminal activity under the color of authority within the Office of the President of the United States. At this point the Obama Administration is ONLY talking about prosecuting those that actually committed the crime(s). Now if those people (that potentially come under indictment) decide later on to rat out the Cabinet or Office of the Vice President... well that issue will be decided at that point. So what do you guys think? Do you think the memo writing rats will turn on their old bosses? It could get kinda steamed if they do.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 13:44:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: WASHINGTON - President Barack Obama is leaving the door open to possible prosecution of Bush administration officials who devised harsh terrorism-era interrogation tactics. He also said today that he worries about the impact of high-intensity hearings on how detainees were treated under former President George W. Bush. But Obama did say, nevertheless, he could support a congressional investigation if it were conducted in a bipartisan way. Obama has said he does not support charging CIA agents and interrogators who took part in waterboarding and other harsh interrogation tactics, acting on advice from superiors that such practices were legal. But he also said that it is up to the attorney general whether to prosecute Bush administration lawyers who wrote the memos approving these tactics. Obama's chief of staff, Rahm Emanuel, had said this weekend that the Obama adminstration would not seek prosecution of the Bush administration lawyers. Last week, Obama's Justice Department published previously classified memos that described the Bush administration's legal justification for CIA interrogation techniques that included methods criticized as torture. Republican lawmakers and former CIA chiefs have criticized the release of the memos, contending that revealing the limits of interrogation techniques will hamper the effectiveness of interrogators. Yesterday Obama went to the spy agency's Virginia headquarters to defend his decision to release the memos and bolster the morale of its employees. \"I acted primarily because of the exceptional circumstances that surrounded these memos, particularly the fact that so much of the information was public,\" Obama said. He also said a court case was going to force the memos to be released and that much of what they contained had already been compromised through leaks to news media. The president urged the hundreds of CIA employees who gathered in a secure auditorium to ignore the recent controversy. \"Don't be discouraged by what's happened the last few weeks,\" he said. A round of cheers erupted when CIA Director Leon Panetta introduced Obama, who quickly reassured them that they had his backing. \"I know the last few days have been difficult,\" he said. \"You need to know you've got my full support.\" NO ONE should be above the law! +http://primebuzz.kcstar.com/?q=node/18142 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 61, 
        "quote": "WASHINGTON - President Barack Obama is leaving the door open to possible prosecution of Bush administration officials who devised harsh terrorism-era interrogation tactics. He also said today that he worries about the impact of high-intensity hearings on how detainees were treated under former President George W. Bush. But Obama did say, nevertheless, he could support a congressional investigation if it were conducted in a bipartisan way. Obama has said he does not support charging CIA agents and interrogators who took part in waterboarding and other harsh interrogation tactics, acting on advice from superiors that such practices were legal. But he also said that it is up to the attorney general whether to prosecute Bush administration lawyers who wrote the memos approving these tactics. Obama's chief of staff, Rahm Emanuel, had said this weekend that the Obama adminstration would not seek prosecution of the Bush administration lawyers. Last week, Obama's Justice Department published previously classified memos that described the Bush administration's legal justification for CIA interrogation techniques that included methods criticized as torture. Republican lawmakers and former CIA chiefs have criticized the release of the memos, contending that revealing the limits of interrogation techniques will hamper the effectiveness of interrogators. Yesterday Obama went to the spy agency's Virginia headquarters to defend his decision to release the memos and bolster the morale of its employees. \"I acted primarily because of the exceptional circumstances that surrounded these memos, particularly the fact that so much of the information was public,\" Obama said. He also said a court case was going to force the memos to be released and that much of what they contained had already been compromised through leaks to news media. The president urged the hundreds of CIA employees who gathered in a secure auditorium to ignore the recent controversy. \"Don't be discouraged by what's happened the last few weeks,\" he said. A round of cheers erupted when CIA Director Leon Panetta introduced Obama, who quickly reassured them that they had his backing. \"I know the last few days have been difficult,\" he said. \"You need to know you've got my full support.\"", 
        "reply": " NO ONE should be above the law! +http://primebuzz.kcstar.com/?q=node/18142 \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:05:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "NSNN"
    }, 
    {
        "content": "Last time I checked we executed Nazi Guards just as well as the Nazi Leadership.... Now, i'm not trying to compare the Nazi government with the previous administration, but if they prosecute the people who authorized these techniques then how on earth will they not prosecute the grunt at the CIA?? Or those in the Military? Obama says one thing and does another in a matter of hours... ********", 
        "intTime": 20090421, 
        "postID": 62, 
        "quote": "", 
        "reply": "Last time I checked we executed Nazi Guards just as well as the Nazi Leadership.... Now, i'm not trying to compare the Nazi government with the previous administration, but if they prosecute the people who authorized these techniques then how on earth will they not prosecute the grunt at the CIA?? Or those in the Military? Obama says one thing and does another in a matter of hours... ********", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:10:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "more from the great divider...", 
        "intTime": 20090421, 
        "postID": 63, 
        "quote": "", 
        "reply": "more from the great divider...", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:21:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "outlaws93"
    }, 
    {
        "content": "David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters.", 
        "intTime": 20090421, 
        "postID": 64, 
        "quote": "", 
        "reply": "David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:27:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters. read the statement. It was Obama speaking, not Axelrod or the press secretary. Not wanting to agree with this \"above the law bull\" but I'd welcome a complete review of what information was given and the informants to the media that leaked information about national security. They ought to be shot. You'd be surprise at what the CIA (who were pizzed at releasing this info) and our young men and women do everyday that you will never learn of. Now you want to tied their hands behind their backs and you're going to end suffering another 911. Guaranteed.", 
        "intTime": 20090421, 
        "postID": 65, 
        "quote": "Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters.", 
        "reply": " read the statement. It was Obama speaking, not Axelrod or the press secretary. Not wanting to agree with this \"above the law bull\" but I'd welcome a complete review of what information was given and the informants to the media that leaked information about national security. They ought to be shot. You'd be surprise at what the CIA (who were pizzed at releasing this info) and our young men and women do everyday that you will never learn of. Now you want to tied their hands behind their backs and you're going to end suffering another 911. Guaranteed.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 10:37:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "I am really really curious about how there can be a \"congressional investigation\" (of an entirely partisan effort) conducted in a bipartisan way. It would be easier to get the stink out of sht than to get partisan politics out of Washington.", 
        "intTime": 20090421, 
        "postID": 66, 
        "quote": "", 
        "reply": "I am really really curious about how there can be a \"congressional investigation\" (of an entirely partisan effort) conducted in a bipartisan way. It would be easier to get the stink out of sht than to get partisan politics out of Washington.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:00:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters. read the statement. It was Obama speaking, not Axelrod or the press secretary. Not wanting to agree with this \"above the law bull\" but I'd welcome a complete review of what information was given and the informants to the media that leaked information about national security. They ought to be shot. You'd be surprise at what the CIA (who were pizzed at releasing this info) and our young men and women do everyday that you will never learn of. Now you want to tied their hands behind their backs and you're going to end suffering another 911. Guaranteed. If the previous administration had been totally and dead silent, I would still argue with you, but at least you would have a leg to stand on. But the previous administration systamatically leaked information, and systamatically lied about the entire affair. You have no problem with self serving leaks, All of your animosity is reserved for hearing the truth. This may come as a shock Ray, but I suspect that the American People as a Nation are as appalled as I am over this use of torture. So polls would indicate. \"http://www.globaldashboard.org/wp-content/uploads/wpo_torture_jun08_graph1.jpg\" The above reflects old polls that took place before these memos were released (Right, I know, releasing the memos is really treason) Well, sorry to let you know about this, but the American People are the ones who do the deciding in our country - And you are in a small minority. And your minority, has only one refrain: \"We like ignorance, we like ignorance. Telling us the truth is treason.\" And when the memo says that torture provided NO INFORMATION, you tell us that this proves that if we stop using it, we will get bombed. Dave", 
        "intTime": 20090421, 
        "postID": 67, 
        "quote": "Originally posted by rayevinsonsr: quote: Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters. read the statement. It was Obama speaking, not Axelrod or the press secretary. Not wanting to agree with this \"above the law bull\" but I'd welcome a complete review of what information was given and the informants to the media that leaked information about national security. They ought to be shot. You'd be surprise at what the CIA (who were pizzed at releasing this info) and our young men and women do everyday that you will never learn of. Now you want to tied their hands behind their backs and you're going to end suffering another 911. Guaranteed.", 
        "reply": " If the previous administration had been totally and dead silent, I would still argue with you, but at least you would have a leg to stand on. But the previous administration systamatically leaked information, and systamatically lied about the entire affair. You have no problem with self serving leaks, All of your animosity is reserved for hearing the truth. This may come as a shock Ray, but I suspect that the American People as a Nation are as appalled as I am over this use of torture. So polls would indicate. \"http://www.globaldashboard.org/wp-content/uploads/wpo_torture_jun08_graph1.jpg\" The above reflects old polls that took place before these memos were released (Right, I know, releasing the memos is really treason) Well, sorry to let you know about this, but the American People are the ones who do the deciding in our country - And you are in a small minority. And your minority, has only one refrain: \"We like ignorance, we like ignorance. Telling us the truth is treason.\" And when the memo says that torture provided NO INFORMATION, you tell us that this proves that if we stop using it, we will get bombed. Dave", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:04:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Grachus"
    }, 
    {
        "content": "An interesting thought was brought up on a Talk Radio yesterday. It probably would not be a good idea that this administration prosecute anyone from the Bush administration. Simply because the next time the Republican have control they could play tit for tat with the Obama administration when it leaves office and prosecute their official. As much as I would like to see Bush and his cronies go down, unless we want this to happen everytime one party gets control from the other it is best not done. Frisco", 
        "intTime": 20090421, 
        "postID": 68, 
        "quote": "", 
        "reply": "An interesting thought was brought up on a Talk Radio yesterday. It probably would not be a good idea that this administration prosecute anyone from the Bush administration. Simply because the next time the Republican have control they could play tit for tat with the Obama administration when it leaves office and prosecute their official. As much as I would like to see Bush and his cronies go down, unless we want this to happen everytime one party gets control from the other it is best not done. Frisco", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:06:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "FriscoLady01"
    }, 
    {
        "content": "quote: Originally posted by FriscoLady01: An interesting thought was brought up on a Talk Radio yesterday. It probably would not be a good idea that this administration prosecute anyone from the Bush administration. Simply because the next time the Republican have control they could play tit for tat with the Obama administration when it leaves office and prosecute their official. As much as I would like to see Bush and his cronies go down, unless we want this to happen everytime one party gets control from the other it is best not done. Frisco That probably only applies if the Obama Administration violates the Geneva Convension, The Constitution of the United States and Federal Law. On the other hand he might have already done that by taking prosecutions off the table.", 
        "intTime": 20090421, 
        "postID": 69, 
        "quote": "Originally posted by FriscoLady01: An interesting thought was brought up on a Talk Radio yesterday. It probably would not be a good idea that this administration prosecute anyone from the Bush administration. Simply because the next time the Republican have control they could play tit for tat with the Obama administration when it leaves office and prosecute their official. As much as I would like to see Bush and his cronies go down, unless we want this to happen everytime one party gets control from the other it is best not done. Frisco", 
        "reply": " That probably only applies if the Obama Administration violates the Geneva Convension, The Constitution of the United States and Federal Law. On the other hand he might have already done that by taking prosecutions off the table.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:29:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters. But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. And if those individuals choose to implicate Senior Bush Administration officials??? then I guess the chips have to fall as they may. Someone needs to set a very firm message that this sort of conduct is not to be tolerated... even if eyes have to get blackened.", 
        "intTime": 20090421, 
        "postID": 70, 
        "quote": "Originally posted by PhoenixDark: David Axelrod, one of the President's advisers has said that the Obama administration has no intent on pursuing prosecutions against Bush or his cabinet members due to them being a distraction from much more pressing matters.", 
        "reply": " But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. And if those individuals choose to implicate Senior Bush Administration officials??? then I guess the chips have to fall as they may. Someone needs to set a very firm message that this sort of conduct is not to be tolerated... even if eyes have to get blackened.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 11:39:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\"", 
        "intTime": 20090421, 
        "postID": 71, 
        "quote": "", 
        "reply": "Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\"", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:13:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\" Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding", 
        "intTime": 20090421, 
        "postID": 72, 
        "quote": "Originally posted by rayevinsonsr: Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\"", 
        "reply": " Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:16:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090421, 
        "postID": 73, 
        "quote": "Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used.", 
        "reply": " and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:17:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated.", 
        "intTime": 20090421, 
        "postID": 74, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh......", 
        "reply": " I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:21:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding Subject has been picked to death: Selective reading. If you looked at the procedures and the witness against the Japanese at trials you would find each and everyone was condemn for torture in which water cure was, or not part of it. Torture could be isolation for months, rat infestation, beating, breaking of bones, amputations etc. Making a general statement that they were convicted of waterboarding is untrue.", 
        "intTime": 20090421, 
        "postID": 75, 
        "quote": "Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding", 
        "reply": " Subject has been picked to death: Selective reading. If you looked at the procedures and the witness against the Japanese at trials you would find each and everyone was condemn for torture in which water cure was, or not part of it. Torture could be isolation for months, rat infestation, beating, breaking of bones, amputations etc. Making a general statement that they were convicted of waterboarding is untrue.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:25:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated. yepper, I think you are the correct one. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090421, 
        "postID": 76, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated.", 
        "reply": " yepper, I think you are the correct one. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:27:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by rayevinsonsr: Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\" Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding Ahh well we owe the Japanese an apology - Do we not? From their point of view, they just got bombed and had NO IDEA where the bombs came from. In order to \"save lives\" they decided to use \"harsh interogation\" methods. Why it sounds sooooooo just and fair. And then the kill joy Americans actually put them on trial and hung their sorry azzes. And can you believe it, I STILL think the verdict was just. Yeah, leftist that I am, I believe their acts were criminal, indefenisble, and just plain immoral - But then again, I'm a victim of US propaganda, which brain washed me into believing that America stands for better things. Dave", 
        "intTime": 20090421, 
        "postID": 77, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by rayevinsonsr: Strange as it seems you're right. You cannot open top secret information inquiry and expect that all concern will not be called for witnesses. The man to the right of the President yesterday, More than likely first witness called. The Asst Director of the CIA, a prime example. The full report of waterboarding, when the legal determination was made, by who, administration leverage applied, the whole operation of the CIA, NSC could be hauled into this. Is Congress the leading authority or the Attorney General? Can't have two investigations at the same time, how much CIA openness can we handle. Will there be an agent left in the CIA at the end of the trial? If you say the same thing often enough the American people will think it's true. I'm just wondering why anyone had to come to a conclusion that waterboarding was not lawful, or not. If it was against the law at the time, the accusers are saying they broke the law. But, there was NO LAW at that time! Or this time for that matter. Kind of like we can't arrest pirates for being pirates because the international law has not been written. There is no law that says the President can allow one to go free and another to go to jail for doing the same thing. \"Change we can believe in\" Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding", 
        "reply": " Ahh well we owe the Japanese an apology - Do we not? From their point of view, they just got bombed and had NO IDEA where the bombs came from. In order to \"save lives\" they decided to use \"harsh interogation\" methods. Why it sounds sooooooo just and fair. And then the kill joy Americans actually put them on trial and hung their sorry azzes. And can you believe it, I STILL think the verdict was just. Yeah, leftist that I am, I believe their acts were criminal, indefenisble, and just plain immoral - But then again, I'm a victim of US propaganda, which brain washed me into believing that America stands for better things. Dave", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:40:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: quote: Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding Subject has been picked to death: Selective reading. If you looked at the procedures and the witness against the Japanese at trials you would find each and everyone was condemn for torture in which water cure was, or not part of it. Torture could be isolation for months, rat infestation, beating, breaking of bones, amputations etc. Making a general statement that they were convicted of waterboarding is untrue. OK, are you saying before God and everyone that in your opinion, waterboarding is not torture?", 
        "intTime": 20090421, 
        "postID": 78, 
        "quote": "Originally posted by rayevinsonsr: quote: Funny, if there was no law regarding waterboarding...why did we convict and imprison Japanese soldiers who did it during WWII. \"http://en.wikipedia.org/wiki/Waterboarding Subject has been picked to death: Selective reading. If you looked at the procedures and the witness against the Japanese at trials you would find each and everyone was condemn for torture in which water cure was, or not part of it. Torture could be isolation for months, rat infestation, beating, breaking of bones, amputations etc. Making a general statement that they were convicted of waterboarding is untrue.", 
        "reply": " OK, are you saying before God and everyone that in your opinion, waterboarding is not torture?", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:43:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "Yes, Mr. Obama is doing his best to reduce the greatest nation on Earth into a Banana Republic. And he desperately needs YOUR HELP to continue spreading hate and deviciveness. So far, so good!", 
        "intTime": 20090421, 
        "postID": 79, 
        "quote": "", 
        "reply": "Yes, Mr. Obama is doing his best to reduce the greatest nation on Earth into a Banana Republic. And he desperately needs YOUR HELP to continue spreading hate and deviciveness. So far, so good!", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 12:43:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated. Regardless of who is what, and isn't what, the door is now open to prosecute those that would impliment and conduct criminal activity under the color of authority within the Office of the President of the United States. At this point the Obama Administration is ONLY talking about prosecuting those that actually committed the crime(s). Now if those people (that potentially come under indictment) decide later on to rat out the Cabinet or Office of the Vice President... well that issue will be decided at that point. So what do you guys think? Do you think the memo writing rats will turn on their old bosses? It could get kinda steamed if they do.", 
        "intTime": 20090421, 
        "postID": 80, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by m551sheridan: quote: Originally posted by ArtMarsh: But he is open to the idea of the Justice Department prosecuting those individuals that actually wrote the memos used. and isn't that gal Rosa Brooks the newly or about to be newly appointed head of that department..? oh,oh...... I don't think so, I believe she is an advisor to the Undersecretary of Defense for Policy. Not quite the same as the AG, but things change and my info could be outdated.", 
        "reply": " Regardless of who is what, and isn't what, the door is now open to prosecute those that would impliment and conduct criminal activity under the color of authority within the Office of the President of the United States. At this point the Obama Administration is ONLY talking about prosecuting those that actually committed the crime(s). Now if those people (that potentially come under indictment) decide later on to rat out the Cabinet or Office of the Vice President... well that issue will be decided at that point. So what do you guys think? Do you think the memo writing rats will turn on their old bosses? It could get kinda steamed if they do.", 
        "threadID": "672198221_2830073122001", 
        "time": "2009-04-21 13:44:00", 
        "title": "Obama is leaving the door open to possible prosecution of Bush administration officia", 
        "userID": "ArtMarsh"
    }
]