[
    {
        "content": "And here we go again with Ahmadinejad's usual saber-rattling. ++http://news.yahoo.com/s/ap/20090520/ap_on_re_mi_ea/ml_iran_missile_test quote: TEHRAN, Iran – President Mahmoud Ahmadinejad said Iran test-fired a new advanced missile Wednesday with a range of about 1,200 miles, far enough to strike Israel, southeastern Europe and U.S. bases in the Middle East. The announcement will not reassure the U.S. government, coming just two days after President Barack Obama declared a readiness to seek deeper international sanctions against Iran if it shunned U.S. attempts to open negotiations on its nuclear program. Obama said he expected a positive response to his outreach for opening a dialogue with Iran by the end of the year. (...) The study published by the nonpartisan EastWest Institute also said Iran is making advances in rocket technology and could develop a ballistic missile capable of firing a 2,200-pound nuclear warhead up to 1,200 miles \"in perhaps six to eight years.\" Iran says its missile program is merely for defense and its space program is for scientific and surveillance purposes. It maintains that its nuclear program is for civilian energy uses only. The solid-fuel Sajjil-2 surface-to-surface missile is a new version of the Sajjil missile, which Iran said it had successfully tested late last year with a similar range. Iran's nuclear and missile programs have alarmed Israel, and the country's new prime minister, Benjamin Netanyahu, pressed Obama to step up pressure on Tehran when the two met in Washington on Monday. Ahmadinejad has repeatedly called for Israel's elimination, and the Jewish state has not ruled out a military strike to deal with the Iranian nuclear threat...", 
        "intTime": 20090520, 
        "postID": 1, 
        "quote": "TEHRAN, Iran – President Mahmoud Ahmadinejad said Iran test-fired a new advanced missile Wednesday with a range of about 1,200 miles, far enough to strike Israel, southeastern Europe and U.S. bases in the Middle East. The announcement will not reassure the U.S. government, coming just two days after President Barack Obama declared a readiness to seek deeper international sanctions against Iran if it shunned U.S. attempts to open negotiations on its nuclear program. Obama said he expected a positive response to his outreach for opening a dialogue with Iran by the end of the year. (...) The study published by the nonpartisan EastWest Institute also said Iran is making advances in rocket technology and could develop a ballistic missile capable of firing a 2,200-pound nuclear warhead up to 1,200 miles \"in perhaps six to eight years.\" Iran says its missile program is merely for defense and its space program is for scientific and surveillance purposes. It maintains that its nuclear program is for civilian energy uses only. The solid-fuel Sajjil-2 surface-to-surface missile is a new version of the Sajjil missile, which Iran said it had successfully tested late last year with a similar range. Iran's nuclear and missile programs have alarmed Israel, and the country's new prime minister, Benjamin Netanyahu, pressed Obama to step up pressure on Tehran when the two met in Washington on Monday. Ahmadinejad has repeatedly called for Israel's elimination, and the Jewish state has not ruled out a military strike to deal with the Iranian nuclear threat...", 
        "reply": "And here we go again with Ahmadinejad's usual saber-rattling. ++http://news.yahoo.com/s/ap/20090520/ap_on_re_mi_ea/ml_iran_missile_test ", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-20 05:56:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities", 
        "intTime": 20090520, 
        "postID": 2, 
        "quote": "", 
        "reply": "Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-20 09:55:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Good....", 
        "intTime": 20090521, 
        "postID": 3, 
        "quote": "", 
        "reply": "Good....", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 09:18:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "Sgt_Salaam"
    }, 
    {
        "content": "But, But, surely this missile is just designed for some peaceful purposes? Tick-Tick-Tick. Time is running out.", 
        "intTime": 20090521, 
        "postID": 4, 
        "quote": "", 
        "reply": "But, But, surely this missile is just designed for some peaceful purposes? Tick-Tick-Tick. Time is running out.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 11:09:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "Maybe now some other states will think twice before launching unilateral “pre-emptive” strikes. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090521, 
        "postID": 5, 
        "quote": "", 
        "reply": "Maybe now some other states will think twice before launching unilateral “pre-emptive” strikes. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 11:31:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "NSNN"
    }, 
    {
        "content": "Let's see now. Israel possesses nuclear weapons that can easily target Iran. Israel has sophisticated military aircraft (gratis USA) that can eaily target Iran. Israel has an actual history of attacking another county's nuclear facilities (Iraq). Israel is the belligerent in the middle east, forever pursuing total hegemony against her neighbors. Israel is the one that has dispossessed hundreds of thousands of Palestinians, murdering innocents, imprisoning and torturing Palestinians for daring to fight back to regain their property confiscated by Israel. Yet, the American people have been brainwashed into supporting the poor, persecuted Jews. How stupid Americans are, how ignorant and how gullible. As a sovereign nation Iran has every right to possess nuclear weapons. If the US wants to control the proliferation of nukes then it should demand that Israel relinquish its nuclear weapons. Americans are being fed a line by the Jewish controlled US government and the Jewish dominated media. The rest of the world is embarrassed at the gross stupidity of the uneducated, unsophisticated and unthinking Americans.", 
        "intTime": 20090521, 
        "postID": 6, 
        "quote": "", 
        "reply": "Let's see now. Israel possesses nuclear weapons that can easily target Iran. Israel has sophisticated military aircraft (gratis USA) that can eaily target Iran. Israel has an actual history of attacking another county's nuclear facilities (Iraq). Israel is the belligerent in the middle east, forever pursuing total hegemony against her neighbors. Israel is the one that has dispossessed hundreds of thousands of Palestinians, murdering innocents, imprisoning and torturing Palestinians for daring to fight back to regain their property confiscated by Israel. Yet, the American people have been brainwashed into supporting the poor, persecuted Jews. How stupid Americans are, how ignorant and how gullible. As a sovereign nation Iran has every right to possess nuclear weapons. If the US wants to control the proliferation of nukes then it should demand that Israel relinquish its nuclear weapons. Americans are being fed a line by the Jewish controlled US government and the Jewish dominated media. The rest of the world is embarrassed at the gross stupidity of the uneducated, unsophisticated and unthinking Americans.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 12:18:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "Misanthrope2"
    }, 
    {
        "content": "Now whos being unreasonable determining who can have nukes and who cant. Never quite understood that. try to imagine someone telling us that mexico and cannada cand have nukes and we cant. Some case.", 
        "intTime": 20090521, 
        "postID": 7, 
        "quote": "", 
        "reply": "Now whos being unreasonable determining who can have nukes and who cant. Never quite understood that. try to imagine someone telling us that mexico and cannada cand have nukes and we cant. Some case.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 16:42:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Now whos being unreasonable determining who can have nukes and who cant. Never quite understood that. try to imagine someone telling us that mexico and cannada cand have nukes and we cant. Some case. Imagine that 2x. You can't see the difference between two countries who support the extinction of a society vs those who stand for freedom and liberty. Wow...surprised me", 
        "intTime": 20090521, 
        "postID": 8, 
        "quote": "Now whos being unreasonable determining who can have nukes and who cant. Never quite understood that. try to imagine someone telling us that mexico and cannada cand have nukes and we cant. Some case.", 
        "reply": " Imagine that 2x. You can't see the difference between two countries who support the extinction of a society vs those who stand for freedom and liberty. Wow...surprised me", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 17:07:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Maybe now some other states will think twice before launching unilateral “pre-emptive” strikes And here is another. Yep Iran just wants to get along...even though they SAY they don't. Purty quick there nsnn. But if anything were to happen God forbid I KNOW you would still stand by your statments and say Iran has that right.", 
        "intTime": 20090521, 
        "postID": 9, 
        "quote": "Maybe now some other states will think twice before launching unilateral “pre-emptive” strikes", 
        "reply": " And here is another. Yep Iran just wants to get along...even though they SAY they don't. Purty quick there nsnn. But if anything were to happen God forbid I KNOW you would still stand by your statments and say Iran has that right.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 17:15:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: Maybe now some other states will think twice before launching unilateral “pre-emptive” strikes And here is another. Yep Iran just wants to get along...even though they SAY they don't. I tend to focus more on past & present actions, rather than just on rhetoric. Purty quick there nsnn. But if anything were to happen God forbid I KNOW you would still stand by your statments and say Iran has that right. Has the right to what? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090521, 
        "postID": 10, 
        "quote": "Originally posted by ACR26: quote: Maybe now some other states will think twice before launching unilateral “pre-emptive” strikes And here is another. Yep Iran just wants to get along...even though they SAY they don't. I tend to focus more on past & present actions, rather than just on rhetoric. Purty quick there nsnn. But if anything were to happen God forbid I KNOW you would still stand by your statments and say Iran has that right. Has the right to what?", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 17:47:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by Misanthrope2: Let's see now. Israel possesses nuclear weapons that can easily target Iran. Israel has sophisticated military aircraft (gratis USA) that can eaily target Iran. Israel has an actual history of attacking another county's nuclear facilities (Iraq). Israel is the belligerent in the middle east, forever pursuing total hegemony against her neighbors. Israel is the one that has dispossessed hundreds of thousands of Palestinians, murdering innocents, imprisoning and torturing Palestinians for daring to fight back to regain their property confiscated by Israel. Yet, the American people have been brainwashed into supporting the poor, persecuted Jews. How stupid Americans are, how ignorant and how gullible. As a sovereign nation Iran has every right to possess nuclear weapons. If the US wants to control the proliferation of nukes then it should demand that Israel relinquish its nuclear weapons. Americans are being fed a line by the Jewish controlled US government and the Jewish dominated media. The rest of the world is embarrassed at the gross stupidity of the uneducated, unsophisticated and unthinking Americans. It is also interesting to note that Israel has been attacked and not used nuclear weapons. It is interesting to note that at one time Israel was surrounded by nations intent on its destruction and they attacked for just that purpose. It is interesting to note that ME nations other than Israel have also taken land once claimed by the Palestinians. It is also interesting that Israel has not called for the elimination of Iran. It is sad to see that you do not grasp how dangerous nuclear proliferation is. Once that genie gets out, there will be no putting it back in the bottle until something bad has happened to force it. And what about other nations in the region? If Iran deploys nuclear weapons, why can't the rest of them? Getting rid of existing weapons is a nice goal, but EVERYONE (US, UK, France, China, DPRK, Russia, India, Pakistan) will have to agree to do it, not just Israel. I do not always agree with Israeli attitudes and actions, but they do have a right to exist, as do the Palestinians. The US did not create the situation as it exists and you seem to feel that we are brainwashed to believe that Israel only exists because of the US. And murdering innocents; of course Israel is the only one guilty of that in the region. I suppose there were no conflicts in the region where those caught in between did not get killed prior to 1947. So if Americans are everything you say we are, are you going to renounce your citizenship and move to the middle east? (I am assuming you are retired US Army) It must be great to be so enlightened.", 
        "intTime": 20090521, 
        "postID": 11, 
        "quote": "Originally posted by Misanthrope2: Let's see now. Israel possesses nuclear weapons that can easily target Iran. Israel has sophisticated military aircraft (gratis USA) that can eaily target Iran. Israel has an actual history of attacking another county's nuclear facilities (Iraq). Israel is the belligerent in the middle east, forever pursuing total hegemony against her neighbors. Israel is the one that has dispossessed hundreds of thousands of Palestinians, murdering innocents, imprisoning and torturing Palestinians for daring to fight back to regain their property confiscated by Israel. Yet, the American people have been brainwashed into supporting the poor, persecuted Jews. How stupid Americans are, how ignorant and how gullible. As a sovereign nation Iran has every right to possess nuclear weapons. If the US wants to control the proliferation of nukes then it should demand that Israel relinquish its nuclear weapons. Americans are being fed a line by the Jewish controlled US government and the Jewish dominated media. The rest of the world is embarrassed at the gross stupidity of the uneducated, unsophisticated and unthinking Americans.", 
        "reply": " It is also interesting to note that Israel has been attacked and not used nuclear weapons. It is interesting to note that at one time Israel was surrounded by nations intent on its destruction and they attacked for just that purpose. It is interesting to note that ME nations other than Israel have also taken land once claimed by the Palestinians. It is also interesting that Israel has not called for the elimination of Iran. It is sad to see that you do not grasp how dangerous nuclear proliferation is. Once that genie gets out, there will be no putting it back in the bottle until something bad has happened to force it. And what about other nations in the region? If Iran deploys nuclear weapons, why can't the rest of them? Getting rid of existing weapons is a nice goal, but EVERYONE (US, UK, France, China, DPRK, Russia, India, Pakistan) will have to agree to do it, not just Israel. I do not always agree with Israeli attitudes and actions, but they do have a right to exist, as do the Palestinians. The US did not create the situation as it exists and you seem to feel that we are brainwashed to believe that Israel only exists because of the US. And murdering innocents; of course Israel is the only one guilty of that in the region. I suppose there were no conflicts in the region where those caught in between did not get killed prior to 1947. So if Americans are everything you say we are, are you going to renounce your citizenship and move to the middle east? (I am assuming you are retired US Army) It must be great to be so enlightened.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 18:10:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities I think you are confused. Obama believes that if we would simply treat Iran better and give them some financial/other incentives then they would love the USA and terrorism would be a thing of history. Conservatives believe that Iran is a threat that shouldn't be allowed to get a nuclear weapon because they would use it once they have it. This missile is just another tool in Iran's inventory they can use for evil.", 
        "intTime": 20090521, 
        "postID": 12, 
        "quote": "Originally posted by crackerjacks61: Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities", 
        "reply": " I think you are confused. Obama believes that if we would simply treat Iran better and give them some financial/other incentives then they would love the USA and terrorism would be a thing of history. Conservatives believe that Iran is a threat that shouldn't be allowed to get a nuclear weapon because they would use it once they have it. This missile is just another tool in Iran's inventory they can use for evil.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 18:32:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Good, then they can wipe Israel off the map along with all their racial settlements and American made weapons used to kill civilians which fuels hatred towards our country. America becomes safer.", 
        "intTime": 20090521, 
        "postID": 13, 
        "quote": "", 
        "reply": "Good, then they can wipe Israel off the map along with all their racial settlements and American made weapons used to kill civilians which fuels hatred towards our country. America becomes safer.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 19:02:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "Enlightened"
    }, 
    {
        "content": "quote: Originally posted by Enlightened: Good, then they can wipe Israel off the map along with all their racial settlements and American made weapons used to kill civilians which fuels hatred towards our country. America becomes safer. That has to be one of the most profound appraisals I have ever heard of the ME situation... Like your forum name suggest you are truly \"enlightened\". And I might add well informed. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090521, 
        "postID": 14, 
        "quote": "Originally posted by Enlightened: Good, then they can wipe Israel off the map along with all their racial settlements and American made weapons used to kill civilians which fuels hatred towards our country. America becomes safer.", 
        "reply": " That has to be one of the most profound appraisals I have ever heard of the ME situation... Like your forum name suggest you are truly \"enlightened\". And I might add well informed. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 19:10:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "After china tested it 1st nuclear weapon. The world's nuclear powers and 200 smaller counties signed a treaty stating that they wont try to make nuclear weapons as long as the nuclear power's help them with nuclear power, or face punishment if any country try's to gain a nuclear weapon. If everyone remembers what happen after china go it wmd. It started a major arm race and a lot of war's broke out India and Pakistan fought it out the 6 day war and Vietnam. The thought that if Iran get's it's wmd's would set off a chain reaction and a major arm's build up around the world at the same time pushing us back in to the cold war.", 
        "intTime": 20090522, 
        "postID": 15, 
        "quote": "", 
        "reply": "After china tested it 1st nuclear weapon. The world's nuclear powers and 200 smaller counties signed a treaty stating that they wont try to make nuclear weapons as long as the nuclear power's help them with nuclear power, or face punishment if any country try's to gain a nuclear weapon. If everyone remembers what happen after china go it wmd. It started a major arm race and a lot of war's broke out India and Pakistan fought it out the 6 day war and Vietnam. The thought that if Iran get's it's wmd's would set off a chain reaction and a major arm's build up around the world at the same time pushing us back in to the cold war.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-22 01:01:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by Misanthrope2: Let's see now. Israel possesses nuclear weapons that can easily target Iran. Israel has sophisticated military aircraft (gratis USA) that can eaily target Iran. Israel has an actual history of attacking another county's nuclear facilities (Iraq). Israel is the belligerent in the middle east, forever pursuing total hegemony against her neighbors. Israel is the one that has dispossessed hundreds of thousands of Palestinians, murdering innocents, imprisoning and torturing Palestinians for daring to fight back to regain their property confiscated by Israel. Yet, the American people have been brainwashed into supporting the poor, persecuted Jews. How stupid Americans are, how ignorant and how gullible. As a sovereign nation Iran has every right to possess nuclear weapons. If the US wants to control the proliferation of nukes then it should demand that Israel relinquish its nuclear weapons. Americans are being fed a line by the Jewish controlled US government and the Jewish dominated media. The rest of the world is embarrassed at the gross stupidity of the uneducated, unsophisticated and unthinking Americans. All of this coming from someone that admits that he believes that the protocols of the elders of Zion are true. Pathetic.", 
        "intTime": 20090522, 
        "postID": 16, 
        "quote": "Originally posted by Misanthrope2: Let's see now. Israel possesses nuclear weapons that can easily target Iran. Israel has sophisticated military aircraft (gratis USA) that can eaily target Iran. Israel has an actual history of attacking another county's nuclear facilities (Iraq). Israel is the belligerent in the middle east, forever pursuing total hegemony against her neighbors. Israel is the one that has dispossessed hundreds of thousands of Palestinians, murdering innocents, imprisoning and torturing Palestinians for daring to fight back to regain their property confiscated by Israel. Yet, the American people have been brainwashed into supporting the poor, persecuted Jews. How stupid Americans are, how ignorant and how gullible. As a sovereign nation Iran has every right to possess nuclear weapons. If the US wants to control the proliferation of nukes then it should demand that Israel relinquish its nuclear weapons. Americans are being fed a line by the Jewish controlled US government and the Jewish dominated media. The rest of the world is embarrassed at the gross stupidity of the uneducated, unsophisticated and unthinking Americans.", 
        "reply": " All of this coming from someone that admits that he believes that the protocols of the elders of Zion are true. Pathetic.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-22 01:13:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "You can expect more saber-rattling from Ahmadinejad in the next couple of weeks. IMHO an outside threat is the only way he'll win against Mousavi. http://www.presstv.ir/election2009/ (The June 3 debate should be interesting.)", 
        "intTime": 20090522, 
        "postID": 17, 
        "quote": "", 
        "reply": "You can expect more saber-rattling from Ahmadinejad in the next couple of weeks. IMHO an outside threat is the only way he'll win against Mousavi. http://www.presstv.ir/election2009/ (The June 3 debate should be interesting.)", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-22 02:52:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "quote: Originally posted by Enlightened: Good, then they can wipe Israel off the map along with all their racial settlements and American made weapons used to kill civilians which fuels hatred towards our country. America becomes safer. \"The people are indoctrinated en masse, but enlightened only one at a time\". On this forum the majority are indoctrinated. You seem to be one of the few who are enlightened.", 
        "intTime": 20090522, 
        "postID": 18, 
        "quote": "Originally posted by Enlightened: Good, then they can wipe Israel off the map along with all their racial settlements and American made weapons used to kill civilians which fuels hatred towards our country. America becomes safer.", 
        "reply": " \"The people are indoctrinated en masse, but enlightened only one at a time\". On this forum the majority are indoctrinated. You seem to be one of the few who are enlightened.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-22 03:50:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "Misanthrope2"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities Maybe Iran is trying to get Israel to attack in the same way Saddam rocketed Israel during the Gulf War to unite the Muslim world against Israel.", 
        "intTime": 20090522, 
        "postID": 19, 
        "quote": "Originally posted by crackerjacks61: Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities", 
        "reply": " Maybe Iran is trying to get Israel to attack in the same way Saddam rocketed Israel during the Gulf War to unite the Muslim world against Israel.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-22 04:45:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities What are you a waterhead? I havn't seen anyone say that. Quite the opposite actually.", 
        "intTime": 20090522, 
        "postID": 20, 
        "quote": "Originally posted by crackerjacks61: Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities", 
        "reply": " What are you a waterhead? I havn't seen anyone say that. Quite the opposite actually.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-22 05:01:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "NickBrand"
    }, 
    {
        "content": "And here we go again with Ahmadinejad's usual saber-rattling. ++http://news.yahoo.com/s/ap/20090520/ap_on_re_mi_ea/ml_iran_missile_test quote: TEHRAN, Iran – President Mahmoud Ahmadinejad said Iran test-fired a new advanced missile Wednesday with a range of about 1,200 miles, far enough to strike Israel, southeastern Europe and U.S. bases in the Middle East. The announcement will not reassure the U.S. government, coming just two days after President Barack Obama declared a readiness to seek deeper international sanctions against Iran if it shunned U.S. attempts to open negotiations on its nuclear program. Obama said he expected a positive response to his outreach for opening a dialogue with Iran by the end of the year. (...) The study published by the nonpartisan EastWest Institute also said Iran is making advances in rocket technology and could develop a ballistic missile capable of firing a 2,200-pound nuclear warhead up to 1,200 miles \"in perhaps six to eight years.\" Iran says its missile program is merely for defense and its space program is for scientific and surveillance purposes. It maintains that its nuclear program is for civilian energy uses only. The solid-fuel Sajjil-2 surface-to-surface missile is a new version of the Sajjil missile, which Iran said it had successfully tested late last year with a similar range. Iran's nuclear and missile programs have alarmed Israel, and the country's new prime minister, Benjamin Netanyahu, pressed Obama to step up pressure on Tehran when the two met in Washington on Monday. Ahmadinejad has repeatedly called for Israel's elimination, and the Jewish state has not ruled out a military strike to deal with the Iranian nuclear threat...", 
        "intTime": 20090520, 
        "postID": 21, 
        "quote": "TEHRAN, Iran – President Mahmoud Ahmadinejad said Iran test-fired a new advanced missile Wednesday with a range of about 1,200 miles, far enough to strike Israel, southeastern Europe and U.S. bases in the Middle East. The announcement will not reassure the U.S. government, coming just two days after President Barack Obama declared a readiness to seek deeper international sanctions against Iran if it shunned U.S. attempts to open negotiations on its nuclear program. Obama said he expected a positive response to his outreach for opening a dialogue with Iran by the end of the year. (...) The study published by the nonpartisan EastWest Institute also said Iran is making advances in rocket technology and could develop a ballistic missile capable of firing a 2,200-pound nuclear warhead up to 1,200 miles \"in perhaps six to eight years.\" Iran says its missile program is merely for defense and its space program is for scientific and surveillance purposes. It maintains that its nuclear program is for civilian energy uses only. The solid-fuel Sajjil-2 surface-to-surface missile is a new version of the Sajjil missile, which Iran said it had successfully tested late last year with a similar range. Iran's nuclear and missile programs have alarmed Israel, and the country's new prime minister, Benjamin Netanyahu, pressed Obama to step up pressure on Tehran when the two met in Washington on Monday. Ahmadinejad has repeatedly called for Israel's elimination, and the Jewish state has not ruled out a military strike to deal with the Iranian nuclear threat...", 
        "reply": "And here we go again with Ahmadinejad's usual saber-rattling. ++http://news.yahoo.com/s/ap/20090520/ap_on_re_mi_ea/ml_iran_missile_test ", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-20 05:56:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities", 
        "intTime": 20090520, 
        "postID": 22, 
        "quote": "", 
        "reply": "Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-20 09:55:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Good....", 
        "intTime": 20090521, 
        "postID": 23, 
        "quote": "", 
        "reply": "Good....", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 09:18:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "Sgt_Salaam"
    }, 
    {
        "content": "But, But, surely this missile is just designed for some peaceful purposes? Tick-Tick-Tick. Time is running out.", 
        "intTime": 20090521, 
        "postID": 24, 
        "quote": "", 
        "reply": "But, But, surely this missile is just designed for some peaceful purposes? Tick-Tick-Tick. Time is running out.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 11:09:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "Maybe now some other states will think twice before launching unilateral “pre-emptive” strikes. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090521, 
        "postID": 25, 
        "quote": "", 
        "reply": "Maybe now some other states will think twice before launching unilateral “pre-emptive” strikes. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 11:31:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "NSNN"
    }, 
    {
        "content": "Let's see now. Israel possesses nuclear weapons that can easily target Iran. Israel has sophisticated military aircraft (gratis USA) that can eaily target Iran. Israel has an actual history of attacking another county's nuclear facilities (Iraq). Israel is the belligerent in the middle east, forever pursuing total hegemony against her neighbors. Israel is the one that has dispossessed hundreds of thousands of Palestinians, murdering innocents, imprisoning and torturing Palestinians for daring to fight back to regain their property confiscated by Israel. Yet, the American people have been brainwashed into supporting the poor, persecuted Jews. How stupid Americans are, how ignorant and how gullible. As a sovereign nation Iran has every right to possess nuclear weapons. If the US wants to control the proliferation of nukes then it should demand that Israel relinquish its nuclear weapons. Americans are being fed a line by the Jewish controlled US government and the Jewish dominated media. The rest of the world is embarrassed at the gross stupidity of the uneducated, unsophisticated and unthinking Americans.", 
        "intTime": 20090521, 
        "postID": 26, 
        "quote": "", 
        "reply": "Let's see now. Israel possesses nuclear weapons that can easily target Iran. Israel has sophisticated military aircraft (gratis USA) that can eaily target Iran. Israel has an actual history of attacking another county's nuclear facilities (Iraq). Israel is the belligerent in the middle east, forever pursuing total hegemony against her neighbors. Israel is the one that has dispossessed hundreds of thousands of Palestinians, murdering innocents, imprisoning and torturing Palestinians for daring to fight back to regain their property confiscated by Israel. Yet, the American people have been brainwashed into supporting the poor, persecuted Jews. How stupid Americans are, how ignorant and how gullible. As a sovereign nation Iran has every right to possess nuclear weapons. If the US wants to control the proliferation of nukes then it should demand that Israel relinquish its nuclear weapons. Americans are being fed a line by the Jewish controlled US government and the Jewish dominated media. The rest of the world is embarrassed at the gross stupidity of the uneducated, unsophisticated and unthinking Americans.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 12:18:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "Misanthrope2"
    }, 
    {
        "content": "Now whos being unreasonable determining who can have nukes and who cant. Never quite understood that. try to imagine someone telling us that mexico and cannada cand have nukes and we cant. Some case.", 
        "intTime": 20090521, 
        "postID": 27, 
        "quote": "", 
        "reply": "Now whos being unreasonable determining who can have nukes and who cant. Never quite understood that. try to imagine someone telling us that mexico and cannada cand have nukes and we cant. Some case.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 16:42:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Now whos being unreasonable determining who can have nukes and who cant. Never quite understood that. try to imagine someone telling us that mexico and cannada cand have nukes and we cant. Some case. Imagine that 2x. You can't see the difference between two countries who support the extinction of a society vs those who stand for freedom and liberty. Wow...surprised me", 
        "intTime": 20090521, 
        "postID": 28, 
        "quote": "Now whos being unreasonable determining who can have nukes and who cant. Never quite understood that. try to imagine someone telling us that mexico and cannada cand have nukes and we cant. Some case.", 
        "reply": " Imagine that 2x. You can't see the difference between two countries who support the extinction of a society vs those who stand for freedom and liberty. Wow...surprised me", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 17:07:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Maybe now some other states will think twice before launching unilateral “pre-emptive” strikes And here is another. Yep Iran just wants to get along...even though they SAY they don't. Purty quick there nsnn. But if anything were to happen God forbid I KNOW you would still stand by your statments and say Iran has that right.", 
        "intTime": 20090521, 
        "postID": 29, 
        "quote": "Maybe now some other states will think twice before launching unilateral “pre-emptive” strikes", 
        "reply": " And here is another. Yep Iran just wants to get along...even though they SAY they don't. Purty quick there nsnn. But if anything were to happen God forbid I KNOW you would still stand by your statments and say Iran has that right.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 17:15:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: Maybe now some other states will think twice before launching unilateral “pre-emptive” strikes And here is another. Yep Iran just wants to get along...even though they SAY they don't. I tend to focus more on past & present actions, rather than just on rhetoric. Purty quick there nsnn. But if anything were to happen God forbid I KNOW you would still stand by your statments and say Iran has that right. Has the right to what? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090521, 
        "postID": 30, 
        "quote": "Originally posted by ACR26: quote: Maybe now some other states will think twice before launching unilateral “pre-emptive” strikes And here is another. Yep Iran just wants to get along...even though they SAY they don't. I tend to focus more on past & present actions, rather than just on rhetoric. Purty quick there nsnn. But if anything were to happen God forbid I KNOW you would still stand by your statments and say Iran has that right. Has the right to what?", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 17:47:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by Misanthrope2: Let's see now. Israel possesses nuclear weapons that can easily target Iran. Israel has sophisticated military aircraft (gratis USA) that can eaily target Iran. Israel has an actual history of attacking another county's nuclear facilities (Iraq). Israel is the belligerent in the middle east, forever pursuing total hegemony against her neighbors. Israel is the one that has dispossessed hundreds of thousands of Palestinians, murdering innocents, imprisoning and torturing Palestinians for daring to fight back to regain their property confiscated by Israel. Yet, the American people have been brainwashed into supporting the poor, persecuted Jews. How stupid Americans are, how ignorant and how gullible. As a sovereign nation Iran has every right to possess nuclear weapons. If the US wants to control the proliferation of nukes then it should demand that Israel relinquish its nuclear weapons. Americans are being fed a line by the Jewish controlled US government and the Jewish dominated media. The rest of the world is embarrassed at the gross stupidity of the uneducated, unsophisticated and unthinking Americans. It is also interesting to note that Israel has been attacked and not used nuclear weapons. It is interesting to note that at one time Israel was surrounded by nations intent on its destruction and they attacked for just that purpose. It is interesting to note that ME nations other than Israel have also taken land once claimed by the Palestinians. It is also interesting that Israel has not called for the elimination of Iran. It is sad to see that you do not grasp how dangerous nuclear proliferation is. Once that genie gets out, there will be no putting it back in the bottle until something bad has happened to force it. And what about other nations in the region? If Iran deploys nuclear weapons, why can't the rest of them? Getting rid of existing weapons is a nice goal, but EVERYONE (US, UK, France, China, DPRK, Russia, India, Pakistan) will have to agree to do it, not just Israel. I do not always agree with Israeli attitudes and actions, but they do have a right to exist, as do the Palestinians. The US did not create the situation as it exists and you seem to feel that we are brainwashed to believe that Israel only exists because of the US. And murdering innocents; of course Israel is the only one guilty of that in the region. I suppose there were no conflicts in the region where those caught in between did not get killed prior to 1947. So if Americans are everything you say we are, are you going to renounce your citizenship and move to the middle east? (I am assuming you are retired US Army) It must be great to be so enlightened.", 
        "intTime": 20090521, 
        "postID": 31, 
        "quote": "Originally posted by Misanthrope2: Let's see now. Israel possesses nuclear weapons that can easily target Iran. Israel has sophisticated military aircraft (gratis USA) that can eaily target Iran. Israel has an actual history of attacking another county's nuclear facilities (Iraq). Israel is the belligerent in the middle east, forever pursuing total hegemony against her neighbors. Israel is the one that has dispossessed hundreds of thousands of Palestinians, murdering innocents, imprisoning and torturing Palestinians for daring to fight back to regain their property confiscated by Israel. Yet, the American people have been brainwashed into supporting the poor, persecuted Jews. How stupid Americans are, how ignorant and how gullible. As a sovereign nation Iran has every right to possess nuclear weapons. If the US wants to control the proliferation of nukes then it should demand that Israel relinquish its nuclear weapons. Americans are being fed a line by the Jewish controlled US government and the Jewish dominated media. The rest of the world is embarrassed at the gross stupidity of the uneducated, unsophisticated and unthinking Americans.", 
        "reply": " It is also interesting to note that Israel has been attacked and not used nuclear weapons. It is interesting to note that at one time Israel was surrounded by nations intent on its destruction and they attacked for just that purpose. It is interesting to note that ME nations other than Israel have also taken land once claimed by the Palestinians. It is also interesting that Israel has not called for the elimination of Iran. It is sad to see that you do not grasp how dangerous nuclear proliferation is. Once that genie gets out, there will be no putting it back in the bottle until something bad has happened to force it. And what about other nations in the region? If Iran deploys nuclear weapons, why can't the rest of them? Getting rid of existing weapons is a nice goal, but EVERYONE (US, UK, France, China, DPRK, Russia, India, Pakistan) will have to agree to do it, not just Israel. I do not always agree with Israeli attitudes and actions, but they do have a right to exist, as do the Palestinians. The US did not create the situation as it exists and you seem to feel that we are brainwashed to believe that Israel only exists because of the US. And murdering innocents; of course Israel is the only one guilty of that in the region. I suppose there were no conflicts in the region where those caught in between did not get killed prior to 1947. So if Americans are everything you say we are, are you going to renounce your citizenship and move to the middle east? (I am assuming you are retired US Army) It must be great to be so enlightened.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 18:10:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities I think you are confused. Obama believes that if we would simply treat Iran better and give them some financial/other incentives then they would love the USA and terrorism would be a thing of history. Conservatives believe that Iran is a threat that shouldn't be allowed to get a nuclear weapon because they would use it once they have it. This missile is just another tool in Iran's inventory they can use for evil.", 
        "intTime": 20090521, 
        "postID": 32, 
        "quote": "Originally posted by crackerjacks61: Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities", 
        "reply": " I think you are confused. Obama believes that if we would simply treat Iran better and give them some financial/other incentives then they would love the USA and terrorism would be a thing of history. Conservatives believe that Iran is a threat that shouldn't be allowed to get a nuclear weapon because they would use it once they have it. This missile is just another tool in Iran's inventory they can use for evil.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 18:32:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Good, then they can wipe Israel off the map along with all their racial settlements and American made weapons used to kill civilians which fuels hatred towards our country. America becomes safer.", 
        "intTime": 20090521, 
        "postID": 33, 
        "quote": "", 
        "reply": "Good, then they can wipe Israel off the map along with all their racial settlements and American made weapons used to kill civilians which fuels hatred towards our country. America becomes safer.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 19:02:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "Enlightened"
    }, 
    {
        "content": "quote: Originally posted by Enlightened: Good, then they can wipe Israel off the map along with all their racial settlements and American made weapons used to kill civilians which fuels hatred towards our country. America becomes safer. That has to be one of the most profound appraisals I have ever heard of the ME situation... Like your forum name suggest you are truly \"enlightened\". And I might add well informed. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090521, 
        "postID": 34, 
        "quote": "Originally posted by Enlightened: Good, then they can wipe Israel off the map along with all their racial settlements and American made weapons used to kill civilians which fuels hatred towards our country. America becomes safer.", 
        "reply": " That has to be one of the most profound appraisals I have ever heard of the ME situation... Like your forum name suggest you are truly \"enlightened\". And I might add well informed. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 19:10:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "After china tested it 1st nuclear weapon. The world's nuclear powers and 200 smaller counties signed a treaty stating that they wont try to make nuclear weapons as long as the nuclear power's help them with nuclear power, or face punishment if any country try's to gain a nuclear weapon. If everyone remembers what happen after china go it wmd. It started a major arm race and a lot of war's broke out India and Pakistan fought it out the 6 day war and Vietnam. The thought that if Iran get's it's wmd's would set off a chain reaction and a major arm's build up around the world at the same time pushing us back in to the cold war.", 
        "intTime": 20090522, 
        "postID": 35, 
        "quote": "", 
        "reply": "After china tested it 1st nuclear weapon. The world's nuclear powers and 200 smaller counties signed a treaty stating that they wont try to make nuclear weapons as long as the nuclear power's help them with nuclear power, or face punishment if any country try's to gain a nuclear weapon. If everyone remembers what happen after china go it wmd. It started a major arm race and a lot of war's broke out India and Pakistan fought it out the 6 day war and Vietnam. The thought that if Iran get's it's wmd's would set off a chain reaction and a major arm's build up around the world at the same time pushing us back in to the cold war.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-22 01:01:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by Misanthrope2: Let's see now. Israel possesses nuclear weapons that can easily target Iran. Israel has sophisticated military aircraft (gratis USA) that can eaily target Iran. Israel has an actual history of attacking another county's nuclear facilities (Iraq). Israel is the belligerent in the middle east, forever pursuing total hegemony against her neighbors. Israel is the one that has dispossessed hundreds of thousands of Palestinians, murdering innocents, imprisoning and torturing Palestinians for daring to fight back to regain their property confiscated by Israel. Yet, the American people have been brainwashed into supporting the poor, persecuted Jews. How stupid Americans are, how ignorant and how gullible. As a sovereign nation Iran has every right to possess nuclear weapons. If the US wants to control the proliferation of nukes then it should demand that Israel relinquish its nuclear weapons. Americans are being fed a line by the Jewish controlled US government and the Jewish dominated media. The rest of the world is embarrassed at the gross stupidity of the uneducated, unsophisticated and unthinking Americans. All of this coming from someone that admits that he believes that the protocols of the elders of Zion are true. Pathetic.", 
        "intTime": 20090522, 
        "postID": 36, 
        "quote": "Originally posted by Misanthrope2: Let's see now. Israel possesses nuclear weapons that can easily target Iran. Israel has sophisticated military aircraft (gratis USA) that can eaily target Iran. Israel has an actual history of attacking another county's nuclear facilities (Iraq). Israel is the belligerent in the middle east, forever pursuing total hegemony against her neighbors. Israel is the one that has dispossessed hundreds of thousands of Palestinians, murdering innocents, imprisoning and torturing Palestinians for daring to fight back to regain their property confiscated by Israel. Yet, the American people have been brainwashed into supporting the poor, persecuted Jews. How stupid Americans are, how ignorant and how gullible. As a sovereign nation Iran has every right to possess nuclear weapons. If the US wants to control the proliferation of nukes then it should demand that Israel relinquish its nuclear weapons. Americans are being fed a line by the Jewish controlled US government and the Jewish dominated media. The rest of the world is embarrassed at the gross stupidity of the uneducated, unsophisticated and unthinking Americans.", 
        "reply": " All of this coming from someone that admits that he believes that the protocols of the elders of Zion are true. Pathetic.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-22 01:13:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "You can expect more saber-rattling from Ahmadinejad in the next couple of weeks. IMHO an outside threat is the only way he'll win against Mousavi. http://www.presstv.ir/election2009/ (The June 3 debate should be interesting.)", 
        "intTime": 20090522, 
        "postID": 37, 
        "quote": "", 
        "reply": "You can expect more saber-rattling from Ahmadinejad in the next couple of weeks. IMHO an outside threat is the only way he'll win against Mousavi. http://www.presstv.ir/election2009/ (The June 3 debate should be interesting.)", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-22 02:52:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "quote: Originally posted by Enlightened: Good, then they can wipe Israel off the map along with all their racial settlements and American made weapons used to kill civilians which fuels hatred towards our country. America becomes safer. \"The people are indoctrinated en masse, but enlightened only one at a time\". On this forum the majority are indoctrinated. You seem to be one of the few who are enlightened.", 
        "intTime": 20090522, 
        "postID": 38, 
        "quote": "Originally posted by Enlightened: Good, then they can wipe Israel off the map along with all their racial settlements and American made weapons used to kill civilians which fuels hatred towards our country. America becomes safer.", 
        "reply": " \"The people are indoctrinated en masse, but enlightened only one at a time\". On this forum the majority are indoctrinated. You seem to be one of the few who are enlightened.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-22 03:50:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "Misanthrope2"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities Maybe Iran is trying to get Israel to attack in the same way Saddam rocketed Israel during the Gulf War to unite the Muslim world against Israel.", 
        "intTime": 20090522, 
        "postID": 39, 
        "quote": "Originally posted by crackerjacks61: Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities", 
        "reply": " Maybe Iran is trying to get Israel to attack in the same way Saddam rocketed Israel during the Gulf War to unite the Muslim world against Israel.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-22 04:45:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities What are you a waterhead? I havn't seen anyone say that. Quite the opposite actually.", 
        "intTime": 20090522, 
        "postID": 40, 
        "quote": "Originally posted by crackerjacks61: Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities", 
        "reply": " What are you a waterhead? I havn't seen anyone say that. Quite the opposite actually.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-22 05:01:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "NickBrand"
    }, 
    {
        "content": "And here we go again with Ahmadinejad's usual saber-rattling. ++http://news.yahoo.com/s/ap/20090520/ap_on_re_mi_ea/ml_iran_missile_test quote: TEHRAN, Iran – President Mahmoud Ahmadinejad said Iran test-fired a new advanced missile Wednesday with a range of about 1,200 miles, far enough to strike Israel, southeastern Europe and U.S. bases in the Middle East. The announcement will not reassure the U.S. government, coming just two days after President Barack Obama declared a readiness to seek deeper international sanctions against Iran if it shunned U.S. attempts to open negotiations on its nuclear program. Obama said he expected a positive response to his outreach for opening a dialogue with Iran by the end of the year. (...) The study published by the nonpartisan EastWest Institute also said Iran is making advances in rocket technology and could develop a ballistic missile capable of firing a 2,200-pound nuclear warhead up to 1,200 miles \"in perhaps six to eight years.\" Iran says its missile program is merely for defense and its space program is for scientific and surveillance purposes. It maintains that its nuclear program is for civilian energy uses only. The solid-fuel Sajjil-2 surface-to-surface missile is a new version of the Sajjil missile, which Iran said it had successfully tested late last year with a similar range. Iran's nuclear and missile programs have alarmed Israel, and the country's new prime minister, Benjamin Netanyahu, pressed Obama to step up pressure on Tehran when the two met in Washington on Monday. Ahmadinejad has repeatedly called for Israel's elimination, and the Jewish state has not ruled out a military strike to deal with the Iranian nuclear threat...", 
        "intTime": 20090520, 
        "postID": 41, 
        "quote": "TEHRAN, Iran – President Mahmoud Ahmadinejad said Iran test-fired a new advanced missile Wednesday with a range of about 1,200 miles, far enough to strike Israel, southeastern Europe and U.S. bases in the Middle East. The announcement will not reassure the U.S. government, coming just two days after President Barack Obama declared a readiness to seek deeper international sanctions against Iran if it shunned U.S. attempts to open negotiations on its nuclear program. Obama said he expected a positive response to his outreach for opening a dialogue with Iran by the end of the year. (...) The study published by the nonpartisan EastWest Institute also said Iran is making advances in rocket technology and could develop a ballistic missile capable of firing a 2,200-pound nuclear warhead up to 1,200 miles \"in perhaps six to eight years.\" Iran says its missile program is merely for defense and its space program is for scientific and surveillance purposes. It maintains that its nuclear program is for civilian energy uses only. The solid-fuel Sajjil-2 surface-to-surface missile is a new version of the Sajjil missile, which Iran said it had successfully tested late last year with a similar range. Iran's nuclear and missile programs have alarmed Israel, and the country's new prime minister, Benjamin Netanyahu, pressed Obama to step up pressure on Tehran when the two met in Washington on Monday. Ahmadinejad has repeatedly called for Israel's elimination, and the Jewish state has not ruled out a military strike to deal with the Iranian nuclear threat...", 
        "reply": "And here we go again with Ahmadinejad's usual saber-rattling. ++http://news.yahoo.com/s/ap/20090520/ap_on_re_mi_ea/ml_iran_missile_test ", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-20 05:56:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities", 
        "intTime": 20090520, 
        "postID": 42, 
        "quote": "", 
        "reply": "Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-20 09:55:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Good....", 
        "intTime": 20090521, 
        "postID": 43, 
        "quote": "", 
        "reply": "Good....", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 09:18:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "Sgt_Salaam"
    }, 
    {
        "content": "But, But, surely this missile is just designed for some peaceful purposes? Tick-Tick-Tick. Time is running out.", 
        "intTime": 20090521, 
        "postID": 44, 
        "quote": "", 
        "reply": "But, But, surely this missile is just designed for some peaceful purposes? Tick-Tick-Tick. Time is running out.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 11:09:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "Maybe now some other states will think twice before launching unilateral “pre-emptive” strikes. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090521, 
        "postID": 45, 
        "quote": "", 
        "reply": "Maybe now some other states will think twice before launching unilateral “pre-emptive” strikes. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 11:31:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "NSNN"
    }, 
    {
        "content": "Let's see now. Israel possesses nuclear weapons that can easily target Iran. Israel has sophisticated military aircraft (gratis USA) that can eaily target Iran. Israel has an actual history of attacking another county's nuclear facilities (Iraq). Israel is the belligerent in the middle east, forever pursuing total hegemony against her neighbors. Israel is the one that has dispossessed hundreds of thousands of Palestinians, murdering innocents, imprisoning and torturing Palestinians for daring to fight back to regain their property confiscated by Israel. Yet, the American people have been brainwashed into supporting the poor, persecuted Jews. How stupid Americans are, how ignorant and how gullible. As a sovereign nation Iran has every right to possess nuclear weapons. If the US wants to control the proliferation of nukes then it should demand that Israel relinquish its nuclear weapons. Americans are being fed a line by the Jewish controlled US government and the Jewish dominated media. The rest of the world is embarrassed at the gross stupidity of the uneducated, unsophisticated and unthinking Americans.", 
        "intTime": 20090521, 
        "postID": 46, 
        "quote": "", 
        "reply": "Let's see now. Israel possesses nuclear weapons that can easily target Iran. Israel has sophisticated military aircraft (gratis USA) that can eaily target Iran. Israel has an actual history of attacking another county's nuclear facilities (Iraq). Israel is the belligerent in the middle east, forever pursuing total hegemony against her neighbors. Israel is the one that has dispossessed hundreds of thousands of Palestinians, murdering innocents, imprisoning and torturing Palestinians for daring to fight back to regain their property confiscated by Israel. Yet, the American people have been brainwashed into supporting the poor, persecuted Jews. How stupid Americans are, how ignorant and how gullible. As a sovereign nation Iran has every right to possess nuclear weapons. If the US wants to control the proliferation of nukes then it should demand that Israel relinquish its nuclear weapons. Americans are being fed a line by the Jewish controlled US government and the Jewish dominated media. The rest of the world is embarrassed at the gross stupidity of the uneducated, unsophisticated and unthinking Americans.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 12:18:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "Misanthrope2"
    }, 
    {
        "content": "Now whos being unreasonable determining who can have nukes and who cant. Never quite understood that. try to imagine someone telling us that mexico and cannada cand have nukes and we cant. Some case.", 
        "intTime": 20090521, 
        "postID": 47, 
        "quote": "", 
        "reply": "Now whos being unreasonable determining who can have nukes and who cant. Never quite understood that. try to imagine someone telling us that mexico and cannada cand have nukes and we cant. Some case.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 16:42:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "john2x"
    }, 
    {
        "content": "quote: Now whos being unreasonable determining who can have nukes and who cant. Never quite understood that. try to imagine someone telling us that mexico and cannada cand have nukes and we cant. Some case. Imagine that 2x. You can't see the difference between two countries who support the extinction of a society vs those who stand for freedom and liberty. Wow...surprised me", 
        "intTime": 20090521, 
        "postID": 48, 
        "quote": "Now whos being unreasonable determining who can have nukes and who cant. Never quite understood that. try to imagine someone telling us that mexico and cannada cand have nukes and we cant. Some case.", 
        "reply": " Imagine that 2x. You can't see the difference between two countries who support the extinction of a society vs those who stand for freedom and liberty. Wow...surprised me", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 17:07:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Maybe now some other states will think twice before launching unilateral “pre-emptive” strikes And here is another. Yep Iran just wants to get along...even though they SAY they don't. Purty quick there nsnn. But if anything were to happen God forbid I KNOW you would still stand by your statments and say Iran has that right.", 
        "intTime": 20090521, 
        "postID": 49, 
        "quote": "Maybe now some other states will think twice before launching unilateral “pre-emptive” strikes", 
        "reply": " And here is another. Yep Iran just wants to get along...even though they SAY they don't. Purty quick there nsnn. But if anything were to happen God forbid I KNOW you would still stand by your statments and say Iran has that right.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 17:15:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: Maybe now some other states will think twice before launching unilateral “pre-emptive” strikes And here is another. Yep Iran just wants to get along...even though they SAY they don't. I tend to focus more on past & present actions, rather than just on rhetoric. Purty quick there nsnn. But if anything were to happen God forbid I KNOW you would still stand by your statments and say Iran has that right. Has the right to what? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090521, 
        "postID": 50, 
        "quote": "Originally posted by ACR26: quote: Maybe now some other states will think twice before launching unilateral “pre-emptive” strikes And here is another. Yep Iran just wants to get along...even though they SAY they don't. I tend to focus more on past & present actions, rather than just on rhetoric. Purty quick there nsnn. But if anything were to happen God forbid I KNOW you would still stand by your statments and say Iran has that right. Has the right to what?", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 17:47:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by Misanthrope2: Let's see now. Israel possesses nuclear weapons that can easily target Iran. Israel has sophisticated military aircraft (gratis USA) that can eaily target Iran. Israel has an actual history of attacking another county's nuclear facilities (Iraq). Israel is the belligerent in the middle east, forever pursuing total hegemony against her neighbors. Israel is the one that has dispossessed hundreds of thousands of Palestinians, murdering innocents, imprisoning and torturing Palestinians for daring to fight back to regain their property confiscated by Israel. Yet, the American people have been brainwashed into supporting the poor, persecuted Jews. How stupid Americans are, how ignorant and how gullible. As a sovereign nation Iran has every right to possess nuclear weapons. If the US wants to control the proliferation of nukes then it should demand that Israel relinquish its nuclear weapons. Americans are being fed a line by the Jewish controlled US government and the Jewish dominated media. The rest of the world is embarrassed at the gross stupidity of the uneducated, unsophisticated and unthinking Americans. It is also interesting to note that Israel has been attacked and not used nuclear weapons. It is interesting to note that at one time Israel was surrounded by nations intent on its destruction and they attacked for just that purpose. It is interesting to note that ME nations other than Israel have also taken land once claimed by the Palestinians. It is also interesting that Israel has not called for the elimination of Iran. It is sad to see that you do not grasp how dangerous nuclear proliferation is. Once that genie gets out, there will be no putting it back in the bottle until something bad has happened to force it. And what about other nations in the region? If Iran deploys nuclear weapons, why can't the rest of them? Getting rid of existing weapons is a nice goal, but EVERYONE (US, UK, France, China, DPRK, Russia, India, Pakistan) will have to agree to do it, not just Israel. I do not always agree with Israeli attitudes and actions, but they do have a right to exist, as do the Palestinians. The US did not create the situation as it exists and you seem to feel that we are brainwashed to believe that Israel only exists because of the US. And murdering innocents; of course Israel is the only one guilty of that in the region. I suppose there were no conflicts in the region where those caught in between did not get killed prior to 1947. So if Americans are everything you say we are, are you going to renounce your citizenship and move to the middle east? (I am assuming you are retired US Army) It must be great to be so enlightened.", 
        "intTime": 20090521, 
        "postID": 51, 
        "quote": "Originally posted by Misanthrope2: Let's see now. Israel possesses nuclear weapons that can easily target Iran. Israel has sophisticated military aircraft (gratis USA) that can eaily target Iran. Israel has an actual history of attacking another county's nuclear facilities (Iraq). Israel is the belligerent in the middle east, forever pursuing total hegemony against her neighbors. Israel is the one that has dispossessed hundreds of thousands of Palestinians, murdering innocents, imprisoning and torturing Palestinians for daring to fight back to regain their property confiscated by Israel. Yet, the American people have been brainwashed into supporting the poor, persecuted Jews. How stupid Americans are, how ignorant and how gullible. As a sovereign nation Iran has every right to possess nuclear weapons. If the US wants to control the proliferation of nukes then it should demand that Israel relinquish its nuclear weapons. Americans are being fed a line by the Jewish controlled US government and the Jewish dominated media. The rest of the world is embarrassed at the gross stupidity of the uneducated, unsophisticated and unthinking Americans.", 
        "reply": " It is also interesting to note that Israel has been attacked and not used nuclear weapons. It is interesting to note that at one time Israel was surrounded by nations intent on its destruction and they attacked for just that purpose. It is interesting to note that ME nations other than Israel have also taken land once claimed by the Palestinians. It is also interesting that Israel has not called for the elimination of Iran. It is sad to see that you do not grasp how dangerous nuclear proliferation is. Once that genie gets out, there will be no putting it back in the bottle until something bad has happened to force it. And what about other nations in the region? If Iran deploys nuclear weapons, why can't the rest of them? Getting rid of existing weapons is a nice goal, but EVERYONE (US, UK, France, China, DPRK, Russia, India, Pakistan) will have to agree to do it, not just Israel. I do not always agree with Israeli attitudes and actions, but they do have a right to exist, as do the Palestinians. The US did not create the situation as it exists and you seem to feel that we are brainwashed to believe that Israel only exists because of the US. And murdering innocents; of course Israel is the only one guilty of that in the region. I suppose there were no conflicts in the region where those caught in between did not get killed prior to 1947. So if Americans are everything you say we are, are you going to renounce your citizenship and move to the middle east? (I am assuming you are retired US Army) It must be great to be so enlightened.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 18:10:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities I think you are confused. Obama believes that if we would simply treat Iran better and give them some financial/other incentives then they would love the USA and terrorism would be a thing of history. Conservatives believe that Iran is a threat that shouldn't be allowed to get a nuclear weapon because they would use it once they have it. This missile is just another tool in Iran's inventory they can use for evil.", 
        "intTime": 20090521, 
        "postID": 52, 
        "quote": "Originally posted by crackerjacks61: Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities", 
        "reply": " I think you are confused. Obama believes that if we would simply treat Iran better and give them some financial/other incentives then they would love the USA and terrorism would be a thing of history. Conservatives believe that Iran is a threat that shouldn't be allowed to get a nuclear weapon because they would use it once they have it. This missile is just another tool in Iran's inventory they can use for evil.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 18:32:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Good, then they can wipe Israel off the map along with all their racial settlements and American made weapons used to kill civilians which fuels hatred towards our country. America becomes safer.", 
        "intTime": 20090521, 
        "postID": 53, 
        "quote": "", 
        "reply": "Good, then they can wipe Israel off the map along with all their racial settlements and American made weapons used to kill civilians which fuels hatred towards our country. America becomes safer.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 19:02:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "Enlightened"
    }, 
    {
        "content": "quote: Originally posted by Enlightened: Good, then they can wipe Israel off the map along with all their racial settlements and American made weapons used to kill civilians which fuels hatred towards our country. America becomes safer. That has to be one of the most profound appraisals I have ever heard of the ME situation... Like your forum name suggest you are truly \"enlightened\". And I might add well informed. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090521, 
        "postID": 54, 
        "quote": "Originally posted by Enlightened: Good, then they can wipe Israel off the map along with all their racial settlements and American made weapons used to kill civilians which fuels hatred towards our country. America becomes safer.", 
        "reply": " That has to be one of the most profound appraisals I have ever heard of the ME situation... Like your forum name suggest you are truly \"enlightened\". And I might add well informed. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-21 19:10:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "After china tested it 1st nuclear weapon. The world's nuclear powers and 200 smaller counties signed a treaty stating that they wont try to make nuclear weapons as long as the nuclear power's help them with nuclear power, or face punishment if any country try's to gain a nuclear weapon. If everyone remembers what happen after china go it wmd. It started a major arm race and a lot of war's broke out India and Pakistan fought it out the 6 day war and Vietnam. The thought that if Iran get's it's wmd's would set off a chain reaction and a major arm's build up around the world at the same time pushing us back in to the cold war.", 
        "intTime": 20090522, 
        "postID": 55, 
        "quote": "", 
        "reply": "After china tested it 1st nuclear weapon. The world's nuclear powers and 200 smaller counties signed a treaty stating that they wont try to make nuclear weapons as long as the nuclear power's help them with nuclear power, or face punishment if any country try's to gain a nuclear weapon. If everyone remembers what happen after china go it wmd. It started a major arm race and a lot of war's broke out India and Pakistan fought it out the 6 day war and Vietnam. The thought that if Iran get's it's wmd's would set off a chain reaction and a major arm's build up around the world at the same time pushing us back in to the cold war.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-22 01:01:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by Misanthrope2: Let's see now. Israel possesses nuclear weapons that can easily target Iran. Israel has sophisticated military aircraft (gratis USA) that can eaily target Iran. Israel has an actual history of attacking another county's nuclear facilities (Iraq). Israel is the belligerent in the middle east, forever pursuing total hegemony against her neighbors. Israel is the one that has dispossessed hundreds of thousands of Palestinians, murdering innocents, imprisoning and torturing Palestinians for daring to fight back to regain their property confiscated by Israel. Yet, the American people have been brainwashed into supporting the poor, persecuted Jews. How stupid Americans are, how ignorant and how gullible. As a sovereign nation Iran has every right to possess nuclear weapons. If the US wants to control the proliferation of nukes then it should demand that Israel relinquish its nuclear weapons. Americans are being fed a line by the Jewish controlled US government and the Jewish dominated media. The rest of the world is embarrassed at the gross stupidity of the uneducated, unsophisticated and unthinking Americans. All of this coming from someone that admits that he believes that the protocols of the elders of Zion are true. Pathetic.", 
        "intTime": 20090522, 
        "postID": 56, 
        "quote": "Originally posted by Misanthrope2: Let's see now. Israel possesses nuclear weapons that can easily target Iran. Israel has sophisticated military aircraft (gratis USA) that can eaily target Iran. Israel has an actual history of attacking another county's nuclear facilities (Iraq). Israel is the belligerent in the middle east, forever pursuing total hegemony against her neighbors. Israel is the one that has dispossessed hundreds of thousands of Palestinians, murdering innocents, imprisoning and torturing Palestinians for daring to fight back to regain their property confiscated by Israel. Yet, the American people have been brainwashed into supporting the poor, persecuted Jews. How stupid Americans are, how ignorant and how gullible. As a sovereign nation Iran has every right to possess nuclear weapons. If the US wants to control the proliferation of nukes then it should demand that Israel relinquish its nuclear weapons. Americans are being fed a line by the Jewish controlled US government and the Jewish dominated media. The rest of the world is embarrassed at the gross stupidity of the uneducated, unsophisticated and unthinking Americans.", 
        "reply": " All of this coming from someone that admits that he believes that the protocols of the elders of Zion are true. Pathetic.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-22 01:13:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "You can expect more saber-rattling from Ahmadinejad in the next couple of weeks. IMHO an outside threat is the only way he'll win against Mousavi. http://www.presstv.ir/election2009/ (The June 3 debate should be interesting.)", 
        "intTime": 20090522, 
        "postID": 57, 
        "quote": "", 
        "reply": "You can expect more saber-rattling from Ahmadinejad in the next couple of weeks. IMHO an outside threat is the only way he'll win against Mousavi. http://www.presstv.ir/election2009/ (The June 3 debate should be interesting.)", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-22 02:52:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "quote: Originally posted by Enlightened: Good, then they can wipe Israel off the map along with all their racial settlements and American made weapons used to kill civilians which fuels hatred towards our country. America becomes safer. \"The people are indoctrinated en masse, but enlightened only one at a time\". On this forum the majority are indoctrinated. You seem to be one of the few who are enlightened.", 
        "intTime": 20090522, 
        "postID": 58, 
        "quote": "Originally posted by Enlightened: Good, then they can wipe Israel off the map along with all their racial settlements and American made weapons used to kill civilians which fuels hatred towards our country. America becomes safer.", 
        "reply": " \"The people are indoctrinated en masse, but enlightened only one at a time\". On this forum the majority are indoctrinated. You seem to be one of the few who are enlightened.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-22 03:50:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "Misanthrope2"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities Maybe Iran is trying to get Israel to attack in the same way Saddam rocketed Israel during the Gulf War to unite the Muslim world against Israel.", 
        "intTime": 20090522, 
        "postID": 59, 
        "quote": "Originally posted by crackerjacks61: Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities", 
        "reply": " Maybe Iran is trying to get Israel to attack in the same way Saddam rocketed Israel during the Gulf War to unite the Muslim world against Israel.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-22 04:45:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities What are you a waterhead? I havn't seen anyone say that. Quite the opposite actually.", 
        "intTime": 20090522, 
        "postID": 60, 
        "quote": "Originally posted by crackerjacks61: Now come on, according to all the \"logical\" thinkers here (whom most seem to be reps), Iran is not going to try anything and this is all for peacefull purposes. Just a matter of time.... News Headline Soon... Israel Strikes Iran's Nuclear and Missle Facilities", 
        "reply": " What are you a waterhead? I havn't seen anyone say that. Quite the opposite actually.", 
        "threadID": "672198221_2670037322001", 
        "time": "2009-05-22 05:01:00", 
        "title": "Iran tests another missile; its range includes Israel, Europe", 
        "userID": "NickBrand"
    }
]