[
    {
        "content": "Well, say it ain't so joe. \"http://apnews.myway.com/article/20090418/D97L0SAG0.html\" \"GOLDEN, Colo. (AP) - The first officers on the scene had never trained for what they found at Columbine High School: No hostages. No demands. Just killing. :In the hours that followed, the nation watched in horror as the standard police procedure for dealing with shooting rampages in the U.S. proved tragically, heartbreakingly flawed on April 20, 1999. Two officers exchanged fire with one of the teenage gunmen just outside the school door, then stopped - as they had been trained to do - to wait for a SWAT team. During the 45 minutes it took for the SWAT team to assemble and go in, Eric Harris and Dylan Klebold shot 10 of the 13 people they killed that day. The killers committed suicide around the time the makeshift SWAT team finally entered. But the SWAT officers took several hours more to secure the place, moving methodically from room by room. One of the wounded, teacher Dave Sanders, slowly bled to death. (AP) Richland County school resource officers carry out instructions Friday, April 10, 2009, in... Full Image \"It was really frustrating,\" said Marjorie Lindholm, a grief counselor and speaker at police training seminars. Lindholm was a 16-year-old student in a science classroom where two classmates used their T-shirts to try to stanch Sanders' bleeding. \"We were told 'They're on their way, they're coming.'\" Ten years later, Columbine has transformed the way police in the U.S. deal with shooting rampages.\" I said exaclty this same thing when the hostages situtation took place in Binghamton, NY \"\"Ok I am by far no expert on this stuff. But can someone please tell me: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? That seems like this is the case everytime something like this happens. It seems to me that tactics need to be changed. BTW, this is on topic because this was a hostage situation and that is the number 1 job of a SWAT team. That much I do know.\" http://forums.military.com/eve/forums/a/tpc/f/672198221/m/8350037912001/p/2 and what I got from some of you was \"quit playing sunday night quarterback or quit beating up the SWAT teams. Now what's your oppinons? Tactics ARE changing, guess someone forgot to tell the police force in New York or I wonder why they are not taking these new tactics seriously?", 
        "intTime": 20090418, 
        "postID": 1, 
        "quote": "", 
        "reply": "Well, say it ain't so joe. \"http://apnews.myway.com/article/20090418/D97L0SAG0.html\" \"GOLDEN, Colo. (AP) - The first officers on the scene had never trained for what they found at Columbine High School: No hostages. No demands. Just killing. :In the hours that followed, the nation watched in horror as the standard police procedure for dealing with shooting rampages in the U.S. proved tragically, heartbreakingly flawed on April 20, 1999. Two officers exchanged fire with one of the teenage gunmen just outside the school door, then stopped - as they had been trained to do - to wait for a SWAT team. During the 45 minutes it took for the SWAT team to assemble and go in, Eric Harris and Dylan Klebold shot 10 of the 13 people they killed that day. The killers committed suicide around the time the makeshift SWAT team finally entered. But the SWAT officers took several hours more to secure the place, moving methodically from room by room. One of the wounded, teacher Dave Sanders, slowly bled to death. (AP) Richland County school resource officers carry out instructions Friday, April 10, 2009, in... Full Image \"It was really frustrating,\" said Marjorie Lindholm, a grief counselor and speaker at police training seminars. Lindholm was a 16-year-old student in a science classroom where two classmates used their T-shirts to try to stanch Sanders' bleeding. \"We were told 'They're on their way, they're coming.'\" Ten years later, Columbine has transformed the way police in the U.S. deal with shooting rampages.\" I said exaclty this same thing when the hostages situtation took place in Binghamton, NY \"\"Ok I am by far no expert on this stuff. But can someone please tell me: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? That seems like this is the case everytime something like this happens. It seems to me that tactics need to be changed. BTW, this is on topic because this was a hostage situation and that is the number 1 job of a SWAT team. That much I do know.\" http://forums.military.com/eve/forums/a/tpc/f/672198221/m/8350037912001/p/2 and what I got from some of you was \"quit playing sunday night quarterback or quit beating up the SWAT teams. Now what's your oppinons? Tactics ARE changing, guess someone forgot to tell the police force in New York or I wonder why they are not taking these new tactics seriously?", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 11:49:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy...", 
        "intTime": 20090418, 
        "postID": 2, 
        "quote": "Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building?", 
        "reply": " Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy...", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 11:59:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... You know what Irwin_R_Schyster? I can handle that answer much better than the BS that was tossed at me. Thanks man.", 
        "intTime": 20090418, 
        "postID": 3, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy...", 
        "reply": " You know what Irwin_R_Schyster? I can handle that answer much better than the BS that was tossed at me. Thanks man.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 12:03:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: You know what Irwin_R_Schyster? I can handle that answer much better than the BS that was tossed at me. Thanks man. I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave", 
        "intTime": 20090418, 
        "postID": 4, 
        "quote": "Originally posted by crackerjacks61: You know what Irwin_R_Schyster? I can handle that answer much better than the BS that was tossed at me. Thanks man.", 
        "reply": " I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 12:13:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: You know what Irwin_R_Schyster? I can handle that answer much better than the BS that was tossed at me. Thanks man. I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave No dave there isn't no way to stop this stuff from taking place. But like the article says, the tactics are outdated and ineffective which is why many Police Forces (at least in the article) have changed them. That's quite apparent. It makes absolutely no since what so ever to just stand by pointing a gun at a building while people are getting slaughtered because of a fear that people will get killed. In the NY case, they new exactly how many gunmen there was because the lady called in her cell phone and told them. They knew he was shooting because the lady said she was shot? What more information does someone need to go in? The back door was blocked by a car (his car). Lets say the lady was wrong, the worst could happen was the cops busted in, walk through the buildings (like you see in the movies, I know this is not a movie, but they are trained to do it that way, with the Pop-ups and pop-outs (shoot or no shoot) pictures or whatever they call them. I know it's not a movie nor a perfect world. But like the article says, it's all about the tactics and apparently some if not many police forces do not have a problem implementing them, so why would anyone (specially someone that's not a cop) have a problem with them? Which is probably what...98% of us here (non-cops)? As someone said, leave it up to the experts, which is fine with me. it's just that in this case, the experts apparently matched my own opinion of it all.", 
        "intTime": 20090418, 
        "postID": 5, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: You know what Irwin_R_Schyster? I can handle that answer much better than the BS that was tossed at me. Thanks man. I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave", 
        "reply": " No dave there isn't no way to stop this stuff from taking place. But like the article says, the tactics are outdated and ineffective which is why many Police Forces (at least in the article) have changed them. That's quite apparent. It makes absolutely no since what so ever to just stand by pointing a gun at a building while people are getting slaughtered because of a fear that people will get killed. In the NY case, they new exactly how many gunmen there was because the lady called in her cell phone and told them. They knew he was shooting because the lady said she was shot? What more information does someone need to go in? The back door was blocked by a car (his car). Lets say the lady was wrong, the worst could happen was the cops busted in, walk through the buildings (like you see in the movies, I know this is not a movie, but they are trained to do it that way, with the Pop-ups and pop-outs (shoot or no shoot) pictures or whatever they call them. I know it's not a movie nor a perfect world. But like the article says, it's all about the tactics and apparently some if not many police forces do not have a problem implementing them, so why would anyone (specially someone that's not a cop) have a problem with them? Which is probably what...98% of us here (non-cops)? As someone said, leave it up to the experts, which is fine with me. it's just that in this case, the experts apparently matched my own opinion of it all.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 12:46:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. Your not saying to outlaw guns are you? This stuff has been going on since time began. The best way, is to let people defend themselves. Not many would go on a shooting rampage knowing they may not even get 1 shot off before they are dead. Inocent people are not being allowed to defend themselves because of stupid rules, regulations and laws that mean nothing to the criminals or the criminaly insane or some one that is just ****ed off at the world and wants to make a last stand show before they out themselves.", 
        "intTime": 20090418, 
        "postID": 6, 
        "quote": "I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things.", 
        "reply": " Your not saying to outlaw guns are you? This stuff has been going on since time began. The best way, is to let people defend themselves. Not many would go on a shooting rampage knowing they may not even get 1 shot off before they are dead. Inocent people are not being allowed to defend themselves because of stupid rules, regulations and laws that mean nothing to the criminals or the criminaly insane or some one that is just ****ed off at the world and wants to make a last stand show before they out themselves.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 12:49:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. That I totally agree with. Then let the people arm themselves whereever they are. If not that it should be required that the building have a security system with locked doors. And if nothing else a Supervisor or a Manager that is armed and ordered to use it when and if it ever happens.", 
        "intTime": 20090418, 
        "postID": 7, 
        "quote": "There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so.", 
        "reply": " That I totally agree with. Then let the people arm themselves whereever they are. If not that it should be required that the building have a security system with locked doors. And if nothing else a Supervisor or a Manager that is armed and ordered to use it when and if it ever happens.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 12:53:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "\"Ok I am by far no expert on this stuff\" Well I agree with you.", 
        "intTime": 20090418, 
        "postID": 8, 
        "quote": "", 
        "reply": "\"Ok I am by far no expert on this stuff\" Well I agree with you.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 13:47:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well.", 
        "intTime": 20090418, 
        "postID": 9, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy...", 
        "reply": " Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 13:52:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well. I had a difficult and MUCH more dangerous job in the Army too, was 18 years old, didn't make 5000+ a month, didn't get to go home when I wanted to....etc Yet I never complained about it, because I volunteered to put my life on the line in defense of my nation and of people I have never met here and abroad.... Far too many Law Enforcement departments around the country have this \"feel sorry for me\" mentality...lol, you don't like it quit, if you don't quit do your damn job, and do it right like a man is suppose to do it.. Sorry, I have an Airborne mind set", 
        "intTime": 20090418, 
        "postID": 10, 
        "quote": "Originally posted by scooter_mech: quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well.", 
        "reply": " I had a difficult and MUCH more dangerous job in the Army too, was 18 years old, didn't make 5000+ a month, didn't get to go home when I wanted to....etc Yet I never complained about it, because I volunteered to put my life on the line in defense of my nation and of people I have never met here and abroad.... Far too many Law Enforcement departments around the country have this \"feel sorry for me\" mentality...lol, you don't like it quit, if you don't quit do your damn job, and do it right like a man is suppose to do it.. Sorry, I have an Airborne mind set", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 14:23:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by 101MPRAT: \"Ok I am by far no expert on this stuff\" Well I agree with you. and your point? fact is the tactics are changed because they saw the exact same thing I did, of course way before I did. There is no argument to that fact.", 
        "intTime": 20090418, 
        "postID": 11, 
        "quote": "Originally posted by 101MPRAT: \"Ok I am by far no expert on this stuff\" Well I agree with you.", 
        "reply": " and your point? fact is the tactics are changed because they saw the exact same thing I did, of course way before I did. There is no argument to that fact.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 14:28:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by scooter_mech: quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well. I had a difficult and MUCH more dangerous job in the Army too, was 18 years old, didn't make 5000+ a month, didn't get to go home when I wanted to....etc Yet I never complained about it, because I volunteered to put my life on the line in defense of my nation and of people I have never met here and abroad.... Far too many Law Enforcement departments around the country have this \"feel sorry for me\" mentality...lol, you don't like it quit, if you don't quit do your damn job, and do it right like a man is suppose to do it.. Sorry, I have an Airborne mind set Sounds like a damn good one too Irwin. Not sure how old you are but you should join a force. I could sleep well at night knowing there are professionals on the street that would indeed do their job. Please don't taser anyone out of line, it really is unprofessional and shows a total lack of confidence to handle a situation...IMHO. Course some won't like my opinion, but hey it's a free message board and we all have them. Thanks for your service.", 
        "intTime": 20090418, 
        "postID": 12, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by scooter_mech: quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well. I had a difficult and MUCH more dangerous job in the Army too, was 18 years old, didn't make 5000+ a month, didn't get to go home when I wanted to....etc Yet I never complained about it, because I volunteered to put my life on the line in defense of my nation and of people I have never met here and abroad.... Far too many Law Enforcement departments around the country have this \"feel sorry for me\" mentality...lol, you don't like it quit, if you don't quit do your damn job, and do it right like a man is suppose to do it.. Sorry, I have an Airborne mind set", 
        "reply": " Sounds like a damn good one too Irwin. Not sure how old you are but you should join a force. I could sleep well at night knowing there are professionals on the street that would indeed do their job. Please don't taser anyone out of line, it really is unprofessional and shows a total lack of confidence to handle a situation...IMHO. Course some won't like my opinion, but hey it's a free message board and we all have them. Thanks for your service.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 14:33:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. Your not saying to outlaw guns are you? This stuff has been going on since time began. The best way, is to let people defend themselves. Not many would go on a shooting rampage knowing they may not even get 1 shot off before they are dead. Inocent people are not being allowed to defend themselves because of stupid rules, regulations and laws that mean nothing to the criminals or the criminaly insane or some one that is just ****ed off at the world and wants to make a last stand show before they out themselves. No offense Crackerjack, but what is it about the words, \"Only an armed population can possibly do so.\" I noticed you picked up on this sentence in a follow through post... Dave", 
        "intTime": 20090418, 
        "postID": 13, 
        "quote": "Originally posted by crackerjacks61: quote: I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. Your not saying to outlaw guns are you? This stuff has been going on since time began. The best way, is to let people defend themselves. Not many would go on a shooting rampage knowing they may not even get 1 shot off before they are dead. Inocent people are not being allowed to defend themselves because of stupid rules, regulations and laws that mean nothing to the criminals or the criminaly insane or some one that is just ****ed off at the world and wants to make a last stand show before they out themselves.", 
        "reply": " No offense Crackerjack, but what is it about the words, \"Only an armed population can possibly do so.\" I noticed you picked up on this sentence in a follow through post... Dave", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 14:56:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by scooter_mech: quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well. I had a difficult and MUCH more dangerous job in the Army too, was 18 years old, didn't make 5000+ a month, didn't get to go home when I wanted to....etc Yet I never complained about it, because I volunteered to put my life on the line in defense of my nation and of people I have never met here and abroad.... Far too many Law Enforcement departments around the country have this \"feel sorry for me\" mentality...lol, you don't like it quit, if you don't quit do your damn job, and do it right like a man is suppose to do it.. Sorry, I have an Airborne mind set Sounds like a damn good one too Irwin. Not sure how old you are but you should join a force. I could sleep well at night knowing there are professionals on the street that would indeed do their job. Please don't taser anyone out of line, it really is unprofessional and shows a total lack of confidence to handle a situation...IMHO. Course some won't like my opinion, but hey it's a free message board and we all have them. Thanks for your service. I'm 24 and currently in college. I have plans to hopefully work for an agency in virgina Me a cop? Wouldn't work....I would become more cynical than I am now. I would eventually get relieved of my duties for having a \"rogue\" attitude i'm sure", 
        "intTime": 20090418, 
        "postID": 14, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by scooter_mech: quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well. I had a difficult and MUCH more dangerous job in the Army too, was 18 years old, didn't make 5000+ a month, didn't get to go home when I wanted to....etc Yet I never complained about it, because I volunteered to put my life on the line in defense of my nation and of people I have never met here and abroad.... Far too many Law Enforcement departments around the country have this \"feel sorry for me\" mentality...lol, you don't like it quit, if you don't quit do your damn job, and do it right like a man is suppose to do it.. Sorry, I have an Airborne mind set Sounds like a damn good one too Irwin. Not sure how old you are but you should join a force. I could sleep well at night knowing there are professionals on the street that would indeed do their job. Please don't taser anyone out of line, it really is unprofessional and shows a total lack of confidence to handle a situation...IMHO. Course some won't like my opinion, but hey it's a free message board and we all have them. Thanks for your service.", 
        "reply": " I'm 24 and currently in college. I have plans to hopefully work for an agency in virgina Me a cop? Wouldn't work....I would become more cynical than I am now. I would eventually get relieved of my duties for having a \"rogue\" attitude i'm sure", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 15:05:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by crackerjacks61: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by scooter_mech: quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well. I had a difficult and MUCH more dangerous job in the Army too, was 18 years old, didn't make 5000+ a month, didn't get to go home when I wanted to....etc Yet I never complained about it, because I volunteered to put my life on the line in defense of my nation and of people I have never met here and abroad.... Far too many Law Enforcement departments around the country have this \"feel sorry for me\" mentality...lol, you don't like it quit, if you don't quit do your damn job, and do it right like a man is suppose to do it.. Sorry, I have an Airborne mind set Sounds like a damn good one too Irwin. Not sure how old you are but you should join a force. I could sleep well at night knowing there are professionals on the street that would indeed do their job. Please don't taser anyone out of line, it really is unprofessional and shows a total lack of confidence to handle a situation...IMHO. Course some won't like my opinion, but hey it's a free message board and we all have them. Thanks for your service. I'm 24 and currently in college. I have plans to hopefully work for an agency in virgina Me a cop? Wouldn't work....I would become more cynical than I am now. I would eventually get relieved of my duties for having a \"rogue\" attitude i'm sure Nothing wrong with a rogue that has a good head on his shoulders and is disciplined and you are. But \"political correct\" your not, even the right wing does not like that as you can tell from this board. The very ones that says that hate PC. lots of luck in the political correct world..also this is what they call \"business since\" at work aka kissing the bosses butt...my bust. We need to go back to the old days when a man did his job, did it damn well, and everyone else stayed the hell out of it including the bosses which in todays world means micro-manage to death.", 
        "intTime": 20090418, 
        "postID": 15, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by crackerjacks61: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by scooter_mech: quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well. I had a difficult and MUCH more dangerous job in the Army too, was 18 years old, didn't make 5000+ a month, didn't get to go home when I wanted to....etc Yet I never complained about it, because I volunteered to put my life on the line in defense of my nation and of people I have never met here and abroad.... Far too many Law Enforcement departments around the country have this \"feel sorry for me\" mentality...lol, you don't like it quit, if you don't quit do your damn job, and do it right like a man is suppose to do it.. Sorry, I have an Airborne mind set Sounds like a damn good one too Irwin. Not sure how old you are but you should join a force. I could sleep well at night knowing there are professionals on the street that would indeed do their job. Please don't taser anyone out of line, it really is unprofessional and shows a total lack of confidence to handle a situation...IMHO. Course some won't like my opinion, but hey it's a free message board and we all have them. Thanks for your service. I'm 24 and currently in college. I have plans to hopefully work for an agency in virgina Me a cop? Wouldn't work....I would become more cynical than I am now. I would eventually get relieved of my duties for having a \"rogue\" attitude i'm sure", 
        "reply": " Nothing wrong with a rogue that has a good head on his shoulders and is disciplined and you are. But \"political correct\" your not, even the right wing does not like that as you can tell from this board. The very ones that says that hate PC. lots of luck in the political correct world..also this is what they call \"business since\" at work aka kissing the bosses butt...my bust. We need to go back to the old days when a man did his job, did it damn well, and everyone else stayed the hell out of it including the bosses which in todays world means micro-manage to death.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 15:26:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: You know what Irwin_R_Schyster? I can handle that answer much better than the BS that was tossed at me. Thanks man. I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave Can I make the assumption that, if such occurrences don't make sense to police, who are trained to deal with them, they'd make even less to an 'armed population'? One of the salient pictures, in my mind, is the police evacuating students. The students have their hands on their heads in the classic prisoner posture and the police have their weapons at ready. You telling me some members of an 'armed population' might not have been adding to the list of dead and wounded? Panic is a wonderful thing, even when you're trained, imagine it when you're not. You are right about one thing however, Dave, that once some elements of that 'armed population' got started, it wouldn't stop until the clips were empty. The most recent book on Columbine points out that the killers failed in their objective of creating mass casualties. Perhaps part of that was the hope that the police would overreact and kill the wrong people. The bottom line is that the explosives used were abject failures. Diebold and his friend might have failed completely if they hadn't been able to acquire weapons, and an ample supply of ammunition (at the last minute).", 
        "intTime": 20090419, 
        "postID": 16, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: You know what Irwin_R_Schyster? I can handle that answer much better than the BS that was tossed at me. Thanks man. I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave", 
        "reply": " Can I make the assumption that, if such occurrences don't make sense to police, who are trained to deal with them, they'd make even less to an 'armed population'? One of the salient pictures, in my mind, is the police evacuating students. The students have their hands on their heads in the classic prisoner posture and the police have their weapons at ready. You telling me some members of an 'armed population' might not have been adding to the list of dead and wounded? Panic is a wonderful thing, even when you're trained, imagine it when you're not. You are right about one thing however, Dave, that once some elements of that 'armed population' got started, it wouldn't stop until the clips were empty. The most recent book on Columbine points out that the killers failed in their objective of creating mass casualties. Perhaps part of that was the hope that the police would overreact and kill the wrong people. The bottom line is that the explosives used were abject failures. Diebold and his friend might have failed completely if they hadn't been able to acquire weapons, and an ample supply of ammunition (at the last minute).", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-19 17:30:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by Grachus: I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave quote: Originally posted by popsiq: Can I make the assumption that, if such occurrences don't make sense to police, who are trained to deal with them, they'd make even less to an 'armed population'? Absolutely right Popsig. If I was sitting in a room and some guy came in shooting, it would make no damn sense to me. quote: Originally posted by popsiq: One of the salient pictures, in my mind, is the police evacuating students. The students have their hands on their heads in the classic prisoner posture and the police have their weapons at ready. You telling me some members of an 'armed population' might not have been adding to the list of dead and wounded? Panic is a wonderful thing, even when you're trained, imagine it when you're not. You are right about one thing however, Dave, that once some elements of that 'armed population' got started, it wouldn't stop until the clips were empty. The most recent book on Columbine points out that the killers failed in their objective of creating mass casualties. Perhaps part of that was the hope that the police would overreact and kill the wrong people. (snip) I am always curious about the argument that if there were a lot of armed people the carnage would be worse. In fact, there have been quite a few cases of these would be killers getting blown away BEFORE they could notch up a big kill, and I can't recall innocent people getting killed in truckload batches. In fact, such stories are just plain NOT news worthy... I was trained to use a gun, and WOULD use a gun, if I could legally carry one. And if by chance I DID shoot one innocent person - What is that compared to stopping the deaths of ten or twenty other people? Look - What evidence can you bring to bear about paniced people shooting everyone in sight? How often does this happen? You DO realise that in parts of the US people DO carry arms? That if your logic was correct, we would be reading about these kinds of stories every day? \"Man kills twelve when he heard a car backfire.\" \"Now says, he's really, really sorry about that.\" Dave", 
        "intTime": 20090419, 
        "postID": 17, 
        "quote": "Originally posted by Grachus: I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave", 
        "reply": " quote: Originally posted by popsiq: Can I make the assumption that, if such occurrences don't make sense to police, who are trained to deal with them, they'd make even less to an 'armed population'? Absolutely right Popsig. If I was sitting in a room and some guy came in shooting, it would make no damn sense to me. quote: Originally posted by popsiq: One of the salient pictures, in my mind, is the police evacuating students. The students have their hands on their heads in the classic prisoner posture and the police have their weapons at ready. You telling me some members of an 'armed population' might not have been adding to the list of dead and wounded? Panic is a wonderful thing, even when you're trained, imagine it when you're not. You are right about one thing however, Dave, that once some elements of that 'armed population' got started, it wouldn't stop until the clips were empty. The most recent book on Columbine points out that the killers failed in their objective of creating mass casualties. Perhaps part of that was the hope that the police would overreact and kill the wrong people. (snip) I am always curious about the argument that if there were a lot of armed people the carnage would be worse. In fact, there have been quite a few cases of these would be killers getting blown away BEFORE they could notch up a big kill, and I can't recall innocent people getting killed in truckload batches. In fact, such stories are just plain NOT news worthy... I was trained to use a gun, and WOULD use a gun, if I could legally carry one. And if by chance I DID shoot one innocent person - What is that compared to stopping the deaths of ten or twenty other people? Look - What evidence can you bring to bear about paniced people shooting everyone in sight? How often does this happen? You DO realise that in parts of the US people DO carry arms? That if your logic was correct, we would be reading about these kinds of stories every day? \"Man kills twelve when he heard a car backfire.\" \"Now says, he's really, really sorry about that.\" Dave", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-19 17:53:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Grachus: I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave quote: Originally posted by popsiq: Can I make the assumption that, if such occurrences don't make sense to police, who are trained to deal with them, they'd make even less to an 'armed population'? Absolutely right Popsig. If I was sitting in a room and some guy came in shooting, it would make no damn sense to me. quote: Originally posted by popsiq: One of the salient pictures, in my mind, is the police evacuating students. The students have their hands on their heads in the classic prisoner posture and the police have their weapons at ready. You telling me some members of an 'armed population' might not have been adding to the list of dead and wounded? Panic is a wonderful thing, even when you're trained, imagine it when you're not. You are right about one thing however, Dave, that once some elements of that 'armed population' got started, it wouldn't stop until the clips were empty. The most recent book on Columbine points out that the killers failed in their objective of creating mass casualties. Perhaps part of that was the hope that the police would overreact and kill the wrong people. (snip) I am always curious about the argument that if there were a lot of armed people the carnage would be worse. In fact, there have been quite a few cases of these would be killers getting blown away BEFORE they could notch up a big kill, and I can't recall innocent people getting killed in truckload batches. In fact, such stories are just plain NOT news worthy... I was trained to use a gun, and WOULD use a gun, if I could legally carry one. And if by chance I DID shoot one innocent person - What is that compared to stopping the deaths of ten or twenty other people? Look - What evidence can you bring to bear about paniced people shooting everyone in sight? How often does this happen? You DO realise that in parts of the US people DO carry arms? That if your logic was correct, we would be reading about these kinds of stories every day? \"Man kills twelve when he heard a car backfire.\" \"Now says, he's really, really sorry about that.\" Dave Can you recall MyLai? And those men were trained. But they told the court they were in fear for their lives, or acting under strong emotion when that 'busload' of innocents got killed. I dare say the Capone mob would have said the same thing about gunning down Bug Moran's mob in that garage. And Wounded Knee was a panicked response to a perceived threat. Such stuff does happen Dave. Duck hunting should demonstrate that for you. Strikes me that there are shooting stories across America almost every day - another family shootin' and suicide in our papers to-day. How much 'panic' is involved? I don't know, but assuming that the occurrences that do happen are all 'cold blooded', it stands to reason that 'excitement' of any kind wouldn't be an improvement.", 
        "intTime": 20090419, 
        "postID": 18, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Grachus: I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave quote: Originally posted by popsiq: Can I make the assumption that, if such occurrences don't make sense to police, who are trained to deal with them, they'd make even less to an 'armed population'? Absolutely right Popsig. If I was sitting in a room and some guy came in shooting, it would make no damn sense to me. quote: Originally posted by popsiq: One of the salient pictures, in my mind, is the police evacuating students. The students have their hands on their heads in the classic prisoner posture and the police have their weapons at ready. You telling me some members of an 'armed population' might not have been adding to the list of dead and wounded? Panic is a wonderful thing, even when you're trained, imagine it when you're not. You are right about one thing however, Dave, that once some elements of that 'armed population' got started, it wouldn't stop until the clips were empty. The most recent book on Columbine points out that the killers failed in their objective of creating mass casualties. Perhaps part of that was the hope that the police would overreact and kill the wrong people. (snip) I am always curious about the argument that if there were a lot of armed people the carnage would be worse. In fact, there have been quite a few cases of these would be killers getting blown away BEFORE they could notch up a big kill, and I can't recall innocent people getting killed in truckload batches. In fact, such stories are just plain NOT news worthy... I was trained to use a gun, and WOULD use a gun, if I could legally carry one. And if by chance I DID shoot one innocent person - What is that compared to stopping the deaths of ten or twenty other people? Look - What evidence can you bring to bear about paniced people shooting everyone in sight? How often does this happen? You DO realise that in parts of the US people DO carry arms? That if your logic was correct, we would be reading about these kinds of stories every day? \"Man kills twelve when he heard a car backfire.\" \"Now says, he's really, really sorry about that.\" Dave", 
        "reply": " Can you recall MyLai? And those men were trained. But they told the court they were in fear for their lives, or acting under strong emotion when that 'busload' of innocents got killed. I dare say the Capone mob would have said the same thing about gunning down Bug Moran's mob in that garage. And Wounded Knee was a panicked response to a perceived threat. Such stuff does happen Dave. Duck hunting should demonstrate that for you. Strikes me that there are shooting stories across America almost every day - another family shootin' and suicide in our papers to-day. How much 'panic' is involved? I don't know, but assuming that the occurrences that do happen are all 'cold blooded', it stands to reason that 'excitement' of any kind wouldn't be an improvement.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-19 18:32:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Can you recall MyLai? And those men were trained. But they told the court they were in fear for their lives, or acting under strong emotion when that 'busload' of innocents got killed. I dare say the Capone mob would have said the same thing about gunning down Bug Moran's mob in that garage. And Wounded Knee was a panicked response to a perceived threat. Such stuff does happen Dave. Duck hunting should demonstrate that for you. Strikes me that there are shooting stories across America almost every day - another family shootin' and suicide in our papers to-day. How much 'panic' is involved? I don't know, but assuming that the occurrences that do happen are all 'cold blooded', it stands to reason that 'excitement' of any kind wouldn't be an improvement. I thought you were a serious poster. I am beginning to change my mind about this. Your post above needs absolutely no answer. It refutes itself. Dave", 
        "intTime": 20090419, 
        "postID": 19, 
        "quote": "Originally posted by popsiq: Can you recall MyLai? And those men were trained. But they told the court they were in fear for their lives, or acting under strong emotion when that 'busload' of innocents got killed. I dare say the Capone mob would have said the same thing about gunning down Bug Moran's mob in that garage. And Wounded Knee was a panicked response to a perceived threat. Such stuff does happen Dave. Duck hunting should demonstrate that for you. Strikes me that there are shooting stories across America almost every day - another family shootin' and suicide in our papers to-day. How much 'panic' is involved? I don't know, but assuming that the occurrences that do happen are all 'cold blooded', it stands to reason that 'excitement' of any kind wouldn't be an improvement.", 
        "reply": " I thought you were a serious poster. I am beginning to change my mind about this. Your post above needs absolutely no answer. It refutes itself. Dave", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-19 18:40:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Your post simply explains itself... Respectfully, SUNLINER81", 
        "intTime": 20090419, 
        "postID": 20, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy...", 
        "reply": " Your post simply explains itself... Respectfully, SUNLINER81", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-19 19:33:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Well, say it ain't so joe. \"http://apnews.myway.com/article/20090418/D97L0SAG0.html\" \"GOLDEN, Colo. (AP) - The first officers on the scene had never trained for what they found at Columbine High School: No hostages. No demands. Just killing. :In the hours that followed, the nation watched in horror as the standard police procedure for dealing with shooting rampages in the U.S. proved tragically, heartbreakingly flawed on April 20, 1999. Two officers exchanged fire with one of the teenage gunmen just outside the school door, then stopped - as they had been trained to do - to wait for a SWAT team. During the 45 minutes it took for the SWAT team to assemble and go in, Eric Harris and Dylan Klebold shot 10 of the 13 people they killed that day. The killers committed suicide around the time the makeshift SWAT team finally entered. But the SWAT officers took several hours more to secure the place, moving methodically from room by room. One of the wounded, teacher Dave Sanders, slowly bled to death. (AP) Richland County school resource officers carry out instructions Friday, April 10, 2009, in... Full Image \"It was really frustrating,\" said Marjorie Lindholm, a grief counselor and speaker at police training seminars. Lindholm was a 16-year-old student in a science classroom where two classmates used their T-shirts to try to stanch Sanders' bleeding. \"We were told 'They're on their way, they're coming.'\" Ten years later, Columbine has transformed the way police in the U.S. deal with shooting rampages.\" I said exaclty this same thing when the hostages situtation took place in Binghamton, NY \"\"Ok I am by far no expert on this stuff. But can someone please tell me: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? That seems like this is the case everytime something like this happens. It seems to me that tactics need to be changed. BTW, this is on topic because this was a hostage situation and that is the number 1 job of a SWAT team. That much I do know.\" http://forums.military.com/eve/forums/a/tpc/f/672198221/m/8350037912001/p/2 and what I got from some of you was \"quit playing sunday night quarterback or quit beating up the SWAT teams. Now what's your oppinons? Tactics ARE changing, guess someone forgot to tell the police force in New York or I wonder why they are not taking these new tactics seriously?", 
        "intTime": 20090418, 
        "postID": 21, 
        "quote": "", 
        "reply": "Well, say it ain't so joe. \"http://apnews.myway.com/article/20090418/D97L0SAG0.html\" \"GOLDEN, Colo. (AP) - The first officers on the scene had never trained for what they found at Columbine High School: No hostages. No demands. Just killing. :In the hours that followed, the nation watched in horror as the standard police procedure for dealing with shooting rampages in the U.S. proved tragically, heartbreakingly flawed on April 20, 1999. Two officers exchanged fire with one of the teenage gunmen just outside the school door, then stopped - as they had been trained to do - to wait for a SWAT team. During the 45 minutes it took for the SWAT team to assemble and go in, Eric Harris and Dylan Klebold shot 10 of the 13 people they killed that day. The killers committed suicide around the time the makeshift SWAT team finally entered. But the SWAT officers took several hours more to secure the place, moving methodically from room by room. One of the wounded, teacher Dave Sanders, slowly bled to death. (AP) Richland County school resource officers carry out instructions Friday, April 10, 2009, in... Full Image \"It was really frustrating,\" said Marjorie Lindholm, a grief counselor and speaker at police training seminars. Lindholm was a 16-year-old student in a science classroom where two classmates used their T-shirts to try to stanch Sanders' bleeding. \"We were told 'They're on their way, they're coming.'\" Ten years later, Columbine has transformed the way police in the U.S. deal with shooting rampages.\" I said exaclty this same thing when the hostages situtation took place in Binghamton, NY \"\"Ok I am by far no expert on this stuff. But can someone please tell me: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? That seems like this is the case everytime something like this happens. It seems to me that tactics need to be changed. BTW, this is on topic because this was a hostage situation and that is the number 1 job of a SWAT team. That much I do know.\" http://forums.military.com/eve/forums/a/tpc/f/672198221/m/8350037912001/p/2 and what I got from some of you was \"quit playing sunday night quarterback or quit beating up the SWAT teams. Now what's your oppinons? Tactics ARE changing, guess someone forgot to tell the police force in New York or I wonder why they are not taking these new tactics seriously?", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 11:49:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy...", 
        "intTime": 20090418, 
        "postID": 22, 
        "quote": "Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building?", 
        "reply": " Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy...", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 11:59:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... You know what Irwin_R_Schyster? I can handle that answer much better than the BS that was tossed at me. Thanks man.", 
        "intTime": 20090418, 
        "postID": 23, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy...", 
        "reply": " You know what Irwin_R_Schyster? I can handle that answer much better than the BS that was tossed at me. Thanks man.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 12:03:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: You know what Irwin_R_Schyster? I can handle that answer much better than the BS that was tossed at me. Thanks man. I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave", 
        "intTime": 20090418, 
        "postID": 24, 
        "quote": "Originally posted by crackerjacks61: You know what Irwin_R_Schyster? I can handle that answer much better than the BS that was tossed at me. Thanks man.", 
        "reply": " I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 12:13:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: You know what Irwin_R_Schyster? I can handle that answer much better than the BS that was tossed at me. Thanks man. I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave No dave there isn't no way to stop this stuff from taking place. But like the article says, the tactics are outdated and ineffective which is why many Police Forces (at least in the article) have changed them. That's quite apparent. It makes absolutely no since what so ever to just stand by pointing a gun at a building while people are getting slaughtered because of a fear that people will get killed. In the NY case, they new exactly how many gunmen there was because the lady called in her cell phone and told them. They knew he was shooting because the lady said she was shot? What more information does someone need to go in? The back door was blocked by a car (his car). Lets say the lady was wrong, the worst could happen was the cops busted in, walk through the buildings (like you see in the movies, I know this is not a movie, but they are trained to do it that way, with the Pop-ups and pop-outs (shoot or no shoot) pictures or whatever they call them. I know it's not a movie nor a perfect world. But like the article says, it's all about the tactics and apparently some if not many police forces do not have a problem implementing them, so why would anyone (specially someone that's not a cop) have a problem with them? Which is probably what...98% of us here (non-cops)? As someone said, leave it up to the experts, which is fine with me. it's just that in this case, the experts apparently matched my own opinion of it all.", 
        "intTime": 20090418, 
        "postID": 25, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: You know what Irwin_R_Schyster? I can handle that answer much better than the BS that was tossed at me. Thanks man. I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave", 
        "reply": " No dave there isn't no way to stop this stuff from taking place. But like the article says, the tactics are outdated and ineffective which is why many Police Forces (at least in the article) have changed them. That's quite apparent. It makes absolutely no since what so ever to just stand by pointing a gun at a building while people are getting slaughtered because of a fear that people will get killed. In the NY case, they new exactly how many gunmen there was because the lady called in her cell phone and told them. They knew he was shooting because the lady said she was shot? What more information does someone need to go in? The back door was blocked by a car (his car). Lets say the lady was wrong, the worst could happen was the cops busted in, walk through the buildings (like you see in the movies, I know this is not a movie, but they are trained to do it that way, with the Pop-ups and pop-outs (shoot or no shoot) pictures or whatever they call them. I know it's not a movie nor a perfect world. But like the article says, it's all about the tactics and apparently some if not many police forces do not have a problem implementing them, so why would anyone (specially someone that's not a cop) have a problem with them? Which is probably what...98% of us here (non-cops)? As someone said, leave it up to the experts, which is fine with me. it's just that in this case, the experts apparently matched my own opinion of it all.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 12:46:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. Your not saying to outlaw guns are you? This stuff has been going on since time began. The best way, is to let people defend themselves. Not many would go on a shooting rampage knowing they may not even get 1 shot off before they are dead. Inocent people are not being allowed to defend themselves because of stupid rules, regulations and laws that mean nothing to the criminals or the criminaly insane or some one that is just ****ed off at the world and wants to make a last stand show before they out themselves.", 
        "intTime": 20090418, 
        "postID": 26, 
        "quote": "I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things.", 
        "reply": " Your not saying to outlaw guns are you? This stuff has been going on since time began. The best way, is to let people defend themselves. Not many would go on a shooting rampage knowing they may not even get 1 shot off before they are dead. Inocent people are not being allowed to defend themselves because of stupid rules, regulations and laws that mean nothing to the criminals or the criminaly insane or some one that is just ****ed off at the world and wants to make a last stand show before they out themselves.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 12:49:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. That I totally agree with. Then let the people arm themselves whereever they are. If not that it should be required that the building have a security system with locked doors. And if nothing else a Supervisor or a Manager that is armed and ordered to use it when and if it ever happens.", 
        "intTime": 20090418, 
        "postID": 27, 
        "quote": "There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so.", 
        "reply": " That I totally agree with. Then let the people arm themselves whereever they are. If not that it should be required that the building have a security system with locked doors. And if nothing else a Supervisor or a Manager that is armed and ordered to use it when and if it ever happens.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 12:53:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "\"Ok I am by far no expert on this stuff\" Well I agree with you.", 
        "intTime": 20090418, 
        "postID": 28, 
        "quote": "", 
        "reply": "\"Ok I am by far no expert on this stuff\" Well I agree with you.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 13:47:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well.", 
        "intTime": 20090418, 
        "postID": 29, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy...", 
        "reply": " Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 13:52:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well. I had a difficult and MUCH more dangerous job in the Army too, was 18 years old, didn't make 5000+ a month, didn't get to go home when I wanted to....etc Yet I never complained about it, because I volunteered to put my life on the line in defense of my nation and of people I have never met here and abroad.... Far too many Law Enforcement departments around the country have this \"feel sorry for me\" mentality...lol, you don't like it quit, if you don't quit do your damn job, and do it right like a man is suppose to do it.. Sorry, I have an Airborne mind set", 
        "intTime": 20090418, 
        "postID": 30, 
        "quote": "Originally posted by scooter_mech: quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well.", 
        "reply": " I had a difficult and MUCH more dangerous job in the Army too, was 18 years old, didn't make 5000+ a month, didn't get to go home when I wanted to....etc Yet I never complained about it, because I volunteered to put my life on the line in defense of my nation and of people I have never met here and abroad.... Far too many Law Enforcement departments around the country have this \"feel sorry for me\" mentality...lol, you don't like it quit, if you don't quit do your damn job, and do it right like a man is suppose to do it.. Sorry, I have an Airborne mind set", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 14:23:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by 101MPRAT: \"Ok I am by far no expert on this stuff\" Well I agree with you. and your point? fact is the tactics are changed because they saw the exact same thing I did, of course way before I did. There is no argument to that fact.", 
        "intTime": 20090418, 
        "postID": 31, 
        "quote": "Originally posted by 101MPRAT: \"Ok I am by far no expert on this stuff\" Well I agree with you.", 
        "reply": " and your point? fact is the tactics are changed because they saw the exact same thing I did, of course way before I did. There is no argument to that fact.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 14:28:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by scooter_mech: quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well. I had a difficult and MUCH more dangerous job in the Army too, was 18 years old, didn't make 5000+ a month, didn't get to go home when I wanted to....etc Yet I never complained about it, because I volunteered to put my life on the line in defense of my nation and of people I have never met here and abroad.... Far too many Law Enforcement departments around the country have this \"feel sorry for me\" mentality...lol, you don't like it quit, if you don't quit do your damn job, and do it right like a man is suppose to do it.. Sorry, I have an Airborne mind set Sounds like a damn good one too Irwin. Not sure how old you are but you should join a force. I could sleep well at night knowing there are professionals on the street that would indeed do their job. Please don't taser anyone out of line, it really is unprofessional and shows a total lack of confidence to handle a situation...IMHO. Course some won't like my opinion, but hey it's a free message board and we all have them. Thanks for your service.", 
        "intTime": 20090418, 
        "postID": 32, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by scooter_mech: quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well. I had a difficult and MUCH more dangerous job in the Army too, was 18 years old, didn't make 5000+ a month, didn't get to go home when I wanted to....etc Yet I never complained about it, because I volunteered to put my life on the line in defense of my nation and of people I have never met here and abroad.... Far too many Law Enforcement departments around the country have this \"feel sorry for me\" mentality...lol, you don't like it quit, if you don't quit do your damn job, and do it right like a man is suppose to do it.. Sorry, I have an Airborne mind set", 
        "reply": " Sounds like a damn good one too Irwin. Not sure how old you are but you should join a force. I could sleep well at night knowing there are professionals on the street that would indeed do their job. Please don't taser anyone out of line, it really is unprofessional and shows a total lack of confidence to handle a situation...IMHO. Course some won't like my opinion, but hey it's a free message board and we all have them. Thanks for your service.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 14:33:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. Your not saying to outlaw guns are you? This stuff has been going on since time began. The best way, is to let people defend themselves. Not many would go on a shooting rampage knowing they may not even get 1 shot off before they are dead. Inocent people are not being allowed to defend themselves because of stupid rules, regulations and laws that mean nothing to the criminals or the criminaly insane or some one that is just ****ed off at the world and wants to make a last stand show before they out themselves. No offense Crackerjack, but what is it about the words, \"Only an armed population can possibly do so.\" I noticed you picked up on this sentence in a follow through post... Dave", 
        "intTime": 20090418, 
        "postID": 33, 
        "quote": "Originally posted by crackerjacks61: quote: I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. Your not saying to outlaw guns are you? This stuff has been going on since time began. The best way, is to let people defend themselves. Not many would go on a shooting rampage knowing they may not even get 1 shot off before they are dead. Inocent people are not being allowed to defend themselves because of stupid rules, regulations and laws that mean nothing to the criminals or the criminaly insane or some one that is just ****ed off at the world and wants to make a last stand show before they out themselves.", 
        "reply": " No offense Crackerjack, but what is it about the words, \"Only an armed population can possibly do so.\" I noticed you picked up on this sentence in a follow through post... Dave", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 14:56:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by scooter_mech: quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well. I had a difficult and MUCH more dangerous job in the Army too, was 18 years old, didn't make 5000+ a month, didn't get to go home when I wanted to....etc Yet I never complained about it, because I volunteered to put my life on the line in defense of my nation and of people I have never met here and abroad.... Far too many Law Enforcement departments around the country have this \"feel sorry for me\" mentality...lol, you don't like it quit, if you don't quit do your damn job, and do it right like a man is suppose to do it.. Sorry, I have an Airborne mind set Sounds like a damn good one too Irwin. Not sure how old you are but you should join a force. I could sleep well at night knowing there are professionals on the street that would indeed do their job. Please don't taser anyone out of line, it really is unprofessional and shows a total lack of confidence to handle a situation...IMHO. Course some won't like my opinion, but hey it's a free message board and we all have them. Thanks for your service. I'm 24 and currently in college. I have plans to hopefully work for an agency in virgina Me a cop? Wouldn't work....I would become more cynical than I am now. I would eventually get relieved of my duties for having a \"rogue\" attitude i'm sure", 
        "intTime": 20090418, 
        "postID": 34, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by scooter_mech: quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well. I had a difficult and MUCH more dangerous job in the Army too, was 18 years old, didn't make 5000+ a month, didn't get to go home when I wanted to....etc Yet I never complained about it, because I volunteered to put my life on the line in defense of my nation and of people I have never met here and abroad.... Far too many Law Enforcement departments around the country have this \"feel sorry for me\" mentality...lol, you don't like it quit, if you don't quit do your damn job, and do it right like a man is suppose to do it.. Sorry, I have an Airborne mind set Sounds like a damn good one too Irwin. Not sure how old you are but you should join a force. I could sleep well at night knowing there are professionals on the street that would indeed do their job. Please don't taser anyone out of line, it really is unprofessional and shows a total lack of confidence to handle a situation...IMHO. Course some won't like my opinion, but hey it's a free message board and we all have them. Thanks for your service.", 
        "reply": " I'm 24 and currently in college. I have plans to hopefully work for an agency in virgina Me a cop? Wouldn't work....I would become more cynical than I am now. I would eventually get relieved of my duties for having a \"rogue\" attitude i'm sure", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 15:05:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by crackerjacks61: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by scooter_mech: quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well. I had a difficult and MUCH more dangerous job in the Army too, was 18 years old, didn't make 5000+ a month, didn't get to go home when I wanted to....etc Yet I never complained about it, because I volunteered to put my life on the line in defense of my nation and of people I have never met here and abroad.... Far too many Law Enforcement departments around the country have this \"feel sorry for me\" mentality...lol, you don't like it quit, if you don't quit do your damn job, and do it right like a man is suppose to do it.. Sorry, I have an Airborne mind set Sounds like a damn good one too Irwin. Not sure how old you are but you should join a force. I could sleep well at night knowing there are professionals on the street that would indeed do their job. Please don't taser anyone out of line, it really is unprofessional and shows a total lack of confidence to handle a situation...IMHO. Course some won't like my opinion, but hey it's a free message board and we all have them. Thanks for your service. I'm 24 and currently in college. I have plans to hopefully work for an agency in virgina Me a cop? Wouldn't work....I would become more cynical than I am now. I would eventually get relieved of my duties for having a \"rogue\" attitude i'm sure Nothing wrong with a rogue that has a good head on his shoulders and is disciplined and you are. But \"political correct\" your not, even the right wing does not like that as you can tell from this board. The very ones that says that hate PC. lots of luck in the political correct world..also this is what they call \"business since\" at work aka kissing the bosses butt...my bust. We need to go back to the old days when a man did his job, did it damn well, and everyone else stayed the hell out of it including the bosses which in todays world means micro-manage to death.", 
        "intTime": 20090418, 
        "postID": 35, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by crackerjacks61: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by scooter_mech: quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Yes, I watched the Columbine tradgedy unfold live on television and questioned the tactics the police employed. Still, to smear dedicated law enforcment officers accross the country is simply wrong. They have a difficult and dangerous job and the vast majority of the time do it very well. I had a difficult and MUCH more dangerous job in the Army too, was 18 years old, didn't make 5000+ a month, didn't get to go home when I wanted to....etc Yet I never complained about it, because I volunteered to put my life on the line in defense of my nation and of people I have never met here and abroad.... Far too many Law Enforcement departments around the country have this \"feel sorry for me\" mentality...lol, you don't like it quit, if you don't quit do your damn job, and do it right like a man is suppose to do it.. Sorry, I have an Airborne mind set Sounds like a damn good one too Irwin. Not sure how old you are but you should join a force. I could sleep well at night knowing there are professionals on the street that would indeed do their job. Please don't taser anyone out of line, it really is unprofessional and shows a total lack of confidence to handle a situation...IMHO. Course some won't like my opinion, but hey it's a free message board and we all have them. Thanks for your service. I'm 24 and currently in college. I have plans to hopefully work for an agency in virgina Me a cop? Wouldn't work....I would become more cynical than I am now. I would eventually get relieved of my duties for having a \"rogue\" attitude i'm sure", 
        "reply": " Nothing wrong with a rogue that has a good head on his shoulders and is disciplined and you are. But \"political correct\" your not, even the right wing does not like that as you can tell from this board. The very ones that says that hate PC. lots of luck in the political correct world..also this is what they call \"business since\" at work aka kissing the bosses butt...my bust. We need to go back to the old days when a man did his job, did it damn well, and everyone else stayed the hell out of it including the bosses which in todays world means micro-manage to death.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-18 15:26:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: You know what Irwin_R_Schyster? I can handle that answer much better than the BS that was tossed at me. Thanks man. I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave Can I make the assumption that, if such occurrences don't make sense to police, who are trained to deal with them, they'd make even less to an 'armed population'? One of the salient pictures, in my mind, is the police evacuating students. The students have their hands on their heads in the classic prisoner posture and the police have their weapons at ready. You telling me some members of an 'armed population' might not have been adding to the list of dead and wounded? Panic is a wonderful thing, even when you're trained, imagine it when you're not. You are right about one thing however, Dave, that once some elements of that 'armed population' got started, it wouldn't stop until the clips were empty. The most recent book on Columbine points out that the killers failed in their objective of creating mass casualties. Perhaps part of that was the hope that the police would overreact and kill the wrong people. The bottom line is that the explosives used were abject failures. Diebold and his friend might have failed completely if they hadn't been able to acquire weapons, and an ample supply of ammunition (at the last minute).", 
        "intTime": 20090419, 
        "postID": 36, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: You know what Irwin_R_Schyster? I can handle that answer much better than the BS that was tossed at me. Thanks man. I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave", 
        "reply": " Can I make the assumption that, if such occurrences don't make sense to police, who are trained to deal with them, they'd make even less to an 'armed population'? One of the salient pictures, in my mind, is the police evacuating students. The students have their hands on their heads in the classic prisoner posture and the police have their weapons at ready. You telling me some members of an 'armed population' might not have been adding to the list of dead and wounded? Panic is a wonderful thing, even when you're trained, imagine it when you're not. You are right about one thing however, Dave, that once some elements of that 'armed population' got started, it wouldn't stop until the clips were empty. The most recent book on Columbine points out that the killers failed in their objective of creating mass casualties. Perhaps part of that was the hope that the police would overreact and kill the wrong people. The bottom line is that the explosives used were abject failures. Diebold and his friend might have failed completely if they hadn't been able to acquire weapons, and an ample supply of ammunition (at the last minute).", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-19 17:30:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by Grachus: I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave quote: Originally posted by popsiq: Can I make the assumption that, if such occurrences don't make sense to police, who are trained to deal with them, they'd make even less to an 'armed population'? Absolutely right Popsig. If I was sitting in a room and some guy came in shooting, it would make no damn sense to me. quote: Originally posted by popsiq: One of the salient pictures, in my mind, is the police evacuating students. The students have their hands on their heads in the classic prisoner posture and the police have their weapons at ready. You telling me some members of an 'armed population' might not have been adding to the list of dead and wounded? Panic is a wonderful thing, even when you're trained, imagine it when you're not. You are right about one thing however, Dave, that once some elements of that 'armed population' got started, it wouldn't stop until the clips were empty. The most recent book on Columbine points out that the killers failed in their objective of creating mass casualties. Perhaps part of that was the hope that the police would overreact and kill the wrong people. (snip) I am always curious about the argument that if there were a lot of armed people the carnage would be worse. In fact, there have been quite a few cases of these would be killers getting blown away BEFORE they could notch up a big kill, and I can't recall innocent people getting killed in truckload batches. In fact, such stories are just plain NOT news worthy... I was trained to use a gun, and WOULD use a gun, if I could legally carry one. And if by chance I DID shoot one innocent person - What is that compared to stopping the deaths of ten or twenty other people? Look - What evidence can you bring to bear about paniced people shooting everyone in sight? How often does this happen? You DO realise that in parts of the US people DO carry arms? That if your logic was correct, we would be reading about these kinds of stories every day? \"Man kills twelve when he heard a car backfire.\" \"Now says, he's really, really sorry about that.\" Dave", 
        "intTime": 20090419, 
        "postID": 37, 
        "quote": "Originally posted by Grachus: I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave", 
        "reply": " quote: Originally posted by popsiq: Can I make the assumption that, if such occurrences don't make sense to police, who are trained to deal with them, they'd make even less to an 'armed population'? Absolutely right Popsig. If I was sitting in a room and some guy came in shooting, it would make no damn sense to me. quote: Originally posted by popsiq: One of the salient pictures, in my mind, is the police evacuating students. The students have their hands on their heads in the classic prisoner posture and the police have their weapons at ready. You telling me some members of an 'armed population' might not have been adding to the list of dead and wounded? Panic is a wonderful thing, even when you're trained, imagine it when you're not. You are right about one thing however, Dave, that once some elements of that 'armed population' got started, it wouldn't stop until the clips were empty. The most recent book on Columbine points out that the killers failed in their objective of creating mass casualties. Perhaps part of that was the hope that the police would overreact and kill the wrong people. (snip) I am always curious about the argument that if there were a lot of armed people the carnage would be worse. In fact, there have been quite a few cases of these would be killers getting blown away BEFORE they could notch up a big kill, and I can't recall innocent people getting killed in truckload batches. In fact, such stories are just plain NOT news worthy... I was trained to use a gun, and WOULD use a gun, if I could legally carry one. And if by chance I DID shoot one innocent person - What is that compared to stopping the deaths of ten or twenty other people? Look - What evidence can you bring to bear about paniced people shooting everyone in sight? How often does this happen? You DO realise that in parts of the US people DO carry arms? That if your logic was correct, we would be reading about these kinds of stories every day? \"Man kills twelve when he heard a car backfire.\" \"Now says, he's really, really sorry about that.\" Dave", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-19 17:53:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Grachus: I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave quote: Originally posted by popsiq: Can I make the assumption that, if such occurrences don't make sense to police, who are trained to deal with them, they'd make even less to an 'armed population'? Absolutely right Popsig. If I was sitting in a room and some guy came in shooting, it would make no damn sense to me. quote: Originally posted by popsiq: One of the salient pictures, in my mind, is the police evacuating students. The students have their hands on their heads in the classic prisoner posture and the police have their weapons at ready. You telling me some members of an 'armed population' might not have been adding to the list of dead and wounded? Panic is a wonderful thing, even when you're trained, imagine it when you're not. You are right about one thing however, Dave, that once some elements of that 'armed population' got started, it wouldn't stop until the clips were empty. The most recent book on Columbine points out that the killers failed in their objective of creating mass casualties. Perhaps part of that was the hope that the police would overreact and kill the wrong people. (snip) I am always curious about the argument that if there were a lot of armed people the carnage would be worse. In fact, there have been quite a few cases of these would be killers getting blown away BEFORE they could notch up a big kill, and I can't recall innocent people getting killed in truckload batches. In fact, such stories are just plain NOT news worthy... I was trained to use a gun, and WOULD use a gun, if I could legally carry one. And if by chance I DID shoot one innocent person - What is that compared to stopping the deaths of ten or twenty other people? Look - What evidence can you bring to bear about paniced people shooting everyone in sight? How often does this happen? You DO realise that in parts of the US people DO carry arms? That if your logic was correct, we would be reading about these kinds of stories every day? \"Man kills twelve when he heard a car backfire.\" \"Now says, he's really, really sorry about that.\" Dave Can you recall MyLai? And those men were trained. But they told the court they were in fear for their lives, or acting under strong emotion when that 'busload' of innocents got killed. I dare say the Capone mob would have said the same thing about gunning down Bug Moran's mob in that garage. And Wounded Knee was a panicked response to a perceived threat. Such stuff does happen Dave. Duck hunting should demonstrate that for you. Strikes me that there are shooting stories across America almost every day - another family shootin' and suicide in our papers to-day. How much 'panic' is involved? I don't know, but assuming that the occurrences that do happen are all 'cold blooded', it stands to reason that 'excitement' of any kind wouldn't be an improvement.", 
        "intTime": 20090419, 
        "postID": 38, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Grachus: I dunno Crackerjack - The police have proved over and over again their willingness to risk their lives. Part of the problem is that these crimes make no sense. You me, whomever can at least figure out the \"motive\" of a normal crime, a bank robbery, a husband and wife drama, etc, etc. The situation might be crazy, but at least it \"makes sense.\" You mention Binghamton, but the killing was over in a few minutes - And it WAS reported as a hostage situation - which it turned out not to be. In 95 percent of \"normal\" cases the police win. How can they win in these situations? Shoot the bad guy after he's dead? Arrive in two seconds? I approve of future planning but even future planning assumes a motive and far more importantly a means to end these things. There is NO MEANS for the police to stop these kinds of crimes once they get started. Only an armed population can possibly do so. Dave quote: Originally posted by popsiq: Can I make the assumption that, if such occurrences don't make sense to police, who are trained to deal with them, they'd make even less to an 'armed population'? Absolutely right Popsig. If I was sitting in a room and some guy came in shooting, it would make no damn sense to me. quote: Originally posted by popsiq: One of the salient pictures, in my mind, is the police evacuating students. The students have their hands on their heads in the classic prisoner posture and the police have their weapons at ready. You telling me some members of an 'armed population' might not have been adding to the list of dead and wounded? Panic is a wonderful thing, even when you're trained, imagine it when you're not. You are right about one thing however, Dave, that once some elements of that 'armed population' got started, it wouldn't stop until the clips were empty. The most recent book on Columbine points out that the killers failed in their objective of creating mass casualties. Perhaps part of that was the hope that the police would overreact and kill the wrong people. (snip) I am always curious about the argument that if there were a lot of armed people the carnage would be worse. In fact, there have been quite a few cases of these would be killers getting blown away BEFORE they could notch up a big kill, and I can't recall innocent people getting killed in truckload batches. In fact, such stories are just plain NOT news worthy... I was trained to use a gun, and WOULD use a gun, if I could legally carry one. And if by chance I DID shoot one innocent person - What is that compared to stopping the deaths of ten or twenty other people? Look - What evidence can you bring to bear about paniced people shooting everyone in sight? How often does this happen? You DO realise that in parts of the US people DO carry arms? That if your logic was correct, we would be reading about these kinds of stories every day? \"Man kills twelve when he heard a car backfire.\" \"Now says, he's really, really sorry about that.\" Dave", 
        "reply": " Can you recall MyLai? And those men were trained. But they told the court they were in fear for their lives, or acting under strong emotion when that 'busload' of innocents got killed. I dare say the Capone mob would have said the same thing about gunning down Bug Moran's mob in that garage. And Wounded Knee was a panicked response to a perceived threat. Such stuff does happen Dave. Duck hunting should demonstrate that for you. Strikes me that there are shooting stories across America almost every day - another family shootin' and suicide in our papers to-day. How much 'panic' is involved? I don't know, but assuming that the occurrences that do happen are all 'cold blooded', it stands to reason that 'excitement' of any kind wouldn't be an improvement.", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-19 18:32:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Can you recall MyLai? And those men were trained. But they told the court they were in fear for their lives, or acting under strong emotion when that 'busload' of innocents got killed. I dare say the Capone mob would have said the same thing about gunning down Bug Moran's mob in that garage. And Wounded Knee was a panicked response to a perceived threat. Such stuff does happen Dave. Duck hunting should demonstrate that for you. Strikes me that there are shooting stories across America almost every day - another family shootin' and suicide in our papers to-day. How much 'panic' is involved? I don't know, but assuming that the occurrences that do happen are all 'cold blooded', it stands to reason that 'excitement' of any kind wouldn't be an improvement. I thought you were a serious poster. I am beginning to change my mind about this. Your post above needs absolutely no answer. It refutes itself. Dave", 
        "intTime": 20090419, 
        "postID": 39, 
        "quote": "Originally posted by popsiq: Can you recall MyLai? And those men were trained. But they told the court they were in fear for their lives, or acting under strong emotion when that 'busload' of innocents got killed. I dare say the Capone mob would have said the same thing about gunning down Bug Moran's mob in that garage. And Wounded Knee was a panicked response to a perceived threat. Such stuff does happen Dave. Duck hunting should demonstrate that for you. Strikes me that there are shooting stories across America almost every day - another family shootin' and suicide in our papers to-day. How much 'panic' is involved? I don't know, but assuming that the occurrences that do happen are all 'cold blooded', it stands to reason that 'excitement' of any kind wouldn't be an improvement.", 
        "reply": " I thought you were a serious poster. I am beginning to change my mind about this. Your post above needs absolutely no answer. It refutes itself. Dave", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-19 18:40:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy... Your post simply explains itself... Respectfully, SUNLINER81", 
        "intTime": 20090419, 
        "postID": 40, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Why is it it when shots have already been fired the SWAT team does not storm the building, what is the purpose of just standing outside pointing a gun at a building? Well you have to remember that for the most part, Law Enforcement in the US is a collection of individuals who feel sorry for themselves for volunteering for a dangerous job. Their unions cry day and night about how dangerous it is, how they get no protection, blah blah blah.... Its not like the Military where you grab those objects between your legs and move forward and secure innocents while killing the enemy...", 
        "reply": " Your post simply explains itself... Respectfully, SUNLINER81", 
        "threadID": "672198221_1470021122001", 
        "time": "2009-04-19 19:33:00", 
        "title": "Shoot first: Columbine transformed police tactics", 
        "userID": "SUNLINER81"
    }
]