[
    {
        "content": "\"http://blogs.abcnews.com/politicalpunch/2009/05/todays-announce.html \"http://www.reason.com/news/show/131279.html Another OBAMA sword stuck in the heart of the auto industry and our economy! Thanks alot dems!", 
        "intTime": 20090519, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://blogs.abcnews.com/politicalpunch/2009/05/todays-announce.html \"http://www.reason.com/news/show/131279.html Another OBAMA sword stuck in the heart of the auto industry and our economy! Thanks alot dems!", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 08:45:00", 
        "title": "Stick it to em!", 
        "userID": "EAG154"
    }, 
    {
        "content": "I saw on the news this morning on GMA that the gas price is on its way up again! Don't you want to be out from another country holding our lives in their hands? I do. I want the auto industry to be more competitive and get the old gas beast out and bring in more hybrid. It is time to make that move and it has to be at a better price point. The auto industry says their hands are tied because of the unions. Do you think that is true? Not just to pick on the auto industry, on the news last night, Fox I think, they were talking about California and how we are broke and because of the high taxes people were wanting to move out of the state and set up business across its boarders and California would really crash if that happens. But an official in San Jose said here is an example of what we face, we are a small community and we have to pay 3 police forces. One who is working and two that are retired. How did that happen? We retire too young? Pepole live longer? Do we have to adjust?", 
        "intTime": 20090519, 
        "postID": 2, 
        "quote": "", 
        "reply": "I saw on the news this morning on GMA that the gas price is on its way up again! Don't you want to be out from another country holding our lives in their hands? I do. I want the auto industry to be more competitive and get the old gas beast out and bring in more hybrid. It is time to make that move and it has to be at a better price point. The auto industry says their hands are tied because of the unions. Do you think that is true? Not just to pick on the auto industry, on the news last night, Fox I think, they were talking about California and how we are broke and because of the high taxes people were wanting to move out of the state and set up business across its boarders and California would really crash if that happens. But an official in San Jose said here is an example of what we face, we are a small community and we have to pay 3 police forces. One who is working and two that are retired. How did that happen? We retire too young? Pepole live longer? Do we have to adjust?", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 08:52:00", 
        "title": "Stick it to em!", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: The auto industry says their hands are tied because of the unions. Do you think that is true? YES !!! We have some shi(f)t to suffer. Texas. Heard on the radio yesterday that they made more new jobs in 2008 than the sum total of all the other 49 States. Texas is also on record as telling the feds, \"Go away, we don't want any of your help---bailout money. We'll do better by ourselves.\" FoMoCo, too! \"Fug those gov bailout programs. We'll fix ourself by self, by Gawdah! Lookeesee those GM fuggers (GMC)---Government Motor Company. Yes, and i drive a big ol' 4000#(+) Cadillic, which gets 33-39 mpg (USMC Seal) Highway. Coming soon in my rear window, a little 23k gold and scarlet sign advertising the fact---2 redwood boards, left and right of the USMC Seal sticker. I ain't gonna sacrice my back or family driving around in a puddle jumper.", 
        "intTime": 20090519, 
        "postID": 3, 
        "quote": "The auto industry says their hands are tied because of the unions. Do you think that is true?", 
        "reply": " YES !!! We have some shi(f)t to suffer. Texas. Heard on the radio yesterday that they made more new jobs in 2008 than the sum total of all the other 49 States. Texas is also on record as telling the feds, \"Go away, we don't want any of your help---bailout money. We'll do better by ourselves.\" FoMoCo, too! \"Fug those gov bailout programs. We'll fix ourself by self, by Gawdah! Lookeesee those GM fuggers (GMC)---Government Motor Company. Yes, and i drive a big ol' 4000#(+) Cadillic, which gets 33-39 mpg (USMC Seal) Highway. Coming soon in my rear window, a little 23k gold and scarlet sign advertising the fact---2 redwood boards, left and right of the USMC Seal sticker. I ain't gonna sacrice my back or family driving around in a puddle jumper.", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 09:40:00", 
        "title": "Stick it to em!", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: I saw on the news this morning on GMA that the gas price is on its way up again! Don't you want to be out from another country holding our lives in their hands? I do. I want the auto industry to be more competitive and get the old gas beast out and bring in more hybrid. It is time to make that move and it has to be at a better price point. The auto industry says their hands are tied because of the unions. Do you think that is true? Not just to pick on the auto industry, on the news last night, Fox I think, they were talking about California and how we are broke and because of the high taxes people were wanting to move out of the state and set up business across its boarders and California would really crash if that happens. But an official in San Jose said here is an example of what we face, we are a small community and we have to pay 3 police forces. One who is working and two that are retired. How did that happen? We retire too young? Pepole live longer? Do we have to adjust? most local and state governments are buckling under massive retirement costs!", 
        "intTime": 20090519, 
        "postID": 4, 
        "quote": "Originally posted by usa_girl: I saw on the news this morning on GMA that the gas price is on its way up again! Don't you want to be out from another country holding our lives in their hands? I do. I want the auto industry to be more competitive and get the old gas beast out and bring in more hybrid. It is time to make that move and it has to be at a better price point. The auto industry says their hands are tied because of the unions. Do you think that is true? Not just to pick on the auto industry, on the news last night, Fox I think, they were talking about California and how we are broke and because of the high taxes people were wanting to move out of the state and set up business across its boarders and California would really crash if that happens. But an official in San Jose said here is an example of what we face, we are a small community and we have to pay 3 police forces. One who is working and two that are retired. How did that happen? We retire too young? Pepole live longer? Do we have to adjust?", 
        "reply": " most local and state governments are buckling under massive retirement costs!", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 14:14:00", 
        "title": "Stick it to em!", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: \"http://blogs.abcnews.com/politicalpunch/2009/05/todays-announce.html \"http://www.reason.com/news/show/131279.html Another OBAMA sword stuck in the heart of the auto industry and our economy! Thanks alot dems! Uh Pardon Me Eag, but you failed to mention this is a W / Rep plan from the beginning... \"2007, Congress passed and President George Bush signed legislation aimed at increasing Corporate Average Fuel Economy (CAFE) standards to at least 35 miles per gallon (mpg) by 2020, up from 27.5 today. \" You also conveniently failed to mention that the savings in gas would off set the price of the car. Which, BTW, why in the world would the price of the car even have to go up? Unless your adding new components and not taking any components away? I think that cost raise is BS with The Oil Companies lobbyist finger prints all over it. \"But CAFE proponents argue that there is a bright side—the higher costs for the gas-sipping cars will be offset by lower gas bills. For example, a car driven 12,500 miles per year at 27.5 mpg would use 454 gallons of gas annually. Raising the mileage to 35 mpg reduces that figure to 357 gallons per year. So the new California standards would save drivers an average of 100 gallons per year. At $1.50 per gallon that comes to $150 per year; at $4 per gallon it comes to $400.\" Something needs to give and this is a good start. I am glad President Of The United States Barack Obama is leading the way on energy efficiency. Taking over from where W left off on this one, good job POTUS! Read the entire article folks, the heading and the comment to follow is somewhat biased.", 
        "intTime": 20090519, 
        "postID": 5, 
        "quote": "Originally posted by EAG154: \"http://blogs.abcnews.com/politicalpunch/2009/05/todays-announce.html \"http://www.reason.com/news/show/131279.html Another OBAMA sword stuck in the heart of the auto industry and our economy! Thanks alot dems!", 
        "reply": " Uh Pardon Me Eag, but you failed to mention this is a W / Rep plan from the beginning... \"2007, Congress passed and President George Bush signed legislation aimed at increasing Corporate Average Fuel Economy (CAFE) standards to at least 35 miles per gallon (mpg) by 2020, up from 27.5 today. \" You also conveniently failed to mention that the savings in gas would off set the price of the car. Which, BTW, why in the world would the price of the car even have to go up? Unless your adding new components and not taking any components away? I think that cost raise is BS with The Oil Companies lobbyist finger prints all over it. \"But CAFE proponents argue that there is a bright side—the higher costs for the gas-sipping cars will be offset by lower gas bills. For example, a car driven 12,500 miles per year at 27.5 mpg would use 454 gallons of gas annually. Raising the mileage to 35 mpg reduces that figure to 357 gallons per year. So the new California standards would save drivers an average of 100 gallons per year. At $1.50 per gallon that comes to $150 per year; at $4 per gallon it comes to $400.\" Something needs to give and this is a good start. I am glad President Of The United States Barack Obama is leading the way on energy efficiency. Taking over from where W left off on this one, good job POTUS! Read the entire article folks, the heading and the comment to follow is somewhat biased.", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 16:14:00", 
        "title": "Stick it to em!", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: You also conveniently failed to mention that the savings in gas would off set the price of the car. Which, BTW, why in the world would the price of the car even have to go up? Unless your adding new components and not taking any components away? I think that cost raise is BS with The Oil Companies lobbyist finger prints all over it. Baloney. The price of the car will go up to make up for the losses in carbon taxes. Who in here thinks that the government managing anything is going to save us money. Last time i looked, for every dollar that goes to the fed, We The People get back about 50 cents. What is it today, under puppet Obama's regime? Don't misunderstand me, Bush was bad enough. Obama is the next step worse. Heck, and I thought Clinton was evil.", 
        "intTime": 20090519, 
        "postID": 6, 
        "quote": "You also conveniently failed to mention that the savings in gas would off set the price of the car. Which, BTW, why in the world would the price of the car even have to go up? Unless your adding new components and not taking any components away? I think that cost raise is BS with The Oil Companies lobbyist finger prints all over it.", 
        "reply": " Baloney. The price of the car will go up to make up for the losses in carbon taxes. Who in here thinks that the government managing anything is going to save us money. Last time i looked, for every dollar that goes to the fed, We The People get back about 50 cents. What is it today, under puppet Obama's regime? Don't misunderstand me, Bush was bad enough. Obama is the next step worse. Heck, and I thought Clinton was evil.", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 17:24:00", 
        "title": "Stick it to em!", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by EAG154: \"http://blogs.abcnews.com/politicalpunch/2009/05/todays-announce.html \"http://www.reason.com/news/show/131279.html Another OBAMA sword stuck in the heart of the auto industry and our economy! Thanks alot dems! Uh Pardon Me Eag, but you failed to mention this is a W / Rep plan from the beginning... \"2007, Congress passed and President George Bush signed legislation aimed at increasing Corporate Average Fuel Economy (CAFE) standards to at least 35 miles per gallon (mpg) by 2020, up from 27.5 today. \" You also conveniently failed to mention that the savings in gas would off set the price of the car. Which, BTW, why in the world would the price of the car even have to go up? Unless your adding new components and not taking any components away? I think that cost raise is BS with The Oil Companies lobbyist finger prints all over it. \"But CAFE proponents argue that there is a bright side—the higher costs for the gas-sipping cars will be offset by lower gas bills. For example, a car driven 12,500 miles per year at 27.5 mpg would use 454 gallons of gas annually. Raising the mileage to 35 mpg reduces that figure to 357 gallons per year. So the new California standards would save drivers an average of 100 gallons per year. At $1.50 per gallon that comes to $150 per year; at $4 per gallon it comes to $400.\" Something needs to give and this is a good start. I am glad President Of The United States Barack Obama is leading the way on energy efficiency. Taking over from where W left off on this one, good job POTUS! Read the entire article folks, the heading and the comment to follow is somewhat biased. so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!!", 
        "intTime": 20090519, 
        "postID": 7, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by EAG154: \"http://blogs.abcnews.com/politicalpunch/2009/05/todays-announce.html \"http://www.reason.com/news/show/131279.html Another OBAMA sword stuck in the heart of the auto industry and our economy! Thanks alot dems! Uh Pardon Me Eag, but you failed to mention this is a W / Rep plan from the beginning... \"2007, Congress passed and President George Bush signed legislation aimed at increasing Corporate Average Fuel Economy (CAFE) standards to at least 35 miles per gallon (mpg) by 2020, up from 27.5 today. \" You also conveniently failed to mention that the savings in gas would off set the price of the car. Which, BTW, why in the world would the price of the car even have to go up? Unless your adding new components and not taking any components away? I think that cost raise is BS with The Oil Companies lobbyist finger prints all over it. \"But CAFE proponents argue that there is a bright side—the higher costs for the gas-sipping cars will be offset by lower gas bills. For example, a car driven 12,500 miles per year at 27.5 mpg would use 454 gallons of gas annually. Raising the mileage to 35 mpg reduces that figure to 357 gallons per year. So the new California standards would save drivers an average of 100 gallons per year. At $1.50 per gallon that comes to $150 per year; at $4 per gallon it comes to $400.\" Something needs to give and this is a good start. I am glad President Of The United States Barack Obama is leading the way on energy efficiency. Taking over from where W left off on this one, good job POTUS! Read the entire article folks, the heading and the comment to follow is somewhat biased.", 
        "reply": " so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!!", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 17:41:00", 
        "title": "Stick it to em!", 
        "userID": "EAG154"
    }, 
    {
        "content": "Gee whiz. Since the 60s gas only costs 8 times as much. How much has everything else gone up since those days? Housing? Without the oil companies, you characters would be still driving around in horse drawn carriages on filthy pooped streets. break, break You Obama-Bush-McCain-Clinton (et al) mo-fuggers keep it up ..soon you'll see me converting to wood: In the early 70s i used to sell firewood, cut, split and delivered for $50.00 per chord. This year i bought 7 chords for $125 per. It's a good investment. At only about 2 1/2 times older day prices it costs next to nothing per year to heat my home and shop---2 chords per year, plus a few \"free\" 2x4 planer ends. You Obama chumps... ..then the carbon tax. This message has been edited. Last edited by: SemperSignsdotcom, Tue 19 May 2009 07:08 PM", 
        "intTime": 20090519, 
        "postID": 8, 
        "quote": "", 
        "reply": "Gee whiz. Since the 60s gas only costs 8 times as much. How much has everything else gone up since those days? Housing? Without the oil companies, you characters would be still driving around in horse drawn carriages on filthy pooped streets. break, break You Obama-Bush-McCain-Clinton (et al) mo-fuggers keep it up ..soon you'll see me converting to wood: In the early 70s i used to sell firewood, cut, split and delivered for $50.00 per chord. This year i bought 7 chords for $125 per. It's a good investment. At only about 2 1/2 times older day prices it costs next to nothing per year to heat my home and shop---2 chords per year, plus a few \"free\" 2x4 planer ends. You Obama chumps... ..then the carbon tax. This message has been edited. Last edited by: SemperSignsdotcom, Tue 19 May 2009 07:08 PM", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 18:11:00", 
        "title": "Stick it to em!", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "quote: Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!! I think the idea is to become completely independant of big oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc....", 
        "intTime": 20090519, 
        "postID": 9, 
        "quote": "Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!!", 
        "reply": " I think the idea is to become completely independant of big oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc....", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 18:17:00", 
        "title": "Stick it to em!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc.... You nailed it. All the reasons I just drive a few miles per year, mostly to the store to pickup beer ..then back home to nature and my \"Hodge\".", 
        "intTime": 20090519, 
        "postID": 10, 
        "quote": "Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc....", 
        "reply": " You nailed it. All the reasons I just drive a few miles per year, mostly to the store to pickup beer ..then back home to nature and my \"Hodge\".", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 18:24:00", 
        "title": "Stick it to em!", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "I love the suggestion of a gas tax in the middle of a recession... along with and other inevitable tax raises... They tell us to sacrifice while they are living large.", 
        "intTime": 20090519, 
        "postID": 11, 
        "quote": "", 
        "reply": "I love the suggestion of a gas tax in the middle of a recession... along with and other inevitable tax raises... They tell us to sacrifice while they are living large.", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 18:40:00", 
        "title": "Stick it to em!", 
        "userID": "ReconTeam"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!! I think the idea is to become completely independant of big oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc.... sounds like the gestapo", 
        "intTime": 20090520, 
        "postID": 12, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!! I think the idea is to become completely independant of big oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc....", 
        "reply": " sounds like the gestapo", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-20 08:33:00", 
        "title": "Stick it to em!", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!! I think the idea is to become completely independant of big oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc.... Another major difference is that most other countries pay for most of the cost of the transportation infrastructure using the fuel tax, road use taxes, etc. while in the USA a VERY large % of this cost is paid for from the GENERAL tax fund. Paying for the infrastructure using use taxes make the cost a LOT clearer to voters. IMO we should switch over to paying for the transportation infrastructure (roads, etc) with fuel and other use taxes and the money should ONLY be used for that purpose.", 
        "intTime": 20090520, 
        "postID": 13, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!! I think the idea is to become completely independant of big oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc....", 
        "reply": " Another major difference is that most other countries pay for most of the cost of the transportation infrastructure using the fuel tax, road use taxes, etc. while in the USA a VERY large % of this cost is paid for from the GENERAL tax fund. Paying for the infrastructure using use taxes make the cost a LOT clearer to voters. IMO we should switch over to paying for the transportation infrastructure (roads, etc) with fuel and other use taxes and the money should ONLY be used for that purpose.", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-20 10:19:00", 
        "title": "Stick it to em!", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!! I think the idea is to become completely independant of big oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc.... sounds like the gestapo [IMG]\"http://michaelgr.files.wordpress.com/2009/02/adolf-hitler-photo.jpg\"[/IMG] People usually bring up Hilter and the Nazis' because they don't have a logical arguement to support their position and/or bias.", 
        "intTime": 20090520, 
        "postID": 14, 
        "quote": "Originally posted by EAG154: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!! I think the idea is to become completely independant of big oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc.... sounds like the gestapo [IMG]\"http://michaelgr.files.wordpress.com/2009/02/adolf-hitler-photo.jpg\"[/IMG]", 
        "reply": " People usually bring up Hilter and the Nazis' because they don't have a logical arguement to support their position and/or bias.", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-20 10:22:00", 
        "title": "Stick it to em!", 
        "userID": "rayld2"
    }, 
    {
        "content": "one way to lower gas prices is to tell the EPA and the eco-freaks to GTH and have only one or two blends of gasoline country wide. As it is, just in Califorina for example, they have a myriad of blends depending on which county you are in... no wonder the cost is so high. The manufacturers have dozens of \"dinners\" to make instead of just one. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090520, 
        "postID": 15, 
        "quote": "", 
        "reply": "one way to lower gas prices is to tell the EPA and the eco-freaks to GTH and have only one or two blends of gasoline country wide. As it is, just in Califorina for example, they have a myriad of blends depending on which county you are in... no wonder the cost is so high. The manufacturers have dozens of \"dinners\" to make instead of just one. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-20 10:28:00", 
        "title": "Stick it to em!", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by EAG154: sounds like the gestapo No, it's most of Europe.", 
        "intTime": 20090520, 
        "postID": 16, 
        "quote": "Originally posted by EAG154: sounds like the gestapo", 
        "reply": " No, it's most of Europe.", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-20 13:01:00", 
        "title": "Stick it to em!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by rayld2: People usually bring up Hilter and the Nazis' because they don't have a logical arguement to support their position and/or bias. Yea. If you drive a compact car, you're a communist.", 
        "intTime": 20090520, 
        "postID": 17, 
        "quote": "Originally posted by rayld2: People usually bring up Hilter and the Nazis' because they don't have a logical arguement to support their position and/or bias.", 
        "reply": " Yea. If you drive a compact car, you're a communist.", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-20 13:02:00", 
        "title": "Stick it to em!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by rayld2: People usually bring up Hilter and the Nazis' because they don't have a logical arguement to support their position and/or bias. Yea. If you drive a compact car, you're a communist. Heck for years I had to drive a compact car they had more headroom than the most American midsize cars did so I could actually drive them", 
        "intTime": 20090520, 
        "postID": 18, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by rayld2: People usually bring up Hilter and the Nazis' because they don't have a logical arguement to support their position and/or bias. Yea. If you drive a compact car, you're a communist.", 
        "reply": " Heck for years I had to drive a compact car they had more headroom than the most American midsize cars did so I could actually drive them", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-20 13:23:00", 
        "title": "Stick it to em!", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!! I think the idea is to become completely independant of big oil. I'd like to start with becoming energy indepemdent from oil imports. Yes, that means recover our own oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Most have their populations and commerce packed closer together than we do. Shoot. We still haven't even touched on: -Mandatory car pooling. OK unless you have a job that requires mobility. A lot of people have to drive around during the day to do their jobs. -Fuel ration cards. Why? This WWII again? How will that work? Given the commuting distances of some folks (me included) how will rationing work? The government going to dictate where I live? More mass transportation? Good idea until the lawsuites from imminent domain and environmental causes start. Plus given we are so far in debt now no one has the money for it. -Stricter state emissions standards. I thought the stricter federal standards was to alleviate a patchwork of state regulations. It does costs money to configure cars differently for different states. -Vehicle weight limits (this lessens the wear on public roads)Cars have little impact on this. Truck traffic cause most of it. To lessen truck gross weights means more trucks on the road. etc, etc, etc, etc....", 
        "intTime": 20090520, 
        "postID": 19, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!! I think the idea is to become completely independant of big oil. I'd like to start with becoming energy indepemdent from oil imports. Yes, that means recover our own oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Most have their populations and commerce packed closer together than we do. Shoot. We still haven't even touched on: -Mandatory car pooling. OK unless you have a job that requires mobility. A lot of people have to drive around during the day to do their jobs. -Fuel ration cards. Why? This WWII again? How will that work? Given the commuting distances of some folks (me included) how will rationing work? The government going to dictate where I live? More mass transportation? Good idea until the lawsuites from imminent domain and environmental causes start. Plus given we are so far in debt now no one has the money for it. -Stricter state emissions standards. I thought the stricter federal standards was to alleviate a patchwork of state regulations. It does costs money to configure cars differently for different states. -Vehicle weight limits (this lessens the wear on public roads)Cars have little impact on this. Truck traffic cause most of it. To lessen truck gross weights means more trucks on the road. etc, etc, etc, etc....", 
        "reply": "", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-20 13:53:00", 
        "title": "Stick it to em!", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by mrmixitup: quote: Originally posted by rayld2: People usually bring up Hilter and the Nazis' because they don't have a logical arguement to support their position and/or bias. Yea. If you drive a compact car, you're a communist. Heck for years I had to drive a compact car they had more headroom than the most American midsize cars did so I could actually drive them Tried a compact car for a couple of years (2002 Sentra), but after each commute my back hurt because of seat size, travel of seat adjustment, etc. Great at pump, though. Now drive an Accord which was a decent compromise; 29-30 MPG commuting in DC area traffic and is comfortable.", 
        "intTime": 20090520, 
        "postID": 20, 
        "quote": "Originally posted by rayld2: quote: Originally posted by mrmixitup: quote: Originally posted by rayld2: People usually bring up Hilter and the Nazis' because they don't have a logical arguement to support their position and/or bias. Yea. If you drive a compact car, you're a communist. Heck for years I had to drive a compact car they had more headroom than the most American midsize cars did so I could actually drive them", 
        "reply": " Tried a compact car for a couple of years (2002 Sentra), but after each commute my back hurt because of seat size, travel of seat adjustment, etc. Great at pump, though. Now drive an Accord which was a decent compromise; 29-30 MPG commuting in DC area traffic and is comfortable.", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-20 13:55:00", 
        "title": "Stick it to em!", 
        "userID": "sw614"
    }, 
    {
        "content": "\"http://blogs.abcnews.com/politicalpunch/2009/05/todays-announce.html \"http://www.reason.com/news/show/131279.html Another OBAMA sword stuck in the heart of the auto industry and our economy! Thanks alot dems!", 
        "intTime": 20090519, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"http://blogs.abcnews.com/politicalpunch/2009/05/todays-announce.html \"http://www.reason.com/news/show/131279.html Another OBAMA sword stuck in the heart of the auto industry and our economy! Thanks alot dems!", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 08:45:00", 
        "title": "Stick it to em!", 
        "userID": "EAG154"
    }, 
    {
        "content": "I saw on the news this morning on GMA that the gas price is on its way up again! Don't you want to be out from another country holding our lives in their hands? I do. I want the auto industry to be more competitive and get the old gas beast out and bring in more hybrid. It is time to make that move and it has to be at a better price point. The auto industry says their hands are tied because of the unions. Do you think that is true? Not just to pick on the auto industry, on the news last night, Fox I think, they were talking about California and how we are broke and because of the high taxes people were wanting to move out of the state and set up business across its boarders and California would really crash if that happens. But an official in San Jose said here is an example of what we face, we are a small community and we have to pay 3 police forces. One who is working and two that are retired. How did that happen? We retire too young? Pepole live longer? Do we have to adjust?", 
        "intTime": 20090519, 
        "postID": 22, 
        "quote": "", 
        "reply": "I saw on the news this morning on GMA that the gas price is on its way up again! Don't you want to be out from another country holding our lives in their hands? I do. I want the auto industry to be more competitive and get the old gas beast out and bring in more hybrid. It is time to make that move and it has to be at a better price point. The auto industry says their hands are tied because of the unions. Do you think that is true? Not just to pick on the auto industry, on the news last night, Fox I think, they were talking about California and how we are broke and because of the high taxes people were wanting to move out of the state and set up business across its boarders and California would really crash if that happens. But an official in San Jose said here is an example of what we face, we are a small community and we have to pay 3 police forces. One who is working and two that are retired. How did that happen? We retire too young? Pepole live longer? Do we have to adjust?", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 08:52:00", 
        "title": "Stick it to em!", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: The auto industry says their hands are tied because of the unions. Do you think that is true? YES !!! We have some shi(f)t to suffer. Texas. Heard on the radio yesterday that they made more new jobs in 2008 than the sum total of all the other 49 States. Texas is also on record as telling the feds, \"Go away, we don't want any of your help---bailout money. We'll do better by ourselves.\" FoMoCo, too! \"Fug those gov bailout programs. We'll fix ourself by self, by Gawdah! Lookeesee those GM fuggers (GMC)---Government Motor Company. Yes, and i drive a big ol' 4000#(+) Cadillic, which gets 33-39 mpg (USMC Seal) Highway. Coming soon in my rear window, a little 23k gold and scarlet sign advertising the fact---2 redwood boards, left and right of the USMC Seal sticker. I ain't gonna sacrice my back or family driving around in a puddle jumper.", 
        "intTime": 20090519, 
        "postID": 23, 
        "quote": "The auto industry says their hands are tied because of the unions. Do you think that is true?", 
        "reply": " YES !!! We have some shi(f)t to suffer. Texas. Heard on the radio yesterday that they made more new jobs in 2008 than the sum total of all the other 49 States. Texas is also on record as telling the feds, \"Go away, we don't want any of your help---bailout money. We'll do better by ourselves.\" FoMoCo, too! \"Fug those gov bailout programs. We'll fix ourself by self, by Gawdah! Lookeesee those GM fuggers (GMC)---Government Motor Company. Yes, and i drive a big ol' 4000#(+) Cadillic, which gets 33-39 mpg (USMC Seal) Highway. Coming soon in my rear window, a little 23k gold and scarlet sign advertising the fact---2 redwood boards, left and right of the USMC Seal sticker. I ain't gonna sacrice my back or family driving around in a puddle jumper.", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 09:40:00", 
        "title": "Stick it to em!", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: I saw on the news this morning on GMA that the gas price is on its way up again! Don't you want to be out from another country holding our lives in their hands? I do. I want the auto industry to be more competitive and get the old gas beast out and bring in more hybrid. It is time to make that move and it has to be at a better price point. The auto industry says their hands are tied because of the unions. Do you think that is true? Not just to pick on the auto industry, on the news last night, Fox I think, they were talking about California and how we are broke and because of the high taxes people were wanting to move out of the state and set up business across its boarders and California would really crash if that happens. But an official in San Jose said here is an example of what we face, we are a small community and we have to pay 3 police forces. One who is working and two that are retired. How did that happen? We retire too young? Pepole live longer? Do we have to adjust? most local and state governments are buckling under massive retirement costs!", 
        "intTime": 20090519, 
        "postID": 24, 
        "quote": "Originally posted by usa_girl: I saw on the news this morning on GMA that the gas price is on its way up again! Don't you want to be out from another country holding our lives in their hands? I do. I want the auto industry to be more competitive and get the old gas beast out and bring in more hybrid. It is time to make that move and it has to be at a better price point. The auto industry says their hands are tied because of the unions. Do you think that is true? Not just to pick on the auto industry, on the news last night, Fox I think, they were talking about California and how we are broke and because of the high taxes people were wanting to move out of the state and set up business across its boarders and California would really crash if that happens. But an official in San Jose said here is an example of what we face, we are a small community and we have to pay 3 police forces. One who is working and two that are retired. How did that happen? We retire too young? Pepole live longer? Do we have to adjust?", 
        "reply": " most local and state governments are buckling under massive retirement costs!", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 14:14:00", 
        "title": "Stick it to em!", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: \"http://blogs.abcnews.com/politicalpunch/2009/05/todays-announce.html \"http://www.reason.com/news/show/131279.html Another OBAMA sword stuck in the heart of the auto industry and our economy! Thanks alot dems! Uh Pardon Me Eag, but you failed to mention this is a W / Rep plan from the beginning... \"2007, Congress passed and President George Bush signed legislation aimed at increasing Corporate Average Fuel Economy (CAFE) standards to at least 35 miles per gallon (mpg) by 2020, up from 27.5 today. \" You also conveniently failed to mention that the savings in gas would off set the price of the car. Which, BTW, why in the world would the price of the car even have to go up? Unless your adding new components and not taking any components away? I think that cost raise is BS with The Oil Companies lobbyist finger prints all over it. \"But CAFE proponents argue that there is a bright side—the higher costs for the gas-sipping cars will be offset by lower gas bills. For example, a car driven 12,500 miles per year at 27.5 mpg would use 454 gallons of gas annually. Raising the mileage to 35 mpg reduces that figure to 357 gallons per year. So the new California standards would save drivers an average of 100 gallons per year. At $1.50 per gallon that comes to $150 per year; at $4 per gallon it comes to $400.\" Something needs to give and this is a good start. I am glad President Of The United States Barack Obama is leading the way on energy efficiency. Taking over from where W left off on this one, good job POTUS! Read the entire article folks, the heading and the comment to follow is somewhat biased.", 
        "intTime": 20090519, 
        "postID": 25, 
        "quote": "Originally posted by EAG154: \"http://blogs.abcnews.com/politicalpunch/2009/05/todays-announce.html \"http://www.reason.com/news/show/131279.html Another OBAMA sword stuck in the heart of the auto industry and our economy! Thanks alot dems!", 
        "reply": " Uh Pardon Me Eag, but you failed to mention this is a W / Rep plan from the beginning... \"2007, Congress passed and President George Bush signed legislation aimed at increasing Corporate Average Fuel Economy (CAFE) standards to at least 35 miles per gallon (mpg) by 2020, up from 27.5 today. \" You also conveniently failed to mention that the savings in gas would off set the price of the car. Which, BTW, why in the world would the price of the car even have to go up? Unless your adding new components and not taking any components away? I think that cost raise is BS with The Oil Companies lobbyist finger prints all over it. \"But CAFE proponents argue that there is a bright side—the higher costs for the gas-sipping cars will be offset by lower gas bills. For example, a car driven 12,500 miles per year at 27.5 mpg would use 454 gallons of gas annually. Raising the mileage to 35 mpg reduces that figure to 357 gallons per year. So the new California standards would save drivers an average of 100 gallons per year. At $1.50 per gallon that comes to $150 per year; at $4 per gallon it comes to $400.\" Something needs to give and this is a good start. I am glad President Of The United States Barack Obama is leading the way on energy efficiency. Taking over from where W left off on this one, good job POTUS! Read the entire article folks, the heading and the comment to follow is somewhat biased.", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 16:14:00", 
        "title": "Stick it to em!", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: You also conveniently failed to mention that the savings in gas would off set the price of the car. Which, BTW, why in the world would the price of the car even have to go up? Unless your adding new components and not taking any components away? I think that cost raise is BS with The Oil Companies lobbyist finger prints all over it. Baloney. The price of the car will go up to make up for the losses in carbon taxes. Who in here thinks that the government managing anything is going to save us money. Last time i looked, for every dollar that goes to the fed, We The People get back about 50 cents. What is it today, under puppet Obama's regime? Don't misunderstand me, Bush was bad enough. Obama is the next step worse. Heck, and I thought Clinton was evil.", 
        "intTime": 20090519, 
        "postID": 26, 
        "quote": "You also conveniently failed to mention that the savings in gas would off set the price of the car. Which, BTW, why in the world would the price of the car even have to go up? Unless your adding new components and not taking any components away? I think that cost raise is BS with The Oil Companies lobbyist finger prints all over it.", 
        "reply": " Baloney. The price of the car will go up to make up for the losses in carbon taxes. Who in here thinks that the government managing anything is going to save us money. Last time i looked, for every dollar that goes to the fed, We The People get back about 50 cents. What is it today, under puppet Obama's regime? Don't misunderstand me, Bush was bad enough. Obama is the next step worse. Heck, and I thought Clinton was evil.", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 17:24:00", 
        "title": "Stick it to em!", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by EAG154: \"http://blogs.abcnews.com/politicalpunch/2009/05/todays-announce.html \"http://www.reason.com/news/show/131279.html Another OBAMA sword stuck in the heart of the auto industry and our economy! Thanks alot dems! Uh Pardon Me Eag, but you failed to mention this is a W / Rep plan from the beginning... \"2007, Congress passed and President George Bush signed legislation aimed at increasing Corporate Average Fuel Economy (CAFE) standards to at least 35 miles per gallon (mpg) by 2020, up from 27.5 today. \" You also conveniently failed to mention that the savings in gas would off set the price of the car. Which, BTW, why in the world would the price of the car even have to go up? Unless your adding new components and not taking any components away? I think that cost raise is BS with The Oil Companies lobbyist finger prints all over it. \"But CAFE proponents argue that there is a bright side—the higher costs for the gas-sipping cars will be offset by lower gas bills. For example, a car driven 12,500 miles per year at 27.5 mpg would use 454 gallons of gas annually. Raising the mileage to 35 mpg reduces that figure to 357 gallons per year. So the new California standards would save drivers an average of 100 gallons per year. At $1.50 per gallon that comes to $150 per year; at $4 per gallon it comes to $400.\" Something needs to give and this is a good start. I am glad President Of The United States Barack Obama is leading the way on energy efficiency. Taking over from where W left off on this one, good job POTUS! Read the entire article folks, the heading and the comment to follow is somewhat biased. so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!!", 
        "intTime": 20090519, 
        "postID": 27, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by EAG154: \"http://blogs.abcnews.com/politicalpunch/2009/05/todays-announce.html \"http://www.reason.com/news/show/131279.html Another OBAMA sword stuck in the heart of the auto industry and our economy! Thanks alot dems! Uh Pardon Me Eag, but you failed to mention this is a W / Rep plan from the beginning... \"2007, Congress passed and President George Bush signed legislation aimed at increasing Corporate Average Fuel Economy (CAFE) standards to at least 35 miles per gallon (mpg) by 2020, up from 27.5 today. \" You also conveniently failed to mention that the savings in gas would off set the price of the car. Which, BTW, why in the world would the price of the car even have to go up? Unless your adding new components and not taking any components away? I think that cost raise is BS with The Oil Companies lobbyist finger prints all over it. \"But CAFE proponents argue that there is a bright side—the higher costs for the gas-sipping cars will be offset by lower gas bills. For example, a car driven 12,500 miles per year at 27.5 mpg would use 454 gallons of gas annually. Raising the mileage to 35 mpg reduces that figure to 357 gallons per year. So the new California standards would save drivers an average of 100 gallons per year. At $1.50 per gallon that comes to $150 per year; at $4 per gallon it comes to $400.\" Something needs to give and this is a good start. I am glad President Of The United States Barack Obama is leading the way on energy efficiency. Taking over from where W left off on this one, good job POTUS! Read the entire article folks, the heading and the comment to follow is somewhat biased.", 
        "reply": " so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!!", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 17:41:00", 
        "title": "Stick it to em!", 
        "userID": "EAG154"
    }, 
    {
        "content": "Gee whiz. Since the 60s gas only costs 8 times as much. How much has everything else gone up since those days? Housing? Without the oil companies, you characters would be still driving around in horse drawn carriages on filthy pooped streets. break, break You Obama-Bush-McCain-Clinton (et al) mo-fuggers keep it up ..soon you'll see me converting to wood: In the early 70s i used to sell firewood, cut, split and delivered for $50.00 per chord. This year i bought 7 chords for $125 per. It's a good investment. At only about 2 1/2 times older day prices it costs next to nothing per year to heat my home and shop---2 chords per year, plus a few \"free\" 2x4 planer ends. You Obama chumps... ..then the carbon tax. This message has been edited. Last edited by: SemperSignsdotcom, Tue 19 May 2009 07:08 PM", 
        "intTime": 20090519, 
        "postID": 28, 
        "quote": "", 
        "reply": "Gee whiz. Since the 60s gas only costs 8 times as much. How much has everything else gone up since those days? Housing? Without the oil companies, you characters would be still driving around in horse drawn carriages on filthy pooped streets. break, break You Obama-Bush-McCain-Clinton (et al) mo-fuggers keep it up ..soon you'll see me converting to wood: In the early 70s i used to sell firewood, cut, split and delivered for $50.00 per chord. This year i bought 7 chords for $125 per. It's a good investment. At only about 2 1/2 times older day prices it costs next to nothing per year to heat my home and shop---2 chords per year, plus a few \"free\" 2x4 planer ends. You Obama chumps... ..then the carbon tax. This message has been edited. Last edited by: SemperSignsdotcom, Tue 19 May 2009 07:08 PM", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 18:11:00", 
        "title": "Stick it to em!", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "quote: Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!! I think the idea is to become completely independant of big oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc....", 
        "intTime": 20090519, 
        "postID": 29, 
        "quote": "Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!!", 
        "reply": " I think the idea is to become completely independant of big oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc....", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 18:17:00", 
        "title": "Stick it to em!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc.... You nailed it. All the reasons I just drive a few miles per year, mostly to the store to pickup beer ..then back home to nature and my \"Hodge\".", 
        "intTime": 20090519, 
        "postID": 30, 
        "quote": "Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc....", 
        "reply": " You nailed it. All the reasons I just drive a few miles per year, mostly to the store to pickup beer ..then back home to nature and my \"Hodge\".", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 18:24:00", 
        "title": "Stick it to em!", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "I love the suggestion of a gas tax in the middle of a recession... along with and other inevitable tax raises... They tell us to sacrifice while they are living large.", 
        "intTime": 20090519, 
        "postID": 31, 
        "quote": "", 
        "reply": "I love the suggestion of a gas tax in the middle of a recession... along with and other inevitable tax raises... They tell us to sacrifice while they are living large.", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-19 18:40:00", 
        "title": "Stick it to em!", 
        "userID": "ReconTeam"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!! I think the idea is to become completely independant of big oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc.... sounds like the gestapo", 
        "intTime": 20090520, 
        "postID": 32, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!! I think the idea is to become completely independant of big oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc....", 
        "reply": " sounds like the gestapo", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-20 08:33:00", 
        "title": "Stick it to em!", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!! I think the idea is to become completely independant of big oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc.... Another major difference is that most other countries pay for most of the cost of the transportation infrastructure using the fuel tax, road use taxes, etc. while in the USA a VERY large % of this cost is paid for from the GENERAL tax fund. Paying for the infrastructure using use taxes make the cost a LOT clearer to voters. IMO we should switch over to paying for the transportation infrastructure (roads, etc) with fuel and other use taxes and the money should ONLY be used for that purpose.", 
        "intTime": 20090520, 
        "postID": 33, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!! I think the idea is to become completely independant of big oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc....", 
        "reply": " Another major difference is that most other countries pay for most of the cost of the transportation infrastructure using the fuel tax, road use taxes, etc. while in the USA a VERY large % of this cost is paid for from the GENERAL tax fund. Paying for the infrastructure using use taxes make the cost a LOT clearer to voters. IMO we should switch over to paying for the transportation infrastructure (roads, etc) with fuel and other use taxes and the money should ONLY be used for that purpose.", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-20 10:19:00", 
        "title": "Stick it to em!", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!! I think the idea is to become completely independant of big oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc.... sounds like the gestapo [IMG]\"http://michaelgr.files.wordpress.com/2009/02/adolf-hitler-photo.jpg\"[/IMG] People usually bring up Hilter and the Nazis' because they don't have a logical arguement to support their position and/or bias.", 
        "intTime": 20090520, 
        "postID": 34, 
        "quote": "Originally posted by EAG154: quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!! I think the idea is to become completely independant of big oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Shoot. We still haven't even touched on: -Mandatory car pooling. -Fuel ration cards. -Stricter state emissions standards. -Vehicle weight limits (this lessens the wear on public roads) etc, etc, etc, etc.... sounds like the gestapo [IMG]\"http://michaelgr.files.wordpress.com/2009/02/adolf-hitler-photo.jpg\"[/IMG]", 
        "reply": " People usually bring up Hilter and the Nazis' because they don't have a logical arguement to support their position and/or bias.", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-20 10:22:00", 
        "title": "Stick it to em!", 
        "userID": "rayld2"
    }, 
    {
        "content": "one way to lower gas prices is to tell the EPA and the eco-freaks to GTH and have only one or two blends of gasoline country wide. As it is, just in Califorina for example, they have a myriad of blends depending on which county you are in... no wonder the cost is so high. The manufacturers have dozens of \"dinners\" to make instead of just one. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090520, 
        "postID": 35, 
        "quote": "", 
        "reply": "one way to lower gas prices is to tell the EPA and the eco-freaks to GTH and have only one or two blends of gasoline country wide. As it is, just in Califorina for example, they have a myriad of blends depending on which county you are in... no wonder the cost is so high. The manufacturers have dozens of \"dinners\" to make instead of just one. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-20 10:28:00", 
        "title": "Stick it to em!", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by EAG154: sounds like the gestapo No, it's most of Europe.", 
        "intTime": 20090520, 
        "postID": 36, 
        "quote": "Originally posted by EAG154: sounds like the gestapo", 
        "reply": " No, it's most of Europe.", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-20 13:01:00", 
        "title": "Stick it to em!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by rayld2: People usually bring up Hilter and the Nazis' because they don't have a logical arguement to support their position and/or bias. Yea. If you drive a compact car, you're a communist.", 
        "intTime": 20090520, 
        "postID": 37, 
        "quote": "Originally posted by rayld2: People usually bring up Hilter and the Nazis' because they don't have a logical arguement to support their position and/or bias.", 
        "reply": " Yea. If you drive a compact car, you're a communist.", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-20 13:02:00", 
        "title": "Stick it to em!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by rayld2: People usually bring up Hilter and the Nazis' because they don't have a logical arguement to support their position and/or bias. Yea. If you drive a compact car, you're a communist. Heck for years I had to drive a compact car they had more headroom than the most American midsize cars did so I could actually drive them", 
        "intTime": 20090520, 
        "postID": 38, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by rayld2: People usually bring up Hilter and the Nazis' because they don't have a logical arguement to support their position and/or bias. Yea. If you drive a compact car, you're a communist.", 
        "reply": " Heck for years I had to drive a compact car they had more headroom than the most American midsize cars did so I could actually drive them", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-20 13:23:00", 
        "title": "Stick it to em!", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!! I think the idea is to become completely independant of big oil. I'd like to start with becoming energy indepemdent from oil imports. Yes, that means recover our own oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Most have their populations and commerce packed closer together than we do. Shoot. We still haven't even touched on: -Mandatory car pooling. OK unless you have a job that requires mobility. A lot of people have to drive around during the day to do their jobs. -Fuel ration cards. Why? This WWII again? How will that work? Given the commuting distances of some folks (me included) how will rationing work? The government going to dictate where I live? More mass transportation? Good idea until the lawsuites from imminent domain and environmental causes start. Plus given we are so far in debt now no one has the money for it. -Stricter state emissions standards. I thought the stricter federal standards was to alleviate a patchwork of state regulations. It does costs money to configure cars differently for different states. -Vehicle weight limits (this lessens the wear on public roads)Cars have little impact on this. Truck traffic cause most of it. To lessen truck gross weights means more trucks on the road. etc, etc, etc, etc....", 
        "intTime": 20090520, 
        "postID": 39, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by EAG154: so sorry no saveings in fuel costs, to maintain their profits the oil companys will raise the price of gas when the autos become more fuel effient... guarenteed... GUARENTEED!!!! I think the idea is to become completely independant of big oil. I'd like to start with becoming energy indepemdent from oil imports. Yes, that means recover our own oil. I think it's a great idea. Every other developed country in the world has had tighter restrictions on emissions and mileage than we have had. Most have their populations and commerce packed closer together than we do. Shoot. We still haven't even touched on: -Mandatory car pooling. OK unless you have a job that requires mobility. A lot of people have to drive around during the day to do their jobs. -Fuel ration cards. Why? This WWII again? How will that work? Given the commuting distances of some folks (me included) how will rationing work? The government going to dictate where I live? More mass transportation? Good idea until the lawsuites from imminent domain and environmental causes start. Plus given we are so far in debt now no one has the money for it. -Stricter state emissions standards. I thought the stricter federal standards was to alleviate a patchwork of state regulations. It does costs money to configure cars differently for different states. -Vehicle weight limits (this lessens the wear on public roads)Cars have little impact on this. Truck traffic cause most of it. To lessen truck gross weights means more trucks on the road. etc, etc, etc, etc....", 
        "reply": "", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-20 13:53:00", 
        "title": "Stick it to em!", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by mrmixitup: quote: Originally posted by rayld2: People usually bring up Hilter and the Nazis' because they don't have a logical arguement to support their position and/or bias. Yea. If you drive a compact car, you're a communist. Heck for years I had to drive a compact car they had more headroom than the most American midsize cars did so I could actually drive them Tried a compact car for a couple of years (2002 Sentra), but after each commute my back hurt because of seat size, travel of seat adjustment, etc. Great at pump, though. Now drive an Accord which was a decent compromise; 29-30 MPG commuting in DC area traffic and is comfortable.", 
        "intTime": 20090520, 
        "postID": 40, 
        "quote": "Originally posted by rayld2: quote: Originally posted by mrmixitup: quote: Originally posted by rayld2: People usually bring up Hilter and the Nazis' because they don't have a logical arguement to support their position and/or bias. Yea. If you drive a compact car, you're a communist. Heck for years I had to drive a compact car they had more headroom than the most American midsize cars did so I could actually drive them", 
        "reply": " Tried a compact car for a couple of years (2002 Sentra), but after each commute my back hurt because of seat size, travel of seat adjustment, etc. Great at pump, though. Now drive an Accord which was a decent compromise; 29-30 MPG commuting in DC area traffic and is comfortable.", 
        "threadID": "672198221_1850056322001", 
        "time": "2009-05-20 13:55:00", 
        "title": "Stick it to em!", 
        "userID": "sw614"
    }
]