[
    {
        "content": "Excerpt: quote: FEEDING: Despite danger, friends say he's just an independent Alaskan. By MARY PEMBERTON The Associated Press Charlie Vandergaw is crazy about bears. That's obvious in a documentary made last year by a British filmmaker at Vandergaw's remote Alaska cabin and featured in the recent Animal Planet series \"Stranger Among Bears.\" The videos show him scratching the belly of one black bear as if it were the family dog, feeding a cookie to a large black bear sitting under a tree, and feeding dog kibble to a cub from his outstretched hand. Vandergaw has been coexisting with bears this way for the last 20 years, and he wants to be left alone. That is not likely to happen now that the state is using a beefed-up law to prosecute Vandergaw for feeding bears. Game officials consider feeding bears a danger to humans, especially if others duplicate the behavior. Not everyone thinks the state needs to be going after a 70-year-old retired teacher and wrestling coach. Even if Vandergaw ends up being killed by the bears he loves, that's the Alaska way, said John Frost, who has been friends with Vandergaw for years. He recalled that when he came to Alaska in 1973 he saw a T-shirt that said \"Alaska land of the individual and other endangered species.\" Story continued at: (*http://www.adn.com/vandergaw/story/806485.html*)", 
        "intTime": 20090524, 
        "postID": 1, 
        "quote": "FEEDING: Despite danger, friends say he's just an independent Alaskan. By MARY PEMBERTON The Associated Press Charlie Vandergaw is crazy about bears. That's obvious in a documentary made last year by a British filmmaker at Vandergaw's remote Alaska cabin and featured in the recent Animal Planet series \"Stranger Among Bears.\" The videos show him scratching the belly of one black bear as if it were the family dog, feeding a cookie to a large black bear sitting under a tree, and feeding dog kibble to a cub from his outstretched hand. Vandergaw has been coexisting with bears this way for the last 20 years, and he wants to be left alone. That is not likely to happen now that the state is using a beefed-up law to prosecute Vandergaw for feeding bears. Game officials consider feeding bears a danger to humans, especially if others duplicate the behavior. Not everyone thinks the state needs to be going after a 70-year-old retired teacher and wrestling coach. Even if Vandergaw ends up being killed by the bears he loves, that's the Alaska way, said John Frost, who has been friends with Vandergaw for years. He recalled that when he came to Alaska in 1973 he saw a T-shirt that said \"Alaska land of the individual and other endangered species.\" Story continued at: (*http://www.adn.com/vandergaw/story/806485.html*)", 
        "reply": "Excerpt: ", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 10:59:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes.", 
        "intTime": 20090524, 
        "postID": 2, 
        "quote": "", 
        "reply": "Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 11:11:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes. \"Grizzly man\" was an idiot. He pushed his luck for too long. This guy has formed a relationship with these bears for over 20 years. He knows one day it might do him in but he is an Alaskan and he has more of a chance then the photographer. Alaskans like him are a different breed. He probably keeps the bears fed. They are unpredictable though. Bears can spook easily. Either way, he is doing nothing wrong. The Alaska Fish and Game are like Nazi's. They have been known to take a person's home, car and all their money, put them in jail for 10- 20 years, all because they shot a moose out of season. I believe a murderer would get more leniency than a poacher in this state.", 
        "intTime": 20090524, 
        "postID": 3, 
        "quote": "Originally posted by Agent991: Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes.", 
        "reply": " \"Grizzly man\" was an idiot. He pushed his luck for too long. This guy has formed a relationship with these bears for over 20 years. He knows one day it might do him in but he is an Alaskan and he has more of a chance then the photographer. Alaskans like him are a different breed. He probably keeps the bears fed. They are unpredictable though. Bears can spook easily. Either way, he is doing nothing wrong. The Alaska Fish and Game are like Nazi's. They have been known to take a person's home, car and all their money, put them in jail for 10- 20 years, all because they shot a moose out of season. I believe a murderer would get more leniency than a poacher in this state.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 11:32:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090524, 
        "postID": 4, 
        "quote": "", 
        "reply": "I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 11:32:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal.", 
        "intTime": 20090524, 
        "postID": 5, 
        "quote": "Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy.", 
        "reply": " I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 13:04:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Vanir97"
    }, 
    {
        "content": "quote: Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal. If these are Brown Bears and not Grizzlys, the danger is minimal. To my mind the relevant quesiton is where this guy lives. If he lives more or less in the wilderness - Who cares? If he lives in the suberbs, it's another story. Personally I throw rocks at deer and bears, for the simple reason that I don't want them to get blown away by a hunter. I would LOVE to be in the position of petting a wild animal, but I believe that's \"cruel\" if all it serves is to get them killed. I have one little muskrat friend in a marsh in Brooklyn, but they ain't got a hunting season... Unfortunately, I think a Heron ate him. Dave", 
        "intTime": 20090524, 
        "postID": 6, 
        "quote": "Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal.", 
        "reply": " If these are Brown Bears and not Grizzlys, the danger is minimal. To my mind the relevant quesiton is where this guy lives. If he lives more or less in the wilderness - Who cares? If he lives in the suberbs, it's another story. Personally I throw rocks at deer and bears, for the simple reason that I don't want them to get blown away by a hunter. I would LOVE to be in the position of petting a wild animal, but I believe that's \"cruel\" if all it serves is to get them killed. I have one little muskrat friend in a marsh in Brooklyn, but they ain't got a hunting season... Unfortunately, I think a Heron ate him. Dave", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 13:13:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal. The bears he interacts with are tens of miles from any human population source - almost literally, in the midst of 'nowhere'. There is very, very little chance of even ONE of those bears even being in contact with another human. If he was doing this from town, then, yes, I would completely agree with you. But this really is man and animal without human influence. These bears would have to travel over 40 miles to find a human (unless said human was camping). Regardless, he is living his dream. Who here can say the same thing? Certainly not me. Leave the man alone. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090524, 
        "postID": 7, 
        "quote": "Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal.", 
        "reply": " The bears he interacts with are tens of miles from any human population source - almost literally, in the midst of 'nowhere'. There is very, very little chance of even ONE of those bears even being in contact with another human. If he was doing this from town, then, yes, I would completely agree with you. But this really is man and animal without human influence. These bears would have to travel over 40 miles to find a human (unless said human was camping). Regardless, he is living his dream. Who here can say the same thing? Certainly not me. Leave the man alone. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 13:34:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: The bears he interacts with are tens of miles from any human population source - almost literally, in the midst of 'nowhere'. There is very, very little chance of even ONE of those bears even being in contact with another human. If he was doing this from town, then, yes, I would completely agree with you. But this really is man and animal without human influence. These bears would have to travel over 40 miles to find a human (unless said human was camping). Regardless, he is living his dream. Who here can say the same thing? Certainly not me. Leave the man alone. If such is the case, I agree a hundred percent. But that wont stop the people who want to do it \"for his own good.\" The world is full of people who live in nightmares, and whose main ambition is to stop someone else living Their dream. Dave", 
        "intTime": 20090524, 
        "postID": 8, 
        "quote": "Originally posted by FollowMeInfantry: The bears he interacts with are tens of miles from any human population source - almost literally, in the midst of 'nowhere'. There is very, very little chance of even ONE of those bears even being in contact with another human. If he was doing this from town, then, yes, I would completely agree with you. But this really is man and animal without human influence. These bears would have to travel over 40 miles to find a human (unless said human was camping). Regardless, he is living his dream. Who here can say the same thing? Certainly not me. Leave the man alone.", 
        "reply": " If such is the case, I agree a hundred percent. But that wont stop the people who want to do it \"for his own good.\" The world is full of people who live in nightmares, and whose main ambition is to stop someone else living Their dream. Dave", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 13:42:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal. That is an inaccurate statement. The Grizzly man was an idiot, like I have already said. He was a photographer...a yuppy if you will and had little knowledge of the reality of what Bears were all about. His ego got him and his girlfried killed. Vanderguard knows that it is possible to be killed by a bear and accepts that possibility. It is worth it to him. It is his choice. Bears generally do not attack humans unless it is a mother with a cub (the biggest threat) or when they are startled. The pesky little Black bear might cause you problems, but the brown and grizzlies do not attack unless you are dumb enough to leave food lying around your campsite or you try to use bear spray against them or wound them by trying to shoot them. That is why when you are camping here, you make lots of noise and if you are smart, you take some dogs with you. Bears smell a few dogs and they go the other way. Also, these bears Vanderguard has become freinds with are more likely to stay where they are. Where they have it made. If they did by chance wander more than 10 miles from their home, then they wouldn't feel threatened by humans because of their freindly interaction for the last 20 years, unless for the reasons stated above. The more you know...", 
        "intTime": 20090524, 
        "postID": 9, 
        "quote": "Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal.", 
        "reply": " That is an inaccurate statement. The Grizzly man was an idiot, like I have already said. He was a photographer...a yuppy if you will and had little knowledge of the reality of what Bears were all about. His ego got him and his girlfried killed. Vanderguard knows that it is possible to be killed by a bear and accepts that possibility. It is worth it to him. It is his choice. Bears generally do not attack humans unless it is a mother with a cub (the biggest threat) or when they are startled. The pesky little Black bear might cause you problems, but the brown and grizzlies do not attack unless you are dumb enough to leave food lying around your campsite or you try to use bear spray against them or wound them by trying to shoot them. That is why when you are camping here, you make lots of noise and if you are smart, you take some dogs with you. Bears smell a few dogs and they go the other way. Also, these bears Vanderguard has become freinds with are more likely to stay where they are. Where they have it made. If they did by chance wander more than 10 miles from their home, then they wouldn't feel threatened by humans because of their freindly interaction for the last 20 years, unless for the reasons stated above. The more you know...", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 16:04:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes. From my little reading of the AP story. \"Bears are notorious man killers\" ..um, \"notorious\"? Really. Where did you make this observation from, a skyscraper in NYC? The bears mentioned are black bears, which are quite a bit less dangerous because they are smaller. They are more shy than the Brown / Grizzly, which is the kind that \"ate up\" that character and his gee-friend. ******* quote: If such is the case, I agree a hundred percent. But that wont stop the people who want to do it \"for his own good.\" The world is full of people who live in nightmares, and whose main ambition is to stop someone else living Their dream. Dave Yes, you and Charles Lindbergh, fellow travelers: quote: The readiness to blame a dead pilot for an accident is nauseating, but it has been the tendency ever since I can remember. What pilot has not been in positions where he was in danger and where perfect judgment would have advised against going? But when a man is caught in such a position he is judged only by his error and seldom given credit for the times he has extricated himself from worse situations. Worst of all, blame is heaped upon him by other pilots, all of whom have been in parallel situations themselves, but without being caught in them. If one took no chances, one would not fly at all. Safety lies in the judgment of the chances one takes. That judgment, in turn, must rest upon one's outlook on life. Any coward can sit in his home and criticize a pilot for flying into a mountain in fog. But I would rather, by far, die on a mountainside than in bed. Why should we look for his errors when a brave man dies? Unless we can learn from his experience, there is no need to look for weakness. Rather, we should admire the courage and spirit in his life. What kind of man would live where there is no daring? And is life so dear that we should blame men for dying in adventure? Is there a better way to die? --Charles Lindbergh Have you ever read the Sioux Medicine Wheel story, \"Jumping Mouse\"? ==>http://www.angelfire.com/wa/redwoodsigns/jumping_mouse.html break, break In my little AO, it's don't feed the cougars ..they may get used to your place and drop by to eat your toddlers ..except in Cali, they go after full growns peddling bicycles. This message has been edited. Last edited by: SemperSignsdotcom, Sun 24 May 2009 05:16 PM", 
        "intTime": 20090524, 
        "postID": 10, 
        "quote": "Originally posted by Agent991: Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes.", 
        "reply": " From my little reading of the AP story. \"Bears are notorious man killers\" ..um, \"notorious\"? Really. Where did you make this observation from, a skyscraper in NYC? The bears mentioned are black bears, which are quite a bit less dangerous because they are smaller. They are more shy than the Brown / Grizzly, which is the kind that \"ate up\" that character and his gee-friend. ******* quote: If such is the case, I agree a hundred percent. But that wont stop the people who want to do it \"for his own good.\" The world is full of people who live in nightmares, and whose main ambition is to stop someone else living Their dream. Dave Yes, you and Charles Lindbergh, fellow travelers: quote: The readiness to blame a dead pilot for an accident is nauseating, but it has been the tendency ever since I can remember. What pilot has not been in positions where he was in danger and where perfect judgment would have advised against going? But when a man is caught in such a position he is judged only by his error and seldom given credit for the times he has extricated himself from worse situations. Worst of all, blame is heaped upon him by other pilots, all of whom have been in parallel situations themselves, but without being caught in them. If one took no chances, one would not fly at all. Safety lies in the judgment of the chances one takes. That judgment, in turn, must rest upon one's outlook on life. Any coward can sit in his home and criticize a pilot for flying into a mountain in fog. But I would rather, by far, die on a mountainside than in bed. Why should we look for his errors when a brave man dies? Unless we can learn from his experience, there is no need to look for weakness. Rather, we should admire the courage and spirit in his life. What kind of man would live where there is no daring? And is life so dear that we should blame men for dying in adventure? Is there a better way to die? --Charles Lindbergh Have you ever read the Sioux Medicine Wheel story, \"Jumping Mouse\"? ==>http://www.angelfire.com/wa/redwoodsigns/jumping_mouse.html break, break In my little AO, it's don't feed the cougars ..they may get used to your place and drop by to eat your toddlers ..except in Cali, they go after full growns peddling bicycles. This message has been edited. Last edited by: SemperSignsdotcom, Sun 24 May 2009 05:16 PM", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 16:58:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "quote: Originally posted by SemperSignsdotcom: quote: Originally posted by Agent991: Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes. From my little reading of the AP story. \"Bears are notorious man killers\" ..um, \"notorious\"? Really. Where did you make this observation from, a skyscraper in NYC? The bears mentioned are black bears, which are quite a bit less dangerous because they are smaller. They are more shy than the Brown / Grizzly, which is the kind that \"ate up\" that character and his gee-friend. ******* quote: If such is the case, I agree a hundred percent. But that wont stop the people who want to do it \"for his own good.\" The world is full of people who live in nightmares, and whose main ambition is to stop someone else living Their dream. Dave Yes, you and Charles Lindbergh, fellow travelers: quote: The readiness to blame a dead pilot for an accident is nauseating, but it has been the tendency ever since I can remember. What pilot has not been in positions where he was in danger and where perfect judgment would have advised against going? But when a man is caught in such a position he is judged only by his error and seldom given credit for the times he has extricated himself from worse situations. Worst of all, blame is heaped upon him by other pilots, all of whom have been in parallel situations themselves, but without being caught in them. If one took no chances, one would not fly at all. Safety lies in the judgment of the chances one takes. That judgment, in turn, must rest upon one's outlook on life. Any coward can sit in his home and criticize a pilot for flying into a mountain in fog. But I would rather, by far, die on a mountainside than in bed. Why should we look for his errors when a brave man dies? Unless we can learn from his experience, there is no need to look for weakness. Rather, we should admire the courage and spirit in his life. What kind of man would live where there is no daring? And is life so dear that we should blame men for dying in adventure? Is there a better way to die? --Charles Lindbergh break, break In my little AO, it's don't feed the cougars ..they may get used to your place and drop by to eat your toddlers ..except in Cali, they go after full growns peddling bicycles. Was this post to me? Is a Cougar a Brown/Black Bear? (In Alaska sometimes they call Grizzlys \"Brown Bears,\" but their not.) Aren't we talking about some guy living out in the wilderness, not California? You ever been in a wilderness? It's nice. Usually there's just no one around... Now I made a distinction between doing what this guy is doing in the suberbs, and doing what he's doing in an out and out wilderness. Capiche? (err, capiche, that's Italian for \"you understand?\") Dave", 
        "intTime": 20090524, 
        "postID": 11, 
        "quote": "Originally posted by SemperSignsdotcom: quote: Originally posted by Agent991: Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes. From my little reading of the AP story. \"Bears are notorious man killers\" ..um, \"notorious\"? Really. Where did you make this observation from, a skyscraper in NYC? The bears mentioned are black bears, which are quite a bit less dangerous because they are smaller. They are more shy than the Brown / Grizzly, which is the kind that \"ate up\" that character and his gee-friend. ******* quote: If such is the case, I agree a hundred percent. But that wont stop the people who want to do it \"for his own good.\" The world is full of people who live in nightmares, and whose main ambition is to stop someone else living Their dream. Dave Yes, you and Charles Lindbergh, fellow travelers: quote: The readiness to blame a dead pilot for an accident is nauseating, but it has been the tendency ever since I can remember. What pilot has not been in positions where he was in danger and where perfect judgment would have advised against going? But when a man is caught in such a position he is judged only by his error and seldom given credit for the times he has extricated himself from worse situations. Worst of all, blame is heaped upon him by other pilots, all of whom have been in parallel situations themselves, but without being caught in them. If one took no chances, one would not fly at all. Safety lies in the judgment of the chances one takes. That judgment, in turn, must rest upon one's outlook on life. Any coward can sit in his home and criticize a pilot for flying into a mountain in fog. But I would rather, by far, die on a mountainside than in bed. Why should we look for his errors when a brave man dies? Unless we can learn from his experience, there is no need to look for weakness. Rather, we should admire the courage and spirit in his life. What kind of man would live where there is no daring? And is life so dear that we should blame men for dying in adventure? Is there a better way to die? --Charles Lindbergh break, break In my little AO, it's don't feed the cougars ..they may get used to your place and drop by to eat your toddlers ..except in Cali, they go after full growns peddling bicycles.", 
        "reply": " Was this post to me? Is a Cougar a Brown/Black Bear? (In Alaska sometimes they call Grizzlys \"Brown Bears,\" but their not.) Aren't we talking about some guy living out in the wilderness, not California? You ever been in a wilderness? It's nice. Usually there's just no one around... Now I made a distinction between doing what this guy is doing in the suberbs, and doing what he's doing in an out and out wilderness. Capiche? (err, capiche, that's Italian for \"you understand?\") Dave", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 17:23:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Grachus"
    }, 
    {
        "content": "Grachus, yer too full of yourself ~ Funny shi(f)t. No, this post wasn't directed to you. As I remember, you're about third referred to. FYI, in Alaska, \"Grizzlies\" are always deferred to as Brown Bears. There are no Grizzlies in Alaska. However, they are almost, quite closely, the same species though. I like the wildeness, where I have spent a lot of time. Damn pilots. Every once in awhile a couple of jet jocks do a low level. Have you ever been peacefully sleeping on a high mountain ridge when a couple of jets do a flyby through the pass, about 200' off your toes? God bless you, --Raven", 
        "intTime": 20090524, 
        "postID": 12, 
        "quote": "", 
        "reply": "Grachus, yer too full of yourself ~ Funny shi(f)t. No, this post wasn't directed to you. As I remember, you're about third referred to. FYI, in Alaska, \"Grizzlies\" are always deferred to as Brown Bears. There are no Grizzlies in Alaska. However, they are almost, quite closely, the same species though. I like the wildeness, where I have spent a lot of time. Damn pilots. Every once in awhile a couple of jet jocks do a low level. Have you ever been peacefully sleeping on a high mountain ridge when a couple of jets do a flyby through the pass, about 200' off your toes? God bless you, --Raven", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 17:38:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "quote: Originally posted by SemperSignsdotcom: Grachus, yer too full of yourself ~ Funny shi(f)t. No, this post wasn't directed to you. As I remember, you're about third referred to. FYI, in Alaska, \"Grizzlies\" are always deferred to as Brown Bears. There are no Grizzlies in Alaska. However, they are almost, quite closely, the same species though. Yes, just checked this. Basically you're right, but Grizlys are actually a sub-species of Brown Bear, and have a different temperment. quote: Grizzlies can be distinguished from most other brown bear subspecies by their proportionately longer claws and cranial profile which resembles that of the polar bear.[6] Compared to other North American brown bear subspecies, a grizzly has a silver tipped pelt and is smaller in size. This size difference is due to the lesser availability of food in the grizzlies' landlocked habitats.[7] They are similar in size, colour and behaviour to the Siberian Brown Bear (Ursus arctos collaris).[8] Grizzlies are considered by some experts to be the most aggressive bears, even by the standards of brown bears. Here in New York, when someone says, \"Brown Bear,\" they are referring to a different color morph of Black Bears. quote: Originally posted by SemperSignsdotcom: I like the wildeness, where I have spent a lot of time. Damn pilots. Every once in awhile a couple of jet jocks do a low level. Have you ever been peacefully sleeping on a high mountain ridge when a couple of jets do a flyby through the pass, about 200' off your toes? God bless you, --Raven Never happend to me. I've camped out in the some weird country in Mexico, and spent two months living off the land in the Alagash Country of Maine in Winter. The only planes I saw were little props, keeping an eye out for fires. There's a video I've seen of three of my dogs \"cousins\" running an Alaskan Grizzly off. Would have killed him too. One would get in his face, while the other two were ripping at his rear tendons. While all bears should be treated with \"respect,\" Black Bears just aren't that dangerous. Dave", 
        "intTime": 20090524, 
        "postID": 13, 
        "quote": "Originally posted by SemperSignsdotcom: Grachus, yer too full of yourself ~ Funny shi(f)t. No, this post wasn't directed to you. As I remember, you're about third referred to. FYI, in Alaska, \"Grizzlies\" are always deferred to as Brown Bears. There are no Grizzlies in Alaska. However, they are almost, quite closely, the same species though.", 
        "reply": " Yes, just checked this. Basically you're right, but Grizlys are actually a sub-species of Brown Bear, and have a different temperment. quote: Grizzlies can be distinguished from most other brown bear subspecies by their proportionately longer claws and cranial profile which resembles that of the polar bear.[6] Compared to other North American brown bear subspecies, a grizzly has a silver tipped pelt and is smaller in size. This size difference is due to the lesser availability of food in the grizzlies' landlocked habitats.[7] They are similar in size, colour and behaviour to the Siberian Brown Bear (Ursus arctos collaris).[8] Grizzlies are considered by some experts to be the most aggressive bears, even by the standards of brown bears. Here in New York, when someone says, \"Brown Bear,\" they are referring to a different color morph of Black Bears. quote: Originally posted by SemperSignsdotcom: I like the wildeness, where I have spent a lot of time. Damn pilots. Every once in awhile a couple of jet jocks do a low level. Have you ever been peacefully sleeping on a high mountain ridge when a couple of jets do a flyby through the pass, about 200' off your toes? God bless you, --Raven Never happend to me. I've camped out in the some weird country in Mexico, and spent two months living off the land in the Alagash Country of Maine in Winter. The only planes I saw were little props, keeping an eye out for fires. There's a video I've seen of three of my dogs \"cousins\" running an Alaskan Grizzly off. Would have killed him too. One would get in his face, while the other two were ripping at his rear tendons. While all bears should be treated with \"respect,\" Black Bears just aren't that dangerous. Dave", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 18:11:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Grachus"
    }, 
    {
        "content": "Read \"Alaska Bear Tales\" (true stories by Larry Kaniut). Yup, thought about bears a lot, up in Alaska ..after my little wander off the road (another story). Heck, me be sleeping nighty night, they could wander in easy through my damaged door. See: On the road again.", 
        "intTime": 20090524, 
        "postID": 14, 
        "quote": "", 
        "reply": "Read \"Alaska Bear Tales\" (true stories by Larry Kaniut). Yup, thought about bears a lot, up in Alaska ..after my little wander off the road (another story). Heck, me be sleeping nighty night, they could wander in easy through my damaged door. See: On the road again.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 18:38:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "quote: Originally posted by SemperSignsdotcom: Read \"Alaska Bear Tales\" (true stories by Larry Kaniut). Yup, thought about bears a lot, up in Alaska ..after my little wander off the road (another story). Heck, me be sleeping nighty night, they could wander in easy through my damaged door. See: On the road again. Tasty post! Almost (but not quite) makes me want to hit the road again. But both me and the dog are getting old. Get yourself a \"Kuvasok\" (the pleural for \"Kuvasz\") and you can spit a Grizzly in the eye. Dave", 
        "intTime": 20090524, 
        "postID": 15, 
        "quote": "Originally posted by SemperSignsdotcom: Read \"Alaska Bear Tales\" (true stories by Larry Kaniut). Yup, thought about bears a lot, up in Alaska ..after my little wander off the road (another story). Heck, me be sleeping nighty night, they could wander in easy through my damaged door. See: On the road again.", 
        "reply": " Tasty post! Almost (but not quite) makes me want to hit the road again. But both me and the dog are getting old. Get yourself a \"Kuvasok\" (the pleural for \"Kuvasz\") and you can spit a Grizzly in the eye. Dave", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 19:03:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Grachus"
    }, 
    {
        "content": "I agree. They need to leave him alone. But they won't because our stupid legal system leaves no lead-way for common since. Where is Palin, why isn't she standing up for this man or is she?", 
        "intTime": 20090524, 
        "postID": 16, 
        "quote": "", 
        "reply": "I agree. They need to leave him alone. But they won't because our stupid legal system leaves no lead-way for common since. Where is Palin, why isn't she standing up for this man or is she?", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 19:05:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I agree. They need to leave him alone. But they won't because our stupid legal system leaves no lead-way for common since. Where is Palin, why isn't she standing up for this man or is she? She just wants a clear shot at his bears. Dave", 
        "intTime": 20090524, 
        "postID": 17, 
        "quote": "Originally posted by crackerjacks61: I agree. They need to leave him alone. But they won't because our stupid legal system leaves no lead-way for common since. Where is Palin, why isn't she standing up for this man or is she?", 
        "reply": " She just wants a clear shot at his bears. Dave", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 19:38:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal. The bears he interacts with are tens of miles from any human population source - almost literally, in the midst of 'nowhere'. There is very, very little chance of even ONE of those bears even being in contact with another human. If he was doing this from town, then, yes, I would completely agree with you. But this really is man and animal without human influence. These bears would have to travel over 40 miles to find a human (unless said human was camping). Regardless, he is living his dream. Who here can say the same thing? Certainly not me. Leave the man alone. I agree with you on that point, but I don't want the bears hurt or killed either. Bears will be bears! They are unpredictable. If this man is the only man that will suffer because he feeds the bears and they turn on him then that is fine with me. He lived and he learned. Just don't blame the bears if they turn on him.", 
        "intTime": 20090525, 
        "postID": 18, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal. The bears he interacts with are tens of miles from any human population source - almost literally, in the midst of 'nowhere'. There is very, very little chance of even ONE of those bears even being in contact with another human. If he was doing this from town, then, yes, I would completely agree with you. But this really is man and animal without human influence. These bears would have to travel over 40 miles to find a human (unless said human was camping). Regardless, he is living his dream. Who here can say the same thing? Certainly not me. Leave the man alone.", 
        "reply": " I agree with you on that point, but I don't want the bears hurt or killed either. Bears will be bears! They are unpredictable. If this man is the only man that will suffer because he feeds the bears and they turn on him then that is fine with me. He lived and he learned. Just don't blame the bears if they turn on him.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-25 07:40:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Vanir97"
    }, 
    {
        "content": "quote: Originally posted by SemperSignsdotcom: Grachus, yer too full of yourself ~ Funny shi(f)t. No, this post wasn't directed to you. As I remember, you're about third referred to. FYI, in Alaska, \"Grizzlies\" are always deferred to as Brown Bears. There are no Grizzlies in Alaska. However, they are almost, quite closely, the same species though. I like the wildeness, where I have spent a lot of time. Damn pilots. Every once in awhile a couple of jet jocks do a low level. Have you ever been peacefully sleeping on a high mountain ridge when a couple of jets do a flyby through the pass, about 200' off your toes? God bless you, --Raven Kodiac Bears are Brown Bears/ Grizzlies. Larger subspecies of the mainland Brown/Grizzlie bears. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090525, 
        "postID": 19, 
        "quote": "Originally posted by SemperSignsdotcom: Grachus, yer too full of yourself ~ Funny shi(f)t. No, this post wasn't directed to you. As I remember, you're about third referred to. FYI, in Alaska, \"Grizzlies\" are always deferred to as Brown Bears. There are no Grizzlies in Alaska. However, they are almost, quite closely, the same species though. I like the wildeness, where I have spent a lot of time. Damn pilots. Every once in awhile a couple of jet jocks do a low level. Have you ever been peacefully sleeping on a high mountain ridge when a couple of jets do a flyby through the pass, about 200' off your toes? God bless you, --Raven", 
        "reply": " Kodiac Bears are Brown Bears/ Grizzlies. Larger subspecies of the mainland Brown/Grizzlie bears. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-25 07:46:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by SemperSignsdotcom: Read \"Alaska Bear Tales\" (true stories by Larry Kaniut). Yup, thought about bears a lot, up in Alaska ..after my little wander off the road (another story). Heck, me be sleeping nighty night, they could wander in easy through my damaged door. See: On the road again. Tasty post! Almost (but not quite) makes me want to hit the road again. But both me and the dog are getting old. Get yourself a \"Kuvasok\" (the pleural for \"Kuvasz\") and you can spit a Grizzly in the eye. Dave You saying that dog can take on a bear?", 
        "intTime": 20090525, 
        "postID": 20, 
        "quote": "Originally posted by Grachus: quote: Originally posted by SemperSignsdotcom: Read \"Alaska Bear Tales\" (true stories by Larry Kaniut). Yup, thought about bears a lot, up in Alaska ..after my little wander off the road (another story). Heck, me be sleeping nighty night, they could wander in easy through my damaged door. See: On the road again. Tasty post! Almost (but not quite) makes me want to hit the road again. But both me and the dog are getting old. Get yourself a \"Kuvasok\" (the pleural for \"Kuvasz\") and you can spit a Grizzly in the eye. Dave", 
        "reply": " You saying that dog can take on a bear?", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-25 09:45:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Excerpt: quote: FEEDING: Despite danger, friends say he's just an independent Alaskan. By MARY PEMBERTON The Associated Press Charlie Vandergaw is crazy about bears. That's obvious in a documentary made last year by a British filmmaker at Vandergaw's remote Alaska cabin and featured in the recent Animal Planet series \"Stranger Among Bears.\" The videos show him scratching the belly of one black bear as if it were the family dog, feeding a cookie to a large black bear sitting under a tree, and feeding dog kibble to a cub from his outstretched hand. Vandergaw has been coexisting with bears this way for the last 20 years, and he wants to be left alone. That is not likely to happen now that the state is using a beefed-up law to prosecute Vandergaw for feeding bears. Game officials consider feeding bears a danger to humans, especially if others duplicate the behavior. Not everyone thinks the state needs to be going after a 70-year-old retired teacher and wrestling coach. Even if Vandergaw ends up being killed by the bears he loves, that's the Alaska way, said John Frost, who has been friends with Vandergaw for years. He recalled that when he came to Alaska in 1973 he saw a T-shirt that said \"Alaska land of the individual and other endangered species.\" Story continued at: (*http://www.adn.com/vandergaw/story/806485.html*)", 
        "intTime": 20090524, 
        "postID": 21, 
        "quote": "FEEDING: Despite danger, friends say he's just an independent Alaskan. By MARY PEMBERTON The Associated Press Charlie Vandergaw is crazy about bears. That's obvious in a documentary made last year by a British filmmaker at Vandergaw's remote Alaska cabin and featured in the recent Animal Planet series \"Stranger Among Bears.\" The videos show him scratching the belly of one black bear as if it were the family dog, feeding a cookie to a large black bear sitting under a tree, and feeding dog kibble to a cub from his outstretched hand. Vandergaw has been coexisting with bears this way for the last 20 years, and he wants to be left alone. That is not likely to happen now that the state is using a beefed-up law to prosecute Vandergaw for feeding bears. Game officials consider feeding bears a danger to humans, especially if others duplicate the behavior. Not everyone thinks the state needs to be going after a 70-year-old retired teacher and wrestling coach. Even if Vandergaw ends up being killed by the bears he loves, that's the Alaska way, said John Frost, who has been friends with Vandergaw for years. He recalled that when he came to Alaska in 1973 he saw a T-shirt that said \"Alaska land of the individual and other endangered species.\" Story continued at: (*http://www.adn.com/vandergaw/story/806485.html*)", 
        "reply": "Excerpt: ", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 10:59:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes.", 
        "intTime": 20090524, 
        "postID": 22, 
        "quote": "", 
        "reply": "Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 11:11:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes. \"Grizzly man\" was an idiot. He pushed his luck for too long. This guy has formed a relationship with these bears for over 20 years. He knows one day it might do him in but he is an Alaskan and he has more of a chance then the photographer. Alaskans like him are a different breed. He probably keeps the bears fed. They are unpredictable though. Bears can spook easily. Either way, he is doing nothing wrong. The Alaska Fish and Game are like Nazi's. They have been known to take a person's home, car and all their money, put them in jail for 10- 20 years, all because they shot a moose out of season. I believe a murderer would get more leniency than a poacher in this state.", 
        "intTime": 20090524, 
        "postID": 23, 
        "quote": "Originally posted by Agent991: Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes.", 
        "reply": " \"Grizzly man\" was an idiot. He pushed his luck for too long. This guy has formed a relationship with these bears for over 20 years. He knows one day it might do him in but he is an Alaskan and he has more of a chance then the photographer. Alaskans like him are a different breed. He probably keeps the bears fed. They are unpredictable though. Bears can spook easily. Either way, he is doing nothing wrong. The Alaska Fish and Game are like Nazi's. They have been known to take a person's home, car and all their money, put them in jail for 10- 20 years, all because they shot a moose out of season. I believe a murderer would get more leniency than a poacher in this state.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 11:32:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090524, 
        "postID": 24, 
        "quote": "", 
        "reply": "I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 11:32:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal.", 
        "intTime": 20090524, 
        "postID": 25, 
        "quote": "Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy.", 
        "reply": " I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 13:04:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Vanir97"
    }, 
    {
        "content": "quote: Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal. If these are Brown Bears and not Grizzlys, the danger is minimal. To my mind the relevant quesiton is where this guy lives. If he lives more or less in the wilderness - Who cares? If he lives in the suberbs, it's another story. Personally I throw rocks at deer and bears, for the simple reason that I don't want them to get blown away by a hunter. I would LOVE to be in the position of petting a wild animal, but I believe that's \"cruel\" if all it serves is to get them killed. I have one little muskrat friend in a marsh in Brooklyn, but they ain't got a hunting season... Unfortunately, I think a Heron ate him. Dave", 
        "intTime": 20090524, 
        "postID": 26, 
        "quote": "Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal.", 
        "reply": " If these are Brown Bears and not Grizzlys, the danger is minimal. To my mind the relevant quesiton is where this guy lives. If he lives more or less in the wilderness - Who cares? If he lives in the suberbs, it's another story. Personally I throw rocks at deer and bears, for the simple reason that I don't want them to get blown away by a hunter. I would LOVE to be in the position of petting a wild animal, but I believe that's \"cruel\" if all it serves is to get them killed. I have one little muskrat friend in a marsh in Brooklyn, but they ain't got a hunting season... Unfortunately, I think a Heron ate him. Dave", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 13:13:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal. The bears he interacts with are tens of miles from any human population source - almost literally, in the midst of 'nowhere'. There is very, very little chance of even ONE of those bears even being in contact with another human. If he was doing this from town, then, yes, I would completely agree with you. But this really is man and animal without human influence. These bears would have to travel over 40 miles to find a human (unless said human was camping). Regardless, he is living his dream. Who here can say the same thing? Certainly not me. Leave the man alone. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090524, 
        "postID": 27, 
        "quote": "Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal.", 
        "reply": " The bears he interacts with are tens of miles from any human population source - almost literally, in the midst of 'nowhere'. There is very, very little chance of even ONE of those bears even being in contact with another human. If he was doing this from town, then, yes, I would completely agree with you. But this really is man and animal without human influence. These bears would have to travel over 40 miles to find a human (unless said human was camping). Regardless, he is living his dream. Who here can say the same thing? Certainly not me. Leave the man alone. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 13:34:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: The bears he interacts with are tens of miles from any human population source - almost literally, in the midst of 'nowhere'. There is very, very little chance of even ONE of those bears even being in contact with another human. If he was doing this from town, then, yes, I would completely agree with you. But this really is man and animal without human influence. These bears would have to travel over 40 miles to find a human (unless said human was camping). Regardless, he is living his dream. Who here can say the same thing? Certainly not me. Leave the man alone. If such is the case, I agree a hundred percent. But that wont stop the people who want to do it \"for his own good.\" The world is full of people who live in nightmares, and whose main ambition is to stop someone else living Their dream. Dave", 
        "intTime": 20090524, 
        "postID": 28, 
        "quote": "Originally posted by FollowMeInfantry: The bears he interacts with are tens of miles from any human population source - almost literally, in the midst of 'nowhere'. There is very, very little chance of even ONE of those bears even being in contact with another human. If he was doing this from town, then, yes, I would completely agree with you. But this really is man and animal without human influence. These bears would have to travel over 40 miles to find a human (unless said human was camping). Regardless, he is living his dream. Who here can say the same thing? Certainly not me. Leave the man alone.", 
        "reply": " If such is the case, I agree a hundred percent. But that wont stop the people who want to do it \"for his own good.\" The world is full of people who live in nightmares, and whose main ambition is to stop someone else living Their dream. Dave", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 13:42:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal. That is an inaccurate statement. The Grizzly man was an idiot, like I have already said. He was a photographer...a yuppy if you will and had little knowledge of the reality of what Bears were all about. His ego got him and his girlfried killed. Vanderguard knows that it is possible to be killed by a bear and accepts that possibility. It is worth it to him. It is his choice. Bears generally do not attack humans unless it is a mother with a cub (the biggest threat) or when they are startled. The pesky little Black bear might cause you problems, but the brown and grizzlies do not attack unless you are dumb enough to leave food lying around your campsite or you try to use bear spray against them or wound them by trying to shoot them. That is why when you are camping here, you make lots of noise and if you are smart, you take some dogs with you. Bears smell a few dogs and they go the other way. Also, these bears Vanderguard has become freinds with are more likely to stay where they are. Where they have it made. If they did by chance wander more than 10 miles from their home, then they wouldn't feel threatened by humans because of their freindly interaction for the last 20 years, unless for the reasons stated above. The more you know...", 
        "intTime": 20090524, 
        "postID": 29, 
        "quote": "Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal.", 
        "reply": " That is an inaccurate statement. The Grizzly man was an idiot, like I have already said. He was a photographer...a yuppy if you will and had little knowledge of the reality of what Bears were all about. His ego got him and his girlfried killed. Vanderguard knows that it is possible to be killed by a bear and accepts that possibility. It is worth it to him. It is his choice. Bears generally do not attack humans unless it is a mother with a cub (the biggest threat) or when they are startled. The pesky little Black bear might cause you problems, but the brown and grizzlies do not attack unless you are dumb enough to leave food lying around your campsite or you try to use bear spray against them or wound them by trying to shoot them. That is why when you are camping here, you make lots of noise and if you are smart, you take some dogs with you. Bears smell a few dogs and they go the other way. Also, these bears Vanderguard has become freinds with are more likely to stay where they are. Where they have it made. If they did by chance wander more than 10 miles from their home, then they wouldn't feel threatened by humans because of their freindly interaction for the last 20 years, unless for the reasons stated above. The more you know...", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 16:04:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes. From my little reading of the AP story. \"Bears are notorious man killers\" ..um, \"notorious\"? Really. Where did you make this observation from, a skyscraper in NYC? The bears mentioned are black bears, which are quite a bit less dangerous because they are smaller. They are more shy than the Brown / Grizzly, which is the kind that \"ate up\" that character and his gee-friend. ******* quote: If such is the case, I agree a hundred percent. But that wont stop the people who want to do it \"for his own good.\" The world is full of people who live in nightmares, and whose main ambition is to stop someone else living Their dream. Dave Yes, you and Charles Lindbergh, fellow travelers: quote: The readiness to blame a dead pilot for an accident is nauseating, but it has been the tendency ever since I can remember. What pilot has not been in positions where he was in danger and where perfect judgment would have advised against going? But when a man is caught in such a position he is judged only by his error and seldom given credit for the times he has extricated himself from worse situations. Worst of all, blame is heaped upon him by other pilots, all of whom have been in parallel situations themselves, but without being caught in them. If one took no chances, one would not fly at all. Safety lies in the judgment of the chances one takes. That judgment, in turn, must rest upon one's outlook on life. Any coward can sit in his home and criticize a pilot for flying into a mountain in fog. But I would rather, by far, die on a mountainside than in bed. Why should we look for his errors when a brave man dies? Unless we can learn from his experience, there is no need to look for weakness. Rather, we should admire the courage and spirit in his life. What kind of man would live where there is no daring? And is life so dear that we should blame men for dying in adventure? Is there a better way to die? --Charles Lindbergh Have you ever read the Sioux Medicine Wheel story, \"Jumping Mouse\"? ==>http://www.angelfire.com/wa/redwoodsigns/jumping_mouse.html break, break In my little AO, it's don't feed the cougars ..they may get used to your place and drop by to eat your toddlers ..except in Cali, they go after full growns peddling bicycles. This message has been edited. Last edited by: SemperSignsdotcom, Sun 24 May 2009 05:16 PM", 
        "intTime": 20090524, 
        "postID": 30, 
        "quote": "Originally posted by Agent991: Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes.", 
        "reply": " From my little reading of the AP story. \"Bears are notorious man killers\" ..um, \"notorious\"? Really. Where did you make this observation from, a skyscraper in NYC? The bears mentioned are black bears, which are quite a bit less dangerous because they are smaller. They are more shy than the Brown / Grizzly, which is the kind that \"ate up\" that character and his gee-friend. ******* quote: If such is the case, I agree a hundred percent. But that wont stop the people who want to do it \"for his own good.\" The world is full of people who live in nightmares, and whose main ambition is to stop someone else living Their dream. Dave Yes, you and Charles Lindbergh, fellow travelers: quote: The readiness to blame a dead pilot for an accident is nauseating, but it has been the tendency ever since I can remember. What pilot has not been in positions where he was in danger and where perfect judgment would have advised against going? But when a man is caught in such a position he is judged only by his error and seldom given credit for the times he has extricated himself from worse situations. Worst of all, blame is heaped upon him by other pilots, all of whom have been in parallel situations themselves, but without being caught in them. If one took no chances, one would not fly at all. Safety lies in the judgment of the chances one takes. That judgment, in turn, must rest upon one's outlook on life. Any coward can sit in his home and criticize a pilot for flying into a mountain in fog. But I would rather, by far, die on a mountainside than in bed. Why should we look for his errors when a brave man dies? Unless we can learn from his experience, there is no need to look for weakness. Rather, we should admire the courage and spirit in his life. What kind of man would live where there is no daring? And is life so dear that we should blame men for dying in adventure? Is there a better way to die? --Charles Lindbergh Have you ever read the Sioux Medicine Wheel story, \"Jumping Mouse\"? ==>http://www.angelfire.com/wa/redwoodsigns/jumping_mouse.html break, break In my little AO, it's don't feed the cougars ..they may get used to your place and drop by to eat your toddlers ..except in Cali, they go after full growns peddling bicycles. This message has been edited. Last edited by: SemperSignsdotcom, Sun 24 May 2009 05:16 PM", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 16:58:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "quote: Originally posted by SemperSignsdotcom: quote: Originally posted by Agent991: Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes. From my little reading of the AP story. \"Bears are notorious man killers\" ..um, \"notorious\"? Really. Where did you make this observation from, a skyscraper in NYC? The bears mentioned are black bears, which are quite a bit less dangerous because they are smaller. They are more shy than the Brown / Grizzly, which is the kind that \"ate up\" that character and his gee-friend. ******* quote: If such is the case, I agree a hundred percent. But that wont stop the people who want to do it \"for his own good.\" The world is full of people who live in nightmares, and whose main ambition is to stop someone else living Their dream. Dave Yes, you and Charles Lindbergh, fellow travelers: quote: The readiness to blame a dead pilot for an accident is nauseating, but it has been the tendency ever since I can remember. What pilot has not been in positions where he was in danger and where perfect judgment would have advised against going? But when a man is caught in such a position he is judged only by his error and seldom given credit for the times he has extricated himself from worse situations. Worst of all, blame is heaped upon him by other pilots, all of whom have been in parallel situations themselves, but without being caught in them. If one took no chances, one would not fly at all. Safety lies in the judgment of the chances one takes. That judgment, in turn, must rest upon one's outlook on life. Any coward can sit in his home and criticize a pilot for flying into a mountain in fog. But I would rather, by far, die on a mountainside than in bed. Why should we look for his errors when a brave man dies? Unless we can learn from his experience, there is no need to look for weakness. Rather, we should admire the courage and spirit in his life. What kind of man would live where there is no daring? And is life so dear that we should blame men for dying in adventure? Is there a better way to die? --Charles Lindbergh break, break In my little AO, it's don't feed the cougars ..they may get used to your place and drop by to eat your toddlers ..except in Cali, they go after full growns peddling bicycles. Was this post to me? Is a Cougar a Brown/Black Bear? (In Alaska sometimes they call Grizzlys \"Brown Bears,\" but their not.) Aren't we talking about some guy living out in the wilderness, not California? You ever been in a wilderness? It's nice. Usually there's just no one around... Now I made a distinction between doing what this guy is doing in the suberbs, and doing what he's doing in an out and out wilderness. Capiche? (err, capiche, that's Italian for \"you understand?\") Dave", 
        "intTime": 20090524, 
        "postID": 31, 
        "quote": "Originally posted by SemperSignsdotcom: quote: Originally posted by Agent991: Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes. From my little reading of the AP story. \"Bears are notorious man killers\" ..um, \"notorious\"? Really. Where did you make this observation from, a skyscraper in NYC? The bears mentioned are black bears, which are quite a bit less dangerous because they are smaller. They are more shy than the Brown / Grizzly, which is the kind that \"ate up\" that character and his gee-friend. ******* quote: If such is the case, I agree a hundred percent. But that wont stop the people who want to do it \"for his own good.\" The world is full of people who live in nightmares, and whose main ambition is to stop someone else living Their dream. Dave Yes, you and Charles Lindbergh, fellow travelers: quote: The readiness to blame a dead pilot for an accident is nauseating, but it has been the tendency ever since I can remember. What pilot has not been in positions where he was in danger and where perfect judgment would have advised against going? But when a man is caught in such a position he is judged only by his error and seldom given credit for the times he has extricated himself from worse situations. Worst of all, blame is heaped upon him by other pilots, all of whom have been in parallel situations themselves, but without being caught in them. If one took no chances, one would not fly at all. Safety lies in the judgment of the chances one takes. That judgment, in turn, must rest upon one's outlook on life. Any coward can sit in his home and criticize a pilot for flying into a mountain in fog. But I would rather, by far, die on a mountainside than in bed. Why should we look for his errors when a brave man dies? Unless we can learn from his experience, there is no need to look for weakness. Rather, we should admire the courage and spirit in his life. What kind of man would live where there is no daring? And is life so dear that we should blame men for dying in adventure? Is there a better way to die? --Charles Lindbergh break, break In my little AO, it's don't feed the cougars ..they may get used to your place and drop by to eat your toddlers ..except in Cali, they go after full growns peddling bicycles.", 
        "reply": " Was this post to me? Is a Cougar a Brown/Black Bear? (In Alaska sometimes they call Grizzlys \"Brown Bears,\" but their not.) Aren't we talking about some guy living out in the wilderness, not California? You ever been in a wilderness? It's nice. Usually there's just no one around... Now I made a distinction between doing what this guy is doing in the suberbs, and doing what he's doing in an out and out wilderness. Capiche? (err, capiche, that's Italian for \"you understand?\") Dave", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 17:23:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Grachus"
    }, 
    {
        "content": "Grachus, yer too full of yourself ~ Funny shi(f)t. No, this post wasn't directed to you. As I remember, you're about third referred to. FYI, in Alaska, \"Grizzlies\" are always deferred to as Brown Bears. There are no Grizzlies in Alaska. However, they are almost, quite closely, the same species though. I like the wildeness, where I have spent a lot of time. Damn pilots. Every once in awhile a couple of jet jocks do a low level. Have you ever been peacefully sleeping on a high mountain ridge when a couple of jets do a flyby through the pass, about 200' off your toes? God bless you, --Raven", 
        "intTime": 20090524, 
        "postID": 32, 
        "quote": "", 
        "reply": "Grachus, yer too full of yourself ~ Funny shi(f)t. No, this post wasn't directed to you. As I remember, you're about third referred to. FYI, in Alaska, \"Grizzlies\" are always deferred to as Brown Bears. There are no Grizzlies in Alaska. However, they are almost, quite closely, the same species though. I like the wildeness, where I have spent a lot of time. Damn pilots. Every once in awhile a couple of jet jocks do a low level. Have you ever been peacefully sleeping on a high mountain ridge when a couple of jets do a flyby through the pass, about 200' off your toes? God bless you, --Raven", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 17:38:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "quote: Originally posted by SemperSignsdotcom: Grachus, yer too full of yourself ~ Funny shi(f)t. No, this post wasn't directed to you. As I remember, you're about third referred to. FYI, in Alaska, \"Grizzlies\" are always deferred to as Brown Bears. There are no Grizzlies in Alaska. However, they are almost, quite closely, the same species though. Yes, just checked this. Basically you're right, but Grizlys are actually a sub-species of Brown Bear, and have a different temperment. quote: Grizzlies can be distinguished from most other brown bear subspecies by their proportionately longer claws and cranial profile which resembles that of the polar bear.[6] Compared to other North American brown bear subspecies, a grizzly has a silver tipped pelt and is smaller in size. This size difference is due to the lesser availability of food in the grizzlies' landlocked habitats.[7] They are similar in size, colour and behaviour to the Siberian Brown Bear (Ursus arctos collaris).[8] Grizzlies are considered by some experts to be the most aggressive bears, even by the standards of brown bears. Here in New York, when someone says, \"Brown Bear,\" they are referring to a different color morph of Black Bears. quote: Originally posted by SemperSignsdotcom: I like the wildeness, where I have spent a lot of time. Damn pilots. Every once in awhile a couple of jet jocks do a low level. Have you ever been peacefully sleeping on a high mountain ridge when a couple of jets do a flyby through the pass, about 200' off your toes? God bless you, --Raven Never happend to me. I've camped out in the some weird country in Mexico, and spent two months living off the land in the Alagash Country of Maine in Winter. The only planes I saw were little props, keeping an eye out for fires. There's a video I've seen of three of my dogs \"cousins\" running an Alaskan Grizzly off. Would have killed him too. One would get in his face, while the other two were ripping at his rear tendons. While all bears should be treated with \"respect,\" Black Bears just aren't that dangerous. Dave", 
        "intTime": 20090524, 
        "postID": 33, 
        "quote": "Originally posted by SemperSignsdotcom: Grachus, yer too full of yourself ~ Funny shi(f)t. No, this post wasn't directed to you. As I remember, you're about third referred to. FYI, in Alaska, \"Grizzlies\" are always deferred to as Brown Bears. There are no Grizzlies in Alaska. However, they are almost, quite closely, the same species though.", 
        "reply": " Yes, just checked this. Basically you're right, but Grizlys are actually a sub-species of Brown Bear, and have a different temperment. quote: Grizzlies can be distinguished from most other brown bear subspecies by their proportionately longer claws and cranial profile which resembles that of the polar bear.[6] Compared to other North American brown bear subspecies, a grizzly has a silver tipped pelt and is smaller in size. This size difference is due to the lesser availability of food in the grizzlies' landlocked habitats.[7] They are similar in size, colour and behaviour to the Siberian Brown Bear (Ursus arctos collaris).[8] Grizzlies are considered by some experts to be the most aggressive bears, even by the standards of brown bears. Here in New York, when someone says, \"Brown Bear,\" they are referring to a different color morph of Black Bears. quote: Originally posted by SemperSignsdotcom: I like the wildeness, where I have spent a lot of time. Damn pilots. Every once in awhile a couple of jet jocks do a low level. Have you ever been peacefully sleeping on a high mountain ridge when a couple of jets do a flyby through the pass, about 200' off your toes? God bless you, --Raven Never happend to me. I've camped out in the some weird country in Mexico, and spent two months living off the land in the Alagash Country of Maine in Winter. The only planes I saw were little props, keeping an eye out for fires. There's a video I've seen of three of my dogs \"cousins\" running an Alaskan Grizzly off. Would have killed him too. One would get in his face, while the other two were ripping at his rear tendons. While all bears should be treated with \"respect,\" Black Bears just aren't that dangerous. Dave", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 18:11:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Grachus"
    }, 
    {
        "content": "Read \"Alaska Bear Tales\" (true stories by Larry Kaniut). Yup, thought about bears a lot, up in Alaska ..after my little wander off the road (another story). Heck, me be sleeping nighty night, they could wander in easy through my damaged door. See: On the road again.", 
        "intTime": 20090524, 
        "postID": 34, 
        "quote": "", 
        "reply": "Read \"Alaska Bear Tales\" (true stories by Larry Kaniut). Yup, thought about bears a lot, up in Alaska ..after my little wander off the road (another story). Heck, me be sleeping nighty night, they could wander in easy through my damaged door. See: On the road again.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 18:38:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "quote: Originally posted by SemperSignsdotcom: Read \"Alaska Bear Tales\" (true stories by Larry Kaniut). Yup, thought about bears a lot, up in Alaska ..after my little wander off the road (another story). Heck, me be sleeping nighty night, they could wander in easy through my damaged door. See: On the road again. Tasty post! Almost (but not quite) makes me want to hit the road again. But both me and the dog are getting old. Get yourself a \"Kuvasok\" (the pleural for \"Kuvasz\") and you can spit a Grizzly in the eye. Dave", 
        "intTime": 20090524, 
        "postID": 35, 
        "quote": "Originally posted by SemperSignsdotcom: Read \"Alaska Bear Tales\" (true stories by Larry Kaniut). Yup, thought about bears a lot, up in Alaska ..after my little wander off the road (another story). Heck, me be sleeping nighty night, they could wander in easy through my damaged door. See: On the road again.", 
        "reply": " Tasty post! Almost (but not quite) makes me want to hit the road again. But both me and the dog are getting old. Get yourself a \"Kuvasok\" (the pleural for \"Kuvasz\") and you can spit a Grizzly in the eye. Dave", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 19:03:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Grachus"
    }, 
    {
        "content": "I agree. They need to leave him alone. But they won't because our stupid legal system leaves no lead-way for common since. Where is Palin, why isn't she standing up for this man or is she?", 
        "intTime": 20090524, 
        "postID": 36, 
        "quote": "", 
        "reply": "I agree. They need to leave him alone. But they won't because our stupid legal system leaves no lead-way for common since. Where is Palin, why isn't she standing up for this man or is she?", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 19:05:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I agree. They need to leave him alone. But they won't because our stupid legal system leaves no lead-way for common since. Where is Palin, why isn't she standing up for this man or is she? She just wants a clear shot at his bears. Dave", 
        "intTime": 20090524, 
        "postID": 37, 
        "quote": "Originally posted by crackerjacks61: I agree. They need to leave him alone. But they won't because our stupid legal system leaves no lead-way for common since. Where is Palin, why isn't she standing up for this man or is she?", 
        "reply": " She just wants a clear shot at his bears. Dave", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 19:38:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal. The bears he interacts with are tens of miles from any human population source - almost literally, in the midst of 'nowhere'. There is very, very little chance of even ONE of those bears even being in contact with another human. If he was doing this from town, then, yes, I would completely agree with you. But this really is man and animal without human influence. These bears would have to travel over 40 miles to find a human (unless said human was camping). Regardless, he is living his dream. Who here can say the same thing? Certainly not me. Leave the man alone. I agree with you on that point, but I don't want the bears hurt or killed either. Bears will be bears! They are unpredictable. If this man is the only man that will suffer because he feeds the bears and they turn on him then that is fine with me. He lived and he learned. Just don't blame the bears if they turn on him.", 
        "intTime": 20090525, 
        "postID": 38, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal. The bears he interacts with are tens of miles from any human population source - almost literally, in the midst of 'nowhere'. There is very, very little chance of even ONE of those bears even being in contact with another human. If he was doing this from town, then, yes, I would completely agree with you. But this really is man and animal without human influence. These bears would have to travel over 40 miles to find a human (unless said human was camping). Regardless, he is living his dream. Who here can say the same thing? Certainly not me. Leave the man alone.", 
        "reply": " I agree with you on that point, but I don't want the bears hurt or killed either. Bears will be bears! They are unpredictable. If this man is the only man that will suffer because he feeds the bears and they turn on him then that is fine with me. He lived and he learned. Just don't blame the bears if they turn on him.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-25 07:40:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Vanir97"
    }, 
    {
        "content": "quote: Originally posted by SemperSignsdotcom: Grachus, yer too full of yourself ~ Funny shi(f)t. No, this post wasn't directed to you. As I remember, you're about third referred to. FYI, in Alaska, \"Grizzlies\" are always deferred to as Brown Bears. There are no Grizzlies in Alaska. However, they are almost, quite closely, the same species though. I like the wildeness, where I have spent a lot of time. Damn pilots. Every once in awhile a couple of jet jocks do a low level. Have you ever been peacefully sleeping on a high mountain ridge when a couple of jets do a flyby through the pass, about 200' off your toes? God bless you, --Raven Kodiac Bears are Brown Bears/ Grizzlies. Larger subspecies of the mainland Brown/Grizzlie bears. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090525, 
        "postID": 39, 
        "quote": "Originally posted by SemperSignsdotcom: Grachus, yer too full of yourself ~ Funny shi(f)t. No, this post wasn't directed to you. As I remember, you're about third referred to. FYI, in Alaska, \"Grizzlies\" are always deferred to as Brown Bears. There are no Grizzlies in Alaska. However, they are almost, quite closely, the same species though. I like the wildeness, where I have spent a lot of time. Damn pilots. Every once in awhile a couple of jet jocks do a low level. Have you ever been peacefully sleeping on a high mountain ridge when a couple of jets do a flyby through the pass, about 200' off your toes? God bless you, --Raven", 
        "reply": " Kodiac Bears are Brown Bears/ Grizzlies. Larger subspecies of the mainland Brown/Grizzlie bears. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-25 07:46:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by SemperSignsdotcom: Read \"Alaska Bear Tales\" (true stories by Larry Kaniut). Yup, thought about bears a lot, up in Alaska ..after my little wander off the road (another story). Heck, me be sleeping nighty night, they could wander in easy through my damaged door. See: On the road again. Tasty post! Almost (but not quite) makes me want to hit the road again. But both me and the dog are getting old. Get yourself a \"Kuvasok\" (the pleural for \"Kuvasz\") and you can spit a Grizzly in the eye. Dave You saying that dog can take on a bear?", 
        "intTime": 20090525, 
        "postID": 40, 
        "quote": "Originally posted by Grachus: quote: Originally posted by SemperSignsdotcom: Read \"Alaska Bear Tales\" (true stories by Larry Kaniut). Yup, thought about bears a lot, up in Alaska ..after my little wander off the road (another story). Heck, me be sleeping nighty night, they could wander in easy through my damaged door. See: On the road again. Tasty post! Almost (but not quite) makes me want to hit the road again. But both me and the dog are getting old. Get yourself a \"Kuvasok\" (the pleural for \"Kuvasz\") and you can spit a Grizzly in the eye. Dave", 
        "reply": " You saying that dog can take on a bear?", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-25 09:45:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Excerpt: quote: FEEDING: Despite danger, friends say he's just an independent Alaskan. By MARY PEMBERTON The Associated Press Charlie Vandergaw is crazy about bears. That's obvious in a documentary made last year by a British filmmaker at Vandergaw's remote Alaska cabin and featured in the recent Animal Planet series \"Stranger Among Bears.\" The videos show him scratching the belly of one black bear as if it were the family dog, feeding a cookie to a large black bear sitting under a tree, and feeding dog kibble to a cub from his outstretched hand. Vandergaw has been coexisting with bears this way for the last 20 years, and he wants to be left alone. That is not likely to happen now that the state is using a beefed-up law to prosecute Vandergaw for feeding bears. Game officials consider feeding bears a danger to humans, especially if others duplicate the behavior. Not everyone thinks the state needs to be going after a 70-year-old retired teacher and wrestling coach. Even if Vandergaw ends up being killed by the bears he loves, that's the Alaska way, said John Frost, who has been friends with Vandergaw for years. He recalled that when he came to Alaska in 1973 he saw a T-shirt that said \"Alaska land of the individual and other endangered species.\" Story continued at: (*http://www.adn.com/vandergaw/story/806485.html*)", 
        "intTime": 20090524, 
        "postID": 41, 
        "quote": "FEEDING: Despite danger, friends say he's just an independent Alaskan. By MARY PEMBERTON The Associated Press Charlie Vandergaw is crazy about bears. That's obvious in a documentary made last year by a British filmmaker at Vandergaw's remote Alaska cabin and featured in the recent Animal Planet series \"Stranger Among Bears.\" The videos show him scratching the belly of one black bear as if it were the family dog, feeding a cookie to a large black bear sitting under a tree, and feeding dog kibble to a cub from his outstretched hand. Vandergaw has been coexisting with bears this way for the last 20 years, and he wants to be left alone. That is not likely to happen now that the state is using a beefed-up law to prosecute Vandergaw for feeding bears. Game officials consider feeding bears a danger to humans, especially if others duplicate the behavior. Not everyone thinks the state needs to be going after a 70-year-old retired teacher and wrestling coach. Even if Vandergaw ends up being killed by the bears he loves, that's the Alaska way, said John Frost, who has been friends with Vandergaw for years. He recalled that when he came to Alaska in 1973 he saw a T-shirt that said \"Alaska land of the individual and other endangered species.\" Story continued at: (*http://www.adn.com/vandergaw/story/806485.html*)", 
        "reply": "Excerpt: ", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 10:59:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes.", 
        "intTime": 20090524, 
        "postID": 42, 
        "quote": "", 
        "reply": "Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 11:11:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes. \"Grizzly man\" was an idiot. He pushed his luck for too long. This guy has formed a relationship with these bears for over 20 years. He knows one day it might do him in but he is an Alaskan and he has more of a chance then the photographer. Alaskans like him are a different breed. He probably keeps the bears fed. They are unpredictable though. Bears can spook easily. Either way, he is doing nothing wrong. The Alaska Fish and Game are like Nazi's. They have been known to take a person's home, car and all their money, put them in jail for 10- 20 years, all because they shot a moose out of season. I believe a murderer would get more leniency than a poacher in this state.", 
        "intTime": 20090524, 
        "postID": 43, 
        "quote": "Originally posted by Agent991: Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes.", 
        "reply": " \"Grizzly man\" was an idiot. He pushed his luck for too long. This guy has formed a relationship with these bears for over 20 years. He knows one day it might do him in but he is an Alaskan and he has more of a chance then the photographer. Alaskans like him are a different breed. He probably keeps the bears fed. They are unpredictable though. Bears can spook easily. Either way, he is doing nothing wrong. The Alaska Fish and Game are like Nazi's. They have been known to take a person's home, car and all their money, put them in jail for 10- 20 years, all because they shot a moose out of season. I believe a murderer would get more leniency than a poacher in this state.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 11:32:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090524, 
        "postID": 44, 
        "quote": "", 
        "reply": "I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 11:32:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal.", 
        "intTime": 20090524, 
        "postID": 45, 
        "quote": "Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy.", 
        "reply": " I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 13:04:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Vanir97"
    }, 
    {
        "content": "quote: Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal. If these are Brown Bears and not Grizzlys, the danger is minimal. To my mind the relevant quesiton is where this guy lives. If he lives more or less in the wilderness - Who cares? If he lives in the suberbs, it's another story. Personally I throw rocks at deer and bears, for the simple reason that I don't want them to get blown away by a hunter. I would LOVE to be in the position of petting a wild animal, but I believe that's \"cruel\" if all it serves is to get them killed. I have one little muskrat friend in a marsh in Brooklyn, but they ain't got a hunting season... Unfortunately, I think a Heron ate him. Dave", 
        "intTime": 20090524, 
        "postID": 46, 
        "quote": "Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal.", 
        "reply": " If these are Brown Bears and not Grizzlys, the danger is minimal. To my mind the relevant quesiton is where this guy lives. If he lives more or less in the wilderness - Who cares? If he lives in the suberbs, it's another story. Personally I throw rocks at deer and bears, for the simple reason that I don't want them to get blown away by a hunter. I would LOVE to be in the position of petting a wild animal, but I believe that's \"cruel\" if all it serves is to get them killed. I have one little muskrat friend in a marsh in Brooklyn, but they ain't got a hunting season... Unfortunately, I think a Heron ate him. Dave", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 13:13:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal. The bears he interacts with are tens of miles from any human population source - almost literally, in the midst of 'nowhere'. There is very, very little chance of even ONE of those bears even being in contact with another human. If he was doing this from town, then, yes, I would completely agree with you. But this really is man and animal without human influence. These bears would have to travel over 40 miles to find a human (unless said human was camping). Regardless, he is living his dream. Who here can say the same thing? Certainly not me. Leave the man alone. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "intTime": 20090524, 
        "postID": 47, 
        "quote": "Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal.", 
        "reply": " The bears he interacts with are tens of miles from any human population source - almost literally, in the midst of 'nowhere'. There is very, very little chance of even ONE of those bears even being in contact with another human. If he was doing this from town, then, yes, I would completely agree with you. But this really is man and animal without human influence. These bears would have to travel over 40 miles to find a human (unless said human was camping). Regardless, he is living his dream. Who here can say the same thing? Certainly not me. Leave the man alone. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 13:34:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "FollowMeInfantry"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: The bears he interacts with are tens of miles from any human population source - almost literally, in the midst of 'nowhere'. There is very, very little chance of even ONE of those bears even being in contact with another human. If he was doing this from town, then, yes, I would completely agree with you. But this really is man and animal without human influence. These bears would have to travel over 40 miles to find a human (unless said human was camping). Regardless, he is living his dream. Who here can say the same thing? Certainly not me. Leave the man alone. If such is the case, I agree a hundred percent. But that wont stop the people who want to do it \"for his own good.\" The world is full of people who live in nightmares, and whose main ambition is to stop someone else living Their dream. Dave", 
        "intTime": 20090524, 
        "postID": 48, 
        "quote": "Originally posted by FollowMeInfantry: The bears he interacts with are tens of miles from any human population source - almost literally, in the midst of 'nowhere'. There is very, very little chance of even ONE of those bears even being in contact with another human. If he was doing this from town, then, yes, I would completely agree with you. But this really is man and animal without human influence. These bears would have to travel over 40 miles to find a human (unless said human was camping). Regardless, he is living his dream. Who here can say the same thing? Certainly not me. Leave the man alone.", 
        "reply": " If such is the case, I agree a hundred percent. But that wont stop the people who want to do it \"for his own good.\" The world is full of people who live in nightmares, and whose main ambition is to stop someone else living Their dream. Dave", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 13:42:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal. That is an inaccurate statement. The Grizzly man was an idiot, like I have already said. He was a photographer...a yuppy if you will and had little knowledge of the reality of what Bears were all about. His ego got him and his girlfried killed. Vanderguard knows that it is possible to be killed by a bear and accepts that possibility. It is worth it to him. It is his choice. Bears generally do not attack humans unless it is a mother with a cub (the biggest threat) or when they are startled. The pesky little Black bear might cause you problems, but the brown and grizzlies do not attack unless you are dumb enough to leave food lying around your campsite or you try to use bear spray against them or wound them by trying to shoot them. That is why when you are camping here, you make lots of noise and if you are smart, you take some dogs with you. Bears smell a few dogs and they go the other way. Also, these bears Vanderguard has become freinds with are more likely to stay where they are. Where they have it made. If they did by chance wander more than 10 miles from their home, then they wouldn't feel threatened by humans because of their freindly interaction for the last 20 years, unless for the reasons stated above. The more you know...", 
        "intTime": 20090524, 
        "postID": 49, 
        "quote": "Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal.", 
        "reply": " That is an inaccurate statement. The Grizzly man was an idiot, like I have already said. He was a photographer...a yuppy if you will and had little knowledge of the reality of what Bears were all about. His ego got him and his girlfried killed. Vanderguard knows that it is possible to be killed by a bear and accepts that possibility. It is worth it to him. It is his choice. Bears generally do not attack humans unless it is a mother with a cub (the biggest threat) or when they are startled. The pesky little Black bear might cause you problems, but the brown and grizzlies do not attack unless you are dumb enough to leave food lying around your campsite or you try to use bear spray against them or wound them by trying to shoot them. That is why when you are camping here, you make lots of noise and if you are smart, you take some dogs with you. Bears smell a few dogs and they go the other way. Also, these bears Vanderguard has become freinds with are more likely to stay where they are. Where they have it made. If they did by chance wander more than 10 miles from their home, then they wouldn't feel threatened by humans because of their freindly interaction for the last 20 years, unless for the reasons stated above. The more you know...", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 16:04:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes. From my little reading of the AP story. \"Bears are notorious man killers\" ..um, \"notorious\"? Really. Where did you make this observation from, a skyscraper in NYC? The bears mentioned are black bears, which are quite a bit less dangerous because they are smaller. They are more shy than the Brown / Grizzly, which is the kind that \"ate up\" that character and his gee-friend. ******* quote: If such is the case, I agree a hundred percent. But that wont stop the people who want to do it \"for his own good.\" The world is full of people who live in nightmares, and whose main ambition is to stop someone else living Their dream. Dave Yes, you and Charles Lindbergh, fellow travelers: quote: The readiness to blame a dead pilot for an accident is nauseating, but it has been the tendency ever since I can remember. What pilot has not been in positions where he was in danger and where perfect judgment would have advised against going? But when a man is caught in such a position he is judged only by his error and seldom given credit for the times he has extricated himself from worse situations. Worst of all, blame is heaped upon him by other pilots, all of whom have been in parallel situations themselves, but without being caught in them. If one took no chances, one would not fly at all. Safety lies in the judgment of the chances one takes. That judgment, in turn, must rest upon one's outlook on life. Any coward can sit in his home and criticize a pilot for flying into a mountain in fog. But I would rather, by far, die on a mountainside than in bed. Why should we look for his errors when a brave man dies? Unless we can learn from his experience, there is no need to look for weakness. Rather, we should admire the courage and spirit in his life. What kind of man would live where there is no daring? And is life so dear that we should blame men for dying in adventure? Is there a better way to die? --Charles Lindbergh Have you ever read the Sioux Medicine Wheel story, \"Jumping Mouse\"? ==>http://www.angelfire.com/wa/redwoodsigns/jumping_mouse.html break, break In my little AO, it's don't feed the cougars ..they may get used to your place and drop by to eat your toddlers ..except in Cali, they go after full growns peddling bicycles. This message has been edited. Last edited by: SemperSignsdotcom, Sun 24 May 2009 05:16 PM", 
        "intTime": 20090524, 
        "postID": 50, 
        "quote": "Originally posted by Agent991: Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes.", 
        "reply": " From my little reading of the AP story. \"Bears are notorious man killers\" ..um, \"notorious\"? Really. Where did you make this observation from, a skyscraper in NYC? The bears mentioned are black bears, which are quite a bit less dangerous because they are smaller. They are more shy than the Brown / Grizzly, which is the kind that \"ate up\" that character and his gee-friend. ******* quote: If such is the case, I agree a hundred percent. But that wont stop the people who want to do it \"for his own good.\" The world is full of people who live in nightmares, and whose main ambition is to stop someone else living Their dream. Dave Yes, you and Charles Lindbergh, fellow travelers: quote: The readiness to blame a dead pilot for an accident is nauseating, but it has been the tendency ever since I can remember. What pilot has not been in positions where he was in danger and where perfect judgment would have advised against going? But when a man is caught in such a position he is judged only by his error and seldom given credit for the times he has extricated himself from worse situations. Worst of all, blame is heaped upon him by other pilots, all of whom have been in parallel situations themselves, but without being caught in them. If one took no chances, one would not fly at all. Safety lies in the judgment of the chances one takes. That judgment, in turn, must rest upon one's outlook on life. Any coward can sit in his home and criticize a pilot for flying into a mountain in fog. But I would rather, by far, die on a mountainside than in bed. Why should we look for his errors when a brave man dies? Unless we can learn from his experience, there is no need to look for weakness. Rather, we should admire the courage and spirit in his life. What kind of man would live where there is no daring? And is life so dear that we should blame men for dying in adventure? Is there a better way to die? --Charles Lindbergh Have you ever read the Sioux Medicine Wheel story, \"Jumping Mouse\"? ==>http://www.angelfire.com/wa/redwoodsigns/jumping_mouse.html break, break In my little AO, it's don't feed the cougars ..they may get used to your place and drop by to eat your toddlers ..except in Cali, they go after full growns peddling bicycles. This message has been edited. Last edited by: SemperSignsdotcom, Sun 24 May 2009 05:16 PM", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 16:58:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "quote: Originally posted by SemperSignsdotcom: quote: Originally posted by Agent991: Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes. From my little reading of the AP story. \"Bears are notorious man killers\" ..um, \"notorious\"? Really. Where did you make this observation from, a skyscraper in NYC? The bears mentioned are black bears, which are quite a bit less dangerous because they are smaller. They are more shy than the Brown / Grizzly, which is the kind that \"ate up\" that character and his gee-friend. ******* quote: If such is the case, I agree a hundred percent. But that wont stop the people who want to do it \"for his own good.\" The world is full of people who live in nightmares, and whose main ambition is to stop someone else living Their dream. Dave Yes, you and Charles Lindbergh, fellow travelers: quote: The readiness to blame a dead pilot for an accident is nauseating, but it has been the tendency ever since I can remember. What pilot has not been in positions where he was in danger and where perfect judgment would have advised against going? But when a man is caught in such a position he is judged only by his error and seldom given credit for the times he has extricated himself from worse situations. Worst of all, blame is heaped upon him by other pilots, all of whom have been in parallel situations themselves, but without being caught in them. If one took no chances, one would not fly at all. Safety lies in the judgment of the chances one takes. That judgment, in turn, must rest upon one's outlook on life. Any coward can sit in his home and criticize a pilot for flying into a mountain in fog. But I would rather, by far, die on a mountainside than in bed. Why should we look for his errors when a brave man dies? Unless we can learn from his experience, there is no need to look for weakness. Rather, we should admire the courage and spirit in his life. What kind of man would live where there is no daring? And is life so dear that we should blame men for dying in adventure? Is there a better way to die? --Charles Lindbergh break, break In my little AO, it's don't feed the cougars ..they may get used to your place and drop by to eat your toddlers ..except in Cali, they go after full growns peddling bicycles. Was this post to me? Is a Cougar a Brown/Black Bear? (In Alaska sometimes they call Grizzlys \"Brown Bears,\" but their not.) Aren't we talking about some guy living out in the wilderness, not California? You ever been in a wilderness? It's nice. Usually there's just no one around... Now I made a distinction between doing what this guy is doing in the suberbs, and doing what he's doing in an out and out wilderness. Capiche? (err, capiche, that's Italian for \"you understand?\") Dave", 
        "intTime": 20090524, 
        "postID": 51, 
        "quote": "Originally posted by SemperSignsdotcom: quote: Originally posted by Agent991: Angel...I watched \"Grizzly Man\" It was a predictable but horrible end. He has the right to defend himself but Bears are notorious man killers. IMO, I fear for this man. Prayers out for him, whichever way it goes. From my little reading of the AP story. \"Bears are notorious man killers\" ..um, \"notorious\"? Really. Where did you make this observation from, a skyscraper in NYC? The bears mentioned are black bears, which are quite a bit less dangerous because they are smaller. They are more shy than the Brown / Grizzly, which is the kind that \"ate up\" that character and his gee-friend. ******* quote: If such is the case, I agree a hundred percent. But that wont stop the people who want to do it \"for his own good.\" The world is full of people who live in nightmares, and whose main ambition is to stop someone else living Their dream. Dave Yes, you and Charles Lindbergh, fellow travelers: quote: The readiness to blame a dead pilot for an accident is nauseating, but it has been the tendency ever since I can remember. What pilot has not been in positions where he was in danger and where perfect judgment would have advised against going? But when a man is caught in such a position he is judged only by his error and seldom given credit for the times he has extricated himself from worse situations. Worst of all, blame is heaped upon him by other pilots, all of whom have been in parallel situations themselves, but without being caught in them. If one took no chances, one would not fly at all. Safety lies in the judgment of the chances one takes. That judgment, in turn, must rest upon one's outlook on life. Any coward can sit in his home and criticize a pilot for flying into a mountain in fog. But I would rather, by far, die on a mountainside than in bed. Why should we look for his errors when a brave man dies? Unless we can learn from his experience, there is no need to look for weakness. Rather, we should admire the courage and spirit in his life. What kind of man would live where there is no daring? And is life so dear that we should blame men for dying in adventure? Is there a better way to die? --Charles Lindbergh break, break In my little AO, it's don't feed the cougars ..they may get used to your place and drop by to eat your toddlers ..except in Cali, they go after full growns peddling bicycles.", 
        "reply": " Was this post to me? Is a Cougar a Brown/Black Bear? (In Alaska sometimes they call Grizzlys \"Brown Bears,\" but their not.) Aren't we talking about some guy living out in the wilderness, not California? You ever been in a wilderness? It's nice. Usually there's just no one around... Now I made a distinction between doing what this guy is doing in the suberbs, and doing what he's doing in an out and out wilderness. Capiche? (err, capiche, that's Italian for \"you understand?\") Dave", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 17:23:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Grachus"
    }, 
    {
        "content": "Grachus, yer too full of yourself ~ Funny shi(f)t. No, this post wasn't directed to you. As I remember, you're about third referred to. FYI, in Alaska, \"Grizzlies\" are always deferred to as Brown Bears. There are no Grizzlies in Alaska. However, they are almost, quite closely, the same species though. I like the wildeness, where I have spent a lot of time. Damn pilots. Every once in awhile a couple of jet jocks do a low level. Have you ever been peacefully sleeping on a high mountain ridge when a couple of jets do a flyby through the pass, about 200' off your toes? God bless you, --Raven", 
        "intTime": 20090524, 
        "postID": 52, 
        "quote": "", 
        "reply": "Grachus, yer too full of yourself ~ Funny shi(f)t. No, this post wasn't directed to you. As I remember, you're about third referred to. FYI, in Alaska, \"Grizzlies\" are always deferred to as Brown Bears. There are no Grizzlies in Alaska. However, they are almost, quite closely, the same species though. I like the wildeness, where I have spent a lot of time. Damn pilots. Every once in awhile a couple of jet jocks do a low level. Have you ever been peacefully sleeping on a high mountain ridge when a couple of jets do a flyby through the pass, about 200' off your toes? God bless you, --Raven", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 17:38:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "quote: Originally posted by SemperSignsdotcom: Grachus, yer too full of yourself ~ Funny shi(f)t. No, this post wasn't directed to you. As I remember, you're about third referred to. FYI, in Alaska, \"Grizzlies\" are always deferred to as Brown Bears. There are no Grizzlies in Alaska. However, they are almost, quite closely, the same species though. Yes, just checked this. Basically you're right, but Grizlys are actually a sub-species of Brown Bear, and have a different temperment. quote: Grizzlies can be distinguished from most other brown bear subspecies by their proportionately longer claws and cranial profile which resembles that of the polar bear.[6] Compared to other North American brown bear subspecies, a grizzly has a silver tipped pelt and is smaller in size. This size difference is due to the lesser availability of food in the grizzlies' landlocked habitats.[7] They are similar in size, colour and behaviour to the Siberian Brown Bear (Ursus arctos collaris).[8] Grizzlies are considered by some experts to be the most aggressive bears, even by the standards of brown bears. Here in New York, when someone says, \"Brown Bear,\" they are referring to a different color morph of Black Bears. quote: Originally posted by SemperSignsdotcom: I like the wildeness, where I have spent a lot of time. Damn pilots. Every once in awhile a couple of jet jocks do a low level. Have you ever been peacefully sleeping on a high mountain ridge when a couple of jets do a flyby through the pass, about 200' off your toes? God bless you, --Raven Never happend to me. I've camped out in the some weird country in Mexico, and spent two months living off the land in the Alagash Country of Maine in Winter. The only planes I saw were little props, keeping an eye out for fires. There's a video I've seen of three of my dogs \"cousins\" running an Alaskan Grizzly off. Would have killed him too. One would get in his face, while the other two were ripping at his rear tendons. While all bears should be treated with \"respect,\" Black Bears just aren't that dangerous. Dave", 
        "intTime": 20090524, 
        "postID": 53, 
        "quote": "Originally posted by SemperSignsdotcom: Grachus, yer too full of yourself ~ Funny shi(f)t. No, this post wasn't directed to you. As I remember, you're about third referred to. FYI, in Alaska, \"Grizzlies\" are always deferred to as Brown Bears. There are no Grizzlies in Alaska. However, they are almost, quite closely, the same species though.", 
        "reply": " Yes, just checked this. Basically you're right, but Grizlys are actually a sub-species of Brown Bear, and have a different temperment. quote: Grizzlies can be distinguished from most other brown bear subspecies by their proportionately longer claws and cranial profile which resembles that of the polar bear.[6] Compared to other North American brown bear subspecies, a grizzly has a silver tipped pelt and is smaller in size. This size difference is due to the lesser availability of food in the grizzlies' landlocked habitats.[7] They are similar in size, colour and behaviour to the Siberian Brown Bear (Ursus arctos collaris).[8] Grizzlies are considered by some experts to be the most aggressive bears, even by the standards of brown bears. Here in New York, when someone says, \"Brown Bear,\" they are referring to a different color morph of Black Bears. quote: Originally posted by SemperSignsdotcom: I like the wildeness, where I have spent a lot of time. Damn pilots. Every once in awhile a couple of jet jocks do a low level. Have you ever been peacefully sleeping on a high mountain ridge when a couple of jets do a flyby through the pass, about 200' off your toes? God bless you, --Raven Never happend to me. I've camped out in the some weird country in Mexico, and spent two months living off the land in the Alagash Country of Maine in Winter. The only planes I saw were little props, keeping an eye out for fires. There's a video I've seen of three of my dogs \"cousins\" running an Alaskan Grizzly off. Would have killed him too. One would get in his face, while the other two were ripping at his rear tendons. While all bears should be treated with \"respect,\" Black Bears just aren't that dangerous. Dave", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 18:11:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Grachus"
    }, 
    {
        "content": "Read \"Alaska Bear Tales\" (true stories by Larry Kaniut). Yup, thought about bears a lot, up in Alaska ..after my little wander off the road (another story). Heck, me be sleeping nighty night, they could wander in easy through my damaged door. See: On the road again.", 
        "intTime": 20090524, 
        "postID": 54, 
        "quote": "", 
        "reply": "Read \"Alaska Bear Tales\" (true stories by Larry Kaniut). Yup, thought about bears a lot, up in Alaska ..after my little wander off the road (another story). Heck, me be sleeping nighty night, they could wander in easy through my damaged door. See: On the road again.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 18:38:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "SemperSignsdotcom"
    }, 
    {
        "content": "quote: Originally posted by SemperSignsdotcom: Read \"Alaska Bear Tales\" (true stories by Larry Kaniut). Yup, thought about bears a lot, up in Alaska ..after my little wander off the road (another story). Heck, me be sleeping nighty night, they could wander in easy through my damaged door. See: On the road again. Tasty post! Almost (but not quite) makes me want to hit the road again. But both me and the dog are getting old. Get yourself a \"Kuvasok\" (the pleural for \"Kuvasz\") and you can spit a Grizzly in the eye. Dave", 
        "intTime": 20090524, 
        "postID": 55, 
        "quote": "Originally posted by SemperSignsdotcom: Read \"Alaska Bear Tales\" (true stories by Larry Kaniut). Yup, thought about bears a lot, up in Alaska ..after my little wander off the road (another story). Heck, me be sleeping nighty night, they could wander in easy through my damaged door. See: On the road again.", 
        "reply": " Tasty post! Almost (but not quite) makes me want to hit the road again. But both me and the dog are getting old. Get yourself a \"Kuvasok\" (the pleural for \"Kuvasz\") and you can spit a Grizzly in the eye. Dave", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 19:03:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Grachus"
    }, 
    {
        "content": "I agree. They need to leave him alone. But they won't because our stupid legal system leaves no lead-way for common since. Where is Palin, why isn't she standing up for this man or is she?", 
        "intTime": 20090524, 
        "postID": 56, 
        "quote": "", 
        "reply": "I agree. They need to leave him alone. But they won't because our stupid legal system leaves no lead-way for common since. Where is Palin, why isn't she standing up for this man or is she?", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 19:05:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I agree. They need to leave him alone. But they won't because our stupid legal system leaves no lead-way for common since. Where is Palin, why isn't she standing up for this man or is she? She just wants a clear shot at his bears. Dave", 
        "intTime": 20090524, 
        "postID": 57, 
        "quote": "Originally posted by crackerjacks61: I agree. They need to leave him alone. But they won't because our stupid legal system leaves no lead-way for common since. Where is Palin, why isn't she standing up for this man or is she?", 
        "reply": " She just wants a clear shot at his bears. Dave", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-24 19:38:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by FollowMeInfantry: quote: Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal. The bears he interacts with are tens of miles from any human population source - almost literally, in the midst of 'nowhere'. There is very, very little chance of even ONE of those bears even being in contact with another human. If he was doing this from town, then, yes, I would completely agree with you. But this really is man and animal without human influence. These bears would have to travel over 40 miles to find a human (unless said human was camping). Regardless, he is living his dream. Who here can say the same thing? Certainly not me. Leave the man alone. I agree with you on that point, but I don't want the bears hurt or killed either. Bears will be bears! They are unpredictable. If this man is the only man that will suffer because he feeds the bears and they turn on him then that is fine with me. He lived and he learned. Just don't blame the bears if they turn on him.", 
        "intTime": 20090525, 
        "postID": 58, 
        "quote": "Originally posted by FollowMeInfantry: quote: Originally posted by Vanir97: quote: Originally posted by FollowMeInfantry: I agree with Mr. Frost COMPLETELY. Leave the man alone. He's not hurting anything, and a few pieces of dog kibble are not going to transform the Alaskan bear population into ravenous man eaters. Just let the man live out his dream in his waning years. If he dies from a bear attack, he'll have died doing what he loved more than anything. We should all be so blessed as to have such a legacy. I have to disagree with you on this one Richard. Feeding wild animals is never okay. These animals have lost their fear of humans. What if these same bears approach another camp site and when no one feeds them are they simply going to walk away or will they attack and take what they want? Wild animals are not predictable as Tim the Grizzlie Man found out. They killed and ate most of Tim and his Girlfriend also. What happens when this current bear man dies, what are the animals going to do except find another cabin and maybe break in and then another and another and just maybe someone will get in their way . It's not a win situation for man or animal. The bears he interacts with are tens of miles from any human population source - almost literally, in the midst of 'nowhere'. There is very, very little chance of even ONE of those bears even being in contact with another human. If he was doing this from town, then, yes, I would completely agree with you. But this really is man and animal without human influence. These bears would have to travel over 40 miles to find a human (unless said human was camping). Regardless, he is living his dream. Who here can say the same thing? Certainly not me. Leave the man alone.", 
        "reply": " I agree with you on that point, but I don't want the bears hurt or killed either. Bears will be bears! They are unpredictable. If this man is the only man that will suffer because he feeds the bears and they turn on him then that is fine with me. He lived and he learned. Just don't blame the bears if they turn on him.", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-25 07:40:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "Vanir97"
    }, 
    {
        "content": "quote: Originally posted by SemperSignsdotcom: Grachus, yer too full of yourself ~ Funny shi(f)t. No, this post wasn't directed to you. As I remember, you're about third referred to. FYI, in Alaska, \"Grizzlies\" are always deferred to as Brown Bears. There are no Grizzlies in Alaska. However, they are almost, quite closely, the same species though. I like the wildeness, where I have spent a lot of time. Damn pilots. Every once in awhile a couple of jet jocks do a low level. Have you ever been peacefully sleeping on a high mountain ridge when a couple of jets do a flyby through the pass, about 200' off your toes? God bless you, --Raven Kodiac Bears are Brown Bears/ Grizzlies. Larger subspecies of the mainland Brown/Grizzlie bears. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090525, 
        "postID": 59, 
        "quote": "Originally posted by SemperSignsdotcom: Grachus, yer too full of yourself ~ Funny shi(f)t. No, this post wasn't directed to you. As I remember, you're about third referred to. FYI, in Alaska, \"Grizzlies\" are always deferred to as Brown Bears. There are no Grizzlies in Alaska. However, they are almost, quite closely, the same species though. I like the wildeness, where I have spent a lot of time. Damn pilots. Every once in awhile a couple of jet jocks do a low level. Have you ever been peacefully sleeping on a high mountain ridge when a couple of jets do a flyby through the pass, about 200' off your toes? God bless you, --Raven", 
        "reply": " Kodiac Bears are Brown Bears/ Grizzlies. Larger subspecies of the mainland Brown/Grizzlie bears. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-25 07:46:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by SemperSignsdotcom: Read \"Alaska Bear Tales\" (true stories by Larry Kaniut). Yup, thought about bears a lot, up in Alaska ..after my little wander off the road (another story). Heck, me be sleeping nighty night, they could wander in easy through my damaged door. See: On the road again. Tasty post! Almost (but not quite) makes me want to hit the road again. But both me and the dog are getting old. Get yourself a \"Kuvasok\" (the pleural for \"Kuvasz\") and you can spit a Grizzly in the eye. Dave You saying that dog can take on a bear?", 
        "intTime": 20090525, 
        "postID": 60, 
        "quote": "Originally posted by Grachus: quote: Originally posted by SemperSignsdotcom: Read \"Alaska Bear Tales\" (true stories by Larry Kaniut). Yup, thought about bears a lot, up in Alaska ..after my little wander off the road (another story). Heck, me be sleeping nighty night, they could wander in easy through my damaged door. See: On the road again. Tasty post! Almost (but not quite) makes me want to hit the road again. But both me and the dog are getting old. Get yourself a \"Kuvasok\" (the pleural for \"Kuvasz\") and you can spit a Grizzly in the eye. Dave", 
        "reply": " You saying that dog can take on a bear?", 
        "threadID": "672198221_7680041422001", 
        "time": "2009-05-25 09:45:00", 
        "title": "'Bear Man' prepares defense against state charges", 
        "userID": "crackerjacks61"
    }
]