[
    {
        "content": "quote: SEOUL (Reuters) - North Korea reopened a military hotline with the South on Saturday, a day after Washington and Seoul ended annual defense drills that Pyongyang had called preparations for an invasion. North Korea cut the hotline, the only telephone link between the two Koreas, at the start of the drills on March 9. The move signals the North may be ready to tone down its harsh rhetoric ahead of a widely condemned missile launch expected early next month. \"The military communication line reopened this morning followed by a test run and everything is working fine,\" said a spokesman for Seoul's unification ministry. +http://www.reuters.com/article/worldNews/idUSTRE52K0BT20090321", 
        "intTime": 20090320, 
        "postID": 1, 
        "quote": "SEOUL (Reuters) - North Korea reopened a military hotline with the South on Saturday, a day after Washington and Seoul ended annual defense drills that Pyongyang had called preparations for an invasion. North Korea cut the hotline, the only telephone link between the two Koreas, at the start of the drills on March 9. The move signals the North may be ready to tone down its harsh rhetoric ahead of a widely condemned missile launch expected early next month. \"The military communication line reopened this morning followed by a test run and everything is working fine,\" said a spokesman for Seoul's unification ministry.", 
        "reply": " +http://www.reuters.com/article/worldNews/idUSTRE52K0BT20090321", 
        "threadID": "672198221_7450074812001", 
        "time": "2009-03-20 20:39:00", 
        "title": "South Korea says military hotline with North restored", 
        "userID": "Knele"
    }, 
    {
        "content": "That should help prevent 'accidents' with the satellite launch next month.", 
        "intTime": 20090321, 
        "postID": 2, 
        "quote": "", 
        "reply": "That should help prevent 'accidents' with the satellite launch next month.", 
        "threadID": "672198221_7450074812001", 
        "time": "2009-03-21 08:48:00", 
        "title": "South Korea says military hotline with North restored", 
        "userID": "popsiq"
    }
]