[
    {
        "content": "With 20 months left in office, California Gov. Arnold Schwarzenegger wants to leave behind a state that's governable. \"I came in here to fix what is broken in California,\" he said in an interview. In the past 12 months, California's tanking economy caused the state's budget deficit to balloon to $42 billion. A deeply polarized legislature spent 15 weeks squabbling over fiscal solutions as the budget hole deepened. The latest estimates suggest that by mid-2010, California will sink at least $15 billion further into the red. Rest here: \"http://online.wsj.com/article/SB123678004662495023.html\" If California tanks, what does that mean for the rest of the US? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090520, 
        "postID": 1, 
        "quote": "", 
        "reply": "With 20 months left in office, California Gov. Arnold Schwarzenegger wants to leave behind a state that's governable. \"I came in here to fix what is broken in California,\" he said in an interview. In the past 12 months, California's tanking economy caused the state's budget deficit to balloon to $42 billion. A deeply polarized legislature spent 15 weeks squabbling over fiscal solutions as the budget hole deepened. The latest estimates suggest that by mid-2010, California will sink at least $15 billion further into the red. Rest here: \"http://online.wsj.com/article/SB123678004662495023.html\" If California tanks, what does that mean for the rest of the US? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 07:57:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Anbar7"
    }, 
    {
        "content": "What we should take away from this is that a neon blue state vote overwhelmingly red... No Taxes, No Borrowing....Stop the spending. I just wish they would go after everything and anything before they attacked the schools and public safety servants(Firefighters & Police.) Get rid of the damn welfare programs, if people want money they ought to go to work.", 
        "intTime": 20090520, 
        "postID": 2, 
        "quote": "", 
        "reply": "What we should take away from this is that a neon blue state vote overwhelmingly red... No Taxes, No Borrowing....Stop the spending. I just wish they would go after everything and anything before they attacked the schools and public safety servants(Firefighters & Police.) Get rid of the damn welfare programs, if people want money they ought to go to work.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 08:20:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Gross domestic product (GDP) California is responsible for 13% of the United States' gross domestic product (GDP). The state's GDP is at about $1.7 trillion (as of 2006). The GDP increased at an annual rate of 3.1% in the first quarter of 2005.[14] [edit] California's gross state product According to the California Department of Finance, California's gross state product is $1.543 trillion.*[15] According to the Bureau of Economic Analysis, California's gross state product is $1.727 trillion (2006 data, last updated Thursday, June 7, 2007).[16] According to the California Legislative Analyst's Office, \"California's gross state product is nearly $1.5 trillion...\" (\"Gross product in 2003\", released in 2004).[17] +http://en.wikipedia.org/wiki/Economy_of_California \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090520, 
        "postID": 3, 
        "quote": "", 
        "reply": "Gross domestic product (GDP) California is responsible for 13% of the United States' gross domestic product (GDP). The state's GDP is at about $1.7 trillion (as of 2006). The GDP increased at an annual rate of 3.1% in the first quarter of 2005.[14] [edit] California's gross state product According to the California Department of Finance, California's gross state product is $1.543 trillion.*[15] According to the Bureau of Economic Analysis, California's gross state product is $1.727 trillion (2006 data, last updated Thursday, June 7, 2007).[16] According to the California Legislative Analyst's Office, \"California's gross state product is nearly $1.5 trillion...\" (\"Gross product in 2003\", released in 2004).[17] +http://en.wikipedia.org/wiki/Economy_of_California \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 08:21:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "NSNN"
    }, 
    {
        "content": "The People's Republik of Kalifornya is a microcosm of longer-term results of obamanation-like policies and Pelosi-like laws. This kind of economic disaster is not easily overcome. I wonder when we who live and vote more wisely in other states will have the obamanation's taxman pointing his gun at us for more \"contributions,\" this time to bail out the spendthrift government of Kalifornya? Nothing like reinforcing failure--insanely wondering why things don't get better.", 
        "intTime": 20090520, 
        "postID": 4, 
        "quote": "", 
        "reply": "The People's Republik of Kalifornya is a microcosm of longer-term results of obamanation-like policies and Pelosi-like laws. This kind of economic disaster is not easily overcome. I wonder when we who live and vote more wisely in other states will have the obamanation's taxman pointing his gun at us for more \"contributions,\" this time to bail out the spendthrift government of Kalifornya? Nothing like reinforcing failure--insanely wondering why things don't get better.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 08:58:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "RRR52"
    }, 
    {
        "content": "What is Pelosi doing to help her state? Haven't heard anything from her about it. Is she too overwhelmed with Congress that she doesn't have time for her own state? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090520, 
        "postID": 5, 
        "quote": "", 
        "reply": "What is Pelosi doing to help her state? Haven't heard anything from her about it. Is she too overwhelmed with Congress that she doesn't have time for her own state? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:10:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "intTime": 20090520, 
        "postID": 6, 
        "quote": "", 
        "reply": "Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:39:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "The problem is that nobody here wants to pay more taxes -- understandably. The other option is cutting back funding for particular state programs and agencies. But nobody wants their particular pet programs cut back. Cut some OTHER programs, but don't touch MINE! Mine is more important than THEIRS! Californians, like all Americans, have to re-learn the concept of sacrificing a little to ensure a better future.", 
        "intTime": 20090520, 
        "postID": 7, 
        "quote": "", 
        "reply": "The problem is that nobody here wants to pay more taxes -- understandably. The other option is cutting back funding for particular state programs and agencies. But nobody wants their particular pet programs cut back. Cut some OTHER programs, but don't touch MINE! Mine is more important than THEIRS! Californians, like all Americans, have to re-learn the concept of sacrificing a little to ensure a better future.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:48:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "1WW"
    }, 
    {
        "content": "Dave! A question for you. Are you sure the Tax System is the same for property taxes? That seems crazy. A Millionaire that lives in Malibu with a 20,000 sq. ft. Mansion would pay the same in property taxes as someone would who lives in...hmmm..a small home in a LA suburb? That seems unfair to say the least. Will CA get a bailout? Anyone??", 
        "intTime": 20090520, 
        "postID": 8, 
        "quote": "", 
        "reply": "Dave! A question for you. Are you sure the Tax System is the same for property taxes? That seems crazy. A Millionaire that lives in Malibu with a 20,000 sq. ft. Mansion would pay the same in property taxes as someone would who lives in...hmmm..a small home in a LA suburb? That seems unfair to say the least. Will CA get a bailout? Anyone??", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:53:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by 1WW: The problem is that nobody here wants to pay more taxes -- understandably. The other option is cutting back funding for particular state programs and agencies. But nobody wants their particular pet programs cut back. Cut some OTHER programs, but don't touch MINE! Mine is more important than THEIRS! Californians, like all Americans, have to re-learn the concept of sacrificing a little to ensure a better future.", 
        "intTime": 20090520, 
        "postID": 9, 
        "quote": "Originally posted by 1WW: The problem is that nobody here wants to pay more taxes -- understandably. The other option is cutting back funding for particular state programs and agencies. But nobody wants their particular pet programs cut back. Cut some OTHER programs, but don't touch MINE! Mine is more important than THEIRS! Californians, like all Americans, have to re-learn the concept of sacrificing a little to ensure a better future.", 
        "reply": "", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:54:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Dave! A question for you. Are you sure the Tax System is the same for property taxes? That seems crazy. A Millionaire that lives in Malibu with a 20,000 sq. ft. Mansion would pay the same in property taxes as someone would who lives in...hmmm..a small home in a LA suburb? That seems unfair to say the least. Will CA get a bailout? Anyone?? My bad, I did not mean it like that. People with large estates pay more than those with a two family house. But they pay less proportionally. I have to pause and admit that I'm not up on California property tax rates, but here in Long Island New York, a two family house owner might very well find himself paying 10K a year in property taxes. This is quite a chunck of change for someone making forty, fifty K a year, as opposed to a millionare paying 50K on a twenty acre estate with a twenty room house. Working families of the Middle Income Middle Class have little disposable income left after paying such taxes. Moreover they're in a bind, because it's difficult for them to sell their homes. Now State taxes have to come from somewhere. If you don't have enough being made from income taxes, then the rest has to come from property taxes. I don't blame the people of California for being upset about all the money they pay for taxes, but in my opinion their rage was misdirected. Dave", 
        "intTime": 20090520, 
        "postID": 10, 
        "quote": "Originally posted by Agent991: Dave! A question for you. Are you sure the Tax System is the same for property taxes? That seems crazy. A Millionaire that lives in Malibu with a 20,000 sq. ft. Mansion would pay the same in property taxes as someone would who lives in...hmmm..a small home in a LA suburb? That seems unfair to say the least. Will CA get a bailout? Anyone??", 
        "reply": " My bad, I did not mean it like that. People with large estates pay more than those with a two family house. But they pay less proportionally. I have to pause and admit that I'm not up on California property tax rates, but here in Long Island New York, a two family house owner might very well find himself paying 10K a year in property taxes. This is quite a chunck of change for someone making forty, fifty K a year, as opposed to a millionare paying 50K on a twenty acre estate with a twenty room house. Working families of the Middle Income Middle Class have little disposable income left after paying such taxes. Moreover they're in a bind, because it's difficult for them to sell their homes. Now State taxes have to come from somewhere. If you don't have enough being made from income taxes, then the rest has to come from property taxes. I don't blame the people of California for being upset about all the money they pay for taxes, but in my opinion their rage was misdirected. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 10:43:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave So who has to fix this problem? Arnold, Nancy, both, or the whole US? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090520, 
        "postID": 11, 
        "quote": "Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "reply": " So who has to fix this problem? Arnold, Nancy, both, or the whole US? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 11:07:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave So who has to fix this problem? Arnold, Nancy, both, or the whole US? The problem has to be solved by the Governor and the State Legislature, and the people of California. The people have to recognise that if they want the services they have to have the money to pay for them, and they have to FORCE their local politicians to revamp the tax structure so that the burden is shifted from those without the money to those who HAVE the money. Plain and simple, the Middle Income Middle Class is paying far to much of their disposable income in taxes, and the wealthy who benefit even MORE for all these services have to pick up the load. And the same is true on a National Scale. As Federal Revenue has fallen, so has Federal aid to the States, and the States are left holding the bad that the Feds created. Dave", 
        "intTime": 20090520, 
        "postID": 12, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave So who has to fix this problem? Arnold, Nancy, both, or the whole US?", 
        "reply": " The problem has to be solved by the Governor and the State Legislature, and the people of California. The people have to recognise that if they want the services they have to have the money to pay for them, and they have to FORCE their local politicians to revamp the tax structure so that the burden is shifted from those without the money to those who HAVE the money. Plain and simple, the Middle Income Middle Class is paying far to much of their disposable income in taxes, and the wealthy who benefit even MORE for all these services have to pick up the load. And the same is true on a National Scale. As Federal Revenue has fallen, so has Federal aid to the States, and the States are left holding the bad that the Feds created. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 12:02:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies.", 
        "intTime": 20090520, 
        "postID": 13, 
        "quote": "Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "reply": " A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 12:52:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. Ahh the downside to socialism.... You actually have to pay for stuff.", 
        "intTime": 20090520, 
        "postID": 14, 
        "quote": "Originally posted by jwr6: quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies.", 
        "reply": " Ahh the downside to socialism.... You actually have to pay for stuff.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 13:00:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave quote: Originally posted by jwr6: A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Sure it's a regressive tax. And is RECOGNISED as a regressive tax. And this is because a flat tax always takes a higher percentage of disposable income Don't believe me? Here are the definitions posted on a business site. quote: Dictionary of Accounting Terms regressive tax system in which the percentage of income paid declines as income rises. Under a regressive system, as income rises from $15,000 to $100,000, the tax rate would fall from 20% to 10%, for example. In this sense, a regressive tax is the opposite of a progressive tax . The term is also used generally to refer to any tax system that favors the rich at the expense of the poor. The general sales tax with its fixed rate is considered regressive, because lower income groups tend to spend a higher percentage of their incomes on goods and services than higher income groups. Dictionary of Finance and Investment Terms regressive tax 1. system of taxation in which tax rates decline as the tax base rises. For example, a system that taxed values of $1,000 to $5,000 at 5%, $5,000 to $10,000 at 4% and so on would be regressive. A regressive tax is the opposite of a progressive tax . 2. tax system that results in a higher tax for the poor than for the rich, in terms of percentage of income. In this sense, a sales tax is regressive even though the same rate is applied to all sales, because people with lower incomes tend to spend most of their incomes on goods and services. Similarly, payroll taxes are regressive because they are borne largely by wage earners and not by higher income groups. Local property taxes also tend to be regressive because poorer people spend more of their incomes on housing costs, which are directly affected by property taxes. See also flat tax . Dictionary of Business Terms regressive tax tax that takes a higher percentage of the earnings of a low-income family than of those of a high-income family. A sales tax on food is considered regressive because low-income people pay the same amount of tax on a loaf of bread, for example, as do highincome people. \"http://www.allbusiness.com/glossaries/regressive-tax/4954317-1.html\" quote: Originally posted by jwr6: Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. This is becoming a cliche, despite all the evidence against it. The same loopholes, despite disclaimers, exist in any so called Flat taxes. The plain fact of the matter is that in States like New York, we used to have a progressive Income tax, and as that was dropped in favor of what amounts to a regressive flat tax, income dropped dramatically. Loopholes only go so far. And this is why the progressive tax system is under attack, has always been under attack by the wealthy - Who in fact secretly or openly fund all these Flat Tax proposals. quote: Originally posted by jwr6: Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. California has been in Big Trouble ever since they had their referendum barring new taxes. A recession merely made the problem worse. Dave", 
        "intTime": 20090520, 
        "postID": 15, 
        "quote": "Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "reply": " quote: Originally posted by jwr6: A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Sure it's a regressive tax. And is RECOGNISED as a regressive tax. And this is because a flat tax always takes a higher percentage of disposable income Don't believe me? Here are the definitions posted on a business site. quote: Dictionary of Accounting Terms regressive tax system in which the percentage of income paid declines as income rises. Under a regressive system, as income rises from $15,000 to $100,000, the tax rate would fall from 20% to 10%, for example. In this sense, a regressive tax is the opposite of a progressive tax . The term is also used generally to refer to any tax system that favors the rich at the expense of the poor. The general sales tax with its fixed rate is considered regressive, because lower income groups tend to spend a higher percentage of their incomes on goods and services than higher income groups. Dictionary of Finance and Investment Terms regressive tax 1. system of taxation in which tax rates decline as the tax base rises. For example, a system that taxed values of $1,000 to $5,000 at 5%, $5,000 to $10,000 at 4% and so on would be regressive. A regressive tax is the opposite of a progressive tax . 2. tax system that results in a higher tax for the poor than for the rich, in terms of percentage of income. In this sense, a sales tax is regressive even though the same rate is applied to all sales, because people with lower incomes tend to spend most of their incomes on goods and services. Similarly, payroll taxes are regressive because they are borne largely by wage earners and not by higher income groups. Local property taxes also tend to be regressive because poorer people spend more of their incomes on housing costs, which are directly affected by property taxes. See also flat tax . Dictionary of Business Terms regressive tax tax that takes a higher percentage of the earnings of a low-income family than of those of a high-income family. A sales tax on food is considered regressive because low-income people pay the same amount of tax on a loaf of bread, for example, as do highincome people. \"http://www.allbusiness.com/glossaries/regressive-tax/4954317-1.html\" quote: Originally posted by jwr6: Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. This is becoming a cliche, despite all the evidence against it. The same loopholes, despite disclaimers, exist in any so called Flat taxes. The plain fact of the matter is that in States like New York, we used to have a progressive Income tax, and as that was dropped in favor of what amounts to a regressive flat tax, income dropped dramatically. Loopholes only go so far. And this is why the progressive tax system is under attack, has always been under attack by the wealthy - Who in fact secretly or openly fund all these Flat Tax proposals. quote: Originally posted by jwr6: Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. California has been in Big Trouble ever since they had their referendum barring new taxes. A recession merely made the problem worse. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 13:42:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: Ahh the downside to socialism.... You actually have to pay for stuff. I wish we were talking about Socialism. We are talking about Capitalism where the costs of services are passed on to the Middle Income Middle Class, and the benefits are passed to the wealthy. Basically ANY system has to pay for what it wants. But with our present tax structure we just \"charge it,\" and that is what Republican policies have created, unbelievable massive debt. Dave", 
        "intTime": 20090520, 
        "postID": 16, 
        "quote": "Originally posted by NickBrand: Ahh the downside to socialism.... You actually have to pay for stuff.", 
        "reply": " I wish we were talking about Socialism. We are talking about Capitalism where the costs of services are passed on to the Middle Income Middle Class, and the benefits are passed to the wealthy. Basically ANY system has to pay for what it wants. But with our present tax structure we just \"charge it,\" and that is what Republican policies have created, unbelievable massive debt. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 13:46:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave quote: Originally posted by jwr6: A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Sure it's a regressive tax. And is RECOGNISED as a regressive tax. And this is because a flat tax always takes a higher percentage of disposable income Don't believe me? Here are the definitions posted on a business site. quote: Dictionary of Accounting Terms regressive tax system in which the percentage of income paid declines as income rises. Under a regressive system, as income rises from $15,000 to $100,000, the tax rate would fall from 20% to 10%, for example. In this sense, a regressive tax is the opposite of a progressive tax . The term is also used generally to refer to any tax system that favors the rich at the expense of the poor. The general sales tax with its fixed rate is considered regressive, because lower income groups tend to spend a higher percentage of their incomes on goods and services than higher income groups. Dictionary of Finance and Investment Terms regressive tax 1. system of taxation in which tax rates decline as the tax base rises. For example, a system that taxed values of $1,000 to $5,000 at 5%, $5,000 to $10,000 at 4% and so on would be regressive. A regressive tax is the opposite of a progressive tax . 2. tax system that results in a higher tax for the poor than for the rich, in terms of percentage of income. In this sense, a sales tax is regressive even though the same rate is applied to all sales, because people with lower incomes tend to spend most of their incomes on goods and services. Similarly, payroll taxes are regressive because they are borne largely by wage earners and not by higher income groups. Local property taxes also tend to be regressive because poorer people spend more of their incomes on housing costs, which are directly affected by property taxes. See also flat tax . Dictionary of Business Terms regressive tax tax that takes a higher percentage of the earnings of a low-income family than of those of a high-income family. A sales tax on food is considered regressive because low-income people pay the same amount of tax on a loaf of bread, for example, as do highincome people. \"http://www.allbusiness.com/glossaries/regressive-tax/4954317-1.html\" quote: Originally posted by jwr6: Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. This is becoming a cliche, despite all the evidence against it. The same loopholes, despite disclaimers, exist in any so called Flat taxes. The plain fact of the matter is that in States like New York, we used to have a progressive Income tax, and as that was dropped in favor of what amounts to a regressive flat tax, income dropped dramatically. Loopholes only go so far. And this is why the progressive tax system is under attack, has always been under attack by the wealthy - Who in fact secretly or openly fund all these Flat Tax proposals. quote: Originally posted by jwr6: Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. California has been in Big Trouble ever since they had their referendum barring new taxes. A recession merely made the problem worse. Dave Dave, I have asked you this a number of times but have never received an answer. In your opinion what percentage of income should the \"rich\" have to pay for you to consider them having paid their \"fair share\"?", 
        "intTime": 20090520, 
        "postID": 17, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave quote: Originally posted by jwr6: A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Sure it's a regressive tax. And is RECOGNISED as a regressive tax. And this is because a flat tax always takes a higher percentage of disposable income Don't believe me? Here are the definitions posted on a business site. quote: Dictionary of Accounting Terms regressive tax system in which the percentage of income paid declines as income rises. Under a regressive system, as income rises from $15,000 to $100,000, the tax rate would fall from 20% to 10%, for example. In this sense, a regressive tax is the opposite of a progressive tax . The term is also used generally to refer to any tax system that favors the rich at the expense of the poor. The general sales tax with its fixed rate is considered regressive, because lower income groups tend to spend a higher percentage of their incomes on goods and services than higher income groups. Dictionary of Finance and Investment Terms regressive tax 1. system of taxation in which tax rates decline as the tax base rises. For example, a system that taxed values of $1,000 to $5,000 at 5%, $5,000 to $10,000 at 4% and so on would be regressive. A regressive tax is the opposite of a progressive tax . 2. tax system that results in a higher tax for the poor than for the rich, in terms of percentage of income. In this sense, a sales tax is regressive even though the same rate is applied to all sales, because people with lower incomes tend to spend most of their incomes on goods and services. Similarly, payroll taxes are regressive because they are borne largely by wage earners and not by higher income groups. Local property taxes also tend to be regressive because poorer people spend more of their incomes on housing costs, which are directly affected by property taxes. See also flat tax . Dictionary of Business Terms regressive tax tax that takes a higher percentage of the earnings of a low-income family than of those of a high-income family. A sales tax on food is considered regressive because low-income people pay the same amount of tax on a loaf of bread, for example, as do highincome people. \"http://www.allbusiness.com/glossaries/regressive-tax/4954317-1.html\" quote: Originally posted by jwr6: Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. This is becoming a cliche, despite all the evidence against it. The same loopholes, despite disclaimers, exist in any so called Flat taxes. The plain fact of the matter is that in States like New York, we used to have a progressive Income tax, and as that was dropped in favor of what amounts to a regressive flat tax, income dropped dramatically. Loopholes only go so far. And this is why the progressive tax system is under attack, has always been under attack by the wealthy - Who in fact secretly or openly fund all these Flat Tax proposals. quote: Originally posted by jwr6: Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. California has been in Big Trouble ever since they had their referendum barring new taxes. A recession merely made the problem worse. Dave", 
        "reply": " Dave, I have asked you this a number of times but have never received an answer. In your opinion what percentage of income should the \"rich\" have to pay for you to consider them having paid their \"fair share\"?", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 13:48:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. That last one is a biggie! The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. Well, according to California tax tables, $40K (married) pays 4% and the millionaire pays 10.3%. Not the same. Now the person making $93K+ pays the same as someone making $900K+ (9.3% Married) and $47K+ pays the same as $999K (9.3%) and that could be addressed. In all California's range is 1% to 10.3% Probably some wiggle room there and maybe they can also look at what they buy each year in the form of all services. And now they're shafted. Darn, Dave; we agree on most of this Dave", 
        "intTime": 20090520, 
        "postID": 18, 
        "quote": "Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. That last one is a biggie! The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. Well, according to California tax tables, $40K (married) pays 4% and the millionaire pays 10.3%. Not the same. Now the person making $93K+ pays the same as someone making $900K+ (9.3% Married) and $47K+ pays the same as $999K (9.3%) and that could be addressed. In all California's range is 1% to 10.3% Probably some wiggle room there and maybe they can also look at what they buy each year in the form of all services. And now they're shafted. Darn, Dave; we agree on most of this Dave", 
        "reply": "", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 14:04:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: With 20 months left in office, California Gov. Arnold Schwarzenegger wants to leave behind a state that's governable. \"I came in here to fix what is broken in California,\" he said in an interview. In the past 12 months, California's tanking economy caused the state's budget deficit to balloon to $42 billion. A deeply polarized legislature spent 15 weeks squabbling over fiscal solutions as the budget hole deepened. The latest estimates suggest that by mid-2010, California will sink at least $15 billion further into the red. Rest here: \"http://online.wsj.com/article/SB123678004662495023.html\" If California tanks, what does that mean for the rest of the US? Arnold and Pelosi really did a number on the people of CA. But hey, what do you expect from a state that loves illegals, gays, gangs, Kobe Bryant, drugs, and non-military people.", 
        "intTime": 20090520, 
        "postID": 19, 
        "quote": "Originally posted by Anbar7: With 20 months left in office, California Gov. Arnold Schwarzenegger wants to leave behind a state that's governable. \"I came in here to fix what is broken in California,\" he said in an interview. In the past 12 months, California's tanking economy caused the state's budget deficit to balloon to $42 billion. A deeply polarized legislature spent 15 weeks squabbling over fiscal solutions as the budget hole deepened. The latest estimates suggest that by mid-2010, California will sink at least $15 billion further into the red. Rest here: \"http://online.wsj.com/article/SB123678004662495023.html\" If California tanks, what does that mean for the rest of the US?", 
        "reply": " Arnold and Pelosi really did a number on the people of CA. But hey, what do you expect from a state that loves illegals, gays, gangs, Kobe Bryant, drugs, and non-military people.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 14:26:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by stec74: Dave, I have asked you this a number of times but have never received an answer. In your opinion what percentage of income should the \"rich\" have to pay for you to consider them having paid their \"fair share\"? I've answeed your question before. You missed the post. Roughly Individuals making 150K or more should pay around 35 percent, those making more than 500K, about 50 percent, and those making more than a meg, 65 percent. This will give plenty of incentive for people to make big bucks, while at the same time paying their share. I would also suggest eliminating all, or almost all regressive taxes. However, I am certainly open to debate these figures. And of course these are for Federal taxes. Larger Federal taxes would allow the Feds to pick up more of the costs of roads, education and infrastructure - Since the impact of these affect the entire country and not just the individual State. Dave", 
        "intTime": 20090520, 
        "postID": 20, 
        "quote": "Originally posted by stec74: Dave, I have asked you this a number of times but have never received an answer. In your opinion what percentage of income should the \"rich\" have to pay for you to consider them having paid their \"fair share\"?", 
        "reply": " I've answeed your question before. You missed the post. Roughly Individuals making 150K or more should pay around 35 percent, those making more than 500K, about 50 percent, and those making more than a meg, 65 percent. This will give plenty of incentive for people to make big bucks, while at the same time paying their share. I would also suggest eliminating all, or almost all regressive taxes. However, I am certainly open to debate these figures. And of course these are for Federal taxes. Larger Federal taxes would allow the Feds to pick up more of the costs of roads, education and infrastructure - Since the impact of these affect the entire country and not just the individual State. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 14:34:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "With 20 months left in office, California Gov. Arnold Schwarzenegger wants to leave behind a state that's governable. \"I came in here to fix what is broken in California,\" he said in an interview. In the past 12 months, California's tanking economy caused the state's budget deficit to balloon to $42 billion. A deeply polarized legislature spent 15 weeks squabbling over fiscal solutions as the budget hole deepened. The latest estimates suggest that by mid-2010, California will sink at least $15 billion further into the red. Rest here: \"http://online.wsj.com/article/SB123678004662495023.html\" If California tanks, what does that mean for the rest of the US? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090520, 
        "postID": 21, 
        "quote": "", 
        "reply": "With 20 months left in office, California Gov. Arnold Schwarzenegger wants to leave behind a state that's governable. \"I came in here to fix what is broken in California,\" he said in an interview. In the past 12 months, California's tanking economy caused the state's budget deficit to balloon to $42 billion. A deeply polarized legislature spent 15 weeks squabbling over fiscal solutions as the budget hole deepened. The latest estimates suggest that by mid-2010, California will sink at least $15 billion further into the red. Rest here: \"http://online.wsj.com/article/SB123678004662495023.html\" If California tanks, what does that mean for the rest of the US? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 07:57:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Anbar7"
    }, 
    {
        "content": "What we should take away from this is that a neon blue state vote overwhelmingly red... No Taxes, No Borrowing....Stop the spending. I just wish they would go after everything and anything before they attacked the schools and public safety servants(Firefighters & Police.) Get rid of the damn welfare programs, if people want money they ought to go to work.", 
        "intTime": 20090520, 
        "postID": 22, 
        "quote": "", 
        "reply": "What we should take away from this is that a neon blue state vote overwhelmingly red... No Taxes, No Borrowing....Stop the spending. I just wish they would go after everything and anything before they attacked the schools and public safety servants(Firefighters & Police.) Get rid of the damn welfare programs, if people want money they ought to go to work.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 08:20:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Gross domestic product (GDP) California is responsible for 13% of the United States' gross domestic product (GDP). The state's GDP is at about $1.7 trillion (as of 2006). The GDP increased at an annual rate of 3.1% in the first quarter of 2005.[14] [edit] California's gross state product According to the California Department of Finance, California's gross state product is $1.543 trillion.*[15] According to the Bureau of Economic Analysis, California's gross state product is $1.727 trillion (2006 data, last updated Thursday, June 7, 2007).[16] According to the California Legislative Analyst's Office, \"California's gross state product is nearly $1.5 trillion...\" (\"Gross product in 2003\", released in 2004).[17] +http://en.wikipedia.org/wiki/Economy_of_California \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090520, 
        "postID": 23, 
        "quote": "", 
        "reply": "Gross domestic product (GDP) California is responsible for 13% of the United States' gross domestic product (GDP). The state's GDP is at about $1.7 trillion (as of 2006). The GDP increased at an annual rate of 3.1% in the first quarter of 2005.[14] [edit] California's gross state product According to the California Department of Finance, California's gross state product is $1.543 trillion.*[15] According to the Bureau of Economic Analysis, California's gross state product is $1.727 trillion (2006 data, last updated Thursday, June 7, 2007).[16] According to the California Legislative Analyst's Office, \"California's gross state product is nearly $1.5 trillion...\" (\"Gross product in 2003\", released in 2004).[17] +http://en.wikipedia.org/wiki/Economy_of_California \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 08:21:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "NSNN"
    }, 
    {
        "content": "The People's Republik of Kalifornya is a microcosm of longer-term results of obamanation-like policies and Pelosi-like laws. This kind of economic disaster is not easily overcome. I wonder when we who live and vote more wisely in other states will have the obamanation's taxman pointing his gun at us for more \"contributions,\" this time to bail out the spendthrift government of Kalifornya? Nothing like reinforcing failure--insanely wondering why things don't get better.", 
        "intTime": 20090520, 
        "postID": 24, 
        "quote": "", 
        "reply": "The People's Republik of Kalifornya is a microcosm of longer-term results of obamanation-like policies and Pelosi-like laws. This kind of economic disaster is not easily overcome. I wonder when we who live and vote more wisely in other states will have the obamanation's taxman pointing his gun at us for more \"contributions,\" this time to bail out the spendthrift government of Kalifornya? Nothing like reinforcing failure--insanely wondering why things don't get better.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 08:58:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "RRR52"
    }, 
    {
        "content": "What is Pelosi doing to help her state? Haven't heard anything from her about it. Is she too overwhelmed with Congress that she doesn't have time for her own state? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090520, 
        "postID": 25, 
        "quote": "", 
        "reply": "What is Pelosi doing to help her state? Haven't heard anything from her about it. Is she too overwhelmed with Congress that she doesn't have time for her own state? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:10:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "intTime": 20090520, 
        "postID": 26, 
        "quote": "", 
        "reply": "Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:39:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "The problem is that nobody here wants to pay more taxes -- understandably. The other option is cutting back funding for particular state programs and agencies. But nobody wants their particular pet programs cut back. Cut some OTHER programs, but don't touch MINE! Mine is more important than THEIRS! Californians, like all Americans, have to re-learn the concept of sacrificing a little to ensure a better future.", 
        "intTime": 20090520, 
        "postID": 27, 
        "quote": "", 
        "reply": "The problem is that nobody here wants to pay more taxes -- understandably. The other option is cutting back funding for particular state programs and agencies. But nobody wants their particular pet programs cut back. Cut some OTHER programs, but don't touch MINE! Mine is more important than THEIRS! Californians, like all Americans, have to re-learn the concept of sacrificing a little to ensure a better future.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:48:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "1WW"
    }, 
    {
        "content": "Dave! A question for you. Are you sure the Tax System is the same for property taxes? That seems crazy. A Millionaire that lives in Malibu with a 20,000 sq. ft. Mansion would pay the same in property taxes as someone would who lives in...hmmm..a small home in a LA suburb? That seems unfair to say the least. Will CA get a bailout? Anyone??", 
        "intTime": 20090520, 
        "postID": 28, 
        "quote": "", 
        "reply": "Dave! A question for you. Are you sure the Tax System is the same for property taxes? That seems crazy. A Millionaire that lives in Malibu with a 20,000 sq. ft. Mansion would pay the same in property taxes as someone would who lives in...hmmm..a small home in a LA suburb? That seems unfair to say the least. Will CA get a bailout? Anyone??", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:53:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by 1WW: The problem is that nobody here wants to pay more taxes -- understandably. The other option is cutting back funding for particular state programs and agencies. But nobody wants their particular pet programs cut back. Cut some OTHER programs, but don't touch MINE! Mine is more important than THEIRS! Californians, like all Americans, have to re-learn the concept of sacrificing a little to ensure a better future.", 
        "intTime": 20090520, 
        "postID": 29, 
        "quote": "Originally posted by 1WW: The problem is that nobody here wants to pay more taxes -- understandably. The other option is cutting back funding for particular state programs and agencies. But nobody wants their particular pet programs cut back. Cut some OTHER programs, but don't touch MINE! Mine is more important than THEIRS! Californians, like all Americans, have to re-learn the concept of sacrificing a little to ensure a better future.", 
        "reply": "", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:54:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Dave! A question for you. Are you sure the Tax System is the same for property taxes? That seems crazy. A Millionaire that lives in Malibu with a 20,000 sq. ft. Mansion would pay the same in property taxes as someone would who lives in...hmmm..a small home in a LA suburb? That seems unfair to say the least. Will CA get a bailout? Anyone?? My bad, I did not mean it like that. People with large estates pay more than those with a two family house. But they pay less proportionally. I have to pause and admit that I'm not up on California property tax rates, but here in Long Island New York, a two family house owner might very well find himself paying 10K a year in property taxes. This is quite a chunck of change for someone making forty, fifty K a year, as opposed to a millionare paying 50K on a twenty acre estate with a twenty room house. Working families of the Middle Income Middle Class have little disposable income left after paying such taxes. Moreover they're in a bind, because it's difficult for them to sell their homes. Now State taxes have to come from somewhere. If you don't have enough being made from income taxes, then the rest has to come from property taxes. I don't blame the people of California for being upset about all the money they pay for taxes, but in my opinion their rage was misdirected. Dave", 
        "intTime": 20090520, 
        "postID": 30, 
        "quote": "Originally posted by Agent991: Dave! A question for you. Are you sure the Tax System is the same for property taxes? That seems crazy. A Millionaire that lives in Malibu with a 20,000 sq. ft. Mansion would pay the same in property taxes as someone would who lives in...hmmm..a small home in a LA suburb? That seems unfair to say the least. Will CA get a bailout? Anyone??", 
        "reply": " My bad, I did not mean it like that. People with large estates pay more than those with a two family house. But they pay less proportionally. I have to pause and admit that I'm not up on California property tax rates, but here in Long Island New York, a two family house owner might very well find himself paying 10K a year in property taxes. This is quite a chunck of change for someone making forty, fifty K a year, as opposed to a millionare paying 50K on a twenty acre estate with a twenty room house. Working families of the Middle Income Middle Class have little disposable income left after paying such taxes. Moreover they're in a bind, because it's difficult for them to sell their homes. Now State taxes have to come from somewhere. If you don't have enough being made from income taxes, then the rest has to come from property taxes. I don't blame the people of California for being upset about all the money they pay for taxes, but in my opinion their rage was misdirected. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 10:43:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave So who has to fix this problem? Arnold, Nancy, both, or the whole US? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090520, 
        "postID": 31, 
        "quote": "Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "reply": " So who has to fix this problem? Arnold, Nancy, both, or the whole US? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 11:07:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave So who has to fix this problem? Arnold, Nancy, both, or the whole US? The problem has to be solved by the Governor and the State Legislature, and the people of California. The people have to recognise that if they want the services they have to have the money to pay for them, and they have to FORCE their local politicians to revamp the tax structure so that the burden is shifted from those without the money to those who HAVE the money. Plain and simple, the Middle Income Middle Class is paying far to much of their disposable income in taxes, and the wealthy who benefit even MORE for all these services have to pick up the load. And the same is true on a National Scale. As Federal Revenue has fallen, so has Federal aid to the States, and the States are left holding the bad that the Feds created. Dave", 
        "intTime": 20090520, 
        "postID": 32, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave So who has to fix this problem? Arnold, Nancy, both, or the whole US?", 
        "reply": " The problem has to be solved by the Governor and the State Legislature, and the people of California. The people have to recognise that if they want the services they have to have the money to pay for them, and they have to FORCE their local politicians to revamp the tax structure so that the burden is shifted from those without the money to those who HAVE the money. Plain and simple, the Middle Income Middle Class is paying far to much of their disposable income in taxes, and the wealthy who benefit even MORE for all these services have to pick up the load. And the same is true on a National Scale. As Federal Revenue has fallen, so has Federal aid to the States, and the States are left holding the bad that the Feds created. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 12:02:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies.", 
        "intTime": 20090520, 
        "postID": 33, 
        "quote": "Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "reply": " A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 12:52:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. Ahh the downside to socialism.... You actually have to pay for stuff.", 
        "intTime": 20090520, 
        "postID": 34, 
        "quote": "Originally posted by jwr6: quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies.", 
        "reply": " Ahh the downside to socialism.... You actually have to pay for stuff.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 13:00:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave quote: Originally posted by jwr6: A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Sure it's a regressive tax. And is RECOGNISED as a regressive tax. And this is because a flat tax always takes a higher percentage of disposable income Don't believe me? Here are the definitions posted on a business site. quote: Dictionary of Accounting Terms regressive tax system in which the percentage of income paid declines as income rises. Under a regressive system, as income rises from $15,000 to $100,000, the tax rate would fall from 20% to 10%, for example. In this sense, a regressive tax is the opposite of a progressive tax . The term is also used generally to refer to any tax system that favors the rich at the expense of the poor. The general sales tax with its fixed rate is considered regressive, because lower income groups tend to spend a higher percentage of their incomes on goods and services than higher income groups. Dictionary of Finance and Investment Terms regressive tax 1. system of taxation in which tax rates decline as the tax base rises. For example, a system that taxed values of $1,000 to $5,000 at 5%, $5,000 to $10,000 at 4% and so on would be regressive. A regressive tax is the opposite of a progressive tax . 2. tax system that results in a higher tax for the poor than for the rich, in terms of percentage of income. In this sense, a sales tax is regressive even though the same rate is applied to all sales, because people with lower incomes tend to spend most of their incomes on goods and services. Similarly, payroll taxes are regressive because they are borne largely by wage earners and not by higher income groups. Local property taxes also tend to be regressive because poorer people spend more of their incomes on housing costs, which are directly affected by property taxes. See also flat tax . Dictionary of Business Terms regressive tax tax that takes a higher percentage of the earnings of a low-income family than of those of a high-income family. A sales tax on food is considered regressive because low-income people pay the same amount of tax on a loaf of bread, for example, as do highincome people. \"http://www.allbusiness.com/glossaries/regressive-tax/4954317-1.html\" quote: Originally posted by jwr6: Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. This is becoming a cliche, despite all the evidence against it. The same loopholes, despite disclaimers, exist in any so called Flat taxes. The plain fact of the matter is that in States like New York, we used to have a progressive Income tax, and as that was dropped in favor of what amounts to a regressive flat tax, income dropped dramatically. Loopholes only go so far. And this is why the progressive tax system is under attack, has always been under attack by the wealthy - Who in fact secretly or openly fund all these Flat Tax proposals. quote: Originally posted by jwr6: Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. California has been in Big Trouble ever since they had their referendum barring new taxes. A recession merely made the problem worse. Dave", 
        "intTime": 20090520, 
        "postID": 35, 
        "quote": "Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "reply": " quote: Originally posted by jwr6: A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Sure it's a regressive tax. And is RECOGNISED as a regressive tax. And this is because a flat tax always takes a higher percentage of disposable income Don't believe me? Here are the definitions posted on a business site. quote: Dictionary of Accounting Terms regressive tax system in which the percentage of income paid declines as income rises. Under a regressive system, as income rises from $15,000 to $100,000, the tax rate would fall from 20% to 10%, for example. In this sense, a regressive tax is the opposite of a progressive tax . The term is also used generally to refer to any tax system that favors the rich at the expense of the poor. The general sales tax with its fixed rate is considered regressive, because lower income groups tend to spend a higher percentage of their incomes on goods and services than higher income groups. Dictionary of Finance and Investment Terms regressive tax 1. system of taxation in which tax rates decline as the tax base rises. For example, a system that taxed values of $1,000 to $5,000 at 5%, $5,000 to $10,000 at 4% and so on would be regressive. A regressive tax is the opposite of a progressive tax . 2. tax system that results in a higher tax for the poor than for the rich, in terms of percentage of income. In this sense, a sales tax is regressive even though the same rate is applied to all sales, because people with lower incomes tend to spend most of their incomes on goods and services. Similarly, payroll taxes are regressive because they are borne largely by wage earners and not by higher income groups. Local property taxes also tend to be regressive because poorer people spend more of their incomes on housing costs, which are directly affected by property taxes. See also flat tax . Dictionary of Business Terms regressive tax tax that takes a higher percentage of the earnings of a low-income family than of those of a high-income family. A sales tax on food is considered regressive because low-income people pay the same amount of tax on a loaf of bread, for example, as do highincome people. \"http://www.allbusiness.com/glossaries/regressive-tax/4954317-1.html\" quote: Originally posted by jwr6: Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. This is becoming a cliche, despite all the evidence against it. The same loopholes, despite disclaimers, exist in any so called Flat taxes. The plain fact of the matter is that in States like New York, we used to have a progressive Income tax, and as that was dropped in favor of what amounts to a regressive flat tax, income dropped dramatically. Loopholes only go so far. And this is why the progressive tax system is under attack, has always been under attack by the wealthy - Who in fact secretly or openly fund all these Flat Tax proposals. quote: Originally posted by jwr6: Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. California has been in Big Trouble ever since they had their referendum barring new taxes. A recession merely made the problem worse. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 13:42:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: Ahh the downside to socialism.... You actually have to pay for stuff. I wish we were talking about Socialism. We are talking about Capitalism where the costs of services are passed on to the Middle Income Middle Class, and the benefits are passed to the wealthy. Basically ANY system has to pay for what it wants. But with our present tax structure we just \"charge it,\" and that is what Republican policies have created, unbelievable massive debt. Dave", 
        "intTime": 20090520, 
        "postID": 36, 
        "quote": "Originally posted by NickBrand: Ahh the downside to socialism.... You actually have to pay for stuff.", 
        "reply": " I wish we were talking about Socialism. We are talking about Capitalism where the costs of services are passed on to the Middle Income Middle Class, and the benefits are passed to the wealthy. Basically ANY system has to pay for what it wants. But with our present tax structure we just \"charge it,\" and that is what Republican policies have created, unbelievable massive debt. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 13:46:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave quote: Originally posted by jwr6: A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Sure it's a regressive tax. And is RECOGNISED as a regressive tax. And this is because a flat tax always takes a higher percentage of disposable income Don't believe me? Here are the definitions posted on a business site. quote: Dictionary of Accounting Terms regressive tax system in which the percentage of income paid declines as income rises. Under a regressive system, as income rises from $15,000 to $100,000, the tax rate would fall from 20% to 10%, for example. In this sense, a regressive tax is the opposite of a progressive tax . The term is also used generally to refer to any tax system that favors the rich at the expense of the poor. The general sales tax with its fixed rate is considered regressive, because lower income groups tend to spend a higher percentage of their incomes on goods and services than higher income groups. Dictionary of Finance and Investment Terms regressive tax 1. system of taxation in which tax rates decline as the tax base rises. For example, a system that taxed values of $1,000 to $5,000 at 5%, $5,000 to $10,000 at 4% and so on would be regressive. A regressive tax is the opposite of a progressive tax . 2. tax system that results in a higher tax for the poor than for the rich, in terms of percentage of income. In this sense, a sales tax is regressive even though the same rate is applied to all sales, because people with lower incomes tend to spend most of their incomes on goods and services. Similarly, payroll taxes are regressive because they are borne largely by wage earners and not by higher income groups. Local property taxes also tend to be regressive because poorer people spend more of their incomes on housing costs, which are directly affected by property taxes. See also flat tax . Dictionary of Business Terms regressive tax tax that takes a higher percentage of the earnings of a low-income family than of those of a high-income family. A sales tax on food is considered regressive because low-income people pay the same amount of tax on a loaf of bread, for example, as do highincome people. \"http://www.allbusiness.com/glossaries/regressive-tax/4954317-1.html\" quote: Originally posted by jwr6: Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. This is becoming a cliche, despite all the evidence against it. The same loopholes, despite disclaimers, exist in any so called Flat taxes. The plain fact of the matter is that in States like New York, we used to have a progressive Income tax, and as that was dropped in favor of what amounts to a regressive flat tax, income dropped dramatically. Loopholes only go so far. And this is why the progressive tax system is under attack, has always been under attack by the wealthy - Who in fact secretly or openly fund all these Flat Tax proposals. quote: Originally posted by jwr6: Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. California has been in Big Trouble ever since they had their referendum barring new taxes. A recession merely made the problem worse. Dave Dave, I have asked you this a number of times but have never received an answer. In your opinion what percentage of income should the \"rich\" have to pay for you to consider them having paid their \"fair share\"?", 
        "intTime": 20090520, 
        "postID": 37, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave quote: Originally posted by jwr6: A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Sure it's a regressive tax. And is RECOGNISED as a regressive tax. And this is because a flat tax always takes a higher percentage of disposable income Don't believe me? Here are the definitions posted on a business site. quote: Dictionary of Accounting Terms regressive tax system in which the percentage of income paid declines as income rises. Under a regressive system, as income rises from $15,000 to $100,000, the tax rate would fall from 20% to 10%, for example. In this sense, a regressive tax is the opposite of a progressive tax . The term is also used generally to refer to any tax system that favors the rich at the expense of the poor. The general sales tax with its fixed rate is considered regressive, because lower income groups tend to spend a higher percentage of their incomes on goods and services than higher income groups. Dictionary of Finance and Investment Terms regressive tax 1. system of taxation in which tax rates decline as the tax base rises. For example, a system that taxed values of $1,000 to $5,000 at 5%, $5,000 to $10,000 at 4% and so on would be regressive. A regressive tax is the opposite of a progressive tax . 2. tax system that results in a higher tax for the poor than for the rich, in terms of percentage of income. In this sense, a sales tax is regressive even though the same rate is applied to all sales, because people with lower incomes tend to spend most of their incomes on goods and services. Similarly, payroll taxes are regressive because they are borne largely by wage earners and not by higher income groups. Local property taxes also tend to be regressive because poorer people spend more of their incomes on housing costs, which are directly affected by property taxes. See also flat tax . Dictionary of Business Terms regressive tax tax that takes a higher percentage of the earnings of a low-income family than of those of a high-income family. A sales tax on food is considered regressive because low-income people pay the same amount of tax on a loaf of bread, for example, as do highincome people. \"http://www.allbusiness.com/glossaries/regressive-tax/4954317-1.html\" quote: Originally posted by jwr6: Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. This is becoming a cliche, despite all the evidence against it. The same loopholes, despite disclaimers, exist in any so called Flat taxes. The plain fact of the matter is that in States like New York, we used to have a progressive Income tax, and as that was dropped in favor of what amounts to a regressive flat tax, income dropped dramatically. Loopholes only go so far. And this is why the progressive tax system is under attack, has always been under attack by the wealthy - Who in fact secretly or openly fund all these Flat Tax proposals. quote: Originally posted by jwr6: Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. California has been in Big Trouble ever since they had their referendum barring new taxes. A recession merely made the problem worse. Dave", 
        "reply": " Dave, I have asked you this a number of times but have never received an answer. In your opinion what percentage of income should the \"rich\" have to pay for you to consider them having paid their \"fair share\"?", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 13:48:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. That last one is a biggie! The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. Well, according to California tax tables, $40K (married) pays 4% and the millionaire pays 10.3%. Not the same. Now the person making $93K+ pays the same as someone making $900K+ (9.3% Married) and $47K+ pays the same as $999K (9.3%) and that could be addressed. In all California's range is 1% to 10.3% Probably some wiggle room there and maybe they can also look at what they buy each year in the form of all services. And now they're shafted. Darn, Dave; we agree on most of this Dave", 
        "intTime": 20090520, 
        "postID": 38, 
        "quote": "Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. That last one is a biggie! The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. Well, according to California tax tables, $40K (married) pays 4% and the millionaire pays 10.3%. Not the same. Now the person making $93K+ pays the same as someone making $900K+ (9.3% Married) and $47K+ pays the same as $999K (9.3%) and that could be addressed. In all California's range is 1% to 10.3% Probably some wiggle room there and maybe they can also look at what they buy each year in the form of all services. And now they're shafted. Darn, Dave; we agree on most of this Dave", 
        "reply": "", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 14:04:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: With 20 months left in office, California Gov. Arnold Schwarzenegger wants to leave behind a state that's governable. \"I came in here to fix what is broken in California,\" he said in an interview. In the past 12 months, California's tanking economy caused the state's budget deficit to balloon to $42 billion. A deeply polarized legislature spent 15 weeks squabbling over fiscal solutions as the budget hole deepened. The latest estimates suggest that by mid-2010, California will sink at least $15 billion further into the red. Rest here: \"http://online.wsj.com/article/SB123678004662495023.html\" If California tanks, what does that mean for the rest of the US? Arnold and Pelosi really did a number on the people of CA. But hey, what do you expect from a state that loves illegals, gays, gangs, Kobe Bryant, drugs, and non-military people.", 
        "intTime": 20090520, 
        "postID": 39, 
        "quote": "Originally posted by Anbar7: With 20 months left in office, California Gov. Arnold Schwarzenegger wants to leave behind a state that's governable. \"I came in here to fix what is broken in California,\" he said in an interview. In the past 12 months, California's tanking economy caused the state's budget deficit to balloon to $42 billion. A deeply polarized legislature spent 15 weeks squabbling over fiscal solutions as the budget hole deepened. The latest estimates suggest that by mid-2010, California will sink at least $15 billion further into the red. Rest here: \"http://online.wsj.com/article/SB123678004662495023.html\" If California tanks, what does that mean for the rest of the US?", 
        "reply": " Arnold and Pelosi really did a number on the people of CA. But hey, what do you expect from a state that loves illegals, gays, gangs, Kobe Bryant, drugs, and non-military people.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 14:26:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by stec74: Dave, I have asked you this a number of times but have never received an answer. In your opinion what percentage of income should the \"rich\" have to pay for you to consider them having paid their \"fair share\"? I've answeed your question before. You missed the post. Roughly Individuals making 150K or more should pay around 35 percent, those making more than 500K, about 50 percent, and those making more than a meg, 65 percent. This will give plenty of incentive for people to make big bucks, while at the same time paying their share. I would also suggest eliminating all, or almost all regressive taxes. However, I am certainly open to debate these figures. And of course these are for Federal taxes. Larger Federal taxes would allow the Feds to pick up more of the costs of roads, education and infrastructure - Since the impact of these affect the entire country and not just the individual State. Dave", 
        "intTime": 20090520, 
        "postID": 40, 
        "quote": "Originally posted by stec74: Dave, I have asked you this a number of times but have never received an answer. In your opinion what percentage of income should the \"rich\" have to pay for you to consider them having paid their \"fair share\"?", 
        "reply": " I've answeed your question before. You missed the post. Roughly Individuals making 150K or more should pay around 35 percent, those making more than 500K, about 50 percent, and those making more than a meg, 65 percent. This will give plenty of incentive for people to make big bucks, while at the same time paying their share. I would also suggest eliminating all, or almost all regressive taxes. However, I am certainly open to debate these figures. And of course these are for Federal taxes. Larger Federal taxes would allow the Feds to pick up more of the costs of roads, education and infrastructure - Since the impact of these affect the entire country and not just the individual State. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 14:34:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "With 20 months left in office, California Gov. Arnold Schwarzenegger wants to leave behind a state that's governable. \"I came in here to fix what is broken in California,\" he said in an interview. In the past 12 months, California's tanking economy caused the state's budget deficit to balloon to $42 billion. A deeply polarized legislature spent 15 weeks squabbling over fiscal solutions as the budget hole deepened. The latest estimates suggest that by mid-2010, California will sink at least $15 billion further into the red. Rest here: \"http://online.wsj.com/article/SB123678004662495023.html\" If California tanks, what does that mean for the rest of the US? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090520, 
        "postID": 41, 
        "quote": "", 
        "reply": "With 20 months left in office, California Gov. Arnold Schwarzenegger wants to leave behind a state that's governable. \"I came in here to fix what is broken in California,\" he said in an interview. In the past 12 months, California's tanking economy caused the state's budget deficit to balloon to $42 billion. A deeply polarized legislature spent 15 weeks squabbling over fiscal solutions as the budget hole deepened. The latest estimates suggest that by mid-2010, California will sink at least $15 billion further into the red. Rest here: \"http://online.wsj.com/article/SB123678004662495023.html\" If California tanks, what does that mean for the rest of the US? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 07:57:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Anbar7"
    }, 
    {
        "content": "What we should take away from this is that a neon blue state vote overwhelmingly red... No Taxes, No Borrowing....Stop the spending. I just wish they would go after everything and anything before they attacked the schools and public safety servants(Firefighters & Police.) Get rid of the damn welfare programs, if people want money they ought to go to work.", 
        "intTime": 20090520, 
        "postID": 42, 
        "quote": "", 
        "reply": "What we should take away from this is that a neon blue state vote overwhelmingly red... No Taxes, No Borrowing....Stop the spending. I just wish they would go after everything and anything before they attacked the schools and public safety servants(Firefighters & Police.) Get rid of the damn welfare programs, if people want money they ought to go to work.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 08:20:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Gross domestic product (GDP) California is responsible for 13% of the United States' gross domestic product (GDP). The state's GDP is at about $1.7 trillion (as of 2006). The GDP increased at an annual rate of 3.1% in the first quarter of 2005.[14] [edit] California's gross state product According to the California Department of Finance, California's gross state product is $1.543 trillion.*[15] According to the Bureau of Economic Analysis, California's gross state product is $1.727 trillion (2006 data, last updated Thursday, June 7, 2007).[16] According to the California Legislative Analyst's Office, \"California's gross state product is nearly $1.5 trillion...\" (\"Gross product in 2003\", released in 2004).[17] +http://en.wikipedia.org/wiki/Economy_of_California \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090520, 
        "postID": 43, 
        "quote": "", 
        "reply": "Gross domestic product (GDP) California is responsible for 13% of the United States' gross domestic product (GDP). The state's GDP is at about $1.7 trillion (as of 2006). The GDP increased at an annual rate of 3.1% in the first quarter of 2005.[14] [edit] California's gross state product According to the California Department of Finance, California's gross state product is $1.543 trillion.*[15] According to the Bureau of Economic Analysis, California's gross state product is $1.727 trillion (2006 data, last updated Thursday, June 7, 2007).[16] According to the California Legislative Analyst's Office, \"California's gross state product is nearly $1.5 trillion...\" (\"Gross product in 2003\", released in 2004).[17] +http://en.wikipedia.org/wiki/Economy_of_California \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 08:21:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "NSNN"
    }, 
    {
        "content": "The People's Republik of Kalifornya is a microcosm of longer-term results of obamanation-like policies and Pelosi-like laws. This kind of economic disaster is not easily overcome. I wonder when we who live and vote more wisely in other states will have the obamanation's taxman pointing his gun at us for more \"contributions,\" this time to bail out the spendthrift government of Kalifornya? Nothing like reinforcing failure--insanely wondering why things don't get better.", 
        "intTime": 20090520, 
        "postID": 44, 
        "quote": "", 
        "reply": "The People's Republik of Kalifornya is a microcosm of longer-term results of obamanation-like policies and Pelosi-like laws. This kind of economic disaster is not easily overcome. I wonder when we who live and vote more wisely in other states will have the obamanation's taxman pointing his gun at us for more \"contributions,\" this time to bail out the spendthrift government of Kalifornya? Nothing like reinforcing failure--insanely wondering why things don't get better.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 08:58:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "RRR52"
    }, 
    {
        "content": "What is Pelosi doing to help her state? Haven't heard anything from her about it. Is she too overwhelmed with Congress that she doesn't have time for her own state? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090520, 
        "postID": 45, 
        "quote": "", 
        "reply": "What is Pelosi doing to help her state? Haven't heard anything from her about it. Is she too overwhelmed with Congress that she doesn't have time for her own state? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:10:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "intTime": 20090520, 
        "postID": 46, 
        "quote": "", 
        "reply": "Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:39:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "The problem is that nobody here wants to pay more taxes -- understandably. The other option is cutting back funding for particular state programs and agencies. But nobody wants their particular pet programs cut back. Cut some OTHER programs, but don't touch MINE! Mine is more important than THEIRS! Californians, like all Americans, have to re-learn the concept of sacrificing a little to ensure a better future.", 
        "intTime": 20090520, 
        "postID": 47, 
        "quote": "", 
        "reply": "The problem is that nobody here wants to pay more taxes -- understandably. The other option is cutting back funding for particular state programs and agencies. But nobody wants their particular pet programs cut back. Cut some OTHER programs, but don't touch MINE! Mine is more important than THEIRS! Californians, like all Americans, have to re-learn the concept of sacrificing a little to ensure a better future.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:48:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "1WW"
    }, 
    {
        "content": "Dave! A question for you. Are you sure the Tax System is the same for property taxes? That seems crazy. A Millionaire that lives in Malibu with a 20,000 sq. ft. Mansion would pay the same in property taxes as someone would who lives in...hmmm..a small home in a LA suburb? That seems unfair to say the least. Will CA get a bailout? Anyone??", 
        "intTime": 20090520, 
        "postID": 48, 
        "quote": "", 
        "reply": "Dave! A question for you. Are you sure the Tax System is the same for property taxes? That seems crazy. A Millionaire that lives in Malibu with a 20,000 sq. ft. Mansion would pay the same in property taxes as someone would who lives in...hmmm..a small home in a LA suburb? That seems unfair to say the least. Will CA get a bailout? Anyone??", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:53:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by 1WW: The problem is that nobody here wants to pay more taxes -- understandably. The other option is cutting back funding for particular state programs and agencies. But nobody wants their particular pet programs cut back. Cut some OTHER programs, but don't touch MINE! Mine is more important than THEIRS! Californians, like all Americans, have to re-learn the concept of sacrificing a little to ensure a better future.", 
        "intTime": 20090520, 
        "postID": 49, 
        "quote": "Originally posted by 1WW: The problem is that nobody here wants to pay more taxes -- understandably. The other option is cutting back funding for particular state programs and agencies. But nobody wants their particular pet programs cut back. Cut some OTHER programs, but don't touch MINE! Mine is more important than THEIRS! Californians, like all Americans, have to re-learn the concept of sacrificing a little to ensure a better future.", 
        "reply": "", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:54:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Dave! A question for you. Are you sure the Tax System is the same for property taxes? That seems crazy. A Millionaire that lives in Malibu with a 20,000 sq. ft. Mansion would pay the same in property taxes as someone would who lives in...hmmm..a small home in a LA suburb? That seems unfair to say the least. Will CA get a bailout? Anyone?? My bad, I did not mean it like that. People with large estates pay more than those with a two family house. But they pay less proportionally. I have to pause and admit that I'm not up on California property tax rates, but here in Long Island New York, a two family house owner might very well find himself paying 10K a year in property taxes. This is quite a chunck of change for someone making forty, fifty K a year, as opposed to a millionare paying 50K on a twenty acre estate with a twenty room house. Working families of the Middle Income Middle Class have little disposable income left after paying such taxes. Moreover they're in a bind, because it's difficult for them to sell their homes. Now State taxes have to come from somewhere. If you don't have enough being made from income taxes, then the rest has to come from property taxes. I don't blame the people of California for being upset about all the money they pay for taxes, but in my opinion their rage was misdirected. Dave", 
        "intTime": 20090520, 
        "postID": 50, 
        "quote": "Originally posted by Agent991: Dave! A question for you. Are you sure the Tax System is the same for property taxes? That seems crazy. A Millionaire that lives in Malibu with a 20,000 sq. ft. Mansion would pay the same in property taxes as someone would who lives in...hmmm..a small home in a LA suburb? That seems unfair to say the least. Will CA get a bailout? Anyone??", 
        "reply": " My bad, I did not mean it like that. People with large estates pay more than those with a two family house. But they pay less proportionally. I have to pause and admit that I'm not up on California property tax rates, but here in Long Island New York, a two family house owner might very well find himself paying 10K a year in property taxes. This is quite a chunck of change for someone making forty, fifty K a year, as opposed to a millionare paying 50K on a twenty acre estate with a twenty room house. Working families of the Middle Income Middle Class have little disposable income left after paying such taxes. Moreover they're in a bind, because it's difficult for them to sell their homes. Now State taxes have to come from somewhere. If you don't have enough being made from income taxes, then the rest has to come from property taxes. I don't blame the people of California for being upset about all the money they pay for taxes, but in my opinion their rage was misdirected. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 10:43:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave So who has to fix this problem? Arnold, Nancy, both, or the whole US? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090520, 
        "postID": 51, 
        "quote": "Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "reply": " So who has to fix this problem? Arnold, Nancy, both, or the whole US? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 11:07:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave So who has to fix this problem? Arnold, Nancy, both, or the whole US? The problem has to be solved by the Governor and the State Legislature, and the people of California. The people have to recognise that if they want the services they have to have the money to pay for them, and they have to FORCE their local politicians to revamp the tax structure so that the burden is shifted from those without the money to those who HAVE the money. Plain and simple, the Middle Income Middle Class is paying far to much of their disposable income in taxes, and the wealthy who benefit even MORE for all these services have to pick up the load. And the same is true on a National Scale. As Federal Revenue has fallen, so has Federal aid to the States, and the States are left holding the bad that the Feds created. Dave", 
        "intTime": 20090520, 
        "postID": 52, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave So who has to fix this problem? Arnold, Nancy, both, or the whole US?", 
        "reply": " The problem has to be solved by the Governor and the State Legislature, and the people of California. The people have to recognise that if they want the services they have to have the money to pay for them, and they have to FORCE their local politicians to revamp the tax structure so that the burden is shifted from those without the money to those who HAVE the money. Plain and simple, the Middle Income Middle Class is paying far to much of their disposable income in taxes, and the wealthy who benefit even MORE for all these services have to pick up the load. And the same is true on a National Scale. As Federal Revenue has fallen, so has Federal aid to the States, and the States are left holding the bad that the Feds created. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 12:02:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies.", 
        "intTime": 20090520, 
        "postID": 53, 
        "quote": "Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "reply": " A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 12:52:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. Ahh the downside to socialism.... You actually have to pay for stuff.", 
        "intTime": 20090520, 
        "postID": 54, 
        "quote": "Originally posted by jwr6: quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies.", 
        "reply": " Ahh the downside to socialism.... You actually have to pay for stuff.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 13:00:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave quote: Originally posted by jwr6: A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Sure it's a regressive tax. And is RECOGNISED as a regressive tax. And this is because a flat tax always takes a higher percentage of disposable income Don't believe me? Here are the definitions posted on a business site. quote: Dictionary of Accounting Terms regressive tax system in which the percentage of income paid declines as income rises. Under a regressive system, as income rises from $15,000 to $100,000, the tax rate would fall from 20% to 10%, for example. In this sense, a regressive tax is the opposite of a progressive tax . The term is also used generally to refer to any tax system that favors the rich at the expense of the poor. The general sales tax with its fixed rate is considered regressive, because lower income groups tend to spend a higher percentage of their incomes on goods and services than higher income groups. Dictionary of Finance and Investment Terms regressive tax 1. system of taxation in which tax rates decline as the tax base rises. For example, a system that taxed values of $1,000 to $5,000 at 5%, $5,000 to $10,000 at 4% and so on would be regressive. A regressive tax is the opposite of a progressive tax . 2. tax system that results in a higher tax for the poor than for the rich, in terms of percentage of income. In this sense, a sales tax is regressive even though the same rate is applied to all sales, because people with lower incomes tend to spend most of their incomes on goods and services. Similarly, payroll taxes are regressive because they are borne largely by wage earners and not by higher income groups. Local property taxes also tend to be regressive because poorer people spend more of their incomes on housing costs, which are directly affected by property taxes. See also flat tax . Dictionary of Business Terms regressive tax tax that takes a higher percentage of the earnings of a low-income family than of those of a high-income family. A sales tax on food is considered regressive because low-income people pay the same amount of tax on a loaf of bread, for example, as do highincome people. \"http://www.allbusiness.com/glossaries/regressive-tax/4954317-1.html\" quote: Originally posted by jwr6: Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. This is becoming a cliche, despite all the evidence against it. The same loopholes, despite disclaimers, exist in any so called Flat taxes. The plain fact of the matter is that in States like New York, we used to have a progressive Income tax, and as that was dropped in favor of what amounts to a regressive flat tax, income dropped dramatically. Loopholes only go so far. And this is why the progressive tax system is under attack, has always been under attack by the wealthy - Who in fact secretly or openly fund all these Flat Tax proposals. quote: Originally posted by jwr6: Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. California has been in Big Trouble ever since they had their referendum barring new taxes. A recession merely made the problem worse. Dave", 
        "intTime": 20090520, 
        "postID": 55, 
        "quote": "Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "reply": " quote: Originally posted by jwr6: A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Sure it's a regressive tax. And is RECOGNISED as a regressive tax. And this is because a flat tax always takes a higher percentage of disposable income Don't believe me? Here are the definitions posted on a business site. quote: Dictionary of Accounting Terms regressive tax system in which the percentage of income paid declines as income rises. Under a regressive system, as income rises from $15,000 to $100,000, the tax rate would fall from 20% to 10%, for example. In this sense, a regressive tax is the opposite of a progressive tax . The term is also used generally to refer to any tax system that favors the rich at the expense of the poor. The general sales tax with its fixed rate is considered regressive, because lower income groups tend to spend a higher percentage of their incomes on goods and services than higher income groups. Dictionary of Finance and Investment Terms regressive tax 1. system of taxation in which tax rates decline as the tax base rises. For example, a system that taxed values of $1,000 to $5,000 at 5%, $5,000 to $10,000 at 4% and so on would be regressive. A regressive tax is the opposite of a progressive tax . 2. tax system that results in a higher tax for the poor than for the rich, in terms of percentage of income. In this sense, a sales tax is regressive even though the same rate is applied to all sales, because people with lower incomes tend to spend most of their incomes on goods and services. Similarly, payroll taxes are regressive because they are borne largely by wage earners and not by higher income groups. Local property taxes also tend to be regressive because poorer people spend more of their incomes on housing costs, which are directly affected by property taxes. See also flat tax . Dictionary of Business Terms regressive tax tax that takes a higher percentage of the earnings of a low-income family than of those of a high-income family. A sales tax on food is considered regressive because low-income people pay the same amount of tax on a loaf of bread, for example, as do highincome people. \"http://www.allbusiness.com/glossaries/regressive-tax/4954317-1.html\" quote: Originally posted by jwr6: Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. This is becoming a cliche, despite all the evidence against it. The same loopholes, despite disclaimers, exist in any so called Flat taxes. The plain fact of the matter is that in States like New York, we used to have a progressive Income tax, and as that was dropped in favor of what amounts to a regressive flat tax, income dropped dramatically. Loopholes only go so far. And this is why the progressive tax system is under attack, has always been under attack by the wealthy - Who in fact secretly or openly fund all these Flat Tax proposals. quote: Originally posted by jwr6: Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. California has been in Big Trouble ever since they had their referendum barring new taxes. A recession merely made the problem worse. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 13:42:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: Ahh the downside to socialism.... You actually have to pay for stuff. I wish we were talking about Socialism. We are talking about Capitalism where the costs of services are passed on to the Middle Income Middle Class, and the benefits are passed to the wealthy. Basically ANY system has to pay for what it wants. But with our present tax structure we just \"charge it,\" and that is what Republican policies have created, unbelievable massive debt. Dave", 
        "intTime": 20090520, 
        "postID": 56, 
        "quote": "Originally posted by NickBrand: Ahh the downside to socialism.... You actually have to pay for stuff.", 
        "reply": " I wish we were talking about Socialism. We are talking about Capitalism where the costs of services are passed on to the Middle Income Middle Class, and the benefits are passed to the wealthy. Basically ANY system has to pay for what it wants. But with our present tax structure we just \"charge it,\" and that is what Republican policies have created, unbelievable massive debt. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 13:46:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave quote: Originally posted by jwr6: A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Sure it's a regressive tax. And is RECOGNISED as a regressive tax. And this is because a flat tax always takes a higher percentage of disposable income Don't believe me? Here are the definitions posted on a business site. quote: Dictionary of Accounting Terms regressive tax system in which the percentage of income paid declines as income rises. Under a regressive system, as income rises from $15,000 to $100,000, the tax rate would fall from 20% to 10%, for example. In this sense, a regressive tax is the opposite of a progressive tax . The term is also used generally to refer to any tax system that favors the rich at the expense of the poor. The general sales tax with its fixed rate is considered regressive, because lower income groups tend to spend a higher percentage of their incomes on goods and services than higher income groups. Dictionary of Finance and Investment Terms regressive tax 1. system of taxation in which tax rates decline as the tax base rises. For example, a system that taxed values of $1,000 to $5,000 at 5%, $5,000 to $10,000 at 4% and so on would be regressive. A regressive tax is the opposite of a progressive tax . 2. tax system that results in a higher tax for the poor than for the rich, in terms of percentage of income. In this sense, a sales tax is regressive even though the same rate is applied to all sales, because people with lower incomes tend to spend most of their incomes on goods and services. Similarly, payroll taxes are regressive because they are borne largely by wage earners and not by higher income groups. Local property taxes also tend to be regressive because poorer people spend more of their incomes on housing costs, which are directly affected by property taxes. See also flat tax . Dictionary of Business Terms regressive tax tax that takes a higher percentage of the earnings of a low-income family than of those of a high-income family. A sales tax on food is considered regressive because low-income people pay the same amount of tax on a loaf of bread, for example, as do highincome people. \"http://www.allbusiness.com/glossaries/regressive-tax/4954317-1.html\" quote: Originally posted by jwr6: Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. This is becoming a cliche, despite all the evidence against it. The same loopholes, despite disclaimers, exist in any so called Flat taxes. The plain fact of the matter is that in States like New York, we used to have a progressive Income tax, and as that was dropped in favor of what amounts to a regressive flat tax, income dropped dramatically. Loopholes only go so far. And this is why the progressive tax system is under attack, has always been under attack by the wealthy - Who in fact secretly or openly fund all these Flat Tax proposals. quote: Originally posted by jwr6: Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. California has been in Big Trouble ever since they had their referendum barring new taxes. A recession merely made the problem worse. Dave Dave, I have asked you this a number of times but have never received an answer. In your opinion what percentage of income should the \"rich\" have to pay for you to consider them having paid their \"fair share\"?", 
        "intTime": 20090520, 
        "postID": 57, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave quote: Originally posted by jwr6: A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Sure it's a regressive tax. And is RECOGNISED as a regressive tax. And this is because a flat tax always takes a higher percentage of disposable income Don't believe me? Here are the definitions posted on a business site. quote: Dictionary of Accounting Terms regressive tax system in which the percentage of income paid declines as income rises. Under a regressive system, as income rises from $15,000 to $100,000, the tax rate would fall from 20% to 10%, for example. In this sense, a regressive tax is the opposite of a progressive tax . The term is also used generally to refer to any tax system that favors the rich at the expense of the poor. The general sales tax with its fixed rate is considered regressive, because lower income groups tend to spend a higher percentage of their incomes on goods and services than higher income groups. Dictionary of Finance and Investment Terms regressive tax 1. system of taxation in which tax rates decline as the tax base rises. For example, a system that taxed values of $1,000 to $5,000 at 5%, $5,000 to $10,000 at 4% and so on would be regressive. A regressive tax is the opposite of a progressive tax . 2. tax system that results in a higher tax for the poor than for the rich, in terms of percentage of income. In this sense, a sales tax is regressive even though the same rate is applied to all sales, because people with lower incomes tend to spend most of their incomes on goods and services. Similarly, payroll taxes are regressive because they are borne largely by wage earners and not by higher income groups. Local property taxes also tend to be regressive because poorer people spend more of their incomes on housing costs, which are directly affected by property taxes. See also flat tax . Dictionary of Business Terms regressive tax tax that takes a higher percentage of the earnings of a low-income family than of those of a high-income family. A sales tax on food is considered regressive because low-income people pay the same amount of tax on a loaf of bread, for example, as do highincome people. \"http://www.allbusiness.com/glossaries/regressive-tax/4954317-1.html\" quote: Originally posted by jwr6: Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. This is becoming a cliche, despite all the evidence against it. The same loopholes, despite disclaimers, exist in any so called Flat taxes. The plain fact of the matter is that in States like New York, we used to have a progressive Income tax, and as that was dropped in favor of what amounts to a regressive flat tax, income dropped dramatically. Loopholes only go so far. And this is why the progressive tax system is under attack, has always been under attack by the wealthy - Who in fact secretly or openly fund all these Flat Tax proposals. quote: Originally posted by jwr6: Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. California has been in Big Trouble ever since they had their referendum barring new taxes. A recession merely made the problem worse. Dave", 
        "reply": " Dave, I have asked you this a number of times but have never received an answer. In your opinion what percentage of income should the \"rich\" have to pay for you to consider them having paid their \"fair share\"?", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 13:48:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. That last one is a biggie! The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. Well, according to California tax tables, $40K (married) pays 4% and the millionaire pays 10.3%. Not the same. Now the person making $93K+ pays the same as someone making $900K+ (9.3% Married) and $47K+ pays the same as $999K (9.3%) and that could be addressed. In all California's range is 1% to 10.3% Probably some wiggle room there and maybe they can also look at what they buy each year in the form of all services. And now they're shafted. Darn, Dave; we agree on most of this Dave", 
        "intTime": 20090520, 
        "postID": 58, 
        "quote": "Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. That last one is a biggie! The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. Well, according to California tax tables, $40K (married) pays 4% and the millionaire pays 10.3%. Not the same. Now the person making $93K+ pays the same as someone making $900K+ (9.3% Married) and $47K+ pays the same as $999K (9.3%) and that could be addressed. In all California's range is 1% to 10.3% Probably some wiggle room there and maybe they can also look at what they buy each year in the form of all services. And now they're shafted. Darn, Dave; we agree on most of this Dave", 
        "reply": "", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 14:04:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: With 20 months left in office, California Gov. Arnold Schwarzenegger wants to leave behind a state that's governable. \"I came in here to fix what is broken in California,\" he said in an interview. In the past 12 months, California's tanking economy caused the state's budget deficit to balloon to $42 billion. A deeply polarized legislature spent 15 weeks squabbling over fiscal solutions as the budget hole deepened. The latest estimates suggest that by mid-2010, California will sink at least $15 billion further into the red. Rest here: \"http://online.wsj.com/article/SB123678004662495023.html\" If California tanks, what does that mean for the rest of the US? Arnold and Pelosi really did a number on the people of CA. But hey, what do you expect from a state that loves illegals, gays, gangs, Kobe Bryant, drugs, and non-military people.", 
        "intTime": 20090520, 
        "postID": 59, 
        "quote": "Originally posted by Anbar7: With 20 months left in office, California Gov. Arnold Schwarzenegger wants to leave behind a state that's governable. \"I came in here to fix what is broken in California,\" he said in an interview. In the past 12 months, California's tanking economy caused the state's budget deficit to balloon to $42 billion. A deeply polarized legislature spent 15 weeks squabbling over fiscal solutions as the budget hole deepened. The latest estimates suggest that by mid-2010, California will sink at least $15 billion further into the red. Rest here: \"http://online.wsj.com/article/SB123678004662495023.html\" If California tanks, what does that mean for the rest of the US?", 
        "reply": " Arnold and Pelosi really did a number on the people of CA. But hey, what do you expect from a state that loves illegals, gays, gangs, Kobe Bryant, drugs, and non-military people.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 14:26:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by stec74: Dave, I have asked you this a number of times but have never received an answer. In your opinion what percentage of income should the \"rich\" have to pay for you to consider them having paid their \"fair share\"? I've answeed your question before. You missed the post. Roughly Individuals making 150K or more should pay around 35 percent, those making more than 500K, about 50 percent, and those making more than a meg, 65 percent. This will give plenty of incentive for people to make big bucks, while at the same time paying their share. I would also suggest eliminating all, or almost all regressive taxes. However, I am certainly open to debate these figures. And of course these are for Federal taxes. Larger Federal taxes would allow the Feds to pick up more of the costs of roads, education and infrastructure - Since the impact of these affect the entire country and not just the individual State. Dave", 
        "intTime": 20090520, 
        "postID": 60, 
        "quote": "Originally posted by stec74: Dave, I have asked you this a number of times but have never received an answer. In your opinion what percentage of income should the \"rich\" have to pay for you to consider them having paid their \"fair share\"?", 
        "reply": " I've answeed your question before. You missed the post. Roughly Individuals making 150K or more should pay around 35 percent, those making more than 500K, about 50 percent, and those making more than a meg, 65 percent. This will give plenty of incentive for people to make big bucks, while at the same time paying their share. I would also suggest eliminating all, or almost all regressive taxes. However, I am certainly open to debate these figures. And of course these are for Federal taxes. Larger Federal taxes would allow the Feds to pick up more of the costs of roads, education and infrastructure - Since the impact of these affect the entire country and not just the individual State. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 14:34:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "With 20 months left in office, California Gov. Arnold Schwarzenegger wants to leave behind a state that's governable. \"I came in here to fix what is broken in California,\" he said in an interview. In the past 12 months, California's tanking economy caused the state's budget deficit to balloon to $42 billion. A deeply polarized legislature spent 15 weeks squabbling over fiscal solutions as the budget hole deepened. The latest estimates suggest that by mid-2010, California will sink at least $15 billion further into the red. Rest here: \"http://online.wsj.com/article/SB123678004662495023.html\" If California tanks, what does that mean for the rest of the US? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090520, 
        "postID": 61, 
        "quote": "", 
        "reply": "With 20 months left in office, California Gov. Arnold Schwarzenegger wants to leave behind a state that's governable. \"I came in here to fix what is broken in California,\" he said in an interview. In the past 12 months, California's tanking economy caused the state's budget deficit to balloon to $42 billion. A deeply polarized legislature spent 15 weeks squabbling over fiscal solutions as the budget hole deepened. The latest estimates suggest that by mid-2010, California will sink at least $15 billion further into the red. Rest here: \"http://online.wsj.com/article/SB123678004662495023.html\" If California tanks, what does that mean for the rest of the US? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 07:57:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Anbar7"
    }, 
    {
        "content": "What we should take away from this is that a neon blue state vote overwhelmingly red... No Taxes, No Borrowing....Stop the spending. I just wish they would go after everything and anything before they attacked the schools and public safety servants(Firefighters & Police.) Get rid of the damn welfare programs, if people want money they ought to go to work.", 
        "intTime": 20090520, 
        "postID": 62, 
        "quote": "", 
        "reply": "What we should take away from this is that a neon blue state vote overwhelmingly red... No Taxes, No Borrowing....Stop the spending. I just wish they would go after everything and anything before they attacked the schools and public safety servants(Firefighters & Police.) Get rid of the damn welfare programs, if people want money they ought to go to work.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 08:20:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Gross domestic product (GDP) California is responsible for 13% of the United States' gross domestic product (GDP). The state's GDP is at about $1.7 trillion (as of 2006). The GDP increased at an annual rate of 3.1% in the first quarter of 2005.[14] [edit] California's gross state product According to the California Department of Finance, California's gross state product is $1.543 trillion.*[15] According to the Bureau of Economic Analysis, California's gross state product is $1.727 trillion (2006 data, last updated Thursday, June 7, 2007).[16] According to the California Legislative Analyst's Office, \"California's gross state product is nearly $1.5 trillion...\" (\"Gross product in 2003\", released in 2004).[17] +http://en.wikipedia.org/wiki/Economy_of_California \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090520, 
        "postID": 63, 
        "quote": "", 
        "reply": "Gross domestic product (GDP) California is responsible for 13% of the United States' gross domestic product (GDP). The state's GDP is at about $1.7 trillion (as of 2006). The GDP increased at an annual rate of 3.1% in the first quarter of 2005.[14] [edit] California's gross state product According to the California Department of Finance, California's gross state product is $1.543 trillion.*[15] According to the Bureau of Economic Analysis, California's gross state product is $1.727 trillion (2006 data, last updated Thursday, June 7, 2007).[16] According to the California Legislative Analyst's Office, \"California's gross state product is nearly $1.5 trillion...\" (\"Gross product in 2003\", released in 2004).[17] +http://en.wikipedia.org/wiki/Economy_of_California \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 08:21:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "NSNN"
    }, 
    {
        "content": "The People's Republik of Kalifornya is a microcosm of longer-term results of obamanation-like policies and Pelosi-like laws. This kind of economic disaster is not easily overcome. I wonder when we who live and vote more wisely in other states will have the obamanation's taxman pointing his gun at us for more \"contributions,\" this time to bail out the spendthrift government of Kalifornya? Nothing like reinforcing failure--insanely wondering why things don't get better.", 
        "intTime": 20090520, 
        "postID": 64, 
        "quote": "", 
        "reply": "The People's Republik of Kalifornya is a microcosm of longer-term results of obamanation-like policies and Pelosi-like laws. This kind of economic disaster is not easily overcome. I wonder when we who live and vote more wisely in other states will have the obamanation's taxman pointing his gun at us for more \"contributions,\" this time to bail out the spendthrift government of Kalifornya? Nothing like reinforcing failure--insanely wondering why things don't get better.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 08:58:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "RRR52"
    }, 
    {
        "content": "What is Pelosi doing to help her state? Haven't heard anything from her about it. Is she too overwhelmed with Congress that she doesn't have time for her own state? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090520, 
        "postID": 65, 
        "quote": "", 
        "reply": "What is Pelosi doing to help her state? Haven't heard anything from her about it. Is she too overwhelmed with Congress that she doesn't have time for her own state? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:10:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "intTime": 20090520, 
        "postID": 66, 
        "quote": "", 
        "reply": "Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:39:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "The problem is that nobody here wants to pay more taxes -- understandably. The other option is cutting back funding for particular state programs and agencies. But nobody wants their particular pet programs cut back. Cut some OTHER programs, but don't touch MINE! Mine is more important than THEIRS! Californians, like all Americans, have to re-learn the concept of sacrificing a little to ensure a better future.", 
        "intTime": 20090520, 
        "postID": 67, 
        "quote": "", 
        "reply": "The problem is that nobody here wants to pay more taxes -- understandably. The other option is cutting back funding for particular state programs and agencies. But nobody wants their particular pet programs cut back. Cut some OTHER programs, but don't touch MINE! Mine is more important than THEIRS! Californians, like all Americans, have to re-learn the concept of sacrificing a little to ensure a better future.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:48:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "1WW"
    }, 
    {
        "content": "Dave! A question for you. Are you sure the Tax System is the same for property taxes? That seems crazy. A Millionaire that lives in Malibu with a 20,000 sq. ft. Mansion would pay the same in property taxes as someone would who lives in...hmmm..a small home in a LA suburb? That seems unfair to say the least. Will CA get a bailout? Anyone??", 
        "intTime": 20090520, 
        "postID": 68, 
        "quote": "", 
        "reply": "Dave! A question for you. Are you sure the Tax System is the same for property taxes? That seems crazy. A Millionaire that lives in Malibu with a 20,000 sq. ft. Mansion would pay the same in property taxes as someone would who lives in...hmmm..a small home in a LA suburb? That seems unfair to say the least. Will CA get a bailout? Anyone??", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:53:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by 1WW: The problem is that nobody here wants to pay more taxes -- understandably. The other option is cutting back funding for particular state programs and agencies. But nobody wants their particular pet programs cut back. Cut some OTHER programs, but don't touch MINE! Mine is more important than THEIRS! Californians, like all Americans, have to re-learn the concept of sacrificing a little to ensure a better future.", 
        "intTime": 20090520, 
        "postID": 69, 
        "quote": "Originally posted by 1WW: The problem is that nobody here wants to pay more taxes -- understandably. The other option is cutting back funding for particular state programs and agencies. But nobody wants their particular pet programs cut back. Cut some OTHER programs, but don't touch MINE! Mine is more important than THEIRS! Californians, like all Americans, have to re-learn the concept of sacrificing a little to ensure a better future.", 
        "reply": "", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 09:54:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Agent991: Dave! A question for you. Are you sure the Tax System is the same for property taxes? That seems crazy. A Millionaire that lives in Malibu with a 20,000 sq. ft. Mansion would pay the same in property taxes as someone would who lives in...hmmm..a small home in a LA suburb? That seems unfair to say the least. Will CA get a bailout? Anyone?? My bad, I did not mean it like that. People with large estates pay more than those with a two family house. But they pay less proportionally. I have to pause and admit that I'm not up on California property tax rates, but here in Long Island New York, a two family house owner might very well find himself paying 10K a year in property taxes. This is quite a chunck of change for someone making forty, fifty K a year, as opposed to a millionare paying 50K on a twenty acre estate with a twenty room house. Working families of the Middle Income Middle Class have little disposable income left after paying such taxes. Moreover they're in a bind, because it's difficult for them to sell their homes. Now State taxes have to come from somewhere. If you don't have enough being made from income taxes, then the rest has to come from property taxes. I don't blame the people of California for being upset about all the money they pay for taxes, but in my opinion their rage was misdirected. Dave", 
        "intTime": 20090520, 
        "postID": 70, 
        "quote": "Originally posted by Agent991: Dave! A question for you. Are you sure the Tax System is the same for property taxes? That seems crazy. A Millionaire that lives in Malibu with a 20,000 sq. ft. Mansion would pay the same in property taxes as someone would who lives in...hmmm..a small home in a LA suburb? That seems unfair to say the least. Will CA get a bailout? Anyone??", 
        "reply": " My bad, I did not mean it like that. People with large estates pay more than those with a two family house. But they pay less proportionally. I have to pause and admit that I'm not up on California property tax rates, but here in Long Island New York, a two family house owner might very well find himself paying 10K a year in property taxes. This is quite a chunck of change for someone making forty, fifty K a year, as opposed to a millionare paying 50K on a twenty acre estate with a twenty room house. Working families of the Middle Income Middle Class have little disposable income left after paying such taxes. Moreover they're in a bind, because it's difficult for them to sell their homes. Now State taxes have to come from somewhere. If you don't have enough being made from income taxes, then the rest has to come from property taxes. I don't blame the people of California for being upset about all the money they pay for taxes, but in my opinion their rage was misdirected. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 10:43:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave So who has to fix this problem? Arnold, Nancy, both, or the whole US? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090520, 
        "postID": 71, 
        "quote": "Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "reply": " So who has to fix this problem? Arnold, Nancy, both, or the whole US? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 11:07:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave So who has to fix this problem? Arnold, Nancy, both, or the whole US? The problem has to be solved by the Governor and the State Legislature, and the people of California. The people have to recognise that if they want the services they have to have the money to pay for them, and they have to FORCE their local politicians to revamp the tax structure so that the burden is shifted from those without the money to those who HAVE the money. Plain and simple, the Middle Income Middle Class is paying far to much of their disposable income in taxes, and the wealthy who benefit even MORE for all these services have to pick up the load. And the same is true on a National Scale. As Federal Revenue has fallen, so has Federal aid to the States, and the States are left holding the bad that the Feds created. Dave", 
        "intTime": 20090520, 
        "postID": 72, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave So who has to fix this problem? Arnold, Nancy, both, or the whole US?", 
        "reply": " The problem has to be solved by the Governor and the State Legislature, and the people of California. The people have to recognise that if they want the services they have to have the money to pay for them, and they have to FORCE their local politicians to revamp the tax structure so that the burden is shifted from those without the money to those who HAVE the money. Plain and simple, the Middle Income Middle Class is paying far to much of their disposable income in taxes, and the wealthy who benefit even MORE for all these services have to pick up the load. And the same is true on a National Scale. As Federal Revenue has fallen, so has Federal aid to the States, and the States are left holding the bad that the Feds created. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 12:02:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies.", 
        "intTime": 20090520, 
        "postID": 73, 
        "quote": "Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "reply": " A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 12:52:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. Ahh the downside to socialism.... You actually have to pay for stuff.", 
        "intTime": 20090520, 
        "postID": 74, 
        "quote": "Originally posted by jwr6: quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies.", 
        "reply": " Ahh the downside to socialism.... You actually have to pay for stuff.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 13:00:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave quote: Originally posted by jwr6: A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Sure it's a regressive tax. And is RECOGNISED as a regressive tax. And this is because a flat tax always takes a higher percentage of disposable income Don't believe me? Here are the definitions posted on a business site. quote: Dictionary of Accounting Terms regressive tax system in which the percentage of income paid declines as income rises. Under a regressive system, as income rises from $15,000 to $100,000, the tax rate would fall from 20% to 10%, for example. In this sense, a regressive tax is the opposite of a progressive tax . The term is also used generally to refer to any tax system that favors the rich at the expense of the poor. The general sales tax with its fixed rate is considered regressive, because lower income groups tend to spend a higher percentage of their incomes on goods and services than higher income groups. Dictionary of Finance and Investment Terms regressive tax 1. system of taxation in which tax rates decline as the tax base rises. For example, a system that taxed values of $1,000 to $5,000 at 5%, $5,000 to $10,000 at 4% and so on would be regressive. A regressive tax is the opposite of a progressive tax . 2. tax system that results in a higher tax for the poor than for the rich, in terms of percentage of income. In this sense, a sales tax is regressive even though the same rate is applied to all sales, because people with lower incomes tend to spend most of their incomes on goods and services. Similarly, payroll taxes are regressive because they are borne largely by wage earners and not by higher income groups. Local property taxes also tend to be regressive because poorer people spend more of their incomes on housing costs, which are directly affected by property taxes. See also flat tax . Dictionary of Business Terms regressive tax tax that takes a higher percentage of the earnings of a low-income family than of those of a high-income family. A sales tax on food is considered regressive because low-income people pay the same amount of tax on a loaf of bread, for example, as do highincome people. \"http://www.allbusiness.com/glossaries/regressive-tax/4954317-1.html\" quote: Originally posted by jwr6: Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. This is becoming a cliche, despite all the evidence against it. The same loopholes, despite disclaimers, exist in any so called Flat taxes. The plain fact of the matter is that in States like New York, we used to have a progressive Income tax, and as that was dropped in favor of what amounts to a regressive flat tax, income dropped dramatically. Loopholes only go so far. And this is why the progressive tax system is under attack, has always been under attack by the wealthy - Who in fact secretly or openly fund all these Flat Tax proposals. quote: Originally posted by jwr6: Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. California has been in Big Trouble ever since they had their referendum barring new taxes. A recession merely made the problem worse. Dave", 
        "intTime": 20090520, 
        "postID": 75, 
        "quote": "Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave", 
        "reply": " quote: Originally posted by jwr6: A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Sure it's a regressive tax. And is RECOGNISED as a regressive tax. And this is because a flat tax always takes a higher percentage of disposable income Don't believe me? Here are the definitions posted on a business site. quote: Dictionary of Accounting Terms regressive tax system in which the percentage of income paid declines as income rises. Under a regressive system, as income rises from $15,000 to $100,000, the tax rate would fall from 20% to 10%, for example. In this sense, a regressive tax is the opposite of a progressive tax . The term is also used generally to refer to any tax system that favors the rich at the expense of the poor. The general sales tax with its fixed rate is considered regressive, because lower income groups tend to spend a higher percentage of their incomes on goods and services than higher income groups. Dictionary of Finance and Investment Terms regressive tax 1. system of taxation in which tax rates decline as the tax base rises. For example, a system that taxed values of $1,000 to $5,000 at 5%, $5,000 to $10,000 at 4% and so on would be regressive. A regressive tax is the opposite of a progressive tax . 2. tax system that results in a higher tax for the poor than for the rich, in terms of percentage of income. In this sense, a sales tax is regressive even though the same rate is applied to all sales, because people with lower incomes tend to spend most of their incomes on goods and services. Similarly, payroll taxes are regressive because they are borne largely by wage earners and not by higher income groups. Local property taxes also tend to be regressive because poorer people spend more of their incomes on housing costs, which are directly affected by property taxes. See also flat tax . Dictionary of Business Terms regressive tax tax that takes a higher percentage of the earnings of a low-income family than of those of a high-income family. A sales tax on food is considered regressive because low-income people pay the same amount of tax on a loaf of bread, for example, as do highincome people. \"http://www.allbusiness.com/glossaries/regressive-tax/4954317-1.html\" quote: Originally posted by jwr6: Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. This is becoming a cliche, despite all the evidence against it. The same loopholes, despite disclaimers, exist in any so called Flat taxes. The plain fact of the matter is that in States like New York, we used to have a progressive Income tax, and as that was dropped in favor of what amounts to a regressive flat tax, income dropped dramatically. Loopholes only go so far. And this is why the progressive tax system is under attack, has always been under attack by the wealthy - Who in fact secretly or openly fund all these Flat Tax proposals. quote: Originally posted by jwr6: Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. California has been in Big Trouble ever since they had their referendum barring new taxes. A recession merely made the problem worse. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 13:42:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: Ahh the downside to socialism.... You actually have to pay for stuff. I wish we were talking about Socialism. We are talking about Capitalism where the costs of services are passed on to the Middle Income Middle Class, and the benefits are passed to the wealthy. Basically ANY system has to pay for what it wants. But with our present tax structure we just \"charge it,\" and that is what Republican policies have created, unbelievable massive debt. Dave", 
        "intTime": 20090520, 
        "postID": 76, 
        "quote": "Originally posted by NickBrand: Ahh the downside to socialism.... You actually have to pay for stuff.", 
        "reply": " I wish we were talking about Socialism. We are talking about Capitalism where the costs of services are passed on to the Middle Income Middle Class, and the benefits are passed to the wealthy. Basically ANY system has to pay for what it wants. But with our present tax structure we just \"charge it,\" and that is what Republican policies have created, unbelievable massive debt. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 13:46:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave quote: Originally posted by jwr6: A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Sure it's a regressive tax. And is RECOGNISED as a regressive tax. And this is because a flat tax always takes a higher percentage of disposable income Don't believe me? Here are the definitions posted on a business site. quote: Dictionary of Accounting Terms regressive tax system in which the percentage of income paid declines as income rises. Under a regressive system, as income rises from $15,000 to $100,000, the tax rate would fall from 20% to 10%, for example. In this sense, a regressive tax is the opposite of a progressive tax . The term is also used generally to refer to any tax system that favors the rich at the expense of the poor. The general sales tax with its fixed rate is considered regressive, because lower income groups tend to spend a higher percentage of their incomes on goods and services than higher income groups. Dictionary of Finance and Investment Terms regressive tax 1. system of taxation in which tax rates decline as the tax base rises. For example, a system that taxed values of $1,000 to $5,000 at 5%, $5,000 to $10,000 at 4% and so on would be regressive. A regressive tax is the opposite of a progressive tax . 2. tax system that results in a higher tax for the poor than for the rich, in terms of percentage of income. In this sense, a sales tax is regressive even though the same rate is applied to all sales, because people with lower incomes tend to spend most of their incomes on goods and services. Similarly, payroll taxes are regressive because they are borne largely by wage earners and not by higher income groups. Local property taxes also tend to be regressive because poorer people spend more of their incomes on housing costs, which are directly affected by property taxes. See also flat tax . Dictionary of Business Terms regressive tax tax that takes a higher percentage of the earnings of a low-income family than of those of a high-income family. A sales tax on food is considered regressive because low-income people pay the same amount of tax on a loaf of bread, for example, as do highincome people. \"http://www.allbusiness.com/glossaries/regressive-tax/4954317-1.html\" quote: Originally posted by jwr6: Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. This is becoming a cliche, despite all the evidence against it. The same loopholes, despite disclaimers, exist in any so called Flat taxes. The plain fact of the matter is that in States like New York, we used to have a progressive Income tax, and as that was dropped in favor of what amounts to a regressive flat tax, income dropped dramatically. Loopholes only go so far. And this is why the progressive tax system is under attack, has always been under attack by the wealthy - Who in fact secretly or openly fund all these Flat Tax proposals. quote: Originally posted by jwr6: Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. California has been in Big Trouble ever since they had their referendum barring new taxes. A recession merely made the problem worse. Dave Dave, I have asked you this a number of times but have never received an answer. In your opinion what percentage of income should the \"rich\" have to pay for you to consider them having paid their \"fair share\"?", 
        "intTime": 20090520, 
        "postID": 77, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Grachus: The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. And now they're shafted. Dave quote: Originally posted by jwr6: A system in which everyone pays the same percentage is NOT regressive. It's flat. You can argue that someone making 40k paying the same percentage as someone making 1 million affects the 40k earner more, but that's a matter of opinion, and it depends on where the 2 wage earners spend their after-tax income. Regressive would be if the 40k earner paid a higher percentage than the 1 mil earner. Sure it's a regressive tax. And is RECOGNISED as a regressive tax. And this is because a flat tax always takes a higher percentage of disposable income Don't believe me? Here are the definitions posted on a business site. quote: Dictionary of Accounting Terms regressive tax system in which the percentage of income paid declines as income rises. Under a regressive system, as income rises from $15,000 to $100,000, the tax rate would fall from 20% to 10%, for example. In this sense, a regressive tax is the opposite of a progressive tax . The term is also used generally to refer to any tax system that favors the rich at the expense of the poor. The general sales tax with its fixed rate is considered regressive, because lower income groups tend to spend a higher percentage of their incomes on goods and services than higher income groups. Dictionary of Finance and Investment Terms regressive tax 1. system of taxation in which tax rates decline as the tax base rises. For example, a system that taxed values of $1,000 to $5,000 at 5%, $5,000 to $10,000 at 4% and so on would be regressive. A regressive tax is the opposite of a progressive tax . 2. tax system that results in a higher tax for the poor than for the rich, in terms of percentage of income. In this sense, a sales tax is regressive even though the same rate is applied to all sales, because people with lower incomes tend to spend most of their incomes on goods and services. Similarly, payroll taxes are regressive because they are borne largely by wage earners and not by higher income groups. Local property taxes also tend to be regressive because poorer people spend more of their incomes on housing costs, which are directly affected by property taxes. See also flat tax . Dictionary of Business Terms regressive tax tax that takes a higher percentage of the earnings of a low-income family than of those of a high-income family. A sales tax on food is considered regressive because low-income people pay the same amount of tax on a loaf of bread, for example, as do highincome people. \"http://www.allbusiness.com/glossaries/regressive-tax/4954317-1.html\" quote: Originally posted by jwr6: Changing to a progressive tax system which charges the wealthy a higher % won't bring in significantly more money (the wealthy have access to the accountants to avoid paying anything more via loopholes which are ALWAYS left in any progressive tax system). The only thing it will do is get the electorate to think they should have more money for more services, whether the money is there or not...they will merely vote in MORE services without the tax stream to fund them. This is becoming a cliche, despite all the evidence against it. The same loopholes, despite disclaimers, exist in any so called Flat taxes. The plain fact of the matter is that in States like New York, we used to have a progressive Income tax, and as that was dropped in favor of what amounts to a regressive flat tax, income dropped dramatically. Loopholes only go so far. And this is why the progressive tax system is under attack, has always been under attack by the wealthy - Who in fact secretly or openly fund all these Flat Tax proposals. quote: Originally posted by jwr6: Cali's problem is not a flat versus progressive tax plan. Cali's problem is that they are a hige economy themselves...probably in the top 10 in the world. They got used to big bucks coming in from those businesses. Unfortunately, a recession hits the businesses hard, reduces that tax stream. The people don't want more taxes on business or the wealthy...those two entities can always pack up and take their jobs and bank accounts elsewhere. There are a LOT of coastal states with lower taxes that would LOVE to take jobs and businesses away from Cali...and dropping higher taxesnon them might be just the thing to convince them to move. While \"soak the rich and big business\" is a great liberal rallying cry, they aren't going to kill their golden goose. Californians won't \"get it\" until they have to start selling state parks to the Chinese to pay for all their state-provided lickies and chewies. California has been in Big Trouble ever since they had their referendum barring new taxes. A recession merely made the problem worse. Dave", 
        "reply": " Dave, I have asked you this a number of times but have never received an answer. In your opinion what percentage of income should the \"rich\" have to pay for you to consider them having paid their \"fair share\"?", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 13:48:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. That last one is a biggie! The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. Well, according to California tax tables, $40K (married) pays 4% and the millionaire pays 10.3%. Not the same. Now the person making $93K+ pays the same as someone making $900K+ (9.3% Married) and $47K+ pays the same as $999K (9.3%) and that could be addressed. In all California's range is 1% to 10.3% Probably some wiggle room there and maybe they can also look at what they buy each year in the form of all services. And now they're shafted. Darn, Dave; we agree on most of this Dave", 
        "intTime": 20090520, 
        "postID": 78, 
        "quote": "Originally posted by Grachus: Californias problems have a very simple origin. The public wants vast servives from the State, but the public voted to ban new taxes. The people voted for this under the impression that all their taxes were going to welfare, and didn't realise that welfare amounted to a pile of beans next to the real costs of Education, roads, power, and in California, water. That last one is a biggie! The people did have a legitimate beef, because Californias tax structure is a regressive one. So for example someone making forty K, is charged almost the same percentage on their income tax as someone making ten billion. The same for property taxes. But instead of blaming the tax structure which gives the wealthy a free ride, they blammed taxes themselves. Well, according to California tax tables, $40K (married) pays 4% and the millionaire pays 10.3%. Not the same. Now the person making $93K+ pays the same as someone making $900K+ (9.3% Married) and $47K+ pays the same as $999K (9.3%) and that could be addressed. In all California's range is 1% to 10.3% Probably some wiggle room there and maybe they can also look at what they buy each year in the form of all services. And now they're shafted. Darn, Dave; we agree on most of this Dave", 
        "reply": "", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 14:04:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: With 20 months left in office, California Gov. Arnold Schwarzenegger wants to leave behind a state that's governable. \"I came in here to fix what is broken in California,\" he said in an interview. In the past 12 months, California's tanking economy caused the state's budget deficit to balloon to $42 billion. A deeply polarized legislature spent 15 weeks squabbling over fiscal solutions as the budget hole deepened. The latest estimates suggest that by mid-2010, California will sink at least $15 billion further into the red. Rest here: \"http://online.wsj.com/article/SB123678004662495023.html\" If California tanks, what does that mean for the rest of the US? Arnold and Pelosi really did a number on the people of CA. But hey, what do you expect from a state that loves illegals, gays, gangs, Kobe Bryant, drugs, and non-military people.", 
        "intTime": 20090520, 
        "postID": 79, 
        "quote": "Originally posted by Anbar7: With 20 months left in office, California Gov. Arnold Schwarzenegger wants to leave behind a state that's governable. \"I came in here to fix what is broken in California,\" he said in an interview. In the past 12 months, California's tanking economy caused the state's budget deficit to balloon to $42 billion. A deeply polarized legislature spent 15 weeks squabbling over fiscal solutions as the budget hole deepened. The latest estimates suggest that by mid-2010, California will sink at least $15 billion further into the red. Rest here: \"http://online.wsj.com/article/SB123678004662495023.html\" If California tanks, what does that mean for the rest of the US?", 
        "reply": " Arnold and Pelosi really did a number on the people of CA. But hey, what do you expect from a state that loves illegals, gays, gangs, Kobe Bryant, drugs, and non-military people.", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 14:26:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by stec74: Dave, I have asked you this a number of times but have never received an answer. In your opinion what percentage of income should the \"rich\" have to pay for you to consider them having paid their \"fair share\"? I've answeed your question before. You missed the post. Roughly Individuals making 150K or more should pay around 35 percent, those making more than 500K, about 50 percent, and those making more than a meg, 65 percent. This will give plenty of incentive for people to make big bucks, while at the same time paying their share. I would also suggest eliminating all, or almost all regressive taxes. However, I am certainly open to debate these figures. And of course these are for Federal taxes. Larger Federal taxes would allow the Feds to pick up more of the costs of roads, education and infrastructure - Since the impact of these affect the entire country and not just the individual State. Dave", 
        "intTime": 20090520, 
        "postID": 80, 
        "quote": "Originally posted by stec74: Dave, I have asked you this a number of times but have never received an answer. In your opinion what percentage of income should the \"rich\" have to pay for you to consider them having paid their \"fair share\"?", 
        "reply": " I've answeed your question before. You missed the post. Roughly Individuals making 150K or more should pay around 35 percent, those making more than 500K, about 50 percent, and those making more than a meg, 65 percent. This will give plenty of incentive for people to make big bucks, while at the same time paying their share. I would also suggest eliminating all, or almost all regressive taxes. However, I am certainly open to debate these figures. And of course these are for Federal taxes. Larger Federal taxes would allow the Feds to pick up more of the costs of roads, education and infrastructure - Since the impact of these affect the entire country and not just the individual State. Dave", 
        "threadID": "672198221_5530067322001", 
        "time": "2009-05-20 14:34:00", 
        "title": "California Economy going down the Crapper", 
        "userID": "Grachus"
    }
]