[
    {
        "content": "quote: WASHINGTON – The Justice Department moved Friday to drop all charges against two former pro-Israel lobbyists who had been charged under the Espionage Act with improperly disseminating sensitive information. The move by the government came in a motion filed with the federal court in Alexandria, Va. which was to be the site of the trial that was scheduled to begin June 2. The prosecution’s case against Steven J. Rosen and Keith Weissman suffered several setbacks in rulings from the trial judge. At the same time, the case was fraught with deep political dimensions, as it raised delicate issue of behind-the-scenes lobbying over Middle East policy and the role played by American Jewish supporters of Israel. Mr. Rosen and Mr. Weissman, who were lobbyists with the American Israel Public Affairs Committee, a leading pro-Israel lobby, were charged with violating the World War I-era Espionage Act. The indictment said they violated the law by disseminating to journalists, fellow Aipac employees and Israeli diplomats information they had learned in conversations with senior Bush administration officials. +http://www.nytimes.com/2009/05/02/us/politics/02aipac.html?hp \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090501, 
        "postID": 1, 
        "quote": "WASHINGTON – The Justice Department moved Friday to drop all charges against two former pro-Israel lobbyists who had been charged under the Espionage Act with improperly disseminating sensitive information. The move by the government came in a motion filed with the federal court in Alexandria, Va. which was to be the site of the trial that was scheduled to begin June 2. The prosecution’s case against Steven J. Rosen and Keith Weissman suffered several setbacks in rulings from the trial judge. At the same time, the case was fraught with deep political dimensions, as it raised delicate issue of behind-the-scenes lobbying over Middle East policy and the role played by American Jewish supporters of Israel. Mr. Rosen and Mr. Weissman, who were lobbyists with the American Israel Public Affairs Committee, a leading pro-Israel lobby, were charged with violating the World War I-era Espionage Act. The indictment said they violated the law by disseminating to journalists, fellow Aipac employees and Israeli diplomats information they had learned in conversations with senior Bush administration officials.", 
        "reply": " +http://www.nytimes.com/2009/05/02/us/politics/02aipac.html?hp \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_4470042222001", 
        "time": "2009-05-01 09:11:00", 
        "title": "U.S. to Drop Spy Case Against Pro-Israel Lobbyists", 
        "userID": "NSNN"
    }
]