[
    {
        "content": "$296 Billion in Overruns in U.S. Weapons Programs Nearly 70 percent of the Pentagon’s 96 largest weapons programs were over budget last year, for a combined total of $296 billion more than the original estimates, a Congressional auditing agency reported Monday. The findings, compiled by the Government Accountability Office, seemed likely to add to the pressure on officials to make sizable cuts in the most troubled programs as they work out the details of a proposed $664 billion defense budget for fiscal 2010. President Obama has said that the “days of giving defense contractors a blank check are over.” Pentagon officials have said they will finish putting together a list of proposed cuts in April. Full article at > >http://www.nytimes.com/2009/03/31/business/31defense.html?_r=1&adxnnl=1&ref=us&adxnnlx=1238515257-ec+TTgjy+jS03ldoLQxdBA Cost overruns have been out of control for decades and it’s about time that someone can put a lid on it. I hope this administration can.", 
        "intTime": 20090331, 
        "postID": 1, 
        "quote": "", 
        "reply": "$296 Billion in Overruns in U.S. Weapons Programs Nearly 70 percent of the Pentagon’s 96 largest weapons programs were over budget last year, for a combined total of $296 billion more than the original estimates, a Congressional auditing agency reported Monday. The findings, compiled by the Government Accountability Office, seemed likely to add to the pressure on officials to make sizable cuts in the most troubled programs as they work out the details of a proposed $664 billion defense budget for fiscal 2010. President Obama has said that the “days of giving defense contractors a blank check are over.” Pentagon officials have said they will finish putting together a list of proposed cuts in April. Full article at > >http://www.nytimes.com/2009/03/31/business/31defense.html?_r=1&adxnnl=1&ref=us&adxnnlx=1238515257-ec+TTgjy+jS03ldoLQxdBA Cost overruns have been out of control for decades and it’s about time that someone can put a lid on it. I hope this administration can.", 
        "threadID": "672198221_3630044912001", 
        "time": "2009-03-31 09:05:00", 
        "title": "$296 Billion in Overruns in U.S. Weapons Programs", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "As a project manager and auditor myself, when I read this I have to say....What the F### Over.", 
        "intTime": 20090331, 
        "postID": 2, 
        "quote": "", 
        "reply": "As a project manager and auditor myself, when I read this I have to say....What the F### Over.", 
        "threadID": "672198221_3630044912001", 
        "time": "2009-03-31 16:55:00", 
        "title": "$296 Billion in Overruns in U.S. Weapons Programs", 
        "userID": "alzuk"
    }, 
    {
        "content": "70% over budget and 100% behind schedule. The Arsenal of Freedom. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090331, 
        "postID": 3, 
        "quote": "", 
        "reply": "70% over budget and 100% behind schedule. The Arsenal of Freedom. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "672198221_3630044912001", 
        "time": "2009-03-31 17:06:00", 
        "title": "$296 Billion in Overruns in U.S. Weapons Programs", 
        "userID": "rm444"
    }, 
    {
        "content": "quote: Originally posted by alzuk: As a project manager and auditor myself, when I read this I have to say....What the F### Over. As a nobody layman, I have to say, \"WTF, Over.\"", 
        "intTime": 20090331, 
        "postID": 4, 
        "quote": "Originally posted by alzuk: As a project manager and auditor myself, when I read this I have to say....What the F### Over.", 
        "reply": " As a nobody layman, I have to say, \"WTF, Over.\"", 
        "threadID": "672198221_3630044912001", 
        "time": "2009-03-31 20:15:00", 
        "title": "$296 Billion in Overruns in U.S. Weapons Programs", 
        "userID": "badmac933"
    }, 
    {
        "content": "Over runs are wonderful, more wages paid, stimulus at work for the good of the economy!", 
        "intTime": 20090401, 
        "postID": 5, 
        "quote": "", 
        "reply": "Over runs are wonderful, more wages paid, stimulus at work for the good of the economy!", 
        "threadID": "672198221_3630044912001", 
        "time": "2009-04-01 09:32:00", 
        "title": "$296 Billion in Overruns in U.S. Weapons Programs", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: Over runs are wonderful, more wages paid, stimulus at work for the good of the economy! Republican pork from when they controlled Congress (1994-2006 and had a tie in the Senate 2006-2008) and the Presidency 2001-2008 and refused to enforce control on Businesses.", 
        "intTime": 20090401, 
        "postID": 6, 
        "quote": "Originally posted by EAG154: Over runs are wonderful, more wages paid, stimulus at work for the good of the economy!", 
        "reply": " Republican pork from when they controlled Congress (1994-2006 and had a tie in the Senate 2006-2008) and the Presidency 2001-2008 and refused to enforce control on Businesses.", 
        "threadID": "672198221_3630044912001", 
        "time": "2009-04-01 11:16:00", 
        "title": "$296 Billion in Overruns in U.S. Weapons Programs", 
        "userID": "rayld2"
    }, 
    {
        "content": "This isn't new. Don't you folks remember the 700 hammers and 500 dollars screws??? quote: President Obama has said that the “days of giving defense contractors a blank check are over.” Pentagon officials have said they will finish putting together a list of proposed cuts in April. Just as his Administration ensures AIG execs get their millions in Bonuses. What a joke!!! Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090401, 
        "postID": 7, 
        "quote": "President Obama has said that the “days of giving defense contractors a blank check are over.” Pentagon officials have said they will finish putting together a list of proposed cuts in April.", 
        "reply": "This isn't new. Don't you folks remember the 700 hammers and 500 dollars screws???  Just as his Administration ensures AIG execs get their millions in Bonuses. What a joke!!! Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3630044912001", 
        "time": "2009-04-01 11:24:00", 
        "title": "$296 Billion in Overruns in U.S. Weapons Programs", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by EAG154: Over runs are wonderful, more wages paid, stimulus at work for the good of the economy! Republican pork from when they controlled Congress (1994-2006 and had a tie in the Senate 2006-2008) and the Presidency 2001-2008 and refused to enforce control on Businesses. now government control of business is Obama taking over the auto industry: look for standard red paint and swastika hood ornaments!", 
        "intTime": 20090401, 
        "postID": 8, 
        "quote": "Originally posted by rayld2: quote: Originally posted by EAG154: Over runs are wonderful, more wages paid, stimulus at work for the good of the economy! Republican pork from when they controlled Congress (1994-2006 and had a tie in the Senate 2006-2008) and the Presidency 2001-2008 and refused to enforce control on Businesses.", 
        "reply": " now government control of business is Obama taking over the auto industry: look for standard red paint and swastika hood ornaments!", 
        "threadID": "672198221_3630044912001", 
        "time": "2009-04-01 19:22:00", 
        "title": "$296 Billion in Overruns in U.S. Weapons Programs", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by rayld2: quote: Originally posted by EAG154: Over runs are wonderful, more wages paid, stimulus at work for the good of the economy! Republican pork from when they controlled Congress (1994-2006 and had a tie in the Senate 2006-2008) and the Presidency 2001-2008 and refused to enforce control on Businesses. now government control of business is Obama taking over the auto industry: look for standard red paint and swastika hood ornaments! Actually if you bother to look at what is ACTUALLY happening it looks like Mr. Obama favors GM going through a fast (prearraigned) bankrupcy, where most of the issues are agreed before the start. The reason the CEO was ASKED to leave was that GM management had NOT developed a plan to make GM viable in the specified time to get Government help and was unwilling to go straight to bankrupcy and in the negotiations with stake holders (bond holders, stock holders, etc.) specifically ruled out bankrupcy as an option (which meant the stake holders had no incentive to compromise). GM management was unwilling or unable to do anything about the Bond holders, Dealer contracts and the Stock holders, the plan they submitted was mostly just to break Union contracts and close plants which would NOT have been enough to give the compnay a chance. The courts during a bankrupcy CAN force a deal on Bond holders and Dealers and will put the stock holders (including the large holding by company managment in stock options) at the end of the line for any money.", 
        "intTime": 20090402, 
        "postID": 9, 
        "quote": "Originally posted by EAG154: quote: Originally posted by rayld2: quote: Originally posted by EAG154: Over runs are wonderful, more wages paid, stimulus at work for the good of the economy! Republican pork from when they controlled Congress (1994-2006 and had a tie in the Senate 2006-2008) and the Presidency 2001-2008 and refused to enforce control on Businesses. now government control of business is Obama taking over the auto industry: look for standard red paint and swastika hood ornaments!", 
        "reply": " Actually if you bother to look at what is ACTUALLY happening it looks like Mr. Obama favors GM going through a fast (prearraigned) bankrupcy, where most of the issues are agreed before the start. The reason the CEO was ASKED to leave was that GM management had NOT developed a plan to make GM viable in the specified time to get Government help and was unwilling to go straight to bankrupcy and in the negotiations with stake holders (bond holders, stock holders, etc.) specifically ruled out bankrupcy as an option (which meant the stake holders had no incentive to compromise). GM management was unwilling or unable to do anything about the Bond holders, Dealer contracts and the Stock holders, the plan they submitted was mostly just to break Union contracts and close plants which would NOT have been enough to give the compnay a chance. The courts during a bankrupcy CAN force a deal on Bond holders and Dealers and will put the stock holders (including the large holding by company managment in stock options) at the end of the line for any money.", 
        "threadID": "672198221_3630044912001", 
        "time": "2009-04-02 08:58:00", 
        "title": "$296 Billion in Overruns in U.S. Weapons Programs", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by EAG154: quote: Originally posted by rayld2: quote: Originally posted by EAG154: Over runs are wonderful, more wages paid, stimulus at work for the good of the economy! Republican pork from when they controlled Congress (1994-2006 and had a tie in the Senate 2006-2008) and the Presidency 2001-2008 and refused to enforce control on Businesses. now government control of business is Obama taking over the auto industry: look for standard red paint and swastika hood ornaments! Actually if you bother to look at what is ACTUALLY happening it looks like Mr. Obama favors GM going through a fast (prearraigned) bankrupcy, where most of the issues are agreed before the start. The reason the CEO was ASKED to leave was that GM management had NOT developed a plan to make GM viable in the specified time to get Government help and was unwilling to go straight to bankrupcy and in the negotiations with stake holders (bond holders, stock holders, etc.) specifically ruled out bankrupcy as an option (which meant the stake holders had no incentive to compromise). GM management was unwilling or unable to do anything about the Bond holders, Dealer contracts and the Stock holders, the plan they submitted was mostly just to break Union contracts and close plants which would NOT have been enough to give the compnay a chance. The courts during a bankrupcy CAN force a deal on Bond holders and Dealers and will put the stock holders (including the large holding by company managment in stock options) at the end of the line for any money. I looked, didn't like what I saw! My opinion is, if GM and Chrysler can't survive too bad, I for one am not interested in spending millions and billions and trillions shoreing up these companys or AIG or any of them. The largest portion of Obamas bailout trillions goes to corporate big wigs and not to the consumer that could stimulate the economy! One thing is for shure giving bonuses to big wigs won't stimulate the economy! LET EM FAIL!!!!!", 
        "intTime": 20090402, 
        "postID": 10, 
        "quote": "Originally posted by rayld2: quote: Originally posted by EAG154: quote: Originally posted by rayld2: quote: Originally posted by EAG154: Over runs are wonderful, more wages paid, stimulus at work for the good of the economy! Republican pork from when they controlled Congress (1994-2006 and had a tie in the Senate 2006-2008) and the Presidency 2001-2008 and refused to enforce control on Businesses. now government control of business is Obama taking over the auto industry: look for standard red paint and swastika hood ornaments! Actually if you bother to look at what is ACTUALLY happening it looks like Mr. Obama favors GM going through a fast (prearraigned) bankrupcy, where most of the issues are agreed before the start. The reason the CEO was ASKED to leave was that GM management had NOT developed a plan to make GM viable in the specified time to get Government help and was unwilling to go straight to bankrupcy and in the negotiations with stake holders (bond holders, stock holders, etc.) specifically ruled out bankrupcy as an option (which meant the stake holders had no incentive to compromise). GM management was unwilling or unable to do anything about the Bond holders, Dealer contracts and the Stock holders, the plan they submitted was mostly just to break Union contracts and close plants which would NOT have been enough to give the compnay a chance. The courts during a bankrupcy CAN force a deal on Bond holders and Dealers and will put the stock holders (including the large holding by company managment in stock options) at the end of the line for any money.", 
        "reply": " I looked, didn't like what I saw! My opinion is, if GM and Chrysler can't survive too bad, I for one am not interested in spending millions and billions and trillions shoreing up these companys or AIG or any of them. The largest portion of Obamas bailout trillions goes to corporate big wigs and not to the consumer that could stimulate the economy! One thing is for shure giving bonuses to big wigs won't stimulate the economy! LET EM FAIL!!!!!", 
        "threadID": "672198221_3630044912001", 
        "time": "2009-04-02 15:45:00", 
        "title": "$296 Billion in Overruns in U.S. Weapons Programs", 
        "userID": "EAG154"
    }
]