[
    {
        "content": "House votes to put tobacco under FDA control The agency would be able to reject new products, restrict advertising and limit nicotine levels. Some senators threaten filibuster. Reporting from Washington -- The House on Thursday voted to give the Food and Drug Administration unprecedented powers to regulate the tobacco industry. The measure would allow the FDA to reject new tobacco products, restrict advertising and take other steps. It passed easily, 298 to 112, but may face a filibuster in the Senate. Anti-smoking groups have clamored for years for the government to exert more control over the industry. \"This is truly a historic day in the fight against tobacco, and I am proud that we have taken such decisive action,\" said House Energy and Commerce Committee Chairman Henry A. Waxman. Full article at >http://www.latimes.com/features/health/la-na-tobacco3-2009apr03,0,5223437.story",
        "intTime": 20090402,
        "postID": 1,
        "quote": "",
        "reply": "House votes to put tobacco under FDA control The agency would be able to reject new products, restrict advertising and limit nicotine levels. Some senators threaten filibuster. Reporting from Washington -- The House on Thursday voted to give the Food and Drug Administration unprecedented powers to regulate the tobacco industry. The measure would allow the FDA to reject new tobacco products, restrict advertising and take other steps. It passed easily, 298 to 112, but may face a filibuster in the Senate. Anti-smoking groups have clamored for years for the government to exert more control over the industry. \"This is truly a historic day in the fight against tobacco, and I am proud that we have taken such decisive action,\" said House Energy and Commerce Committee Chairman Henry A. Waxman. Full article at >http://www.latimes.com/features/health/la-na-tobacco3-2009apr03,0,5223437.story",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-02 21:05:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "IHAWKER"
    },
    {
        "content": "more oppression from the dems at their best... just say no to oppression No Taxation without Representation",
        "intTime": 20090402,
        "postID": 2,
        "quote": "",
        "reply": "more oppression from the dems at their best... just say no to oppression No Taxation without Representation",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-02 21:12:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "outlaws93"
    },
    {
        "content": "I doubt that any of the corporations or companies are strong enough to do this now except for maybe the oil companies. However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Yes I know, but that would get the point to the people too and maybe get them to put pressure on on the governemnt as well. Also, refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States. I know just a pipe dream (yes that is a pun), but I would love to see someone with the clout do it - especially to this administration and Congress! My husband just accused me of advocating corporate blackmail or corporate terrorism, maybe so but our own government is killing our nation economically with regulations! What other nation has ever commited suicide in this manner? (Russia? and even they are telling our government that we are taking the wrong path!) In the long run though We the people have to start doing something to save our nation and if we will not, why not the corporations! Frisco PS: Or since our favorite hobby is boating, move to sailing from motoring like we did. The wind is free so far, but I am sure the government will find a way to tax, regulate, and deny free enterprise of that too if given half a chance! Oh come to think of it they already have - should have seen the tax bill on our boat! This message has been edited. Last edited by: FriscoLady01, Fri 03 April 2009 02:43 AM",
        "intTime": 20090403,
        "postID": 3,
        "quote": "",
        "reply": "I doubt that any of the corporations or companies are strong enough to do this now except for maybe the oil companies. However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Yes I know, but that would get the point to the people too and maybe get them to put pressure on on the governemnt as well. Also, refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States. I know just a pipe dream (yes that is a pun), but I would love to see someone with the clout do it - especially to this administration and Congress! My husband just accused me of advocating corporate blackmail or corporate terrorism, maybe so but our own government is killing our nation economically with regulations! What other nation has ever commited suicide in this manner? (Russia? and even they are telling our government that we are taking the wrong path!) In the long run though We the people have to start doing something to save our nation and if we will not, why not the corporations! Frisco PS: Or since our favorite hobby is boating, move to sailing from motoring like we did. The wind is free so far, but I am sure the government will find a way to tax, regulate, and deny free enterprise of that too if given half a chance! Oh come to think of it they already have - should have seen the tax bill on our boat! This message has been edited. Last edited by: FriscoLady01, Fri 03 April 2009 02:43 AM",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 02:21:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "FriscoLady01"
    },
    {
        "content": "quote: Originally posted by FriscoLady01: I doubt that any of the corporations or companies are strong enough to do this now except for maybe the oil companies. However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States. I know just a pipe dream (yes that is a pun), but I would love to see someone with the clout do it - especially to this administration and Congress! My husband just accused me of advocating corporate blackmail or terrorism, maybe so but our own government is killing our nation with regulations! What other nation has ever commited suicide in this manner? Frisco PS: Or since our favorite hobby is boating, move to sailing from motoring like we did. The wind is free so far, but I am sure the government will find a way to tax, regulate, and deny free enterprise of that too if given half a chance! I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave",
        "intTime": 20090403,
        "postID": 4,
        "quote": "Originally posted by FriscoLady01: I doubt that any of the corporations or companies are strong enough to do this now except for maybe the oil companies. However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States. I know just a pipe dream (yes that is a pun), but I would love to see someone with the clout do it - especially to this administration and Congress! My husband just accused me of advocating corporate blackmail or terrorism, maybe so but our own government is killing our nation with regulations! What other nation has ever commited suicide in this manner? Frisco PS: Or since our favorite hobby is boating, move to sailing from motoring like we did. The wind is free so far, but I am sure the government will find a way to tax, regulate, and deny free enterprise of that too if given half a chance!",
        "reply": " I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 02:42:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by FriscoLady01: I doubt that any of the corporations or companies are strong enough to do this now except for maybe the oil companies. However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States. I know just a pipe dream (yes that is a pun), but I would love to see someone with the clout do it - especially to this administration and Congress! My husband just accused me of advocating corporate blackmail or terrorism, maybe so but our own government is killing our nation with regulations! What other nation has ever commited suicide in this manner? Frisco PS: Or since our favorite hobby is boating, move to sailing from motoring like we did. The wind is free so far, but I am sure the government will find a way to tax, regulate, and deny free enterprise of that too if given half a chance! I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco",
        "intTime": 20090403,
        "postID": 5,
        "quote": "Originally posted by Grachus: quote: Originally posted by FriscoLady01: I doubt that any of the corporations or companies are strong enough to do this now except for maybe the oil companies. However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States. I know just a pipe dream (yes that is a pun), but I would love to see someone with the clout do it - especially to this administration and Congress! My husband just accused me of advocating corporate blackmail or terrorism, maybe so but our own government is killing our nation with regulations! What other nation has ever commited suicide in this manner? Frisco PS: Or since our favorite hobby is boating, move to sailing from motoring like we did. The wind is free so far, but I am sure the government will find a way to tax, regulate, and deny free enterprise of that too if given half a chance! I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave",
        "reply": " Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 02:46:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "FriscoLady01"
    },
    {
        "content": "quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco Are you saying that Norway, Denmark, Mexico, and a whole bunch of other countries are Communist Dictatorships? Tell me who OWNS the land where the oil is found? Who GIVES this oil to the oil companies at bargain basement prices? Who FINDS the oil for these companies? Well the answer to ALL the above is us - And in return for this largese, they have a God Given Right to sell it back to us at outragous profits - and to question this arrangement automatically means you're a Nazi or a Stalinist? You sure you want to stick with this view? Personally I'd like to Nationalise all these companies ASAP - If they did what you suggest, then that's what will happen - So yes, I wish they did pack it in and head to Dubai, where they can join those other \"Patriots,\" Haleberton. Dave",
        "intTime": 20090403,
        "postID": 6,
        "quote": "Originally posted by FriscoLady01: quote: Originally posted by Grachus: I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco",
        "reply": " Are you saying that Norway, Denmark, Mexico, and a whole bunch of other countries are Communist Dictatorships? Tell me who OWNS the land where the oil is found? Who GIVES this oil to the oil companies at bargain basement prices? Who FINDS the oil for these companies? Well the answer to ALL the above is us - And in return for this largese, they have a God Given Right to sell it back to us at outragous profits - and to question this arrangement automatically means you're a Nazi or a Stalinist? You sure you want to stick with this view? Personally I'd like to Nationalise all these companies ASAP - If they did what you suggest, then that's what will happen - So yes, I wish they did pack it in and head to Dubai, where they can join those other \"Patriots,\" Haleberton. Dave",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 03:32:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by FriscoLady01: I doubt that any of the corporations or companies are strong enough to do this now except for maybe the oil companies. However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States. I know just a pipe dream (yes that is a pun), but I would love to see someone with the clout do it - especially to this administration and Congress! My husband just accused me of advocating corporate blackmail or terrorism, maybe so but our own government is killing our nation with regulations! What other nation has ever commited suicide in this manner? Frisco PS: Or since our favorite hobby is boating, move to sailing from motoring like we did. The wind is free so far, but I am sure the government will find a way to tax, regulate, and deny free enterprise of that too if given half a chance! I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave I have a oil digging shovel for sale",
        "intTime": 20090403,
        "postID": 7,
        "quote": "Originally posted by Grachus: quote: Originally posted by FriscoLady01: I doubt that any of the corporations or companies are strong enough to do this now except for maybe the oil companies. However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States. I know just a pipe dream (yes that is a pun), but I would love to see someone with the clout do it - especially to this administration and Congress! My husband just accused me of advocating corporate blackmail or terrorism, maybe so but our own government is killing our nation with regulations! What other nation has ever commited suicide in this manner? Frisco PS: Or since our favorite hobby is boating, move to sailing from motoring like we did. The wind is free so far, but I am sure the government will find a way to tax, regulate, and deny free enterprise of that too if given half a chance! I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave",
        "reply": " I have a oil digging shovel for sale",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 05:28:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco Are you saying that Norway, Denmark, Mexico, and a whole bunch of other countries are Communist Dictatorships? Tell me who OWNS the land where the oil is found? Who GIVES this oil to the oil companies at bargain basement prices? Who FINDS the oil for these companies? Well the answer to ALL the above is us - And in return for this largese, they have a God Given Right to sell it back to us at outragous profits - and to question this arrangement automatically means you're a Nazi or a Stalinist? You sure you want to stick with this view? Personally I'd like to Nationalise all these companies ASAP - If they did what you suggest, then that's what will happen - So yes, I wish they did pack it in and head to Dubai, where they can join those other \"Patriots,\" Haleberton. Dave Socialist at best, and fast on the way to Communist. My Great Grandfather after his military career raised horses in Prussia, he was made fairly wealthy by it, however because of the breed and the quality of the Horse, the only customer that he was allowed to sell to was the Kindgom of Prussia's military and later the German Imperial Army. After we immigrated to this country my Father made his fortune through the development of batteries, in fact I imagine every household in the US has at least one in the household if not more. He is still paid royalities for his research and development with the old now defunct Mallory Co. But another Co. now holds the license. That is called capitalism, duh! Can you imagine what you and I would be paying for batteries if the industry was nationalized. Our petrol products are far cheaper than in any country that has nationalized the industry or any other industry for that matter. So if you want nationalization, you move to Mexico or Norway, etc. Any move towards nationalization, or socialism is in my mind a step towards communism, or for that matter facism. Not going to go through that again, will leave first or as a last resort resist with everything I have in me! Frisco",
        "intTime": 20090403,
        "postID": 8,
        "quote": "Originally posted by Grachus: quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco Are you saying that Norway, Denmark, Mexico, and a whole bunch of other countries are Communist Dictatorships? Tell me who OWNS the land where the oil is found? Who GIVES this oil to the oil companies at bargain basement prices? Who FINDS the oil for these companies? Well the answer to ALL the above is us - And in return for this largese, they have a God Given Right to sell it back to us at outragous profits - and to question this arrangement automatically means you're a Nazi or a Stalinist? You sure you want to stick with this view? Personally I'd like to Nationalise all these companies ASAP - If they did what you suggest, then that's what will happen - So yes, I wish they did pack it in and head to Dubai, where they can join those other \"Patriots,\" Haleberton. Dave",
        "reply": " Socialist at best, and fast on the way to Communist. My Great Grandfather after his military career raised horses in Prussia, he was made fairly wealthy by it, however because of the breed and the quality of the Horse, the only customer that he was allowed to sell to was the Kindgom of Prussia's military and later the German Imperial Army. After we immigrated to this country my Father made his fortune through the development of batteries, in fact I imagine every household in the US has at least one in the household if not more. He is still paid royalities for his research and development with the old now defunct Mallory Co. But another Co. now holds the license. That is called capitalism, duh! Can you imagine what you and I would be paying for batteries if the industry was nationalized. Our petrol products are far cheaper than in any country that has nationalized the industry or any other industry for that matter. So if you want nationalization, you move to Mexico or Norway, etc. Any move towards nationalization, or socialism is in my mind a step towards communism, or for that matter facism. Not going to go through that again, will leave first or as a last resort resist with everything I have in me! Frisco",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 06:49:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "FriscoLady01"
    },
    {
        "content": "I haven't read this current bill, but if it's the same one which was voted down before, I'm all for it. Why, you may ask? Don't you and your wife both smoke? Yes, we do, but there's a little known provision in that bill which, I think, will allow my wife to force not only the taxpayers to buy her cigarettes, but also force restuarants and bars to re-open smoking sections. I won't say any more about that now, but if that bill becomes law, you anti-smokers will be genuinely surprised at what it does.",
        "intTime": 20090403,
        "postID": 9,
        "quote": "",
        "reply": "I haven't read this current bill, but if it's the same one which was voted down before, I'm all for it. Why, you may ask? Don't you and your wife both smoke? Yes, we do, but there's a little known provision in that bill which, I think, will allow my wife to force not only the taxpayers to buy her cigarettes, but also force restuarants and bars to re-open smoking sections. I won't say any more about that now, but if that bill becomes law, you anti-smokers will be genuinely surprised at what it does.",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 07:05:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "stillkit"
    },
    {
        "content": "quote: you anti-smokers will be genuinely surprised at what it does. hahahahaha aint it always like that?? maybe one day we the people will relitize its not good to get the gov involved with stuff like this and trans fats ect....",
        "intTime": 20090403,
        "postID": 10,
        "quote": "you anti-smokers will be genuinely surprised at what it does.",
        "reply": " hahahahaha aint it always like that?? maybe one day we the people will relitize its not good to get the gov involved with stuff like this and trans fats ect....",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 07:31:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "outlaws93"
    },
    {
        "content": "quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco Are you saying that Norway, Denmark, Mexico, and a whole bunch of other countries are Communist Dictatorships? Tell me who OWNS the land where the oil is found? Who GIVES this oil to the oil companies at bargain basement prices? Who FINDS the oil for these companies? Well the answer to ALL the above is us - And in return for this largese, they have a God Given Right to sell it back to us at outragous profits - and to question this arrangement automatically means you're a Nazi or a Stalinist? You sure you want to stick with this view? Personally I'd like to Nationalise all these companies ASAP - If they did what you suggest, then that's what will happen - So yes, I wish they did pack it in and head to Dubai, where they can join those other \"Patriots,\" Haleberton. Dave Socialist at best, and fast on the way to Communist. My Great Grandfather after his military career raised horses in Prussia, he was made fairly wealthy by it, however because of the breed and the quality of the Horse, the only customer that he was allowed to sell to was the Kindgom of Prussia's military and later the German Imperial Army. After we immigrated to this country my Father made his fortune through the development of batteries, in fact I imagine every household in the US has at least one in the household if not more. He is still paid royalities for his research and development with the old now defunct Mallory Co. But another Co. now holds the license. That is called capitalism, duh! Can you imagine what you and I would be paying for batteries if the industry was nationalized. Our petrol products are far cheaper than in any country that has nationalized the industry or any other industry for that matter. So if you want nationalization, you move to Mexico or Norway, etc. Any move towards nationalization, or socialism is in my mind a step towards communism, or for that matter facism. Not going to go through that again, will leave first or as a last resort resist with everything I have in me! Frisco Most countries with State owned oil companies sell gas for far less than we do - And those that don't have high taxes, which affect BOTH State owned and privately owned oil companies. So you are actually claiming that all these countries will soon become Communist? Now as for the family history. That's nice. More power to him! So, did the government give him his battery patent, as the government GIVES the oil companies OUR oil? Or maybe you feel it's an example of hard work, and innitative where the government \"leases\" land to the timber companies at two cents an acre, from which they strip the forest, and sell the wood for $1000 a tree? As we all know government is incapable of cutting tree's on their own. We need a \"Capitalist\" to get those stinking tree's off our land ASAP? Dave",
        "intTime": 20090403,
        "postID": 11,
        "quote": "Originally posted by FriscoLady01: quote: Originally posted by Grachus: quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco Are you saying that Norway, Denmark, Mexico, and a whole bunch of other countries are Communist Dictatorships? Tell me who OWNS the land where the oil is found? Who GIVES this oil to the oil companies at bargain basement prices? Who FINDS the oil for these companies? Well the answer to ALL the above is us - And in return for this largese, they have a God Given Right to sell it back to us at outragous profits - and to question this arrangement automatically means you're a Nazi or a Stalinist? You sure you want to stick with this view? Personally I'd like to Nationalise all these companies ASAP - If they did what you suggest, then that's what will happen - So yes, I wish they did pack it in and head to Dubai, where they can join those other \"Patriots,\" Haleberton. Dave Socialist at best, and fast on the way to Communist. My Great Grandfather after his military career raised horses in Prussia, he was made fairly wealthy by it, however because of the breed and the quality of the Horse, the only customer that he was allowed to sell to was the Kindgom of Prussia's military and later the German Imperial Army. After we immigrated to this country my Father made his fortune through the development of batteries, in fact I imagine every household in the US has at least one in the household if not more. He is still paid royalities for his research and development with the old now defunct Mallory Co. But another Co. now holds the license. That is called capitalism, duh! Can you imagine what you and I would be paying for batteries if the industry was nationalized. Our petrol products are far cheaper than in any country that has nationalized the industry or any other industry for that matter. So if you want nationalization, you move to Mexico or Norway, etc. Any move towards nationalization, or socialism is in my mind a step towards communism, or for that matter facism. Not going to go through that again, will leave first or as a last resort resist with everything I have in me! Frisco",
        "reply": " Most countries with State owned oil companies sell gas for far less than we do - And those that don't have high taxes, which affect BOTH State owned and privately owned oil companies. So you are actually claiming that all these countries will soon become Communist? Now as for the family history. That's nice. More power to him! So, did the government give him his battery patent, as the government GIVES the oil companies OUR oil? Or maybe you feel it's an example of hard work, and innitative where the government \"leases\" land to the timber companies at two cents an acre, from which they strip the forest, and sell the wood for $1000 a tree? As we all know government is incapable of cutting tree's on their own. We need a \"Capitalist\" to get those stinking tree's off our land ASAP? Dave",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 08:05:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco Are you saying that Norway, Denmark, Mexico, and a whole bunch of other countries are Communist Dictatorships? Tell me who OWNS the land where the oil is found? Who GIVES this oil to the oil companies at bargain basement prices? Who FINDS the oil for these companies? Well the answer to ALL the above is us - And in return for this largese, they have a God Given Right to sell it back to us at outragous profits - and to question this arrangement automatically means you're a Nazi or a Stalinist? You sure you want to stick with this view? Personally I'd like to Nationalise all these companies ASAP - If they did what you suggest, then that's what will happen - So yes, I wish they did pack it in and head to Dubai, where they can join those other \"Patriots,\" Haleberton. Dave Socialist at best, and fast on the way to Communist. My Great Grandfather after his military career raised horses in Prussia, he was made fairly wealthy by it, however because of the breed and the quality of the Horse, the only customer that he was allowed to sell to was the Kindgom of Prussia's military and later the German Imperial Army. After we immigrated to this country my Father made his fortune through the development of batteries, in fact I imagine every household in the US has at least one in the household if not more. He is still paid royalities for his research and development with the old now defunct Mallory Co. But another Co. now holds the license. That is called capitalism, duh! Can you imagine what you and I would be paying for batteries if the industry was nationalized. Our petrol products are far cheaper than in any country that has nationalized the industry or any other industry for that matter. So if you want nationalization, you move to Mexico or Norway, etc. Any move towards nationalization, or socialism is in my mind a step towards communism, or for that matter facism. Not going to go through that again, will leave first or as a last resort resist with everything I have in me! Frisco Most countries with State owned oil companies sell gas for far less than we do - And those that don't have high taxes, which affect BOTH State owned and privately owned oil companies. So you are actually claiming that all these countries will soon become Communist? Now as for the family history. That's nice. More power to him! So, did the government give him his battery patent, as the government GIVES the oil companies OUR oil? Or maybe you feel it's an example of hard work, and innitative where the government \"leases\" land to the timber companies at two cents an acre, from which they strip the forest, and sell the wood for $1000 a tree? As we all know government is incapable of cutting tree's on their own. We need a \"Capitalist\" to get those stinking tree's off our land ASAP? Dave Some other examples are: * The hard rock mining laws. Look them up they GIVE away mineral rights and NO ONE has the right to block the companies. * So called clean out contracts to reduce fire fuel were companies are PAID to remove timber and often the companies would make a big profit off the timber even without being paid with TAX money. I don't have a problem with the contracts when because of volume, location, etc. the company could not makea good profit with out being paid.",
        "intTime": 20090403,
        "postID": 12,
        "quote": "Originally posted by Grachus: quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco Are you saying that Norway, Denmark, Mexico, and a whole bunch of other countries are Communist Dictatorships? Tell me who OWNS the land where the oil is found? Who GIVES this oil to the oil companies at bargain basement prices? Who FINDS the oil for these companies? Well the answer to ALL the above is us - And in return for this largese, they have a God Given Right to sell it back to us at outragous profits - and to question this arrangement automatically means you're a Nazi or a Stalinist? You sure you want to stick with this view? Personally I'd like to Nationalise all these companies ASAP - If they did what you suggest, then that's what will happen - So yes, I wish they did pack it in and head to Dubai, where they can join those other \"Patriots,\" Haleberton. Dave Socialist at best, and fast on the way to Communist. My Great Grandfather after his military career raised horses in Prussia, he was made fairly wealthy by it, however because of the breed and the quality of the Horse, the only customer that he was allowed to sell to was the Kindgom of Prussia's military and later the German Imperial Army. After we immigrated to this country my Father made his fortune through the development of batteries, in fact I imagine every household in the US has at least one in the household if not more. He is still paid royalities for his research and development with the old now defunct Mallory Co. But another Co. now holds the license. That is called capitalism, duh! Can you imagine what you and I would be paying for batteries if the industry was nationalized. Our petrol products are far cheaper than in any country that has nationalized the industry or any other industry for that matter. So if you want nationalization, you move to Mexico or Norway, etc. Any move towards nationalization, or socialism is in my mind a step towards communism, or for that matter facism. Not going to go through that again, will leave first or as a last resort resist with everything I have in me! Frisco Most countries with State owned oil companies sell gas for far less than we do - And those that don't have high taxes, which affect BOTH State owned and privately owned oil companies. So you are actually claiming that all these countries will soon become Communist? Now as for the family history. That's nice. More power to him! So, did the government give him his battery patent, as the government GIVES the oil companies OUR oil? Or maybe you feel it's an example of hard work, and innitative where the government \"leases\" land to the timber companies at two cents an acre, from which they strip the forest, and sell the wood for $1000 a tree? As we all know government is incapable of cutting tree's on their own. We need a \"Capitalist\" to get those stinking tree's off our land ASAP? Dave",
        "reply": " Some other examples are: * The hard rock mining laws. Look them up they GIVE away mineral rights and NO ONE has the right to block the companies. * So called clean out contracts to reduce fire fuel were companies are PAID to remove timber and often the companies would make a big profit off the timber even without being paid with TAX money. I don't have a problem with the contracts when because of volume, location, etc. the company could not makea good profit with out being paid.",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 08:20:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "rayld2"
    },
    {
        "content": "quote: * The hard rock mining laws. Look them up they GIVE away mineral rights and NO ONE has the right to block the companies. my family owns mining rights to sulfur mines here in fl... enough to supply our sulfur needs for 100s of years... but environmentalist have been blocking us for 30+years now... also would make my family filthy rich and i would be able to get off of disability and pay for my own medical needs...",
        "intTime": 20090403,
        "postID": 13,
        "quote": "* The hard rock mining laws. Look them up they GIVE away mineral rights and NO ONE has the right to block the companies.",
        "reply": " my family owns mining rights to sulfur mines here in fl... enough to supply our sulfur needs for 100s of years... but environmentalist have been blocking us for 30+years now... also would make my family filthy rich and i would be able to get off of disability and pay for my own medical needs...",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 08:27:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "outlaws93"
    },
    {
        "content": "\"The World's Finest\"",
        "intTime": 20090404,
        "postID": 14,
        "quote": "",
        "reply": "\"The World's Finest\"",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-04 12:28:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "Kegler300"
    },
    {
        "content": "quote: Originally posted by Kegler300: Don't you think we should tax butter, and all those mindless jerks who eat it, clog up their arteries, and then expect us to bail them out with free triple by-pass surgery? A tax on butter will save millions of lives, and those jerks will just have to learn to live without it, OR if they insist, at least contributing to the high cost of surgery? And that's just for starters! I have a list! And I sure hope that you don't like Bar-b-cued ribs, 'cause that's next on my list... *********************** I don't complain about rules for no smoking in closed environments. I don't complain because the smell of smoke is legitimately annoying to some people - But I've had people walk up to me in the midst of a diesal fog and complain about my smoking - Who the hell is The State to tell me what to do with my own body? If the State feels that smoking should be outlawed, then let them go ahead and do it. What is this tax crap? What are all these jerks, who probably have their OWN bad habits, complaining about mine? It's one thing for the government to outlaw a product, it's another for them to tax it. If they can tax this, they can tax anything - And WILL tax anything. Those who don't smoke can be smug and comfortable all they want - Let them wait until Big Daddy gives them the bad news about what they enjoy. Dave",
        "intTime": 20090404,
        "postID": 15,
        "quote": "Originally posted by Kegler300:",
        "reply": " Don't you think we should tax butter, and all those mindless jerks who eat it, clog up their arteries, and then expect us to bail them out with free triple by-pass surgery? A tax on butter will save millions of lives, and those jerks will just have to learn to live without it, OR if they insist, at least contributing to the high cost of surgery? And that's just for starters! I have a list! And I sure hope that you don't like Bar-b-cued ribs, 'cause that's next on my list... *********************** I don't complain about rules for no smoking in closed environments. I don't complain because the smell of smoke is legitimately annoying to some people - But I've had people walk up to me in the midst of a diesal fog and complain about my smoking - Who the hell is The State to tell me what to do with my own body? If the State feels that smoking should be outlawed, then let them go ahead and do it. What is this tax crap? What are all these jerks, who probably have their OWN bad habits, complaining about mine? It's one thing for the government to outlaw a product, it's another for them to tax it. If they can tax this, they can tax anything - And WILL tax anything. Those who don't smoke can be smug and comfortable all they want - Let them wait until Big Daddy gives them the bad news about what they enjoy. Dave",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-04 13:30:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "Grachus"
    },
    {
        "content": "quote: However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. What restrictions? Jesus what country have you been living in? You and the rest of the republican anti-protectionist and uneven \"free trade\" policies have been the cause of this economic mess were in. If Americans had jobs, the banks going under would not have happened and we wouldn't be sitting on trillions of dollars of debt. It is those exact policies that have caused what were in now and you say you want more of that? Good grief learn from history. Those policies HAVE failed this nation. Why can't the Reps see that? This message has been edited. Last edited by: crackerjacks61, Mon 06 April 2009 05:52 PM",
        "intTime": 20090406,
        "postID": 16,
        "quote": "However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down.",
        "reply": " What restrictions? Jesus what country have you been living in? You and the rest of the republican anti-protectionist and uneven \"free trade\" policies have been the cause of this economic mess were in. If Americans had jobs, the banks going under would not have happened and we wouldn't be sitting on trillions of dollars of debt. It is those exact policies that have caused what were in now and you say you want more of that? Good grief learn from history. Those policies HAVE failed this nation. Why can't the Reps see that? This message has been edited. Last edited by: crackerjacks61, Mon 06 April 2009 05:52 PM",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-06 17:31:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "crackerjacks61"
    },
    {
        "content": "I think we should tax the hell out of beer and alcohol like they do cigarettes. It's a free country, If I want to smoke I will and I do. Time for others to share the tax burden in the so called \"sin taxes\".",
        "intTime": 20090406,
        "postID": 17,
        "quote": "",
        "reply": "I think we should tax the hell out of beer and alcohol like they do cigarettes. It's a free country, If I want to smoke I will and I do. Time for others to share the tax burden in the so called \"sin taxes\".",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-06 17:48:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Kegler300: Don't you think we should tax butter, and all those mindless jerks who eat it, clog up their arteries, and then expect us to bail them out with free triple by-pass surgery? A tax on butter will save millions of lives, and those jerks will just have to learn to live without it, OR if they insist, at least contributing to the high cost of surgery? And that's just for starters! I have a list! And I sure hope that you don't like Bar-b-cued ribs, 'cause that's next on my list... *********************** I don't complain about rules for no smoking in closed environments. I don't complain because the smell of smoke is legitimately annoying to some people - But I've had people walk up to me in the midst of a diesal fog and complain about my smoking - Who the hell is The State to tell me what to do with my own body? If the State feels that smoking should be outlawed, then let them go ahead and do it. What is this tax crap? What are all these jerks, who probably have their OWN bad habits, complaining about mine? It's one thing for the government to outlaw a product, it's another for them to tax it. If they can tax this, they can tax anything - And WILL tax anything. Those who don't smoke can be smug and comfortable all they want - Let them wait until Big Daddy gives them the bad news about what they enjoy. Dave",
        "intTime": 20090406,
        "postID": 18,
        "quote": "Originally posted by Grachus: quote: Originally posted by Kegler300: Don't you think we should tax butter, and all those mindless jerks who eat it, clog up their arteries, and then expect us to bail them out with free triple by-pass surgery? A tax on butter will save millions of lives, and those jerks will just have to learn to live without it, OR if they insist, at least contributing to the high cost of surgery? And that's just for starters! I have a list! And I sure hope that you don't like Bar-b-cued ribs, 'cause that's next on my list... *********************** I don't complain about rules for no smoking in closed environments. I don't complain because the smell of smoke is legitimately annoying to some people - But I've had people walk up to me in the midst of a diesal fog and complain about my smoking - Who the hell is The State to tell me what to do with my own body? If the State feels that smoking should be outlawed, then let them go ahead and do it. What is this tax crap? What are all these jerks, who probably have their OWN bad habits, complaining about mine? It's one thing for the government to outlaw a product, it's another for them to tax it. If they can tax this, they can tax anything - And WILL tax anything. Those who don't smoke can be smug and comfortable all they want - Let them wait until Big Daddy gives them the bad news about what they enjoy. Dave",
        "reply": "",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-06 17:49:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by FriscoLady01: However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Yes I know, but that would get the point to the people too and maybe get them to put pressure on on the governemnt as well. Also, refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States. Frisco, you do know that that would just have two effects... 1. end all the tax that is gleaned form tobacco products...the programs won't end, it will just mean more taxes out of everyone's pocket instead of from smokers' pockets. 2. The world's leading tobacco producer is China. If we shut down tobacco production here, where do you think we will get smokes from? That's right, go further in hoc to our our biggest creditor. Not only will we put more Americans out of work in favor of Chinese products, we will be getting tobacco from a country where producers put melamine in baby formula. God knows what thyey put in tobacco. You think it's bad with some extra nicotine. And who will pay for all the health issues caused by this jacked-up Chinese tobacco? Yup, you guessed it. As far as oil goes, the nation already discovered how much they hate the oil industry. 5 years ago, the idea that we needed to go full-scale nuclear so we could all have electric or fuel-cell cars was laughable. Not so much now. The oil industry needs to convince people that they, and not alternates, should be powering our vehicles into the future. NOBODY got a kick out of $5 gas except the oil companies. If they were to try a little industrial blackmail, at best I could see a huge outpouring of support for the government to subsidize public trans and alternate fuel cars powered by a boom in in the nuke industry. At worst, I could see a liberal 5-4 USSC allowing the federal government to nationalize the energy industry.",
        "intTime": 20090407,
        "postID": 19,
        "quote": "Originally posted by FriscoLady01: However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Yes I know, but that would get the point to the people too and maybe get them to put pressure on on the governemnt as well. Also, refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States.",
        "reply": " Frisco, you do know that that would just have two effects... 1. end all the tax that is gleaned form tobacco products...the programs won't end, it will just mean more taxes out of everyone's pocket instead of from smokers' pockets. 2. The world's leading tobacco producer is China. If we shut down tobacco production here, where do you think we will get smokes from? That's right, go further in hoc to our our biggest creditor. Not only will we put more Americans out of work in favor of Chinese products, we will be getting tobacco from a country where producers put melamine in baby formula. God knows what thyey put in tobacco. You think it's bad with some extra nicotine. And who will pay for all the health issues caused by this jacked-up Chinese tobacco? Yup, you guessed it. As far as oil goes, the nation already discovered how much they hate the oil industry. 5 years ago, the idea that we needed to go full-scale nuclear so we could all have electric or fuel-cell cars was laughable. Not so much now. The oil industry needs to convince people that they, and not alternates, should be powering our vehicles into the future. NOBODY got a kick out of $5 gas except the oil companies. If they were to try a little industrial blackmail, at best I could see a huge outpouring of support for the government to subsidize public trans and alternate fuel cars powered by a boom in in the nuke industry. At worst, I could see a liberal 5-4 USSC allowing the federal government to nationalize the energy industry.",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-07 08:25:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "jwr6"
    },
    {
        "content": "quote: Originally posted by _cash_: If government really wanted people to quit smoking.....they'd quit subsidizing tobacco crops and just make cigarete manufacturing and sales illegal. They don't! They don't want people to quit, they just want most people to quit. Governments get a LOT of taxes off tobacco products, and it's taxes that a clear majority of people support. It's almost a perfect system. Most people don't smoke. They don't care how high taxes on tobacco gets, so it's easy to pass the tax increases. For every smoker that dies or quits, another takes their place, so it's a predictable stream of tax revenue for local, state and federal government. Plus, they subsidize tobacco because if they didn't, Phillip Morris and others would just import it from China. As it's not a meat/dairy product, it wouldn't get inspected by the government, either.",
        "intTime": 20090407,
        "postID": 20,
        "quote": "Originally posted by _cash_: If government really wanted people to quit smoking.....they'd quit subsidizing tobacco crops and just make cigarete manufacturing and sales illegal. They don't!",
        "reply": " They don't want people to quit, they just want most people to quit. Governments get a LOT of taxes off tobacco products, and it's taxes that a clear majority of people support. It's almost a perfect system. Most people don't smoke. They don't care how high taxes on tobacco gets, so it's easy to pass the tax increases. For every smoker that dies or quits, another takes their place, so it's a predictable stream of tax revenue for local, state and federal government. Plus, they subsidize tobacco because if they didn't, Phillip Morris and others would just import it from China. As it's not a meat/dairy product, it wouldn't get inspected by the government, either.",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-07 08:43:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "jwr6"
    },
    {
        "content": "House votes to put tobacco under FDA control The agency would be able to reject new products, restrict advertising and limit nicotine levels. Some senators threaten filibuster. Reporting from Washington -- The House on Thursday voted to give the Food and Drug Administration unprecedented powers to regulate the tobacco industry. The measure would allow the FDA to reject new tobacco products, restrict advertising and take other steps. It passed easily, 298 to 112, but may face a filibuster in the Senate. Anti-smoking groups have clamored for years for the government to exert more control over the industry. \"This is truly a historic day in the fight against tobacco, and I am proud that we have taken such decisive action,\" said House Energy and Commerce Committee Chairman Henry A. Waxman. Full article at >http://www.latimes.com/features/health/la-na-tobacco3-2009apr03,0,5223437.story",
        "intTime": 20090402,
        "postID": 21,
        "quote": "",
        "reply": "House votes to put tobacco under FDA control The agency would be able to reject new products, restrict advertising and limit nicotine levels. Some senators threaten filibuster. Reporting from Washington -- The House on Thursday voted to give the Food and Drug Administration unprecedented powers to regulate the tobacco industry. The measure would allow the FDA to reject new tobacco products, restrict advertising and take other steps. It passed easily, 298 to 112, but may face a filibuster in the Senate. Anti-smoking groups have clamored for years for the government to exert more control over the industry. \"This is truly a historic day in the fight against tobacco, and I am proud that we have taken such decisive action,\" said House Energy and Commerce Committee Chairman Henry A. Waxman. Full article at >http://www.latimes.com/features/health/la-na-tobacco3-2009apr03,0,5223437.story",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-02 21:05:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "IHAWKER"
    },
    {
        "content": "more oppression from the dems at their best... just say no to oppression No Taxation without Representation",
        "intTime": 20090402,
        "postID": 22,
        "quote": "",
        "reply": "more oppression from the dems at their best... just say no to oppression No Taxation without Representation",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-02 21:12:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "outlaws93"
    },
    {
        "content": "I doubt that any of the corporations or companies are strong enough to do this now except for maybe the oil companies. However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Yes I know, but that would get the point to the people too and maybe get them to put pressure on on the governemnt as well. Also, refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States. I know just a pipe dream (yes that is a pun), but I would love to see someone with the clout do it - especially to this administration and Congress! My husband just accused me of advocating corporate blackmail or corporate terrorism, maybe so but our own government is killing our nation economically with regulations! What other nation has ever commited suicide in this manner? (Russia? and even they are telling our government that we are taking the wrong path!) In the long run though We the people have to start doing something to save our nation and if we will not, why not the corporations! Frisco PS: Or since our favorite hobby is boating, move to sailing from motoring like we did. The wind is free so far, but I am sure the government will find a way to tax, regulate, and deny free enterprise of that too if given half a chance! Oh come to think of it they already have - should have seen the tax bill on our boat! This message has been edited. Last edited by: FriscoLady01, Fri 03 April 2009 02:43 AM",
        "intTime": 20090403,
        "postID": 23,
        "quote": "",
        "reply": "I doubt that any of the corporations or companies are strong enough to do this now except for maybe the oil companies. However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Yes I know, but that would get the point to the people too and maybe get them to put pressure on on the governemnt as well. Also, refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States. I know just a pipe dream (yes that is a pun), but I would love to see someone with the clout do it - especially to this administration and Congress! My husband just accused me of advocating corporate blackmail or corporate terrorism, maybe so but our own government is killing our nation economically with regulations! What other nation has ever commited suicide in this manner? (Russia? and even they are telling our government that we are taking the wrong path!) In the long run though We the people have to start doing something to save our nation and if we will not, why not the corporations! Frisco PS: Or since our favorite hobby is boating, move to sailing from motoring like we did. The wind is free so far, but I am sure the government will find a way to tax, regulate, and deny free enterprise of that too if given half a chance! Oh come to think of it they already have - should have seen the tax bill on our boat! This message has been edited. Last edited by: FriscoLady01, Fri 03 April 2009 02:43 AM",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 02:21:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "FriscoLady01"
    },
    {
        "content": "quote: Originally posted by FriscoLady01: I doubt that any of the corporations or companies are strong enough to do this now except for maybe the oil companies. However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States. I know just a pipe dream (yes that is a pun), but I would love to see someone with the clout do it - especially to this administration and Congress! My husband just accused me of advocating corporate blackmail or terrorism, maybe so but our own government is killing our nation with regulations! What other nation has ever commited suicide in this manner? Frisco PS: Or since our favorite hobby is boating, move to sailing from motoring like we did. The wind is free so far, but I am sure the government will find a way to tax, regulate, and deny free enterprise of that too if given half a chance! I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave",
        "intTime": 20090403,
        "postID": 24,
        "quote": "Originally posted by FriscoLady01: I doubt that any of the corporations or companies are strong enough to do this now except for maybe the oil companies. However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States. I know just a pipe dream (yes that is a pun), but I would love to see someone with the clout do it - especially to this administration and Congress! My husband just accused me of advocating corporate blackmail or terrorism, maybe so but our own government is killing our nation with regulations! What other nation has ever commited suicide in this manner? Frisco PS: Or since our favorite hobby is boating, move to sailing from motoring like we did. The wind is free so far, but I am sure the government will find a way to tax, regulate, and deny free enterprise of that too if given half a chance!",
        "reply": " I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 02:42:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by FriscoLady01: I doubt that any of the corporations or companies are strong enough to do this now except for maybe the oil companies. However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States. I know just a pipe dream (yes that is a pun), but I would love to see someone with the clout do it - especially to this administration and Congress! My husband just accused me of advocating corporate blackmail or terrorism, maybe so but our own government is killing our nation with regulations! What other nation has ever commited suicide in this manner? Frisco PS: Or since our favorite hobby is boating, move to sailing from motoring like we did. The wind is free so far, but I am sure the government will find a way to tax, regulate, and deny free enterprise of that too if given half a chance! I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco",
        "intTime": 20090403,
        "postID": 25,
        "quote": "Originally posted by Grachus: quote: Originally posted by FriscoLady01: I doubt that any of the corporations or companies are strong enough to do this now except for maybe the oil companies. However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States. I know just a pipe dream (yes that is a pun), but I would love to see someone with the clout do it - especially to this administration and Congress! My husband just accused me of advocating corporate blackmail or terrorism, maybe so but our own government is killing our nation with regulations! What other nation has ever commited suicide in this manner? Frisco PS: Or since our favorite hobby is boating, move to sailing from motoring like we did. The wind is free so far, but I am sure the government will find a way to tax, regulate, and deny free enterprise of that too if given half a chance! I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave",
        "reply": " Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 02:46:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "FriscoLady01"
    },
    {
        "content": "quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco Are you saying that Norway, Denmark, Mexico, and a whole bunch of other countries are Communist Dictatorships? Tell me who OWNS the land where the oil is found? Who GIVES this oil to the oil companies at bargain basement prices? Who FINDS the oil for these companies? Well the answer to ALL the above is us - And in return for this largese, they have a God Given Right to sell it back to us at outragous profits - and to question this arrangement automatically means you're a Nazi or a Stalinist? You sure you want to stick with this view? Personally I'd like to Nationalise all these companies ASAP - If they did what you suggest, then that's what will happen - So yes, I wish they did pack it in and head to Dubai, where they can join those other \"Patriots,\" Haleberton. Dave",
        "intTime": 20090403,
        "postID": 26,
        "quote": "Originally posted by FriscoLady01: quote: Originally posted by Grachus: I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco",
        "reply": " Are you saying that Norway, Denmark, Mexico, and a whole bunch of other countries are Communist Dictatorships? Tell me who OWNS the land where the oil is found? Who GIVES this oil to the oil companies at bargain basement prices? Who FINDS the oil for these companies? Well the answer to ALL the above is us - And in return for this largese, they have a God Given Right to sell it back to us at outragous profits - and to question this arrangement automatically means you're a Nazi or a Stalinist? You sure you want to stick with this view? Personally I'd like to Nationalise all these companies ASAP - If they did what you suggest, then that's what will happen - So yes, I wish they did pack it in and head to Dubai, where they can join those other \"Patriots,\" Haleberton. Dave",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 03:32:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by FriscoLady01: I doubt that any of the corporations or companies are strong enough to do this now except for maybe the oil companies. However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States. I know just a pipe dream (yes that is a pun), but I would love to see someone with the clout do it - especially to this administration and Congress! My husband just accused me of advocating corporate blackmail or terrorism, maybe so but our own government is killing our nation with regulations! What other nation has ever commited suicide in this manner? Frisco PS: Or since our favorite hobby is boating, move to sailing from motoring like we did. The wind is free so far, but I am sure the government will find a way to tax, regulate, and deny free enterprise of that too if given half a chance! I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave I have a oil digging shovel for sale",
        "intTime": 20090403,
        "postID": 27,
        "quote": "Originally posted by Grachus: quote: Originally posted by FriscoLady01: I doubt that any of the corporations or companies are strong enough to do this now except for maybe the oil companies. However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States. I know just a pipe dream (yes that is a pun), but I would love to see someone with the clout do it - especially to this administration and Congress! My husband just accused me of advocating corporate blackmail or terrorism, maybe so but our own government is killing our nation with regulations! What other nation has ever commited suicide in this manner? Frisco PS: Or since our favorite hobby is boating, move to sailing from motoring like we did. The wind is free so far, but I am sure the government will find a way to tax, regulate, and deny free enterprise of that too if given half a chance! I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave",
        "reply": " I have a oil digging shovel for sale",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 05:28:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco Are you saying that Norway, Denmark, Mexico, and a whole bunch of other countries are Communist Dictatorships? Tell me who OWNS the land where the oil is found? Who GIVES this oil to the oil companies at bargain basement prices? Who FINDS the oil for these companies? Well the answer to ALL the above is us - And in return for this largese, they have a God Given Right to sell it back to us at outragous profits - and to question this arrangement automatically means you're a Nazi or a Stalinist? You sure you want to stick with this view? Personally I'd like to Nationalise all these companies ASAP - If they did what you suggest, then that's what will happen - So yes, I wish they did pack it in and head to Dubai, where they can join those other \"Patriots,\" Haleberton. Dave Socialist at best, and fast on the way to Communist. My Great Grandfather after his military career raised horses in Prussia, he was made fairly wealthy by it, however because of the breed and the quality of the Horse, the only customer that he was allowed to sell to was the Kindgom of Prussia's military and later the German Imperial Army. After we immigrated to this country my Father made his fortune through the development of batteries, in fact I imagine every household in the US has at least one in the household if not more. He is still paid royalities for his research and development with the old now defunct Mallory Co. But another Co. now holds the license. That is called capitalism, duh! Can you imagine what you and I would be paying for batteries if the industry was nationalized. Our petrol products are far cheaper than in any country that has nationalized the industry or any other industry for that matter. So if you want nationalization, you move to Mexico or Norway, etc. Any move towards nationalization, or socialism is in my mind a step towards communism, or for that matter facism. Not going to go through that again, will leave first or as a last resort resist with everything I have in me! Frisco",
        "intTime": 20090403,
        "postID": 28,
        "quote": "Originally posted by Grachus: quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco Are you saying that Norway, Denmark, Mexico, and a whole bunch of other countries are Communist Dictatorships? Tell me who OWNS the land where the oil is found? Who GIVES this oil to the oil companies at bargain basement prices? Who FINDS the oil for these companies? Well the answer to ALL the above is us - And in return for this largese, they have a God Given Right to sell it back to us at outragous profits - and to question this arrangement automatically means you're a Nazi or a Stalinist? You sure you want to stick with this view? Personally I'd like to Nationalise all these companies ASAP - If they did what you suggest, then that's what will happen - So yes, I wish they did pack it in and head to Dubai, where they can join those other \"Patriots,\" Haleberton. Dave",
        "reply": " Socialist at best, and fast on the way to Communist. My Great Grandfather after his military career raised horses in Prussia, he was made fairly wealthy by it, however because of the breed and the quality of the Horse, the only customer that he was allowed to sell to was the Kindgom of Prussia's military and later the German Imperial Army. After we immigrated to this country my Father made his fortune through the development of batteries, in fact I imagine every household in the US has at least one in the household if not more. He is still paid royalities for his research and development with the old now defunct Mallory Co. But another Co. now holds the license. That is called capitalism, duh! Can you imagine what you and I would be paying for batteries if the industry was nationalized. Our petrol products are far cheaper than in any country that has nationalized the industry or any other industry for that matter. So if you want nationalization, you move to Mexico or Norway, etc. Any move towards nationalization, or socialism is in my mind a step towards communism, or for that matter facism. Not going to go through that again, will leave first or as a last resort resist with everything I have in me! Frisco",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 06:49:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "FriscoLady01"
    },
    {
        "content": "I haven't read this current bill, but if it's the same one which was voted down before, I'm all for it. Why, you may ask? Don't you and your wife both smoke? Yes, we do, but there's a little known provision in that bill which, I think, will allow my wife to force not only the taxpayers to buy her cigarettes, but also force restuarants and bars to re-open smoking sections. I won't say any more about that now, but if that bill becomes law, you anti-smokers will be genuinely surprised at what it does.",
        "intTime": 20090403,
        "postID": 29,
        "quote": "",
        "reply": "I haven't read this current bill, but if it's the same one which was voted down before, I'm all for it. Why, you may ask? Don't you and your wife both smoke? Yes, we do, but there's a little known provision in that bill which, I think, will allow my wife to force not only the taxpayers to buy her cigarettes, but also force restuarants and bars to re-open smoking sections. I won't say any more about that now, but if that bill becomes law, you anti-smokers will be genuinely surprised at what it does.",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 07:05:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "stillkit"
    },
    {
        "content": "quote: you anti-smokers will be genuinely surprised at what it does. hahahahaha aint it always like that?? maybe one day we the people will relitize its not good to get the gov involved with stuff like this and trans fats ect....",
        "intTime": 20090403,
        "postID": 30,
        "quote": "you anti-smokers will be genuinely surprised at what it does.",
        "reply": " hahahahaha aint it always like that?? maybe one day we the people will relitize its not good to get the gov involved with stuff like this and trans fats ect....",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 07:31:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "outlaws93"
    },
    {
        "content": "quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco Are you saying that Norway, Denmark, Mexico, and a whole bunch of other countries are Communist Dictatorships? Tell me who OWNS the land where the oil is found? Who GIVES this oil to the oil companies at bargain basement prices? Who FINDS the oil for these companies? Well the answer to ALL the above is us - And in return for this largese, they have a God Given Right to sell it back to us at outragous profits - and to question this arrangement automatically means you're a Nazi or a Stalinist? You sure you want to stick with this view? Personally I'd like to Nationalise all these companies ASAP - If they did what you suggest, then that's what will happen - So yes, I wish they did pack it in and head to Dubai, where they can join those other \"Patriots,\" Haleberton. Dave Socialist at best, and fast on the way to Communist. My Great Grandfather after his military career raised horses in Prussia, he was made fairly wealthy by it, however because of the breed and the quality of the Horse, the only customer that he was allowed to sell to was the Kindgom of Prussia's military and later the German Imperial Army. After we immigrated to this country my Father made his fortune through the development of batteries, in fact I imagine every household in the US has at least one in the household if not more. He is still paid royalities for his research and development with the old now defunct Mallory Co. But another Co. now holds the license. That is called capitalism, duh! Can you imagine what you and I would be paying for batteries if the industry was nationalized. Our petrol products are far cheaper than in any country that has nationalized the industry or any other industry for that matter. So if you want nationalization, you move to Mexico or Norway, etc. Any move towards nationalization, or socialism is in my mind a step towards communism, or for that matter facism. Not going to go through that again, will leave first or as a last resort resist with everything I have in me! Frisco Most countries with State owned oil companies sell gas for far less than we do - And those that don't have high taxes, which affect BOTH State owned and privately owned oil companies. So you are actually claiming that all these countries will soon become Communist? Now as for the family history. That's nice. More power to him! So, did the government give him his battery patent, as the government GIVES the oil companies OUR oil? Or maybe you feel it's an example of hard work, and innitative where the government \"leases\" land to the timber companies at two cents an acre, from which they strip the forest, and sell the wood for $1000 a tree? As we all know government is incapable of cutting tree's on their own. We need a \"Capitalist\" to get those stinking tree's off our land ASAP? Dave",
        "intTime": 20090403,
        "postID": 31,
        "quote": "Originally posted by FriscoLady01: quote: Originally posted by Grachus: quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco Are you saying that Norway, Denmark, Mexico, and a whole bunch of other countries are Communist Dictatorships? Tell me who OWNS the land where the oil is found? Who GIVES this oil to the oil companies at bargain basement prices? Who FINDS the oil for these companies? Well the answer to ALL the above is us - And in return for this largese, they have a God Given Right to sell it back to us at outragous profits - and to question this arrangement automatically means you're a Nazi or a Stalinist? You sure you want to stick with this view? Personally I'd like to Nationalise all these companies ASAP - If they did what you suggest, then that's what will happen - So yes, I wish they did pack it in and head to Dubai, where they can join those other \"Patriots,\" Haleberton. Dave Socialist at best, and fast on the way to Communist. My Great Grandfather after his military career raised horses in Prussia, he was made fairly wealthy by it, however because of the breed and the quality of the Horse, the only customer that he was allowed to sell to was the Kindgom of Prussia's military and later the German Imperial Army. After we immigrated to this country my Father made his fortune through the development of batteries, in fact I imagine every household in the US has at least one in the household if not more. He is still paid royalities for his research and development with the old now defunct Mallory Co. But another Co. now holds the license. That is called capitalism, duh! Can you imagine what you and I would be paying for batteries if the industry was nationalized. Our petrol products are far cheaper than in any country that has nationalized the industry or any other industry for that matter. So if you want nationalization, you move to Mexico or Norway, etc. Any move towards nationalization, or socialism is in my mind a step towards communism, or for that matter facism. Not going to go through that again, will leave first or as a last resort resist with everything I have in me! Frisco",
        "reply": " Most countries with State owned oil companies sell gas for far less than we do - And those that don't have high taxes, which affect BOTH State owned and privately owned oil companies. So you are actually claiming that all these countries will soon become Communist? Now as for the family history. That's nice. More power to him! So, did the government give him his battery patent, as the government GIVES the oil companies OUR oil? Or maybe you feel it's an example of hard work, and innitative where the government \"leases\" land to the timber companies at two cents an acre, from which they strip the forest, and sell the wood for $1000 a tree? As we all know government is incapable of cutting tree's on their own. We need a \"Capitalist\" to get those stinking tree's off our land ASAP? Dave",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 08:05:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco Are you saying that Norway, Denmark, Mexico, and a whole bunch of other countries are Communist Dictatorships? Tell me who OWNS the land where the oil is found? Who GIVES this oil to the oil companies at bargain basement prices? Who FINDS the oil for these companies? Well the answer to ALL the above is us - And in return for this largese, they have a God Given Right to sell it back to us at outragous profits - and to question this arrangement automatically means you're a Nazi or a Stalinist? You sure you want to stick with this view? Personally I'd like to Nationalise all these companies ASAP - If they did what you suggest, then that's what will happen - So yes, I wish they did pack it in and head to Dubai, where they can join those other \"Patriots,\" Haleberton. Dave Socialist at best, and fast on the way to Communist. My Great Grandfather after his military career raised horses in Prussia, he was made fairly wealthy by it, however because of the breed and the quality of the Horse, the only customer that he was allowed to sell to was the Kindgom of Prussia's military and later the German Imperial Army. After we immigrated to this country my Father made his fortune through the development of batteries, in fact I imagine every household in the US has at least one in the household if not more. He is still paid royalities for his research and development with the old now defunct Mallory Co. But another Co. now holds the license. That is called capitalism, duh! Can you imagine what you and I would be paying for batteries if the industry was nationalized. Our petrol products are far cheaper than in any country that has nationalized the industry or any other industry for that matter. So if you want nationalization, you move to Mexico or Norway, etc. Any move towards nationalization, or socialism is in my mind a step towards communism, or for that matter facism. Not going to go through that again, will leave first or as a last resort resist with everything I have in me! Frisco Most countries with State owned oil companies sell gas for far less than we do - And those that don't have high taxes, which affect BOTH State owned and privately owned oil companies. So you are actually claiming that all these countries will soon become Communist? Now as for the family history. That's nice. More power to him! So, did the government give him his battery patent, as the government GIVES the oil companies OUR oil? Or maybe you feel it's an example of hard work, and innitative where the government \"leases\" land to the timber companies at two cents an acre, from which they strip the forest, and sell the wood for $1000 a tree? As we all know government is incapable of cutting tree's on their own. We need a \"Capitalist\" to get those stinking tree's off our land ASAP? Dave Some other examples are: * The hard rock mining laws. Look them up they GIVE away mineral rights and NO ONE has the right to block the companies. * So called clean out contracts to reduce fire fuel were companies are PAID to remove timber and often the companies would make a big profit off the timber even without being paid with TAX money. I don't have a problem with the contracts when because of volume, location, etc. the company could not makea good profit with out being paid.",
        "intTime": 20090403,
        "postID": 32,
        "quote": "Originally posted by Grachus: quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: quote: Originally posted by FriscoLady01: quote: Originally posted by Grachus: I wish the oil companies would do this as well, revealing that their just a bunch of parasites, who sell us back our own oil at outrageous profits. Then we can Nationalise them, and set up a State Oil company such as most countries have. Dave Have you been reading a little Lenin lately? Maybe you prefer Stalin? My family went though that kind of thing with Hitler, won't sit still for it this time. Hopefully the people of our country will use the communists very tactics against such in this country. You cannot nationalize something that will not work because the people refuse to work. We were already moving toward tyranny under previous administrations this administration is just mor blatant about it. This move must be stopped! Or maybe you prefer to be a Lemming? Frisco Are you saying that Norway, Denmark, Mexico, and a whole bunch of other countries are Communist Dictatorships? Tell me who OWNS the land where the oil is found? Who GIVES this oil to the oil companies at bargain basement prices? Who FINDS the oil for these companies? Well the answer to ALL the above is us - And in return for this largese, they have a God Given Right to sell it back to us at outragous profits - and to question this arrangement automatically means you're a Nazi or a Stalinist? You sure you want to stick with this view? Personally I'd like to Nationalise all these companies ASAP - If they did what you suggest, then that's what will happen - So yes, I wish they did pack it in and head to Dubai, where they can join those other \"Patriots,\" Haleberton. Dave Socialist at best, and fast on the way to Communist. My Great Grandfather after his military career raised horses in Prussia, he was made fairly wealthy by it, however because of the breed and the quality of the Horse, the only customer that he was allowed to sell to was the Kindgom of Prussia's military and later the German Imperial Army. After we immigrated to this country my Father made his fortune through the development of batteries, in fact I imagine every household in the US has at least one in the household if not more. He is still paid royalities for his research and development with the old now defunct Mallory Co. But another Co. now holds the license. That is called capitalism, duh! Can you imagine what you and I would be paying for batteries if the industry was nationalized. Our petrol products are far cheaper than in any country that has nationalized the industry or any other industry for that matter. So if you want nationalization, you move to Mexico or Norway, etc. Any move towards nationalization, or socialism is in my mind a step towards communism, or for that matter facism. Not going to go through that again, will leave first or as a last resort resist with everything I have in me! Frisco Most countries with State owned oil companies sell gas for far less than we do - And those that don't have high taxes, which affect BOTH State owned and privately owned oil companies. So you are actually claiming that all these countries will soon become Communist? Now as for the family history. That's nice. More power to him! So, did the government give him his battery patent, as the government GIVES the oil companies OUR oil? Or maybe you feel it's an example of hard work, and innitative where the government \"leases\" land to the timber companies at two cents an acre, from which they strip the forest, and sell the wood for $1000 a tree? As we all know government is incapable of cutting tree's on their own. We need a \"Capitalist\" to get those stinking tree's off our land ASAP? Dave",
        "reply": " Some other examples are: * The hard rock mining laws. Look them up they GIVE away mineral rights and NO ONE has the right to block the companies. * So called clean out contracts to reduce fire fuel were companies are PAID to remove timber and often the companies would make a big profit off the timber even without being paid with TAX money. I don't have a problem with the contracts when because of volume, location, etc. the company could not makea good profit with out being paid.",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 08:20:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "rayld2"
    },
    {
        "content": "quote: * The hard rock mining laws. Look them up they GIVE away mineral rights and NO ONE has the right to block the companies. my family owns mining rights to sulfur mines here in fl... enough to supply our sulfur needs for 100s of years... but environmentalist have been blocking us for 30+years now... also would make my family filthy rich and i would be able to get off of disability and pay for my own medical needs...",
        "intTime": 20090403,
        "postID": 33,
        "quote": "* The hard rock mining laws. Look them up they GIVE away mineral rights and NO ONE has the right to block the companies.",
        "reply": " my family owns mining rights to sulfur mines here in fl... enough to supply our sulfur needs for 100s of years... but environmentalist have been blocking us for 30+years now... also would make my family filthy rich and i would be able to get off of disability and pay for my own medical needs...",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-03 08:27:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "outlaws93"
    },
    {
        "content": "\"The World's Finest\"",
        "intTime": 20090404,
        "postID": 34,
        "quote": "",
        "reply": "\"The World's Finest\"",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-04 12:28:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "Kegler300"
    },
    {
        "content": "quote: Originally posted by Kegler300: Don't you think we should tax butter, and all those mindless jerks who eat it, clog up their arteries, and then expect us to bail them out with free triple by-pass surgery? A tax on butter will save millions of lives, and those jerks will just have to learn to live without it, OR if they insist, at least contributing to the high cost of surgery? And that's just for starters! I have a list! And I sure hope that you don't like Bar-b-cued ribs, 'cause that's next on my list... *********************** I don't complain about rules for no smoking in closed environments. I don't complain because the smell of smoke is legitimately annoying to some people - But I've had people walk up to me in the midst of a diesal fog and complain about my smoking - Who the hell is The State to tell me what to do with my own body? If the State feels that smoking should be outlawed, then let them go ahead and do it. What is this tax crap? What are all these jerks, who probably have their OWN bad habits, complaining about mine? It's one thing for the government to outlaw a product, it's another for them to tax it. If they can tax this, they can tax anything - And WILL tax anything. Those who don't smoke can be smug and comfortable all they want - Let them wait until Big Daddy gives them the bad news about what they enjoy. Dave",
        "intTime": 20090404,
        "postID": 35,
        "quote": "Originally posted by Kegler300:",
        "reply": " Don't you think we should tax butter, and all those mindless jerks who eat it, clog up their arteries, and then expect us to bail them out with free triple by-pass surgery? A tax on butter will save millions of lives, and those jerks will just have to learn to live without it, OR if they insist, at least contributing to the high cost of surgery? And that's just for starters! I have a list! And I sure hope that you don't like Bar-b-cued ribs, 'cause that's next on my list... *********************** I don't complain about rules for no smoking in closed environments. I don't complain because the smell of smoke is legitimately annoying to some people - But I've had people walk up to me in the midst of a diesal fog and complain about my smoking - Who the hell is The State to tell me what to do with my own body? If the State feels that smoking should be outlawed, then let them go ahead and do it. What is this tax crap? What are all these jerks, who probably have their OWN bad habits, complaining about mine? It's one thing for the government to outlaw a product, it's another for them to tax it. If they can tax this, they can tax anything - And WILL tax anything. Those who don't smoke can be smug and comfortable all they want - Let them wait until Big Daddy gives them the bad news about what they enjoy. Dave",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-04 13:30:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "Grachus"
    },
    {
        "content": "quote: However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. What restrictions? Jesus what country have you been living in? You and the rest of the republican anti-protectionist and uneven \"free trade\" policies have been the cause of this economic mess were in. If Americans had jobs, the banks going under would not have happened and we wouldn't be sitting on trillions of dollars of debt. It is those exact policies that have caused what were in now and you say you want more of that? Good grief learn from history. Those policies HAVE failed this nation. Why can't the Reps see that? This message has been edited. Last edited by: crackerjacks61, Mon 06 April 2009 05:52 PM",
        "intTime": 20090406,
        "postID": 36,
        "quote": "However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down.",
        "reply": " What restrictions? Jesus what country have you been living in? You and the rest of the republican anti-protectionist and uneven \"free trade\" policies have been the cause of this economic mess were in. If Americans had jobs, the banks going under would not have happened and we wouldn't be sitting on trillions of dollars of debt. It is those exact policies that have caused what were in now and you say you want more of that? Good grief learn from history. Those policies HAVE failed this nation. Why can't the Reps see that? This message has been edited. Last edited by: crackerjacks61, Mon 06 April 2009 05:52 PM",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-06 17:31:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "crackerjacks61"
    },
    {
        "content": "I think we should tax the hell out of beer and alcohol like they do cigarettes. It's a free country, If I want to smoke I will and I do. Time for others to share the tax burden in the so called \"sin taxes\".",
        "intTime": 20090406,
        "postID": 37,
        "quote": "",
        "reply": "I think we should tax the hell out of beer and alcohol like they do cigarettes. It's a free country, If I want to smoke I will and I do. Time for others to share the tax burden in the so called \"sin taxes\".",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-06 17:48:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Kegler300: Don't you think we should tax butter, and all those mindless jerks who eat it, clog up their arteries, and then expect us to bail them out with free triple by-pass surgery? A tax on butter will save millions of lives, and those jerks will just have to learn to live without it, OR if they insist, at least contributing to the high cost of surgery? And that's just for starters! I have a list! And I sure hope that you don't like Bar-b-cued ribs, 'cause that's next on my list... *********************** I don't complain about rules for no smoking in closed environments. I don't complain because the smell of smoke is legitimately annoying to some people - But I've had people walk up to me in the midst of a diesal fog and complain about my smoking - Who the hell is The State to tell me what to do with my own body? If the State feels that smoking should be outlawed, then let them go ahead and do it. What is this tax crap? What are all these jerks, who probably have their OWN bad habits, complaining about mine? It's one thing for the government to outlaw a product, it's another for them to tax it. If they can tax this, they can tax anything - And WILL tax anything. Those who don't smoke can be smug and comfortable all they want - Let them wait until Big Daddy gives them the bad news about what they enjoy. Dave",
        "intTime": 20090406,
        "postID": 38,
        "quote": "Originally posted by Grachus: quote: Originally posted by Kegler300: Don't you think we should tax butter, and all those mindless jerks who eat it, clog up their arteries, and then expect us to bail them out with free triple by-pass surgery? A tax on butter will save millions of lives, and those jerks will just have to learn to live without it, OR if they insist, at least contributing to the high cost of surgery? And that's just for starters! I have a list! And I sure hope that you don't like Bar-b-cued ribs, 'cause that's next on my list... *********************** I don't complain about rules for no smoking in closed environments. I don't complain because the smell of smoke is legitimately annoying to some people - But I've had people walk up to me in the midst of a diesal fog and complain about my smoking - Who the hell is The State to tell me what to do with my own body? If the State feels that smoking should be outlawed, then let them go ahead and do it. What is this tax crap? What are all these jerks, who probably have their OWN bad habits, complaining about mine? It's one thing for the government to outlaw a product, it's another for them to tax it. If they can tax this, they can tax anything - And WILL tax anything. Those who don't smoke can be smug and comfortable all they want - Let them wait until Big Daddy gives them the bad news about what they enjoy. Dave",
        "reply": "",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-06 17:49:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by FriscoLady01: However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Yes I know, but that would get the point to the people too and maybe get them to put pressure on on the governemnt as well. Also, refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States. Frisco, you do know that that would just have two effects... 1. end all the tax that is gleaned form tobacco products...the programs won't end, it will just mean more taxes out of everyone's pocket instead of from smokers' pockets. 2. The world's leading tobacco producer is China. If we shut down tobacco production here, where do you think we will get smokes from? That's right, go further in hoc to our our biggest creditor. Not only will we put more Americans out of work in favor of Chinese products, we will be getting tobacco from a country where producers put melamine in baby formula. God knows what thyey put in tobacco. You think it's bad with some extra nicotine. And who will pay for all the health issues caused by this jacked-up Chinese tobacco? Yup, you guessed it. As far as oil goes, the nation already discovered how much they hate the oil industry. 5 years ago, the idea that we needed to go full-scale nuclear so we could all have electric or fuel-cell cars was laughable. Not so much now. The oil industry needs to convince people that they, and not alternates, should be powering our vehicles into the future. NOBODY got a kick out of $5 gas except the oil companies. If they were to try a little industrial blackmail, at best I could see a huge outpouring of support for the government to subsidize public trans and alternate fuel cars powered by a boom in in the nuke industry. At worst, I could see a liberal 5-4 USSC allowing the federal government to nationalize the energy industry.",
        "intTime": 20090407,
        "postID": 39,
        "quote": "Originally posted by FriscoLady01: However, I have said for years that the Tobacco companies, car companies, and oil companies should tell the government either remove all restrictions on how and where we do business or we will shut this country down. Phillip Morris should do this regardless after the recent Supreme Court decision against them (and this coming out of congress). Remove all assets from the United States, move Corporate Headquarters (if they have not already), immediately lawoff all employees in the United States unless they move overseas to keep their employment. Yes I know, but that would get the point to the people too and maybe get them to put pressure on on the governemnt as well. Also, refuse to sell or buy product within the United States. Bet the government would change it's mind real quick about regulating these companies (especially the oil companies - not so much the cigarette companies) if this country was shut down! Hey Oil companies are you reading this? Doubt it, but I hope so! Your message to the government should be either open up the off shore oil fields to drilling, drop the restrictive taxes (all restrictive taxes do to with industry of any kind) or invest in a horse and buggy! For their will be no fuel of any kind mined, pumped, refined or sold in the United States.",
        "reply": " Frisco, you do know that that would just have two effects... 1. end all the tax that is gleaned form tobacco products...the programs won't end, it will just mean more taxes out of everyone's pocket instead of from smokers' pockets. 2. The world's leading tobacco producer is China. If we shut down tobacco production here, where do you think we will get smokes from? That's right, go further in hoc to our our biggest creditor. Not only will we put more Americans out of work in favor of Chinese products, we will be getting tobacco from a country where producers put melamine in baby formula. God knows what thyey put in tobacco. You think it's bad with some extra nicotine. And who will pay for all the health issues caused by this jacked-up Chinese tobacco? Yup, you guessed it. As far as oil goes, the nation already discovered how much they hate the oil industry. 5 years ago, the idea that we needed to go full-scale nuclear so we could all have electric or fuel-cell cars was laughable. Not so much now. The oil industry needs to convince people that they, and not alternates, should be powering our vehicles into the future. NOBODY got a kick out of $5 gas except the oil companies. If they were to try a little industrial blackmail, at best I could see a huge outpouring of support for the government to subsidize public trans and alternate fuel cars powered by a boom in in the nuke industry. At worst, I could see a liberal 5-4 USSC allowing the federal government to nationalize the energy industry.",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-07 08:25:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "jwr6"
    },
    {
        "content": "quote: Originally posted by _cash_: If government really wanted people to quit smoking.....they'd quit subsidizing tobacco crops and just make cigarete manufacturing and sales illegal. They don't! They don't want people to quit, they just want most people to quit. Governments get a LOT of taxes off tobacco products, and it's taxes that a clear majority of people support. It's almost a perfect system. Most people don't smoke. They don't care how high taxes on tobacco gets, so it's easy to pass the tax increases. For every smoker that dies or quits, another takes their place, so it's a predictable stream of tax revenue for local, state and federal government. Plus, they subsidize tobacco because if they didn't, Phillip Morris and others would just import it from China. As it's not a meat/dairy product, it wouldn't get inspected by the government, either.",
        "intTime": 20090407,
        "postID": 40,
        "quote": "Originally posted by _cash_: If government really wanted people to quit smoking.....they'd quit subsidizing tobacco crops and just make cigarete manufacturing and sales illegal. They don't!",
        "reply": " They don't want people to quit, they just want most people to quit. Governments get a LOT of taxes off tobacco products, and it's taxes that a clear majority of people support. It's almost a perfect system. Most people don't smoke. They don't care how high taxes on tobacco gets, so it's easy to pass the tax increases. For every smoker that dies or quits, another takes their place, so it's a predictable stream of tax revenue for local, state and federal government. Plus, they subsidize tobacco because if they didn't, Phillip Morris and others would just import it from China. As it's not a meat/dairy product, it wouldn't get inspected by the government, either.",
        "threadID": "672198221_9650096912001",
        "time": "2009-04-07 08:43:00",
        "title": "House votes to put tobacco under FDA control",
        "userID": "jwr6"
    }
]