[
    {
        "content": "What next? The Ihouse? ++http://ca.autos.yahoo.com/p/1242/shape-shifting-ichange quote: Shape-shifting iChange - Shane O' Donoghue Rinspeed's enthusiasm for quirky concept cars has not been extinguished by anything as inconvenient as a global recession, as witnessed by the debut in Geneva of the mad - and rather cool - iChange concept car. What's all the fuss about? Well, you'd think that the exterior styling of the ankle-low iChange concept would be enough to get our tongues wagging, but if you know anything about Rinspeed you'll have guessed that there's more to this year's Geneva show offering. As standard, the electric and solar-powered iChange seats just the driver, but at the touch of a button the sleek glasshouse rises up to make room for two rear passengers. It's hardly a people carrier, but still fairly useful, especially as, in single-person mode, the iChange is more aerodynamic helping to reduce fuel consumption - which in this case is electricity. Any new technology? Rinspeed may like to think outside the box, but its concept cars always utilise the skills and technology of several key suppliers and the iChange is no different. Saying that, lithium-ion battery power and solar panels in the roof are not exactly groundbreaking ideas, though they're hardly widespread as yet. Gadget fiends will however, particularly love the Apple iPhone controlled 'ignition' and it can be used to control other functions too. Will it ever see the light of day? This is one concept car we can quite confidently say won't ever be sold to the public. Rinspeed annually unveils its wild creations in Geneva and maintains that each and every one of them could go into production if someone stumps up enough cash to... (...)", 
        "intTime": 20090306, 
        "postID": 1, 
        "quote": "Shape-shifting iChange - Shane O' Donoghue Rinspeed's enthusiasm for quirky concept cars has not been extinguished by anything as inconvenient as a global recession, as witnessed by the debut in Geneva of the mad - and rather cool - iChange concept car. What's all the fuss about? Well, you'd think that the exterior styling of the ankle-low iChange concept would be enough to get our tongues wagging, but if you know anything about Rinspeed you'll have guessed that there's more to this year's Geneva show offering. As standard, the electric and solar-powered iChange seats just the driver, but at the touch of a button the sleek glasshouse rises up to make room for two rear passengers. It's hardly a people carrier, but still fairly useful, especially as, in single-person mode, the iChange is more aerodynamic helping to reduce fuel consumption - which in this case is electricity. Any new technology? Rinspeed may like to think outside the box, but its concept cars always utilise the skills and technology of several key suppliers and the iChange is no different. Saying that, lithium-ion battery power and solar panels in the roof are not exactly groundbreaking ideas, though they're hardly widespread as yet. Gadget fiends will however, particularly love the Apple iPhone controlled 'ignition' and it can be used to control other functions too. Will it ever see the light of day? This is one concept car we can quite confidently say won't ever be sold to the public. Rinspeed annually unveils its wild creations in Geneva and maintains that each and every one of them could go into production if someone stumps up enough cash to... (...)", 
        "reply": "What next? The Ihouse? ++http://ca.autos.yahoo.com/p/1242/shape-shifting-ichange ", 
        "threadID": "672198221_8490001712001", 
        "time": "2009-03-06 11:22:00", 
        "title": "new car controlled by Ipod unveiled- called the \"Ichange\"", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Interesting but I'd need 2. 1 for each foot. That said I think the model(blonde, not the auto) is way overdressed.", 
        "intTime": 20090306, 
        "postID": 2, 
        "quote": "", 
        "reply": "Interesting but I'd need 2. 1 for each foot. That said I think the model(blonde, not the auto) is way overdressed.", 
        "threadID": "672198221_8490001712001", 
        "time": "2009-03-06 11:30:00", 
        "title": "new car controlled by Ipod unveiled- called the \"Ichange\"", 
        "userID": "Sand_Flea"
    }
]