[
    {
        "content": "Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "intTime": 20090529, 
        "postID": 1, 
        "quote": "", 
        "reply": "Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-29 23:31:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts? Not anymore he pretty much lost a lot of support from the right for his backing of obama. but if i had chooseing general Petraeus.", 
        "intTime": 20090529, 
        "postID": 2, 
        "quote": "Originally posted by usa_girl: Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "reply": " Not anymore he pretty much lost a lot of support from the right for his backing of obama. but if i had chooseing general Petraeus.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-29 23:57:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "world_king377"
    }, 
    {
        "content": "General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "intTime": 20090530, 
        "postID": 3, 
        "quote": "", 
        "reply": "General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:02:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Agent991"
    }, 
    {
        "content": "I am not really seeing much talent come from the Reps right now. They still have time, but they need to get their act together, freshen up a bit and stop living in the Reagan years. Bitterness will not get them elected next time around. They need a plan, they need to be positive and they need to look to the future. There is no room for division in America. We have to find a way to meet in the middle. I think you are going to see a rise in my party, the Independent party woot woot You heard it here first. We are tired of the two sides messing around. We want accountability and action. We want the right person to have the job and they have to earn it, not just expect it based on blue state, red state, left or right.", 
        "intTime": 20090530, 
        "postID": 4, 
        "quote": "", 
        "reply": "I am not really seeing much talent come from the Reps right now. They still have time, but they need to get their act together, freshen up a bit and stop living in the Reagan years. Bitterness will not get them elected next time around. They need a plan, they need to be positive and they need to look to the future. There is no room for division in America. We have to find a way to meet in the middle. I think you are going to see a rise in my party, the Independent party woot woot You heard it here first. We are tired of the two sides messing around. We want accountability and action. We want the right person to have the job and they have to earn it, not just expect it based on blue state, red state, left or right.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:21:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "- Palin. Hahah, kidding. Powell. Even if he boned himself at the UN, he's gotta be the best of the field. -", 
        "intTime": 20090530, 
        "postID": 5, 
        "quote": "", 
        "reply": "- Palin. Hahah, kidding. Powell. Even if he boned himself at the UN, he's gotta be the best of the field. -", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:32:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "intTime": 20090530, 
        "postID": 6, 
        "quote": "Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "reply": " The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:33:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible... The coming future with the sudden flex of muscles. We will need a leader who has the exp of leading men and has the nerves of steel to deal peacefully and at times to come down like a hammer on a nail against anyone who threatens America. The General show's he has what it takes to speak soft and at the same time carry a big stick.", 
        "intTime": 20090530, 
        "postID": 7, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "reply": " The coming future with the sudden flex of muscles. We will need a leader who has the exp of leading men and has the nerves of steel to deal peacefully and at times to come down like a hammer on a nail against anyone who threatens America. The General show's he has what it takes to speak soft and at the same time carry a big stick.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:50:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "world_king377"
    }, 
    {
        "content": "Mike Huckabee would be a good choice. I wonder if he knows Smoke on the Water...", 
        "intTime": 20090530, 
        "postID": 8, 
        "quote": "", 
        "reply": "Mike Huckabee would be a good choice. I wonder if he knows Smoke on the Water...", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:51:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Love that song! Smoke on the Water,,,Fire i the Sky! Yep,,,Huckabee is 'well spoken' with a wry sense of humor and a sharp wit. But I stil like Petreaus. BUT HE SAYS \"\"NO\"\" so far.", 
        "intTime": 20090530, 
        "postID": 9, 
        "quote": "", 
        "reply": "Love that song! Smoke on the Water,,,Fire i the Sky! Yep,,,Huckabee is 'well spoken' with a wry sense of humor and a sharp wit. But I stil like Petreaus. BUT HE SAYS \"\"NO\"\" so far.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:56:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Agent991"
    }, 
    {
        "content": "I guess a David Petraeus/Oliver North Ticket is too much to hope for, but I'd LOVE to see it. I've got two dogs that are smarter than Obama/Biden..... Duane A. Brinson \"Oscar mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "intTime": 20090530, 
        "postID": 10, 
        "quote": "", 
        "reply": "I guess a David Petraeus/Oliver North Ticket is too much to hope for, but I'd LOVE to see it. I've got two dogs that are smarter than Obama/Biden..... Duane A. Brinson \"Oscar mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 03:56:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible... Let me see now, who should I believe about Presidents Obama's approach to national defense? IRS? or this guy? \"In my view, I firmly believe that the United States is not only safe but it will be more secure and the American people are increasingly safer because of the president's leadership that he has displayed consistently over the last four months, both at home and abroad,\" Retired Marine Corps Gen. James Jones 05/27/09 http://thehill.com/leading-the-news/national-security-adviser-downplays-n.-korea-threat-2009-05-27.html Yep, think I'll go with the latter. This message has been edited. Last edited by: jdksfcret, Sat 30 May 2009 04:28 AM", 
        "intTime": 20090530, 
        "postID": 11, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "reply": " Let me see now, who should I believe about Presidents Obama's approach to national defense? IRS? or this guy? \"In my view, I firmly believe that the United States is not only safe but it will be more secure and the American people are increasingly safer because of the president's leadership that he has displayed consistently over the last four months, both at home and abroad,\" Retired Marine Corps Gen. James Jones 05/27/09 http://thehill.com/leading-the-news/national-security-adviser-downplays-n.-korea-threat-2009-05-27.html Yep, think I'll go with the latter. This message has been edited. Last edited by: jdksfcret, Sat 30 May 2009 04:28 AM", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 04:09:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "intTime": 20090530, 
        "postID": 12, 
        "quote": "", 
        "reply": "I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:12:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is.", 
        "intTime": 20090530, 
        "postID": 13, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " That's just as bad as voting for either party and not caring who it is.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:18:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. I'm pretty much on the same page...I'll take a look at who is running, but I don't think it make much of a difference. Until elected officials start thinking about the people over party, it won't matter who is in office.", 
        "intTime": 20090530, 
        "postID": 14, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " I'm pretty much on the same page...I'll take a look at who is running, but I don't think it make much of a difference. Until elected officials start thinking about the people over party, it won't matter who is in office.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:49:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is. YIP!!!! but if enough does the same, it will at least send a message. Wasted vote, probably but at least I can then bash either/or whoever gets in office, either dem or rep because, either/or will be crap...as usual.", 
        "intTime": 20090530, 
        "postID": 15, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is.", 
        "reply": " YIP!!!! but if enough does the same, it will at least send a message. Wasted vote, probably but at least I can then bash either/or whoever gets in office, either dem or rep because, either/or will be crap...as usual.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:04:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "What makes y'all think that either Petraeus or Powell would run as a Republican as long as folks like Limbaugh and the Religious Right have any say whatsoever in GOP policy?", 
        "intTime": 20090530, 
        "postID": 16, 
        "quote": "", 
        "reply": "What makes y'all think that either Petraeus or Powell would run as a Republican as long as folks like Limbaugh and the Religious Right have any say whatsoever in GOP policy?", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:26:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "intTime": 20090530, 
        "postID": 17, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:30:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all. There are more and more of us each day. I have been Indy since after the primaries last year. I was Dem then and since my vote was not to count (I was voting for Obama in the primaries) I felt the party was out of line so I left. Just reading the partisan hacks posting there bias BS causes me to be more and more repelled by both parties. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 18, 
        "quote": "Originally posted by Duster6: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "reply": " There are more and more of us each day. I have been Indy since after the primaries last year. I was Dem then and since my vote was not to count (I was voting for Obama in the primaries) I felt the party was out of line so I left. Just reading the partisan hacks posting there bias BS causes me to be more and more repelled by both parties. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:10:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "L0A1"
    }, 
    {
        "content": "Doesn't matter who the Republican's run, that person will be nothing more than a sacrificial lamb on a BBQ spit. In other words, nobody's going to beat Barack Hussein Obama. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090530, 
        "postID": 19, 
        "quote": "", 
        "reply": "Doesn't matter who the Republican's run, that person will be nothing more than a sacrificial lamb on a BBQ spit. In other words, nobody's going to beat Barack Hussein Obama. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:27:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "jack_flats"
    }, 
    {
        "content": "I'm not voting for another man or woman that won't open up all their information: Birth records, school records. Never Never again. OBAMA OBAMA OBAMA.... no way, no way, no way. Not the kind of change I expected. Just goes to show you that a pretty speech does not a president make!", 
        "intTime": 20090530, 
        "postID": 20, 
        "quote": "", 
        "reply": "I'm not voting for another man or woman that won't open up all their information: Birth records, school records. Never Never again. OBAMA OBAMA OBAMA.... no way, no way, no way. Not the kind of change I expected. Just goes to show you that a pretty speech does not a president make!", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:38:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "intTime": 20090529, 
        "postID": 21, 
        "quote": "", 
        "reply": "Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-29 23:31:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts? Not anymore he pretty much lost a lot of support from the right for his backing of obama. but if i had chooseing general Petraeus.", 
        "intTime": 20090529, 
        "postID": 22, 
        "quote": "Originally posted by usa_girl: Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "reply": " Not anymore he pretty much lost a lot of support from the right for his backing of obama. but if i had chooseing general Petraeus.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-29 23:57:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "world_king377"
    }, 
    {
        "content": "General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "intTime": 20090530, 
        "postID": 23, 
        "quote": "", 
        "reply": "General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:02:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Agent991"
    }, 
    {
        "content": "I am not really seeing much talent come from the Reps right now. They still have time, but they need to get their act together, freshen up a bit and stop living in the Reagan years. Bitterness will not get them elected next time around. They need a plan, they need to be positive and they need to look to the future. There is no room for division in America. We have to find a way to meet in the middle. I think you are going to see a rise in my party, the Independent party woot woot You heard it here first. We are tired of the two sides messing around. We want accountability and action. We want the right person to have the job and they have to earn it, not just expect it based on blue state, red state, left or right.", 
        "intTime": 20090530, 
        "postID": 24, 
        "quote": "", 
        "reply": "I am not really seeing much talent come from the Reps right now. They still have time, but they need to get their act together, freshen up a bit and stop living in the Reagan years. Bitterness will not get them elected next time around. They need a plan, they need to be positive and they need to look to the future. There is no room for division in America. We have to find a way to meet in the middle. I think you are going to see a rise in my party, the Independent party woot woot You heard it here first. We are tired of the two sides messing around. We want accountability and action. We want the right person to have the job and they have to earn it, not just expect it based on blue state, red state, left or right.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:21:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "- Palin. Hahah, kidding. Powell. Even if he boned himself at the UN, he's gotta be the best of the field. -", 
        "intTime": 20090530, 
        "postID": 25, 
        "quote": "", 
        "reply": "- Palin. Hahah, kidding. Powell. Even if he boned himself at the UN, he's gotta be the best of the field. -", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:32:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "intTime": 20090530, 
        "postID": 26, 
        "quote": "Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "reply": " The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:33:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible... The coming future with the sudden flex of muscles. We will need a leader who has the exp of leading men and has the nerves of steel to deal peacefully and at times to come down like a hammer on a nail against anyone who threatens America. The General show's he has what it takes to speak soft and at the same time carry a big stick.", 
        "intTime": 20090530, 
        "postID": 27, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "reply": " The coming future with the sudden flex of muscles. We will need a leader who has the exp of leading men and has the nerves of steel to deal peacefully and at times to come down like a hammer on a nail against anyone who threatens America. The General show's he has what it takes to speak soft and at the same time carry a big stick.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:50:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "world_king377"
    }, 
    {
        "content": "Mike Huckabee would be a good choice. I wonder if he knows Smoke on the Water...", 
        "intTime": 20090530, 
        "postID": 28, 
        "quote": "", 
        "reply": "Mike Huckabee would be a good choice. I wonder if he knows Smoke on the Water...", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:51:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Love that song! Smoke on the Water,,,Fire i the Sky! Yep,,,Huckabee is 'well spoken' with a wry sense of humor and a sharp wit. But I stil like Petreaus. BUT HE SAYS \"\"NO\"\" so far.", 
        "intTime": 20090530, 
        "postID": 29, 
        "quote": "", 
        "reply": "Love that song! Smoke on the Water,,,Fire i the Sky! Yep,,,Huckabee is 'well spoken' with a wry sense of humor and a sharp wit. But I stil like Petreaus. BUT HE SAYS \"\"NO\"\" so far.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:56:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Agent991"
    }, 
    {
        "content": "I guess a David Petraeus/Oliver North Ticket is too much to hope for, but I'd LOVE to see it. I've got two dogs that are smarter than Obama/Biden..... Duane A. Brinson \"Oscar mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "intTime": 20090530, 
        "postID": 30, 
        "quote": "", 
        "reply": "I guess a David Petraeus/Oliver North Ticket is too much to hope for, but I'd LOVE to see it. I've got two dogs that are smarter than Obama/Biden..... Duane A. Brinson \"Oscar mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 03:56:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible... Let me see now, who should I believe about Presidents Obama's approach to national defense? IRS? or this guy? \"In my view, I firmly believe that the United States is not only safe but it will be more secure and the American people are increasingly safer because of the president's leadership that he has displayed consistently over the last four months, both at home and abroad,\" Retired Marine Corps Gen. James Jones 05/27/09 http://thehill.com/leading-the-news/national-security-adviser-downplays-n.-korea-threat-2009-05-27.html Yep, think I'll go with the latter. This message has been edited. Last edited by: jdksfcret, Sat 30 May 2009 04:28 AM", 
        "intTime": 20090530, 
        "postID": 31, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "reply": " Let me see now, who should I believe about Presidents Obama's approach to national defense? IRS? or this guy? \"In my view, I firmly believe that the United States is not only safe but it will be more secure and the American people are increasingly safer because of the president's leadership that he has displayed consistently over the last four months, both at home and abroad,\" Retired Marine Corps Gen. James Jones 05/27/09 http://thehill.com/leading-the-news/national-security-adviser-downplays-n.-korea-threat-2009-05-27.html Yep, think I'll go with the latter. This message has been edited. Last edited by: jdksfcret, Sat 30 May 2009 04:28 AM", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 04:09:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "intTime": 20090530, 
        "postID": 32, 
        "quote": "", 
        "reply": "I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:12:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is.", 
        "intTime": 20090530, 
        "postID": 33, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " That's just as bad as voting for either party and not caring who it is.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:18:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. I'm pretty much on the same page...I'll take a look at who is running, but I don't think it make much of a difference. Until elected officials start thinking about the people over party, it won't matter who is in office.", 
        "intTime": 20090530, 
        "postID": 34, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " I'm pretty much on the same page...I'll take a look at who is running, but I don't think it make much of a difference. Until elected officials start thinking about the people over party, it won't matter who is in office.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:49:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is. YIP!!!! but if enough does the same, it will at least send a message. Wasted vote, probably but at least I can then bash either/or whoever gets in office, either dem or rep because, either/or will be crap...as usual.", 
        "intTime": 20090530, 
        "postID": 35, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is.", 
        "reply": " YIP!!!! but if enough does the same, it will at least send a message. Wasted vote, probably but at least I can then bash either/or whoever gets in office, either dem or rep because, either/or will be crap...as usual.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:04:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "What makes y'all think that either Petraeus or Powell would run as a Republican as long as folks like Limbaugh and the Religious Right have any say whatsoever in GOP policy?", 
        "intTime": 20090530, 
        "postID": 36, 
        "quote": "", 
        "reply": "What makes y'all think that either Petraeus or Powell would run as a Republican as long as folks like Limbaugh and the Religious Right have any say whatsoever in GOP policy?", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:26:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "intTime": 20090530, 
        "postID": 37, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:30:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all. There are more and more of us each day. I have been Indy since after the primaries last year. I was Dem then and since my vote was not to count (I was voting for Obama in the primaries) I felt the party was out of line so I left. Just reading the partisan hacks posting there bias BS causes me to be more and more repelled by both parties. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 38, 
        "quote": "Originally posted by Duster6: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "reply": " There are more and more of us each day. I have been Indy since after the primaries last year. I was Dem then and since my vote was not to count (I was voting for Obama in the primaries) I felt the party was out of line so I left. Just reading the partisan hacks posting there bias BS causes me to be more and more repelled by both parties. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:10:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "L0A1"
    }, 
    {
        "content": "Doesn't matter who the Republican's run, that person will be nothing more than a sacrificial lamb on a BBQ spit. In other words, nobody's going to beat Barack Hussein Obama. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090530, 
        "postID": 39, 
        "quote": "", 
        "reply": "Doesn't matter who the Republican's run, that person will be nothing more than a sacrificial lamb on a BBQ spit. In other words, nobody's going to beat Barack Hussein Obama. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:27:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "jack_flats"
    }, 
    {
        "content": "I'm not voting for another man or woman that won't open up all their information: Birth records, school records. Never Never again. OBAMA OBAMA OBAMA.... no way, no way, no way. Not the kind of change I expected. Just goes to show you that a pretty speech does not a president make!", 
        "intTime": 20090530, 
        "postID": 40, 
        "quote": "", 
        "reply": "I'm not voting for another man or woman that won't open up all their information: Birth records, school records. Never Never again. OBAMA OBAMA OBAMA.... no way, no way, no way. Not the kind of change I expected. Just goes to show you that a pretty speech does not a president make!", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:38:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "intTime": 20090529, 
        "postID": 41, 
        "quote": "", 
        "reply": "Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-29 23:31:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts? Not anymore he pretty much lost a lot of support from the right for his backing of obama. but if i had chooseing general Petraeus.", 
        "intTime": 20090529, 
        "postID": 42, 
        "quote": "Originally posted by usa_girl: Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "reply": " Not anymore he pretty much lost a lot of support from the right for his backing of obama. but if i had chooseing general Petraeus.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-29 23:57:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "world_king377"
    }, 
    {
        "content": "General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "intTime": 20090530, 
        "postID": 43, 
        "quote": "", 
        "reply": "General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:02:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Agent991"
    }, 
    {
        "content": "I am not really seeing much talent come from the Reps right now. They still have time, but they need to get their act together, freshen up a bit and stop living in the Reagan years. Bitterness will not get them elected next time around. They need a plan, they need to be positive and they need to look to the future. There is no room for division in America. We have to find a way to meet in the middle. I think you are going to see a rise in my party, the Independent party woot woot You heard it here first. We are tired of the two sides messing around. We want accountability and action. We want the right person to have the job and they have to earn it, not just expect it based on blue state, red state, left or right.", 
        "intTime": 20090530, 
        "postID": 44, 
        "quote": "", 
        "reply": "I am not really seeing much talent come from the Reps right now. They still have time, but they need to get their act together, freshen up a bit and stop living in the Reagan years. Bitterness will not get them elected next time around. They need a plan, they need to be positive and they need to look to the future. There is no room for division in America. We have to find a way to meet in the middle. I think you are going to see a rise in my party, the Independent party woot woot You heard it here first. We are tired of the two sides messing around. We want accountability and action. We want the right person to have the job and they have to earn it, not just expect it based on blue state, red state, left or right.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:21:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "- Palin. Hahah, kidding. Powell. Even if he boned himself at the UN, he's gotta be the best of the field. -", 
        "intTime": 20090530, 
        "postID": 45, 
        "quote": "", 
        "reply": "- Palin. Hahah, kidding. Powell. Even if he boned himself at the UN, he's gotta be the best of the field. -", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:32:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "intTime": 20090530, 
        "postID": 46, 
        "quote": "Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "reply": " The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:33:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible... The coming future with the sudden flex of muscles. We will need a leader who has the exp of leading men and has the nerves of steel to deal peacefully and at times to come down like a hammer on a nail against anyone who threatens America. The General show's he has what it takes to speak soft and at the same time carry a big stick.", 
        "intTime": 20090530, 
        "postID": 47, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "reply": " The coming future with the sudden flex of muscles. We will need a leader who has the exp of leading men and has the nerves of steel to deal peacefully and at times to come down like a hammer on a nail against anyone who threatens America. The General show's he has what it takes to speak soft and at the same time carry a big stick.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:50:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "world_king377"
    }, 
    {
        "content": "Mike Huckabee would be a good choice. I wonder if he knows Smoke on the Water...", 
        "intTime": 20090530, 
        "postID": 48, 
        "quote": "", 
        "reply": "Mike Huckabee would be a good choice. I wonder if he knows Smoke on the Water...", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:51:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Love that song! Smoke on the Water,,,Fire i the Sky! Yep,,,Huckabee is 'well spoken' with a wry sense of humor and a sharp wit. But I stil like Petreaus. BUT HE SAYS \"\"NO\"\" so far.", 
        "intTime": 20090530, 
        "postID": 49, 
        "quote": "", 
        "reply": "Love that song! Smoke on the Water,,,Fire i the Sky! Yep,,,Huckabee is 'well spoken' with a wry sense of humor and a sharp wit. But I stil like Petreaus. BUT HE SAYS \"\"NO\"\" so far.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:56:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Agent991"
    }, 
    {
        "content": "I guess a David Petraeus/Oliver North Ticket is too much to hope for, but I'd LOVE to see it. I've got two dogs that are smarter than Obama/Biden..... Duane A. Brinson \"Oscar mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "intTime": 20090530, 
        "postID": 50, 
        "quote": "", 
        "reply": "I guess a David Petraeus/Oliver North Ticket is too much to hope for, but I'd LOVE to see it. I've got two dogs that are smarter than Obama/Biden..... Duane A. Brinson \"Oscar mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 03:56:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible... Let me see now, who should I believe about Presidents Obama's approach to national defense? IRS? or this guy? \"In my view, I firmly believe that the United States is not only safe but it will be more secure and the American people are increasingly safer because of the president's leadership that he has displayed consistently over the last four months, both at home and abroad,\" Retired Marine Corps Gen. James Jones 05/27/09 http://thehill.com/leading-the-news/national-security-adviser-downplays-n.-korea-threat-2009-05-27.html Yep, think I'll go with the latter. This message has been edited. Last edited by: jdksfcret, Sat 30 May 2009 04:28 AM", 
        "intTime": 20090530, 
        "postID": 51, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "reply": " Let me see now, who should I believe about Presidents Obama's approach to national defense? IRS? or this guy? \"In my view, I firmly believe that the United States is not only safe but it will be more secure and the American people are increasingly safer because of the president's leadership that he has displayed consistently over the last four months, both at home and abroad,\" Retired Marine Corps Gen. James Jones 05/27/09 http://thehill.com/leading-the-news/national-security-adviser-downplays-n.-korea-threat-2009-05-27.html Yep, think I'll go with the latter. This message has been edited. Last edited by: jdksfcret, Sat 30 May 2009 04:28 AM", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 04:09:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "intTime": 20090530, 
        "postID": 52, 
        "quote": "", 
        "reply": "I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:12:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is.", 
        "intTime": 20090530, 
        "postID": 53, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " That's just as bad as voting for either party and not caring who it is.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:18:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. I'm pretty much on the same page...I'll take a look at who is running, but I don't think it make much of a difference. Until elected officials start thinking about the people over party, it won't matter who is in office.", 
        "intTime": 20090530, 
        "postID": 54, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " I'm pretty much on the same page...I'll take a look at who is running, but I don't think it make much of a difference. Until elected officials start thinking about the people over party, it won't matter who is in office.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:49:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is. YIP!!!! but if enough does the same, it will at least send a message. Wasted vote, probably but at least I can then bash either/or whoever gets in office, either dem or rep because, either/or will be crap...as usual.", 
        "intTime": 20090530, 
        "postID": 55, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is.", 
        "reply": " YIP!!!! but if enough does the same, it will at least send a message. Wasted vote, probably but at least I can then bash either/or whoever gets in office, either dem or rep because, either/or will be crap...as usual.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:04:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "What makes y'all think that either Petraeus or Powell would run as a Republican as long as folks like Limbaugh and the Religious Right have any say whatsoever in GOP policy?", 
        "intTime": 20090530, 
        "postID": 56, 
        "quote": "", 
        "reply": "What makes y'all think that either Petraeus or Powell would run as a Republican as long as folks like Limbaugh and the Religious Right have any say whatsoever in GOP policy?", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:26:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "intTime": 20090530, 
        "postID": 57, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:30:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all. There are more and more of us each day. I have been Indy since after the primaries last year. I was Dem then and since my vote was not to count (I was voting for Obama in the primaries) I felt the party was out of line so I left. Just reading the partisan hacks posting there bias BS causes me to be more and more repelled by both parties. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 58, 
        "quote": "Originally posted by Duster6: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "reply": " There are more and more of us each day. I have been Indy since after the primaries last year. I was Dem then and since my vote was not to count (I was voting for Obama in the primaries) I felt the party was out of line so I left. Just reading the partisan hacks posting there bias BS causes me to be more and more repelled by both parties. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:10:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "L0A1"
    }, 
    {
        "content": "Doesn't matter who the Republican's run, that person will be nothing more than a sacrificial lamb on a BBQ spit. In other words, nobody's going to beat Barack Hussein Obama. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090530, 
        "postID": 59, 
        "quote": "", 
        "reply": "Doesn't matter who the Republican's run, that person will be nothing more than a sacrificial lamb on a BBQ spit. In other words, nobody's going to beat Barack Hussein Obama. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:27:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "jack_flats"
    }, 
    {
        "content": "I'm not voting for another man or woman that won't open up all their information: Birth records, school records. Never Never again. OBAMA OBAMA OBAMA.... no way, no way, no way. Not the kind of change I expected. Just goes to show you that a pretty speech does not a president make!", 
        "intTime": 20090530, 
        "postID": 60, 
        "quote": "", 
        "reply": "I'm not voting for another man or woman that won't open up all their information: Birth records, school records. Never Never again. OBAMA OBAMA OBAMA.... no way, no way, no way. Not the kind of change I expected. Just goes to show you that a pretty speech does not a president make!", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:38:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "intTime": 20090529, 
        "postID": 61, 
        "quote": "", 
        "reply": "Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-29 23:31:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts? Not anymore he pretty much lost a lot of support from the right for his backing of obama. but if i had chooseing general Petraeus.", 
        "intTime": 20090529, 
        "postID": 62, 
        "quote": "Originally posted by usa_girl: Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "reply": " Not anymore he pretty much lost a lot of support from the right for his backing of obama. but if i had chooseing general Petraeus.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-29 23:57:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "world_king377"
    }, 
    {
        "content": "General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "intTime": 20090530, 
        "postID": 63, 
        "quote": "", 
        "reply": "General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:02:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Agent991"
    }, 
    {
        "content": "I am not really seeing much talent come from the Reps right now. They still have time, but they need to get their act together, freshen up a bit and stop living in the Reagan years. Bitterness will not get them elected next time around. They need a plan, they need to be positive and they need to look to the future. There is no room for division in America. We have to find a way to meet in the middle. I think you are going to see a rise in my party, the Independent party woot woot You heard it here first. We are tired of the two sides messing around. We want accountability and action. We want the right person to have the job and they have to earn it, not just expect it based on blue state, red state, left or right.", 
        "intTime": 20090530, 
        "postID": 64, 
        "quote": "", 
        "reply": "I am not really seeing much talent come from the Reps right now. They still have time, but they need to get their act together, freshen up a bit and stop living in the Reagan years. Bitterness will not get them elected next time around. They need a plan, they need to be positive and they need to look to the future. There is no room for division in America. We have to find a way to meet in the middle. I think you are going to see a rise in my party, the Independent party woot woot You heard it here first. We are tired of the two sides messing around. We want accountability and action. We want the right person to have the job and they have to earn it, not just expect it based on blue state, red state, left or right.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:21:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "- Palin. Hahah, kidding. Powell. Even if he boned himself at the UN, he's gotta be the best of the field. -", 
        "intTime": 20090530, 
        "postID": 65, 
        "quote": "", 
        "reply": "- Palin. Hahah, kidding. Powell. Even if he boned himself at the UN, he's gotta be the best of the field. -", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:32:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "intTime": 20090530, 
        "postID": 66, 
        "quote": "Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "reply": " The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:33:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible... The coming future with the sudden flex of muscles. We will need a leader who has the exp of leading men and has the nerves of steel to deal peacefully and at times to come down like a hammer on a nail against anyone who threatens America. The General show's he has what it takes to speak soft and at the same time carry a big stick.", 
        "intTime": 20090530, 
        "postID": 67, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "reply": " The coming future with the sudden flex of muscles. We will need a leader who has the exp of leading men and has the nerves of steel to deal peacefully and at times to come down like a hammer on a nail against anyone who threatens America. The General show's he has what it takes to speak soft and at the same time carry a big stick.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:50:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "world_king377"
    }, 
    {
        "content": "Mike Huckabee would be a good choice. I wonder if he knows Smoke on the Water...", 
        "intTime": 20090530, 
        "postID": 68, 
        "quote": "", 
        "reply": "Mike Huckabee would be a good choice. I wonder if he knows Smoke on the Water...", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:51:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Love that song! Smoke on the Water,,,Fire i the Sky! Yep,,,Huckabee is 'well spoken' with a wry sense of humor and a sharp wit. But I stil like Petreaus. BUT HE SAYS \"\"NO\"\" so far.", 
        "intTime": 20090530, 
        "postID": 69, 
        "quote": "", 
        "reply": "Love that song! Smoke on the Water,,,Fire i the Sky! Yep,,,Huckabee is 'well spoken' with a wry sense of humor and a sharp wit. But I stil like Petreaus. BUT HE SAYS \"\"NO\"\" so far.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:56:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Agent991"
    }, 
    {
        "content": "I guess a David Petraeus/Oliver North Ticket is too much to hope for, but I'd LOVE to see it. I've got two dogs that are smarter than Obama/Biden..... Duane A. Brinson \"Oscar mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "intTime": 20090530, 
        "postID": 70, 
        "quote": "", 
        "reply": "I guess a David Petraeus/Oliver North Ticket is too much to hope for, but I'd LOVE to see it. I've got two dogs that are smarter than Obama/Biden..... Duane A. Brinson \"Oscar mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 03:56:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible... Let me see now, who should I believe about Presidents Obama's approach to national defense? IRS? or this guy? \"In my view, I firmly believe that the United States is not only safe but it will be more secure and the American people are increasingly safer because of the president's leadership that he has displayed consistently over the last four months, both at home and abroad,\" Retired Marine Corps Gen. James Jones 05/27/09 http://thehill.com/leading-the-news/national-security-adviser-downplays-n.-korea-threat-2009-05-27.html Yep, think I'll go with the latter. This message has been edited. Last edited by: jdksfcret, Sat 30 May 2009 04:28 AM", 
        "intTime": 20090530, 
        "postID": 71, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "reply": " Let me see now, who should I believe about Presidents Obama's approach to national defense? IRS? or this guy? \"In my view, I firmly believe that the United States is not only safe but it will be more secure and the American people are increasingly safer because of the president's leadership that he has displayed consistently over the last four months, both at home and abroad,\" Retired Marine Corps Gen. James Jones 05/27/09 http://thehill.com/leading-the-news/national-security-adviser-downplays-n.-korea-threat-2009-05-27.html Yep, think I'll go with the latter. This message has been edited. Last edited by: jdksfcret, Sat 30 May 2009 04:28 AM", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 04:09:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "intTime": 20090530, 
        "postID": 72, 
        "quote": "", 
        "reply": "I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:12:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is.", 
        "intTime": 20090530, 
        "postID": 73, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " That's just as bad as voting for either party and not caring who it is.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:18:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. I'm pretty much on the same page...I'll take a look at who is running, but I don't think it make much of a difference. Until elected officials start thinking about the people over party, it won't matter who is in office.", 
        "intTime": 20090530, 
        "postID": 74, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " I'm pretty much on the same page...I'll take a look at who is running, but I don't think it make much of a difference. Until elected officials start thinking about the people over party, it won't matter who is in office.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:49:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is. YIP!!!! but if enough does the same, it will at least send a message. Wasted vote, probably but at least I can then bash either/or whoever gets in office, either dem or rep because, either/or will be crap...as usual.", 
        "intTime": 20090530, 
        "postID": 75, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is.", 
        "reply": " YIP!!!! but if enough does the same, it will at least send a message. Wasted vote, probably but at least I can then bash either/or whoever gets in office, either dem or rep because, either/or will be crap...as usual.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:04:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "What makes y'all think that either Petraeus or Powell would run as a Republican as long as folks like Limbaugh and the Religious Right have any say whatsoever in GOP policy?", 
        "intTime": 20090530, 
        "postID": 76, 
        "quote": "", 
        "reply": "What makes y'all think that either Petraeus or Powell would run as a Republican as long as folks like Limbaugh and the Religious Right have any say whatsoever in GOP policy?", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:26:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "intTime": 20090530, 
        "postID": 77, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:30:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all. There are more and more of us each day. I have been Indy since after the primaries last year. I was Dem then and since my vote was not to count (I was voting for Obama in the primaries) I felt the party was out of line so I left. Just reading the partisan hacks posting there bias BS causes me to be more and more repelled by both parties. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 78, 
        "quote": "Originally posted by Duster6: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "reply": " There are more and more of us each day. I have been Indy since after the primaries last year. I was Dem then and since my vote was not to count (I was voting for Obama in the primaries) I felt the party was out of line so I left. Just reading the partisan hacks posting there bias BS causes me to be more and more repelled by both parties. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:10:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "L0A1"
    }, 
    {
        "content": "Doesn't matter who the Republican's run, that person will be nothing more than a sacrificial lamb on a BBQ spit. In other words, nobody's going to beat Barack Hussein Obama. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090530, 
        "postID": 79, 
        "quote": "", 
        "reply": "Doesn't matter who the Republican's run, that person will be nothing more than a sacrificial lamb on a BBQ spit. In other words, nobody's going to beat Barack Hussein Obama. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:27:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "jack_flats"
    }, 
    {
        "content": "I'm not voting for another man or woman that won't open up all their information: Birth records, school records. Never Never again. OBAMA OBAMA OBAMA.... no way, no way, no way. Not the kind of change I expected. Just goes to show you that a pretty speech does not a president make!", 
        "intTime": 20090530, 
        "postID": 80, 
        "quote": "", 
        "reply": "I'm not voting for another man or woman that won't open up all their information: Birth records, school records. Never Never again. OBAMA OBAMA OBAMA.... no way, no way, no way. Not the kind of change I expected. Just goes to show you that a pretty speech does not a president make!", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:38:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "intTime": 20090529, 
        "postID": 81, 
        "quote": "", 
        "reply": "Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-29 23:31:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts? Not anymore he pretty much lost a lot of support from the right for his backing of obama. but if i had chooseing general Petraeus.", 
        "intTime": 20090529, 
        "postID": 82, 
        "quote": "Originally posted by usa_girl: Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "reply": " Not anymore he pretty much lost a lot of support from the right for his backing of obama. but if i had chooseing general Petraeus.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-29 23:57:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "world_king377"
    }, 
    {
        "content": "General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "intTime": 20090530, 
        "postID": 83, 
        "quote": "", 
        "reply": "General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:02:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Agent991"
    }, 
    {
        "content": "I am not really seeing much talent come from the Reps right now. They still have time, but they need to get their act together, freshen up a bit and stop living in the Reagan years. Bitterness will not get them elected next time around. They need a plan, they need to be positive and they need to look to the future. There is no room for division in America. We have to find a way to meet in the middle. I think you are going to see a rise in my party, the Independent party woot woot You heard it here first. We are tired of the two sides messing around. We want accountability and action. We want the right person to have the job and they have to earn it, not just expect it based on blue state, red state, left or right.", 
        "intTime": 20090530, 
        "postID": 84, 
        "quote": "", 
        "reply": "I am not really seeing much talent come from the Reps right now. They still have time, but they need to get their act together, freshen up a bit and stop living in the Reagan years. Bitterness will not get them elected next time around. They need a plan, they need to be positive and they need to look to the future. There is no room for division in America. We have to find a way to meet in the middle. I think you are going to see a rise in my party, the Independent party woot woot You heard it here first. We are tired of the two sides messing around. We want accountability and action. We want the right person to have the job and they have to earn it, not just expect it based on blue state, red state, left or right.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:21:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "- Palin. Hahah, kidding. Powell. Even if he boned himself at the UN, he's gotta be the best of the field. -", 
        "intTime": 20090530, 
        "postID": 85, 
        "quote": "", 
        "reply": "- Palin. Hahah, kidding. Powell. Even if he boned himself at the UN, he's gotta be the best of the field. -", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:32:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "intTime": 20090530, 
        "postID": 86, 
        "quote": "Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "reply": " The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:33:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible... The coming future with the sudden flex of muscles. We will need a leader who has the exp of leading men and has the nerves of steel to deal peacefully and at times to come down like a hammer on a nail against anyone who threatens America. The General show's he has what it takes to speak soft and at the same time carry a big stick.", 
        "intTime": 20090530, 
        "postID": 87, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "reply": " The coming future with the sudden flex of muscles. We will need a leader who has the exp of leading men and has the nerves of steel to deal peacefully and at times to come down like a hammer on a nail against anyone who threatens America. The General show's he has what it takes to speak soft and at the same time carry a big stick.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:50:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "world_king377"
    }, 
    {
        "content": "Mike Huckabee would be a good choice. I wonder if he knows Smoke on the Water...", 
        "intTime": 20090530, 
        "postID": 88, 
        "quote": "", 
        "reply": "Mike Huckabee would be a good choice. I wonder if he knows Smoke on the Water...", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:51:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Love that song! Smoke on the Water,,,Fire i the Sky! Yep,,,Huckabee is 'well spoken' with a wry sense of humor and a sharp wit. But I stil like Petreaus. BUT HE SAYS \"\"NO\"\" so far.", 
        "intTime": 20090530, 
        "postID": 89, 
        "quote": "", 
        "reply": "Love that song! Smoke on the Water,,,Fire i the Sky! Yep,,,Huckabee is 'well spoken' with a wry sense of humor and a sharp wit. But I stil like Petreaus. BUT HE SAYS \"\"NO\"\" so far.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:56:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Agent991"
    }, 
    {
        "content": "I guess a David Petraeus/Oliver North Ticket is too much to hope for, but I'd LOVE to see it. I've got two dogs that are smarter than Obama/Biden..... Duane A. Brinson \"Oscar mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "intTime": 20090530, 
        "postID": 90, 
        "quote": "", 
        "reply": "I guess a David Petraeus/Oliver North Ticket is too much to hope for, but I'd LOVE to see it. I've got two dogs that are smarter than Obama/Biden..... Duane A. Brinson \"Oscar mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 03:56:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible... Let me see now, who should I believe about Presidents Obama's approach to national defense? IRS? or this guy? \"In my view, I firmly believe that the United States is not only safe but it will be more secure and the American people are increasingly safer because of the president's leadership that he has displayed consistently over the last four months, both at home and abroad,\" Retired Marine Corps Gen. James Jones 05/27/09 http://thehill.com/leading-the-news/national-security-adviser-downplays-n.-korea-threat-2009-05-27.html Yep, think I'll go with the latter. This message has been edited. Last edited by: jdksfcret, Sat 30 May 2009 04:28 AM", 
        "intTime": 20090530, 
        "postID": 91, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "reply": " Let me see now, who should I believe about Presidents Obama's approach to national defense? IRS? or this guy? \"In my view, I firmly believe that the United States is not only safe but it will be more secure and the American people are increasingly safer because of the president's leadership that he has displayed consistently over the last four months, both at home and abroad,\" Retired Marine Corps Gen. James Jones 05/27/09 http://thehill.com/leading-the-news/national-security-adviser-downplays-n.-korea-threat-2009-05-27.html Yep, think I'll go with the latter. This message has been edited. Last edited by: jdksfcret, Sat 30 May 2009 04:28 AM", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 04:09:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "intTime": 20090530, 
        "postID": 92, 
        "quote": "", 
        "reply": "I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:12:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is.", 
        "intTime": 20090530, 
        "postID": 93, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " That's just as bad as voting for either party and not caring who it is.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:18:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. I'm pretty much on the same page...I'll take a look at who is running, but I don't think it make much of a difference. Until elected officials start thinking about the people over party, it won't matter who is in office.", 
        "intTime": 20090530, 
        "postID": 94, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " I'm pretty much on the same page...I'll take a look at who is running, but I don't think it make much of a difference. Until elected officials start thinking about the people over party, it won't matter who is in office.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:49:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is. YIP!!!! but if enough does the same, it will at least send a message. Wasted vote, probably but at least I can then bash either/or whoever gets in office, either dem or rep because, either/or will be crap...as usual.", 
        "intTime": 20090530, 
        "postID": 95, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is.", 
        "reply": " YIP!!!! but if enough does the same, it will at least send a message. Wasted vote, probably but at least I can then bash either/or whoever gets in office, either dem or rep because, either/or will be crap...as usual.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:04:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "What makes y'all think that either Petraeus or Powell would run as a Republican as long as folks like Limbaugh and the Religious Right have any say whatsoever in GOP policy?", 
        "intTime": 20090530, 
        "postID": 96, 
        "quote": "", 
        "reply": "What makes y'all think that either Petraeus or Powell would run as a Republican as long as folks like Limbaugh and the Religious Right have any say whatsoever in GOP policy?", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:26:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "intTime": 20090530, 
        "postID": 97, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:30:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all. There are more and more of us each day. I have been Indy since after the primaries last year. I was Dem then and since my vote was not to count (I was voting for Obama in the primaries) I felt the party was out of line so I left. Just reading the partisan hacks posting there bias BS causes me to be more and more repelled by both parties. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 98, 
        "quote": "Originally posted by Duster6: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "reply": " There are more and more of us each day. I have been Indy since after the primaries last year. I was Dem then and since my vote was not to count (I was voting for Obama in the primaries) I felt the party was out of line so I left. Just reading the partisan hacks posting there bias BS causes me to be more and more repelled by both parties. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:10:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "L0A1"
    }, 
    {
        "content": "Doesn't matter who the Republican's run, that person will be nothing more than a sacrificial lamb on a BBQ spit. In other words, nobody's going to beat Barack Hussein Obama. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090530, 
        "postID": 99, 
        "quote": "", 
        "reply": "Doesn't matter who the Republican's run, that person will be nothing more than a sacrificial lamb on a BBQ spit. In other words, nobody's going to beat Barack Hussein Obama. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:27:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "jack_flats"
    }, 
    {
        "content": "I'm not voting for another man or woman that won't open up all their information: Birth records, school records. Never Never again. OBAMA OBAMA OBAMA.... no way, no way, no way. Not the kind of change I expected. Just goes to show you that a pretty speech does not a president make!", 
        "intTime": 20090530, 
        "postID": 100, 
        "quote": "", 
        "reply": "I'm not voting for another man or woman that won't open up all their information: Birth records, school records. Never Never again. OBAMA OBAMA OBAMA.... no way, no way, no way. Not the kind of change I expected. Just goes to show you that a pretty speech does not a president make!", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:38:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "intTime": 20090529, 
        "postID": 101, 
        "quote": "", 
        "reply": "Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-29 23:31:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts? Not anymore he pretty much lost a lot of support from the right for his backing of obama. but if i had chooseing general Petraeus.", 
        "intTime": 20090529, 
        "postID": 102, 
        "quote": "Originally posted by usa_girl: Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "reply": " Not anymore he pretty much lost a lot of support from the right for his backing of obama. but if i had chooseing general Petraeus.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-29 23:57:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "world_king377"
    }, 
    {
        "content": "General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "intTime": 20090530, 
        "postID": 103, 
        "quote": "", 
        "reply": "General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:02:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Agent991"
    }, 
    {
        "content": "I am not really seeing much talent come from the Reps right now. They still have time, but they need to get their act together, freshen up a bit and stop living in the Reagan years. Bitterness will not get them elected next time around. They need a plan, they need to be positive and they need to look to the future. There is no room for division in America. We have to find a way to meet in the middle. I think you are going to see a rise in my party, the Independent party woot woot You heard it here first. We are tired of the two sides messing around. We want accountability and action. We want the right person to have the job and they have to earn it, not just expect it based on blue state, red state, left or right.", 
        "intTime": 20090530, 
        "postID": 104, 
        "quote": "", 
        "reply": "I am not really seeing much talent come from the Reps right now. They still have time, but they need to get their act together, freshen up a bit and stop living in the Reagan years. Bitterness will not get them elected next time around. They need a plan, they need to be positive and they need to look to the future. There is no room for division in America. We have to find a way to meet in the middle. I think you are going to see a rise in my party, the Independent party woot woot You heard it here first. We are tired of the two sides messing around. We want accountability and action. We want the right person to have the job and they have to earn it, not just expect it based on blue state, red state, left or right.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:21:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "- Palin. Hahah, kidding. Powell. Even if he boned himself at the UN, he's gotta be the best of the field. -", 
        "intTime": 20090530, 
        "postID": 105, 
        "quote": "", 
        "reply": "- Palin. Hahah, kidding. Powell. Even if he boned himself at the UN, he's gotta be the best of the field. -", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:32:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "intTime": 20090530, 
        "postID": 106, 
        "quote": "Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "reply": " The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:33:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible... The coming future with the sudden flex of muscles. We will need a leader who has the exp of leading men and has the nerves of steel to deal peacefully and at times to come down like a hammer on a nail against anyone who threatens America. The General show's he has what it takes to speak soft and at the same time carry a big stick.", 
        "intTime": 20090530, 
        "postID": 107, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "reply": " The coming future with the sudden flex of muscles. We will need a leader who has the exp of leading men and has the nerves of steel to deal peacefully and at times to come down like a hammer on a nail against anyone who threatens America. The General show's he has what it takes to speak soft and at the same time carry a big stick.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:50:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "world_king377"
    }, 
    {
        "content": "Mike Huckabee would be a good choice. I wonder if he knows Smoke on the Water...", 
        "intTime": 20090530, 
        "postID": 108, 
        "quote": "", 
        "reply": "Mike Huckabee would be a good choice. I wonder if he knows Smoke on the Water...", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:51:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Love that song! Smoke on the Water,,,Fire i the Sky! Yep,,,Huckabee is 'well spoken' with a wry sense of humor and a sharp wit. But I stil like Petreaus. BUT HE SAYS \"\"NO\"\" so far.", 
        "intTime": 20090530, 
        "postID": 109, 
        "quote": "", 
        "reply": "Love that song! Smoke on the Water,,,Fire i the Sky! Yep,,,Huckabee is 'well spoken' with a wry sense of humor and a sharp wit. But I stil like Petreaus. BUT HE SAYS \"\"NO\"\" so far.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:56:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Agent991"
    }, 
    {
        "content": "I guess a David Petraeus/Oliver North Ticket is too much to hope for, but I'd LOVE to see it. I've got two dogs that are smarter than Obama/Biden..... Duane A. Brinson \"Oscar mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "intTime": 20090530, 
        "postID": 110, 
        "quote": "", 
        "reply": "I guess a David Petraeus/Oliver North Ticket is too much to hope for, but I'd LOVE to see it. I've got two dogs that are smarter than Obama/Biden..... Duane A. Brinson \"Oscar mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 03:56:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible... Let me see now, who should I believe about Presidents Obama's approach to national defense? IRS? or this guy? \"In my view, I firmly believe that the United States is not only safe but it will be more secure and the American people are increasingly safer because of the president's leadership that he has displayed consistently over the last four months, both at home and abroad,\" Retired Marine Corps Gen. James Jones 05/27/09 http://thehill.com/leading-the-news/national-security-adviser-downplays-n.-korea-threat-2009-05-27.html Yep, think I'll go with the latter. This message has been edited. Last edited by: jdksfcret, Sat 30 May 2009 04:28 AM", 
        "intTime": 20090530, 
        "postID": 111, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "reply": " Let me see now, who should I believe about Presidents Obama's approach to national defense? IRS? or this guy? \"In my view, I firmly believe that the United States is not only safe but it will be more secure and the American people are increasingly safer because of the president's leadership that he has displayed consistently over the last four months, both at home and abroad,\" Retired Marine Corps Gen. James Jones 05/27/09 http://thehill.com/leading-the-news/national-security-adviser-downplays-n.-korea-threat-2009-05-27.html Yep, think I'll go with the latter. This message has been edited. Last edited by: jdksfcret, Sat 30 May 2009 04:28 AM", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 04:09:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "intTime": 20090530, 
        "postID": 112, 
        "quote": "", 
        "reply": "I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:12:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is.", 
        "intTime": 20090530, 
        "postID": 113, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " That's just as bad as voting for either party and not caring who it is.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:18:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. I'm pretty much on the same page...I'll take a look at who is running, but I don't think it make much of a difference. Until elected officials start thinking about the people over party, it won't matter who is in office.", 
        "intTime": 20090530, 
        "postID": 114, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " I'm pretty much on the same page...I'll take a look at who is running, but I don't think it make much of a difference. Until elected officials start thinking about the people over party, it won't matter who is in office.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:49:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is. YIP!!!! but if enough does the same, it will at least send a message. Wasted vote, probably but at least I can then bash either/or whoever gets in office, either dem or rep because, either/or will be crap...as usual.", 
        "intTime": 20090530, 
        "postID": 115, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is.", 
        "reply": " YIP!!!! but if enough does the same, it will at least send a message. Wasted vote, probably but at least I can then bash either/or whoever gets in office, either dem or rep because, either/or will be crap...as usual.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:04:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "What makes y'all think that either Petraeus or Powell would run as a Republican as long as folks like Limbaugh and the Religious Right have any say whatsoever in GOP policy?", 
        "intTime": 20090530, 
        "postID": 116, 
        "quote": "", 
        "reply": "What makes y'all think that either Petraeus or Powell would run as a Republican as long as folks like Limbaugh and the Religious Right have any say whatsoever in GOP policy?", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:26:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "intTime": 20090530, 
        "postID": 117, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:30:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all. There are more and more of us each day. I have been Indy since after the primaries last year. I was Dem then and since my vote was not to count (I was voting for Obama in the primaries) I felt the party was out of line so I left. Just reading the partisan hacks posting there bias BS causes me to be more and more repelled by both parties. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 118, 
        "quote": "Originally posted by Duster6: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "reply": " There are more and more of us each day. I have been Indy since after the primaries last year. I was Dem then and since my vote was not to count (I was voting for Obama in the primaries) I felt the party was out of line so I left. Just reading the partisan hacks posting there bias BS causes me to be more and more repelled by both parties. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:10:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "L0A1"
    }, 
    {
        "content": "Doesn't matter who the Republican's run, that person will be nothing more than a sacrificial lamb on a BBQ spit. In other words, nobody's going to beat Barack Hussein Obama. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090530, 
        "postID": 119, 
        "quote": "", 
        "reply": "Doesn't matter who the Republican's run, that person will be nothing more than a sacrificial lamb on a BBQ spit. In other words, nobody's going to beat Barack Hussein Obama. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:27:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "jack_flats"
    }, 
    {
        "content": "I'm not voting for another man or woman that won't open up all their information: Birth records, school records. Never Never again. OBAMA OBAMA OBAMA.... no way, no way, no way. Not the kind of change I expected. Just goes to show you that a pretty speech does not a president make!", 
        "intTime": 20090530, 
        "postID": 120, 
        "quote": "", 
        "reply": "I'm not voting for another man or woman that won't open up all their information: Birth records, school records. Never Never again. OBAMA OBAMA OBAMA.... no way, no way, no way. Not the kind of change I expected. Just goes to show you that a pretty speech does not a president make!", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:38:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "intTime": 20090529, 
        "postID": 121, 
        "quote": "", 
        "reply": "Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-29 23:31:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts? Not anymore he pretty much lost a lot of support from the right for his backing of obama. but if i had chooseing general Petraeus.", 
        "intTime": 20090529, 
        "postID": 122, 
        "quote": "Originally posted by usa_girl: Bill Maher suggested on his show this evening that Powell should run against Obama.......your thoughts?", 
        "reply": " Not anymore he pretty much lost a lot of support from the right for his backing of obama. but if i had chooseing general Petraeus.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-29 23:57:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "world_king377"
    }, 
    {
        "content": "General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "intTime": 20090530, 
        "postID": 123, 
        "quote": "", 
        "reply": "General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:02:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Agent991"
    }, 
    {
        "content": "I am not really seeing much talent come from the Reps right now. They still have time, but they need to get their act together, freshen up a bit and stop living in the Reagan years. Bitterness will not get them elected next time around. They need a plan, they need to be positive and they need to look to the future. There is no room for division in America. We have to find a way to meet in the middle. I think you are going to see a rise in my party, the Independent party woot woot You heard it here first. We are tired of the two sides messing around. We want accountability and action. We want the right person to have the job and they have to earn it, not just expect it based on blue state, red state, left or right.", 
        "intTime": 20090530, 
        "postID": 124, 
        "quote": "", 
        "reply": "I am not really seeing much talent come from the Reps right now. They still have time, but they need to get their act together, freshen up a bit and stop living in the Reagan years. Bitterness will not get them elected next time around. They need a plan, they need to be positive and they need to look to the future. There is no room for division in America. We have to find a way to meet in the middle. I think you are going to see a rise in my party, the Independent party woot woot You heard it here first. We are tired of the two sides messing around. We want accountability and action. We want the right person to have the job and they have to earn it, not just expect it based on blue state, red state, left or right.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:21:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "- Palin. Hahah, kidding. Powell. Even if he boned himself at the UN, he's gotta be the best of the field. -", 
        "intTime": 20090530, 
        "postID": 125, 
        "quote": "", 
        "reply": "- Palin. Hahah, kidding. Powell. Even if he boned himself at the UN, he's gotta be the best of the field. -", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:32:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "intTime": 20090530, 
        "postID": 126, 
        "quote": "Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though.", 
        "reply": " The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:33:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible... The coming future with the sudden flex of muscles. We will need a leader who has the exp of leading men and has the nerves of steel to deal peacefully and at times to come down like a hammer on a nail against anyone who threatens America. The General show's he has what it takes to speak soft and at the same time carry a big stick.", 
        "intTime": 20090530, 
        "postID": 127, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "reply": " The coming future with the sudden flex of muscles. We will need a leader who has the exp of leading men and has the nerves of steel to deal peacefully and at times to come down like a hammer on a nail against anyone who threatens America. The General show's he has what it takes to speak soft and at the same time carry a big stick.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:50:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "world_king377"
    }, 
    {
        "content": "Mike Huckabee would be a good choice. I wonder if he knows Smoke on the Water...", 
        "intTime": 20090530, 
        "postID": 128, 
        "quote": "", 
        "reply": "Mike Huckabee would be a good choice. I wonder if he knows Smoke on the Water...", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:51:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Love that song! Smoke on the Water,,,Fire i the Sky! Yep,,,Huckabee is 'well spoken' with a wry sense of humor and a sharp wit. But I stil like Petreaus. BUT HE SAYS \"\"NO\"\" so far.", 
        "intTime": 20090530, 
        "postID": 129, 
        "quote": "", 
        "reply": "Love that song! Smoke on the Water,,,Fire i the Sky! Yep,,,Huckabee is 'well spoken' with a wry sense of humor and a sharp wit. But I stil like Petreaus. BUT HE SAYS \"\"NO\"\" so far.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 00:56:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Agent991"
    }, 
    {
        "content": "I guess a David Petraeus/Oliver North Ticket is too much to hope for, but I'd LOVE to see it. I've got two dogs that are smarter than Obama/Biden..... Duane A. Brinson \"Oscar mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "intTime": 20090530, 
        "postID": 130, 
        "quote": "", 
        "reply": "I guess a David Petraeus/Oliver North Ticket is too much to hope for, but I'd LOVE to see it. I've got two dogs that are smarter than Obama/Biden..... Duane A. Brinson \"Oscar mike to the Keys\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 03:56:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible... Let me see now, who should I believe about Presidents Obama's approach to national defense? IRS? or this guy? \"In my view, I firmly believe that the United States is not only safe but it will be more secure and the American people are increasingly safer because of the president's leadership that he has displayed consistently over the last four months, both at home and abroad,\" Retired Marine Corps Gen. James Jones 05/27/09 http://thehill.com/leading-the-news/national-security-adviser-downplays-n.-korea-threat-2009-05-27.html Yep, think I'll go with the latter. This message has been edited. Last edited by: jdksfcret, Sat 30 May 2009 04:28 AM", 
        "intTime": 20090530, 
        "postID": 131, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Agent991: General Petraeus if he will do it. Says he won't. Time will tell though. The good general would only have a chance if America is still bogged down in quaqmires... Considering President Obama's soft and naive approach to national defense that doesn't seem too implausible...", 
        "reply": " Let me see now, who should I believe about Presidents Obama's approach to national defense? IRS? or this guy? \"In my view, I firmly believe that the United States is not only safe but it will be more secure and the American people are increasingly safer because of the president's leadership that he has displayed consistently over the last four months, both at home and abroad,\" Retired Marine Corps Gen. James Jones 05/27/09 http://thehill.com/leading-the-news/national-security-adviser-downplays-n.-korea-threat-2009-05-27.html Yep, think I'll go with the latter. This message has been edited. Last edited by: jdksfcret, Sat 30 May 2009 04:28 AM", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 04:09:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "intTime": 20090530, 
        "postID": 132, 
        "quote": "", 
        "reply": "I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:12:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is.", 
        "intTime": 20090530, 
        "postID": 133, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " That's just as bad as voting for either party and not caring who it is.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:18:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. I'm pretty much on the same page...I'll take a look at who is running, but I don't think it make much of a difference. Until elected officials start thinking about the people over party, it won't matter who is in office.", 
        "intTime": 20090530, 
        "postID": 134, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " I'm pretty much on the same page...I'll take a look at who is running, but I don't think it make much of a difference. Until elected officials start thinking about the people over party, it won't matter who is in office.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 05:49:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "PSimon572"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is. YIP!!!! but if enough does the same, it will at least send a message. Wasted vote, probably but at least I can then bash either/or whoever gets in office, either dem or rep because, either/or will be crap...as usual.", 
        "intTime": 20090530, 
        "postID": 135, 
        "quote": "Originally posted by iamgonzo: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. That's just as bad as voting for either party and not caring who it is.", 
        "reply": " YIP!!!! but if enough does the same, it will at least send a message. Wasted vote, probably but at least I can then bash either/or whoever gets in office, either dem or rep because, either/or will be crap...as usual.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:04:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "What makes y'all think that either Petraeus or Powell would run as a Republican as long as folks like Limbaugh and the Religious Right have any say whatsoever in GOP policy?", 
        "intTime": 20090530, 
        "postID": 136, 
        "quote": "", 
        "reply": "What makes y'all think that either Petraeus or Powell would run as a Republican as long as folks like Limbaugh and the Religious Right have any say whatsoever in GOP policy?", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:26:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "intTime": 20090530, 
        "postID": 137, 
        "quote": "Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps.", 
        "reply": " God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 06:30:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all. There are more and more of us each day. I have been Indy since after the primaries last year. I was Dem then and since my vote was not to count (I was voting for Obama in the primaries) I felt the party was out of line so I left. Just reading the partisan hacks posting there bias BS causes me to be more and more repelled by both parties. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090530, 
        "postID": 138, 
        "quote": "Originally posted by Duster6: quote: Originally posted by SignalSgtWilliams: I'm voting Independent, I don't give a damn who it is. I've had enough with both Dems and Reps. God Bless you Sgt. Williams. You are one of just a few on these boards who have any common sense at all.", 
        "reply": " There are more and more of us each day. I have been Indy since after the primaries last year. I was Dem then and since my vote was not to count (I was voting for Obama in the primaries) I felt the party was out of line so I left. Just reading the partisan hacks posting there bias BS causes me to be more and more repelled by both parties. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:10:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "L0A1"
    }, 
    {
        "content": "Doesn't matter who the Republican's run, that person will be nothing more than a sacrificial lamb on a BBQ spit. In other words, nobody's going to beat Barack Hussein Obama. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090530, 
        "postID": 139, 
        "quote": "", 
        "reply": "Doesn't matter who the Republican's run, that person will be nothing more than a sacrificial lamb on a BBQ spit. In other words, nobody's going to beat Barack Hussein Obama. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:27:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "jack_flats"
    }, 
    {
        "content": "I'm not voting for another man or woman that won't open up all their information: Birth records, school records. Never Never again. OBAMA OBAMA OBAMA.... no way, no way, no way. Not the kind of change I expected. Just goes to show you that a pretty speech does not a president make!", 
        "intTime": 20090530, 
        "postID": 140, 
        "quote": "", 
        "reply": "I'm not voting for another man or woman that won't open up all their information: Birth records, school records. Never Never again. OBAMA OBAMA OBAMA.... no way, no way, no way. Not the kind of change I expected. Just goes to show you that a pretty speech does not a president make!", 
        "threadID": "672198221_3160046422001", 
        "time": "2009-05-30 08:38:00", 
        "title": "who should run against Obama in the next election?", 
        "userID": "charlie_echo"
    }
]