[
    {
        "content": "- Check this out - Oklahoma about to pass a bill legalizing deadly force when protecting your unborn child. \"http://www.koco.com/cnn-news/19082604/detail.html\" Interesting. -", 
        "intTime": 20090404, 
        "postID": 1, 
        "quote": "", 
        "reply": "- Check this out - Oklahoma about to pass a bill legalizing deadly force when protecting your unborn child. \"http://www.koco.com/cnn-news/19082604/detail.html\" Interesting. -", 
        "threadID": "672198221_7780058912001", 
        "time": "2009-04-04 20:19:00", 
        "title": "Pregnant? You're licensed to kill", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "Law or no law, I think any mothers natural instinct would allow her to do it. And damn any court that convicted her for protecting her unborn.", 
        "intTime": 20090405, 
        "postID": 2, 
        "quote": "", 
        "reply": "Law or no law, I think any mothers natural instinct would allow her to do it. And damn any court that convicted her for protecting her unborn.", 
        "threadID": "672198221_7780058912001", 
        "time": "2009-04-05 07:02:00", 
        "title": "Pregnant? You're licensed to kill", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "There was a day when such a law would've been unnecessary, but with the perversion of law and justice with regard to protecting the unborn, ala the US holocaust of 50 million babies killed since '73, this law seems reasonable and probably necessary.", 
        "intTime": 20090405, 
        "postID": 3, 
        "quote": "", 
        "reply": "There was a day when such a law would've been unnecessary, but with the perversion of law and justice with regard to protecting the unborn, ala the US holocaust of 50 million babies killed since '73, this law seems reasonable and probably necessary.", 
        "threadID": "672198221_7780058912001", 
        "time": "2009-04-05 07:08:00", 
        "title": "Pregnant? You're licensed to kill", 
        "userID": "RRR52"
    }, 
    {
        "content": "RR trust me when I say there is NO law that would stop me from protecting my children no matter what I needed to do. I will always feel that way and the \"laws\" consequences in that reguard would be quite meaningless to me. Sometimes ya gota do what ya gota do.", 
        "intTime": 20090405, 
        "postID": 4, 
        "quote": "", 
        "reply": "RR trust me when I say there is NO law that would stop me from protecting my children no matter what I needed to do. I will always feel that way and the \"laws\" consequences in that reguard would be quite meaningless to me. Sometimes ya gota do what ya gota do.", 
        "threadID": "672198221_7780058912001", 
        "time": "2009-04-05 07:11:00", 
        "title": "Pregnant? You're licensed to kill", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "\"The bill stems from a Michigan case where a woman who was carrying quadruplets stabbed and killed her boyfriend after he hit her in the stomach. The woman lost the babies and was convicted of manslaughter.\" She needs to fight this to the supreme court of the U.S.", 
        "intTime": 20090405, 
        "postID": 5, 
        "quote": "", 
        "reply": "\"The bill stems from a Michigan case where a woman who was carrying quadruplets stabbed and killed her boyfriend after he hit her in the stomach. The woman lost the babies and was convicted of manslaughter.\" She needs to fight this to the supreme court of the U.S.", 
        "threadID": "672198221_7780058912001", 
        "time": "2009-04-05 07:19:00", 
        "title": "Pregnant? You're licensed to kill", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: \"The bill stems from a Michigan case where a woman who was carrying quadruplets stabbed and killed her boyfriend after he hit her in the stomach. The woman lost the babies and was convicted of manslaughter.\" Sounds about right. She wasn't convicted of murder.", 
        "intTime": 20090405, 
        "postID": 6, 
        "quote": "Originally posted by crackerjacks61: \"The bill stems from a Michigan case where a woman who was carrying quadruplets stabbed and killed her boyfriend after he hit her in the stomach. The woman lost the babies and was convicted of manslaughter.\"", 
        "reply": " Sounds about right. She wasn't convicted of murder.", 
        "threadID": "672198221_7780058912001", 
        "time": "2009-04-05 09:42:00", 
        "title": "Pregnant? You're licensed to kill", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: crackerjacks61 10 day warning Thread Disrupsion 04 Apr 09 MD Posted Sun 05 April 2009 07:11 AM Hide Post RR trust me when I say there is NO law that would stop me from protecting my children no matter what I needed to do. I will always feel that way and the \"laws\" consequences in that reguard would be quite meaningless to me. Sometimes ya gota do what ya gota do. Yep, laws for me are meaningless when protecting the lives of your children, family, other peoples children and family. Anything goes and if put on a jury in such a case, not guilty would be my vote. Whatever it takes to protect them, born or unborn.", 
        "intTime": 20090405, 
        "postID": 7, 
        "quote": "crackerjacks61 10 day warning Thread Disrupsion 04 Apr 09 MD Posted Sun 05 April 2009 07:11 AM Hide Post RR trust me when I say there is NO law that would stop me from protecting my children no matter what I needed to do. I will always feel that way and the \"laws\" consequences in that reguard would be quite meaningless to me. Sometimes ya gota do what ya gota do.", 
        "reply": " Yep, laws for me are meaningless when protecting the lives of your children, family, other peoples children and family. Anything goes and if put on a jury in such a case, not guilty would be my vote. Whatever it takes to protect them, born or unborn.", 
        "threadID": "672198221_7780058912001", 
        "time": "2009-04-05 11:07:00", 
        "title": "Pregnant? You're licensed to kill", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by crackerjacks61: \"The bill stems from a Michigan case where a woman who was carrying quadruplets stabbed and killed her boyfriend after he hit her in the stomach. The woman lost the babies and was convicted of manslaughter.\" Sounds about right. She wasn't convicted of murder. Some states don't allow self defense, some do. The \"unborn child\" thing is just window dressing...anything that would potentially kill the unborn children would potentially kill the mother. Oklahoma is just getting on the train they should've already been on. As far as Michigan, that's no surprise; not to make this a partisan issue, but states dominated by left-of-center demmos tend to take a dim view of self defense. If this happened in Alabama it wouldn't have even made it to court.", 
        "intTime": 20090406, 
        "postID": 8, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by crackerjacks61: \"The bill stems from a Michigan case where a woman who was carrying quadruplets stabbed and killed her boyfriend after he hit her in the stomach. The woman lost the babies and was convicted of manslaughter.\" Sounds about right. She wasn't convicted of murder.", 
        "reply": " Some states don't allow self defense, some do. The \"unborn child\" thing is just window dressing...anything that would potentially kill the unborn children would potentially kill the mother. Oklahoma is just getting on the train they should've already been on. As far as Michigan, that's no surprise; not to make this a partisan issue, but states dominated by left-of-center demmos tend to take a dim view of self defense. If this happened in Alabama it wouldn't have even made it to court.", 
        "threadID": "672198221_7780058912001", 
        "time": "2009-04-06 09:21:00", 
        "title": "Pregnant? You're licensed to kill", 
        "userID": "jwr6"
    }
]