[
    {
        "content": "I am really surprised this is not posted here yet. Has the world gone crazy? NK has just said they have broken the armistice and has threatened the US and SK but yet I turn the news on and I see a story about people cheating on the American Idol vote. My god we are doomed. This should have been a foreseeable event years ago and the military should have been beefed up to handle this! \"http://www.bloomberg.com/apps/news?pid=20601087&sid=awBTCPe7S2gw&refer=worldwide\" The Agreement \"http://www.nautilus.org/DPRKBriefingBook/agreements/ CanKor_VTK_1953_07_27_korean_armistice_agreement.pdf\"", 
        "intTime": 20090527, 
        "postID": 1, 
        "quote": "", 
        "reply": "I am really surprised this is not posted here yet. Has the world gone crazy? NK has just said they have broken the armistice and has threatened the US and SK but yet I turn the news on and I see a story about people cheating on the American Idol vote. My god we are doomed. This should have been a foreseeable event years ago and the military should have been beefed up to handle this! \"http://www.bloomberg.com/apps/news?pid=20601087&sid=awBTCPe7S2gw&refer=worldwide\" The Agreement \"http://www.nautilus.org/DPRKBriefingBook/agreements/ CanKor_VTK_1953_07_27_korean_armistice_agreement.pdf\"", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 15:07:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I am really surprised this is not posted here yet. Has the world gone crazy? NK has just said they have broken the armistice and has threatened the US and SK but yet I turn the news on and I see a story about people cheating on the American Idol vote. My god we are doomed. This should have been a foreseeable event years ago and the military should have been beefed up to handle this! \"http://www.bloomberg.com/apps/news?pid=20601087&sid=awBTCPe7S2gw&refer=worldwide\" The Agreement \"http://www.nautilus.org/DPRKBriefingBook/agreements/CanKor_VTK_1953_07_27_korean_armistice_agreement.pdf\" Come on, keep matters in perpective! Nuclera War? Light stuff, American Idol - The fate of civilisation rests on the outcome... Seriously, from your link: quote: North Korea routinely issues threats directed at the U.S., South Korea and Japan, warning of military retaliation if they continue to take actions that the country’s leadership characterizes as threats to its security. So, pause and think about this. Their series of military threats, by definition reject the '53 truce. In fact, they have in the past defined just about everything as an attack on them. I don't want to minimise this present threat, on the other hand, it does sound like a long string of their statements. Dave", 
        "intTime": 20090527, 
        "postID": 2, 
        "quote": "Originally posted by crackerjacks61: I am really surprised this is not posted here yet. Has the world gone crazy? NK has just said they have broken the armistice and has threatened the US and SK but yet I turn the news on and I see a story about people cheating on the American Idol vote. My god we are doomed. This should have been a foreseeable event years ago and the military should have been beefed up to handle this! \"http://www.bloomberg.com/apps/news?pid=20601087&sid=awBTCPe7S2gw&refer=worldwide\" The Agreement \"http://www.nautilus.org/DPRKBriefingBook/agreements/CanKor_VTK_1953_07_27_korean_armistice_agreement.pdf\"", 
        "reply": " Come on, keep matters in perpective! Nuclera War? Light stuff, American Idol - The fate of civilisation rests on the outcome... Seriously, from your link: quote: North Korea routinely issues threats directed at the U.S., South Korea and Japan, warning of military retaliation if they continue to take actions that the country’s leadership characterizes as threats to its security. So, pause and think about this. Their series of military threats, by definition reject the '53 truce. In fact, they have in the past defined just about everything as an attack on them. I don't want to minimise this present threat, on the other hand, it does sound like a long string of their statements. Dave", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 15:16:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "Grachus"
    }, 
    {
        "content": "Dave they have just told the world screw you were going to do whatever we want. Are we going to wait for them to strike us first? How many troops we still got in NK? I say we need to hit them hard fast and surprise the crap out of them..that is, if we had an Army and resources that was not diminished by a forever for no reason war.", 
        "intTime": 20090527, 
        "postID": 3, 
        "quote": "", 
        "reply": "Dave they have just told the world screw you were going to do whatever we want. Are we going to wait for them to strike us first? How many troops we still got in NK? I say we need to hit them hard fast and surprise the crap out of them..that is, if we had an Army and resources that was not diminished by a forever for no reason war.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 15:29:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: I don't want to minimise this present threat, on the other hand, it does sound like a long string of their statements. Dave In the past I would have brushed this off, but I am wondering if Kim Jong Il wants a war before he dies. That better CJ? This message has been edited. Last edited by: L0A1, Wed 27 May 2009 04:02 PM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090527, 
        "postID": 4, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: I don't want to minimise this present threat, on the other hand, it does sound like a long string of their statements. Dave", 
        "reply": " In the past I would have brushed this off, but I am wondering if Kim Jong Il wants a war before he dies. That better CJ? This message has been edited. Last edited by: L0A1, Wed 27 May 2009 04:02 PM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 15:37:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "L0A1"
    }, 
    {
        "content": "Would you guys please edit your post and put a break in the link. Anyway LOA, I almost put the same thing in my post, he wants to go out with a bang I think.", 
        "intTime": 20090527, 
        "postID": 5, 
        "quote": "", 
        "reply": "Would you guys please edit your post and put a break in the link. Anyway LOA, I almost put the same thing in my post, he wants to go out with a bang I think.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 16:00:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Would you guys please edit your post and put a break in the link. Anyway LOA, I almost put the same thing in my post, he wants to go out with a bang I think. The North hangs on as a viable country because of the tacit support they get from China. Economically they are hanging by a thread. Do you really want to get into a land war with them? Or do you think that nuking them is an option? Talk like this must be giving the government of the South the heebie jeebies. Absolutely, we should prepare for a worst case scenario, while working toward a best case scenario. Stick to our existing guns, while ignoring their rhetoric. Personally I try to avoid debating crazy people - Doesn't mean I let them walk all over me. I see the need for immediate preparation, I see no need for immediate action. Except for American Idol of course - The guard should be called out on that one. Dave", 
        "intTime": 20090527, 
        "postID": 6, 
        "quote": "Originally posted by crackerjacks61: Would you guys please edit your post and put a break in the link. Anyway LOA, I almost put the same thing in my post, he wants to go out with a bang I think.", 
        "reply": " The North hangs on as a viable country because of the tacit support they get from China. Economically they are hanging by a thread. Do you really want to get into a land war with them? Or do you think that nuking them is an option? Talk like this must be giving the government of the South the heebie jeebies. Absolutely, we should prepare for a worst case scenario, while working toward a best case scenario. Stick to our existing guns, while ignoring their rhetoric. Personally I try to avoid debating crazy people - Doesn't mean I let them walk all over me. I see the need for immediate preparation, I see no need for immediate action. Except for American Idol of course - The guard should be called out on that one. Dave", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 16:23:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "Grachus"
    }, 
    {
        "content": "Lets take our troops and pull out, then let the \"KOREAN'S\" finish what was started in 1950 Then after the bodies hit the floor we go in bury the dead, collect the wounded and give humanitarian aid. Korea is not worth the blood of any more American soldiers. let 'em finish like the Sri Lankan's finished the tigers, in detail.", 
        "intTime": 20090527, 
        "postID": 7, 
        "quote": "", 
        "reply": "Lets take our troops and pull out, then let the \"KOREAN'S\" finish what was started in 1950 Then after the bodies hit the floor we go in bury the dead, collect the wounded and give humanitarian aid. Korea is not worth the blood of any more American soldiers. let 'em finish like the Sri Lankan's finished the tigers, in detail.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 16:27:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "galloglas"
    }, 
    {
        "content": "Lets give him one. A 20 megaton one. quote: Originally posted by crackerjacks61: Would you guys please edit your post and put a break in the link. Anyway LOA, I almost put the same thing in my post, he wants to go out with a bang I think.", 
        "intTime": 20090527, 
        "postID": 8, 
        "quote": "Originally posted by crackerjacks61: Would you guys please edit your post and put a break in the link. Anyway LOA, I almost put the same thing in my post, he wants to go out with a bang I think.", 
        "reply": "Lets give him one. A 20 megaton one. ", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 16:33:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "Ok so this will show us what our Leaders are going to do. I mean are they going to run and hide or finish a war that has cost us more then most wars and has lasted for how many years? I am not going to be one to put down the war but what was our purpose for Korea or Vietnam? I am getting tired of everyone saying we had no reason for our current wars. Unless you were involved in everything you most likely dont know all of the story. I am sure Obama does now but will he admit he was wrong? There are things our Govt. knows and does that will never be made public. Did they admit when they gave Iraq the Chemicals in the first place let alone what we might have found.", 
        "intTime": 20090527, 
        "postID": 9, 
        "quote": "", 
        "reply": "Ok so this will show us what our Leaders are going to do. I mean are they going to run and hide or finish a war that has cost us more then most wars and has lasted for how many years? I am not going to be one to put down the war but what was our purpose for Korea or Vietnam? I am getting tired of everyone saying we had no reason for our current wars. Unless you were involved in everything you most likely dont know all of the story. I am sure Obama does now but will he admit he was wrong? There are things our Govt. knows and does that will never be made public. Did they admit when they gave Iraq the Chemicals in the first place let alone what we might have found.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 16:34:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "Usamp27"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Dave they have just told the world screw you were going to do whatever we want. Are we going to wait for them to strike us first? How many troops we still got in NK? I say we need to hit them hard fast and surprise the crap out of them..that is, if we had an Army and resources that was not diminished by a forever for no reason war. It hasn't escaped the notice of world leaders that our troops are otherwise occupied. This is one reason why Russia attacked Georgia last year - it was a good time to make a statement on Russia's view of NATO expansion. That was a fairly harmless (from OUR perspective) statement. The one NK's making right now is more malevolent. We don't have any strategic reserve ground-force wise. There won't be a lot we can do in that department. Our Navy vessels can more than handle themselves. Let's hope this is a gigantic game of chicken, and that they blink first, and not North Korea finally giving up, going out in a blaze of glory, taking as many it can with it.", 
        "intTime": 20090527, 
        "postID": 10, 
        "quote": "Originally posted by crackerjacks61: Dave they have just told the world screw you were going to do whatever we want. Are we going to wait for them to strike us first? How many troops we still got in NK? I say we need to hit them hard fast and surprise the crap out of them..that is, if we had an Army and resources that was not diminished by a forever for no reason war.", 
        "reply": " It hasn't escaped the notice of world leaders that our troops are otherwise occupied. This is one reason why Russia attacked Georgia last year - it was a good time to make a statement on Russia's view of NATO expansion. That was a fairly harmless (from OUR perspective) statement. The one NK's making right now is more malevolent. We don't have any strategic reserve ground-force wise. There won't be a lot we can do in that department. Our Navy vessels can more than handle themselves. Let's hope this is a gigantic game of chicken, and that they blink first, and not North Korea finally giving up, going out in a blaze of glory, taking as many it can with it.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 16:40:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "Ruanne"
    }, 
    {
        "content": "quote: Originally posted by Usamp27: Ok so this will show us what our Leaders are going to do. I mean are they going to run and hide or finish a war that has cost us more then most wars and has lasted for how many years? I am not going to be one to put down the war but what was our purpose for Korea or Vietnam? I am getting tired of everyone saying we had no reason for our current wars. Unless you were involved in everything you most likely dont know all of the story. I am sure Obama does now but will he admit he was wrong? There are things our Govt. knows and does that will never be made public. Did they admit when they gave Iraq the Chemicals in the first place let alone what we might have found. It's not our leaders who will be called upon to finish things. It will be our Army, Navy, Marine Corps, and Air Force, and the men and women who serve.", 
        "intTime": 20090527, 
        "postID": 11, 
        "quote": "Originally posted by Usamp27: Ok so this will show us what our Leaders are going to do. I mean are they going to run and hide or finish a war that has cost us more then most wars and has lasted for how many years? I am not going to be one to put down the war but what was our purpose for Korea or Vietnam? I am getting tired of everyone saying we had no reason for our current wars. Unless you were involved in everything you most likely dont know all of the story. I am sure Obama does now but will he admit he was wrong? There are things our Govt. knows and does that will never be made public. Did they admit when they gave Iraq the Chemicals in the first place let alone what we might have found.", 
        "reply": " It's not our leaders who will be called upon to finish things. It will be our Army, Navy, Marine Corps, and Air Force, and the men and women who serve.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 16:43:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "Ruanne"
    }, 
    {
        "content": "Does anyone have any news on what the DPRK army is doing on the DMZ, I caught part of blurb about they are engaging in a build up but nothing else, any news?... Respectfully, SUNLINER81", 
        "intTime": 20090527, 
        "postID": 12, 
        "quote": "", 
        "reply": "Does anyone have any news on what the DPRK army is doing on the DMZ, I caught part of blurb about they are engaging in a build up but nothing else, any news?... Respectfully, SUNLINER81", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 16:44:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Its about time to take some action, NK has been taunting the US and and NATO for some time its time to show them we can no longer stand still for the nuclear development and misssle deployments threatening other nations. play some videos of what happens when other nations band together.", 
        "intTime": 20090527, 
        "postID": 13, 
        "quote": "", 
        "reply": "Its about time to take some action, NK has been taunting the US and and NATO for some time its time to show them we can no longer stand still for the nuclear development and misssle deployments threatening other nations. play some videos of what happens when other nations band together.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 17:57:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Would you guys please edit your post and put a break in the link. Anyway LOA, I almost put the same thing in my post, he wants to go out with a bang I think. The North hangs on as a viable country because of the tacit support they get from China. Economically they are hanging by a thread. Do you really want to get into a land war with them? Or do you think that nuking them is an option? Talk like this must be giving the government of the South the heebie jeebies. Absolutely, we should prepare for a worst case scenario, while working toward a best case scenario. Stick to our existing guns, while ignoring their rhetoric. Personally I try to avoid debating crazy people - Doesn't mean I let them walk all over me. I see the need for immediate preparation, I see no need for immediate action. Except for American Idol of course - The guard should be called out on that one. Dave Dave even you must agree that the Reagan philosohy of being more ready than they are is in itself the war and can indeed be won. That should have been done along time ago. However, we can not keep making idol threats and not back them up. The time for talk is over. Screw China. Our trade means more to them than NK ever will.", 
        "intTime": 20090527, 
        "postID": 14, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: Would you guys please edit your post and put a break in the link. Anyway LOA, I almost put the same thing in my post, he wants to go out with a bang I think. The North hangs on as a viable country because of the tacit support they get from China. Economically they are hanging by a thread. Do you really want to get into a land war with them? Or do you think that nuking them is an option? Talk like this must be giving the government of the South the heebie jeebies. Absolutely, we should prepare for a worst case scenario, while working toward a best case scenario. Stick to our existing guns, while ignoring their rhetoric. Personally I try to avoid debating crazy people - Doesn't mean I let them walk all over me. I see the need for immediate preparation, I see no need for immediate action. Except for American Idol of course - The guard should be called out on that one. Dave", 
        "reply": " Dave even you must agree that the Reagan philosohy of being more ready than they are is in itself the war and can indeed be won. That should have been done along time ago. However, we can not keep making idol threats and not back them up. The time for talk is over. Screw China. Our trade means more to them than NK ever will.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 18:31:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "China does indeed control what NK does, but not what the idiot leadership SAYS, saddly. We pretty much have to roll with it for now, move air power into the area and hope that the ballon stayes teathered. We san \"win\" it with S Korea's Army, but it would be VERY bloody.", 
        "intTime": 20090527, 
        "postID": 15, 
        "quote": "", 
        "reply": "China does indeed control what NK does, but not what the idiot leadership SAYS, saddly. We pretty much have to roll with it for now, move air power into the area and hope that the ballon stayes teathered. We san \"win\" it with S Korea's Army, but it would be VERY bloody.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 19:17:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "peter3_1"
    }, 
    {
        "content": "crackerjacks61: quote: Screw China. Our trade means more to them than NK ever will. I don't know about that, America is trillions of dollars in debt to China, they could call in payment..", 
        "intTime": 20090527, 
        "postID": 16, 
        "quote": "Screw China. Our trade means more to them than NK ever will.", 
        "reply": "crackerjacks61:  I don't know about that, America is trillions of dollars in debt to China, they could call in payment..", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 20:19:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "3678131"
    }, 
    {
        "content": "The only 'beefing' up thgat seems to be in train after this, is beefing up the US presence in the Philippines. That's sort of close to Korea, ain't it? If the NK's are only bluffing, it might provide another opportunity to nail the HUKs or strike a blow against worldwide Jihadite terrorism.", 
        "intTime": 20090528, 
        "postID": 17, 
        "quote": "", 
        "reply": "The only 'beefing' up thgat seems to be in train after this, is beefing up the US presence in the Philippines. That's sort of close to Korea, ain't it? If the NK's are only bluffing, it might provide another opportunity to nail the HUKs or strike a blow against worldwide Jihadite terrorism.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-28 05:30:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "AliBubba"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Dave even you must agree that the Reagan philosohy of being more ready than they are is in itself the war and can indeed be won. That should have been done along time ago. However, we can not keep making idol threats and not back them up. The time for talk is over. Screw China. Our trade means more to them than NK ever will. This particular rhetoric was triggered by the announcement that we WILL search their their ships, and will do so BECAUSE of their proven history of supplying nuclear technology to other countries. Have we backed down? So let them fire the first shot. Not much we can realistically do until that happens. The South is pretty well prepared for a conventional war. Just what is the North going to do? Well, yes, Kim is a kind of fruit cake... This is why I have no objection for preparing for a worst case scenario - No need to rush however. Dave", 
        "intTime": 20090528, 
        "postID": 18, 
        "quote": "Originally posted by crackerjacks61: Dave even you must agree that the Reagan philosohy of being more ready than they are is in itself the war and can indeed be won. That should have been done along time ago. However, we can not keep making idol threats and not back them up. The time for talk is over. Screw China. Our trade means more to them than NK ever will.", 
        "reply": " This particular rhetoric was triggered by the announcement that we WILL search their their ships, and will do so BECAUSE of their proven history of supplying nuclear technology to other countries. Have we backed down? So let them fire the first shot. Not much we can realistically do until that happens. The South is pretty well prepared for a conventional war. Just what is the North going to do? Well, yes, Kim is a kind of fruit cake... This is why I have no objection for preparing for a worst case scenario - No need to rush however. Dave", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-28 09:41:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "Grachus"
    }, 
    {
        "content": "If China isn't going to do anything about it, then we have to. I say, boycott China goods, and drop a Nuke on Pyongyang's Presidential palace. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090528, 
        "postID": 19, 
        "quote": "", 
        "reply": "If China isn't going to do anything about it, then we have to. I say, boycott China goods, and drop a Nuke on Pyongyang's Presidential palace. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-28 09:48:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: My god we are doomed. This should have been a foreseeable event years ago and the military should have been beefed up to handle this! Past administrations have tried a variety of tactics in dealing with North Korea. So far, in the long run none have been effective. Now it's up to President Obama. But blaming previous military and civilan leaders for not having forseen the current situation accomplishes nothing. In any case, China must be a key player in this situation. If China were to cut off trade with NK I believe they will back down. Obama and Clinton must try to accomplish this. They certainly have their work cut out for them. Since we're already \"doomed\" there's nothing that can be done, right CJ?", 
        "intTime": 20090528, 
        "postID": 20, 
        "quote": "My god we are doomed. This should have been a foreseeable event years ago and the military should have been beefed up to handle this!", 
        "reply": " Past administrations have tried a variety of tactics in dealing with North Korea. So far, in the long run none have been effective. Now it's up to President Obama. But blaming previous military and civilan leaders for not having forseen the current situation accomplishes nothing. In any case, China must be a key player in this situation. If China were to cut off trade with NK I believe they will back down. Obama and Clinton must try to accomplish this. They certainly have their work cut out for them. Since we're already \"doomed\" there's nothing that can be done, right CJ?", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-28 10:06:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "I am really surprised this is not posted here yet. Has the world gone crazy? NK has just said they have broken the armistice and has threatened the US and SK but yet I turn the news on and I see a story about people cheating on the American Idol vote. My god we are doomed. This should have been a foreseeable event years ago and the military should have been beefed up to handle this! \"http://www.bloomberg.com/apps/news?pid=20601087&sid=awBTCPe7S2gw&refer=worldwide\" The Agreement \"http://www.nautilus.org/DPRKBriefingBook/agreements/ CanKor_VTK_1953_07_27_korean_armistice_agreement.pdf\"", 
        "intTime": 20090527, 
        "postID": 21, 
        "quote": "", 
        "reply": "I am really surprised this is not posted here yet. Has the world gone crazy? NK has just said they have broken the armistice and has threatened the US and SK but yet I turn the news on and I see a story about people cheating on the American Idol vote. My god we are doomed. This should have been a foreseeable event years ago and the military should have been beefed up to handle this! \"http://www.bloomberg.com/apps/news?pid=20601087&sid=awBTCPe7S2gw&refer=worldwide\" The Agreement \"http://www.nautilus.org/DPRKBriefingBook/agreements/ CanKor_VTK_1953_07_27_korean_armistice_agreement.pdf\"", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 15:07:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I am really surprised this is not posted here yet. Has the world gone crazy? NK has just said they have broken the armistice and has threatened the US and SK but yet I turn the news on and I see a story about people cheating on the American Idol vote. My god we are doomed. This should have been a foreseeable event years ago and the military should have been beefed up to handle this! \"http://www.bloomberg.com/apps/news?pid=20601087&sid=awBTCPe7S2gw&refer=worldwide\" The Agreement \"http://www.nautilus.org/DPRKBriefingBook/agreements/CanKor_VTK_1953_07_27_korean_armistice_agreement.pdf\" Come on, keep matters in perpective! Nuclera War? Light stuff, American Idol - The fate of civilisation rests on the outcome... Seriously, from your link: quote: North Korea routinely issues threats directed at the U.S., South Korea and Japan, warning of military retaliation if they continue to take actions that the country’s leadership characterizes as threats to its security. So, pause and think about this. Their series of military threats, by definition reject the '53 truce. In fact, they have in the past defined just about everything as an attack on them. I don't want to minimise this present threat, on the other hand, it does sound like a long string of their statements. Dave", 
        "intTime": 20090527, 
        "postID": 22, 
        "quote": "Originally posted by crackerjacks61: I am really surprised this is not posted here yet. Has the world gone crazy? NK has just said they have broken the armistice and has threatened the US and SK but yet I turn the news on and I see a story about people cheating on the American Idol vote. My god we are doomed. This should have been a foreseeable event years ago and the military should have been beefed up to handle this! \"http://www.bloomberg.com/apps/news?pid=20601087&sid=awBTCPe7S2gw&refer=worldwide\" The Agreement \"http://www.nautilus.org/DPRKBriefingBook/agreements/CanKor_VTK_1953_07_27_korean_armistice_agreement.pdf\"", 
        "reply": " Come on, keep matters in perpective! Nuclera War? Light stuff, American Idol - The fate of civilisation rests on the outcome... Seriously, from your link: quote: North Korea routinely issues threats directed at the U.S., South Korea and Japan, warning of military retaliation if they continue to take actions that the country’s leadership characterizes as threats to its security. So, pause and think about this. Their series of military threats, by definition reject the '53 truce. In fact, they have in the past defined just about everything as an attack on them. I don't want to minimise this present threat, on the other hand, it does sound like a long string of their statements. Dave", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 15:16:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "Grachus"
    }, 
    {
        "content": "Dave they have just told the world screw you were going to do whatever we want. Are we going to wait for them to strike us first? How many troops we still got in NK? I say we need to hit them hard fast and surprise the crap out of them..that is, if we had an Army and resources that was not diminished by a forever for no reason war.", 
        "intTime": 20090527, 
        "postID": 23, 
        "quote": "", 
        "reply": "Dave they have just told the world screw you were going to do whatever we want. Are we going to wait for them to strike us first? How many troops we still got in NK? I say we need to hit them hard fast and surprise the crap out of them..that is, if we had an Army and resources that was not diminished by a forever for no reason war.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 15:29:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: I don't want to minimise this present threat, on the other hand, it does sound like a long string of their statements. Dave In the past I would have brushed this off, but I am wondering if Kim Jong Il wants a war before he dies. That better CJ? This message has been edited. Last edited by: L0A1, Wed 27 May 2009 04:02 PM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090527, 
        "postID": 24, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: I don't want to minimise this present threat, on the other hand, it does sound like a long string of their statements. Dave", 
        "reply": " In the past I would have brushed this off, but I am wondering if Kim Jong Il wants a war before he dies. That better CJ? This message has been edited. Last edited by: L0A1, Wed 27 May 2009 04:02 PM Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 15:37:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "L0A1"
    }, 
    {
        "content": "Would you guys please edit your post and put a break in the link. Anyway LOA, I almost put the same thing in my post, he wants to go out with a bang I think.", 
        "intTime": 20090527, 
        "postID": 25, 
        "quote": "", 
        "reply": "Would you guys please edit your post and put a break in the link. Anyway LOA, I almost put the same thing in my post, he wants to go out with a bang I think.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 16:00:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Would you guys please edit your post and put a break in the link. Anyway LOA, I almost put the same thing in my post, he wants to go out with a bang I think. The North hangs on as a viable country because of the tacit support they get from China. Economically they are hanging by a thread. Do you really want to get into a land war with them? Or do you think that nuking them is an option? Talk like this must be giving the government of the South the heebie jeebies. Absolutely, we should prepare for a worst case scenario, while working toward a best case scenario. Stick to our existing guns, while ignoring their rhetoric. Personally I try to avoid debating crazy people - Doesn't mean I let them walk all over me. I see the need for immediate preparation, I see no need for immediate action. Except for American Idol of course - The guard should be called out on that one. Dave", 
        "intTime": 20090527, 
        "postID": 26, 
        "quote": "Originally posted by crackerjacks61: Would you guys please edit your post and put a break in the link. Anyway LOA, I almost put the same thing in my post, he wants to go out with a bang I think.", 
        "reply": " The North hangs on as a viable country because of the tacit support they get from China. Economically they are hanging by a thread. Do you really want to get into a land war with them? Or do you think that nuking them is an option? Talk like this must be giving the government of the South the heebie jeebies. Absolutely, we should prepare for a worst case scenario, while working toward a best case scenario. Stick to our existing guns, while ignoring their rhetoric. Personally I try to avoid debating crazy people - Doesn't mean I let them walk all over me. I see the need for immediate preparation, I see no need for immediate action. Except for American Idol of course - The guard should be called out on that one. Dave", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 16:23:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "Grachus"
    }, 
    {
        "content": "Lets take our troops and pull out, then let the \"KOREAN'S\" finish what was started in 1950 Then after the bodies hit the floor we go in bury the dead, collect the wounded and give humanitarian aid. Korea is not worth the blood of any more American soldiers. let 'em finish like the Sri Lankan's finished the tigers, in detail.", 
        "intTime": 20090527, 
        "postID": 27, 
        "quote": "", 
        "reply": "Lets take our troops and pull out, then let the \"KOREAN'S\" finish what was started in 1950 Then after the bodies hit the floor we go in bury the dead, collect the wounded and give humanitarian aid. Korea is not worth the blood of any more American soldiers. let 'em finish like the Sri Lankan's finished the tigers, in detail.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 16:27:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "galloglas"
    }, 
    {
        "content": "Lets give him one. A 20 megaton one. quote: Originally posted by crackerjacks61: Would you guys please edit your post and put a break in the link. Anyway LOA, I almost put the same thing in my post, he wants to go out with a bang I think.", 
        "intTime": 20090527, 
        "postID": 28, 
        "quote": "Originally posted by crackerjacks61: Would you guys please edit your post and put a break in the link. Anyway LOA, I almost put the same thing in my post, he wants to go out with a bang I think.", 
        "reply": "Lets give him one. A 20 megaton one. ", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 16:33:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "Ok so this will show us what our Leaders are going to do. I mean are they going to run and hide or finish a war that has cost us more then most wars and has lasted for how many years? I am not going to be one to put down the war but what was our purpose for Korea or Vietnam? I am getting tired of everyone saying we had no reason for our current wars. Unless you were involved in everything you most likely dont know all of the story. I am sure Obama does now but will he admit he was wrong? There are things our Govt. knows and does that will never be made public. Did they admit when they gave Iraq the Chemicals in the first place let alone what we might have found.", 
        "intTime": 20090527, 
        "postID": 29, 
        "quote": "", 
        "reply": "Ok so this will show us what our Leaders are going to do. I mean are they going to run and hide or finish a war that has cost us more then most wars and has lasted for how many years? I am not going to be one to put down the war but what was our purpose for Korea or Vietnam? I am getting tired of everyone saying we had no reason for our current wars. Unless you were involved in everything you most likely dont know all of the story. I am sure Obama does now but will he admit he was wrong? There are things our Govt. knows and does that will never be made public. Did they admit when they gave Iraq the Chemicals in the first place let alone what we might have found.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 16:34:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "Usamp27"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Dave they have just told the world screw you were going to do whatever we want. Are we going to wait for them to strike us first? How many troops we still got in NK? I say we need to hit them hard fast and surprise the crap out of them..that is, if we had an Army and resources that was not diminished by a forever for no reason war. It hasn't escaped the notice of world leaders that our troops are otherwise occupied. This is one reason why Russia attacked Georgia last year - it was a good time to make a statement on Russia's view of NATO expansion. That was a fairly harmless (from OUR perspective) statement. The one NK's making right now is more malevolent. We don't have any strategic reserve ground-force wise. There won't be a lot we can do in that department. Our Navy vessels can more than handle themselves. Let's hope this is a gigantic game of chicken, and that they blink first, and not North Korea finally giving up, going out in a blaze of glory, taking as many it can with it.", 
        "intTime": 20090527, 
        "postID": 30, 
        "quote": "Originally posted by crackerjacks61: Dave they have just told the world screw you were going to do whatever we want. Are we going to wait for them to strike us first? How many troops we still got in NK? I say we need to hit them hard fast and surprise the crap out of them..that is, if we had an Army and resources that was not diminished by a forever for no reason war.", 
        "reply": " It hasn't escaped the notice of world leaders that our troops are otherwise occupied. This is one reason why Russia attacked Georgia last year - it was a good time to make a statement on Russia's view of NATO expansion. That was a fairly harmless (from OUR perspective) statement. The one NK's making right now is more malevolent. We don't have any strategic reserve ground-force wise. There won't be a lot we can do in that department. Our Navy vessels can more than handle themselves. Let's hope this is a gigantic game of chicken, and that they blink first, and not North Korea finally giving up, going out in a blaze of glory, taking as many it can with it.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 16:40:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "Ruanne"
    }, 
    {
        "content": "quote: Originally posted by Usamp27: Ok so this will show us what our Leaders are going to do. I mean are they going to run and hide or finish a war that has cost us more then most wars and has lasted for how many years? I am not going to be one to put down the war but what was our purpose for Korea or Vietnam? I am getting tired of everyone saying we had no reason for our current wars. Unless you were involved in everything you most likely dont know all of the story. I am sure Obama does now but will he admit he was wrong? There are things our Govt. knows and does that will never be made public. Did they admit when they gave Iraq the Chemicals in the first place let alone what we might have found. It's not our leaders who will be called upon to finish things. It will be our Army, Navy, Marine Corps, and Air Force, and the men and women who serve.", 
        "intTime": 20090527, 
        "postID": 31, 
        "quote": "Originally posted by Usamp27: Ok so this will show us what our Leaders are going to do. I mean are they going to run and hide or finish a war that has cost us more then most wars and has lasted for how many years? I am not going to be one to put down the war but what was our purpose for Korea or Vietnam? I am getting tired of everyone saying we had no reason for our current wars. Unless you were involved in everything you most likely dont know all of the story. I am sure Obama does now but will he admit he was wrong? There are things our Govt. knows and does that will never be made public. Did they admit when they gave Iraq the Chemicals in the first place let alone what we might have found.", 
        "reply": " It's not our leaders who will be called upon to finish things. It will be our Army, Navy, Marine Corps, and Air Force, and the men and women who serve.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 16:43:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "Ruanne"
    }, 
    {
        "content": "Does anyone have any news on what the DPRK army is doing on the DMZ, I caught part of blurb about they are engaging in a build up but nothing else, any news?... Respectfully, SUNLINER81", 
        "intTime": 20090527, 
        "postID": 32, 
        "quote": "", 
        "reply": "Does anyone have any news on what the DPRK army is doing on the DMZ, I caught part of blurb about they are engaging in a build up but nothing else, any news?... Respectfully, SUNLINER81", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 16:44:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Its about time to take some action, NK has been taunting the US and and NATO for some time its time to show them we can no longer stand still for the nuclear development and misssle deployments threatening other nations. play some videos of what happens when other nations band together.", 
        "intTime": 20090527, 
        "postID": 33, 
        "quote": "", 
        "reply": "Its about time to take some action, NK has been taunting the US and and NATO for some time its time to show them we can no longer stand still for the nuclear development and misssle deployments threatening other nations. play some videos of what happens when other nations band together.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 17:57:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Would you guys please edit your post and put a break in the link. Anyway LOA, I almost put the same thing in my post, he wants to go out with a bang I think. The North hangs on as a viable country because of the tacit support they get from China. Economically they are hanging by a thread. Do you really want to get into a land war with them? Or do you think that nuking them is an option? Talk like this must be giving the government of the South the heebie jeebies. Absolutely, we should prepare for a worst case scenario, while working toward a best case scenario. Stick to our existing guns, while ignoring their rhetoric. Personally I try to avoid debating crazy people - Doesn't mean I let them walk all over me. I see the need for immediate preparation, I see no need for immediate action. Except for American Idol of course - The guard should be called out on that one. Dave Dave even you must agree that the Reagan philosohy of being more ready than they are is in itself the war and can indeed be won. That should have been done along time ago. However, we can not keep making idol threats and not back them up. The time for talk is over. Screw China. Our trade means more to them than NK ever will.", 
        "intTime": 20090527, 
        "postID": 34, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: Would you guys please edit your post and put a break in the link. Anyway LOA, I almost put the same thing in my post, he wants to go out with a bang I think. The North hangs on as a viable country because of the tacit support they get from China. Economically they are hanging by a thread. Do you really want to get into a land war with them? Or do you think that nuking them is an option? Talk like this must be giving the government of the South the heebie jeebies. Absolutely, we should prepare for a worst case scenario, while working toward a best case scenario. Stick to our existing guns, while ignoring their rhetoric. Personally I try to avoid debating crazy people - Doesn't mean I let them walk all over me. I see the need for immediate preparation, I see no need for immediate action. Except for American Idol of course - The guard should be called out on that one. Dave", 
        "reply": " Dave even you must agree that the Reagan philosohy of being more ready than they are is in itself the war and can indeed be won. That should have been done along time ago. However, we can not keep making idol threats and not back them up. The time for talk is over. Screw China. Our trade means more to them than NK ever will.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 18:31:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "China does indeed control what NK does, but not what the idiot leadership SAYS, saddly. We pretty much have to roll with it for now, move air power into the area and hope that the ballon stayes teathered. We san \"win\" it with S Korea's Army, but it would be VERY bloody.", 
        "intTime": 20090527, 
        "postID": 35, 
        "quote": "", 
        "reply": "China does indeed control what NK does, but not what the idiot leadership SAYS, saddly. We pretty much have to roll with it for now, move air power into the area and hope that the ballon stayes teathered. We san \"win\" it with S Korea's Army, but it would be VERY bloody.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 19:17:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "peter3_1"
    }, 
    {
        "content": "crackerjacks61: quote: Screw China. Our trade means more to them than NK ever will. I don't know about that, America is trillions of dollars in debt to China, they could call in payment..", 
        "intTime": 20090527, 
        "postID": 36, 
        "quote": "Screw China. Our trade means more to them than NK ever will.", 
        "reply": "crackerjacks61:  I don't know about that, America is trillions of dollars in debt to China, they could call in payment..", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-27 20:19:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "3678131"
    }, 
    {
        "content": "The only 'beefing' up thgat seems to be in train after this, is beefing up the US presence in the Philippines. That's sort of close to Korea, ain't it? If the NK's are only bluffing, it might provide another opportunity to nail the HUKs or strike a blow against worldwide Jihadite terrorism.", 
        "intTime": 20090528, 
        "postID": 37, 
        "quote": "", 
        "reply": "The only 'beefing' up thgat seems to be in train after this, is beefing up the US presence in the Philippines. That's sort of close to Korea, ain't it? If the NK's are only bluffing, it might provide another opportunity to nail the HUKs or strike a blow against worldwide Jihadite terrorism.", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-28 05:30:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "AliBubba"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Dave even you must agree that the Reagan philosohy of being more ready than they are is in itself the war and can indeed be won. That should have been done along time ago. However, we can not keep making idol threats and not back them up. The time for talk is over. Screw China. Our trade means more to them than NK ever will. This particular rhetoric was triggered by the announcement that we WILL search their their ships, and will do so BECAUSE of their proven history of supplying nuclear technology to other countries. Have we backed down? So let them fire the first shot. Not much we can realistically do until that happens. The South is pretty well prepared for a conventional war. Just what is the North going to do? Well, yes, Kim is a kind of fruit cake... This is why I have no objection for preparing for a worst case scenario - No need to rush however. Dave", 
        "intTime": 20090528, 
        "postID": 38, 
        "quote": "Originally posted by crackerjacks61: Dave even you must agree that the Reagan philosohy of being more ready than they are is in itself the war and can indeed be won. That should have been done along time ago. However, we can not keep making idol threats and not back them up. The time for talk is over. Screw China. Our trade means more to them than NK ever will.", 
        "reply": " This particular rhetoric was triggered by the announcement that we WILL search their their ships, and will do so BECAUSE of their proven history of supplying nuclear technology to other countries. Have we backed down? So let them fire the first shot. Not much we can realistically do until that happens. The South is pretty well prepared for a conventional war. Just what is the North going to do? Well, yes, Kim is a kind of fruit cake... This is why I have no objection for preparing for a worst case scenario - No need to rush however. Dave", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-28 09:41:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "Grachus"
    }, 
    {
        "content": "If China isn't going to do anything about it, then we have to. I say, boycott China goods, and drop a Nuke on Pyongyang's Presidential palace. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090528, 
        "postID": 39, 
        "quote": "", 
        "reply": "If China isn't going to do anything about it, then we have to. I say, boycott China goods, and drop a Nuke on Pyongyang's Presidential palace. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-28 09:48:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: My god we are doomed. This should have been a foreseeable event years ago and the military should have been beefed up to handle this! Past administrations have tried a variety of tactics in dealing with North Korea. So far, in the long run none have been effective. Now it's up to President Obama. But blaming previous military and civilan leaders for not having forseen the current situation accomplishes nothing. In any case, China must be a key player in this situation. If China were to cut off trade with NK I believe they will back down. Obama and Clinton must try to accomplish this. They certainly have their work cut out for them. Since we're already \"doomed\" there's nothing that can be done, right CJ?", 
        "intTime": 20090528, 
        "postID": 40, 
        "quote": "My god we are doomed. This should have been a foreseeable event years ago and the military should have been beefed up to handle this!", 
        "reply": " Past administrations have tried a variety of tactics in dealing with North Korea. So far, in the long run none have been effective. Now it's up to President Obama. But blaming previous military and civilan leaders for not having forseen the current situation accomplishes nothing. In any case, China must be a key player in this situation. If China were to cut off trade with NK I believe they will back down. Obama and Clinton must try to accomplish this. They certainly have their work cut out for them. Since we're already \"doomed\" there's nothing that can be done, right CJ?", 
        "threadID": "672198221_2360024422001", 
        "time": "2009-05-28 10:06:00", 
        "title": "North Korea Will no longer abide by the 1953 armistice", 
        "userID": "scooter_mech"
    }
]