[
    {
        "content": "A US weapons lab on Friday pulled back the curtain on a super laser with the power to burn as hot as a star. Looks familiar. \"http://www.breitbart.com/article.php?id=CNG.12fab6f6c00a65e15e6fb5e305aacbb7.41&show_article=1\"", 
        "intTime": 20090531, 
        "postID": 1, 
        "quote": "", 
        "reply": "A US weapons lab on Friday pulled back the curtain on a super laser with the power to burn as hot as a star. Looks familiar. \"http://www.breitbart.com/article.php?id=CNG.12fab6f6c00a65e15e6fb5e305aacbb7.41&show_article=1\"", 
        "threadID": "672198221_5540007422001", 
        "time": "2009-05-31 01:59:00", 
        "title": "US lab debuts super laser", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Hip hip huuuray. Now go ahead North Korea. Shoot your silly rockets at us now. Hey USSR, can you hear us now? I hope Obama will sell a few of these super lasers to China now to take off a little of our debt and maybe give one or two of them to the Saudi's for lower gas prices since we can't drill because of global warming.", 
        "intTime": 20090531, 
        "postID": 2, 
        "quote": "", 
        "reply": "Hip hip huuuray. Now go ahead North Korea. Shoot your silly rockets at us now. Hey USSR, can you hear us now? I hope Obama will sell a few of these super lasers to China now to take off a little of our debt and maybe give one or two of them to the Saudi's for lower gas prices since we can't drill because of global warming.", 
        "threadID": "672198221_5540007422001", 
        "time": "2009-05-31 02:48:00", 
        "title": "US lab debuts super laser", 
        "userID": "Duster6"
    }, 
    {
        "content": "Scientists not associated with that lab and development lamented that the laser does nothing except burn big holes. Supposedly some of those whiners are working on unproven technologies, too, about which much the same could be said of their lack of immediate application. It becomes a game for government funds and egos. I hope this develops quickly. I still think fusion shall be created for power here on earth. Probably not extensivley in my lifetime, but as an essentially clean, unlimited power source during this century. It could become a tremendous blessing for humankind. Then many of the nations selling oil will have to truly work and create wealth and not just control the pumping of what happens to lie below the surface of the ground where they happen to live.", 
        "intTime": 20090531, 
        "postID": 3, 
        "quote": "", 
        "reply": "Scientists not associated with that lab and development lamented that the laser does nothing except burn big holes. Supposedly some of those whiners are working on unproven technologies, too, about which much the same could be said of their lack of immediate application. It becomes a game for government funds and egos. I hope this develops quickly. I still think fusion shall be created for power here on earth. Probably not extensivley in my lifetime, but as an essentially clean, unlimited power source during this century. It could become a tremendous blessing for humankind. Then many of the nations selling oil will have to truly work and create wealth and not just control the pumping of what happens to lie below the surface of the ground where they happen to live.", 
        "threadID": "672198221_5540007422001", 
        "time": "2009-05-31 19:23:00", 
        "title": "US lab debuts super laser", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: Scientists not associated with that lab and development lamented that the laser does nothing except burn big holes. Supposedly some of those whiners are working on unproven technologies, too, about which much the same could be said of their lack of immediate application. It becomes a game for government funds and egos. I hope this develops quickly. I still think fusion shall be created for power here on earth. Probably not extensivley in my lifetime, but as an essentially clean, unlimited power source during this century. It could become a tremendous blessing for humankind. Then many of the nations selling oil will have to truly work and create wealth and not just control the pumping of what happens to lie below the surface of the ground where they happen to live. It will happen. One day oil will be to them like steam is now to us. A thing of the past for the most part. As far as the laser, a big hole at the temp of the core of the sun would be deadly to anyone or anything. I give it 10 to 20 years and solid projectile weapons will only be used by hobby enthusiast.", 
        "intTime": 20090531, 
        "postID": 4, 
        "quote": "Originally posted by RRR52: Scientists not associated with that lab and development lamented that the laser does nothing except burn big holes. Supposedly some of those whiners are working on unproven technologies, too, about which much the same could be said of their lack of immediate application. It becomes a game for government funds and egos. I hope this develops quickly. I still think fusion shall be created for power here on earth. Probably not extensivley in my lifetime, but as an essentially clean, unlimited power source during this century. It could become a tremendous blessing for humankind. Then many of the nations selling oil will have to truly work and create wealth and not just control the pumping of what happens to lie below the surface of the ground where they happen to live.", 
        "reply": " It will happen. One day oil will be to them like steam is now to us. A thing of the past for the most part. As far as the laser, a big hole at the temp of the core of the sun would be deadly to anyone or anything. I give it 10 to 20 years and solid projectile weapons will only be used by hobby enthusiast.", 
        "threadID": "672198221_5540007422001", 
        "time": "2009-05-31 19:35:00", 
        "title": "US lab debuts super laser", 
        "userID": "crackerjacks61"
    }
]