[
    {
        "content": "By Gloria Borger CNN Senior Political Analyst Borger: Republicans Twittering away credibility \"http://www.cnn.com/2009/POLITICS/04/14/borger.republicans/index.html\" quote: WASHINGTON (CNN) -- When presidents are new, first impressions really count: Your demeanor (shirtsleeves, not jackets, in the Oval Office), your stature (move over, Mr. Sarkozy) and, of course, your plans for America's future (not to mention your plans for our 401(k)s). CNN's Gloria Borger says Republicans need to present themselves as credible opposition. 2 of 2 Since President Obama's presidential bid was a very long affair -- and since his predecessor left with a 28 percent approval rating -- he came into office with an advantage. Americans figured they knew him and they surely liked him better than the previous guy. And they understood he was persistent: After all, he was the underdog who beat the once-presumptive nominee, Hillary Clinton. And, by the way, he also gave great speeches. But new presidents are always tested, as Joe Biden famously predicted. But not just on one front, on all fronts. And Obama has had more than his share, as he likes to remind us -- an economic crisis that threatened to take down the economy; a North Korean nuclear warhead that soared into space. And finally, the pirates of Somalia -- threatening an American crew -- hold an American captain hostage. A high-stakes, visible, compelling story, with inevitable winners and losers. That's when you learn about a president. The president played it cool -- in fact, pitch-perfect -- as it turns out. We now know that while he was saying little in public, he was completely engaged. He sent his secretary of state to warn the pirates publicly -- while the president privately held more than 17 briefings on the matter and made sure the bureaucrats at all agencies were working together (no small task). And finally, he gave an unambiguous order -- to shoot if the captain's life was in peril. Indeed, he commended the captain, the SEALs, called for multilateral efforts to stop piracy -- and went on the next day to give an economic speech. Indeed, this aide adds, \"He's not about to put on a flight suit on an aircraft carrier and declare mission accomplished.\" Not his style, they say. But what about the style of say, Newt Gingrich? The former House Speaker -- often mentioned as a possible presidential contender in 2012 -- decided to Twitter his inner thoughts on the pirates in real-time. Last Saturday: \"Obama is making a major mistake in not forcefully outlining the rules of civilization for dealing with pirates. We look weak.\" By Monday, after the safe rescue of the captain, Gingrich was, er, a tad more laudatory: \"The Navy seals did exactly the right thing in rescuing the American captain. President Obama did the right thing in allowing the Navy to act.\" A grudging kudo, if there ever was one. Would it have been better if the president of the United States had publicly engaged with a bunch of teenage thug pirates? It's beneath Obama's pay grade and dignity -- not to mention how it would have added fuel to an already incendiary situation. So how about just admitting that the administration performed admirably in this crisis? Here's the problem: If Republicans can't allow that the president did his job well in this unambiguous case, why should we believe their complaints about anything else? If they can't pat him on the back for this one, why should we even listen to their arguments about the budget, about health care, about energy? If Republicans want Americans to see their arguments as credible -- as they may well be -- they need to present themselves as the credible opposition. Good first impressions count for them, too. And so far, Republicans are Twittering them away. \"So how about just admitting that the administration performed admirably in this crisis?\" \"The Navy seals did exactly the right thing in rescuing the American captain. President Obama did the right thing in allowing the Navy to act.\" That's the quote she provided from Newt Gingrich. Question - How is his saying \"President Obama did the right thing\" not admitting the administration perfmored admirably in this crisis? Oh, it was just a \"grudging kudo\"... So she actually expects the Republicans to cheerlead Obama as the most awsome President ever because of how he handled this? Is she insane? No, she's just extremely bias. Then she twists her already twisted logic to show how Republicans are twittering away their credibility? This is pure, hard core media bias.", 
        "intTime": 20090414, 
        "postID": 1, 
        "quote": "WASHINGTON (CNN) -- When presidents are new, first impressions really count: Your demeanor (shirtsleeves, not jackets, in the Oval Office), your stature (move over, Mr. Sarkozy) and, of course, your plans for America's future (not to mention your plans for our 401(k)s). CNN's Gloria Borger says Republicans need to present themselves as credible opposition. 2 of 2 Since President Obama's presidential bid was a very long affair -- and since his predecessor left with a 28 percent approval rating -- he came into office with an advantage. Americans figured they knew him and they surely liked him better than the previous guy. And they understood he was persistent: After all, he was the underdog who beat the once-presumptive nominee, Hillary Clinton. And, by the way, he also gave great speeches. But new presidents are always tested, as Joe Biden famously predicted. But not just on one front, on all fronts. And Obama has had more than his share, as he likes to remind us -- an economic crisis that threatened to take down the economy; a North Korean nuclear warhead that soared into space. And finally, the pirates of Somalia -- threatening an American crew -- hold an American captain hostage. A high-stakes, visible, compelling story, with inevitable winners and losers. That's when you learn about a president. The president played it cool -- in fact, pitch-perfect -- as it turns out. We now know that while he was saying little in public, he was completely engaged. He sent his secretary of state to warn the pirates publicly -- while the president privately held more than 17 briefings on the matter and made sure the bureaucrats at all agencies were working together (no small task). And finally, he gave an unambiguous order -- to shoot if the captain's life was in peril. Indeed, he commended the captain, the SEALs, called for multilateral efforts to stop piracy -- and went on the next day to give an economic speech. Indeed, this aide adds, \"He's not about to put on a flight suit on an aircraft carrier and declare mission accomplished.\" Not his style, they say. But what about the style of say, Newt Gingrich? The former House Speaker -- often mentioned as a possible presidential contender in 2012 -- decided to Twitter his inner thoughts on the pirates in real-time. Last Saturday: \"Obama is making a major mistake in not forcefully outlining the rules of civilization for dealing with pirates. We look weak.\" By Monday, after the safe rescue of the captain, Gingrich was, er, a tad more laudatory: \"The Navy seals did exactly the right thing in rescuing the American captain. President Obama did the right thing in allowing the Navy to act.\" A grudging kudo, if there ever was one. Would it have been better if the president of the United States had publicly engaged with a bunch of teenage thug pirates? It's beneath Obama's pay grade and dignity -- not to mention how it would have added fuel to an already incendiary situation. So how about just admitting that the administration performed admirably in this crisis? Here's the problem: If Republicans can't allow that the president did his job well in this unambiguous case, why should we believe their complaints about anything else? If they can't pat him on the back for this one, why should we even listen to their arguments about the budget, about health care, about energy? If Republicans want Americans to see their arguments as credible -- as they may well be -- they need to present themselves as the credible opposition. Good first impressions count for them, too. And so far, Republicans are Twittering them away.", 
        "reply": "By Gloria Borger CNN Senior Political Analyst Borger: Republicans Twittering away credibility \"http://www.cnn.com/2009/POLITICS/04/14/borger.republicans/index.html\"  \"So how about just admitting that the administration performed admirably in this crisis?\" \"The Navy seals did exactly the right thing in rescuing the American captain. President Obama did the right thing in allowing the Navy to act.\" That's the quote she provided from Newt Gingrich. Question - How is his saying \"President Obama did the right thing\" not admitting the administration perfmored admirably in this crisis? Oh, it was just a \"grudging kudo\"... So she actually expects the Republicans to cheerlead Obama as the most awsome President ever because of how he handled this? Is she insane? No, she's just extremely bias. Then she twists her already twisted logic to show how Republicans are twittering away their credibility? This is pure, hard core media bias.", 
        "threadID": "672198221_3300027022001", 
        "time": "2009-04-14 13:10:00", 
        "title": "Republicans Twittering away credibility?", 
        "userID": "Osedax"
    }, 
    {
        "content": "quote: Originally posted by Osedax: \"So how about just admitting that the administration performed admirably in this crisis?\" \"The Navy seals did exactly the right thing in rescuing the American captain. President Obama did the right thing in allowing the Navy to act.\" That's the quote she provided from Newt Gingrich. Question - How is his saying \"President Obama did the right thing\" not admitting the administration perfmored admirably in this crisis? Oh, it was just a \"grudging kudo\"... So she actually expects the Republicans to cheerlead Obama as the most awsome President ever because of how he handled this? Is she insane? No, she's just extremely bias. Then she twists her already twisted logic to show how Republicans are twittering away their credibility? This is pure, hard core media bias. I disagree. What you have done is point out that Gingrich is smart enough to wipe the egg off his face - one has to ask, how did it get there in the first place? Anyone should have recognised that this situation was going to break in a few days, one way or another - Instead that were in attack mode, while events and plans were occuring behind the scene. Is this not stupid? Which is her point, which went right bye you. Meanwhile, even NOW, there are many Republican leaders who are STILL applying more and more egg, and claiming, \"On me it looks good.\" Dave", 
        "intTime": 20090414, 
        "postID": 2, 
        "quote": "Originally posted by Osedax: \"So how about just admitting that the administration performed admirably in this crisis?\" \"The Navy seals did exactly the right thing in rescuing the American captain. President Obama did the right thing in allowing the Navy to act.\" That's the quote she provided from Newt Gingrich. Question - How is his saying \"President Obama did the right thing\" not admitting the administration perfmored admirably in this crisis? Oh, it was just a \"grudging kudo\"... So she actually expects the Republicans to cheerlead Obama as the most awsome President ever because of how he handled this? Is she insane? No, she's just extremely bias. Then she twists her already twisted logic to show how Republicans are twittering away their credibility? This is pure, hard core media bias.", 
        "reply": " I disagree. What you have done is point out that Gingrich is smart enough to wipe the egg off his face - one has to ask, how did it get there in the first place? Anyone should have recognised that this situation was going to break in a few days, one way or another - Instead that were in attack mode, while events and plans were occuring behind the scene. Is this not stupid? Which is her point, which went right bye you. Meanwhile, even NOW, there are many Republican leaders who are STILL applying more and more egg, and claiming, \"On me it looks good.\" Dave", 
        "threadID": "672198221_3300027022001", 
        "time": "2009-04-14 14:13:00", 
        "title": "Republicans Twittering away credibility?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Osedax: By Gloria Borger CNN Senior Political Analyst Borger: Republicans Twittering away credibility \"http://www.cnn.com/2009/POLITICS/04/14/borger.republicans/index.html\" quote: WASHINGTON (CNN) -- When presidents are new, first impressions really count: Your demeanor (shirtsleeves, not jackets, in the Oval Office), your stature (move over, Mr. Sarkozy) and, of course, your plans for America's future (not to mention your plans for our 401(k)s). CNN's Gloria Borger says Republicans need to present themselves as credible opposition. 2 of 2 Since President Obama's presidential bid was a very long affair -- and since his predecessor left with a 28 percent approval rating -- he came into office with an advantage. Americans figured they knew him and they surely liked him better than the previous guy. And they understood he was persistent: After all, he was the underdog who beat the once-presumptive nominee, Hillary Clinton. And, by the way, he also gave great speeches.I wonder why there is no talk of his experience, or known accomplishments? But new presidents are always tested, as Joe Biden famously predicted. But not just on one front, on all fronts. And Obama has had more than his share, as he likes to remind us -- an economic crisis that threatened to take down the economy;Did I miss something? Is the \"economic crisis over? a North Korean nuclear warhead that soared into space.That the POTUS deferred to the UN. And finally, the pirates of Somalia -- threatening an American crew -- hold an American captain hostage. A high-stakes, visible, compelling story, with inevitable winners and losers. That's when you learn about a president. The president played it cool -- in fact, pitch-perfect -- as it turns out. We now know that while he was saying little in public, he was completely engaged. He sent his secretary of state to warn the pirates publicly -- while the president privately held more than 17 briefings on the matter and made sure the bureaucrats at all agencies were working together (no small task)I am soooo sure that the President is the one that made sure all of the agenicies were cooperating.. And finally, he gave an unambiguous order -- to shoot if the captain's life was in peril. He gave the order to deploy the SEALs, not the order to shoot. Indeed, he commended the captain, the SEALs, called for multilateral efforts to stop piracy -- and went on the next day to give an economic speech. Indeed, this aide adds, \"He's not about to put on a flight suit on an aircraft carrier and declare mission accomplished.\" No. He just allows his aides to call every newspaper, blog, and news station in the country to say\" Guess what the President did\". Not his style, they say. But what about the style of say, Newt Gingrich? The former House Speaker -- often mentioned as a possible presidential contender in 2012 -- decided to Twitter his inner thoughts on the pirates in real-time. Last Saturday: \"Obama is making a major mistake in not forcefully outlining the rules of civilization for dealing with pirates. We look weak.\" By Monday, after the safe rescue of the captain, Gingrich was, er, a tad more laudatory: \"The Navy seals did exactly the right thing in rescuing the American captain. President Obama did the right thing in allowing the Navy to act.\" Yes, he allowed the Navy to do their job. Not a tough decision in any way, shape, or form. A grudging kudo, if there ever was one. Would it have been better if the president of the United States had publicly engaged with a bunch of teenage thug pirates? It's beneath Obama's pay grade and dignity -- not to mention how it would have added fuel to an already incendiary situation. I guess bowing to a Saudi King is more fitting to the President's \"paygrade and dignity\" So how about just admitting that the administration performed admirably in this crisis? Mr. Gingrich did just that. Here's the problem: If Republicans can't allow that the president did his job well in this unambiguous case, why should we believe their complaints about anything else? If they can't pat him on the back for this one, why should we even listen to their arguments about the budget, about health care, about energy? Did his job well, or simply did his job? If Republicans want Americans to see their arguments as credible -- as they may well be -- they need to present themselves as the credible opposition. Good first impressions count for them, too. And so far, Republicans are Twittering them away. One Republican who doesn't even currently hold a public office and \"Republicans are Twittering them away\". \"So how about just admitting that the administration performed admirably in this crisis?\" \"The Navy seals did exactly the right thing in rescuing the American captain. President Obama did the right thing in allowing the Navy to act.\" That's the quote she provided from Newt Gingrich. Question - How is his saying \"President Obama did the right thing\" not admitting the administration perfmored admirably in this crisis? Oh, it was just a \"grudging kudo\"... So she actually expects the Republicans to cheerlead Obama as the most awsome President ever because of how he handled this? Is she insane? No, she's just extremely bias. Then she twists her already twisted logic to show how Republicans are twittering away their credibility? This is pure, hard core media bias. This lady is so far off the mark that President Obama should send in the Navy SEALS to try and help her actually hit the point she was trying to make.", 
        "intTime": 20090414, 
        "postID": 3, 
        "quote": "Originally posted by Osedax: By Gloria Borger CNN Senior Political Analyst Borger: Republicans Twittering away credibility \"http://www.cnn.com/2009/POLITICS/04/14/borger.republicans/index.html\" quote: WASHINGTON (CNN) -- When presidents are new, first impressions really count: Your demeanor (shirtsleeves, not jackets, in the Oval Office), your stature (move over, Mr. Sarkozy) and, of course, your plans for America's future (not to mention your plans for our 401(k)s). CNN's Gloria Borger says Republicans need to present themselves as credible opposition. 2 of 2 Since President Obama's presidential bid was a very long affair -- and since his predecessor left with a 28 percent approval rating -- he came into office with an advantage. Americans figured they knew him and they surely liked him better than the previous guy. And they understood he was persistent: After all, he was the underdog who beat the once-presumptive nominee, Hillary Clinton. And, by the way, he also gave great speeches.I wonder why there is no talk of his experience, or known accomplishments? But new presidents are always tested, as Joe Biden famously predicted. But not just on one front, on all fronts. And Obama has had more than his share, as he likes to remind us -- an economic crisis that threatened to take down the economy;Did I miss something? Is the \"economic crisis over? a North Korean nuclear warhead that soared into space.That the POTUS deferred to the UN. And finally, the pirates of Somalia -- threatening an American crew -- hold an American captain hostage. A high-stakes, visible, compelling story, with inevitable winners and losers. That's when you learn about a president. The president played it cool -- in fact, pitch-perfect -- as it turns out. We now know that while he was saying little in public, he was completely engaged. He sent his secretary of state to warn the pirates publicly -- while the president privately held more than 17 briefings on the matter and made sure the bureaucrats at all agencies were working together (no small task)I am soooo sure that the President is the one that made sure all of the agenicies were cooperating.. And finally, he gave an unambiguous order -- to shoot if the captain's life was in peril. He gave the order to deploy the SEALs, not the order to shoot. Indeed, he commended the captain, the SEALs, called for multilateral efforts to stop piracy -- and went on the next day to give an economic speech. Indeed, this aide adds, \"He's not about to put on a flight suit on an aircraft carrier and declare mission accomplished.\" No. He just allows his aides to call every newspaper, blog, and news station in the country to say\" Guess what the President did\". Not his style, they say. But what about the style of say, Newt Gingrich? The former House Speaker -- often mentioned as a possible presidential contender in 2012 -- decided to Twitter his inner thoughts on the pirates in real-time. Last Saturday: \"Obama is making a major mistake in not forcefully outlining the rules of civilization for dealing with pirates. We look weak.\" By Monday, after the safe rescue of the captain, Gingrich was, er, a tad more laudatory: \"The Navy seals did exactly the right thing in rescuing the American captain. President Obama did the right thing in allowing the Navy to act.\" Yes, he allowed the Navy to do their job. Not a tough decision in any way, shape, or form. A grudging kudo, if there ever was one. Would it have been better if the president of the United States had publicly engaged with a bunch of teenage thug pirates? It's beneath Obama's pay grade and dignity -- not to mention how it would have added fuel to an already incendiary situation. I guess bowing to a Saudi King is more fitting to the President's \"paygrade and dignity\" So how about just admitting that the administration performed admirably in this crisis? Mr. Gingrich did just that. Here's the problem: If Republicans can't allow that the president did his job well in this unambiguous case, why should we believe their complaints about anything else? If they can't pat him on the back for this one, why should we even listen to their arguments about the budget, about health care, about energy? Did his job well, or simply did his job? If Republicans want Americans to see their arguments as credible -- as they may well be -- they need to present themselves as the credible opposition. Good first impressions count for them, too. And so far, Republicans are Twittering them away. One Republican who doesn't even currently hold a public office and \"Republicans are Twittering them away\". \"So how about just admitting that the administration performed admirably in this crisis?\" \"The Navy seals did exactly the right thing in rescuing the American captain. President Obama did the right thing in allowing the Navy to act.\" That's the quote she provided from Newt Gingrich. Question - How is his saying \"President Obama did the right thing\" not admitting the administration perfmored admirably in this crisis? Oh, it was just a \"grudging kudo\"... So she actually expects the Republicans to cheerlead Obama as the most awsome President ever because of how he handled this? Is she insane? No, she's just extremely bias. Then she twists her already twisted logic to show how Republicans are twittering away their credibility? This is pure, hard core media bias.", 
        "reply": " This lady is so far off the mark that President Obama should send in the Navy SEALS to try and help her actually hit the point she was trying to make.", 
        "threadID": "672198221_3300027022001", 
        "time": "2009-04-14 17:25:00", 
        "title": "Republicans Twittering away credibility?", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: This lady is so far off the mark that President Obama should send in the Navy SEALS to try and help her actually hit the point she was trying to make. Oh, I believe she is right on target with HER point. And you STILL don't get it do you? basically her article is about how the Republicans respond to Obama, not whether he's right or wrong. Republicans weren't being paid to call Obama names over this pirate affair. They thought all of that up by themselves, commited themselves with off the wall rhetoric, and are now left in the position of looking ludicrous. As I say above, Gingrich is at least smart enough to wipe the egg off his face, many others are still dipping their faces in it. The issue is not that Obama did the right thing, (although he did) but that he was being attacked for doing the WRONG thing before any aspect of this incident was clarified. This incident, minor as it is, had many (yes, not all) Republicans howling for blood, (mostly Obama's) and now their left looking stupid. Apparently you approve... Secret Democrat? Dave", 
        "intTime": 20090414, 
        "postID": 4, 
        "quote": "Originally posted by stec74: This lady is so far off the mark that President Obama should send in the Navy SEALS to try and help her actually hit the point she was trying to make.", 
        "reply": " Oh, I believe she is right on target with HER point. And you STILL don't get it do you? basically her article is about how the Republicans respond to Obama, not whether he's right or wrong. Republicans weren't being paid to call Obama names over this pirate affair. They thought all of that up by themselves, commited themselves with off the wall rhetoric, and are now left in the position of looking ludicrous. As I say above, Gingrich is at least smart enough to wipe the egg off his face, many others are still dipping their faces in it. The issue is not that Obama did the right thing, (although he did) but that he was being attacked for doing the WRONG thing before any aspect of this incident was clarified. This incident, minor as it is, had many (yes, not all) Republicans howling for blood, (mostly Obama's) and now their left looking stupid. Apparently you approve... Secret Democrat? Dave", 
        "threadID": "672198221_3300027022001", 
        "time": "2009-04-14 17:33:00", 
        "title": "Republicans Twittering away credibility?", 
        "userID": "Grachus"
    }, 
    {
        "content": "I agree that Republicans are spending too much time trying to be \"anti-democrat\". I can't watch or listen to Hannity or Limbaugh, their negativity turns me off. IMHO, the Republican Party needs \"new blood\" that shys away from the partisan BS and works hard to stand by their Conservative ideals. So anyway, I think the article's author missed her point because she used Mr Gingrich's \"tweet\" to make it. If she wanted to drive home her point she could have used quotes from sitting Republican politicians about the \"pirate ordeal\". Using more than one quote from more than one Republican would have made her article factual and much more damaging to the Republican Party. Oh, and could she get her head any farther up President Obama's backside?", 
        "intTime": 20090414, 
        "postID": 5, 
        "quote": "", 
        "reply": "I agree that Republicans are spending too much time trying to be \"anti-democrat\". I can't watch or listen to Hannity or Limbaugh, their negativity turns me off. IMHO, the Republican Party needs \"new blood\" that shys away from the partisan BS and works hard to stand by their Conservative ideals. So anyway, I think the article's author missed her point because she used Mr Gingrich's \"tweet\" to make it. If she wanted to drive home her point she could have used quotes from sitting Republican politicians about the \"pirate ordeal\". Using more than one quote from more than one Republican would have made her article factual and much more damaging to the Republican Party. Oh, and could she get her head any farther up President Obama's backside?", 
        "threadID": "672198221_3300027022001", 
        "time": "2009-04-14 18:38:00", 
        "title": "Republicans Twittering away credibility?", 
        "userID": "stec74"
    }, 
    {
        "content": "There is a reason twitter starts with \"twit\"...Perfect medium for Newt.", 
        "intTime": 20090415, 
        "postID": 6, 
        "quote": "", 
        "reply": "There is a reason twitter starts with \"twit\"...Perfect medium for Newt.", 
        "threadID": "672198221_3300027022001", 
        "time": "2009-04-15 04:40:00", 
        "title": "Republicans Twittering away credibility?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by Grachus: What you have done is point out that Gingrich is smart enough to wipe the egg off his face - one has to ask, how did it get there in the first place? What in the world are you talking about egg on his face? Obama wasn't doing anything public about the situation at the time of the first quote and because Obama wasn't saying anything whatsoever, what Newt said was not out of line in the slightest. And it wasn't like Newt ripped Obama apart for inaction, he only said he needs to publicly address this so America doesn't look weak. When Obama finally did take action, Newt praised it. What part of that confuses you into thinking he had egg on his face? Gloria Borger's problem was that Newt didn't praise Obama enough for finally taking public action and then twists that into Newt losing credability for it. Stupid. quote: Anyone should have recognised that this situation was going to break in a few days, one way or another - Instead that were in attack mode, while events and plans were occuring behind the scene. Of course it was going to break one way or the other........ Do you believe Newt thought it was going to last a few years? Newt was simply making the point that Obama should be making a public show of it in some way such as \"forcefully outlining the rules of civilization for dealing with pirates\" which Obama did not do in the slightest until the sudden end of the situation. At which point Newt basically said 'it's about time' and 'good job'. All of that is very reasonable yet this stupid pundit has a problem with that? BIAS. quote: Is this not stupid? Which is her point, which went right bye you. What went right by you is the time line of events - Obama wasn't publically doing anything at all and Newt simply and only said something needs to be done publically. You can agree or disagree with him but to say he has egg on his face or lost credibility for calling for action is completely groundless, bias garbage. quote: Meanwhile, even NOW, there are many Republican leaders who are STILL applying more and more egg, and claiming, \"On me it looks good.\" If there were better examples of Republicans doing stupid things, Gloria Borger should have used one that actually makes sense. Instead she went for the \"high profile target\" no matter how contrived she had to make her argument.", 
        "intTime": 20090415, 
        "postID": 7, 
        "quote": "Originally posted by Grachus: What you have done is point out that Gingrich is smart enough to wipe the egg off his face - one has to ask, how did it get there in the first place?", 
        "reply": " What in the world are you talking about egg on his face? Obama wasn't doing anything public about the situation at the time of the first quote and because Obama wasn't saying anything whatsoever, what Newt said was not out of line in the slightest. And it wasn't like Newt ripped Obama apart for inaction, he only said he needs to publicly address this so America doesn't look weak. When Obama finally did take action, Newt praised it. What part of that confuses you into thinking he had egg on his face? Gloria Borger's problem was that Newt didn't praise Obama enough for finally taking public action and then twists that into Newt losing credability for it. Stupid. quote: Anyone should have recognised that this situation was going to break in a few days, one way or another - Instead that were in attack mode, while events and plans were occuring behind the scene. Of course it was going to break one way or the other........ Do you believe Newt thought it was going to last a few years? Newt was simply making the point that Obama should be making a public show of it in some way such as \"forcefully outlining the rules of civilization for dealing with pirates\" which Obama did not do in the slightest until the sudden end of the situation. At which point Newt basically said 'it's about time' and 'good job'. All of that is very reasonable yet this stupid pundit has a problem with that? BIAS. quote: Is this not stupid? Which is her point, which went right bye you. What went right by you is the time line of events - Obama wasn't publically doing anything at all and Newt simply and only said something needs to be done publically. You can agree or disagree with him but to say he has egg on his face or lost credibility for calling for action is completely groundless, bias garbage. quote: Meanwhile, even NOW, there are many Republican leaders who are STILL applying more and more egg, and claiming, \"On me it looks good.\" If there were better examples of Republicans doing stupid things, Gloria Borger should have used one that actually makes sense. Instead she went for the \"high profile target\" no matter how contrived she had to make her argument.", 
        "threadID": "672198221_3300027022001", 
        "time": "2009-04-15 05:27:00", 
        "title": "Republicans Twittering away credibility?", 
        "userID": "Osedax"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: There is a reason twitter starts with \"twit\"...Perfect medium for Newt. Barack Obama has used Twitter to get his message out. So are we to conclude from your statement that you believe Obama too is a \"twit\"?", 
        "intTime": 20090415, 
        "postID": 8, 
        "quote": "Originally posted by SeaWitch1220: There is a reason twitter starts with \"twit\"...Perfect medium for Newt.", 
        "reply": " Barack Obama has used Twitter to get his message out. So are we to conclude from your statement that you believe Obama too is a \"twit\"?", 
        "threadID": "672198221_3300027022001", 
        "time": "2009-04-15 05:35:00", 
        "title": "Republicans Twittering away credibility?", 
        "userID": "Osedax"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by stec74: This lady is so far off the mark that President Obama should send in the Navy SEALS to try and help her actually hit the point she was trying to make. Oh, I believe she is right on target with HER point. And you STILL don't get it do you? basically her article is about how the Republicans respond to Obama, not whether he's right or wrong. Republicans weren't being paid to call Obama names over this pirate affair. They thought all of that up by themselves, commited themselves with off the wall rhetoric, and are now left in the position of looking ludicrous. So basically it's your opinion she's trying to show how the Republicans where spewing stupid, hateful rhetoric yet the best she could come up with was \"Obama is making a major mistake in not forcefully outlining the rules of civilization for dealing with pirates. We look weak.\"? Bullocks. She picked the highest profile target she could find and fabricated a lame, groundless case against him. quote: As I say above, Gingrich is at least smart enough to wipe the egg off his face, many others are still dipping their faces in it. The issue is not that Obama did the right thing, (although he did) but that he was being attacked for doing the WRONG thing before any aspect of this incident was clarified. He was being \"attacked\", and by \"attacked\" here we mean mildly admonished, for doing nothing at all publically at a time when he was doing nothing at all publically. Now wether you agree with Newt's contention or not that Obama should have been saying something in the microphone about the situation, it's down right ridiculous to say he has egg on his face for asking that the President say something in such a situation.... quote: This incident, minor as it is, had many (yes, not all) Republicans howling for blood, (mostly Obama's) and now their left looking stupid. GO FOR THE PEOPLE THAT WERE HOWLING THEN. This justificiation you are using to attack Newt because \"other Republicans\" were saying stupid things is asinine given that Newt didn't say any of it.", 
        "intTime": 20090415, 
        "postID": 9, 
        "quote": "Originally posted by Grachus: quote: Originally posted by stec74: This lady is so far off the mark that President Obama should send in the Navy SEALS to try and help her actually hit the point she was trying to make. Oh, I believe she is right on target with HER point. And you STILL don't get it do you? basically her article is about how the Republicans respond to Obama, not whether he's right or wrong. Republicans weren't being paid to call Obama names over this pirate affair. They thought all of that up by themselves, commited themselves with off the wall rhetoric, and are now left in the position of looking ludicrous.", 
        "reply": " So basically it's your opinion she's trying to show how the Republicans where spewing stupid, hateful rhetoric yet the best she could come up with was \"Obama is making a major mistake in not forcefully outlining the rules of civilization for dealing with pirates. We look weak.\"? Bullocks. She picked the highest profile target she could find and fabricated a lame, groundless case against him. quote: As I say above, Gingrich is at least smart enough to wipe the egg off his face, many others are still dipping their faces in it. The issue is not that Obama did the right thing, (although he did) but that he was being attacked for doing the WRONG thing before any aspect of this incident was clarified. He was being \"attacked\", and by \"attacked\" here we mean mildly admonished, for doing nothing at all publically at a time when he was doing nothing at all publically. Now wether you agree with Newt's contention or not that Obama should have been saying something in the microphone about the situation, it's down right ridiculous to say he has egg on his face for asking that the President say something in such a situation.... quote: This incident, minor as it is, had many (yes, not all) Republicans howling for blood, (mostly Obama's) and now their left looking stupid. GO FOR THE PEOPLE THAT WERE HOWLING THEN. This justificiation you are using to attack Newt because \"other Republicans\" were saying stupid things is asinine given that Newt didn't say any of it.", 
        "threadID": "672198221_3300027022001", 
        "time": "2009-04-15 05:48:00", 
        "title": "Republicans Twittering away credibility?", 
        "userID": "Osedax"
    }, 
    {
        "content": "quote: Originally posted by Osedax: quote: Originally posted by SeaWitch1220: There is a reason twitter starts with \"twit\"...Perfect medium for Newt. Barack Obama has used Twitter to get his message out. So are we to conclude from your statement that you believe Obama too is a \"twit\"? Sure...if he twitters. Have you tried to use that thing? Uhg. I prefer facebook myself.", 
        "intTime": 20090415, 
        "postID": 10, 
        "quote": "Originally posted by Osedax: quote: Originally posted by SeaWitch1220: There is a reason twitter starts with \"twit\"...Perfect medium for Newt. Barack Obama has used Twitter to get his message out. So are we to conclude from your statement that you believe Obama too is a \"twit\"?", 
        "reply": " Sure...if he twitters. Have you tried to use that thing? Uhg. I prefer facebook myself.", 
        "threadID": "672198221_3300027022001", 
        "time": "2009-04-15 06:26:00", 
        "title": "Republicans Twittering away credibility?", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by Osedax: quote: Originally posted by Grachus: quote: Originally posted by stec74: This lady is so far off the mark that President Obama should send in the Navy SEALS to try and help her actually hit the point she was trying to make. Oh, I believe she is right on target with HER point. And you STILL don't get it do you? basically her article is about how the Republicans respond to Obama, not whether he's right or wrong. Republicans weren't being paid to call Obama names over this pirate affair. They thought all of that up by themselves, commited themselves with off the wall rhetoric, and are now left in the position of looking ludicrous. So basically it's your opinion she's trying to show how the Republicans where spewing stupid, hateful rhetoric yet the best she could come up with was \"Obama is making a major mistake in not forcefully outlining the rules of civilization for dealing with pirates. We look weak.\"? Bullocks. She picked the highest profile target she could find and fabricated a lame, groundless case against him. quote: As I say above, Gingrich is at least smart enough to wipe the egg off his face, many others are still dipping their faces in it. The issue is not that Obama did the right thing, (although he did) but that he was being attacked for doing the WRONG thing before any aspect of this incident was clarified. He was being \"attacked\", and by \"attacked\" here we mean mildly admonished, for doing nothing at all publically at a time when he was doing nothing at all publically. Now wether you agree with Newt's contention or not that Obama should have been saying something in the microphone about the situation, it's down right ridiculous to say he has egg on his face for asking that the President say something in such a situation.... quote: This incident, minor as it is, had many (yes, not all) Republicans howling for blood, (mostly Obama's) and now their left looking stupid. GO FOR THE PEOPLE THAT WERE HOWLING THEN. This justificiation you are using to attack Newt because \"other Republicans\" were saying stupid things is asinine given that Newt didn't say any of it. Your posts on this subject illustrate the problem better than any words of mine. Now Obama has spoken up about piracy, before this event, and after the event. You are condemning him for not speaking up DURING the event. And you don't even have a clue of how silly this position is. Dave", 
        "intTime": 20090415, 
        "postID": 11, 
        "quote": "Originally posted by Osedax: quote: Originally posted by Grachus: quote: Originally posted by stec74: This lady is so far off the mark that President Obama should send in the Navy SEALS to try and help her actually hit the point she was trying to make. Oh, I believe she is right on target with HER point. And you STILL don't get it do you? basically her article is about how the Republicans respond to Obama, not whether he's right or wrong. Republicans weren't being paid to call Obama names over this pirate affair. They thought all of that up by themselves, commited themselves with off the wall rhetoric, and are now left in the position of looking ludicrous. So basically it's your opinion she's trying to show how the Republicans where spewing stupid, hateful rhetoric yet the best she could come up with was \"Obama is making a major mistake in not forcefully outlining the rules of civilization for dealing with pirates. We look weak.\"? Bullocks. She picked the highest profile target she could find and fabricated a lame, groundless case against him. quote: As I say above, Gingrich is at least smart enough to wipe the egg off his face, many others are still dipping their faces in it. The issue is not that Obama did the right thing, (although he did) but that he was being attacked for doing the WRONG thing before any aspect of this incident was clarified. He was being \"attacked\", and by \"attacked\" here we mean mildly admonished, for doing nothing at all publically at a time when he was doing nothing at all publically. Now wether you agree with Newt's contention or not that Obama should have been saying something in the microphone about the situation, it's down right ridiculous to say he has egg on his face for asking that the President say something in such a situation.... quote: This incident, minor as it is, had many (yes, not all) Republicans howling for blood, (mostly Obama's) and now their left looking stupid. GO FOR THE PEOPLE THAT WERE HOWLING THEN. This justificiation you are using to attack Newt because \"other Republicans\" were saying stupid things is asinine given that Newt didn't say any of it.", 
        "reply": " Your posts on this subject illustrate the problem better than any words of mine. Now Obama has spoken up about piracy, before this event, and after the event. You are condemning him for not speaking up DURING the event. And you don't even have a clue of how silly this position is. Dave", 
        "threadID": "672198221_3300027022001", 
        "time": "2009-04-15 06:43:00", 
        "title": "Republicans Twittering away credibility?", 
        "userID": "Grachus"
    }, 
    {
        "content": "I do hate democrats like Dodd, Reid, Pelosi, Kennedy, Rangel and a few others but I do like their idea of having a big, big, big Federal Government. Republicans still need a few more years before they should even consider another run for the White House. Sarah Palin (Whom I love and adore) is not going to make it simply because she likes to talk. McCain is too old. He is starting to wear depends now. America will not put another Bush into office.(Sorry Jeb) and Jindal still needs a little more leadership time. ( He would be my choice) But until then Obama is doing OK. Keep filling those federal jobs and where is my stimulus check? I need it now, not sometime in June or July.", 
        "intTime": 20090415, 
        "postID": 12, 
        "quote": "", 
        "reply": "I do hate democrats like Dodd, Reid, Pelosi, Kennedy, Rangel and a few others but I do like their idea of having a big, big, big Federal Government. Republicans still need a few more years before they should even consider another run for the White House. Sarah Palin (Whom I love and adore) is not going to make it simply because she likes to talk. McCain is too old. He is starting to wear depends now. America will not put another Bush into office.(Sorry Jeb) and Jindal still needs a little more leadership time. ( He would be my choice) But until then Obama is doing OK. Keep filling those federal jobs and where is my stimulus check? I need it now, not sometime in June or July.", 
        "threadID": "672198221_3300027022001", 
        "time": "2009-04-15 07:03:00", 
        "title": "Republicans Twittering away credibility?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Your posts on this subject illustrate the problem better than any words of mine. I don't believe you even grasp what this discussion is about... quote: Now Obama has spoken up about piracy, before this event, and after the event. You are condemning him for not speaking up DURING the event. And you don't even have a clue of how silly this position is. Wow. You've basically just tried to side step the entire discussion by attacking me because you realize you've been trying to defend the undefendable. I didn't condemn Obama. I did not express any opinion whatsoever about Obama's response. So what the hell are you talking about saying \"[I] condemned him for not speaking up DURING the event\"? Your statement is totally baseless bull pucky. Again, I have no confidence you even understand the discussion. This discussion isn't about if Newt's statements were correct or not, it's about Gloria Borger claiming \"Republicans Twittering away credibility\" based on two quotes from Newt, one of them simply saying Obama should say or do something at a time when he was silent and the other praising the President for his actions.... Neither of those statements is contraversal AT ALL and they certainly don't \"Twitter away credibility\"... Her position is insane and I can understand why you are trying to avoid addressing it directly. However, avoiding the issue and, worse, attacking me and claiming I said things I did not is asinine and is hardly grounds for a good argument.", 
        "intTime": 20090415, 
        "postID": 13, 
        "quote": "Originally posted by Grachus: Your posts on this subject illustrate the problem better than any words of mine.", 
        "reply": " I don't believe you even grasp what this discussion is about... quote: Now Obama has spoken up about piracy, before this event, and after the event. You are condemning him for not speaking up DURING the event. And you don't even have a clue of how silly this position is. Wow. You've basically just tried to side step the entire discussion by attacking me because you realize you've been trying to defend the undefendable. I didn't condemn Obama. I did not express any opinion whatsoever about Obama's response. So what the hell are you talking about saying \"[I] condemned him for not speaking up DURING the event\"? Your statement is totally baseless bull pucky. Again, I have no confidence you even understand the discussion. This discussion isn't about if Newt's statements were correct or not, it's about Gloria Borger claiming \"Republicans Twittering away credibility\" based on two quotes from Newt, one of them simply saying Obama should say or do something at a time when he was silent and the other praising the President for his actions.... Neither of those statements is contraversal AT ALL and they certainly don't \"Twitter away credibility\"... Her position is insane and I can understand why you are trying to avoid addressing it directly. However, avoiding the issue and, worse, attacking me and claiming I said things I did not is asinine and is hardly grounds for a good argument.", 
        "threadID": "672198221_3300027022001", 
        "time": "2009-04-15 07:37:00", 
        "title": "Republicans Twittering away credibility?", 
        "userID": "Osedax"
    }
]