[
    {
        "content": "quote: The withdrawal of a former US Ambassador to Saudi Arabia from his new post as chairman of the National Intelligence Council has ignited a debate in Washington over whether the \"Israel lobby'' is exercising too much influence over who serves in the Obama Administration. Charles Freeman resigned this week from his new post as chair of the NIC — which oversees the production of reports representing the view of the nation's 16 intelligence agencies — after lamenting in an e-mail \"the barrage of libelous distortions of my record [that] would not cease upon my entry into office\". \"The libels on me and their easily traceable e-mail trails show conclusively that there is a powerful lobby determined to prevent any view other than its own from being aired, still less to factor in American understanding of trends and events in the Middle East,'' Mr Freeman wrote in the e-mail. Referring to what he called \"the Israel Lobby\", he wrote: \"The aim of this lobby is control of the policy process through the exercise of a veto over the appointment of people who dispute the wisdom of its views.'' This resulted in the \"the inability of the American public to discuss, or the government to consider, any option for US policies in the Middle East opposed by the ruling faction in Israeli politics'\". Mr Freeman has aggressively criticised the Israeli Government, the war in Iraq and the War on Terror. In the past two weeks almost three dozen politicians, primarily Republicans, have questioned his ability to be objective in his analysis. Mr Freeman's financial, personal and business ties with the governments of China and Saudi Arabia have also been called into account. He was president of the Middle East Policy Council, which received some funding from the Saudi Government, and he is on the international board of advisers to a Chinese-government owned oil company. The congressional complaints resulted in an inspector-general's investigation into Mr Freeman's ties to the Saudi Government. Most of the campaign against him, however, has focused on his past critical statements about Israel. These include a 2005 speech that he gave to the National Council on US-Arab Relations, in which he referred to Israel's \"high-handed and self-defeating policies'' stemming from the \"occupation and settlement of Arab lands,'' which he called \"inherently violent''. The Washington Post reported today that only a few Jewish organisations came out publicly against Mr Freeman's appointment, but a handful of pro-Israeli bloggers and employees of other organisations worked behind the scenes to raise concerns with members of Congress, their staffs and the media. For example, the American Israel Public Affairs Committee (AIPAC), often described as the most influential pro-Israel lobbying group in Washington, \"took no position on this matter and did not lobby the Hill on it'\", spokesman Josh Block told the paper. But Mr Block responded to reporters' questions and provided critical material about Mr Freeman, albeit always on background, meaning that his comments could not be attributed to him, according to three journalists who spoke to him, The Post reported. Stephen Walt, a Harvard academic who, with Chicago academic John Mearsheimer in 2006, famously described the influence of the Israel lobby on Washington as dangerous, wrote on ForeignPolicy.com today: \"For all of you out there who may have questioned whether there was a powerful 'Israel lobby', or who admitted that it existed but didn't think it had much influence . . . think again.'' (...) +http://www.timesonline.co.uk/tol/news/world/us_and_americas/article5892690.ece", 
        "intTime": 20090312, 
        "postID": 1, 
        "quote": "The withdrawal of a former US Ambassador to Saudi Arabia from his new post as chairman of the National Intelligence Council has ignited a debate in Washington over whether the \"Israel lobby'' is exercising too much influence over who serves in the Obama Administration. Charles Freeman resigned this week from his new post as chair of the NIC — which oversees the production of reports representing the view of the nation's 16 intelligence agencies — after lamenting in an e-mail \"the barrage of libelous distortions of my record [that] would not cease upon my entry into office\". \"The libels on me and their easily traceable e-mail trails show conclusively that there is a powerful lobby determined to prevent any view other than its own from being aired, still less to factor in American understanding of trends and events in the Middle East,'' Mr Freeman wrote in the e-mail. Referring to what he called \"the Israel Lobby\", he wrote: \"The aim of this lobby is control of the policy process through the exercise of a veto over the appointment of people who dispute the wisdom of its views.'' This resulted in the \"the inability of the American public to discuss, or the government to consider, any option for US policies in the Middle East opposed by the ruling faction in Israeli politics'\". Mr Freeman has aggressively criticised the Israeli Government, the war in Iraq and the War on Terror. In the past two weeks almost three dozen politicians, primarily Republicans, have questioned his ability to be objective in his analysis. Mr Freeman's financial, personal and business ties with the governments of China and Saudi Arabia have also been called into account. He was president of the Middle East Policy Council, which received some funding from the Saudi Government, and he is on the international board of advisers to a Chinese-government owned oil company. The congressional complaints resulted in an inspector-general's investigation into Mr Freeman's ties to the Saudi Government. Most of the campaign against him, however, has focused on his past critical statements about Israel. These include a 2005 speech that he gave to the National Council on US-Arab Relations, in which he referred to Israel's \"high-handed and self-defeating policies'' stemming from the \"occupation and settlement of Arab lands,'' which he called \"inherently violent''. The Washington Post reported today that only a few Jewish organisations came out publicly against Mr Freeman's appointment, but a handful of pro-Israeli bloggers and employees of other organisations worked behind the scenes to raise concerns with members of Congress, their staffs and the media. For example, the American Israel Public Affairs Committee (AIPAC), often described as the most influential pro-Israel lobbying group in Washington, \"took no position on this matter and did not lobby the Hill on it'\", spokesman Josh Block told the paper. But Mr Block responded to reporters' questions and provided critical material about Mr Freeman, albeit always on background, meaning that his comments could not be attributed to him, according to three journalists who spoke to him, The Post reported. Stephen Walt, a Harvard academic who, with Chicago academic John Mearsheimer in 2006, famously described the influence of the Israel lobby on Washington as dangerous, wrote on ForeignPolicy.com today: \"For all of you out there who may have questioned whether there was a powerful 'Israel lobby', or who admitted that it existed but didn't think it had much influence . . . think again.'' (...)", 
        "reply": " +http://www.timesonline.co.uk/tol/news/world/us_and_americas/article5892690.ece", 
        "threadID": "672198221_2170026712001", 
        "time": "2009-03-12 05:07:00", 
        "title": "'Israel lobby' blamed for resignation of US intelligence chief", 
        "userID": "Knele"
    }
]