[
    {
        "content": "\"www.timesonline.co.uk/tol/news/world/europe/article6066343.ece\" Well if they weren't 'communists' what are they doing trying to overthrow the duly-elected head of a democracy-loving state? When the Ossetians and the Abkhazis took to the streets back in 2000, it meant little bits of Prince Sarkaashvili's gallant li'l empire were breaking off. This message has been edited. Last edited by: gypsysnipe, Thu 09 April 2009 07:48 AM", 
        "intTime": 20090409, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"www.timesonline.co.uk/tol/news/world/europe/article6066343.ece\" Well if they weren't 'communists' what are they doing trying to overthrow the duly-elected head of a democracy-loving state? When the Ossetians and the Abkhazis took to the streets back in 2000, it meant little bits of Prince Sarkaashvili's gallant li'l empire were breaking off. This message has been edited. Last edited by: gypsysnipe, Thu 09 April 2009 07:48 AM", 
        "threadID": "672198221_4730042022001", 
        "time": "2009-04-09 05:11:00", 
        "title": "'Communists' Riot in Georgia", 
        "userID": "popsiq"
    }, 
    {
        "content": "---http://www.youtube.com/watch?v=DJm64CIbYFM", 
        "intTime": 20090409, 
        "postID": 2, 
        "quote": "", 
        "reply": "---http://www.youtube.com/watch?v=DJm64CIbYFM", 
        "threadID": "672198221_4730042022001", 
        "time": "2009-04-09 05:25:00", 
        "title": "'Communists' Riot in Georgia", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by popsiq: \"www.timesonline.co.uk/tol/news/world/europe/article6066343.ece\" Well if they weren't 'communists' what are they doing trying to overthrow the duly-elected head of a democracy-loving state? When the Ossetians and the Abkhazis took to the streets back in 2000, it meant little bits of Prince Sarkaashvili's gallant li'l empire were breaking off. Just because you hold demonstrations to oust your Pres. does not mean you are a communist. If that were the case Dems would be communist for holding demonstrations to oust Bush. This message has been edited. Last edited by: gypsysnipe, Thu 09 April 2009 07:49 AM \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090409, 
        "postID": 3, 
        "quote": "Originally posted by popsiq: \"www.timesonline.co.uk/tol/news/world/europe/article6066343.ece\" Well if they weren't 'communists' what are they doing trying to overthrow the duly-elected head of a democracy-loving state? When the Ossetians and the Abkhazis took to the streets back in 2000, it meant little bits of Prince Sarkaashvili's gallant li'l empire were breaking off.", 
        "reply": " Just because you hold demonstrations to oust your Pres. does not mean you are a communist. If that were the case Dems would be communist for holding demonstrations to oust Bush. This message has been edited. Last edited by: gypsysnipe, Thu 09 April 2009 07:49 AM \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4730042022001", 
        "time": "2009-04-09 06:08:00", 
        "title": "'Communists' Riot in Georgia", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Just because you hold demonstrations to oust your Pres. does not mean you are a communist. If that were the case Dems would be communist for holding demonstrations to oust Bush. Exactly what would the argument be that they aren't? Considering the legislative efforts demonstrated since 01/20/09 the two seem rather synonymous.", 
        "intTime": 20090409, 
        "postID": 4, 
        "quote": "Originally posted by Anbar7: Just because you hold demonstrations to oust your Pres. does not mean you are a communist. If that were the case Dems would be communist for holding demonstrations to oust Bush.", 
        "reply": " Exactly what would the argument be that they aren't? Considering the legislative efforts demonstrated since 01/20/09 the two seem rather synonymous.", 
        "threadID": "672198221_4730042022001", 
        "time": "2009-04-09 06:32:00", 
        "title": "'Communists' Riot in Georgia", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: quote: Originally posted by Anbar7: Just because you hold demonstrations to oust your Pres. does not mean you are a communist. If that were the case Dems would be communist for holding demonstrations to oust Bush. Exactly what would the argument be that they aren't? Considering the legislative efforts demonstrated since 01/20/09 the two seem rather synonymous. FREEDOM OF SPEECH \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090409, 
        "postID": 5, 
        "quote": "Originally posted by adminnco1: quote: Originally posted by Anbar7: Just because you hold demonstrations to oust your Pres. does not mean you are a communist. If that were the case Dems would be communist for holding demonstrations to oust Bush. Exactly what would the argument be that they aren't? Considering the legislative efforts demonstrated since 01/20/09 the two seem rather synonymous.", 
        "reply": " FREEDOM OF SPEECH \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4730042022001", 
        "time": "2009-04-09 07:31:00", 
        "title": "'Communists' Riot in Georgia", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by popsiq: \"www.timesonline.co.uk/tol/news/world/europe/article6066343.ece\" Well if they weren't 'communists' what are they doing trying to overthrow the duly-elected head of a democracy-loving state? When the Ossetians and the Abkhazis took to the streets back in 2000, it meant little bits of Prince Sarkaashvili's gallant li'l empire were breaking off. What are they doing overthrowing the State when all they have to do is wait till the next election and then get rid of him? Are these 100,000 or so people all of the people of Georgie? I assume that if a million or so outraged Republicans demand Obama resign, and we hold a new election, you would back them? Finally of course your last remark - Neat trick getting a 100,000 Ossetians to march - They don't have that many people in the whole \"country.\" Dave", 
        "intTime": 20090409, 
        "postID": 6, 
        "quote": "Originally posted by popsiq: \"www.timesonline.co.uk/tol/news/world/europe/article6066343.ece\" Well if they weren't 'communists' what are they doing trying to overthrow the duly-elected head of a democracy-loving state? When the Ossetians and the Abkhazis took to the streets back in 2000, it meant little bits of Prince Sarkaashvili's gallant li'l empire were breaking off.", 
        "reply": " What are they doing overthrowing the State when all they have to do is wait till the next election and then get rid of him? Are these 100,000 or so people all of the people of Georgie? I assume that if a million or so outraged Republicans demand Obama resign, and we hold a new election, you would back them? Finally of course your last remark - Neat trick getting a 100,000 Ossetians to march - They don't have that many people in the whole \"country.\" Dave", 
        "threadID": "672198221_4730042022001", 
        "time": "2009-04-09 09:11:00", 
        "title": "'Communists' Riot in Georgia", 
        "userID": "Grachus"
    }
]