[
    {
        "content": "Ruh Roh! FBI raids office of D.C. CTO, Obama appointee 'http://www.politico.com/blogs/bensmith/0309/FBI_raids_office_of_DC_CTO_Obama_appointee.html Federal agents this morning are searching the office Washington, D.C.'s Chief Technology Officer. The search is part of \"an ongoing investigation,\" said a spokeswoman for the FBI's D.C. Field Office, Lindsay Gotwin, said. She declined to comment further on the raid of office, at 1 Judiciary Square. The outgoing Chief Technology Officer, Vivek Kundra, was appointed last week Chief Information Officer by the Obama administration. His last day at the city government office was February 4, a spokeswoman for D.C. Mayor Adrian Fenty, Leslie Kershaw, said. He was appointed to the Washington post in 2007. \"We know the FBI is over there but that's all we know,\" said a staffer in the D.C. CTO's office, Mario Field, who was working from a separate location. Another source familiar with the raid said the FBI had sent all staffers other than senior executives home for the day. WTOP Radio reported that agents are searching the 9th and 10th floors of the building. A White House spokesman had no immediate comment. <edit>", 
        "intTime": 20090312, 
        "postID": 1, 
        "quote": "", 
        "reply": "Ruh Roh! FBI raids office of D.C. CTO, Obama appointee 'http://www.politico.com/blogs/bensmith/0309/FBI_raids_office_of_DC_CTO_Obama_appointee.html Federal agents this morning are searching the office Washington, D.C.'s Chief Technology Officer. The search is part of \"an ongoing investigation,\" said a spokeswoman for the FBI's D.C. Field Office, Lindsay Gotwin, said. She declined to comment further on the raid of office, at 1 Judiciary Square. The outgoing Chief Technology Officer, Vivek Kundra, was appointed last week Chief Information Officer by the Obama administration. His last day at the city government office was February 4, a spokeswoman for D.C. Mayor Adrian Fenty, Leslie Kershaw, said. He was appointed to the Washington post in 2007. \"We know the FBI is over there but that's all we know,\" said a staffer in the D.C. CTO's office, Mario Field, who was working from a separate location. Another source familiar with the raid said the FBI had sent all staffers other than senior executives home for the day. WTOP Radio reported that agents are searching the 9th and 10th floors of the building. A White House spokesman had no immediate comment. <edit>", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 08:17:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "This should be good once they come out with what they are doing. This ain't about not paying taxes. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090312, 
        "postID": 2, 
        "quote": "", 
        "reply": "This should be good once they come out with what they are doing. This ain't about not paying taxes. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 08:23:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: This should be good once they come out with what they are doing. This ain't about not paying taxes. Did this guy have anything to do with online contributions during his campaign?", 
        "intTime": 20090312, 
        "postID": 3, 
        "quote": "Originally posted by Anbar7: This should be good once they come out with what they are doing. This ain't about not paying taxes.", 
        "reply": " Did this guy have anything to do with online contributions during his campaign?", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 08:25:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: A White House spokesman had no immediate comment. Gee, wonder why. Could it be because they don't have enough information? I would like to know what this is about, guess we will hav to wait until after the investigation is done. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090312, 
        "postID": 4, 
        "quote": "A White House spokesman had no immediate comment.", 
        "reply": " Gee, wonder why. Could it be because they don't have enough information? I would like to know what this is about, guess we will hav to wait until after the investigation is done. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 08:25:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: A White House spokesman had no immediate comment. Gee, wonder why. Could it be because they don't have enough information? I would like to know what this is about, guess we will hav to wait until after the investigation is done. No the media will dig into this for us.", 
        "intTime": 20090312, 
        "postID": 5, 
        "quote": "Originally posted by L0A1: quote: A White House spokesman had no immediate comment. Gee, wonder why. Could it be because they don't have enough information? I would like to know what this is about, guess we will hav to wait until after the investigation is done.", 
        "reply": " No the media will dig into this for us.", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 08:26:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by L0A1: quote: A White House spokesman had no immediate comment. Gee, wonder why. Could it be because they don't have enough information? I would like to know what this is about, guess we will hav to wait until after the investigation is done. No the media will dig into this for us. Not while President Obama is in office. This would be all over the place if it was Bush dontcha know. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090312, 
        "postID": 6, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by L0A1: quote: A White House spokesman had no immediate comment. Gee, wonder why. Could it be because they don't have enough information? I would like to know what this is about, guess we will hav to wait until after the investigation is done. No the media will dig into this for us.", 
        "reply": " Not while President Obama is in office. This would be all over the place if it was Bush dontcha know. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 08:28:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "L0A1"
    }, 
    {
        "content": "Maybe Obama should first appoint a worshipper to the chief FBI post. Then he could appoint anyone regardless. So far it looks like Obama appointees are not above the FBI. Almost makes one think that J Edgar Hoover is alive and well and doing his job.", 
        "intTime": 20090312, 
        "postID": 7, 
        "quote": "", 
        "reply": "Maybe Obama should first appoint a worshipper to the chief FBI post. Then he could appoint anyone regardless. So far it looks like Obama appointees are not above the FBI. Almost makes one think that J Edgar Hoover is alive and well and doing his job.", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 08:45:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "UPDATE: 2 arrested in FBI raid at Obama appointee's office WASHINGTON - Two officials in the D.C.'s Office of the Chief Technology Officer have been arrested in a federal bribery sting, sources tell WTOP. D.C. Office of the Chief Technology Officer employees Sushil Bansal and 40-year-old Yusuf Acar have been arrested, sources tell WTOP. Acar was taken into custody Thursday morning by FBI agents at his home in Northwest D.C. The FBI is now serving a search warrant at the office of D.C.'s Chief Technology Officer, WTOP has learned. \"We are there as part of a continuing ongoing criminal investigation,\" FBI Washington Field Office spokesperson Katherine Schweit tells WTOP. Schweit would not comment on the details of the investigation. More than a dozen FBI agents - including evidence technicians - at the office, located at 1 Judiciary Square on 4th Street in Northwest, WTOP's Mark Segraves reports. Most of the employees have been told to go home. Other employees have been segregated into a waiting room. Segraves reports the FBI's search has expanded from 9th floor offices to 10th floor offices. A spokesman for D.C.'s U.S. Attorney tells WTOP he cannot discuss the investigation, as it is currently sealed. On March 5, President Barack Obama named D.C. Chief Technology Officer Vivek Kundra as the federal government's chief information officer. Kundra's last day was March 4. Kundra, who was in charge of technology in the District since 2007, has been a consultant to Obama since he won the election. \"http://www.wtop.com/?nid=596&sid=1622618\" (Copyright 2009 by WTOP. All Rights Reserved.) \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090312, 
        "postID": 8, 
        "quote": "", 
        "reply": "UPDATE: 2 arrested in FBI raid at Obama appointee's office WASHINGTON - Two officials in the D.C.'s Office of the Chief Technology Officer have been arrested in a federal bribery sting, sources tell WTOP. D.C. Office of the Chief Technology Officer employees Sushil Bansal and 40-year-old Yusuf Acar have been arrested, sources tell WTOP. Acar was taken into custody Thursday morning by FBI agents at his home in Northwest D.C. The FBI is now serving a search warrant at the office of D.C.'s Chief Technology Officer, WTOP has learned. \"We are there as part of a continuing ongoing criminal investigation,\" FBI Washington Field Office spokesperson Katherine Schweit tells WTOP. Schweit would not comment on the details of the investigation. More than a dozen FBI agents - including evidence technicians - at the office, located at 1 Judiciary Square on 4th Street in Northwest, WTOP's Mark Segraves reports. Most of the employees have been told to go home. Other employees have been segregated into a waiting room. Segraves reports the FBI's search has expanded from 9th floor offices to 10th floor offices. A spokesman for D.C.'s U.S. Attorney tells WTOP he cannot discuss the investigation, as it is currently sealed. On March 5, President Barack Obama named D.C. Chief Technology Officer Vivek Kundra as the federal government's chief information officer. Kundra's last day was March 4. Kundra, who was in charge of technology in the District since 2007, has been a consultant to Obama since he won the election. \"http://www.wtop.com/?nid=596&sid=1622618\" (Copyright 2009 by WTOP. All Rights Reserved.) \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 08:49:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Nancy Pelosi's plan to \"drain the swamp\" in Washington to get rid of corrupt politicians and the culture of corruption seems to be working. Who'd of thought she would smartly use the lure of political appointments to the Obama Administration to catch these corrupt officials. Too bad they're all turning out to be democrats. Who knew...? \"The World's Finest\"", 
        "intTime": 20090312, 
        "postID": 9, 
        "quote": "", 
        "reply": "Nancy Pelosi's plan to \"drain the swamp\" in Washington to get rid of corrupt politicians and the culture of corruption seems to be working. Who'd of thought she would smartly use the lure of political appointments to the Obama Administration to catch these corrupt officials. Too bad they're all turning out to be democrats. Who knew...? \"The World's Finest\"", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 08:52:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Nancy Pelosi's plan to \"drain the swamp\" in Washington to get rid of corrupt politicians and the culture of corruption seems to be working. Who'd of thought she would smartly use the lure of political appointments to the Obama Administration to catch these corrupt officials. Too bad they're all turning out to be democrats. Who knew...? KARMA \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090312, 
        "postID": 10, 
        "quote": "Originally posted by Kegler300: Nancy Pelosi's plan to \"drain the swamp\" in Washington to get rid of corrupt politicians and the culture of corruption seems to be working. Who'd of thought she would smartly use the lure of political appointments to the Obama Administration to catch these corrupt officials. Too bad they're all turning out to be democrats. Who knew...?", 
        "reply": " KARMA \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 09:14:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Schweit would not comment on the details of the investigation. And neither will any Libs on this board.", 
        "intTime": 20090312, 
        "postID": 11, 
        "quote": "Schweit would not comment on the details of the investigation.", 
        "reply": " And neither will any Libs on this board.", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 10:31:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Schweit would not comment on the details of the investigation. And neither will any Libs on this board. they have nothing to say because they can't defend this one. either that or they will bring up something that the Bush administration did. Kind of like well he did it too. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090312, 
        "postID": 12, 
        "quote": "Originally posted by GunnyRet03: quote: Schweit would not comment on the details of the investigation. And neither will any Libs on this board.", 
        "reply": " they have nothing to say because they can't defend this one. either that or they will bring up something that the Bush administration did. Kind of like well he did it too. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 11:02:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Stupid Question What is a \"Chief Technology Officer\" Never heard of this appointment before.", 
        "intTime": 20090312, 
        "postID": 13, 
        "quote": "", 
        "reply": "Stupid Question What is a \"Chief Technology Officer\" Never heard of this appointment before.", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 11:34:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Stupid Question What is a \"Chief Technology Officer\" Never heard of this appointment before. Contrast with Chief Information Officer The focus of a CTO may be contrasted with that of a CIO in that, whereas a CIO is predisposed to solve problems by acquiring and adapting ready-made technologies, a CTO is predisposed to solve problems by developing new technologies. In practice, each will typically blend both approaches. In an enterprise whose primary technology concerns are addressable by ready-made technologies, a CIO might be the primary representative of technology issues at the executive level. In an enterprise whose primary technology concerns are addressed by developing (and perhaps productising) new technologies, or the general strategic exploitation of intellectual property held by the company, a CTO might be the primary representative of these concerns at the executive level. Genesis of the CTO role Though the position may be said to have emerged in the 1980s from that of Director of Research and Development, it came into significant use during the dot-com era of the 1990s. In such smaller, emerging companies, internally-focused, traditional CIO concerns such as office automation, regulatory compliance, data storage, security, enterprise networking, and workstation provisioning would fall initially within the aegis of the CTO. When the company- and its internal technology concerns- became larger and more complex, a CIO position might be created, reporting to either the Chief technology officer, Chief financial officer or Chief executive officer. In older industries (whose existence may pre-date IT automation) such as manufacturing, shipping or banking, the CIO role would arise out of the process of automating existing enterprises, and any CTO-like role would emerge as internal development efforts grew to significant complexity to be of executive-level concern, perhaps through intrapreneuring, often in imitation of dot-com-style innovations. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090312, 
        "postID": 14, 
        "quote": "Originally posted by LineDoggie: Stupid Question What is a \"Chief Technology Officer\" Never heard of this appointment before.", 
        "reply": " Contrast with Chief Information Officer The focus of a CTO may be contrasted with that of a CIO in that, whereas a CIO is predisposed to solve problems by acquiring and adapting ready-made technologies, a CTO is predisposed to solve problems by developing new technologies. In practice, each will typically blend both approaches. In an enterprise whose primary technology concerns are addressable by ready-made technologies, a CIO might be the primary representative of technology issues at the executive level. In an enterprise whose primary technology concerns are addressed by developing (and perhaps productising) new technologies, or the general strategic exploitation of intellectual property held by the company, a CTO might be the primary representative of these concerns at the executive level. Genesis of the CTO role Though the position may be said to have emerged in the 1980s from that of Director of Research and Development, it came into significant use during the dot-com era of the 1990s. In such smaller, emerging companies, internally-focused, traditional CIO concerns such as office automation, regulatory compliance, data storage, security, enterprise networking, and workstation provisioning would fall initially within the aegis of the CTO. When the company- and its internal technology concerns- became larger and more complex, a CIO position might be created, reporting to either the Chief technology officer, Chief financial officer or Chief executive officer. In older industries (whose existence may pre-date IT automation) such as manufacturing, shipping or banking, the CIO role would arise out of the process of automating existing enterprises, and any CTO-like role would emerge as internal development efforts grew to significant complexity to be of executive-level concern, perhaps through intrapreneuring, often in imitation of dot-com-style innovations. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 11:43:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "Anbar7"
    }, 
    {
        "content": "The White House can double as A work release facility!!", 
        "intTime": 20090312, 
        "postID": 15, 
        "quote": "", 
        "reply": "The White House can double as A work release facility!!", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 11:44:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "KSHAYMAN"
    }, 
    {
        "content": "Somebody needs to post a list of all of those connected to Obama or appointed by him who have not paid taxes, fell into corruption, tried to bribe people, bombed buildings, etc. I am starting to lose track.", 
        "intTime": 20090312, 
        "postID": 16, 
        "quote": "", 
        "reply": "Somebody needs to post a list of all of those connected to Obama or appointed by him who have not paid taxes, fell into corruption, tried to bribe people, bombed buildings, etc. I am starting to lose track.", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 12:06:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: Somebody needs to post a list of all of those connected to Obama or appointed by him who have not paid taxes, fell into corruption, tried to bribe people, bombed buildings, etc. I am starting to lose track. Not enough bandwidth here.", 
        "intTime": 20090312, 
        "postID": 17, 
        "quote": "Originally posted by 10tenths: Somebody needs to post a list of all of those connected to Obama or appointed by him who have not paid taxes, fell into corruption, tried to bribe people, bombed buildings, etc. I am starting to lose track.", 
        "reply": " Not enough bandwidth here.", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 12:41:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Heard the \"tingle up the leg\" guy was going to do that. Should be done soon.", 
        "intTime": 20090312, 
        "postID": 18, 
        "quote": "", 
        "reply": "Heard the \"tingle up the leg\" guy was going to do that. Should be done soon.", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 12:45:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Heard the \"tingle up the leg\" guy was going to do that. Should be done soon. Are you talking about mime-boy?", 
        "intTime": 20090312, 
        "postID": 19, 
        "quote": "Originally posted by ACR26: Heard the \"tingle up the leg\" guy was going to do that. Should be done soon.", 
        "reply": " Are you talking about mime-boy?", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 12:47:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Stupid Question What is a \"Chief Technology Officer\" Never heard of this appointment before. Must be a new position Bush created when he doubled the size of the government.", 
        "intTime": 20090312, 
        "postID": 20, 
        "quote": "Originally posted by LineDoggie: Stupid Question What is a \"Chief Technology Officer\" Never heard of this appointment before.", 
        "reply": " Must be a new position Bush created when he doubled the size of the government.", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 14:50:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Ruh Roh! FBI raids office of D.C. CTO, Obama appointee 'http://www.politico.com/blogs/bensmith/0309/FBI_raids_office_of_DC_CTO_Obama_appointee.html Federal agents this morning are searching the office Washington, D.C.'s Chief Technology Officer. The search is part of \"an ongoing investigation,\" said a spokeswoman for the FBI's D.C. Field Office, Lindsay Gotwin, said. She declined to comment further on the raid of office, at 1 Judiciary Square. The outgoing Chief Technology Officer, Vivek Kundra, was appointed last week Chief Information Officer by the Obama administration. His last day at the city government office was February 4, a spokeswoman for D.C. Mayor Adrian Fenty, Leslie Kershaw, said. He was appointed to the Washington post in 2007. \"We know the FBI is over there but that's all we know,\" said a staffer in the D.C. CTO's office, Mario Field, who was working from a separate location. Another source familiar with the raid said the FBI had sent all staffers other than senior executives home for the day. WTOP Radio reported that agents are searching the 9th and 10th floors of the building. A White House spokesman had no immediate comment. <edit>", 
        "intTime": 20090312, 
        "postID": 21, 
        "quote": "", 
        "reply": "Ruh Roh! FBI raids office of D.C. CTO, Obama appointee 'http://www.politico.com/blogs/bensmith/0309/FBI_raids_office_of_DC_CTO_Obama_appointee.html Federal agents this morning are searching the office Washington, D.C.'s Chief Technology Officer. The search is part of \"an ongoing investigation,\" said a spokeswoman for the FBI's D.C. Field Office, Lindsay Gotwin, said. She declined to comment further on the raid of office, at 1 Judiciary Square. The outgoing Chief Technology Officer, Vivek Kundra, was appointed last week Chief Information Officer by the Obama administration. His last day at the city government office was February 4, a spokeswoman for D.C. Mayor Adrian Fenty, Leslie Kershaw, said. He was appointed to the Washington post in 2007. \"We know the FBI is over there but that's all we know,\" said a staffer in the D.C. CTO's office, Mario Field, who was working from a separate location. Another source familiar with the raid said the FBI had sent all staffers other than senior executives home for the day. WTOP Radio reported that agents are searching the 9th and 10th floors of the building. A White House spokesman had no immediate comment. <edit>", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 08:17:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "This should be good once they come out with what they are doing. This ain't about not paying taxes. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090312, 
        "postID": 22, 
        "quote": "", 
        "reply": "This should be good once they come out with what they are doing. This ain't about not paying taxes. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 08:23:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: This should be good once they come out with what they are doing. This ain't about not paying taxes. Did this guy have anything to do with online contributions during his campaign?", 
        "intTime": 20090312, 
        "postID": 23, 
        "quote": "Originally posted by Anbar7: This should be good once they come out with what they are doing. This ain't about not paying taxes.", 
        "reply": " Did this guy have anything to do with online contributions during his campaign?", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 08:25:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: A White House spokesman had no immediate comment. Gee, wonder why. Could it be because they don't have enough information? I would like to know what this is about, guess we will hav to wait until after the investigation is done. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090312, 
        "postID": 24, 
        "quote": "A White House spokesman had no immediate comment.", 
        "reply": " Gee, wonder why. Could it be because they don't have enough information? I would like to know what this is about, guess we will hav to wait until after the investigation is done. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 08:25:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: A White House spokesman had no immediate comment. Gee, wonder why. Could it be because they don't have enough information? I would like to know what this is about, guess we will hav to wait until after the investigation is done. No the media will dig into this for us.", 
        "intTime": 20090312, 
        "postID": 25, 
        "quote": "Originally posted by L0A1: quote: A White House spokesman had no immediate comment. Gee, wonder why. Could it be because they don't have enough information? I would like to know what this is about, guess we will hav to wait until after the investigation is done.", 
        "reply": " No the media will dig into this for us.", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 08:26:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by L0A1: quote: A White House spokesman had no immediate comment. Gee, wonder why. Could it be because they don't have enough information? I would like to know what this is about, guess we will hav to wait until after the investigation is done. No the media will dig into this for us. Not while President Obama is in office. This would be all over the place if it was Bush dontcha know. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090312, 
        "postID": 26, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by L0A1: quote: A White House spokesman had no immediate comment. Gee, wonder why. Could it be because they don't have enough information? I would like to know what this is about, guess we will hav to wait until after the investigation is done. No the media will dig into this for us.", 
        "reply": " Not while President Obama is in office. This would be all over the place if it was Bush dontcha know. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 08:28:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "L0A1"
    }, 
    {
        "content": "Maybe Obama should first appoint a worshipper to the chief FBI post. Then he could appoint anyone regardless. So far it looks like Obama appointees are not above the FBI. Almost makes one think that J Edgar Hoover is alive and well and doing his job.", 
        "intTime": 20090312, 
        "postID": 27, 
        "quote": "", 
        "reply": "Maybe Obama should first appoint a worshipper to the chief FBI post. Then he could appoint anyone regardless. So far it looks like Obama appointees are not above the FBI. Almost makes one think that J Edgar Hoover is alive and well and doing his job.", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 08:45:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "UPDATE: 2 arrested in FBI raid at Obama appointee's office WASHINGTON - Two officials in the D.C.'s Office of the Chief Technology Officer have been arrested in a federal bribery sting, sources tell WTOP. D.C. Office of the Chief Technology Officer employees Sushil Bansal and 40-year-old Yusuf Acar have been arrested, sources tell WTOP. Acar was taken into custody Thursday morning by FBI agents at his home in Northwest D.C. The FBI is now serving a search warrant at the office of D.C.'s Chief Technology Officer, WTOP has learned. \"We are there as part of a continuing ongoing criminal investigation,\" FBI Washington Field Office spokesperson Katherine Schweit tells WTOP. Schweit would not comment on the details of the investigation. More than a dozen FBI agents - including evidence technicians - at the office, located at 1 Judiciary Square on 4th Street in Northwest, WTOP's Mark Segraves reports. Most of the employees have been told to go home. Other employees have been segregated into a waiting room. Segraves reports the FBI's search has expanded from 9th floor offices to 10th floor offices. A spokesman for D.C.'s U.S. Attorney tells WTOP he cannot discuss the investigation, as it is currently sealed. On March 5, President Barack Obama named D.C. Chief Technology Officer Vivek Kundra as the federal government's chief information officer. Kundra's last day was March 4. Kundra, who was in charge of technology in the District since 2007, has been a consultant to Obama since he won the election. \"http://www.wtop.com/?nid=596&sid=1622618\" (Copyright 2009 by WTOP. All Rights Reserved.) \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090312, 
        "postID": 28, 
        "quote": "", 
        "reply": "UPDATE: 2 arrested in FBI raid at Obama appointee's office WASHINGTON - Two officials in the D.C.'s Office of the Chief Technology Officer have been arrested in a federal bribery sting, sources tell WTOP. D.C. Office of the Chief Technology Officer employees Sushil Bansal and 40-year-old Yusuf Acar have been arrested, sources tell WTOP. Acar was taken into custody Thursday morning by FBI agents at his home in Northwest D.C. The FBI is now serving a search warrant at the office of D.C.'s Chief Technology Officer, WTOP has learned. \"We are there as part of a continuing ongoing criminal investigation,\" FBI Washington Field Office spokesperson Katherine Schweit tells WTOP. Schweit would not comment on the details of the investigation. More than a dozen FBI agents - including evidence technicians - at the office, located at 1 Judiciary Square on 4th Street in Northwest, WTOP's Mark Segraves reports. Most of the employees have been told to go home. Other employees have been segregated into a waiting room. Segraves reports the FBI's search has expanded from 9th floor offices to 10th floor offices. A spokesman for D.C.'s U.S. Attorney tells WTOP he cannot discuss the investigation, as it is currently sealed. On March 5, President Barack Obama named D.C. Chief Technology Officer Vivek Kundra as the federal government's chief information officer. Kundra's last day was March 4. Kundra, who was in charge of technology in the District since 2007, has been a consultant to Obama since he won the election. \"http://www.wtop.com/?nid=596&sid=1622618\" (Copyright 2009 by WTOP. All Rights Reserved.) \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 08:49:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Nancy Pelosi's plan to \"drain the swamp\" in Washington to get rid of corrupt politicians and the culture of corruption seems to be working. Who'd of thought she would smartly use the lure of political appointments to the Obama Administration to catch these corrupt officials. Too bad they're all turning out to be democrats. Who knew...? \"The World's Finest\"", 
        "intTime": 20090312, 
        "postID": 29, 
        "quote": "", 
        "reply": "Nancy Pelosi's plan to \"drain the swamp\" in Washington to get rid of corrupt politicians and the culture of corruption seems to be working. Who'd of thought she would smartly use the lure of political appointments to the Obama Administration to catch these corrupt officials. Too bad they're all turning out to be democrats. Who knew...? \"The World's Finest\"", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 08:52:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Nancy Pelosi's plan to \"drain the swamp\" in Washington to get rid of corrupt politicians and the culture of corruption seems to be working. Who'd of thought she would smartly use the lure of political appointments to the Obama Administration to catch these corrupt officials. Too bad they're all turning out to be democrats. Who knew...? KARMA \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090312, 
        "postID": 30, 
        "quote": "Originally posted by Kegler300: Nancy Pelosi's plan to \"drain the swamp\" in Washington to get rid of corrupt politicians and the culture of corruption seems to be working. Who'd of thought she would smartly use the lure of political appointments to the Obama Administration to catch these corrupt officials. Too bad they're all turning out to be democrats. Who knew...?", 
        "reply": " KARMA \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 09:14:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Schweit would not comment on the details of the investigation. And neither will any Libs on this board.", 
        "intTime": 20090312, 
        "postID": 31, 
        "quote": "Schweit would not comment on the details of the investigation.", 
        "reply": " And neither will any Libs on this board.", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 10:31:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Schweit would not comment on the details of the investigation. And neither will any Libs on this board. they have nothing to say because they can't defend this one. either that or they will bring up something that the Bush administration did. Kind of like well he did it too. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090312, 
        "postID": 32, 
        "quote": "Originally posted by GunnyRet03: quote: Schweit would not comment on the details of the investigation. And neither will any Libs on this board.", 
        "reply": " they have nothing to say because they can't defend this one. either that or they will bring up something that the Bush administration did. Kind of like well he did it too. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 11:02:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Stupid Question What is a \"Chief Technology Officer\" Never heard of this appointment before.", 
        "intTime": 20090312, 
        "postID": 33, 
        "quote": "", 
        "reply": "Stupid Question What is a \"Chief Technology Officer\" Never heard of this appointment before.", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 11:34:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Stupid Question What is a \"Chief Technology Officer\" Never heard of this appointment before. Contrast with Chief Information Officer The focus of a CTO may be contrasted with that of a CIO in that, whereas a CIO is predisposed to solve problems by acquiring and adapting ready-made technologies, a CTO is predisposed to solve problems by developing new technologies. In practice, each will typically blend both approaches. In an enterprise whose primary technology concerns are addressable by ready-made technologies, a CIO might be the primary representative of technology issues at the executive level. In an enterprise whose primary technology concerns are addressed by developing (and perhaps productising) new technologies, or the general strategic exploitation of intellectual property held by the company, a CTO might be the primary representative of these concerns at the executive level. Genesis of the CTO role Though the position may be said to have emerged in the 1980s from that of Director of Research and Development, it came into significant use during the dot-com era of the 1990s. In such smaller, emerging companies, internally-focused, traditional CIO concerns such as office automation, regulatory compliance, data storage, security, enterprise networking, and workstation provisioning would fall initially within the aegis of the CTO. When the company- and its internal technology concerns- became larger and more complex, a CIO position might be created, reporting to either the Chief technology officer, Chief financial officer or Chief executive officer. In older industries (whose existence may pre-date IT automation) such as manufacturing, shipping or banking, the CIO role would arise out of the process of automating existing enterprises, and any CTO-like role would emerge as internal development efforts grew to significant complexity to be of executive-level concern, perhaps through intrapreneuring, often in imitation of dot-com-style innovations. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090312, 
        "postID": 34, 
        "quote": "Originally posted by LineDoggie: Stupid Question What is a \"Chief Technology Officer\" Never heard of this appointment before.", 
        "reply": " Contrast with Chief Information Officer The focus of a CTO may be contrasted with that of a CIO in that, whereas a CIO is predisposed to solve problems by acquiring and adapting ready-made technologies, a CTO is predisposed to solve problems by developing new technologies. In practice, each will typically blend both approaches. In an enterprise whose primary technology concerns are addressable by ready-made technologies, a CIO might be the primary representative of technology issues at the executive level. In an enterprise whose primary technology concerns are addressed by developing (and perhaps productising) new technologies, or the general strategic exploitation of intellectual property held by the company, a CTO might be the primary representative of these concerns at the executive level. Genesis of the CTO role Though the position may be said to have emerged in the 1980s from that of Director of Research and Development, it came into significant use during the dot-com era of the 1990s. In such smaller, emerging companies, internally-focused, traditional CIO concerns such as office automation, regulatory compliance, data storage, security, enterprise networking, and workstation provisioning would fall initially within the aegis of the CTO. When the company- and its internal technology concerns- became larger and more complex, a CIO position might be created, reporting to either the Chief technology officer, Chief financial officer or Chief executive officer. In older industries (whose existence may pre-date IT automation) such as manufacturing, shipping or banking, the CIO role would arise out of the process of automating existing enterprises, and any CTO-like role would emerge as internal development efforts grew to significant complexity to be of executive-level concern, perhaps through intrapreneuring, often in imitation of dot-com-style innovations. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 11:43:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "Anbar7"
    }, 
    {
        "content": "The White House can double as A work release facility!!", 
        "intTime": 20090312, 
        "postID": 35, 
        "quote": "", 
        "reply": "The White House can double as A work release facility!!", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 11:44:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "KSHAYMAN"
    }, 
    {
        "content": "Somebody needs to post a list of all of those connected to Obama or appointed by him who have not paid taxes, fell into corruption, tried to bribe people, bombed buildings, etc. I am starting to lose track.", 
        "intTime": 20090312, 
        "postID": 36, 
        "quote": "", 
        "reply": "Somebody needs to post a list of all of those connected to Obama or appointed by him who have not paid taxes, fell into corruption, tried to bribe people, bombed buildings, etc. I am starting to lose track.", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 12:06:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: Somebody needs to post a list of all of those connected to Obama or appointed by him who have not paid taxes, fell into corruption, tried to bribe people, bombed buildings, etc. I am starting to lose track. Not enough bandwidth here.", 
        "intTime": 20090312, 
        "postID": 37, 
        "quote": "Originally posted by 10tenths: Somebody needs to post a list of all of those connected to Obama or appointed by him who have not paid taxes, fell into corruption, tried to bribe people, bombed buildings, etc. I am starting to lose track.", 
        "reply": " Not enough bandwidth here.", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 12:41:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "Heard the \"tingle up the leg\" guy was going to do that. Should be done soon.", 
        "intTime": 20090312, 
        "postID": 38, 
        "quote": "", 
        "reply": "Heard the \"tingle up the leg\" guy was going to do that. Should be done soon.", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 12:45:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "ACR26"
    }, 
    {
        "content": "quote: Originally posted by ACR26: Heard the \"tingle up the leg\" guy was going to do that. Should be done soon. Are you talking about mime-boy?", 
        "intTime": 20090312, 
        "postID": 39, 
        "quote": "Originally posted by ACR26: Heard the \"tingle up the leg\" guy was going to do that. Should be done soon.", 
        "reply": " Are you talking about mime-boy?", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 12:47:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Stupid Question What is a \"Chief Technology Officer\" Never heard of this appointment before. Must be a new position Bush created when he doubled the size of the government.", 
        "intTime": 20090312, 
        "postID": 40, 
        "quote": "Originally posted by LineDoggie: Stupid Question What is a \"Chief Technology Officer\" Never heard of this appointment before.", 
        "reply": " Must be a new position Bush created when he doubled the size of the government.", 
        "threadID": "672198221_7840046712001", 
        "time": "2009-03-12 14:50:00", 
        "title": "FBI raids office of D.C. CTO, Obama appointee", 
        "userID": "crackerjacks61"
    }
]