[
    {
        "content": "\"www.lasvegasnow.com/global/story.asp?s=10176057\" quote: The Attorney General's Office is now investigating two state employees for taking home 77 gravestones from the Southern Nevada Veterans Cemetery. Those employees admitted they turned the stones into a patio. The investigation is now trying to decide if taking the stones is considered a crime. But now, Tami and Kevin Jenicke are taking the stones back where they belong. The view from above their house said it all last Wednesday. Seventy-seven gravestones, memorials of the heroes who gave so much, now turned into a patio. Tami Jenicke is a spokesperson for the state veterans home. Kevin Jenicke actually works at the cemetery. They took home stones meant for destruction. Normally spouses can be buried together and that requires replacing the current headstone. Those old headstones ended up in the Jenickes backyard. Now, with the plan exposed, the Jenickes had to pull the stones up. \"We have to step back and say, ‘How have we failed?'\" said Carole Turner with the Nevada Office of Veterans Services. Turner is the regional boss for the Veterans Department. She says the patio is a mistake that never should have happened. \"Our veterans deserve a respectful, peaceful final resting place,\" she said. Turner says the actions of the Jenicke's should not reflect on her entire agency and says this was an isolated case. \"This does not define who we are. We're much better than this,\" she said. Yet back at the cemetery, there's new proof the Jenicke's still have supporters. While returning a load of stones, Kevin Jenicke hid from Eyewitness News cameras at every opportunity, even driving away at one point with the tailgate still down. Later, from a different angle, Jenicke motions for a co-worker to move a state truck in an effort to block the camera's view, not once, but twice. Jenicke eventually finishes the drop off and heads out, knowing the investigation has expanded. Tuner's internal inquiry promises results, \"At the conclusion of our investigation, we will, as appropriate, take sanctions against the Jenicke's and whomever, quite frankly.\" The state has no policy on how the old stones should be destroyed, but the federal government does. The stones should be ground down and broken apart so they cannot be recognized -- the most honorable option available -- according to the government. While the agencies continue their investigations and possible sanctions, the Veterans Department is still finalizing state rules to keep this from happening again. so what are your thoughts on this? is this an outrage? is this just the media blowing things way out of proportion to get some buzz? do you agree with the comments people made to the news story saying things such as \"who cares they were getting rid of the headstones anyway it was just trash, get over it\"? This message has been edited. Last edited by: gypsysnipe, Wed 15 April 2009 06:15 AM", 
        "intTime": 20090415, 
        "postID": 1, 
        "quote": "The Attorney General's Office is now investigating two state employees for taking home 77 gravestones from the Southern Nevada Veterans Cemetery. Those employees admitted they turned the stones into a patio. The investigation is now trying to decide if taking the stones is considered a crime. But now, Tami and Kevin Jenicke are taking the stones back where they belong. The view from above their house said it all last Wednesday. Seventy-seven gravestones, memorials of the heroes who gave so much, now turned into a patio. Tami Jenicke is a spokesperson for the state veterans home. Kevin Jenicke actually works at the cemetery. They took home stones meant for destruction. Normally spouses can be buried together and that requires replacing the current headstone. Those old headstones ended up in the Jenickes backyard. Now, with the plan exposed, the Jenickes had to pull the stones up. \"We have to step back and say, ‘How have we failed?'\" said Carole Turner with the Nevada Office of Veterans Services. Turner is the regional boss for the Veterans Department. She says the patio is a mistake that never should have happened. \"Our veterans deserve a respectful, peaceful final resting place,\" she said. Turner says the actions of the Jenicke's should not reflect on her entire agency and says this was an isolated case. \"This does not define who we are. We're much better than this,\" she said. Yet back at the cemetery, there's new proof the Jenicke's still have supporters. While returning a load of stones, Kevin Jenicke hid from Eyewitness News cameras at every opportunity, even driving away at one point with the tailgate still down. Later, from a different angle, Jenicke motions for a co-worker to move a state truck in an effort to block the camera's view, not once, but twice. Jenicke eventually finishes the drop off and heads out, knowing the investigation has expanded. Tuner's internal inquiry promises results, \"At the conclusion of our investigation, we will, as appropriate, take sanctions against the Jenicke's and whomever, quite frankly.\" The state has no policy on how the old stones should be destroyed, but the federal government does. The stones should be ground down and broken apart so they cannot be recognized -- the most honorable option available -- according to the government. While the agencies continue their investigations and possible sanctions, the Veterans Department is still finalizing state rules to keep this from happening again.", 
        "reply": "\"www.lasvegasnow.com/global/story.asp?s=10176057\"  so what are your thoughts on this? is this an outrage? is this just the media blowing things way out of proportion to get some buzz? do you agree with the comments people made to the news story saying things such as \"who cares they were getting rid of the headstones anyway it was just trash, get over it\"? This message has been edited. Last edited by: gypsysnipe, Wed 15 April 2009 06:15 AM", 
        "threadID": "672198221_1020097022001", 
        "time": "2009-04-15 06:08:00", 
        "title": "couple build patio from headstones taken from the local veteran ccemetery", 
        "userID": "AndrewMcGee"
    }, 
    {
        "content": "quote: They took home stones meant for destruction. Normally spouses can be buried together and that requires replacing the current headstone. Those old headstones ended up in the Jenickes backyard. Now, with the plan exposed, the Jenickes had to pull the stones up. So this couple decided to reuse stone that was to be destroyed. I assume these markers were made from a good quality (expensive) stone and that the couple was smart enough to not display the writting side so the real question is which is the better use for stones that have been replaced: gravel to be used in a road or other type of fill or used in construction such as a patio?", 
        "intTime": 20090415, 
        "postID": 2, 
        "quote": "They took home stones meant for destruction. Normally spouses can be buried together and that requires replacing the current headstone. Those old headstones ended up in the Jenickes backyard. Now, with the plan exposed, the Jenickes had to pull the stones up.", 
        "reply": " So this couple decided to reuse stone that was to be destroyed. I assume these markers were made from a good quality (expensive) stone and that the couple was smart enough to not display the writting side so the real question is which is the better use for stones that have been replaced: gravel to be used in a road or other type of fill or used in construction such as a patio?", 
        "threadID": "672198221_1020097022001", 
        "time": "2009-04-15 06:29:00", 
        "title": "couple build patio from headstones taken from the local veteran ccemetery", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: They took home stones meant for destruction. Normally spouses can be buried together and that requires replacing the current headstone. Those old headstones ended up in the Jenickes backyard. Now, with the plan exposed, the Jenickes had to pull the stones up. So this couple decided to reuse stone that was to be destroyed. I assume these markers were made from a good quality (expensive) stone and that the couple was smart enough to not display the writting side so the real question is which is the better use for stones that have been replaced: gravel to be used in a road or other type of fill or used in construction such as a patio? exactly, i'm not sure how i feel about the situation myself. as it stands right now i'm thinking that i'd rather see them get put to good use than just be destroyed. then again, this hasn't happened to any of my family headstones so i can't really say how i'd feel if one of those stones were my family's.", 
        "intTime": 20090415, 
        "postID": 3, 
        "quote": "Originally posted by rayld2: quote: They took home stones meant for destruction. Normally spouses can be buried together and that requires replacing the current headstone. Those old headstones ended up in the Jenickes backyard. Now, with the plan exposed, the Jenickes had to pull the stones up. So this couple decided to reuse stone that was to be destroyed. I assume these markers were made from a good quality (expensive) stone and that the couple was smart enough to not display the writting side so the real question is which is the better use for stones that have been replaced: gravel to be used in a road or other type of fill or used in construction such as a patio?", 
        "reply": " exactly, i'm not sure how i feel about the situation myself. as it stands right now i'm thinking that i'd rather see them get put to good use than just be destroyed. then again, this hasn't happened to any of my family headstones so i can't really say how i'd feel if one of those stones were my family's.", 
        "threadID": "672198221_1020097022001", 
        "time": "2009-04-15 06:50:00", 
        "title": "couple build patio from headstones taken from the local veteran ccemetery", 
        "userID": "AndrewMcGee"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: They took home stones meant for destruction. Normally spouses can be buried together and that requires replacing the current headstone. Those old headstones ended up in the Jenickes backyard. Now, with the plan exposed, the Jenickes had to pull the stones up. So this couple decided to reuse stone that was to be destroyed. I assume these markers were made from a good quality (expensive) stone and that the couple was smart enough to not display the writting side so the real question is which is the better use for stones that have been replaced: gravel to be used in a road or other type of fill or used in construction such as a patio? How about we let treasury workers take home cash that's meant to be destroyed? It's government property, even if it is turned into gravel and used to line walking paths in the cemetery. What they did is theft by taking. As far as respect goes, we honorably retire (destroy) American flags that have reached the end of their service life. We don't turn them into dishrags, although that would be more \"useful\". I guess the next step in your book is to take your deceased family members and turn them into dog food or fertilizer, since that would be more \"useful\" than an honorable burial.", 
        "intTime": 20090415, 
        "postID": 4, 
        "quote": "Originally posted by rayld2: quote: They took home stones meant for destruction. Normally spouses can be buried together and that requires replacing the current headstone. Those old headstones ended up in the Jenickes backyard. Now, with the plan exposed, the Jenickes had to pull the stones up. So this couple decided to reuse stone that was to be destroyed. I assume these markers were made from a good quality (expensive) stone and that the couple was smart enough to not display the writting side so the real question is which is the better use for stones that have been replaced: gravel to be used in a road or other type of fill or used in construction such as a patio?", 
        "reply": " How about we let treasury workers take home cash that's meant to be destroyed? It's government property, even if it is turned into gravel and used to line walking paths in the cemetery. What they did is theft by taking. As far as respect goes, we honorably retire (destroy) American flags that have reached the end of their service life. We don't turn them into dishrags, although that would be more \"useful\". I guess the next step in your book is to take your deceased family members and turn them into dog food or fertilizer, since that would be more \"useful\" than an honorable burial.", 
        "threadID": "672198221_1020097022001", 
        "time": "2009-04-15 07:03:00", 
        "title": "couple build patio from headstones taken from the local veteran ccemetery", 
        "userID": "jwr6"
    }, 
    {
        "content": "I think this should be left up to the States DA office. I know here in NC they would spend sometime in Jail. Southern Baptist down here frown on that type of thing.", 
        "intTime": 20090415, 
        "postID": 5, 
        "quote": "", 
        "reply": "I think this should be left up to the States DA office. I know here in NC they would spend sometime in Jail. Southern Baptist down here frown on that type of thing.", 
        "threadID": "672198221_1020097022001", 
        "time": "2009-04-15 07:06:00", 
        "title": "couple build patio from headstones taken from the local veteran ccemetery", 
        "userID": "Duster6"
    }, 
    {
        "content": "very good points jwr6", 
        "intTime": 20090415, 
        "postID": 6, 
        "quote": "", 
        "reply": "very good points jwr6", 
        "threadID": "672198221_1020097022001", 
        "time": "2009-04-15 07:22:00", 
        "title": "couple build patio from headstones taken from the local veteran ccemetery", 
        "userID": "AndrewMcGee"
    }
]