[
    {
        "content": "Buch invaded Iraq \"without\" cause, and did give the Iran the singnal you are next, how do you think they react? Yes they starting to oppose US. But now they want to start taking to Obama.... Do you realy want to start a pipline war? What will hapend if Iran blow the Alaska pipline in retalition? Or worse they do nothing but tell the US oil consumer who is to blame for the latest oil crisis....", 
        "intTime": 20090301, 
        "postID": 5, 
        "quote": "", 
        "reply": "Buch invaded Iraq \"without\" cause, and did give the Iran the singnal you are next, how do you think they react? Yes they starting to oppose US. But now they want to start taking to Obama.... Do you realy want to start a pipline war? What will hapend if Iran blow the Alaska pipline in retalition? Or worse they do nothing but tell the US oil consumer who is to blame for the latest oil crisis....", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 01:03:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "a77"
    }, 
    {
        "content": "quote: Originally posted by a77: Buch invaded Iraq \"without\" cause, and did give the Iran the singnal you are next, how do you think they react? Yes they starting to oppose US. But now they want to start taking to Obama.... Do you realy want to start a pipline war? What will hapend if Iran blow the Alaska pipline in retalition? Or worse they do nothing but tell the US oil consumer who is to blame for the latest oil crisis.... Iran would never have the balls to attack our pipe line in Alaska. They been opposing us since the 70's. until Iran stops killing united states and allies soldiers. they better believe we will in directly blow there life line up. If it means less money so they can support groups that harm us. ether way any kind of war Iran wages against us is going to only make there end come faster.", 
        "intTime": 20090301, 
        "postID": 6, 
        "quote": "Originally posted by a77: Buch invaded Iraq \"without\" cause, and did give the Iran the singnal you are next, how do you think they react? Yes they starting to oppose US. But now they want to start taking to Obama.... Do you realy want to start a pipline war? What will hapend if Iran blow the Alaska pipline in retalition? Or worse they do nothing but tell the US oil consumer who is to blame for the latest oil crisis....", 
        "reply": " Iran would never have the balls to attack our pipe line in Alaska. They been opposing us since the 70's. until Iran stops killing united states and allies soldiers. they better believe we will in directly blow there life line up. If it means less money so they can support groups that harm us. ether way any kind of war Iran wages against us is going to only make there end come faster.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 01:21:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by world_king377: Thats problem with President Mahmoud Ahmadinejad. he to busy trying to fight a proxy war with the united states. his country is destroying it self from the inside. he failing as a leader and he turning in to a radical idiot. its time we get rid of him and his goons by letting the CIA blow up his oil pipe lines. 90% of Iran income is from oil. it will be enough to throw him out of the election in shame.teach him a lesson don't fight a proxy war against the masters of proxy wars. Any overt action against Iran is likely to have the opposite of the desired effect by feeding their latent nationalism and bringing the people together. Sometimes things just hav. to be left to fall apart on their own. The legacy of Bush's dealings with Iran is that pushing it too hard only strengthens the Ayatollahs who can play on the people's fears whereas engaging Iran weakens the conservatives because it damages the impression they try to put out of the Great Satan just waiting to come and eat their children.", 
        "intTime": 20090301, 
        "postID": 7, 
        "quote": "Originally posted by world_king377: Thats problem with President Mahmoud Ahmadinejad. he to busy trying to fight a proxy war with the united states. his country is destroying it self from the inside. he failing as a leader and he turning in to a radical idiot. its time we get rid of him and his goons by letting the CIA blow up his oil pipe lines. 90% of Iran income is from oil. it will be enough to throw him out of the election in shame.teach him a lesson don't fight a proxy war against the masters of proxy wars.", 
        "reply": " Any overt action against Iran is likely to have the opposite of the desired effect by feeding their latent nationalism and bringing the people together. Sometimes things just hav. to be left to fall apart on their own. The legacy of Bush's dealings with Iran is that pushing it too hard only strengthens the Ayatollahs who can play on the people's fears whereas engaging Iran weakens the conservatives because it damages the impression they try to put out of the Great Satan just waiting to come and eat their children.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 02:53:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "I'm sure Israel is getting ready to do something. And they don't care about the civilians.", 
        "intTime": 20090301, 
        "postID": 8, 
        "quote": "", 
        "reply": "I'm sure Israel is getting ready to do something. And they don't care about the civilians.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 07:45:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "Grimbo"
    }, 
    {
        "content": "well what more proof do you all need???", 
        "intTime": 20090301, 
        "postID": 9, 
        "quote": "", 
        "reply": "well what more proof do you all need???", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 08:06:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "outlaws93"
    }, 
    {
        "content": "\"http://www.theaustralian.news.com.au/story/0,25197,25123569-2703,00.html\" Another version with a little more detail. This should stop those that continually tell us how Iran has been cooperative in Afghanistan. In reality, the aid to the Taliban is the same as giving aid to the Al Qaeda, both are 180 degrees different in their religious thinking from Tehran, but has the same hatred for anything different from their sharia law. Doubt that much more will happen in Iran flexing their muscles until the election is over. As long as the Council of Guardians and the Supreme Leader is hanging around the political free election is just another farce.", 
        "intTime": 20090301, 
        "postID": 10, 
        "quote": "", 
        "reply": "\"http://www.theaustralian.news.com.au/story/0,25197,25123569-2703,00.html\" Another version with a little more detail. This should stop those that continually tell us how Iran has been cooperative in Afghanistan. In reality, the aid to the Taliban is the same as giving aid to the Al Qaeda, both are 180 degrees different in their religious thinking from Tehran, but has the same hatred for anything different from their sharia law. Doubt that much more will happen in Iran flexing their muscles until the election is over. As long as the Council of Guardians and the Supreme Leader is hanging around the political free election is just another farce.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 08:17:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: \"http://www.theaustralian.news.com.au/story/0,25197,25123569-2703,00.html\" Another version with a little more detail. This should stop those that continually tell us how Iran has been cooperative in Afghanistan. In reality, the aid to the Taliban is the same as giving aid to the Al Qaeda, both are 180 degrees different in their religious thinking from Tehran, but has the same hatred for anything different from their sharia law. Doubt that much more will happen in Iran flexing their muscles until the election is over. As long as the Council of Guardians and the Supreme Leader is hanging around the political free election is just another farce. actually they are the same... they are islamofascism they only have little differences like our different demonations in Christianity do... but they will and have fought together against a common enemy....", 
        "intTime": 20090301, 
        "postID": 11, 
        "quote": "Originally posted by rayevinsonsr: \"http://www.theaustralian.news.com.au/story/0,25197,25123569-2703,00.html\" Another version with a little more detail. This should stop those that continually tell us how Iran has been cooperative in Afghanistan. In reality, the aid to the Taliban is the same as giving aid to the Al Qaeda, both are 180 degrees different in their religious thinking from Tehran, but has the same hatred for anything different from their sharia law. Doubt that much more will happen in Iran flexing their muscles until the election is over. As long as the Council of Guardians and the Supreme Leader is hanging around the political free election is just another farce.", 
        "reply": " actually they are the same... they are islamofascism they only have little differences like our different demonations in Christianity do... but they will and have fought together against a common enemy....", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 08:48:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: Well I thought that we weren't supposed to quote the whole article per the new rules, so I left that part out. I usually cut more than just one sentence to emphasize certain points. I didn't accuse you of \"anything.\" I am pointing out that the article is based on unnamed, and therefore uncheckable sources whereas the final sentence is from an official source who CAN be checked. Iran has always been the enemy of Al Qaeda and the Taliban. They have over the last few years arrested over 400 members of Al Qaeda. If you pay attention to the news, all those Shi'te Mosques in both Iraq AND Iran are blown up by Al Qaeda. Dave", 
        "intTime": 20090301, 
        "postID": 12, 
        "quote": "Originally posted by Canuck_Centaur: Well I thought that we weren't supposed to quote the whole article per the new rules, so I left that part out. I usually cut more than just one sentence to emphasize certain points.", 
        "reply": " I didn't accuse you of \"anything.\" I am pointing out that the article is based on unnamed, and therefore uncheckable sources whereas the final sentence is from an official source who CAN be checked. Iran has always been the enemy of Al Qaeda and the Taliban. They have over the last few years arrested over 400 members of Al Qaeda. If you pay attention to the news, all those Shi'te Mosques in both Iraq AND Iran are blown up by Al Qaeda. Dave", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 09:07:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "Grachus"
    }, 
    {
        "content": "BUMP.", 
        "intTime": 20090301, 
        "postID": 13, 
        "quote": "", 
        "reply": "BUMP.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 13:22:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Iran has always been the enemy of Al Qaeda and the Taliban. not entirely true... they do and have fought together against a common enemy... mainly us and Israel...", 
        "intTime": 20090301, 
        "postID": 14, 
        "quote": "Iran has always been the enemy of Al Qaeda and the Taliban.", 
        "reply": " not entirely true... they do and have fought together against a common enemy... mainly us and Israel...", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 13:28:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "outlaws93"
    }, 
    {
        "content": "yawn, I spoke of this before Christmas. The Kurds in Iraq have them as well.", 
        "intTime": 20090301, 
        "postID": 15, 
        "quote": "", 
        "reply": "yawn, I spoke of this before Christmas. The Kurds in Iraq have them as well.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 13:28:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: yawn, I spoke of this before Christmas. The Kurds in Iraq have them as well. The Kurds have good reason to have them though, especially if they are older stockpiles. The threat from Saddam's Hinds before 2003 was very real, and now they have to worry about attacks from the Turks.", 
        "intTime": 20090301, 
        "postID": 16, 
        "quote": "Originally posted by FlankerFlyer: yawn, I spoke of this before Christmas. The Kurds in Iraq have them as well.", 
        "reply": " The Kurds have good reason to have them though, especially if they are older stockpiles. The threat from Saddam's Hinds before 2003 was very real, and now they have to worry about attacks from the Turks.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 13:46:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: and now they have to worry about attacks from the Turks. The Kurds will need them now more than ever. When the US troops leave the Kurds will be attacked by both Turkey and the radicals that will take control in Iraq soon after US troops depart. The Kurds should be allowed to stockpile weapons for future use against those that wish their destruction.", 
        "intTime": 20090301, 
        "postID": 17, 
        "quote": "and now they have to worry about attacks from the Turks.", 
        "reply": " The Kurds will need them now more than ever. When the US troops leave the Kurds will be attacked by both Turkey and the radicals that will take control in Iraq soon after US troops depart. The Kurds should be allowed to stockpile weapons for future use against those that wish their destruction.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 14:27:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: and now they have to worry about attacks from the Turks. The Kurds will need them now more than ever. When the US troops leave the Kurds will be attacked by both Turkey and the radicals that will take control in Iraq soon after US troops depart. The Kurds should be allowed to stockpile weapons for future use against those that wish their destruction. Fortunatly for the Kurds, the Peshmerga are well equipped and well trained. The Kurdish region in Iraq has a strong established economy, and is nothing like the areas south of Mosul and Kirkuk. It is estimated the Peshmerga may be 400,000 strong, and any turn by the Iraqi government on the Kurds would result in a major loss to the Iraqi Army since much of the 3 northern IA divisions (2nd, 3rd, and 4th IA) are Kurdish soldiers. I was impressed with many Iraqi Army units, but none more so than the Iraqi Army units largely made up of Kurds. The Peshmerga also captured and are equipped with hundreds, perhaps thousands of Saddam's armored vehicles. The Kurds also have the benefit of terrain.", 
        "intTime": 20090301, 
        "postID": 18, 
        "quote": "Originally posted by FlankerFlyer: quote: and now they have to worry about attacks from the Turks. The Kurds will need them now more than ever. When the US troops leave the Kurds will be attacked by both Turkey and the radicals that will take control in Iraq soon after US troops depart. The Kurds should be allowed to stockpile weapons for future use against those that wish their destruction.", 
        "reply": " Fortunatly for the Kurds, the Peshmerga are well equipped and well trained. The Kurdish region in Iraq has a strong established economy, and is nothing like the areas south of Mosul and Kirkuk. It is estimated the Peshmerga may be 400,000 strong, and any turn by the Iraqi government on the Kurds would result in a major loss to the Iraqi Army since much of the 3 northern IA divisions (2nd, 3rd, and 4th IA) are Kurdish soldiers. I was impressed with many Iraqi Army units, but none more so than the Iraqi Army units largely made up of Kurds. The Peshmerga also captured and are equipped with hundreds, perhaps thousands of Saddam's armored vehicles. The Kurds also have the benefit of terrain.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 14:56:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by world_king377: Thats problem with President Mahmoud Ahmadinejad. he to busy trying to fight a proxy war with the united states. his country is destroying it self from the inside. he failing as a leader and he turning in to a radical idiot. its time we get rid of him and his goons by letting the CIA blow up his oil pipe lines. 90% of Iran income is from oil. it will be enough to throw him out of the election in shame.teach him a lesson don't fight a proxy war against the masters of proxy wars. Good post. You are pretty much 100% correct. It's not that he's involved directly with it, it's just that he's not doing anything to stop it.", 
        "intTime": 20090302, 
        "postID": 19, 
        "quote": "Originally posted by world_king377: Thats problem with President Mahmoud Ahmadinejad. he to busy trying to fight a proxy war with the united states. his country is destroying it self from the inside. he failing as a leader and he turning in to a radical idiot. its time we get rid of him and his goons by letting the CIA blow up his oil pipe lines. 90% of Iran income is from oil. it will be enough to throw him out of the election in shame.teach him a lesson don't fight a proxy war against the masters of proxy wars.", 
        "reply": " Good post. You are pretty much 100% correct. It's not that he's involved directly with it, it's just that he's not doing anything to stop it.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-02 04:53:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Iran has always been the enemy of Al Qaeda and the Taliban. not entirely true... they do and have fought together against a common enemy... mainly us and Israel... Iran = Shia. Al Queda = Sunni. They don't work together. That's okay. McCain didn't know, either.", 
        "intTime": 20090302, 
        "postID": 20, 
        "quote": "Originally posted by outlaws93: quote: Iran has always been the enemy of Al Qaeda and the Taliban. not entirely true... they do and have fought together against a common enemy... mainly us and Israel...", 
        "reply": " Iran = Shia. Al Queda = Sunni. They don't work together. That's okay. McCain didn't know, either.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-02 04:56:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Buch invaded Iraq \"without\" cause, and did give the Iran the singnal you are next, how do you think they react? Yes they starting to oppose US. But now they want to start taking to Obama.... Do you realy want to start a pipline war? What will hapend if Iran blow the Alaska pipline in retalition? Or worse they do nothing but tell the US oil consumer who is to blame for the latest oil crisis....", 
        "intTime": 20090301, 
        "postID": 25, 
        "quote": "", 
        "reply": "Buch invaded Iraq \"without\" cause, and did give the Iran the singnal you are next, how do you think they react? Yes they starting to oppose US. But now they want to start taking to Obama.... Do you realy want to start a pipline war? What will hapend if Iran blow the Alaska pipline in retalition? Or worse they do nothing but tell the US oil consumer who is to blame for the latest oil crisis....", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 01:03:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "a77"
    }, 
    {
        "content": "quote: Originally posted by a77: Buch invaded Iraq \"without\" cause, and did give the Iran the singnal you are next, how do you think they react? Yes they starting to oppose US. But now they want to start taking to Obama.... Do you realy want to start a pipline war? What will hapend if Iran blow the Alaska pipline in retalition? Or worse they do nothing but tell the US oil consumer who is to blame for the latest oil crisis.... Iran would never have the balls to attack our pipe line in Alaska. They been opposing us since the 70's. until Iran stops killing united states and allies soldiers. they better believe we will in directly blow there life line up. If it means less money so they can support groups that harm us. ether way any kind of war Iran wages against us is going to only make there end come faster.", 
        "intTime": 20090301, 
        "postID": 26, 
        "quote": "Originally posted by a77: Buch invaded Iraq \"without\" cause, and did give the Iran the singnal you are next, how do you think they react? Yes they starting to oppose US. But now they want to start taking to Obama.... Do you realy want to start a pipline war? What will hapend if Iran blow the Alaska pipline in retalition? Or worse they do nothing but tell the US oil consumer who is to blame for the latest oil crisis....", 
        "reply": " Iran would never have the balls to attack our pipe line in Alaska. They been opposing us since the 70's. until Iran stops killing united states and allies soldiers. they better believe we will in directly blow there life line up. If it means less money so they can support groups that harm us. ether way any kind of war Iran wages against us is going to only make there end come faster.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 01:21:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by world_king377: Thats problem with President Mahmoud Ahmadinejad. he to busy trying to fight a proxy war with the united states. his country is destroying it self from the inside. he failing as a leader and he turning in to a radical idiot. its time we get rid of him and his goons by letting the CIA blow up his oil pipe lines. 90% of Iran income is from oil. it will be enough to throw him out of the election in shame.teach him a lesson don't fight a proxy war against the masters of proxy wars. Any overt action against Iran is likely to have the opposite of the desired effect by feeding their latent nationalism and bringing the people together. Sometimes things just hav. to be left to fall apart on their own. The legacy of Bush's dealings with Iran is that pushing it too hard only strengthens the Ayatollahs who can play on the people's fears whereas engaging Iran weakens the conservatives because it damages the impression they try to put out of the Great Satan just waiting to come and eat their children.", 
        "intTime": 20090301, 
        "postID": 27, 
        "quote": "Originally posted by world_king377: Thats problem with President Mahmoud Ahmadinejad. he to busy trying to fight a proxy war with the united states. his country is destroying it self from the inside. he failing as a leader and he turning in to a radical idiot. its time we get rid of him and his goons by letting the CIA blow up his oil pipe lines. 90% of Iran income is from oil. it will be enough to throw him out of the election in shame.teach him a lesson don't fight a proxy war against the masters of proxy wars.", 
        "reply": " Any overt action against Iran is likely to have the opposite of the desired effect by feeding their latent nationalism and bringing the people together. Sometimes things just hav. to be left to fall apart on their own. The legacy of Bush's dealings with Iran is that pushing it too hard only strengthens the Ayatollahs who can play on the people's fears whereas engaging Iran weakens the conservatives because it damages the impression they try to put out of the Great Satan just waiting to come and eat their children.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 02:53:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "I'm sure Israel is getting ready to do something. And they don't care about the civilians.", 
        "intTime": 20090301, 
        "postID": 28, 
        "quote": "", 
        "reply": "I'm sure Israel is getting ready to do something. And they don't care about the civilians.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 07:45:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "Grimbo"
    }, 
    {
        "content": "well what more proof do you all need???", 
        "intTime": 20090301, 
        "postID": 29, 
        "quote": "", 
        "reply": "well what more proof do you all need???", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 08:06:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "outlaws93"
    }, 
    {
        "content": "\"http://www.theaustralian.news.com.au/story/0,25197,25123569-2703,00.html\" Another version with a little more detail. This should stop those that continually tell us how Iran has been cooperative in Afghanistan. In reality, the aid to the Taliban is the same as giving aid to the Al Qaeda, both are 180 degrees different in their religious thinking from Tehran, but has the same hatred for anything different from their sharia law. Doubt that much more will happen in Iran flexing their muscles until the election is over. As long as the Council of Guardians and the Supreme Leader is hanging around the political free election is just another farce.", 
        "intTime": 20090301, 
        "postID": 30, 
        "quote": "", 
        "reply": "\"http://www.theaustralian.news.com.au/story/0,25197,25123569-2703,00.html\" Another version with a little more detail. This should stop those that continually tell us how Iran has been cooperative in Afghanistan. In reality, the aid to the Taliban is the same as giving aid to the Al Qaeda, both are 180 degrees different in their religious thinking from Tehran, but has the same hatred for anything different from their sharia law. Doubt that much more will happen in Iran flexing their muscles until the election is over. As long as the Council of Guardians and the Supreme Leader is hanging around the political free election is just another farce.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 08:17:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: \"http://www.theaustralian.news.com.au/story/0,25197,25123569-2703,00.html\" Another version with a little more detail. This should stop those that continually tell us how Iran has been cooperative in Afghanistan. In reality, the aid to the Taliban is the same as giving aid to the Al Qaeda, both are 180 degrees different in their religious thinking from Tehran, but has the same hatred for anything different from their sharia law. Doubt that much more will happen in Iran flexing their muscles until the election is over. As long as the Council of Guardians and the Supreme Leader is hanging around the political free election is just another farce. actually they are the same... they are islamofascism they only have little differences like our different demonations in Christianity do... but they will and have fought together against a common enemy....", 
        "intTime": 20090301, 
        "postID": 31, 
        "quote": "Originally posted by rayevinsonsr: \"http://www.theaustralian.news.com.au/story/0,25197,25123569-2703,00.html\" Another version with a little more detail. This should stop those that continually tell us how Iran has been cooperative in Afghanistan. In reality, the aid to the Taliban is the same as giving aid to the Al Qaeda, both are 180 degrees different in their religious thinking from Tehran, but has the same hatred for anything different from their sharia law. Doubt that much more will happen in Iran flexing their muscles until the election is over. As long as the Council of Guardians and the Supreme Leader is hanging around the political free election is just another farce.", 
        "reply": " actually they are the same... they are islamofascism they only have little differences like our different demonations in Christianity do... but they will and have fought together against a common enemy....", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 08:48:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: Well I thought that we weren't supposed to quote the whole article per the new rules, so I left that part out. I usually cut more than just one sentence to emphasize certain points. I didn't accuse you of \"anything.\" I am pointing out that the article is based on unnamed, and therefore uncheckable sources whereas the final sentence is from an official source who CAN be checked. Iran has always been the enemy of Al Qaeda and the Taliban. They have over the last few years arrested over 400 members of Al Qaeda. If you pay attention to the news, all those Shi'te Mosques in both Iraq AND Iran are blown up by Al Qaeda. Dave", 
        "intTime": 20090301, 
        "postID": 32, 
        "quote": "Originally posted by Canuck_Centaur: Well I thought that we weren't supposed to quote the whole article per the new rules, so I left that part out. I usually cut more than just one sentence to emphasize certain points.", 
        "reply": " I didn't accuse you of \"anything.\" I am pointing out that the article is based on unnamed, and therefore uncheckable sources whereas the final sentence is from an official source who CAN be checked. Iran has always been the enemy of Al Qaeda and the Taliban. They have over the last few years arrested over 400 members of Al Qaeda. If you pay attention to the news, all those Shi'te Mosques in both Iraq AND Iran are blown up by Al Qaeda. Dave", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 09:07:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "Grachus"
    }, 
    {
        "content": "BUMP.", 
        "intTime": 20090301, 
        "postID": 33, 
        "quote": "", 
        "reply": "BUMP.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 13:22:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Iran has always been the enemy of Al Qaeda and the Taliban. not entirely true... they do and have fought together against a common enemy... mainly us and Israel...", 
        "intTime": 20090301, 
        "postID": 34, 
        "quote": "Iran has always been the enemy of Al Qaeda and the Taliban.", 
        "reply": " not entirely true... they do and have fought together against a common enemy... mainly us and Israel...", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 13:28:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "outlaws93"
    }, 
    {
        "content": "yawn, I spoke of this before Christmas. The Kurds in Iraq have them as well.", 
        "intTime": 20090301, 
        "postID": 35, 
        "quote": "", 
        "reply": "yawn, I spoke of this before Christmas. The Kurds in Iraq have them as well.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 13:28:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: yawn, I spoke of this before Christmas. The Kurds in Iraq have them as well. The Kurds have good reason to have them though, especially if they are older stockpiles. The threat from Saddam's Hinds before 2003 was very real, and now they have to worry about attacks from the Turks.", 
        "intTime": 20090301, 
        "postID": 36, 
        "quote": "Originally posted by FlankerFlyer: yawn, I spoke of this before Christmas. The Kurds in Iraq have them as well.", 
        "reply": " The Kurds have good reason to have them though, especially if they are older stockpiles. The threat from Saddam's Hinds before 2003 was very real, and now they have to worry about attacks from the Turks.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 13:46:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: and now they have to worry about attacks from the Turks. The Kurds will need them now more than ever. When the US troops leave the Kurds will be attacked by both Turkey and the radicals that will take control in Iraq soon after US troops depart. The Kurds should be allowed to stockpile weapons for future use against those that wish their destruction.", 
        "intTime": 20090301, 
        "postID": 37, 
        "quote": "and now they have to worry about attacks from the Turks.", 
        "reply": " The Kurds will need them now more than ever. When the US troops leave the Kurds will be attacked by both Turkey and the radicals that will take control in Iraq soon after US troops depart. The Kurds should be allowed to stockpile weapons for future use against those that wish their destruction.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 14:27:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: and now they have to worry about attacks from the Turks. The Kurds will need them now more than ever. When the US troops leave the Kurds will be attacked by both Turkey and the radicals that will take control in Iraq soon after US troops depart. The Kurds should be allowed to stockpile weapons for future use against those that wish their destruction. Fortunatly for the Kurds, the Peshmerga are well equipped and well trained. The Kurdish region in Iraq has a strong established economy, and is nothing like the areas south of Mosul and Kirkuk. It is estimated the Peshmerga may be 400,000 strong, and any turn by the Iraqi government on the Kurds would result in a major loss to the Iraqi Army since much of the 3 northern IA divisions (2nd, 3rd, and 4th IA) are Kurdish soldiers. I was impressed with many Iraqi Army units, but none more so than the Iraqi Army units largely made up of Kurds. The Peshmerga also captured and are equipped with hundreds, perhaps thousands of Saddam's armored vehicles. The Kurds also have the benefit of terrain.", 
        "intTime": 20090301, 
        "postID": 38, 
        "quote": "Originally posted by FlankerFlyer: quote: and now they have to worry about attacks from the Turks. The Kurds will need them now more than ever. When the US troops leave the Kurds will be attacked by both Turkey and the radicals that will take control in Iraq soon after US troops depart. The Kurds should be allowed to stockpile weapons for future use against those that wish their destruction.", 
        "reply": " Fortunatly for the Kurds, the Peshmerga are well equipped and well trained. The Kurdish region in Iraq has a strong established economy, and is nothing like the areas south of Mosul and Kirkuk. It is estimated the Peshmerga may be 400,000 strong, and any turn by the Iraqi government on the Kurds would result in a major loss to the Iraqi Army since much of the 3 northern IA divisions (2nd, 3rd, and 4th IA) are Kurdish soldiers. I was impressed with many Iraqi Army units, but none more so than the Iraqi Army units largely made up of Kurds. The Peshmerga also captured and are equipped with hundreds, perhaps thousands of Saddam's armored vehicles. The Kurds also have the benefit of terrain.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-01 14:56:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by world_king377: Thats problem with President Mahmoud Ahmadinejad. he to busy trying to fight a proxy war with the united states. his country is destroying it self from the inside. he failing as a leader and he turning in to a radical idiot. its time we get rid of him and his goons by letting the CIA blow up his oil pipe lines. 90% of Iran income is from oil. it will be enough to throw him out of the election in shame.teach him a lesson don't fight a proxy war against the masters of proxy wars. Good post. You are pretty much 100% correct. It's not that he's involved directly with it, it's just that he's not doing anything to stop it.", 
        "intTime": 20090302, 
        "postID": 39, 
        "quote": "Originally posted by world_king377: Thats problem with President Mahmoud Ahmadinejad. he to busy trying to fight a proxy war with the united states. his country is destroying it self from the inside. he failing as a leader and he turning in to a radical idiot. its time we get rid of him and his goons by letting the CIA blow up his oil pipe lines. 90% of Iran income is from oil. it will be enough to throw him out of the election in shame.teach him a lesson don't fight a proxy war against the masters of proxy wars.", 
        "reply": " Good post. You are pretty much 100% correct. It's not that he's involved directly with it, it's just that he's not doing anything to stop it.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-02 04:53:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Iran has always been the enemy of Al Qaeda and the Taliban. not entirely true... they do and have fought together against a common enemy... mainly us and Israel... Iran = Shia. Al Queda = Sunni. They don't work together. That's okay. McCain didn't know, either.", 
        "intTime": 20090302, 
        "postID": 40, 
        "quote": "Originally posted by outlaws93: quote: Iran has always been the enemy of Al Qaeda and the Taliban. not entirely true... they do and have fought together against a common enemy... mainly us and Israel...", 
        "reply": " Iran = Shia. Al Queda = Sunni. They don't work together. That's okay. McCain didn't know, either.", 
        "threadID": "672198221_6950035612001", 
        "time": "2009-03-02 04:56:00", 
        "title": "Iran supplying MANPADS to Taliban", 
        "userID": "mrmixitup"
    }
]