[
    {
        "content": "quote: The man spoke plainly as he explained the horrors he lived through in a Kosovo Liberation Army prison camp 10 years ago. He told me about how he watched people beaten with steel pipes, cut with knives, left for days without food, and shot and killed. \"What can you feel when you see those things?\" he said. \"It's something that is stuck in my mind for the rest of my life. You cannot do those things to people, not even to animals.\" As the man talked, his mother paced nervously in the nearby kitchen. She was panicked and tears were streaming down her face. \"They'll kill him, they'll kill him,\" she moaned, clutching one of her grandchildren. But her son persisted. We spent hours in the family's sitting room as our source detailed allegations of possible war crimes by KLA officers in a military camp in the Albanian border town of Kukes. It was a crucial interview for a delicate story I have been investigating for years. Mystery of the missing I had met sources who spoke vaguely about secret camps in Albania where Kosovo Serbs, Albanians and Roma were interrogated, tortured and in most cases killed. I met another source who agreed to share important details about KLA prison camps. This man cut a very different profile. He had returned from a successful career abroad to join the KLA in its fight for Kosovo's independence from Serbia. The man was still proud of the goals he fought for, but he had become haunted by the treatment of civilians he had seen at a KLA prison camp. More than that, he said he felt angry and betrayed by KLA commanders who tolerated and even ordered the abuses. \"It didn't seem strange at the time,\" he told me as he described seeing desperate civilians locked in a filthy agricultural shed. He said the civilians were Serbs and Roma seized by KLA soldiers and were being hidden away from Nato troops. The source believes the captives were sent across the border to Albania and killed. \"Now, looking back, I know that some of the things that were done to innocent civilians were wrong. But the people who did these things act as if nothing happened, and continue to hurt their own people, Albanians.\" This man was one of eight former KLA fighters who revealed some of their darkest secrets from the war. A soldier's story Yet another source spoke of driving trucks packed with shackled prisoners - mainly Serbian civilians from Kosovo - to secret locations in Albania where they were eventually killed. He recalled hearing two of the captives begging to be shot rather than tortured and \"cut into pieces\". \"I was sick. I was just waiting for it to end,\" the source told me. \"It was hard. I thought we were fighting a war [of liberation] but this was something completely different.\" (.....) These are the people Clinton helped in 1999, and Bush recognized their independence in 2008. At the time of their recognition, their “president” was a former KLA member and under suspicion (Wanted, if not a friend of ours) of committing war crimes! This goes along side what Carla Del Ponte wrote in her book last year about organ smuggling in northern Albania. +http://news.bbc.co.uk/2/hi/europe/7990984.stm \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090409, 
        "postID": 1, 
        "quote": "The man spoke plainly as he explained the horrors he lived through in a Kosovo Liberation Army prison camp 10 years ago. He told me about how he watched people beaten with steel pipes, cut with knives, left for days without food, and shot and killed. \"What can you feel when you see those things?\" he said. \"It's something that is stuck in my mind for the rest of my life. You cannot do those things to people, not even to animals.\" As the man talked, his mother paced nervously in the nearby kitchen. She was panicked and tears were streaming down her face. \"They'll kill him, they'll kill him,\" she moaned, clutching one of her grandchildren. But her son persisted. We spent hours in the family's sitting room as our source detailed allegations of possible war crimes by KLA officers in a military camp in the Albanian border town of Kukes. It was a crucial interview for a delicate story I have been investigating for years. Mystery of the missing I had met sources who spoke vaguely about secret camps in Albania where Kosovo Serbs, Albanians and Roma were interrogated, tortured and in most cases killed. I met another source who agreed to share important details about KLA prison camps. This man cut a very different profile. He had returned from a successful career abroad to join the KLA in its fight for Kosovo's independence from Serbia. The man was still proud of the goals he fought for, but he had become haunted by the treatment of civilians he had seen at a KLA prison camp. More than that, he said he felt angry and betrayed by KLA commanders who tolerated and even ordered the abuses. \"It didn't seem strange at the time,\" he told me as he described seeing desperate civilians locked in a filthy agricultural shed. He said the civilians were Serbs and Roma seized by KLA soldiers and were being hidden away from Nato troops. The source believes the captives were sent across the border to Albania and killed. \"Now, looking back, I know that some of the things that were done to innocent civilians were wrong. But the people who did these things act as if nothing happened, and continue to hurt their own people, Albanians.\" This man was one of eight former KLA fighters who revealed some of their darkest secrets from the war. A soldier's story Yet another source spoke of driving trucks packed with shackled prisoners - mainly Serbian civilians from Kosovo - to secret locations in Albania where they were eventually killed. He recalled hearing two of the captives begging to be shot rather than tortured and \"cut into pieces\". \"I was sick. I was just waiting for it to end,\" the source told me. \"It was hard. I thought we were fighting a war [of liberation] but this was something completely different.\" (.....)", 
        "reply": " These are the people Clinton helped in 1999, and Bush recognized their independence in 2008. At the time of their recognition, their “president” was a former KLA member and under suspicion (Wanted, if not a friend of ours) of committing war crimes! This goes along side what Carla Del Ponte wrote in her book last year about organ smuggling in northern Albania. +http://news.bbc.co.uk/2/hi/europe/7990984.stm \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-09 13:55:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: The man spoke plainly as he explained the horrors he lived through in a Kosovo Liberation Army prison camp 10 years ago. He told me about how he watched people beaten with steel pipes, cut with knives, left for days without food, and shot and killed. \"What can you feel when you see those things?\" he said. \"It's something that is stuck in my mind for the rest of my life. You cannot do those things to people, not even to animals.\" As the man talked, his mother paced nervously in the nearby kitchen. She was panicked and tears were streaming down her face. \"They'll kill him, they'll kill him,\" she moaned, clutching one of her grandchildren. But her son persisted. We spent hours in the family's sitting room as our source detailed allegations of possible war crimes by KLA officers in a military camp in the Albanian border town of Kukes. It was a crucial interview for a delicate story I have been investigating for years. Mystery of the missing I had met sources who spoke vaguely about secret camps in Albania where Kosovo Serbs, Albanians and Roma were interrogated, tortured and in most cases killed. I met another source who agreed to share important details about KLA prison camps. This man cut a very different profile. He had returned from a successful career abroad to join the KLA in its fight for Kosovo's independence from Serbia. The man was still proud of the goals he fought for, but he had become haunted by the treatment of civilians he had seen at a KLA prison camp. More than that, he said he felt angry and betrayed by KLA commanders who tolerated and even ordered the abuses. \"It didn't seem strange at the time,\" he told me as he described seeing desperate civilians locked in a filthy agricultural shed. He said the civilians were Serbs and Roma seized by KLA soldiers and were being hidden away from Nato troops. The source believes the captives were sent across the border to Albania and killed. \"Now, looking back, I know that some of the things that were done to innocent civilians were wrong. But the people who did these things act as if nothing happened, and continue to hurt their own people, Albanians.\" This man was one of eight former KLA fighters who revealed some of their darkest secrets from the war. A soldier's story Yet another source spoke of driving trucks packed with shackled prisoners - mainly Serbian civilians from Kosovo - to secret locations in Albania where they were eventually killed. He recalled hearing two of the captives begging to be shot rather than tortured and \"cut into pieces\". \"I was sick. I was just waiting for it to end,\" the source told me. \"It was hard. I thought we were fighting a war [of liberation] but this was something completely different.\" (.....) These are the people Clinton helped in 1999, and Bush recognized their independence in 2008. At the time of their recognition, their “president” was a former KLA member and under suspicion (Wanted, if not a friend of ours) of committing war crimes! This goes along side what Carla Del Ponte wrote in her book last year about organ smuggling in northern Albania. +http://news.bbc.co.uk/2/hi/europe/7990984.stm And your point is?... Respectfully, SUNLINER81", 
        "intTime": 20090409, 
        "postID": 2, 
        "quote": "Originally posted by NSNN: quote: The man spoke plainly as he explained the horrors he lived through in a Kosovo Liberation Army prison camp 10 years ago. He told me about how he watched people beaten with steel pipes, cut with knives, left for days without food, and shot and killed. \"What can you feel when you see those things?\" he said. \"It's something that is stuck in my mind for the rest of my life. You cannot do those things to people, not even to animals.\" As the man talked, his mother paced nervously in the nearby kitchen. She was panicked and tears were streaming down her face. \"They'll kill him, they'll kill him,\" she moaned, clutching one of her grandchildren. But her son persisted. We spent hours in the family's sitting room as our source detailed allegations of possible war crimes by KLA officers in a military camp in the Albanian border town of Kukes. It was a crucial interview for a delicate story I have been investigating for years. Mystery of the missing I had met sources who spoke vaguely about secret camps in Albania where Kosovo Serbs, Albanians and Roma were interrogated, tortured and in most cases killed. I met another source who agreed to share important details about KLA prison camps. This man cut a very different profile. He had returned from a successful career abroad to join the KLA in its fight for Kosovo's independence from Serbia. The man was still proud of the goals he fought for, but he had become haunted by the treatment of civilians he had seen at a KLA prison camp. More than that, he said he felt angry and betrayed by KLA commanders who tolerated and even ordered the abuses. \"It didn't seem strange at the time,\" he told me as he described seeing desperate civilians locked in a filthy agricultural shed. He said the civilians were Serbs and Roma seized by KLA soldiers and were being hidden away from Nato troops. The source believes the captives were sent across the border to Albania and killed. \"Now, looking back, I know that some of the things that were done to innocent civilians were wrong. But the people who did these things act as if nothing happened, and continue to hurt their own people, Albanians.\" This man was one of eight former KLA fighters who revealed some of their darkest secrets from the war. A soldier's story Yet another source spoke of driving trucks packed with shackled prisoners - mainly Serbian civilians from Kosovo - to secret locations in Albania where they were eventually killed. He recalled hearing two of the captives begging to be shot rather than tortured and \"cut into pieces\". \"I was sick. I was just waiting for it to end,\" the source told me. \"It was hard. I thought we were fighting a war [of liberation] but this was something completely different.\" (.....) These are the people Clinton helped in 1999, and Bush recognized their independence in 2008. At the time of their recognition, their “president” was a former KLA member and under suspicion (Wanted, if not a friend of ours) of committing war crimes! This goes along side what Carla Del Ponte wrote in her book last year about organ smuggling in northern Albania. +http://news.bbc.co.uk/2/hi/europe/7990984.stm", 
        "reply": " And your point is?... Respectfully, SUNLINER81", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-09 13:59:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: And your point is?... Respectfully, SUNLINER81 That we have been supporting & nourishing a terrorist organization in the Balkans since the 90’s! Next time, if you don’t understand what the thread is about, why even post? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090409, 
        "postID": 3, 
        "quote": "Originally posted by SUNLINER81: And your point is?... Respectfully, SUNLINER81", 
        "reply": " That we have been supporting & nourishing a terrorist organization in the Balkans since the 90’s! Next time, if you don’t understand what the thread is about, why even post? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-09 14:23:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by NSNN: quote: The man spoke plainly as he explained the horrors he lived through in a Kosovo Liberation Army prison camp 10 years ago. He told me about how he watched people beaten with steel pipes, cut with knives, left for days without food, and shot and killed. \"What can you feel when you see those things?\" he said. \"It's something that is stuck in my mind for the rest of my life. You cannot do those things to people, not even to animals.\" As the man talked, his mother paced nervously in the nearby kitchen. She was panicked and tears were streaming down her face. \"They'll kill him, they'll kill him,\" she moaned, clutching one of her grandchildren. But her son persisted. We spent hours in the family's sitting room as our source detailed allegations of possible war crimes by KLA officers in a military camp in the Albanian border town of Kukes. It was a crucial interview for a delicate story I have been investigating for years. Mystery of the missing I had met sources who spoke vaguely about secret camps in Albania where Kosovo Serbs, Albanians and Roma were interrogated, tortured and in most cases killed. I met another source who agreed to share important details about KLA prison camps. This man cut a very different profile. He had returned from a successful career abroad to join the KLA in its fight for Kosovo's independence from Serbia. The man was still proud of the goals he fought for, but he had become haunted by the treatment of civilians he had seen at a KLA prison camp. More than that, he said he felt angry and betrayed by KLA commanders who tolerated and even ordered the abuses. \"It didn't seem strange at the time,\" he told me as he described seeing desperate civilians locked in a filthy agricultural shed. He said the civilians were Serbs and Roma seized by KLA soldiers and were being hidden away from Nato troops. The source believes the captives were sent across the border to Albania and killed. \"Now, looking back, I know that some of the things that were done to innocent civilians were wrong. But the people who did these things act as if nothing happened, and continue to hurt their own people, Albanians.\" This man was one of eight former KLA fighters who revealed some of their darkest secrets from the war. A soldier's story Yet another source spoke of driving trucks packed with shackled prisoners - mainly Serbian civilians from Kosovo - to secret locations in Albania where they were eventually killed. He recalled hearing two of the captives begging to be shot rather than tortured and \"cut into pieces\". \"I was sick. I was just waiting for it to end,\" the source told me. \"It was hard. I thought we were fighting a war [of liberation] but this was something completely different.\" (.....) These are the people Clinton helped in 1999, and Bush recognized their independence in 2008. At the time of their recognition, their “president” was a former KLA member and under suspicion (Wanted, if not a friend of ours) of committing war crimes! This goes along side what Carla Del Ponte wrote in her book last year about organ smuggling in northern Albania. +http://news.bbc.co.uk/2/hi/europe/7990984.stm And your point is?... Respectfully, SUNLINER81 I'm not sure about her point - But to my mind the breakup of Yugoslavia was aimed at destroying a powerful country which protected it's resources from exploitation, into a bunch of little countries that could be safely exploited by the West. This was accomplished by pretending that Yugoslav history began with the seizure of the local government of Kossovo by the Yugoslavs - As if the preceding ethnic cleansing of the Serbs (500,000 down to about a hundred thousand) had not occured.) This was accomplished by manipulating the Croats and others into \"revolting\" against the Central government - And making believe that the US Civil War wasn't a real precedent for us to look at this sudden desire for self determination. Germany for example recognised the \"new\" Croat government on the same day of their independance. The whole breakup of Yugoslavia was planned from the beginning by Western Corporate interests, and succeded beyond their wildest dreams. And in order for this to occur - There had to be \"Bad Guys,\" and the Serbs fitted the Bill. Dave", 
        "intTime": 20090409, 
        "postID": 4, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by NSNN: quote: The man spoke plainly as he explained the horrors he lived through in a Kosovo Liberation Army prison camp 10 years ago. He told me about how he watched people beaten with steel pipes, cut with knives, left for days without food, and shot and killed. \"What can you feel when you see those things?\" he said. \"It's something that is stuck in my mind for the rest of my life. You cannot do those things to people, not even to animals.\" As the man talked, his mother paced nervously in the nearby kitchen. She was panicked and tears were streaming down her face. \"They'll kill him, they'll kill him,\" she moaned, clutching one of her grandchildren. But her son persisted. We spent hours in the family's sitting room as our source detailed allegations of possible war crimes by KLA officers in a military camp in the Albanian border town of Kukes. It was a crucial interview for a delicate story I have been investigating for years. Mystery of the missing I had met sources who spoke vaguely about secret camps in Albania where Kosovo Serbs, Albanians and Roma were interrogated, tortured and in most cases killed. I met another source who agreed to share important details about KLA prison camps. This man cut a very different profile. He had returned from a successful career abroad to join the KLA in its fight for Kosovo's independence from Serbia. The man was still proud of the goals he fought for, but he had become haunted by the treatment of civilians he had seen at a KLA prison camp. More than that, he said he felt angry and betrayed by KLA commanders who tolerated and even ordered the abuses. \"It didn't seem strange at the time,\" he told me as he described seeing desperate civilians locked in a filthy agricultural shed. He said the civilians were Serbs and Roma seized by KLA soldiers and were being hidden away from Nato troops. The source believes the captives were sent across the border to Albania and killed. \"Now, looking back, I know that some of the things that were done to innocent civilians were wrong. But the people who did these things act as if nothing happened, and continue to hurt their own people, Albanians.\" This man was one of eight former KLA fighters who revealed some of their darkest secrets from the war. A soldier's story Yet another source spoke of driving trucks packed with shackled prisoners - mainly Serbian civilians from Kosovo - to secret locations in Albania where they were eventually killed. He recalled hearing two of the captives begging to be shot rather than tortured and \"cut into pieces\". \"I was sick. I was just waiting for it to end,\" the source told me. \"It was hard. I thought we were fighting a war [of liberation] but this was something completely different.\" (.....) These are the people Clinton helped in 1999, and Bush recognized their independence in 2008. At the time of their recognition, their “president” was a former KLA member and under suspicion (Wanted, if not a friend of ours) of committing war crimes! This goes along side what Carla Del Ponte wrote in her book last year about organ smuggling in northern Albania. +http://news.bbc.co.uk/2/hi/europe/7990984.stm And your point is?... Respectfully, SUNLINER81", 
        "reply": " I'm not sure about her point - But to my mind the breakup of Yugoslavia was aimed at destroying a powerful country which protected it's resources from exploitation, into a bunch of little countries that could be safely exploited by the West. This was accomplished by pretending that Yugoslav history began with the seizure of the local government of Kossovo by the Yugoslavs - As if the preceding ethnic cleansing of the Serbs (500,000 down to about a hundred thousand) had not occured.) This was accomplished by manipulating the Croats and others into \"revolting\" against the Central government - And making believe that the US Civil War wasn't a real precedent for us to look at this sudden desire for self determination. Germany for example recognised the \"new\" Croat government on the same day of their independance. The whole breakup of Yugoslavia was planned from the beginning by Western Corporate interests, and succeded beyond their wildest dreams. And in order for this to occur - There had to be \"Bad Guys,\" and the Serbs fitted the Bill. Dave", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-09 14:29:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by SUNLINER81: And your point is?... Respectfully, SUNLINER81 That we have been supporting & nourishing a terrorist organization in the Balkans since the 90’s! Next time, if you don’t understand what the thread is about, why even post? Because it wasn't clear and it was open to speculation as to the point being made... IF YOU DON'T UNDERSTAND A LEGITIMATE QUESTION, THEN WHY POST?... Respectfully, SUNLINER81", 
        "intTime": 20090409, 
        "postID": 5, 
        "quote": "Originally posted by NSNN: quote: Originally posted by SUNLINER81: And your point is?... Respectfully, SUNLINER81 That we have been supporting & nourishing a terrorist organization in the Balkans since the 90’s! Next time, if you don’t understand what the thread is about, why even post?", 
        "reply": " Because it wasn't clear and it was open to speculation as to the point being made... IF YOU DON'T UNDERSTAND A LEGITIMATE QUESTION, THEN WHY POST?... Respectfully, SUNLINER81", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-09 14:31:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by SUNLINER81: quote: Originally posted by NSNN: quote: The man spoke plainly as he explained the horrors he lived through in a Kosovo Liberation Army prison camp 10 years ago. He told me about how he watched people beaten with steel pipes, cut with knives, left for days without food, and shot and killed. \"What can you feel when you see those things?\" he said. \"It's something that is stuck in my mind for the rest of my life. You cannot do those things to people, not even to animals.\" As the man talked, his mother paced nervously in the nearby kitchen. She was panicked and tears were streaming down her face. \"They'll kill him, they'll kill him,\" she moaned, clutching one of her grandchildren. But her son persisted. We spent hours in the family's sitting room as our source detailed allegations of possible war crimes by KLA officers in a military camp in the Albanian border town of Kukes. It was a crucial interview for a delicate story I have been investigating for years. Mystery of the missing I had met sources who spoke vaguely about secret camps in Albania where Kosovo Serbs, Albanians and Roma were interrogated, tortured and in most cases killed. I met another source who agreed to share important details about KLA prison camps. This man cut a very different profile. He had returned from a successful career abroad to join the KLA in its fight for Kosovo's independence from Serbia. The man was still proud of the goals he fought for, but he had become haunted by the treatment of civilians he had seen at a KLA prison camp. More than that, he said he felt angry and betrayed by KLA commanders who tolerated and even ordered the abuses. \"It didn't seem strange at the time,\" he told me as he described seeing desperate civilians locked in a filthy agricultural shed. He said the civilians were Serbs and Roma seized by KLA soldiers and were being hidden away from Nato troops. The source believes the captives were sent across the border to Albania and killed. \"Now, looking back, I know that some of the things that were done to innocent civilians were wrong. But the people who did these things act as if nothing happened, and continue to hurt their own people, Albanians.\" This man was one of eight former KLA fighters who revealed some of their darkest secrets from the war. A soldier's story Yet another source spoke of driving trucks packed with shackled prisoners - mainly Serbian civilians from Kosovo - to secret locations in Albania where they were eventually killed. He recalled hearing two of the captives begging to be shot rather than tortured and \"cut into pieces\". \"I was sick. I was just waiting for it to end,\" the source told me. \"It was hard. I thought we were fighting a war [of liberation] but this was something completely different.\" (.....) These are the people Clinton helped in 1999, and Bush recognized their independence in 2008. At the time of their recognition, their “president” was a former KLA member and under suspicion (Wanted, if not a friend of ours) of committing war crimes! This goes along side what Carla Del Ponte wrote in her book last year about organ smuggling in northern Albania. +http://news.bbc.co.uk/2/hi/europe/7990984.stm And your point is?... Respectfully, SUNLINER81 I'm not sure about her point - But to my mind the breakup of Yugoslavia was aimed at destroying a powerful country which protected it's resources from exploitation, into a bunch of little countries that could be safely exploited by the West. This was accomplished by pretending that Yugoslav history began with the seizure of the local government of Kossovo by the Yugoslavs - As if the preceding ethnic cleansing of the Serbs (500,000 down to about a hundred thousand) had not occured.) This was accomplished by manipulating the Croats and others into \"revolting\" against the Central government - And making believe that the US Civil War wasn't a real precedent for us to look at this sudden desire for self determination. Germany for example recognised the \"new\" Croat government on the same day of their independance. The whole breakup of Yugoslavia was planned from the beginning by Western Corporate interests, and succeded beyond their wildest dreams. And in order for this to occur - There had to be \"Bad Guys,\" and the Serbs fitted the Bill. Dave Now see, here is a point from which a discussion can proceed and thank you Dave... Respectfully, SUNLINER81", 
        "intTime": 20090409, 
        "postID": 6, 
        "quote": "Originally posted by Grachus: quote: Originally posted by SUNLINER81: quote: Originally posted by NSNN: quote: The man spoke plainly as he explained the horrors he lived through in a Kosovo Liberation Army prison camp 10 years ago. He told me about how he watched people beaten with steel pipes, cut with knives, left for days without food, and shot and killed. \"What can you feel when you see those things?\" he said. \"It's something that is stuck in my mind for the rest of my life. You cannot do those things to people, not even to animals.\" As the man talked, his mother paced nervously in the nearby kitchen. She was panicked and tears were streaming down her face. \"They'll kill him, they'll kill him,\" she moaned, clutching one of her grandchildren. But her son persisted. We spent hours in the family's sitting room as our source detailed allegations of possible war crimes by KLA officers in a military camp in the Albanian border town of Kukes. It was a crucial interview for a delicate story I have been investigating for years. Mystery of the missing I had met sources who spoke vaguely about secret camps in Albania where Kosovo Serbs, Albanians and Roma were interrogated, tortured and in most cases killed. I met another source who agreed to share important details about KLA prison camps. This man cut a very different profile. He had returned from a successful career abroad to join the KLA in its fight for Kosovo's independence from Serbia. The man was still proud of the goals he fought for, but he had become haunted by the treatment of civilians he had seen at a KLA prison camp. More than that, he said he felt angry and betrayed by KLA commanders who tolerated and even ordered the abuses. \"It didn't seem strange at the time,\" he told me as he described seeing desperate civilians locked in a filthy agricultural shed. He said the civilians were Serbs and Roma seized by KLA soldiers and were being hidden away from Nato troops. The source believes the captives were sent across the border to Albania and killed. \"Now, looking back, I know that some of the things that were done to innocent civilians were wrong. But the people who did these things act as if nothing happened, and continue to hurt their own people, Albanians.\" This man was one of eight former KLA fighters who revealed some of their darkest secrets from the war. A soldier's story Yet another source spoke of driving trucks packed with shackled prisoners - mainly Serbian civilians from Kosovo - to secret locations in Albania where they were eventually killed. He recalled hearing two of the captives begging to be shot rather than tortured and \"cut into pieces\". \"I was sick. I was just waiting for it to end,\" the source told me. \"It was hard. I thought we were fighting a war [of liberation] but this was something completely different.\" (.....) These are the people Clinton helped in 1999, and Bush recognized their independence in 2008. At the time of their recognition, their “president” was a former KLA member and under suspicion (Wanted, if not a friend of ours) of committing war crimes! This goes along side what Carla Del Ponte wrote in her book last year about organ smuggling in northern Albania. +http://news.bbc.co.uk/2/hi/europe/7990984.stm And your point is?... Respectfully, SUNLINER81 I'm not sure about her point - But to my mind the breakup of Yugoslavia was aimed at destroying a powerful country which protected it's resources from exploitation, into a bunch of little countries that could be safely exploited by the West. This was accomplished by pretending that Yugoslav history began with the seizure of the local government of Kossovo by the Yugoslavs - As if the preceding ethnic cleansing of the Serbs (500,000 down to about a hundred thousand) had not occured.) This was accomplished by manipulating the Croats and others into \"revolting\" against the Central government - And making believe that the US Civil War wasn't a real precedent for us to look at this sudden desire for self determination. Germany for example recognised the \"new\" Croat government on the same day of their independance. The whole breakup of Yugoslavia was planned from the beginning by Western Corporate interests, and succeded beyond their wildest dreams. And in order for this to occur - There had to be \"Bad Guys,\" and the Serbs fitted the Bill. Dave", 
        "reply": " Now see, here is a point from which a discussion can proceed and thank you Dave... Respectfully, SUNLINER81", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-09 14:32:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by NSNN: quote: Originally posted by SUNLINER81: And your point is?... Respectfully, SUNLINER81 That we have been supporting & nourishing a terrorist organization in the Balkans since the 90’s! Next time, if you don’t understand what the thread is about, why even post? Because it wasn't clear and it was open to speculation as to the point being made... IF YOU DON'T UNDERSTAND A LEGITIMATE QUESTION, THEN WHY POST?... Respectfully, SUNLINER81 Please; spare me! Your posts are consistently more disruptive than they are quizzical! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090409, 
        "postID": 7, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by NSNN: quote: Originally posted by SUNLINER81: And your point is?... Respectfully, SUNLINER81 That we have been supporting & nourishing a terrorist organization in the Balkans since the 90’s! Next time, if you don’t understand what the thread is about, why even post? Because it wasn't clear and it was open to speculation as to the point being made... IF YOU DON'T UNDERSTAND A LEGITIMATE QUESTION, THEN WHY POST?... Respectfully, SUNLINER81", 
        "reply": " Please; spare me! Your posts are consistently more disruptive than they are quizzical! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-09 15:35:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by NSNN: quote: The man spoke plainly as he explained the horrors he lived through in a Kosovo Liberation Army prison camp 10 years ago. He told me about how he watched people beaten with steel pipes, cut with knives, left for days without food, and shot and killed. \"What can you feel when you see those things?\" he said. \"It's something that is stuck in my mind for the rest of my life. You cannot do those things to people, not even to animals.\" As the man talked, his mother paced nervously in the nearby kitchen. She was panicked and tears were streaming down her face. \"They'll kill him, they'll kill him,\" she moaned, clutching one of her grandchildren. But her son persisted. We spent hours in the family's sitting room as our source detailed allegations of possible war crimes by KLA officers in a military camp in the Albanian border town of Kukes. It was a crucial interview for a delicate story I have been investigating for years. Mystery of the missing I had met sources who spoke vaguely about secret camps in Albania where Kosovo Serbs, Albanians and Roma were interrogated, tortured and in most cases killed. I met another source who agreed to share important details about KLA prison camps. This man cut a very different profile. He had returned from a successful career abroad to join the KLA in its fight for Kosovo's independence from Serbia. The man was still proud of the goals he fought for, but he had become haunted by the treatment of civilians he had seen at a KLA prison camp. More than that, he said he felt angry and betrayed by KLA commanders who tolerated and even ordered the abuses. \"It didn't seem strange at the time,\" he told me as he described seeing desperate civilians locked in a filthy agricultural shed. He said the civilians were Serbs and Roma seized by KLA soldiers and were being hidden away from Nato troops. The source believes the captives were sent across the border to Albania and killed. \"Now, looking back, I know that some of the things that were done to innocent civilians were wrong. But the people who did these things act as if nothing happened, and continue to hurt their own people, Albanians.\" This man was one of eight former KLA fighters who revealed some of their darkest secrets from the war. A soldier's story Yet another source spoke of driving trucks packed with shackled prisoners - mainly Serbian civilians from Kosovo - to secret locations in Albania where they were eventually killed. He recalled hearing two of the captives begging to be shot rather than tortured and \"cut into pieces\". \"I was sick. I was just waiting for it to end,\" the source told me. \"It was hard. I thought we were fighting a war [of liberation] but this was something completely different.\" (.....) These are the people Clinton helped in 1999, and Bush recognized their independence in 2008. At the time of their recognition, their “president” was a former KLA member and under suspicion (Wanted, if not a friend of ours) of committing war crimes! This goes along side what Carla Del Ponte wrote in her book last year about organ smuggling in northern Albania. +http://news.bbc.co.uk/2/hi/europe/7990984.stm And your point is?... Respectfully, SUNLINER81 C'mon now, you know how it is with Serb Fanbois, they cant take they lost...", 
        "intTime": 20090409, 
        "postID": 8, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by NSNN: quote: The man spoke plainly as he explained the horrors he lived through in a Kosovo Liberation Army prison camp 10 years ago. He told me about how he watched people beaten with steel pipes, cut with knives, left for days without food, and shot and killed. \"What can you feel when you see those things?\" he said. \"It's something that is stuck in my mind for the rest of my life. You cannot do those things to people, not even to animals.\" As the man talked, his mother paced nervously in the nearby kitchen. She was panicked and tears were streaming down her face. \"They'll kill him, they'll kill him,\" she moaned, clutching one of her grandchildren. But her son persisted. We spent hours in the family's sitting room as our source detailed allegations of possible war crimes by KLA officers in a military camp in the Albanian border town of Kukes. It was a crucial interview for a delicate story I have been investigating for years. Mystery of the missing I had met sources who spoke vaguely about secret camps in Albania where Kosovo Serbs, Albanians and Roma were interrogated, tortured and in most cases killed. I met another source who agreed to share important details about KLA prison camps. This man cut a very different profile. He had returned from a successful career abroad to join the KLA in its fight for Kosovo's independence from Serbia. The man was still proud of the goals he fought for, but he had become haunted by the treatment of civilians he had seen at a KLA prison camp. More than that, he said he felt angry and betrayed by KLA commanders who tolerated and even ordered the abuses. \"It didn't seem strange at the time,\" he told me as he described seeing desperate civilians locked in a filthy agricultural shed. He said the civilians were Serbs and Roma seized by KLA soldiers and were being hidden away from Nato troops. The source believes the captives were sent across the border to Albania and killed. \"Now, looking back, I know that some of the things that were done to innocent civilians were wrong. But the people who did these things act as if nothing happened, and continue to hurt their own people, Albanians.\" This man was one of eight former KLA fighters who revealed some of their darkest secrets from the war. A soldier's story Yet another source spoke of driving trucks packed with shackled prisoners - mainly Serbian civilians from Kosovo - to secret locations in Albania where they were eventually killed. He recalled hearing two of the captives begging to be shot rather than tortured and \"cut into pieces\". \"I was sick. I was just waiting for it to end,\" the source told me. \"It was hard. I thought we were fighting a war [of liberation] but this was something completely different.\" (.....) These are the people Clinton helped in 1999, and Bush recognized their independence in 2008. At the time of their recognition, their “president” was a former KLA member and under suspicion (Wanted, if not a friend of ours) of committing war crimes! This goes along side what Carla Del Ponte wrote in her book last year about organ smuggling in northern Albania. +http://news.bbc.co.uk/2/hi/europe/7990984.stm And your point is?... Respectfully, SUNLINER81", 
        "reply": " C'mon now, you know how it is with Serb Fanbois, they cant take they lost...", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-09 21:27:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by SUNLINER81: quote: Originally posted by NSNN: quote: Originally posted by SUNLINER81: And your point is?... Respectfully, SUNLINER81 That we have been supporting & nourishing a terrorist organization in the Balkans since the 90’s! Next time, if you don’t understand what the thread is about, why even post? Because it wasn't clear and it was open to speculation as to the point being made... IF YOU DON'T UNDERSTAND A LEGITIMATE QUESTION, THEN WHY POST?... Respectfully, SUNLINER81 Please; spare me! Your posts are consistently more disruptive than they are quizzical! And YOU are baiting, YOU should know better... LOL Respectfully, SUNLINER81", 
        "intTime": 20090410, 
        "postID": 9, 
        "quote": "Originally posted by NSNN: quote: Originally posted by SUNLINER81: quote: Originally posted by NSNN: quote: Originally posted by SUNLINER81: And your point is?... Respectfully, SUNLINER81 That we have been supporting & nourishing a terrorist organization in the Balkans since the 90’s! Next time, if you don’t understand what the thread is about, why even post? Because it wasn't clear and it was open to speculation as to the point being made... IF YOU DON'T UNDERSTAND A LEGITIMATE QUESTION, THEN WHY POST?... Respectfully, SUNLINER81 Please; spare me! Your posts are consistently more disruptive than they are quizzical!", 
        "reply": " And YOU are baiting, YOU should know better... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-10 00:53:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Peter Munk secured Montenegrin independence virtually single-handed by funding a referendum. Why? So he could lay hands on the former Yugoslav naval base at Tivat for development as a yacht club/casino complex for millionaires. It worked. >http://www.lewrockwell.com/blog/lewrw/archives/026241.html", 
        "intTime": 20090410, 
        "postID": 10, 
        "quote": "", 
        "reply": "Peter Munk secured Montenegrin independence virtually single-handed by funding a referendum. Why? So he could lay hands on the former Yugoslav naval base at Tivat for development as a yacht club/casino complex for millionaires. It worked. >http://www.lewrockwell.com/blog/lewrw/archives/026241.html", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-10 08:31:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "popsiq"
    }, 
    {
        "content": "but....but...but I thought the Kosovars were the good guys who were buried by the millions in mass graves by those evil Serbs? I thought the KLA were the good guys.....right? Its about time that the truth comes out as all this time Ive been vilified for opposing granting independence to a bunch of thugs and terrorists who are responsible for 90% of the drug flow into Europe through its vast smuggling networks headquartered in Kosovo. Ive told you of raid against human smugglers tht I was a part of and got grief for killing those innocent Kosovars in the process as all they were doing was running a \"legal brothel\" I mean whats the big deal of a NATO and US supported terrorist region want to little girls for sex, after all they are the good guys...right?", 
        "intTime": 20090410, 
        "postID": 11, 
        "quote": "", 
        "reply": "but....but...but I thought the Kosovars were the good guys who were buried by the millions in mass graves by those evil Serbs? I thought the KLA were the good guys.....right? Its about time that the truth comes out as all this time Ive been vilified for opposing granting independence to a bunch of thugs and terrorists who are responsible for 90% of the drug flow into Europe through its vast smuggling networks headquartered in Kosovo. Ive told you of raid against human smugglers tht I was a part of and got grief for killing those innocent Kosovars in the process as all they were doing was running a \"legal brothel\" I mean whats the big deal of a NATO and US supported terrorist region want to little girls for sex, after all they are the good guys...right?", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-10 08:34:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "The Serbs have been whinging that it was Albanian ethnic cleansing of Serbs in Kosovo that caused them to set out on their course. Which then led UN/NATO to enter into theirs.", 
        "intTime": 20090410, 
        "postID": 12, 
        "quote": "", 
        "reply": "The Serbs have been whinging that it was Albanian ethnic cleansing of Serbs in Kosovo that caused them to set out on their course. Which then led UN/NATO to enter into theirs.", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-10 08:34:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: And your point is?... Respectfully, SUNLINER81 Lost on you, obviously.", 
        "intTime": 20090410, 
        "postID": 13, 
        "quote": "Originally posted by SUNLINER81: And your point is?... Respectfully, SUNLINER81", 
        "reply": " Lost on you, obviously.", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-10 08:34:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: but....but...but I thought the Kosovars were the good guys who were buried by the millions in mass graves by those evil Serbs? I thought the KLA were the good guys.....right? Its about time that the truth comes out as all this time Ive been vilified for opposing granting independence to a bunch of thugs and terrorists who are responsible for 90% of the drug flow into Europe through its vast smuggling networks headquartered in Kosovo. Ive told you of raid against human smugglers tht I was a part of and got grief for killing those innocent Kosovars in the process as all they were doing was running a \"legal brothel\" I mean whats the big deal of a NATO and US supported terrorist region want to little girls for sex, after all they are the good guys...right? The recognition of Kossovo as an independant State is a clear violation of the Dayton Accords. The Dayton accords are in fact a binding treaty which was ratified by the US Senate and signed into law by Mr. Clinton. All of this speaks volumes about BOTH Republcians AND Democrats. Dave", 
        "intTime": 20090410, 
        "postID": 14, 
        "quote": "Originally posted by FlankerFlyer: but....but...but I thought the Kosovars were the good guys who were buried by the millions in mass graves by those evil Serbs? I thought the KLA were the good guys.....right? Its about time that the truth comes out as all this time Ive been vilified for opposing granting independence to a bunch of thugs and terrorists who are responsible for 90% of the drug flow into Europe through its vast smuggling networks headquartered in Kosovo. Ive told you of raid against human smugglers tht I was a part of and got grief for killing those innocent Kosovars in the process as all they were doing was running a \"legal brothel\" I mean whats the big deal of a NATO and US supported terrorist region want to little girls for sex, after all they are the good guys...right?", 
        "reply": " The recognition of Kossovo as an independant State is a clear violation of the Dayton Accords. The Dayton accords are in fact a binding treaty which was ratified by the US Senate and signed into law by Mr. Clinton. All of this speaks volumes about BOTH Republcians AND Democrats. Dave", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-10 09:07:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Peter Munk secured Montenegrin independence virtually single-handed by funding a referendum. Why? So he could lay hands on the former Yugoslav naval base at Tivat for development as a yacht club/casino complex for millionaires. It worked. >http://www.lewrockwell.com/blog/lewrw/archives/026241.html President of Montenegro; Milo Dukanovic; the man who almost single handedly (along with foreign funds) got Montenegro its independence is also under Ongoing criminal investigation in Italy.....he earned his millions on the black market! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090410, 
        "postID": 15, 
        "quote": "Originally posted by popsiq: Peter Munk secured Montenegrin independence virtually single-handed by funding a referendum. Why? So he could lay hands on the former Yugoslav naval base at Tivat for development as a yacht club/casino complex for millionaires. It worked. >http://www.lewrockwell.com/blog/lewrw/archives/026241.html", 
        "reply": " President of Montenegro; Milo Dukanovic; the man who almost single handedly (along with foreign funds) got Montenegro its independence is also under Ongoing criminal investigation in Italy.....he earned his millions on the black market! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-10 09:30:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by popsiq: The Serbs have been whinging that it was Albanian ethnic cleansing of Serbs in Kosovo that caused them to set out on their course. Which then led UN/NATO to enter into theirs. It blew my mind that we took the side of a paramilitary & criminal group against a sovereign state! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090410, 
        "postID": 16, 
        "quote": "Originally posted by popsiq: The Serbs have been whinging that it was Albanian ethnic cleansing of Serbs in Kosovo that caused them to set out on their course. Which then led UN/NATO to enter into theirs.", 
        "reply": " It blew my mind that we took the side of a paramilitary & criminal group against a sovereign state! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-10 09:39:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by SUNLINER81: And your point is?... Respectfully, SUNLINER81 Lost on you, obviously. Nice comment, several posts later... Next time try posting on an inquiry when it is made... You might then have some credibility and not be seen as a \"loon\" in your post... Respectfully, SUNLINER81", 
        "intTime": 20090410, 
        "postID": 17, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by SUNLINER81: And your point is?... Respectfully, SUNLINER81 Lost on you, obviously.", 
        "reply": " Nice comment, several posts later... Next time try posting on an inquiry when it is made... You might then have some credibility and not be seen as a \"loon\" in your post... Respectfully, SUNLINER81", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-10 14:08:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Nice comment, several posts later... Next time try posting on an inquiry when it is made... You might then have some credibility and not be seen as a \"loon\" in your post... Respectfully, SUNLINER81 now come on sunny, we all dont have the luxury of always being close to the computer. and besides, do we really care what the ultralibs have to say anyway? As for me, not surprising that wireless internet isnt as prevalent as it is in the states so I dont get to quickly respond to posts either most of the time. sometimes, several pages go by before I can reply to someone's ill informed post.", 
        "intTime": 20090410, 
        "postID": 18, 
        "quote": "Nice comment, several posts later... Next time try posting on an inquiry when it is made... You might then have some credibility and not be seen as a \"loon\" in your post... Respectfully, SUNLINER81", 
        "reply": " now come on sunny, we all dont have the luxury of always being close to the computer. and besides, do we really care what the ultralibs have to say anyway? As for me, not surprising that wireless internet isnt as prevalent as it is in the states so I dont get to quickly respond to posts either most of the time. sometimes, several pages go by before I can reply to someone's ill informed post.", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-10 15:11:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: Nice comment, several posts later... Next time try posting on an inquiry when it is made... You might then have some credibility and not be seen as a \"loon\" in your post... Respectfully, SUNLINER81 now come on sunny, we all dont have the luxury of always being close to the computer. and besides, do we really care what the ultralibs have to say anyway? As for me, not surprising that wireless internet isnt as prevalent as it is in the states so I dont get to quickly respond to posts either most of the time. sometimes, several pages go by before I can reply to someone's ill informed post. Good point, violating a legal treaty with the Serbs was done by President Clinton when he just signed off on Kossovan independance. I say that because you just pointed out he was secretely the President all along. I mean who else could you be talking about? As we all know Conservatives would never dream of aiding these Islamic terrorists. Dave", 
        "intTime": 20090410, 
        "postID": 19, 
        "quote": "Originally posted by FlankerFlyer: quote: Nice comment, several posts later... Next time try posting on an inquiry when it is made... You might then have some credibility and not be seen as a \"loon\" in your post... Respectfully, SUNLINER81 now come on sunny, we all dont have the luxury of always being close to the computer. and besides, do we really care what the ultralibs have to say anyway? As for me, not surprising that wireless internet isnt as prevalent as it is in the states so I dont get to quickly respond to posts either most of the time. sometimes, several pages go by before I can reply to someone's ill informed post.", 
        "reply": " Good point, violating a legal treaty with the Serbs was done by President Clinton when he just signed off on Kossovan independance. I say that because you just pointed out he was secretely the President all along. I mean who else could you be talking about? As we all know Conservatives would never dream of aiding these Islamic terrorists. Dave", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-10 18:11:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: Nice comment, several posts later... Next time try posting on an inquiry when it is made... You might then have some credibility and not be seen as a \"loon\" in your post... Respectfully, SUNLINER81 now come on sunny, we all dont have the luxury of always being close to the computer. and besides, do we really care what the ultralibs have to say anyway? As for me, not surprising that wireless internet isnt as prevalent as it is in the states so I dont get to quickly respond to posts either most of the time. sometimes, several pages go by before I can reply to someone's ill informed post. I was replying to mrmixitup... In no way was I replying to anything that you had posted... Respectfully, SUNLINER81", 
        "intTime": 20090410, 
        "postID": 20, 
        "quote": "Originally posted by FlankerFlyer: quote: Nice comment, several posts later... Next time try posting on an inquiry when it is made... You might then have some credibility and not be seen as a \"loon\" in your post... Respectfully, SUNLINER81 now come on sunny, we all dont have the luxury of always being close to the computer. and besides, do we really care what the ultralibs have to say anyway? As for me, not surprising that wireless internet isnt as prevalent as it is in the states so I dont get to quickly respond to posts either most of the time. sometimes, several pages go by before I can reply to someone's ill informed post.", 
        "reply": " I was replying to mrmixitup... In no way was I replying to anything that you had posted... Respectfully, SUNLINER81", 
        "threadID": "672198221_5610092022001", 
        "time": "2009-04-10 22:17:00", 
        "title": "Horrors of KLA prison camps revealed", 
        "userID": "SUNLINER81"
    }
]