[
    {
        "content": "//online.wsj.com/article/SB123992665198727459.html", 
        "intTime": 20090417, 
        "postID": 1, 
        "quote": "", 
        "reply": "//online.wsj.com/article/SB123992665198727459.html", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 07:13:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "21031127"
    }, 
    {
        "content": "quote: Originally posted by 21031127: //online.wsj.com/article/SB123992665198727459.html Did you actually read the article? Or are you simply reacting like \"Rep. John Boehner of Ohio, the House Republican leader, said Wednesday he was offended that veterans were characterized as potential domestic terrorists.\" Perhaps you and Rep. Boehner missed the part where the FBI is concerned that veterans are the TARGETS of extremist recruitment. Anyone trained in weapons and tactics is a recruiting target of these groups. I rather liked a posting by one of the folks in a different but related thread...if the government is concerned that unemployed, disenfrachised veterans may join extremist groups, perhaps the government should offer them a job countering extremist groups. Being opposed to illegal immigration or abortion does not make you a right-wing extremist any more than buying a hybrid makes you an eco-terrorist.", 
        "intTime": 20090417, 
        "postID": 2, 
        "quote": "Originally posted by 21031127: //online.wsj.com/article/SB123992665198727459.html", 
        "reply": " Did you actually read the article? Or are you simply reacting like \"Rep. John Boehner of Ohio, the House Republican leader, said Wednesday he was offended that veterans were characterized as potential domestic terrorists.\" Perhaps you and Rep. Boehner missed the part where the FBI is concerned that veterans are the TARGETS of extremist recruitment. Anyone trained in weapons and tactics is a recruiting target of these groups. I rather liked a posting by one of the folks in a different but related thread...if the government is concerned that unemployed, disenfrachised veterans may join extremist groups, perhaps the government should offer them a job countering extremist groups. Being opposed to illegal immigration or abortion does not make you a right-wing extremist any more than buying a hybrid makes you an eco-terrorist.", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 07:32:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "OMG. What is this? Like the 32nd repost? I vote this stupid report as the most reposted topic on Military.com forums of the year. (Yes, I am aware the year isn't even half over yet).", 
        "intTime": 20090417, 
        "postID": 3, 
        "quote": "", 
        "reply": "OMG. What is this? Like the 32nd repost? I vote this stupid report as the most reposted topic on Military.com forums of the year. (Yes, I am aware the year isn't even half over yet).", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 07:39:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "I sincerely believe that Veterans are not the focus of anything. This whole idea was circulated by Talk Radio, so that the electoriate of the Republican party will increase exponentially,via angry Veterans given an FBI file, instead of a heros welcome home. The Republican platform will that all veterans get taken off the FBI's list, in exchange for votes. That's all.", 
        "intTime": 20090417, 
        "postID": 4, 
        "quote": "", 
        "reply": "I sincerely believe that Veterans are not the focus of anything. This whole idea was circulated by Talk Radio, so that the electoriate of the Republican party will increase exponentially,via angry Veterans given an FBI file, instead of a heros welcome home. The Republican platform will that all veterans get taken off the FBI's list, in exchange for votes. That's all.", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:05:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "cybercafe"
    }, 
    {
        "content": "its real and very offensive... just proves that this admin are just dividers and not uniters like obama wants to claim to be... ====http://wnd.com/images/dhs-rightwing-extremism.pdf", 
        "intTime": 20090417, 
        "postID": 5, 
        "quote": "", 
        "reply": "its real and very offensive... just proves that this admin are just dividers and not uniters like obama wants to claim to be... ====http://wnd.com/images/dhs-rightwing-extremism.pdf", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:15:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: its real and very offensive... just proves that this admin are just dividers and not uniters like obama wants to claim to be... ====http://wnd.com/images/dhs-rightwing-extremism.pdf Do you actually read what you post? The report sited the threat that veterans would be TARGETED for recruitment by extremist groups...it did not refer to veterans as extremists! You and those like you that continue intentionally pumping out this kind of misinformation are the one's dividing us.", 
        "intTime": 20090417, 
        "postID": 6, 
        "quote": "Originally posted by outlaws93: its real and very offensive... just proves that this admin are just dividers and not uniters like obama wants to claim to be... ====http://wnd.com/images/dhs-rightwing-extremism.pdf", 
        "reply": " Do you actually read what you post? The report sited the threat that veterans would be TARGETED for recruitment by extremist groups...it did not refer to veterans as extremists! You and those like you that continue intentionally pumping out this kind of misinformation are the one's dividing us.", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:23:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "The fact they don't include Left wing extremist is the problem I have. That's what makes this report blantantly BIAS. Don't try to argue the matter with me because there is NO excuse. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090417, 
        "postID": 7, 
        "quote": "", 
        "reply": "The fact they don't include Left wing extremist is the problem I have. That's what makes this report blantantly BIAS. Don't try to argue the matter with me because there is NO excuse. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:33:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "L0A1"
    }, 
    {
        "content": "yea i read it did you?? you dont see how it categorize people in to the rwe group even those who are not rwe,,,, it grants powers of the patriot act on to actual American citizens for the fact that they have a different political view then the holders of the wh today... naw you dont see that tho... do you... welcome to what you all accused bush of doing but funny that a lot of liberals support this... even tho they threw a fit accusing bush of doing it when he wasnt but now obama is doing it and you say nothing...", 
        "intTime": 20090417, 
        "postID": 8, 
        "quote": "", 
        "reply": "yea i read it did you?? you dont see how it categorize people in to the rwe group even those who are not rwe,,,, it grants powers of the patriot act on to actual American citizens for the fact that they have a different political view then the holders of the wh today... naw you dont see that tho... do you... welcome to what you all accused bush of doing but funny that a lot of liberals support this... even tho they threw a fit accusing bush of doing it when he wasnt but now obama is doing it and you say nothing...", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:36:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: (U//FOUO) The possible passage of new restrictions on firearms and the return of military veterans facing significant challenges reintegrating into their communities could lead to the potential emergence of terrorist groups or lone wolf extremists capable of carrying out violent attacks. This is a direct quote NOT taken outof context. Not to mention the fact they have NO FACTS TO BACK UP) ANYTHING STATED IN THIS POLICY. Which means it's someones OPINION only. The report is wrong and needs to be trashed. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090417, 
        "postID": 9, 
        "quote": "(U//FOUO) The possible passage of new restrictions on firearms and the return of military veterans facing significant challenges reintegrating into their communities could lead to the potential emergence of terrorist groups or lone wolf extremists capable of carrying out violent attacks.", 
        "reply": " This is a direct quote NOT taken outof context. Not to mention the fact they have NO FACTS TO BACK UP) ANYTHING STATED IN THIS POLICY. Which means it's someones OPINION only. The report is wrong and needs to be trashed. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:37:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "L0A1"
    }, 
    {
        "content": "Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 10, 
        "quote": "", 
        "reply": "Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:37:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. It should have been put together, then it can be researched tit for tat. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090417, 
        "postID": 11, 
        "quote": "Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left.", 
        "reply": " It should have been put together, then it can be researched tit for tat. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:41:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. i havent been able to find the dhs report on the lwe...", 
        "intTime": 20090417, 
        "postID": 12, 
        "quote": "Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left.", 
        "reply": " i havent been able to find the dhs report on the lwe...", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:49:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. i havent been able to find the dhs report on the lwe... I've just heard about it in the news, I haven't seen it. It probably wasn't leaked like this one was. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 13, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. i havent been able to find the dhs report on the lwe...", 
        "reply": " I've just heard about it in the news, I haven't seen it. It probably wasn't leaked like this one was. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:59:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by outlaws93: quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. i havent been able to find the dhs report on the lwe... I've just heard about it in the news, I haven't seen it. It probably wasn't leaked like this one was. the whole thing smells bad to me...", 
        "intTime": 20090417, 
        "postID": 14, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by outlaws93: quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. i havent been able to find the dhs report on the lwe... I've just heard about it in the news, I haven't seen it. It probably wasn't leaked like this one was.", 
        "reply": " the whole thing smells bad to me...", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 10:04:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. i havent been able to find the dhs report on the lwe... I posted a link to the report in one of the many, many, many other threads on this topic.", 
        "intTime": 20090417, 
        "postID": 15, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. i havent been able to find the dhs report on the lwe...", 
        "reply": " I posted a link to the report in one of the many, many, many other threads on this topic.", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 10:39:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by L0A1: The fact they don't include Left wing extremist is the problem I have. That's what makes this report blantantly BIAS. Don't try to argue the matter with me because there is NO excuse. They already have a left-wing extremist threat report. It was released earlier. \"http://www.foxnews.com/projects/pdf/Leftwing_Extremist_Threat.pdf Should be a source you trust...right?", 
        "intTime": 20090417, 
        "postID": 16, 
        "quote": "Originally posted by L0A1: The fact they don't include Left wing extremist is the problem I have. That's what makes this report blantantly BIAS. Don't try to argue the matter with me because there is NO excuse.", 
        "reply": " They already have a left-wing extremist threat report. It was released earlier. \"http://www.foxnews.com/projects/pdf/Leftwing_Extremist_Threat.pdf Should be a source you trust...right?", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 10:40:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. i havent been able to find the dhs report on the lwe... Not real complicated outlaw: Google \"DHS report left-wing extremists\"...you'll get: \"http://www.foxnews.com/projects/pdf/Leftwing_Extremist_Threat.pdf", 
        "intTime": 20090417, 
        "postID": 17, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. i havent been able to find the dhs report on the lwe...", 
        "reply": " Not real complicated outlaw: Google \"DHS report left-wing extremists\"...you'll get: \"http://www.foxnews.com/projects/pdf/Leftwing_Extremist_Threat.pdf", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 10:45:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by 21031127: //online.wsj.com/article/SB123992665198727459.html The leftist idiots in DHS maybe wanted to publicize something, anything, to somehow discredit many who attended the TEA parties. It backfired. DHS need not pass GO and can go directly to hell, far as I'm concerned. I proudly qualify as one of their \"extremists.\" Ooooohhh--aaaaahhh. . . been one since the 1970s, I now see--and I don't give a damn what those obamanite fools and knaves blabber about. But what anybody with a brain can understand is that scarce resources are being urinated away on such polytickle control-freak nonsense while the real threats, islamonazis and druggies, appear to draw less attention than solid American citizens whose mistrust of the weenies in guvmint now seems all the more justified. Frickin' fools and knaves of the left. Had a military field grade commander been handed such a lousy, unfounded analysis by which to commit his unit to action, he'd have likely fired the incompetent daring to generate such unsubstantiated crap.", 
        "intTime": 20090417, 
        "postID": 18, 
        "quote": "Originally posted by 21031127: //online.wsj.com/article/SB123992665198727459.html", 
        "reply": " The leftist idiots in DHS maybe wanted to publicize something, anything, to somehow discredit many who attended the TEA parties. It backfired. DHS need not pass GO and can go directly to hell, far as I'm concerned. I proudly qualify as one of their \"extremists.\" Ooooohhh--aaaaahhh. . . been one since the 1970s, I now see--and I don't give a damn what those obamanite fools and knaves blabber about. But what anybody with a brain can understand is that scarce resources are being urinated away on such polytickle control-freak nonsense while the real threats, islamonazis and druggies, appear to draw less attention than solid American citizens whose mistrust of the weenies in guvmint now seems all the more justified. Frickin' fools and knaves of the left. Had a military field grade commander been handed such a lousy, unfounded analysis by which to commit his unit to action, he'd have likely fired the incompetent daring to generate such unsubstantiated crap.", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 10:55:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "RRR52"
    }, 
    {
        "content": "(U//FOUO) The North American Earth Liberation Front Press Office, the media arm of the Earth Liberation Front (ELF), published the following guidance for activists: “By inflicting as much economic damage as possible, the ELF can allow a given entity to decide if it is in their [sic] best economic interest to stop destroying life for the sake of profit.” (U) The most common leftwing extremist cyber attacks (particularly within the animal rights movement) in the past several years have included deletion of user accounts, flooding a company’s server with e-mails, and other types of e-mail assaults intended to force businesses to exhaust resources. — (U//FOUO) On 13 July 2007, an animal rights extremist hacked into a U.S. company’s computer system and deleted more than 300 associates’ user accounts. To restore the accounts, the perpetrator demanded that the company sell its shares in a corporation that conducts tests using animal subjects. — (U//FOUO) In October 2005, animal rights extremists launched an e-mail attack against a Milwaukee, Wisconsin firm that held stock in an animal testing laboratory. The firm subsequently sold its shares in the laboratory, with losses it estimated at approximately $1.4 million. — (U//FOUO) In late April 2005, animal rights extremists overwhelmed a U.S. company’s computer server with e-mail, which the company claims resulted in a loss of approximately $1.25 million. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 19, 
        "quote": "", 
        "reply": "(U//FOUO) The North American Earth Liberation Front Press Office, the media arm of the Earth Liberation Front (ELF), published the following guidance for activists: “By inflicting as much economic damage as possible, the ELF can allow a given entity to decide if it is in their [sic] best economic interest to stop destroying life for the sake of profit.” (U) The most common leftwing extremist cyber attacks (particularly within the animal rights movement) in the past several years have included deletion of user accounts, flooding a company’s server with e-mails, and other types of e-mail assaults intended to force businesses to exhaust resources. — (U//FOUO) On 13 July 2007, an animal rights extremist hacked into a U.S. company’s computer system and deleted more than 300 associates’ user accounts. To restore the accounts, the perpetrator demanded that the company sell its shares in a corporation that conducts tests using animal subjects. — (U//FOUO) In October 2005, animal rights extremists launched an e-mail attack against a Milwaukee, Wisconsin firm that held stock in an animal testing laboratory. The firm subsequently sold its shares in the laboratory, with losses it estimated at approximately $1.4 million. — (U//FOUO) In late April 2005, animal rights extremists overwhelmed a U.S. company’s computer server with e-mail, which the company claims resulted in a loss of approximately $1.25 million. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 10:58:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: (U//FOUO) The North American Earth Liberation Front Press Office, the media arm of the Earth Liberation Front (ELF), published the following guidance for activists: “By inflicting as much economic damage as possible, the ELF can allow a given entity to decide if it is in their [sic] best economic interest to stop destroying life for the sake of profit.” (U) The most common leftwing extremist cyber attacks (particularly within the animal rights movement) in the past several years have included deletion of user accounts, flooding a company’s server with e-mails, and other types of e-mail assaults intended to force businesses to exhaust resources. — (U//FOUO) On 13 July 2007, an animal rights extremist hacked into a U.S. company’s computer system and deleted more than 300 associates’ user accounts. To restore the accounts, the perpetrator demanded that the company sell its shares in a corporation that conducts tests using animal subjects. — (U//FOUO) In October 2005, animal rights extremists launched an e-mail attack against a Milwaukee, Wisconsin firm that held stock in an animal testing laboratory. The firm subsequently sold its shares in the laboratory, with losses it estimated at approximately $1.4 million. — (U//FOUO) In late April 2005, animal rights extremists overwhelmed a U.S. company’s computer server with e-mail, which the company claims resulted in a loss of approximately $1.25 million. See the problem is that they went into names and specific incidents with the Left Crazies. With the Right Crazies they didn't give names or incidents just that when troops come back we can be dangerous. The reports aren't even similar. As I said before just propaganda by the Left. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 20, 
        "quote": "Originally posted by Anbar7: (U//FOUO) The North American Earth Liberation Front Press Office, the media arm of the Earth Liberation Front (ELF), published the following guidance for activists: “By inflicting as much economic damage as possible, the ELF can allow a given entity to decide if it is in their [sic] best economic interest to stop destroying life for the sake of profit.” (U) The most common leftwing extremist cyber attacks (particularly within the animal rights movement) in the past several years have included deletion of user accounts, flooding a company’s server with e-mails, and other types of e-mail assaults intended to force businesses to exhaust resources. — (U//FOUO) On 13 July 2007, an animal rights extremist hacked into a U.S. company’s computer system and deleted more than 300 associates’ user accounts. To restore the accounts, the perpetrator demanded that the company sell its shares in a corporation that conducts tests using animal subjects. — (U//FOUO) In October 2005, animal rights extremists launched an e-mail attack against a Milwaukee, Wisconsin firm that held stock in an animal testing laboratory. The firm subsequently sold its shares in the laboratory, with losses it estimated at approximately $1.4 million. — (U//FOUO) In late April 2005, animal rights extremists overwhelmed a U.S. company’s computer server with e-mail, which the company claims resulted in a loss of approximately $1.25 million.", 
        "reply": " See the problem is that they went into names and specific incidents with the Left Crazies. With the Right Crazies they didn't give names or incidents just that when troops come back we can be dangerous. The reports aren't even similar. As I said before just propaganda by the Left. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 11:00:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "Anbar7"
    }, 
    {
        "content": "//online.wsj.com/article/SB123992665198727459.html", 
        "intTime": 20090417, 
        "postID": 21, 
        "quote": "", 
        "reply": "//online.wsj.com/article/SB123992665198727459.html", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 07:13:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "21031127"
    }, 
    {
        "content": "quote: Originally posted by 21031127: //online.wsj.com/article/SB123992665198727459.html Did you actually read the article? Or are you simply reacting like \"Rep. John Boehner of Ohio, the House Republican leader, said Wednesday he was offended that veterans were characterized as potential domestic terrorists.\" Perhaps you and Rep. Boehner missed the part where the FBI is concerned that veterans are the TARGETS of extremist recruitment. Anyone trained in weapons and tactics is a recruiting target of these groups. I rather liked a posting by one of the folks in a different but related thread...if the government is concerned that unemployed, disenfrachised veterans may join extremist groups, perhaps the government should offer them a job countering extremist groups. Being opposed to illegal immigration or abortion does not make you a right-wing extremist any more than buying a hybrid makes you an eco-terrorist.", 
        "intTime": 20090417, 
        "postID": 22, 
        "quote": "Originally posted by 21031127: //online.wsj.com/article/SB123992665198727459.html", 
        "reply": " Did you actually read the article? Or are you simply reacting like \"Rep. John Boehner of Ohio, the House Republican leader, said Wednesday he was offended that veterans were characterized as potential domestic terrorists.\" Perhaps you and Rep. Boehner missed the part where the FBI is concerned that veterans are the TARGETS of extremist recruitment. Anyone trained in weapons and tactics is a recruiting target of these groups. I rather liked a posting by one of the folks in a different but related thread...if the government is concerned that unemployed, disenfrachised veterans may join extremist groups, perhaps the government should offer them a job countering extremist groups. Being opposed to illegal immigration or abortion does not make you a right-wing extremist any more than buying a hybrid makes you an eco-terrorist.", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 07:32:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "OMG. What is this? Like the 32nd repost? I vote this stupid report as the most reposted topic on Military.com forums of the year. (Yes, I am aware the year isn't even half over yet).", 
        "intTime": 20090417, 
        "postID": 23, 
        "quote": "", 
        "reply": "OMG. What is this? Like the 32nd repost? I vote this stupid report as the most reposted topic on Military.com forums of the year. (Yes, I am aware the year isn't even half over yet).", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 07:39:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "I sincerely believe that Veterans are not the focus of anything. This whole idea was circulated by Talk Radio, so that the electoriate of the Republican party will increase exponentially,via angry Veterans given an FBI file, instead of a heros welcome home. The Republican platform will that all veterans get taken off the FBI's list, in exchange for votes. That's all.", 
        "intTime": 20090417, 
        "postID": 24, 
        "quote": "", 
        "reply": "I sincerely believe that Veterans are not the focus of anything. This whole idea was circulated by Talk Radio, so that the electoriate of the Republican party will increase exponentially,via angry Veterans given an FBI file, instead of a heros welcome home. The Republican platform will that all veterans get taken off the FBI's list, in exchange for votes. That's all.", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:05:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "cybercafe"
    }, 
    {
        "content": "its real and very offensive... just proves that this admin are just dividers and not uniters like obama wants to claim to be... ====http://wnd.com/images/dhs-rightwing-extremism.pdf", 
        "intTime": 20090417, 
        "postID": 25, 
        "quote": "", 
        "reply": "its real and very offensive... just proves that this admin are just dividers and not uniters like obama wants to claim to be... ====http://wnd.com/images/dhs-rightwing-extremism.pdf", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:15:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: its real and very offensive... just proves that this admin are just dividers and not uniters like obama wants to claim to be... ====http://wnd.com/images/dhs-rightwing-extremism.pdf Do you actually read what you post? The report sited the threat that veterans would be TARGETED for recruitment by extremist groups...it did not refer to veterans as extremists! You and those like you that continue intentionally pumping out this kind of misinformation are the one's dividing us.", 
        "intTime": 20090417, 
        "postID": 26, 
        "quote": "Originally posted by outlaws93: its real and very offensive... just proves that this admin are just dividers and not uniters like obama wants to claim to be... ====http://wnd.com/images/dhs-rightwing-extremism.pdf", 
        "reply": " Do you actually read what you post? The report sited the threat that veterans would be TARGETED for recruitment by extremist groups...it did not refer to veterans as extremists! You and those like you that continue intentionally pumping out this kind of misinformation are the one's dividing us.", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:23:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "The fact they don't include Left wing extremist is the problem I have. That's what makes this report blantantly BIAS. Don't try to argue the matter with me because there is NO excuse. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090417, 
        "postID": 27, 
        "quote": "", 
        "reply": "The fact they don't include Left wing extremist is the problem I have. That's what makes this report blantantly BIAS. Don't try to argue the matter with me because there is NO excuse. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:33:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "L0A1"
    }, 
    {
        "content": "yea i read it did you?? you dont see how it categorize people in to the rwe group even those who are not rwe,,,, it grants powers of the patriot act on to actual American citizens for the fact that they have a different political view then the holders of the wh today... naw you dont see that tho... do you... welcome to what you all accused bush of doing but funny that a lot of liberals support this... even tho they threw a fit accusing bush of doing it when he wasnt but now obama is doing it and you say nothing...", 
        "intTime": 20090417, 
        "postID": 28, 
        "quote": "", 
        "reply": "yea i read it did you?? you dont see how it categorize people in to the rwe group even those who are not rwe,,,, it grants powers of the patriot act on to actual American citizens for the fact that they have a different political view then the holders of the wh today... naw you dont see that tho... do you... welcome to what you all accused bush of doing but funny that a lot of liberals support this... even tho they threw a fit accusing bush of doing it when he wasnt but now obama is doing it and you say nothing...", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:36:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: (U//FOUO) The possible passage of new restrictions on firearms and the return of military veterans facing significant challenges reintegrating into their communities could lead to the potential emergence of terrorist groups or lone wolf extremists capable of carrying out violent attacks. This is a direct quote NOT taken outof context. Not to mention the fact they have NO FACTS TO BACK UP) ANYTHING STATED IN THIS POLICY. Which means it's someones OPINION only. The report is wrong and needs to be trashed. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090417, 
        "postID": 29, 
        "quote": "(U//FOUO) The possible passage of new restrictions on firearms and the return of military veterans facing significant challenges reintegrating into their communities could lead to the potential emergence of terrorist groups or lone wolf extremists capable of carrying out violent attacks.", 
        "reply": " This is a direct quote NOT taken outof context. Not to mention the fact they have NO FACTS TO BACK UP) ANYTHING STATED IN THIS POLICY. Which means it's someones OPINION only. The report is wrong and needs to be trashed. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:37:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "L0A1"
    }, 
    {
        "content": "Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 30, 
        "quote": "", 
        "reply": "Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:37:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. It should have been put together, then it can be researched tit for tat. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090417, 
        "postID": 31, 
        "quote": "Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left.", 
        "reply": " It should have been put together, then it can be researched tit for tat. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:41:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. i havent been able to find the dhs report on the lwe...", 
        "intTime": 20090417, 
        "postID": 32, 
        "quote": "Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left.", 
        "reply": " i havent been able to find the dhs report on the lwe...", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:49:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. i havent been able to find the dhs report on the lwe... I've just heard about it in the news, I haven't seen it. It probably wasn't leaked like this one was. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 33, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. i havent been able to find the dhs report on the lwe...", 
        "reply": " I've just heard about it in the news, I haven't seen it. It probably wasn't leaked like this one was. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 09:59:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by outlaws93: quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. i havent been able to find the dhs report on the lwe... I've just heard about it in the news, I haven't seen it. It probably wasn't leaked like this one was. the whole thing smells bad to me...", 
        "intTime": 20090417, 
        "postID": 34, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by outlaws93: quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. i havent been able to find the dhs report on the lwe... I've just heard about it in the news, I haven't seen it. It probably wasn't leaked like this one was.", 
        "reply": " the whole thing smells bad to me...", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 10:04:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. i havent been able to find the dhs report on the lwe... I posted a link to the report in one of the many, many, many other threads on this topic.", 
        "intTime": 20090417, 
        "postID": 35, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. i havent been able to find the dhs report on the lwe...", 
        "reply": " I posted a link to the report in one of the many, many, many other threads on this topic.", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 10:39:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by L0A1: The fact they don't include Left wing extremist is the problem I have. That's what makes this report blantantly BIAS. Don't try to argue the matter with me because there is NO excuse. They already have a left-wing extremist threat report. It was released earlier. \"http://www.foxnews.com/projects/pdf/Leftwing_Extremist_Threat.pdf Should be a source you trust...right?", 
        "intTime": 20090417, 
        "postID": 36, 
        "quote": "Originally posted by L0A1: The fact they don't include Left wing extremist is the problem I have. That's what makes this report blantantly BIAS. Don't try to argue the matter with me because there is NO excuse.", 
        "reply": " They already have a left-wing extremist threat report. It was released earlier. \"http://www.foxnews.com/projects/pdf/Leftwing_Extremist_Threat.pdf Should be a source you trust...right?", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 10:40:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. i havent been able to find the dhs report on the lwe... Not real complicated outlaw: Google \"DHS report left-wing extremists\"...you'll get: \"http://www.foxnews.com/projects/pdf/Leftwing_Extremist_Threat.pdf", 
        "intTime": 20090417, 
        "postID": 37, 
        "quote": "Originally posted by outlaws93: quote: Originally posted by Anbar7: Look the old bat appologized that she had left the foot note on the report. She didn't apologize to the troops though. LOA1 there was a Left wing report in january that gave more info than this garbage report did. It actually had groups that were active and were going to do something. This report does offend troops, but it doesn't give names of groups like the Left report did. The report is just propaganda by the Left. i havent been able to find the dhs report on the lwe...", 
        "reply": " Not real complicated outlaw: Google \"DHS report left-wing extremists\"...you'll get: \"http://www.foxnews.com/projects/pdf/Leftwing_Extremist_Threat.pdf", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 10:45:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by 21031127: //online.wsj.com/article/SB123992665198727459.html The leftist idiots in DHS maybe wanted to publicize something, anything, to somehow discredit many who attended the TEA parties. It backfired. DHS need not pass GO and can go directly to hell, far as I'm concerned. I proudly qualify as one of their \"extremists.\" Ooooohhh--aaaaahhh. . . been one since the 1970s, I now see--and I don't give a damn what those obamanite fools and knaves blabber about. But what anybody with a brain can understand is that scarce resources are being urinated away on such polytickle control-freak nonsense while the real threats, islamonazis and druggies, appear to draw less attention than solid American citizens whose mistrust of the weenies in guvmint now seems all the more justified. Frickin' fools and knaves of the left. Had a military field grade commander been handed such a lousy, unfounded analysis by which to commit his unit to action, he'd have likely fired the incompetent daring to generate such unsubstantiated crap.", 
        "intTime": 20090417, 
        "postID": 38, 
        "quote": "Originally posted by 21031127: //online.wsj.com/article/SB123992665198727459.html", 
        "reply": " The leftist idiots in DHS maybe wanted to publicize something, anything, to somehow discredit many who attended the TEA parties. It backfired. DHS need not pass GO and can go directly to hell, far as I'm concerned. I proudly qualify as one of their \"extremists.\" Ooooohhh--aaaaahhh. . . been one since the 1970s, I now see--and I don't give a damn what those obamanite fools and knaves blabber about. But what anybody with a brain can understand is that scarce resources are being urinated away on such polytickle control-freak nonsense while the real threats, islamonazis and druggies, appear to draw less attention than solid American citizens whose mistrust of the weenies in guvmint now seems all the more justified. Frickin' fools and knaves of the left. Had a military field grade commander been handed such a lousy, unfounded analysis by which to commit his unit to action, he'd have likely fired the incompetent daring to generate such unsubstantiated crap.", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 10:55:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "RRR52"
    }, 
    {
        "content": "(U//FOUO) The North American Earth Liberation Front Press Office, the media arm of the Earth Liberation Front (ELF), published the following guidance for activists: “By inflicting as much economic damage as possible, the ELF can allow a given entity to decide if it is in their [sic] best economic interest to stop destroying life for the sake of profit.” (U) The most common leftwing extremist cyber attacks (particularly within the animal rights movement) in the past several years have included deletion of user accounts, flooding a company’s server with e-mails, and other types of e-mail assaults intended to force businesses to exhaust resources. — (U//FOUO) On 13 July 2007, an animal rights extremist hacked into a U.S. company’s computer system and deleted more than 300 associates’ user accounts. To restore the accounts, the perpetrator demanded that the company sell its shares in a corporation that conducts tests using animal subjects. — (U//FOUO) In October 2005, animal rights extremists launched an e-mail attack against a Milwaukee, Wisconsin firm that held stock in an animal testing laboratory. The firm subsequently sold its shares in the laboratory, with losses it estimated at approximately $1.4 million. — (U//FOUO) In late April 2005, animal rights extremists overwhelmed a U.S. company’s computer server with e-mail, which the company claims resulted in a loss of approximately $1.25 million. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 39, 
        "quote": "", 
        "reply": "(U//FOUO) The North American Earth Liberation Front Press Office, the media arm of the Earth Liberation Front (ELF), published the following guidance for activists: “By inflicting as much economic damage as possible, the ELF can allow a given entity to decide if it is in their [sic] best economic interest to stop destroying life for the sake of profit.” (U) The most common leftwing extremist cyber attacks (particularly within the animal rights movement) in the past several years have included deletion of user accounts, flooding a company’s server with e-mails, and other types of e-mail assaults intended to force businesses to exhaust resources. — (U//FOUO) On 13 July 2007, an animal rights extremist hacked into a U.S. company’s computer system and deleted more than 300 associates’ user accounts. To restore the accounts, the perpetrator demanded that the company sell its shares in a corporation that conducts tests using animal subjects. — (U//FOUO) In October 2005, animal rights extremists launched an e-mail attack against a Milwaukee, Wisconsin firm that held stock in an animal testing laboratory. The firm subsequently sold its shares in the laboratory, with losses it estimated at approximately $1.4 million. — (U//FOUO) In late April 2005, animal rights extremists overwhelmed a U.S. company’s computer server with e-mail, which the company claims resulted in a loss of approximately $1.25 million. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 10:58:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: (U//FOUO) The North American Earth Liberation Front Press Office, the media arm of the Earth Liberation Front (ELF), published the following guidance for activists: “By inflicting as much economic damage as possible, the ELF can allow a given entity to decide if it is in their [sic] best economic interest to stop destroying life for the sake of profit.” (U) The most common leftwing extremist cyber attacks (particularly within the animal rights movement) in the past several years have included deletion of user accounts, flooding a company’s server with e-mails, and other types of e-mail assaults intended to force businesses to exhaust resources. — (U//FOUO) On 13 July 2007, an animal rights extremist hacked into a U.S. company’s computer system and deleted more than 300 associates’ user accounts. To restore the accounts, the perpetrator demanded that the company sell its shares in a corporation that conducts tests using animal subjects. — (U//FOUO) In October 2005, animal rights extremists launched an e-mail attack against a Milwaukee, Wisconsin firm that held stock in an animal testing laboratory. The firm subsequently sold its shares in the laboratory, with losses it estimated at approximately $1.4 million. — (U//FOUO) In late April 2005, animal rights extremists overwhelmed a U.S. company’s computer server with e-mail, which the company claims resulted in a loss of approximately $1.25 million. See the problem is that they went into names and specific incidents with the Left Crazies. With the Right Crazies they didn't give names or incidents just that when troops come back we can be dangerous. The reports aren't even similar. As I said before just propaganda by the Left. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090417, 
        "postID": 40, 
        "quote": "Originally posted by Anbar7: (U//FOUO) The North American Earth Liberation Front Press Office, the media arm of the Earth Liberation Front (ELF), published the following guidance for activists: “By inflicting as much economic damage as possible, the ELF can allow a given entity to decide if it is in their [sic] best economic interest to stop destroying life for the sake of profit.” (U) The most common leftwing extremist cyber attacks (particularly within the animal rights movement) in the past several years have included deletion of user accounts, flooding a company’s server with e-mails, and other types of e-mail assaults intended to force businesses to exhaust resources. — (U//FOUO) On 13 July 2007, an animal rights extremist hacked into a U.S. company’s computer system and deleted more than 300 associates’ user accounts. To restore the accounts, the perpetrator demanded that the company sell its shares in a corporation that conducts tests using animal subjects. — (U//FOUO) In October 2005, animal rights extremists launched an e-mail attack against a Milwaukee, Wisconsin firm that held stock in an animal testing laboratory. The firm subsequently sold its shares in the laboratory, with losses it estimated at approximately $1.4 million. — (U//FOUO) In late April 2005, animal rights extremists overwhelmed a U.S. company’s computer server with e-mail, which the company claims resulted in a loss of approximately $1.25 million.", 
        "reply": " See the problem is that they went into names and specific incidents with the Left Crazies. With the Right Crazies they didn't give names or incidents just that when troops come back we can be dangerous. The reports aren't even similar. As I said before just propaganda by the Left. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_3260010122001", 
        "time": "2009-04-17 11:00:00", 
        "title": "Veterans a Focus of FBI Extremist Probe", 
        "userID": "Anbar7"
    }
]