[
    {
        "content": "And the unrest reignites once again into strong protests and restless rallies in Bangkok as if nothing has changed since last year. quote: Agence France-Presse - 4/8/2009 6:04 AM GMT Tens of thousands rally against Thai PM Tens of thousands of protesters rallied in Bangkok in their biggest bid yet to topple premier Abhisit Vejjajiva, sparking fears of a violent new twist to Thailand's political crisis. Security forces guarded key government locations as supporters of fugitive former prime minister Thaksin Shinawatra massed here, one day after activists raised tensions by attacking Abhisit's car and smashing a window. Police said around 60,000 red-clad protesters chanting \"Bring Thaksin back, Abhisit get out!\" gathered outside Abhisit's office in the capital, where demonstrators have been staging a sit-in for the past two weeks. A potential flashpoint arose when they later surrounded the house of King Bhumibol Adulyadej's top adviser, General Prem Tinsulanonda, who has been accused by Thaksin of orchestrating the coup that toppled him in 2006. \"We came here to expel the government,\" protest leader Nattawut Saikuar told the cheering crowd. He added that Prem should also quit for \"inciting the military to turn against democracy.\" Dozens of soldiers stood guard inside the adviser's house. The accusations against Prem have broken a major taboo in Thai society, where the royalty is revered, and fuelled the risk of what Abhisit described earlier this week as a \"civil war\" after more than three years of instability. British-born Abhisit warned the protesters of strong action if there was any violence, and rejected their demands to dissolve his four-month-old government and hold fresh elections. (...) The unrest has prompted mounting speculation that the army could try to mount another coup, despite the fact that Abhisit and his ministers are accused by their opponents of being the military's stooges. But powerful army chief General Anupong Paojinda ruled out talk of a putsch. \"No matter how the situation deteriorates, we will abide by the law and use no other extra power,\" he said. The so-called \"Red Shirts\" remain furious about the way Abhisit took power in December, after a court decision that removed billionaire Thaksin's allies from government. That ruling came after months of protests by rival, yellow-clad protesters claiming allegiance to the monarchy, who occupied Government House and mounted a crippling blockade of Bangkok's airports late last year. Thaksin, who is living in an undisclosed foreign country to avoid a prison term for corruption, promised that the protests would mark a \"historic day for Thailand.\" (...) The nation remains deeply divided between Thaksin's followers, mainly among the urban and rural poor in northern Thailand, and his foes in Bangkok's traditional power cliques of the palace, military and bureaucracy. The government is under extra pressure to keep the peace ahead of a key summit of Asian leaders due to start Friday in the resort town of Pattaya -- the place where Abhisit came under attack Tuesday.", 
        "intTime": 20090408, 
        "postID": 1, 
        "quote": "Agence France-Presse - 4/8/2009 6:04 AM GMT Tens of thousands rally against Thai PM Tens of thousands of protesters rallied in Bangkok in their biggest bid yet to topple premier Abhisit Vejjajiva, sparking fears of a violent new twist to Thailand's political crisis. Security forces guarded key government locations as supporters of fugitive former prime minister Thaksin Shinawatra massed here, one day after activists raised tensions by attacking Abhisit's car and smashing a window. Police said around 60,000 red-clad protesters chanting \"Bring Thaksin back, Abhisit get out!\" gathered outside Abhisit's office in the capital, where demonstrators have been staging a sit-in for the past two weeks. A potential flashpoint arose when they later surrounded the house of King Bhumibol Adulyadej's top adviser, General Prem Tinsulanonda, who has been accused by Thaksin of orchestrating the coup that toppled him in 2006. \"We came here to expel the government,\" protest leader Nattawut Saikuar told the cheering crowd. He added that Prem should also quit for \"inciting the military to turn against democracy.\" Dozens of soldiers stood guard inside the adviser's house. The accusations against Prem have broken a major taboo in Thai society, where the royalty is revered, and fuelled the risk of what Abhisit described earlier this week as a \"civil war\" after more than three years of instability. British-born Abhisit warned the protesters of strong action if there was any violence, and rejected their demands to dissolve his four-month-old government and hold fresh elections. (...) The unrest has prompted mounting speculation that the army could try to mount another coup, despite the fact that Abhisit and his ministers are accused by their opponents of being the military's stooges. But powerful army chief General Anupong Paojinda ruled out talk of a putsch. \"No matter how the situation deteriorates, we will abide by the law and use no other extra power,\" he said. The so-called \"Red Shirts\" remain furious about the way Abhisit took power in December, after a court decision that removed billionaire Thaksin's allies from government. That ruling came after months of protests by rival, yellow-clad protesters claiming allegiance to the monarchy, who occupied Government House and mounted a crippling blockade of Bangkok's airports late last year. Thaksin, who is living in an undisclosed foreign country to avoid a prison term for corruption, promised that the protests would mark a \"historic day for Thailand.\" (...) The nation remains deeply divided between Thaksin's followers, mainly among the urban and rural poor in northern Thailand, and his foes in Bangkok's traditional power cliques of the palace, military and bureaucracy. The government is under extra pressure to keep the peace ahead of a key summit of Asian leaders due to start Friday in the resort town of Pattaya -- the place where Abhisit came under attack Tuesday.", 
        "reply": "And the unrest reignites once again into strong protests and restless rallies in Bangkok as if nothing has changed since last year. ", 
        "threadID": "672198221_2230091022001", 
        "time": "2009-04-08 13:10:00", 
        "title": "Mass rallies hit Bangkok again as protestors seek to depose PM Abhisit&restoreThaksin", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Why can't those Thai's just go about their business and eat fried rice instead of always over throwing their leaders? Why can't they be more like us and just go with the flow?", 
        "intTime": 20090408, 
        "postID": 2, 
        "quote": "", 
        "reply": "Why can't those Thai's just go about their business and eat fried rice instead of always over throwing their leaders? Why can't they be more like us and just go with the flow?", 
        "threadID": "672198221_2230091022001", 
        "time": "2009-04-08 19:55:00", 
        "title": "Mass rallies hit Bangkok again as protestors seek to depose PM Abhisit&restoreThaksin", 
        "userID": "Duster6"
    }, 
    {
        "content": "Another update: ++http://news.yahoo.com/s/ap/20090411/ap_on_re_as/as_asia_summit quote: Protesters force Thailand to cancel Asia summit Anti-government demonstrators storm through the 14th ASEAN convention hall Saturday, April 11, 2009, … By AMBIKA AHUJA, Associated Press Writer Ambika Ahuja, Associated Press Writer – Sat Apr 11, 6:31 pm ET PATTAYA, Thailand – Thailand evacuated Asian leaders by helicopter after hundreds of anti-government protesters stormed into their summit site Saturday, forcing the country's embattled prime minister to cancel the meeting. The latest fiasco in Thailand's political crisis increased the threat of violence and a possible military crackdown. More than 1,000 demonstrators broke through a wall of unarmed soldiers, smashed through the convention center's glass doors and ran through the building, blowing horns, waving Thai flags and shouting demands for Prime Minister Abhisit Vejjajiva to resign...", 
        "intTime": 20090411, 
        "postID": 3, 
        "quote": "Protesters force Thailand to cancel Asia summit Anti-government demonstrators storm through the 14th ASEAN convention hall Saturday, April 11, 2009, … By AMBIKA AHUJA, Associated Press Writer Ambika Ahuja, Associated Press Writer – Sat Apr 11, 6:31 pm ET PATTAYA, Thailand – Thailand evacuated Asian leaders by helicopter after hundreds of anti-government protesters stormed into their summit site Saturday, forcing the country's embattled prime minister to cancel the meeting. The latest fiasco in Thailand's political crisis increased the threat of violence and a possible military crackdown. More than 1,000 demonstrators broke through a wall of unarmed soldiers, smashed through the convention center's glass doors and ran through the building, blowing horns, waving Thai flags and shouting demands for Prime Minister Abhisit Vejjajiva to resign...", 
        "reply": "Another update: ++http://news.yahoo.com/s/ap/20090411/ap_on_re_as/as_asia_summit ", 
        "threadID": "672198221_2230091022001", 
        "time": "2009-04-11 19:42:00", 
        "title": "Mass rallies hit Bangkok again as protestors seek to depose PM Abhisit&restoreThaksin", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: A red shirt anti government protester revives a Thai army soldier who collapsed at the Association of South-East Asian Nations (ASEAN) summit plus six venue, held in the popular hillside hotel of the Royal Cliff Beach resort and PEACH convention centre, after anti government red shirt protesters stormed inside the site, causing the Thai government to cancel the 16 nation summit and declare a state of emergency in Pattaya, Thailand, 11 April 2009. Clashes occurred in the streets of Pattaya between anti-government and pro-government supporters. Thailand was hosting the ASEAN plus three and six summits including leaders of China, Japan, South Korea, India, Australia, and New Zealand, with South East Asian leaders Thai Minister of Foreign Affairs Kasit Piromya (R) and his wife Jintana Piromya (L) are carried by security guards to depart the hotel by speedboat after anti-government protesters storm to the venue of ASEAN summit in Pattaya city, Chonburi province, Thailand, 11 April 2009. Thai government decided to postpone indefinitely the Asean summit after thousands of red-shirts protesters loyal to fugitive former premier Thaksin Shinawatra broke into a hotel where is the venue of the summit of the Association of South-East Asian Nations (ASEAN) at the Thai seaside resort of Pattaya", 
        "intTime": 20090412, 
        "postID": 4, 
        "quote": "A red shirt anti government protester revives a Thai army soldier who collapsed at the Association of South-East Asian Nations (ASEAN) summit plus six venue, held in the popular hillside hotel of the Royal Cliff Beach resort and PEACH convention centre, after anti government red shirt protesters stormed inside the site, causing the Thai government to cancel the 16 nation summit and declare a state of emergency in Pattaya, Thailand, 11 April 2009. Clashes occurred in the streets of Pattaya between anti-government and pro-government supporters. Thailand was hosting the ASEAN plus three and six summits including leaders of China, Japan, South Korea, India, Australia, and New Zealand, with South East Asian leaders Thai Minister of Foreign Affairs Kasit Piromya (R) and his wife Jintana Piromya (L) are carried by security guards to depart the hotel by speedboat after anti-government protesters storm to the venue of ASEAN summit in Pattaya city, Chonburi province, Thailand, 11 April 2009. Thai government decided to postpone indefinitely the Asean summit after thousands of red-shirts protesters loyal to fugitive former premier Thaksin Shinawatra broke into a hotel where is the venue of the summit of the Association of South-East Asian Nations (ASEAN) at the Thai seaside resort of Pattaya", 
        "reply": "", 
        "threadID": "672198221_2230091022001", 
        "time": "2009-04-12 09:10:00", 
        "title": "Mass rallies hit Bangkok again as protestors seek to depose PM Abhisit&restoreThaksin", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "All I know is, with a name like Bangkok, the sex has to be good.....", 
        "intTime": 20090412, 
        "postID": 5, 
        "quote": "", 
        "reply": "All I know is, with a name like Bangkok, the sex has to be good.....", 
        "threadID": "672198221_2230091022001", 
        "time": "2009-04-12 16:01:00", 
        "title": "Mass rallies hit Bangkok again as protestors seek to depose PM Abhisit&restoreThaksin", 
        "userID": "godawgz"
    }, 
    {
        "content": "And the Thai military begins its crackdown on the anti-govt. protestors/rallies. quote: POLITICAL TURMOIL CRACKDOWN BEGINS At least 77 were injured as troops, firing tear gas and shots into the air, moved in to retake the Din Daeng intersection near Victory Monument from protesters. (...) TV news footage showed soldiers firing shots into the air. Tear gas was also fired, TV reporters at the scene said. A few hundred troops were involved in the operation. At around 7.20 am, the government announced it was in control of the situation at Din Daeng. (...) The troops were pushing from the Din Daeng intersection toward the Victory Monument. Protesters were scattered and retreated from the intersection to the moment. It appeared that the troops were in almost complete control of the Din Daeng intersection after 6 am. Col Sansern Kaewkamnerd, Army spokesman, said 300 protesters were in the area when security forces including soldiers and police moved in. He said the troops first tried to negotiate with the protesters, who were allegedly armed with molotov cocktails and tear gas themselves. He said the talks broke down after some protesters tried to ram buses against the troops. \"The troops had to fire into the air. I repeat. They fired into the air and took action against the protesters,\" he said. Some arrests were made, he said, adding that \"reluctant participants\" of the protest who were forced to stay by fellow protesters were released. (...) Earlier, Prime Minister Abhisit Vejjajiva has assured the nation that there is no disharmony within the government as well as key agencies responsible for enforcing law and order. In a late-night television address, Abhisit was flanked by all key government, military and police leaders... ++http://www.nationmultimedia.com/2009/04/13/headlines/headlines_30100388.php", 
        "intTime": 20090412, 
        "postID": 6, 
        "quote": "POLITICAL TURMOIL CRACKDOWN BEGINS At least 77 were injured as troops, firing tear gas and shots into the air, moved in to retake the Din Daeng intersection near Victory Monument from protesters. (...) TV news footage showed soldiers firing shots into the air. Tear gas was also fired, TV reporters at the scene said. A few hundred troops were involved in the operation. At around 7.20 am, the government announced it was in control of the situation at Din Daeng. (...) The troops were pushing from the Din Daeng intersection toward the Victory Monument. Protesters were scattered and retreated from the intersection to the moment. It appeared that the troops were in almost complete control of the Din Daeng intersection after 6 am. Col Sansern Kaewkamnerd, Army spokesman, said 300 protesters were in the area when security forces including soldiers and police moved in. He said the troops first tried to negotiate with the protesters, who were allegedly armed with molotov cocktails and tear gas themselves. He said the talks broke down after some protesters tried to ram buses against the troops. \"The troops had to fire into the air. I repeat. They fired into the air and took action against the protesters,\" he said. Some arrests were made, he said, adding that \"reluctant participants\" of the protest who were forced to stay by fellow protesters were released. (...) Earlier, Prime Minister Abhisit Vejjajiva has assured the nation that there is no disharmony within the government as well as key agencies responsible for enforcing law and order. In a late-night television address, Abhisit was flanked by all key government, military and police leaders... ++http://www.nationmultimedia.com/2009/04/13/headlines/headlines_30100388.php", 
        "reply": "And the Thai military begins its crackdown on the anti-govt. protestors/rallies. ", 
        "threadID": "672198221_2230091022001", 
        "time": "2009-04-12 22:42:00", 
        "title": "Mass rallies hit Bangkok again as protestors seek to depose PM Abhisit&restoreThaksin", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Other reports are saying some shots were fired into the crowd. >http://news.bbc.co.uk/2/hi/asia-pacific/7996241.stm Reports of less than gentle action by troops in the south are reported by AI. >http://news.bbc.co.uk/2/hi/asia-pacific/7825773.stm Remarkable to this pokint is that the army has managed to restrain its use of force. Last winter it almost appeared that the Army was assisting the Yellow protestors who occupied government buildings and later the main international airport, leading to the 'overthrow' of Taksin's government. But red is not a good colour to be waving in front of the military. This message has been edited. Last edited by: popsiq, Mon 13 April 2009 04:25 AM", 
        "intTime": 20090413, 
        "postID": 7, 
        "quote": "", 
        "reply": "Other reports are saying some shots were fired into the crowd. >http://news.bbc.co.uk/2/hi/asia-pacific/7996241.stm Reports of less than gentle action by troops in the south are reported by AI. >http://news.bbc.co.uk/2/hi/asia-pacific/7825773.stm Remarkable to this pokint is that the army has managed to restrain its use of force. Last winter it almost appeared that the Army was assisting the Yellow protestors who occupied government buildings and later the main international airport, leading to the 'overthrow' of Taksin's government. But red is not a good colour to be waving in front of the military. This message has been edited. Last edited by: popsiq, Mon 13 April 2009 04:25 AM", 
        "threadID": "672198221_2230091022001", 
        "time": "2009-04-13 03:59:00", 
        "title": "Mass rallies hit Bangkok again as protestors seek to depose PM Abhisit&restoreThaksin", 
        "userID": "popsiq"
    }, 
    {
        "content": "photos from Thailand: -- Thai soldiers drive their tanks on the road in Bangkok, Thailand Sunday, April 12, 2009. Thailand's embattled government, humiliated by demonstrators who shut down a 16-nation Asian summit, declared a state of emergency in the capital Sunday in an attempt to stem the tide of protest across the country. (AP Photo/Apichart Weerawong) (guys, what is this tracked armored vehicle? BMP-3?) -- Protesters surround and beat the car carrying Thai Prime Minister Abhisit Vejjajiva at the interior ministry in Bangkok April 12, 2009. Troops fired into the air as Thai anti-government protesters stormed the country's interior ministry on Sunday after Abhisit declared a state of emergency in the capital. (REUTERS) -- Thai soldiers take up a position in Bangkok, Sunday, April 12, 2009. Thailand's ousted prime minister called for a revolution Sunday after rioting erupted in the capital, with protesters commandeering public buses and swarming triumphantly over military vehicles in unchecked defiance after the government declared a state of emergency. Bands of red-shirted anti-government protesters roamed areas of Bangkok, with some furiously smashing cars carrying Prime Minister Abhisit Vejjajiva and his aides and others beating up motorists who hurled insults at them. (AP Photo / Wason Wanichakorn) -- Thailand's Prime Minister Abhisit Vejjajiva walks in the interior ministry after a news conference in Bangkok April 12, 2009. Abhisit declared a state of emergency on Sunday to quell political unrest and vowed to take tough action against protesters after they forced cancellation of an Asia summit. REUTERS/Stringer (THAILAND POLITICS CONFLICT) -- A supporter of former Thai prime minister Thaksin Shinawatra waves a national flag during a declared state of emergency at the royal plaza in Bangkok April 12, 2009. Thai Prime Minister Abhisit Vejjajiva, whose gentle treatment of protesters at an Asian summit led to its collapse in chaos, struck back on Sunday, declaring a state of emergency to quell protests in the capital. REUTERS/Kerek Wongsa (THAILAND POLITICS CONFLICT IMAGE OF THE DAY TOP PICTURE)", 
        "intTime": 20090413, 
        "postID": 8, 
        "quote": "", 
        "reply": "photos from Thailand: -- Thai soldiers drive their tanks on the road in Bangkok, Thailand Sunday, April 12, 2009. Thailand's embattled government, humiliated by demonstrators who shut down a 16-nation Asian summit, declared a state of emergency in the capital Sunday in an attempt to stem the tide of protest across the country. (AP Photo/Apichart Weerawong) (guys, what is this tracked armored vehicle? BMP-3?) -- Protesters surround and beat the car carrying Thai Prime Minister Abhisit Vejjajiva at the interior ministry in Bangkok April 12, 2009. Troops fired into the air as Thai anti-government protesters stormed the country's interior ministry on Sunday after Abhisit declared a state of emergency in the capital. (REUTERS) -- Thai soldiers take up a position in Bangkok, Sunday, April 12, 2009. Thailand's ousted prime minister called for a revolution Sunday after rioting erupted in the capital, with protesters commandeering public buses and swarming triumphantly over military vehicles in unchecked defiance after the government declared a state of emergency. Bands of red-shirted anti-government protesters roamed areas of Bangkok, with some furiously smashing cars carrying Prime Minister Abhisit Vejjajiva and his aides and others beating up motorists who hurled insults at them. (AP Photo / Wason Wanichakorn) -- Thailand's Prime Minister Abhisit Vejjajiva walks in the interior ministry after a news conference in Bangkok April 12, 2009. Abhisit declared a state of emergency on Sunday to quell political unrest and vowed to take tough action against protesters after they forced cancellation of an Asia summit. REUTERS/Stringer (THAILAND POLITICS CONFLICT) -- A supporter of former Thai prime minister Thaksin Shinawatra waves a national flag during a declared state of emergency at the royal plaza in Bangkok April 12, 2009. Thai Prime Minister Abhisit Vejjajiva, whose gentle treatment of protesters at an Asian summit led to its collapse in chaos, struck back on Sunday, declaring a state of emergency to quell protests in the capital. REUTERS/Kerek Wongsa (THAILAND POLITICS CONFLICT IMAGE OF THE DAY TOP PICTURE)", 
        "threadID": "672198221_2230091022001", 
        "time": "2009-04-13 09:08:00", 
        "title": "Mass rallies hit Bangkok again as protestors seek to depose PM Abhisit&restoreThaksin", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "More updates: ++http://news.yahoo.com/s/nm/20090414/ts_nm/us_thailand_politics;_ylt=Ao.wfHMUk8JegT0Sv7FXAn934T0D quote: Thai protest ends peacefully By Martin Petty and John Ruwitch Martin Petty And John Ruwitch – Tue Apr 14, 8:00 am ET BANGKOK (Reuters) – Thai anti-government protesters in Bangkok surrendered on Tuesday, giving the harried prime minister some breathing space to try to fix the worsening economy. (...) The government extended the New Year's holiday for the rest of the week for \"public safety\" in case the red shirts regroup in Thaksin strongholds and come back to the capital, government spokesman Panitan Wattanayagorn told Reuters. (...) Thailand's intractable political divide broadly pits royalists, the military and the urban middle-class against the rural poor loyal to Thaksin. (...) The tourist sector was barely picking up after a one-week shutdown of Bangkok's airports by protesters opposed to Thaksin late last year when a government allied to him was in power. Abhisit was made to look foolish after the \"red shirts\" forced the cancellation of an Asian summit in the resort of Pattaya on Saturday, an event the prime minister had trumpeted as proof Thailand was returning to normal. Protesters had besieged his office at Government House since March 26, demanding he resign and new elections be held. But Abhisit restored some of his lost credibility after the military quelled violent protests on Monday between red shirts and troops at a major junction in the capital without too much bloodshed. Two people died, both of them in skirmishes between residents and someone riding on a motorbike, while 123 people were injured in the clashes between soldiers and protesters, mostly from tear gas, authorities said. (...) The government announced the three-day holiday would be extended for the rest of the week, although financial markets will open as normal on Thursday. Arrest warrants have been issued for Thaksin and 13 other pro-Thaksin United Front for Democracy against Dictatorship (UDD) leaders for violating the state of emergency, which forbids gatherings of more than five people for political reasons. \"DO OR DIE\" Army spokesman Sansern Kaewkamnerd said red-shirted protesters had tried to stop transmission... (...) He said dissolving parliament in order to hold elections could lead to electoral violence, but he would listen to the grievances of protesters. The end to the protests is a blow to Thaksin, ousted in a 2006 coup and living in exile to avoid jail on a corruption conviction. He had been calling for a \"people's revolution\" that for now has fizzled... ++http://news.yahoo.com/s/afp/20090414/wl_asia_afp/thailandpoliticsprotest;_ylt=AmfxCt8VLfGFXvsftVFNKsJ34T0D quote: Thailand seeks Thaksin's arrest over protests by Boonradom Chitradon Boonradom Chitradon – 1 hr 26 mins ago BANGKOK (AFP) – Thailand issued an arrest warrant Tuesday for fugitive former premier Thaksin Shinawatra for inciting street battles between anti-government protesters and troops that left two dead and 123 hurt. The move came just hours after thousands of pro-Thaksin demonstrators abandoned their three-week rally at Prime Minister Abhisit Vejjajiva's office, fearing a potentially bloody crackdown by government troops. A court issued warrants for Thaksin and 12 supporters, three of whom were detained by police and charged with crimes relating to the unrest, which saw soldiers and protesters fight running battles in Bangkok on Monday. (...) The premier said a state of emergency imposed on Sunday in Bangkok and surrounding areas would remain in place while isolated \"incidents\" of protest were dealt with and promised to prosecute all protest leaders. But analysts warned that the violence had merely widened the rift between largely poor supporters of Thaksin and the government backed by the army and the Bangkok elite. (...) Shopping malls closed down by the violence quickly reopened, a boost for the struggling economy and the vital tourism industry after television images of the chaos in Bangkok flashed around the world. (...) Army spokesman Colonel Sunsern Kaewkumnerd said troops had also suppressed protests in three provinces on Monday, during which demonstrators took control of a television station and a railway terminal. Several countries have advised tourists not to travel to Thailand or to exercise caution if already there, while the US State Department condemned the \"unacceptable violence\" by the protesters. Bangkok emergency services said Tuesday that the toll from clashes between security forces, demonstrators and local residents stood at two dead and 123 wounded, 44 of whom were still in hospital.", 
        "intTime": 20090414, 
        "postID": 9, 
        "quote": "Thai protest ends peacefully By Martin Petty and John Ruwitch Martin Petty And John Ruwitch – Tue Apr 14, 8:00 am ET BANGKOK (Reuters) – Thai anti-government protesters in Bangkok surrendered on Tuesday, giving the harried prime minister some breathing space to try to fix the worsening economy. (...) The government extended the New Year's holiday for the rest of the week for \"public safety\" in case the red shirts regroup in Thaksin strongholds and come back to the capital, government spokesman Panitan Wattanayagorn told Reuters. (...) Thailand's intractable political divide broadly pits royalists, the military and the urban middle-class against the rural poor loyal to Thaksin. (...) The tourist sector was barely picking up after a one-week shutdown of Bangkok's airports by protesters opposed to Thaksin late last year when a government allied to him was in power. Abhisit was made to look foolish after the \"red shirts\" forced the cancellation of an Asian summit in the resort of Pattaya on Saturday, an event the prime minister had trumpeted as proof Thailand was returning to normal. Protesters had besieged his office at Government House since March 26, demanding he resign and new elections be held. But Abhisit restored some of his lost credibility after the military quelled violent protests on Monday between red shirts and troops at a major junction in the capital without too much bloodshed. Two people died, both of them in skirmishes between residents and someone riding on a motorbike, while 123 people were injured in the clashes between soldiers and protesters, mostly from tear gas, authorities said. (...) The government announced the three-day holiday would be extended for the rest of the week, although financial markets will open as normal on Thursday. Arrest warrants have been issued for Thaksin and 13 other pro-Thaksin United Front for Democracy against Dictatorship (UDD) leaders for violating the state of emergency, which forbids gatherings of more than five people for political reasons. \"DO OR DIE\" Army spokesman Sansern Kaewkamnerd said red-shirted protesters had tried to stop transmission... (...) He said dissolving parliament in order to hold elections could lead to electoral violence, but he would listen to the grievances of protesters. The end to the protests is a blow to Thaksin, ousted in a 2006 coup and living in exile to avoid jail on a corruption conviction. He had been calling for a \"people's revolution\" that for now has fizzled...", 
        "reply": "More updates: ++http://news.yahoo.com/s/nm/20090414/ts_nm/us_thailand_politics;_ylt=Ao.wfHMUk8JegT0Sv7FXAn934T0D  ++http://news.yahoo.com/s/afp/20090414/wl_asia_afp/thailandpoliticsprotest;_ylt=AmfxCt8VLfGFXvsftVFNKsJ34T0D quote: Thailand seeks Thaksin's arrest over protests by Boonradom Chitradon Boonradom Chitradon – 1 hr 26 mins ago BANGKOK (AFP) – Thailand issued an arrest warrant Tuesday for fugitive former premier Thaksin Shinawatra for inciting street battles between anti-government protesters and troops that left two dead and 123 hurt. The move came just hours after thousands of pro-Thaksin demonstrators abandoned their three-week rally at Prime Minister Abhisit Vejjajiva's office, fearing a potentially bloody crackdown by government troops. A court issued warrants for Thaksin and 12 supporters, three of whom were detained by police and charged with crimes relating to the unrest, which saw soldiers and protesters fight running battles in Bangkok on Monday. (...) The premier said a state of emergency imposed on Sunday in Bangkok and surrounding areas would remain in place while isolated \"incidents\" of protest were dealt with and promised to prosecute all protest leaders. But analysts warned that the violence had merely widened the rift between largely poor supporters of Thaksin and the government backed by the army and the Bangkok elite. (...) Shopping malls closed down by the violence quickly reopened, a boost for the struggling economy and the vital tourism industry after television images of the chaos in Bangkok flashed around the world. (...) Army spokesman Colonel Sunsern Kaewkumnerd said troops had also suppressed protests in three provinces on Monday, during which demonstrators took control of a television station and a railway terminal. Several countries have advised tourists not to travel to Thailand or to exercise caution if already there, while the US State Department condemned the \"unacceptable violence\" by the protesters. Bangkok emergency services said Tuesday that the toll from clashes between security forces, demonstrators and local residents stood at two dead and 123 wounded, 44 of whom were still in hospital.", 
        "threadID": "672198221_2230091022001", 
        "time": "2009-04-14 12:29:00", 
        "title": "Mass rallies hit Bangkok again as protestors seek to depose PM Abhisit&restoreThaksin", 
        "userID": "Canuck_Centaur"
    }
]