[
    {
        "content": "says there was... \"Knowledge and support for America leaving the moral high ground and moving down the path of torture within the administration.\" http://news.bbc.co.uk/2/hi/programmes/world_news_america/8024957.stm", 
        "intTime": 20090430, 
        "postID": 1, 
        "quote": "", 
        "reply": "says there was... \"Knowledge and support for America leaving the moral high ground and moving down the path of torture within the administration.\" http://news.bbc.co.uk/2/hi/programmes/world_news_america/8024957.stm", 
        "threadID": "672198221_5640031222001", 
        "time": "2009-04-30 01:44:00", 
        "title": "Lt. General Ricardo Sanchez on BBC Ameica", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "well he's obviously a lib/socialist commie pinko who hates America and only wants to provide aid and comfort to the islamofascist enemies of truth justice and the America way.", 
        "intTime": 20090430, 
        "postID": 2, 
        "quote": "", 
        "reply": "well he's obviously a lib/socialist commie pinko who hates America and only wants to provide aid and comfort to the islamofascist enemies of truth justice and the America way.", 
        "threadID": "672198221_5640031222001", 
        "time": "2009-04-30 02:12:00", 
        "title": "Lt. General Ricardo Sanchez on BBC Ameica", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: says there was... \"Knowledge and support for America leaving the moral high ground and moving down the path of torture within the administration.\" http://news.bbc.co.uk/2/hi/programmes/world_news_america/8024957.stm With somber issues like torture, my only problem is WHY did he wait so long to say something? Where was Generals “moral high ground” while he was the Commander of Coalition forces? In his pocket? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 3, 
        "quote": "Originally posted by jdksfcret: says there was... \"Knowledge and support for America leaving the moral high ground and moving down the path of torture within the administration.\" http://news.bbc.co.uk/2/hi/programmes/world_news_america/8024957.stm", 
        "reply": " With somber issues like torture, my only problem is WHY did he wait so long to say something? Where was Generals “moral high ground” while he was the Commander of Coalition forces? In his pocket? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5640031222001", 
        "time": "2009-04-30 04:52:00", 
        "title": "Lt. General Ricardo Sanchez on BBC Ameica", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by jdksfcret: says there was... \"Knowledge and support for America leaving the moral high ground and moving down the path of torture within the administration.\" http://news.bbc.co.uk/2/hi/programmes/world_news_america/8024957.stm With somber issues like torture, my only problem is WHY did he wait so long to say something? Where was Generals “moral high ground” while he was the Commander of Coalition forces? In his pocket? For the same reason several high ranking officers have since voiced their concerns. They are no longer bound by service to be quiet. Many of them voiced their concerns at the time. However, as all of us who have served know, you voice your concerns then you do what you are told. If you cannot live with what is being asked, you quit or voice your reservations publicly and are asked (told) to quit. Even Powell has voiced reservations over things he was told to do while still on AD. It comes as no surprise that many who have left the service are now finding their voices. Keep in mind Sanchez did NOT run to the media and start blabbing. He stayed silent until he was asked particular questions. He just decided he was not willing to lie about his reservations any longer. As I see it, he served his country well and should be respected for that service, not denigrated because he is now free to speak the truth as he sees it. Its still America. The man has a right to voice his opinions and concerns. Despite all of the efforts of the last 8 years, we still retain those rights.", 
        "intTime": 20090430, 
        "postID": 4, 
        "quote": "Originally posted by NSNN: quote: Originally posted by jdksfcret: says there was... \"Knowledge and support for America leaving the moral high ground and moving down the path of torture within the administration.\" http://news.bbc.co.uk/2/hi/programmes/world_news_america/8024957.stm With somber issues like torture, my only problem is WHY did he wait so long to say something? Where was Generals “moral high ground” while he was the Commander of Coalition forces? In his pocket?", 
        "reply": " For the same reason several high ranking officers have since voiced their concerns. They are no longer bound by service to be quiet. Many of them voiced their concerns at the time. However, as all of us who have served know, you voice your concerns then you do what you are told. If you cannot live with what is being asked, you quit or voice your reservations publicly and are asked (told) to quit. Even Powell has voiced reservations over things he was told to do while still on AD. It comes as no surprise that many who have left the service are now finding their voices. Keep in mind Sanchez did NOT run to the media and start blabbing. He stayed silent until he was asked particular questions. He just decided he was not willing to lie about his reservations any longer. As I see it, he served his country well and should be respected for that service, not denigrated because he is now free to speak the truth as he sees it. Its still America. The man has a right to voice his opinions and concerns. Despite all of the efforts of the last 8 years, we still retain those rights.", 
        "threadID": "672198221_5640031222001", 
        "time": "2009-04-30 05:09:00", 
        "title": "Lt. General Ricardo Sanchez on BBC Ameica", 
        "userID": "Flygirl62"
    }, 
    {
        "content": "quote: Originally posted by Flygirl62: quote: Originally posted by NSNN: quote: Originally posted by jdksfcret: says there was... \"Knowledge and support for America leaving the moral high ground and moving down the path of torture within the administration.\" http://news.bbc.co.uk/2/hi/programmes/world_news_america/8024957.stm With somber issues like torture, my only problem is WHY did he wait so long to say something? Where was Generals “moral high ground” while he was the Commander of Coalition forces? In his pocket? For the same reason several high ranking officers have since voiced their concerns. They are no longer bound by service to be quiet. Many of them voiced their concerns at the time. However, as all of us who have served know, you voice your concerns then you do what you are told. If you cannot live with what is being asked, you quit or voice your reservations publicly and are asked (told) to quit. Even Powell has voiced reservations over things he was told to do while still on AD. It comes as no surprise that many who have left the service are now finding their voices. Keep in mind Sanchez did NOT run to the media and start blabbing. He stayed silent until he was asked particular questions. He just decided he was not willing to lie about his reservations any longer. As I see it, he served his country well and should be respected for that service, not denigrated because he is now free to speak the truth as he sees it. Its still America. The man has a right to voice his opinions and concerns. Despite all of the efforts of the last 8 years, we still retain those rights. This is perceived torture we are talking about! It’s morally wrong and reprehensible. If you know it’s going on under your command, you either remedy the situation or quit; otherwise you are just as guilty as the person committing it! When he opens his mouth, all I hear is: “I’ve known and/or witnessed heinous crimes committed against human being(s); however I decided to keep my mouth shut for the sake of my career!” \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 5, 
        "quote": "Originally posted by Flygirl62: quote: Originally posted by NSNN: quote: Originally posted by jdksfcret: says there was... \"Knowledge and support for America leaving the moral high ground and moving down the path of torture within the administration.\" http://news.bbc.co.uk/2/hi/programmes/world_news_america/8024957.stm With somber issues like torture, my only problem is WHY did he wait so long to say something? Where was Generals “moral high ground” while he was the Commander of Coalition forces? In his pocket? For the same reason several high ranking officers have since voiced their concerns. They are no longer bound by service to be quiet. Many of them voiced their concerns at the time. However, as all of us who have served know, you voice your concerns then you do what you are told. If you cannot live with what is being asked, you quit or voice your reservations publicly and are asked (told) to quit. Even Powell has voiced reservations over things he was told to do while still on AD. It comes as no surprise that many who have left the service are now finding their voices. Keep in mind Sanchez did NOT run to the media and start blabbing. He stayed silent until he was asked particular questions. He just decided he was not willing to lie about his reservations any longer. As I see it, he served his country well and should be respected for that service, not denigrated because he is now free to speak the truth as he sees it. Its still America. The man has a right to voice his opinions and concerns. Despite all of the efforts of the last 8 years, we still retain those rights.", 
        "reply": " This is perceived torture we are talking about! It’s morally wrong and reprehensible. If you know it’s going on under your command, you either remedy the situation or quit; otherwise you are just as guilty as the person committing it! When he opens his mouth, all I hear is: “I’ve known and/or witnessed heinous crimes committed against human being(s); however I decided to keep my mouth shut for the sake of my career!” \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5640031222001", 
        "time": "2009-04-30 05:37:00", 
        "title": "Lt. General Ricardo Sanchez on BBC Ameica", 
        "userID": "NSNN"
    }, 
    {
        "content": "I really wish one of those guys would have had the moral courage to up & quit. That would have been a needed and effective shot across the bow of the Bush League to stop their perversion of our laws and moral code.", 
        "intTime": 20090430, 
        "postID": 6, 
        "quote": "", 
        "reply": "I really wish one of those guys would have had the moral courage to up & quit. That would have been a needed and effective shot across the bow of the Bush League to stop their perversion of our laws and moral code.", 
        "threadID": "672198221_5640031222001", 
        "time": "2009-04-30 05:46:00", 
        "title": "Lt. General Ricardo Sanchez on BBC Ameica", 
        "userID": "Motive25"
    }, 
    {
        "content": "As kids in school we all wondered how the German people could fall for such an evil man as Hitler. We thought as an enlightened and educated people it could never happen to the US, but it did. Like sheep going to the slaughter people followed Bush and his band of criminal thugs to destruction. Let us never let this happen again. Leaders calming to have an exclusive line to God must always be viewed with extreme suspicion. I have never known of one that made this claim that actually did have this favored connection. We were all taught that it is dishonorable to torture, that was the difference between the US and Germany and Japan, they did we did not. A nation that looses its honor may win a battle but will always loose the war in the end. As we begin to emerge from our nations darkest hour to rebuild our nation’s honor, let us give thanks to God for our deliverance. Let us all stand vigilant, united and determined to never fall victim to band of criminal thugs again. Freedom is the responsibility of all of us. Every generation must make their stand. Let us never forget that in Nov of 2008 during our darkest hour that gallant Americans from every corner of the nation stood up for freedom to reclaim our nation.", 
        "intTime": 20090430, 
        "postID": 7, 
        "quote": "", 
        "reply": "As kids in school we all wondered how the German people could fall for such an evil man as Hitler. We thought as an enlightened and educated people it could never happen to the US, but it did. Like sheep going to the slaughter people followed Bush and his band of criminal thugs to destruction. Let us never let this happen again. Leaders calming to have an exclusive line to God must always be viewed with extreme suspicion. I have never known of one that made this claim that actually did have this favored connection. We were all taught that it is dishonorable to torture, that was the difference between the US and Germany and Japan, they did we did not. A nation that looses its honor may win a battle but will always loose the war in the end. As we begin to emerge from our nations darkest hour to rebuild our nation’s honor, let us give thanks to God for our deliverance. Let us all stand vigilant, united and determined to never fall victim to band of criminal thugs again. Freedom is the responsibility of all of us. Every generation must make their stand. Let us never forget that in Nov of 2008 during our darkest hour that gallant Americans from every corner of the nation stood up for freedom to reclaim our nation.", 
        "threadID": "672198221_5640031222001", 
        "time": "2009-04-30 05:47:00", 
        "title": "Lt. General Ricardo Sanchez on BBC Ameica", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by Flygirl62: quote: Originally posted by NSNN: quote: Originally posted by jdksfcret: says there was... \"Knowledge and support for America leaving the moral high ground and moving down the path of torture within the administration.\" http://news.bbc.co.uk/2/hi/programmes/world_news_america/8024957.stm With somber issues like torture, my only problem is WHY did he wait so long to say something? Where was Generals “moral high ground” while he was the Commander of Coalition forces? In his pocket? For the same reason several high ranking officers have since voiced their concerns. They are no longer bound by service to be quiet. Many of them voiced their concerns at the time. However, as all of us who have served know, you voice your concerns then you do what you are told. If you cannot live with what is being asked, you quit or voice your reservations publicly and are asked (told) to quit. Even Powell has voiced reservations over things he was told to do while still on AD. It comes as no surprise that many who have left the service are now finding their voices. Keep in mind Sanchez did NOT run to the media and start blabbing. He stayed silent until he was asked particular questions. He just decided he was not willing to lie about his reservations any longer. As I see it, he served his country well and should be respected for that service, not denigrated because he is now free to speak the truth as he sees it. Its still America. The man has a right to voice his opinions and concerns. Despite all of the efforts of the last 8 years, we still retain those rights. I'm glad he's speaking out now, but he should have displayed more honor and courage as the whole mess was unfolding rather than going along to get along.", 
        "intTime": 20090430, 
        "postID": 8, 
        "quote": "Originally posted by Flygirl62: quote: Originally posted by NSNN: quote: Originally posted by jdksfcret: says there was... \"Knowledge and support for America leaving the moral high ground and moving down the path of torture within the administration.\" http://news.bbc.co.uk/2/hi/programmes/world_news_america/8024957.stm With somber issues like torture, my only problem is WHY did he wait so long to say something? Where was Generals “moral high ground” while he was the Commander of Coalition forces? In his pocket? For the same reason several high ranking officers have since voiced their concerns. They are no longer bound by service to be quiet. Many of them voiced their concerns at the time. However, as all of us who have served know, you voice your concerns then you do what you are told. If you cannot live with what is being asked, you quit or voice your reservations publicly and are asked (told) to quit. Even Powell has voiced reservations over things he was told to do while still on AD. It comes as no surprise that many who have left the service are now finding their voices. Keep in mind Sanchez did NOT run to the media and start blabbing. He stayed silent until he was asked particular questions. He just decided he was not willing to lie about his reservations any longer. As I see it, he served his country well and should be respected for that service, not denigrated because he is now free to speak the truth as he sees it. Its still America. The man has a right to voice his opinions and concerns. Despite all of the efforts of the last 8 years, we still retain those rights.", 
        "reply": " I'm glad he's speaking out now, but he should have displayed more honor and courage as the whole mess was unfolding rather than going along to get along.", 
        "threadID": "672198221_5640031222001", 
        "time": "2009-04-30 06:06:00", 
        "title": "Lt. General Ricardo Sanchez on BBC Ameica", 
        "userID": "BPCR45_90"
    }, 
    {
        "content": "I'd say that the prosecutions of all officials who authorized torture need to be done ASAP. Obama is not going to be in office forever. At this time, right now, the Right Wing groups are trying to fix it so that most Americans can't vote. They are trying to get the Voting Rights Act of 1965 overturned. The Right Wing Republicans are not stupid. They know the Public doesn't buy their agenda. So they are trying to take steps to ensure that they don't need most of our votes. So if, by some bad luck, the Voting rights act gets outlawed before Obama leaves office, and we get another President with Right wing leanings, the only people who will be prosecuted are those who are attempting to prosecute the former Bush officials who authorized the torture. They will be prosecuted under some crackpot theory of \"obstructing justice, harrassment of high officials\"", 
        "intTime": 20090503, 
        "postID": 9, 
        "quote": "", 
        "reply": "I'd say that the prosecutions of all officials who authorized torture need to be done ASAP. Obama is not going to be in office forever. At this time, right now, the Right Wing groups are trying to fix it so that most Americans can't vote. They are trying to get the Voting Rights Act of 1965 overturned. The Right Wing Republicans are not stupid. They know the Public doesn't buy their agenda. So they are trying to take steps to ensure that they don't need most of our votes. So if, by some bad luck, the Voting rights act gets outlawed before Obama leaves office, and we get another President with Right wing leanings, the only people who will be prosecuted are those who are attempting to prosecute the former Bush officials who authorized the torture. They will be prosecuted under some crackpot theory of \"obstructing justice, harrassment of high officials\"", 
        "threadID": "672198221_5640031222001", 
        "time": "2009-05-03 14:52:00", 
        "title": "Lt. General Ricardo Sanchez on BBC Ameica", 
        "userID": "cybercafe"
    }, 
    {
        "content": "quote: Originally posted by 6837602: As kids in school we all wondered how the German people could fall for such an evil man as Hitler. We thought as an enlightened and educated people it could never happen to the US, but it did. Like sheep going to the slaughter people followed Bush and his band of criminal thugs to destruction. Let us never let this happen again. Leaders calming to have an exclusive line to God must always be viewed with extreme suspicion. I have never known of one that made this claim that actually did have this favored connection. We were all taught that it is dishonorable to torture, that was the difference between the US and Germany and Japan, they did we did not. A nation that looses its honor may win a battle but will always loose the war in the end. As we begin to emerge from our nations darkest hour to rebuild our nation’s honor, let us give thanks to God for our deliverance. Let us all stand vigilant, united and determined to never fall victim to band of criminal thugs again. Freedom is the responsibility of all of us. Every generation must make their stand. Let us never forget that in Nov of 2008 during our darkest hour that gallant Americans from every corner of the nation stood up for freedom to reclaim our nation. Was it Sinclair Lewis that said, \"When fascism comes to America, it will come wrapped in the flag and carrying a cross!\"?... Makes you wonder doesn't it?... Respectfully, SUNLINER81", 
        "intTime": 20090503, 
        "postID": 10, 
        "quote": "Originally posted by 6837602: As kids in school we all wondered how the German people could fall for such an evil man as Hitler. We thought as an enlightened and educated people it could never happen to the US, but it did. Like sheep going to the slaughter people followed Bush and his band of criminal thugs to destruction. Let us never let this happen again. Leaders calming to have an exclusive line to God must always be viewed with extreme suspicion. I have never known of one that made this claim that actually did have this favored connection. We were all taught that it is dishonorable to torture, that was the difference between the US and Germany and Japan, they did we did not. A nation that looses its honor may win a battle but will always loose the war in the end. As we begin to emerge from our nations darkest hour to rebuild our nation’s honor, let us give thanks to God for our deliverance. Let us all stand vigilant, united and determined to never fall victim to band of criminal thugs again. Freedom is the responsibility of all of us. Every generation must make their stand. Let us never forget that in Nov of 2008 during our darkest hour that gallant Americans from every corner of the nation stood up for freedom to reclaim our nation.", 
        "reply": " Was it Sinclair Lewis that said, \"When fascism comes to America, it will come wrapped in the flag and carrying a cross!\"?... Makes you wonder doesn't it?... Respectfully, SUNLINER81", 
        "threadID": "672198221_5640031222001", 
        "time": "2009-05-03 17:29:00", 
        "title": "Lt. General Ricardo Sanchez on BBC Ameica", 
        "userID": "SUNLINER81"
    }
]