[
    {
        "content": "watch the news people esp foxnews. our second amendment rights are on fire again. the gov is looking for land to incorpate into state parks protected and making it hard to hunt even. as they get the land they control the gun laws on this special land. the left or liberals will find a way to take away all our rights. gov control of everything. check this out...I have to put it in a certain way ..but try to copy and paste it into your address bar. listen closely >>http://www.youtube.com/watch?v=qQEZoknylIA.. listen and take head..also take action and copy and paste this url .. >>>http://www.gunowners.org/ean.htm... and also go here and read so I dont have to write what needs to be writen..stand up or get pushed down....dont be the quiet majority...click below and read...remember we are fighting for the rights we have in other countries...we dont want to become like them.. >>>>http://www.gunowners.org<<<<<<<<<<<<< copy and paste...then listen and or read..and then join in the fight to defend our rights..stop being the quiet majority...God bless America..", 
        "intTime": 20090317, 
        "postID": 1, 
        "quote": "", 
        "reply": "watch the news people esp foxnews. our second amendment rights are on fire again. the gov is looking for land to incorpate into state parks protected and making it hard to hunt even. as they get the land they control the gun laws on this special land. the left or liberals will find a way to take away all our rights. gov control of everything. check this out...I have to put it in a certain way ..but try to copy and paste it into your address bar. listen closely >>http://www.youtube.com/watch?v=qQEZoknylIA.. listen and take head..also take action and copy and paste this url .. >>>http://www.gunowners.org/ean.htm... and also go here and read so I dont have to write what needs to be writen..stand up or get pushed down....dont be the quiet majority...click below and read...remember we are fighting for the rights we have in other countries...we dont want to become like them.. >>>>http://www.gunowners.org<<<<<<<<<<<<< copy and paste...then listen and or read..and then join in the fight to defend our rights..stop being the quiet majority...God bless America..", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-17 12:40:00", 
        "title": "Gun owners beware", 
        "userID": "mouse51"
    }, 
    {
        "content": "I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real.", 
        "intTime": 20090317, 
        "postID": 2, 
        "quote": "", 
        "reply": "I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-17 17:38:00", 
        "title": "Gun owners beware", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "yea and what rights were those..name them..name a right the so called RIGHT WING HAS TAKEN AWAY FROM YOU....LETS HEAR IT...", 
        "intTime": 20090318, 
        "postID": 3, 
        "quote": "", 
        "reply": "yea and what rights were those..name them..name a right the so called RIGHT WING HAS TAKEN AWAY FROM YOU....LETS HEAR IT...", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-18 00:53:00", 
        "title": "Gun owners beware", 
        "userID": "mouse51"
    }, 
    {
        "content": "*cough* State parks are controlled by the states.", 
        "intTime": 20090318, 
        "postID": 4, 
        "quote": "", 
        "reply": "*cough* State parks are controlled by the states.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-18 01:04:00", 
        "title": "Gun owners beware", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. .....your right to be stupid seems intact Already past the future", 
        "intTime": 20090318, 
        "postID": 5, 
        "quote": "Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real.", 
        "reply": " .....your right to be stupid seems intact Already past the future", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-18 04:22:00", 
        "title": "Gun owners beware", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history.", 
        "intTime": 20090318, 
        "postID": 6, 
        "quote": "Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real.", 
        "reply": " 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-18 16:14:00", 
        "title": "Gun owners beware", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history. The Founders thought the Right of Habeaus Corpus was the lynchpin of personal freedom. No other right is secure if you can be arrested, held without charge, and held without trial. The Founders thought it SO important that it's not an amendment - It's embedded in the very text of the orginal document. Can you protect any of your other rights, if this RIGHT is denied? The Fourth Amendment to the Constitution guarranttee's that your personal life cannot be invaded without due process of law. Now in cases of National Emergency, with the agreement of Congress, the entire Consitution can be suspened. Mr. Bush suspended the Right of Habeaus Corpus on his own say so, and suspended the Fourth Amendment on his own say so. And finally in the recent DC victory for the Second Amendment, The administration intervened in favor of the DC ban. Only after the ruling did they \"say\" they approved it. Dave", 
        "intTime": 20090318, 
        "postID": 7, 
        "quote": "Originally posted by RRR52: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history.", 
        "reply": " The Founders thought the Right of Habeaus Corpus was the lynchpin of personal freedom. No other right is secure if you can be arrested, held without charge, and held without trial. The Founders thought it SO important that it's not an amendment - It's embedded in the very text of the orginal document. Can you protect any of your other rights, if this RIGHT is denied? The Fourth Amendment to the Constitution guarranttee's that your personal life cannot be invaded without due process of law. Now in cases of National Emergency, with the agreement of Congress, the entire Consitution can be suspened. Mr. Bush suspended the Right of Habeaus Corpus on his own say so, and suspended the Fourth Amendment on his own say so. And finally in the recent DC victory for the Second Amendment, The administration intervened in favor of the DC ban. Only after the ruling did they \"say\" they approved it. Dave", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-18 16:23:00", 
        "title": "Gun owners beware", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by RRR52: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history. The Founders thought the Right of Habeaus Corpus was the lynchpin of personal freedom. No other right is secure if you can be arrested, held without charge, and held without trial. The Founders thought it SO important that it's not an amendment - It's embedded in the very text of the orginal document. Can you protect any of your other rights, if this RIGHT is denied? The Fourth Amendment to the Constitution guarranttee's that your personal life cannot be invaded without due process of law. Now in cases of National Emergency, with the agreement of Congress, the entire Consitution can be suspened. Mr. Bush suspended the Right of Habeaus Corpus on his own say so, and suspended the Fourth Amendment on his own say so. And finally in the recent DC victory for the Second Amendment, The administration intervened in favor of the DC ban. Only after the ruling did they \"say\" they approved it. Dave But, But, But, GW was just doing that to protect us.", 
        "intTime": 20090318, 
        "postID": 8, 
        "quote": "Originally posted by Grachus: quote: Originally posted by RRR52: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history. The Founders thought the Right of Habeaus Corpus was the lynchpin of personal freedom. No other right is secure if you can be arrested, held without charge, and held without trial. The Founders thought it SO important that it's not an amendment - It's embedded in the very text of the orginal document. Can you protect any of your other rights, if this RIGHT is denied? The Fourth Amendment to the Constitution guarranttee's that your personal life cannot be invaded without due process of law. Now in cases of National Emergency, with the agreement of Congress, the entire Consitution can be suspened. Mr. Bush suspended the Right of Habeaus Corpus on his own say so, and suspended the Fourth Amendment on his own say so. And finally in the recent DC victory for the Second Amendment, The administration intervened in favor of the DC ban. Only after the ruling did they \"say\" they approved it. Dave", 
        "reply": " But, But, But, GW was just doing that to protect us.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-18 16:40:00", 
        "title": "Gun owners beware", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Seems like it always starts out as a \"rumor\", then, Bam it's the law. Should have been paying attention to that stuff last year. Too late. Yes, beware and AWARE.", 
        "intTime": 20090318, 
        "postID": 9, 
        "quote": "", 
        "reply": "Seems like it always starts out as a \"rumor\", then, Bam it's the law. Should have been paying attention to that stuff last year. Too late. Yes, beware and AWARE.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-18 18:22:00", 
        "title": "Gun owners beware", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: quote: Originally posted by Grachus: quote: Originally posted by RRR52: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history. The Founders thought the Right of Habeaus Corpus was the lynchpin of personal freedom. No other right is secure if you can be arrested, held without charge, and held without trial. The Founders thought it SO important that it's not an amendment - It's embedded in the very text of the orginal document. Can you protect any of your other rights, if this RIGHT is denied? The Fourth Amendment to the Constitution guarranttee's that your personal life cannot be invaded without due process of law. Now in cases of National Emergency, with the agreement of Congress, the entire Consitution can be suspened. Mr. Bush suspended the Right of Habeaus Corpus on his own say so, and suspended the Fourth Amendment on his own say so. And finally in the recent DC victory for the Second Amendment, The administration intervened in favor of the DC ban. Only after the ruling did they \"say\" they approved it. Dave But, But, But, GW was just doing that to protect us. Same reason that Obama will use to attack the 2nd amendment. Whichever party in in control, the federal governmment is no friend of the 2nd Amendment...they aren't friends with any part of the Constitution. For everyone in government, there's always some part that clashes with their agenda. It's not just the federal government, either. It goes down to state and local level as well. In all cases, it is up to US to hold politicians accountable if WE want OUR rights protected. Our vote is the ONLY true check on their power. Once we decide that it isn't important to defend a certain right, that right is lost. The 2nd and 4th amendments are as good as gone. Even on this site, how many people say \"I don't care if the government listens to my calls and reads my emails without a warrant...it's to keep me safe and I have nothing to hide\"? That's how a Constitutional right gets lost.", 
        "intTime": 20090319, 
        "postID": 10, 
        "quote": "Originally posted by jdksfcret: quote: Originally posted by Grachus: quote: Originally posted by RRR52: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history. The Founders thought the Right of Habeaus Corpus was the lynchpin of personal freedom. No other right is secure if you can be arrested, held without charge, and held without trial. The Founders thought it SO important that it's not an amendment - It's embedded in the very text of the orginal document. Can you protect any of your other rights, if this RIGHT is denied? The Fourth Amendment to the Constitution guarranttee's that your personal life cannot be invaded without due process of law. Now in cases of National Emergency, with the agreement of Congress, the entire Consitution can be suspened. Mr. Bush suspended the Right of Habeaus Corpus on his own say so, and suspended the Fourth Amendment on his own say so. And finally in the recent DC victory for the Second Amendment, The administration intervened in favor of the DC ban. Only after the ruling did they \"say\" they approved it. Dave But, But, But, GW was just doing that to protect us.", 
        "reply": " Same reason that Obama will use to attack the 2nd amendment. Whichever party in in control, the federal governmment is no friend of the 2nd Amendment...they aren't friends with any part of the Constitution. For everyone in government, there's always some part that clashes with their agenda. It's not just the federal government, either. It goes down to state and local level as well. In all cases, it is up to US to hold politicians accountable if WE want OUR rights protected. Our vote is the ONLY true check on their power. Once we decide that it isn't important to defend a certain right, that right is lost. The 2nd and 4th amendments are as good as gone. Even on this site, how many people say \"I don't care if the government listens to my calls and reads my emails without a warrant...it's to keep me safe and I have nothing to hide\"? That's how a Constitutional right gets lost.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-19 11:34:00", 
        "title": "Gun owners beware", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: Same reason that Obama will use to attack the 2nd amendment. Whichever party in in control, the federal governmment is no friend of the 2nd Amendment...they aren't friends with any part of the Constitution. For everyone in government, there's always some part that clashes with their agenda. It's not just the federal government, either. It goes down to state and local level as well. In all cases, it is up to US to hold politicians accountable if WE want OUR rights protected. Our vote is the ONLY true check on their power. Once we decide that it isn't important to defend a certain right, that right is lost. The 2nd and 4th amendments are as good as gone. Even on this site, how many people say \"I don't care if the government listens to my calls and reads my emails without a warrant...it's to keep me safe and I have nothing to hide\"? That's how a Constitutional right gets lost. Spot on - I agree. In all fairness to politicians it is completely natural to want to have power. It's far easier to defend a right that has not been lost than to reclaim one that has. When Reagan started to use signing statements, instead of vetos, it was no big thing - He hardly used it. And then Bush I and then Clinton, and then Bush II vetoed 150 laws with a simple signing statement. And Obama has already vetoes laws with a signing statement. Obama, unlike Mr. Bush is vulnerable on this and other matters. The majority of Democrats will back taking these usururped powers that Presidents have been accumulating. And since the Republicans are now the opposition, if they join with the Democrats, perhaps we can go back to the Constitution while we still have a chance. Dave", 
        "intTime": 20090319, 
        "postID": 11, 
        "quote": "Originally posted by jwr6: Same reason that Obama will use to attack the 2nd amendment. Whichever party in in control, the federal governmment is no friend of the 2nd Amendment...they aren't friends with any part of the Constitution. For everyone in government, there's always some part that clashes with their agenda. It's not just the federal government, either. It goes down to state and local level as well. In all cases, it is up to US to hold politicians accountable if WE want OUR rights protected. Our vote is the ONLY true check on their power. Once we decide that it isn't important to defend a certain right, that right is lost. The 2nd and 4th amendments are as good as gone. Even on this site, how many people say \"I don't care if the government listens to my calls and reads my emails without a warrant...it's to keep me safe and I have nothing to hide\"? That's how a Constitutional right gets lost.", 
        "reply": " Spot on - I agree. In all fairness to politicians it is completely natural to want to have power. It's far easier to defend a right that has not been lost than to reclaim one that has. When Reagan started to use signing statements, instead of vetos, it was no big thing - He hardly used it. And then Bush I and then Clinton, and then Bush II vetoed 150 laws with a simple signing statement. And Obama has already vetoes laws with a signing statement. Obama, unlike Mr. Bush is vulnerable on this and other matters. The majority of Democrats will back taking these usururped powers that Presidents have been accumulating. And since the Republicans are now the opposition, if they join with the Democrats, perhaps we can go back to the Constitution while we still have a chance. Dave", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-19 15:37:00", 
        "title": "Gun owners beware", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by 6486143: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. .....your right to be stupid seems intact LOL", 
        "intTime": 20090319, 
        "postID": 12, 
        "quote": "Originally posted by 6486143: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. .....your right to be stupid seems intact", 
        "reply": " LOL", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-19 16:08:00", 
        "title": "Gun owners beware", 
        "userID": "DIABLO_OPSGRP"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by jdksfcret: quote: Originally posted by Grachus: quote: Originally posted by RRR52: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history. The Founders thought the Right of Habeaus Corpus was the lynchpin of personal freedom. No other right is secure if you can be arrested, held without charge, and held without trial. The Founders thought it SO important that it's not an amendment - It's embedded in the very text of the orginal document. Can you protect any of your other rights, if this RIGHT is denied? The Fourth Amendment to the Constitution guarranttee's that your personal life cannot be invaded without due process of law. Now in cases of National Emergency, with the agreement of Congress, the entire Consitution can be suspened. Mr. Bush suspended the Right of Habeaus Corpus on his own say so, and suspended the Fourth Amendment on his own say so. And finally in the recent DC victory for the Second Amendment, The administration intervened in favor of the DC ban. Only after the ruling did they \"say\" they approved it. Dave But, But, But, GW was just doing that to protect us. Same reason that Obama will use to attack the 2nd amendment. Whichever party in in control, the federal governmment is no friend of the 2nd Amendment...they aren't friends with any part of the Constitution. For everyone in government, there's always some part that clashes with their agenda. It's not just the federal government, either. It goes down to state and local level as well. In all cases, it is up to US to hold politicians accountable if WE want OUR rights protected. Our vote is the ONLY true check on their power. Once we decide that it isn't important to defend a certain right, that right is lost. The 2nd and 4th amendments are as good as gone. Even on this site, how many people say \"I don't care if the government listens to my calls and reads my emails without a warrant...it's to keep me safe and I have nothing to hide\"? That's how a Constitutional right gets lost. .......given the moronic display these liberal leaders have shown us today over the bonus issue anything is possible Already past the future", 
        "intTime": 20090319, 
        "postID": 13, 
        "quote": "Originally posted by jwr6: quote: Originally posted by jdksfcret: quote: Originally posted by Grachus: quote: Originally posted by RRR52: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history. The Founders thought the Right of Habeaus Corpus was the lynchpin of personal freedom. No other right is secure if you can be arrested, held without charge, and held without trial. The Founders thought it SO important that it's not an amendment - It's embedded in the very text of the orginal document. Can you protect any of your other rights, if this RIGHT is denied? The Fourth Amendment to the Constitution guarranttee's that your personal life cannot be invaded without due process of law. Now in cases of National Emergency, with the agreement of Congress, the entire Consitution can be suspened. Mr. Bush suspended the Right of Habeaus Corpus on his own say so, and suspended the Fourth Amendment on his own say so. And finally in the recent DC victory for the Second Amendment, The administration intervened in favor of the DC ban. Only after the ruling did they \"say\" they approved it. Dave But, But, But, GW was just doing that to protect us. Same reason that Obama will use to attack the 2nd amendment. Whichever party in in control, the federal governmment is no friend of the 2nd Amendment...they aren't friends with any part of the Constitution. For everyone in government, there's always some part that clashes with their agenda. It's not just the federal government, either. It goes down to state and local level as well. In all cases, it is up to US to hold politicians accountable if WE want OUR rights protected. Our vote is the ONLY true check on their power. Once we decide that it isn't important to defend a certain right, that right is lost. The 2nd and 4th amendments are as good as gone. Even on this site, how many people say \"I don't care if the government listens to my calls and reads my emails without a warrant...it's to keep me safe and I have nothing to hide\"? That's how a Constitutional right gets lost.", 
        "reply": " .......given the moronic display these liberal leaders have shown us today over the bonus issue anything is possible Already past the future", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-19 16:11:00", 
        "title": "Gun owners beware", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. REALLY? I didnt realize The FEMA Death Camp your in has Internet access............... Oh Look, its the Black Helicopters again", 
        "intTime": 20090319, 
        "postID": 14, 
        "quote": "Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real.", 
        "reply": " REALLY? I didnt realize The FEMA Death Camp your in has Internet access............... Oh Look, its the Black Helicopters again", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-19 16:40:00", 
        "title": "Gun owners beware", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. REALLY? I didnt realize The FEMA Death Camp your in has Internet access............... Oh Look, its the Black Helicopters again LOL you got talent.", 
        "intTime": 20090319, 
        "postID": 15, 
        "quote": "Originally posted by LineDoggie: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. REALLY? I didnt realize The FEMA Death Camp your in has Internet access............... Oh Look, its the Black Helicopters again", 
        "reply": " LOL you got talent.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-19 17:04:00", 
        "title": "Gun owners beware", 
        "userID": "DIABLO_OPSGRP"
    }, 
    {
        "content": "quote: Originally posted by mouse51: yea and what rights were those..name them..name a right the so called RIGHT WING HAS TAKEN AWAY FROM YOU....LETS HEAR IT... Um, the right to not getting searched without a warrant.", 
        "intTime": 20090320, 
        "postID": 16, 
        "quote": "Originally posted by mouse51: yea and what rights were those..name them..name a right the so called RIGHT WING HAS TAKEN AWAY FROM YOU....LETS HEAR IT...", 
        "reply": " Um, the right to not getting searched without a warrant.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-20 09:32:00", 
        "title": "Gun owners beware", 
        "userID": "Ruanne"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. REALLY? I didnt realize The FEMA Death Camp your in has Internet access............... Oh Look, its the Black Helicopters again Oh that's hilarious. I want it on a t-shirt.", 
        "intTime": 20090320, 
        "postID": 17, 
        "quote": "Originally posted by LineDoggie: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. REALLY? I didnt realize The FEMA Death Camp your in has Internet access............... Oh Look, its the Black Helicopters again", 
        "reply": " Oh that's hilarious. I want it on a t-shirt.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-20 09:34:00", 
        "title": "Gun owners beware", 
        "userID": "Ruanne"
    }, 
    {
        "content": "The right to bear arms is important. But so is the right to a fair trial, to not be searched without a warrant. Vigilance is required. Threats to your Constitutional rights can come from either SIDE OF THE POLITICAL DIVIDE. If you choose only to look for them from Left, or from the Right, you are half-blind. Our rights are not a given. Let's watch each other's backs, and not leave Left or Right unguarded, shall we?", 
        "intTime": 20090320, 
        "postID": 18, 
        "quote": "", 
        "reply": "The right to bear arms is important. But so is the right to a fair trial, to not be searched without a warrant. Vigilance is required. Threats to your Constitutional rights can come from either SIDE OF THE POLITICAL DIVIDE. If you choose only to look for them from Left, or from the Right, you are half-blind. Our rights are not a given. Let's watch each other's backs, and not leave Left or Right unguarded, shall we?", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-20 09:40:00", 
        "title": "Gun owners beware", 
        "userID": "Ruanne"
    }, 
    {
        "content": "Linedoggie that cartoon is great, I'm with Ruanne, I have a buddy thats prints shirts,stickers,etc....I'm gonna show him this one, I'd love to be the first one on my island sporting this cartoon, funny as hell, thanks for the laugh.", 
        "intTime": 20090320, 
        "postID": 19, 
        "quote": "", 
        "reply": "Linedoggie that cartoon is great, I'm with Ruanne, I have a buddy thats prints shirts,stickers,etc....I'm gonna show him this one, I'd love to be the first one on my island sporting this cartoon, funny as hell, thanks for the laugh.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-20 09:45:00", 
        "title": "Gun owners beware", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by Ruanne: quote: Originally posted by mouse51: yea and what rights were those..name them..name a right the so called RIGHT WING HAS TAKEN AWAY FROM YOU....LETS HEAR IT... Um, the right to not getting searched without a warrant. . Just to let you know there are only certain situations when you can be searched without a search warrant. If an officer sees you doing something and it can cause harm they can search without a warrant. If an officer were to ask you to search your car, you can say no. If there is no reason for them to do it then they can't without your permission, but people get scared and say yes search. Then they get caught. Again, there has to be a good reason for them to not issue a search warrant. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090320, 
        "postID": 20, 
        "quote": "Originally posted by Ruanne: quote: Originally posted by mouse51: yea and what rights were those..name them..name a right the so called RIGHT WING HAS TAKEN AWAY FROM YOU....LETS HEAR IT... Um, the right to not getting searched without a warrant.", 
        "reply": " . Just to let you know there are only certain situations when you can be searched without a search warrant. If an officer sees you doing something and it can cause harm they can search without a warrant. If an officer were to ask you to search your car, you can say no. If there is no reason for them to do it then they can't without your permission, but people get scared and say yes search. Then they get caught. Again, there has to be a good reason for them to not issue a search warrant. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-20 09:58:00", 
        "title": "Gun owners beware", 
        "userID": "Anbar7"
    }, 
    {
        "content": "watch the news people esp foxnews. our second amendment rights are on fire again. the gov is looking for land to incorpate into state parks protected and making it hard to hunt even. as they get the land they control the gun laws on this special land. the left or liberals will find a way to take away all our rights. gov control of everything. check this out...I have to put it in a certain way ..but try to copy and paste it into your address bar. listen closely >>http://www.youtube.com/watch?v=qQEZoknylIA.. listen and take head..also take action and copy and paste this url .. >>>http://www.gunowners.org/ean.htm... and also go here and read so I dont have to write what needs to be writen..stand up or get pushed down....dont be the quiet majority...click below and read...remember we are fighting for the rights we have in other countries...we dont want to become like them.. >>>>http://www.gunowners.org<<<<<<<<<<<<< copy and paste...then listen and or read..and then join in the fight to defend our rights..stop being the quiet majority...God bless America..", 
        "intTime": 20090317, 
        "postID": 21, 
        "quote": "", 
        "reply": "watch the news people esp foxnews. our second amendment rights are on fire again. the gov is looking for land to incorpate into state parks protected and making it hard to hunt even. as they get the land they control the gun laws on this special land. the left or liberals will find a way to take away all our rights. gov control of everything. check this out...I have to put it in a certain way ..but try to copy and paste it into your address bar. listen closely >>http://www.youtube.com/watch?v=qQEZoknylIA.. listen and take head..also take action and copy and paste this url .. >>>http://www.gunowners.org/ean.htm... and also go here and read so I dont have to write what needs to be writen..stand up or get pushed down....dont be the quiet majority...click below and read...remember we are fighting for the rights we have in other countries...we dont want to become like them.. >>>>http://www.gunowners.org<<<<<<<<<<<<< copy and paste...then listen and or read..and then join in the fight to defend our rights..stop being the quiet majority...God bless America..", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-17 12:40:00", 
        "title": "Gun owners beware", 
        "userID": "mouse51"
    }, 
    {
        "content": "I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real.", 
        "intTime": 20090317, 
        "postID": 22, 
        "quote": "", 
        "reply": "I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-17 17:38:00", 
        "title": "Gun owners beware", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "yea and what rights were those..name them..name a right the so called RIGHT WING HAS TAKEN AWAY FROM YOU....LETS HEAR IT...", 
        "intTime": 20090318, 
        "postID": 23, 
        "quote": "", 
        "reply": "yea and what rights were those..name them..name a right the so called RIGHT WING HAS TAKEN AWAY FROM YOU....LETS HEAR IT...", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-18 00:53:00", 
        "title": "Gun owners beware", 
        "userID": "mouse51"
    }, 
    {
        "content": "*cough* State parks are controlled by the states.", 
        "intTime": 20090318, 
        "postID": 24, 
        "quote": "", 
        "reply": "*cough* State parks are controlled by the states.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-18 01:04:00", 
        "title": "Gun owners beware", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. .....your right to be stupid seems intact Already past the future", 
        "intTime": 20090318, 
        "postID": 25, 
        "quote": "Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real.", 
        "reply": " .....your right to be stupid seems intact Already past the future", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-18 04:22:00", 
        "title": "Gun owners beware", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history.", 
        "intTime": 20090318, 
        "postID": 26, 
        "quote": "Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real.", 
        "reply": " 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-18 16:14:00", 
        "title": "Gun owners beware", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by RRR52: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history. The Founders thought the Right of Habeaus Corpus was the lynchpin of personal freedom. No other right is secure if you can be arrested, held without charge, and held without trial. The Founders thought it SO important that it's not an amendment - It's embedded in the very text of the orginal document. Can you protect any of your other rights, if this RIGHT is denied? The Fourth Amendment to the Constitution guarranttee's that your personal life cannot be invaded without due process of law. Now in cases of National Emergency, with the agreement of Congress, the entire Consitution can be suspened. Mr. Bush suspended the Right of Habeaus Corpus on his own say so, and suspended the Fourth Amendment on his own say so. And finally in the recent DC victory for the Second Amendment, The administration intervened in favor of the DC ban. Only after the ruling did they \"say\" they approved it. Dave", 
        "intTime": 20090318, 
        "postID": 27, 
        "quote": "Originally posted by RRR52: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history.", 
        "reply": " The Founders thought the Right of Habeaus Corpus was the lynchpin of personal freedom. No other right is secure if you can be arrested, held without charge, and held without trial. The Founders thought it SO important that it's not an amendment - It's embedded in the very text of the orginal document. Can you protect any of your other rights, if this RIGHT is denied? The Fourth Amendment to the Constitution guarranttee's that your personal life cannot be invaded without due process of law. Now in cases of National Emergency, with the agreement of Congress, the entire Consitution can be suspened. Mr. Bush suspended the Right of Habeaus Corpus on his own say so, and suspended the Fourth Amendment on his own say so. And finally in the recent DC victory for the Second Amendment, The administration intervened in favor of the DC ban. Only after the ruling did they \"say\" they approved it. Dave", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-18 16:23:00", 
        "title": "Gun owners beware", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by RRR52: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history. The Founders thought the Right of Habeaus Corpus was the lynchpin of personal freedom. No other right is secure if you can be arrested, held without charge, and held without trial. The Founders thought it SO important that it's not an amendment - It's embedded in the very text of the orginal document. Can you protect any of your other rights, if this RIGHT is denied? The Fourth Amendment to the Constitution guarranttee's that your personal life cannot be invaded without due process of law. Now in cases of National Emergency, with the agreement of Congress, the entire Consitution can be suspened. Mr. Bush suspended the Right of Habeaus Corpus on his own say so, and suspended the Fourth Amendment on his own say so. And finally in the recent DC victory for the Second Amendment, The administration intervened in favor of the DC ban. Only after the ruling did they \"say\" they approved it. Dave But, But, But, GW was just doing that to protect us.", 
        "intTime": 20090318, 
        "postID": 28, 
        "quote": "Originally posted by Grachus: quote: Originally posted by RRR52: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history. The Founders thought the Right of Habeaus Corpus was the lynchpin of personal freedom. No other right is secure if you can be arrested, held without charge, and held without trial. The Founders thought it SO important that it's not an amendment - It's embedded in the very text of the orginal document. Can you protect any of your other rights, if this RIGHT is denied? The Fourth Amendment to the Constitution guarranttee's that your personal life cannot be invaded without due process of law. Now in cases of National Emergency, with the agreement of Congress, the entire Consitution can be suspened. Mr. Bush suspended the Right of Habeaus Corpus on his own say so, and suspended the Fourth Amendment on his own say so. And finally in the recent DC victory for the Second Amendment, The administration intervened in favor of the DC ban. Only after the ruling did they \"say\" they approved it. Dave", 
        "reply": " But, But, But, GW was just doing that to protect us.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-18 16:40:00", 
        "title": "Gun owners beware", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "Seems like it always starts out as a \"rumor\", then, Bam it's the law. Should have been paying attention to that stuff last year. Too late. Yes, beware and AWARE.", 
        "intTime": 20090318, 
        "postID": 29, 
        "quote": "", 
        "reply": "Seems like it always starts out as a \"rumor\", then, Bam it's the law. Should have been paying attention to that stuff last year. Too late. Yes, beware and AWARE.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-18 18:22:00", 
        "title": "Gun owners beware", 
        "userID": "MSGCAVALRY"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: quote: Originally posted by Grachus: quote: Originally posted by RRR52: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history. The Founders thought the Right of Habeaus Corpus was the lynchpin of personal freedom. No other right is secure if you can be arrested, held without charge, and held without trial. The Founders thought it SO important that it's not an amendment - It's embedded in the very text of the orginal document. Can you protect any of your other rights, if this RIGHT is denied? The Fourth Amendment to the Constitution guarranttee's that your personal life cannot be invaded without due process of law. Now in cases of National Emergency, with the agreement of Congress, the entire Consitution can be suspened. Mr. Bush suspended the Right of Habeaus Corpus on his own say so, and suspended the Fourth Amendment on his own say so. And finally in the recent DC victory for the Second Amendment, The administration intervened in favor of the DC ban. Only after the ruling did they \"say\" they approved it. Dave But, But, But, GW was just doing that to protect us. Same reason that Obama will use to attack the 2nd amendment. Whichever party in in control, the federal governmment is no friend of the 2nd Amendment...they aren't friends with any part of the Constitution. For everyone in government, there's always some part that clashes with their agenda. It's not just the federal government, either. It goes down to state and local level as well. In all cases, it is up to US to hold politicians accountable if WE want OUR rights protected. Our vote is the ONLY true check on their power. Once we decide that it isn't important to defend a certain right, that right is lost. The 2nd and 4th amendments are as good as gone. Even on this site, how many people say \"I don't care if the government listens to my calls and reads my emails without a warrant...it's to keep me safe and I have nothing to hide\"? That's how a Constitutional right gets lost.", 
        "intTime": 20090319, 
        "postID": 30, 
        "quote": "Originally posted by jdksfcret: quote: Originally posted by Grachus: quote: Originally posted by RRR52: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history. The Founders thought the Right of Habeaus Corpus was the lynchpin of personal freedom. No other right is secure if you can be arrested, held without charge, and held without trial. The Founders thought it SO important that it's not an amendment - It's embedded in the very text of the orginal document. Can you protect any of your other rights, if this RIGHT is denied? The Fourth Amendment to the Constitution guarranttee's that your personal life cannot be invaded without due process of law. Now in cases of National Emergency, with the agreement of Congress, the entire Consitution can be suspened. Mr. Bush suspended the Right of Habeaus Corpus on his own say so, and suspended the Fourth Amendment on his own say so. And finally in the recent DC victory for the Second Amendment, The administration intervened in favor of the DC ban. Only after the ruling did they \"say\" they approved it. Dave But, But, But, GW was just doing that to protect us.", 
        "reply": " Same reason that Obama will use to attack the 2nd amendment. Whichever party in in control, the federal governmment is no friend of the 2nd Amendment...they aren't friends with any part of the Constitution. For everyone in government, there's always some part that clashes with their agenda. It's not just the federal government, either. It goes down to state and local level as well. In all cases, it is up to US to hold politicians accountable if WE want OUR rights protected. Our vote is the ONLY true check on their power. Once we decide that it isn't important to defend a certain right, that right is lost. The 2nd and 4th amendments are as good as gone. Even on this site, how many people say \"I don't care if the government listens to my calls and reads my emails without a warrant...it's to keep me safe and I have nothing to hide\"? That's how a Constitutional right gets lost.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-19 11:34:00", 
        "title": "Gun owners beware", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: Same reason that Obama will use to attack the 2nd amendment. Whichever party in in control, the federal governmment is no friend of the 2nd Amendment...they aren't friends with any part of the Constitution. For everyone in government, there's always some part that clashes with their agenda. It's not just the federal government, either. It goes down to state and local level as well. In all cases, it is up to US to hold politicians accountable if WE want OUR rights protected. Our vote is the ONLY true check on their power. Once we decide that it isn't important to defend a certain right, that right is lost. The 2nd and 4th amendments are as good as gone. Even on this site, how many people say \"I don't care if the government listens to my calls and reads my emails without a warrant...it's to keep me safe and I have nothing to hide\"? That's how a Constitutional right gets lost. Spot on - I agree. In all fairness to politicians it is completely natural to want to have power. It's far easier to defend a right that has not been lost than to reclaim one that has. When Reagan started to use signing statements, instead of vetos, it was no big thing - He hardly used it. And then Bush I and then Clinton, and then Bush II vetoed 150 laws with a simple signing statement. And Obama has already vetoes laws with a signing statement. Obama, unlike Mr. Bush is vulnerable on this and other matters. The majority of Democrats will back taking these usururped powers that Presidents have been accumulating. And since the Republicans are now the opposition, if they join with the Democrats, perhaps we can go back to the Constitution while we still have a chance. Dave", 
        "intTime": 20090319, 
        "postID": 31, 
        "quote": "Originally posted by jwr6: Same reason that Obama will use to attack the 2nd amendment. Whichever party in in control, the federal governmment is no friend of the 2nd Amendment...they aren't friends with any part of the Constitution. For everyone in government, there's always some part that clashes with their agenda. It's not just the federal government, either. It goes down to state and local level as well. In all cases, it is up to US to hold politicians accountable if WE want OUR rights protected. Our vote is the ONLY true check on their power. Once we decide that it isn't important to defend a certain right, that right is lost. The 2nd and 4th amendments are as good as gone. Even on this site, how many people say \"I don't care if the government listens to my calls and reads my emails without a warrant...it's to keep me safe and I have nothing to hide\"? That's how a Constitutional right gets lost.", 
        "reply": " Spot on - I agree. In all fairness to politicians it is completely natural to want to have power. It's far easier to defend a right that has not been lost than to reclaim one that has. When Reagan started to use signing statements, instead of vetos, it was no big thing - He hardly used it. And then Bush I and then Clinton, and then Bush II vetoed 150 laws with a simple signing statement. And Obama has already vetoes laws with a signing statement. Obama, unlike Mr. Bush is vulnerable on this and other matters. The majority of Democrats will back taking these usururped powers that Presidents have been accumulating. And since the Republicans are now the opposition, if they join with the Democrats, perhaps we can go back to the Constitution while we still have a chance. Dave", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-19 15:37:00", 
        "title": "Gun owners beware", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by 6486143: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. .....your right to be stupid seems intact LOL", 
        "intTime": 20090319, 
        "postID": 32, 
        "quote": "Originally posted by 6486143: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. .....your right to be stupid seems intact", 
        "reply": " LOL", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-19 16:08:00", 
        "title": "Gun owners beware", 
        "userID": "DIABLO_OPSGRP"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by jdksfcret: quote: Originally posted by Grachus: quote: Originally posted by RRR52: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history. The Founders thought the Right of Habeaus Corpus was the lynchpin of personal freedom. No other right is secure if you can be arrested, held without charge, and held without trial. The Founders thought it SO important that it's not an amendment - It's embedded in the very text of the orginal document. Can you protect any of your other rights, if this RIGHT is denied? The Fourth Amendment to the Constitution guarranttee's that your personal life cannot be invaded without due process of law. Now in cases of National Emergency, with the agreement of Congress, the entire Consitution can be suspened. Mr. Bush suspended the Right of Habeaus Corpus on his own say so, and suspended the Fourth Amendment on his own say so. And finally in the recent DC victory for the Second Amendment, The administration intervened in favor of the DC ban. Only after the ruling did they \"say\" they approved it. Dave But, But, But, GW was just doing that to protect us. Same reason that Obama will use to attack the 2nd amendment. Whichever party in in control, the federal governmment is no friend of the 2nd Amendment...they aren't friends with any part of the Constitution. For everyone in government, there's always some part that clashes with their agenda. It's not just the federal government, either. It goes down to state and local level as well. In all cases, it is up to US to hold politicians accountable if WE want OUR rights protected. Our vote is the ONLY true check on their power. Once we decide that it isn't important to defend a certain right, that right is lost. The 2nd and 4th amendments are as good as gone. Even on this site, how many people say \"I don't care if the government listens to my calls and reads my emails without a warrant...it's to keep me safe and I have nothing to hide\"? That's how a Constitutional right gets lost. .......given the moronic display these liberal leaders have shown us today over the bonus issue anything is possible Already past the future", 
        "intTime": 20090319, 
        "postID": 33, 
        "quote": "Originally posted by jwr6: quote: Originally posted by jdksfcret: quote: Originally posted by Grachus: quote: Originally posted by RRR52: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. 1. Nothing you state shows any corroboration for your statement, just some alleged generality. Exactly what is it that was directed within the former administration without Congressional approval that directly threatened your Constitutional rights, where you can show that your Constitutional rights were curtailed? 2. Nothing about any prior administration taking or being said to have taken anyone's rights does a damn to justify this perverse, leftist insecurity and conceit reflected in the neverending quest of the obamanites to destroy independent, free citizens to instead create subjects by curtailing the right of The People to keep and bear arms. The attack on the Second Amendment, the linchpin of the Bill of Rights, is invidious and parallels the path of control freak activity of the worst regimes in world history. The Founders thought the Right of Habeaus Corpus was the lynchpin of personal freedom. No other right is secure if you can be arrested, held without charge, and held without trial. The Founders thought it SO important that it's not an amendment - It's embedded in the very text of the orginal document. Can you protect any of your other rights, if this RIGHT is denied? The Fourth Amendment to the Constitution guarranttee's that your personal life cannot be invaded without due process of law. Now in cases of National Emergency, with the agreement of Congress, the entire Consitution can be suspened. Mr. Bush suspended the Right of Habeaus Corpus on his own say so, and suspended the Fourth Amendment on his own say so. And finally in the recent DC victory for the Second Amendment, The administration intervened in favor of the DC ban. Only after the ruling did they \"say\" they approved it. Dave But, But, But, GW was just doing that to protect us. Same reason that Obama will use to attack the 2nd amendment. Whichever party in in control, the federal governmment is no friend of the 2nd Amendment...they aren't friends with any part of the Constitution. For everyone in government, there's always some part that clashes with their agenda. It's not just the federal government, either. It goes down to state and local level as well. In all cases, it is up to US to hold politicians accountable if WE want OUR rights protected. Our vote is the ONLY true check on their power. Once we decide that it isn't important to defend a certain right, that right is lost. The 2nd and 4th amendments are as good as gone. Even on this site, how many people say \"I don't care if the government listens to my calls and reads my emails without a warrant...it's to keep me safe and I have nothing to hide\"? That's how a Constitutional right gets lost.", 
        "reply": " .......given the moronic display these liberal leaders have shown us today over the bonus issue anything is possible Already past the future", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-19 16:11:00", 
        "title": "Gun owners beware", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. REALLY? I didnt realize The FEMA Death Camp your in has Internet access............... Oh Look, its the Black Helicopters again", 
        "intTime": 20090319, 
        "postID": 34, 
        "quote": "Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real.", 
        "reply": " REALLY? I didnt realize The FEMA Death Camp your in has Internet access............... Oh Look, its the Black Helicopters again", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-19 16:40:00", 
        "title": "Gun owners beware", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. REALLY? I didnt realize The FEMA Death Camp your in has Internet access............... Oh Look, its the Black Helicopters again LOL you got talent.", 
        "intTime": 20090319, 
        "postID": 35, 
        "quote": "Originally posted by LineDoggie: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. REALLY? I didnt realize The FEMA Death Camp your in has Internet access............... Oh Look, its the Black Helicopters again", 
        "reply": " LOL you got talent.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-19 17:04:00", 
        "title": "Gun owners beware", 
        "userID": "DIABLO_OPSGRP"
    }, 
    {
        "content": "quote: Originally posted by mouse51: yea and what rights were those..name them..name a right the so called RIGHT WING HAS TAKEN AWAY FROM YOU....LETS HEAR IT... Um, the right to not getting searched without a warrant.", 
        "intTime": 20090320, 
        "postID": 36, 
        "quote": "Originally posted by mouse51: yea and what rights were those..name them..name a right the so called RIGHT WING HAS TAKEN AWAY FROM YOU....LETS HEAR IT...", 
        "reply": " Um, the right to not getting searched without a warrant.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-20 09:32:00", 
        "title": "Gun owners beware", 
        "userID": "Ruanne"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. REALLY? I didnt realize The FEMA Death Camp your in has Internet access............... Oh Look, its the Black Helicopters again Oh that's hilarious. I want it on a t-shirt.", 
        "intTime": 20090320, 
        "postID": 37, 
        "quote": "Originally posted by LineDoggie: quote: Originally posted by crackerjacks61: I have a secret for you. The RIGHT has done a great job at taking my rights away already. Guess I'll have to lookat the UP one day to get it all back for me...get real. REALLY? I didnt realize The FEMA Death Camp your in has Internet access............... Oh Look, its the Black Helicopters again", 
        "reply": " Oh that's hilarious. I want it on a t-shirt.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-20 09:34:00", 
        "title": "Gun owners beware", 
        "userID": "Ruanne"
    }, 
    {
        "content": "The right to bear arms is important. But so is the right to a fair trial, to not be searched without a warrant. Vigilance is required. Threats to your Constitutional rights can come from either SIDE OF THE POLITICAL DIVIDE. If you choose only to look for them from Left, or from the Right, you are half-blind. Our rights are not a given. Let's watch each other's backs, and not leave Left or Right unguarded, shall we?", 
        "intTime": 20090320, 
        "postID": 38, 
        "quote": "", 
        "reply": "The right to bear arms is important. But so is the right to a fair trial, to not be searched without a warrant. Vigilance is required. Threats to your Constitutional rights can come from either SIDE OF THE POLITICAL DIVIDE. If you choose only to look for them from Left, or from the Right, you are half-blind. Our rights are not a given. Let's watch each other's backs, and not leave Left or Right unguarded, shall we?", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-20 09:40:00", 
        "title": "Gun owners beware", 
        "userID": "Ruanne"
    }, 
    {
        "content": "Linedoggie that cartoon is great, I'm with Ruanne, I have a buddy thats prints shirts,stickers,etc....I'm gonna show him this one, I'd love to be the first one on my island sporting this cartoon, funny as hell, thanks for the laugh.", 
        "intTime": 20090320, 
        "postID": 39, 
        "quote": "", 
        "reply": "Linedoggie that cartoon is great, I'm with Ruanne, I have a buddy thats prints shirts,stickers,etc....I'm gonna show him this one, I'd love to be the first one on my island sporting this cartoon, funny as hell, thanks for the laugh.", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-20 09:45:00", 
        "title": "Gun owners beware", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by Ruanne: quote: Originally posted by mouse51: yea and what rights were those..name them..name a right the so called RIGHT WING HAS TAKEN AWAY FROM YOU....LETS HEAR IT... Um, the right to not getting searched without a warrant. . Just to let you know there are only certain situations when you can be searched without a search warrant. If an officer sees you doing something and it can cause harm they can search without a warrant. If an officer were to ask you to search your car, you can say no. If there is no reason for them to do it then they can't without your permission, but people get scared and say yes search. Then they get caught. Again, there has to be a good reason for them to not issue a search warrant. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090320, 
        "postID": 40, 
        "quote": "Originally posted by Ruanne: quote: Originally posted by mouse51: yea and what rights were those..name them..name a right the so called RIGHT WING HAS TAKEN AWAY FROM YOU....LETS HEAR IT... Um, the right to not getting searched without a warrant.", 
        "reply": " . Just to let you know there are only certain situations when you can be searched without a search warrant. If an officer sees you doing something and it can cause harm they can search without a warrant. If an officer were to ask you to search your car, you can say no. If there is no reason for them to do it then they can't without your permission, but people get scared and say yes search. Then they get caught. Again, there has to be a good reason for them to not issue a search warrant. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4010021812001", 
        "time": "2009-03-20 09:58:00", 
        "title": "Gun owners beware", 
        "userID": "Anbar7"
    }
]