[
    {
        "content": "The Justice Department was considering whether to bring a detained Somali pirate to the U.S., Kenya or Somalia to face charges after the harrowing rescue of a cargo ship's U.S. captain. The FBI was preparing a case Monday, one of three possible options in what to do with the captured pirate. Both piracy and hostage-taking carry life sentences under U.S. law. He could also be handed over to Kenyan authorities, where other pirates have been convicted in the past, or sent back to Somalia. Somali media were identifying the pirate as 16-year-old Mohamed Abdi, according to the Somali Justice Advocacy Center in St. Paul, Minn. But a Justice Department official told FOX News that authorities have been unable to nail down exactly how old the pirate is as other reports indicated he is as young as 14. more here: \"http://www.foxnews.com/story/0,2933,514840,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090413, 
        "postID": 1, 
        "quote": "", 
        "reply": "The Justice Department was considering whether to bring a detained Somali pirate to the U.S., Kenya or Somalia to face charges after the harrowing rescue of a cargo ship's U.S. captain. The FBI was preparing a case Monday, one of three possible options in what to do with the captured pirate. Both piracy and hostage-taking carry life sentences under U.S. law. He could also be handed over to Kenyan authorities, where other pirates have been convicted in the past, or sent back to Somalia. Somali media were identifying the pirate as 16-year-old Mohamed Abdi, according to the Somali Justice Advocacy Center in St. Paul, Minn. But a Justice Department official told FOX News that authorities have been unable to nail down exactly how old the pirate is as other reports indicated he is as young as 14. more here: \"http://www.foxnews.com/story/0,2933,514840,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 10:02:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090413, 
        "postID": 2, 
        "quote": "", 
        "reply": "If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 10:07:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know. He can be tried as an adult in the US under federal Law. His was a major crime.", 
        "intTime": 20090413, 
        "postID": 3, 
        "quote": "Originally posted by Anbar7: If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know.", 
        "reply": " He can be tried as an adult in the US under federal Law. His was a major crime.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 10:16:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "If Kenya or Somalia is willing to try him, let them. No need in bring the little idiot to the US where he will get more exposure than he deserves and where it will be the US on trial under the scrutiny of everyone who has a microphone on how we treat the poor misunderstood Somalai youth who has no opportunity in life - Send him to a foster home! Like we need all that crap.", 
        "intTime": 20090413, 
        "postID": 4, 
        "quote": "", 
        "reply": "If Kenya or Somalia is willing to try him, let them. No need in bring the little idiot to the US where he will get more exposure than he deserves and where it will be the US on trial under the scrutiny of everyone who has a microphone on how we treat the poor misunderstood Somalai youth who has no opportunity in life - Send him to a foster home! Like we need all that crap.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:42:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "sw614"
    }, 
    {
        "content": "Honestly, I believe the little thug should be strung up from the nearest suitable structure.. as should all pirates, regardless of age. Assuming that that just outcome is unlikely, he should be tried and punished in Somalia, his country of origin.", 
        "intTime": 20090413, 
        "postID": 5, 
        "quote": "", 
        "reply": "Honestly, I believe the little thug should be strung up from the nearest suitable structure.. as should all pirates, regardless of age. Assuming that that just outcome is unlikely, he should be tried and punished in Somalia, his country of origin.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:47:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Just heard that this pirate may be as young as 14..... we may want to rethink our positions on what is appropriate punishment... maybe giving him a chance at a \"real\" life would be the better option. An act of generosity and kindness on our part just just may well produce a leader for a leaderless country. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090413, 
        "postID": 6, 
        "quote": "", 
        "reply": "Just heard that this pirate may be as young as 14..... we may want to rethink our positions on what is appropriate punishment... maybe giving him a chance at a \"real\" life would be the better option. An act of generosity and kindness on our part just just may well produce a leader for a leaderless country. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:48:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there.", 
        "intTime": 20090413, 
        "postID": 7, 
        "quote": "", 
        "reply": "If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:48:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty", 
        "intTime": 20090413, 
        "postID": 8, 
        "quote": "Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there.", 
        "reply": " McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:53:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Take him 300 miles out to sea and drop him off in the shipping lanes, since he likes to play out there. I'm sure some sympathetic container ship will \"rescue\" him... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090413, 
        "postID": 9, 
        "quote": "", 
        "reply": "Take him 300 miles out to sea and drop him off in the shipping lanes, since he likes to play out there. I'm sure some sympathetic container ship will \"rescue\" him... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:54:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile?", 
        "intTime": 20090413, 
        "postID": 10, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty", 
        "reply": " That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile?", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:08:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile? Adult... that law is on the books as well", 
        "intTime": 20090413, 
        "postID": 11, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile?", 
        "reply": " Adult... that law is on the books as well", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:11:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile? Adult... that law is on the books as well Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released.", 
        "intTime": 20090413, 
        "postID": 12, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile? Adult... that law is on the books as well", 
        "reply": " Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:12:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Is it necessary to have a trial? Just throw him to the sharks and be over with it.", 
        "intTime": 20090413, 
        "postID": 13, 
        "quote": "", 
        "reply": "Is it necessary to have a trial? Just throw him to the sharks and be over with it.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:36:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "Try him as an adult in US court. Allow complete news coverage of the process. If a case can be proven and he is convicted lock him up with his new BFF's and forget him.", 
        "intTime": 20090413, 
        "postID": 14, 
        "quote": "", 
        "reply": "Try him as an adult in US court. Allow complete news coverage of the process. If a case can be proven and he is convicted lock him up with his new BFF's and forget him.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:45:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "tragically disappears out in the middle of the sea...", 
        "intTime": 20090413, 
        "postID": 15, 
        "quote": "", 
        "reply": "tragically disappears out in the middle of the sea...", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:51:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released. Yeah, a young man with hate in his heart... so why not take advantage of an opportunity to mold this kid into something useful and productive.... and maybe instead of a hate filled man we have someone with a vision towards the future for his country. Are you guys telling me, those of you who have said \"hang em\", \"cut off parts\", \"throw him to the sharks\" -- are you telling me you, you yourselves, are capable of doing such? This is a very young person who, it is obvious, does not know any better, has never known any better nor most likely even knows the meaning of hope - then maybe, just maybe some form of structured, secure environment for him would be the better option. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090413, 
        "postID": 16, 
        "quote": "Originally posted by mcgreer: Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released.", 
        "reply": " Yeah, a young man with hate in his heart... so why not take advantage of an opportunity to mold this kid into something useful and productive.... and maybe instead of a hate filled man we have someone with a vision towards the future for his country. Are you guys telling me, those of you who have said \"hang em\", \"cut off parts\", \"throw him to the sharks\" -- are you telling me you, you yourselves, are capable of doing such? This is a very young person who, it is obvious, does not know any better, has never known any better nor most likely even knows the meaning of hope - then maybe, just maybe some form of structured, secure environment for him would be the better option. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:52:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "FBI raids 3 Minneapolis money-transfer shops ----http://www.startribune.com/local/42695652.html", 
        "intTime": 20090413, 
        "postID": 17, 
        "quote": "", 
        "reply": "FBI raids 3 Minneapolis money-transfer shops ----http://www.startribune.com/local/42695652.html", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:54:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "As far as the pirates go, either way ss fine with me as long as they have thier day in court and the punishment fots the crime - Death for Piracy on the high seas. Now I see the some people saying it's ok to bring Pirate Terrorist to the US to be placed on trial. Man some people have GOT to quit putting on that mask that has 2 faces. It really does them no justice.", 
        "intTime": 20090413, 
        "postID": 18, 
        "quote": "", 
        "reply": "As far as the pirates go, either way ss fine with me as long as they have thier day in court and the punishment fots the crime - Death for Piracy on the high seas. Now I see the some people saying it's ok to bring Pirate Terrorist to the US to be placed on trial. Man some people have GOT to quit putting on that mask that has 2 faces. It really does them no justice.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 14:02:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave", 
        "intTime": 20090413, 
        "postID": 19, 
        "quote": "", 
        "reply": "This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 14:59:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave Terrorist are criminals. Pirates are criminals. I see no difference. A crime is a crime. That has been my entire point from day 1. Why treat someone called a \"terrorist\" different from someone called a \"pirate\" that commit the same crime? The makes no sense. \"Kids\" these days that kill deserve the same punishment. The punishment should fit the crime not the punishment should fit a persons \"label\". Dumb...really dumb.", 
        "intTime": 20090413, 
        "postID": 20, 
        "quote": "Originally posted by Grachus: This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave", 
        "reply": " Terrorist are criminals. Pirates are criminals. I see no difference. A crime is a crime. That has been my entire point from day 1. Why treat someone called a \"terrorist\" different from someone called a \"pirate\" that commit the same crime? The makes no sense. \"Kids\" these days that kill deserve the same punishment. The punishment should fit the crime not the punishment should fit a persons \"label\". Dumb...really dumb.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 15:19:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "The Justice Department was considering whether to bring a detained Somali pirate to the U.S., Kenya or Somalia to face charges after the harrowing rescue of a cargo ship's U.S. captain. The FBI was preparing a case Monday, one of three possible options in what to do with the captured pirate. Both piracy and hostage-taking carry life sentences under U.S. law. He could also be handed over to Kenyan authorities, where other pirates have been convicted in the past, or sent back to Somalia. Somali media were identifying the pirate as 16-year-old Mohamed Abdi, according to the Somali Justice Advocacy Center in St. Paul, Minn. But a Justice Department official told FOX News that authorities have been unable to nail down exactly how old the pirate is as other reports indicated he is as young as 14. more here: \"http://www.foxnews.com/story/0,2933,514840,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090413, 
        "postID": 21, 
        "quote": "", 
        "reply": "The Justice Department was considering whether to bring a detained Somali pirate to the U.S., Kenya or Somalia to face charges after the harrowing rescue of a cargo ship's U.S. captain. The FBI was preparing a case Monday, one of three possible options in what to do with the captured pirate. Both piracy and hostage-taking carry life sentences under U.S. law. He could also be handed over to Kenyan authorities, where other pirates have been convicted in the past, or sent back to Somalia. Somali media were identifying the pirate as 16-year-old Mohamed Abdi, according to the Somali Justice Advocacy Center in St. Paul, Minn. But a Justice Department official told FOX News that authorities have been unable to nail down exactly how old the pirate is as other reports indicated he is as young as 14. more here: \"http://www.foxnews.com/story/0,2933,514840,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 10:02:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090413, 
        "postID": 22, 
        "quote": "", 
        "reply": "If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 10:07:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know. He can be tried as an adult in the US under federal Law. His was a major crime.", 
        "intTime": 20090413, 
        "postID": 23, 
        "quote": "Originally posted by Anbar7: If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know.", 
        "reply": " He can be tried as an adult in the US under federal Law. His was a major crime.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 10:16:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "If Kenya or Somalia is willing to try him, let them. No need in bring the little idiot to the US where he will get more exposure than he deserves and where it will be the US on trial under the scrutiny of everyone who has a microphone on how we treat the poor misunderstood Somalai youth who has no opportunity in life - Send him to a foster home! Like we need all that crap.", 
        "intTime": 20090413, 
        "postID": 24, 
        "quote": "", 
        "reply": "If Kenya or Somalia is willing to try him, let them. No need in bring the little idiot to the US where he will get more exposure than he deserves and where it will be the US on trial under the scrutiny of everyone who has a microphone on how we treat the poor misunderstood Somalai youth who has no opportunity in life - Send him to a foster home! Like we need all that crap.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:42:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "sw614"
    }, 
    {
        "content": "Honestly, I believe the little thug should be strung up from the nearest suitable structure.. as should all pirates, regardless of age. Assuming that that just outcome is unlikely, he should be tried and punished in Somalia, his country of origin.", 
        "intTime": 20090413, 
        "postID": 25, 
        "quote": "", 
        "reply": "Honestly, I believe the little thug should be strung up from the nearest suitable structure.. as should all pirates, regardless of age. Assuming that that just outcome is unlikely, he should be tried and punished in Somalia, his country of origin.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:47:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Just heard that this pirate may be as young as 14..... we may want to rethink our positions on what is appropriate punishment... maybe giving him a chance at a \"real\" life would be the better option. An act of generosity and kindness on our part just just may well produce a leader for a leaderless country. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090413, 
        "postID": 26, 
        "quote": "", 
        "reply": "Just heard that this pirate may be as young as 14..... we may want to rethink our positions on what is appropriate punishment... maybe giving him a chance at a \"real\" life would be the better option. An act of generosity and kindness on our part just just may well produce a leader for a leaderless country. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:48:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there.", 
        "intTime": 20090413, 
        "postID": 27, 
        "quote": "", 
        "reply": "If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:48:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty", 
        "intTime": 20090413, 
        "postID": 28, 
        "quote": "Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there.", 
        "reply": " McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:53:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Take him 300 miles out to sea and drop him off in the shipping lanes, since he likes to play out there. I'm sure some sympathetic container ship will \"rescue\" him... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090413, 
        "postID": 29, 
        "quote": "", 
        "reply": "Take him 300 miles out to sea and drop him off in the shipping lanes, since he likes to play out there. I'm sure some sympathetic container ship will \"rescue\" him... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:54:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile?", 
        "intTime": 20090413, 
        "postID": 30, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty", 
        "reply": " That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile?", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:08:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile? Adult... that law is on the books as well", 
        "intTime": 20090413, 
        "postID": 31, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile?", 
        "reply": " Adult... that law is on the books as well", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:11:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile? Adult... that law is on the books as well Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released.", 
        "intTime": 20090413, 
        "postID": 32, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile? Adult... that law is on the books as well", 
        "reply": " Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:12:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Is it necessary to have a trial? Just throw him to the sharks and be over with it.", 
        "intTime": 20090413, 
        "postID": 33, 
        "quote": "", 
        "reply": "Is it necessary to have a trial? Just throw him to the sharks and be over with it.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:36:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "Try him as an adult in US court. Allow complete news coverage of the process. If a case can be proven and he is convicted lock him up with his new BFF's and forget him.", 
        "intTime": 20090413, 
        "postID": 34, 
        "quote": "", 
        "reply": "Try him as an adult in US court. Allow complete news coverage of the process. If a case can be proven and he is convicted lock him up with his new BFF's and forget him.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:45:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "tragically disappears out in the middle of the sea...", 
        "intTime": 20090413, 
        "postID": 35, 
        "quote": "", 
        "reply": "tragically disappears out in the middle of the sea...", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:51:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released. Yeah, a young man with hate in his heart... so why not take advantage of an opportunity to mold this kid into something useful and productive.... and maybe instead of a hate filled man we have someone with a vision towards the future for his country. Are you guys telling me, those of you who have said \"hang em\", \"cut off parts\", \"throw him to the sharks\" -- are you telling me you, you yourselves, are capable of doing such? This is a very young person who, it is obvious, does not know any better, has never known any better nor most likely even knows the meaning of hope - then maybe, just maybe some form of structured, secure environment for him would be the better option. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090413, 
        "postID": 36, 
        "quote": "Originally posted by mcgreer: Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released.", 
        "reply": " Yeah, a young man with hate in his heart... so why not take advantage of an opportunity to mold this kid into something useful and productive.... and maybe instead of a hate filled man we have someone with a vision towards the future for his country. Are you guys telling me, those of you who have said \"hang em\", \"cut off parts\", \"throw him to the sharks\" -- are you telling me you, you yourselves, are capable of doing such? This is a very young person who, it is obvious, does not know any better, has never known any better nor most likely even knows the meaning of hope - then maybe, just maybe some form of structured, secure environment for him would be the better option. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:52:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "FBI raids 3 Minneapolis money-transfer shops ----http://www.startribune.com/local/42695652.html", 
        "intTime": 20090413, 
        "postID": 37, 
        "quote": "", 
        "reply": "FBI raids 3 Minneapolis money-transfer shops ----http://www.startribune.com/local/42695652.html", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:54:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "As far as the pirates go, either way ss fine with me as long as they have thier day in court and the punishment fots the crime - Death for Piracy on the high seas. Now I see the some people saying it's ok to bring Pirate Terrorist to the US to be placed on trial. Man some people have GOT to quit putting on that mask that has 2 faces. It really does them no justice.", 
        "intTime": 20090413, 
        "postID": 38, 
        "quote": "", 
        "reply": "As far as the pirates go, either way ss fine with me as long as they have thier day in court and the punishment fots the crime - Death for Piracy on the high seas. Now I see the some people saying it's ok to bring Pirate Terrorist to the US to be placed on trial. Man some people have GOT to quit putting on that mask that has 2 faces. It really does them no justice.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 14:02:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave", 
        "intTime": 20090413, 
        "postID": 39, 
        "quote": "", 
        "reply": "This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 14:59:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave Terrorist are criminals. Pirates are criminals. I see no difference. A crime is a crime. That has been my entire point from day 1. Why treat someone called a \"terrorist\" different from someone called a \"pirate\" that commit the same crime? The makes no sense. \"Kids\" these days that kill deserve the same punishment. The punishment should fit the crime not the punishment should fit a persons \"label\". Dumb...really dumb.", 
        "intTime": 20090413, 
        "postID": 40, 
        "quote": "Originally posted by Grachus: This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave", 
        "reply": " Terrorist are criminals. Pirates are criminals. I see no difference. A crime is a crime. That has been my entire point from day 1. Why treat someone called a \"terrorist\" different from someone called a \"pirate\" that commit the same crime? The makes no sense. \"Kids\" these days that kill deserve the same punishment. The punishment should fit the crime not the punishment should fit a persons \"label\". Dumb...really dumb.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 15:19:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "The Justice Department was considering whether to bring a detained Somali pirate to the U.S., Kenya or Somalia to face charges after the harrowing rescue of a cargo ship's U.S. captain. The FBI was preparing a case Monday, one of three possible options in what to do with the captured pirate. Both piracy and hostage-taking carry life sentences under U.S. law. He could also be handed over to Kenyan authorities, where other pirates have been convicted in the past, or sent back to Somalia. Somali media were identifying the pirate as 16-year-old Mohamed Abdi, according to the Somali Justice Advocacy Center in St. Paul, Minn. But a Justice Department official told FOX News that authorities have been unable to nail down exactly how old the pirate is as other reports indicated he is as young as 14. more here: \"http://www.foxnews.com/story/0,2933,514840,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090413, 
        "postID": 41, 
        "quote": "", 
        "reply": "The Justice Department was considering whether to bring a detained Somali pirate to the U.S., Kenya or Somalia to face charges after the harrowing rescue of a cargo ship's U.S. captain. The FBI was preparing a case Monday, one of three possible options in what to do with the captured pirate. Both piracy and hostage-taking carry life sentences under U.S. law. He could also be handed over to Kenyan authorities, where other pirates have been convicted in the past, or sent back to Somalia. Somali media were identifying the pirate as 16-year-old Mohamed Abdi, according to the Somali Justice Advocacy Center in St. Paul, Minn. But a Justice Department official told FOX News that authorities have been unable to nail down exactly how old the pirate is as other reports indicated he is as young as 14. more here: \"http://www.foxnews.com/story/0,2933,514840,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 10:02:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090413, 
        "postID": 42, 
        "quote": "", 
        "reply": "If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 10:07:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know. He can be tried as an adult in the US under federal Law. His was a major crime.", 
        "intTime": 20090413, 
        "postID": 43, 
        "quote": "Originally posted by Anbar7: If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know.", 
        "reply": " He can be tried as an adult in the US under federal Law. His was a major crime.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 10:16:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "If Kenya or Somalia is willing to try him, let them. No need in bring the little idiot to the US where he will get more exposure than he deserves and where it will be the US on trial under the scrutiny of everyone who has a microphone on how we treat the poor misunderstood Somalai youth who has no opportunity in life - Send him to a foster home! Like we need all that crap.", 
        "intTime": 20090413, 
        "postID": 44, 
        "quote": "", 
        "reply": "If Kenya or Somalia is willing to try him, let them. No need in bring the little idiot to the US where he will get more exposure than he deserves and where it will be the US on trial under the scrutiny of everyone who has a microphone on how we treat the poor misunderstood Somalai youth who has no opportunity in life - Send him to a foster home! Like we need all that crap.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:42:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "sw614"
    }, 
    {
        "content": "Honestly, I believe the little thug should be strung up from the nearest suitable structure.. as should all pirates, regardless of age. Assuming that that just outcome is unlikely, he should be tried and punished in Somalia, his country of origin.", 
        "intTime": 20090413, 
        "postID": 45, 
        "quote": "", 
        "reply": "Honestly, I believe the little thug should be strung up from the nearest suitable structure.. as should all pirates, regardless of age. Assuming that that just outcome is unlikely, he should be tried and punished in Somalia, his country of origin.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:47:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Just heard that this pirate may be as young as 14..... we may want to rethink our positions on what is appropriate punishment... maybe giving him a chance at a \"real\" life would be the better option. An act of generosity and kindness on our part just just may well produce a leader for a leaderless country. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090413, 
        "postID": 46, 
        "quote": "", 
        "reply": "Just heard that this pirate may be as young as 14..... we may want to rethink our positions on what is appropriate punishment... maybe giving him a chance at a \"real\" life would be the better option. An act of generosity and kindness on our part just just may well produce a leader for a leaderless country. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:48:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there.", 
        "intTime": 20090413, 
        "postID": 47, 
        "quote": "", 
        "reply": "If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:48:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty", 
        "intTime": 20090413, 
        "postID": 48, 
        "quote": "Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there.", 
        "reply": " McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:53:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Take him 300 miles out to sea and drop him off in the shipping lanes, since he likes to play out there. I'm sure some sympathetic container ship will \"rescue\" him... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090413, 
        "postID": 49, 
        "quote": "", 
        "reply": "Take him 300 miles out to sea and drop him off in the shipping lanes, since he likes to play out there. I'm sure some sympathetic container ship will \"rescue\" him... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:54:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile?", 
        "intTime": 20090413, 
        "postID": 50, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty", 
        "reply": " That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile?", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:08:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile? Adult... that law is on the books as well", 
        "intTime": 20090413, 
        "postID": 51, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile?", 
        "reply": " Adult... that law is on the books as well", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:11:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile? Adult... that law is on the books as well Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released.", 
        "intTime": 20090413, 
        "postID": 52, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile? Adult... that law is on the books as well", 
        "reply": " Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:12:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Is it necessary to have a trial? Just throw him to the sharks and be over with it.", 
        "intTime": 20090413, 
        "postID": 53, 
        "quote": "", 
        "reply": "Is it necessary to have a trial? Just throw him to the sharks and be over with it.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:36:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "Try him as an adult in US court. Allow complete news coverage of the process. If a case can be proven and he is convicted lock him up with his new BFF's and forget him.", 
        "intTime": 20090413, 
        "postID": 54, 
        "quote": "", 
        "reply": "Try him as an adult in US court. Allow complete news coverage of the process. If a case can be proven and he is convicted lock him up with his new BFF's and forget him.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:45:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "tragically disappears out in the middle of the sea...", 
        "intTime": 20090413, 
        "postID": 55, 
        "quote": "", 
        "reply": "tragically disappears out in the middle of the sea...", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:51:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released. Yeah, a young man with hate in his heart... so why not take advantage of an opportunity to mold this kid into something useful and productive.... and maybe instead of a hate filled man we have someone with a vision towards the future for his country. Are you guys telling me, those of you who have said \"hang em\", \"cut off parts\", \"throw him to the sharks\" -- are you telling me you, you yourselves, are capable of doing such? This is a very young person who, it is obvious, does not know any better, has never known any better nor most likely even knows the meaning of hope - then maybe, just maybe some form of structured, secure environment for him would be the better option. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090413, 
        "postID": 56, 
        "quote": "Originally posted by mcgreer: Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released.", 
        "reply": " Yeah, a young man with hate in his heart... so why not take advantage of an opportunity to mold this kid into something useful and productive.... and maybe instead of a hate filled man we have someone with a vision towards the future for his country. Are you guys telling me, those of you who have said \"hang em\", \"cut off parts\", \"throw him to the sharks\" -- are you telling me you, you yourselves, are capable of doing such? This is a very young person who, it is obvious, does not know any better, has never known any better nor most likely even knows the meaning of hope - then maybe, just maybe some form of structured, secure environment for him would be the better option. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:52:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "FBI raids 3 Minneapolis money-transfer shops ----http://www.startribune.com/local/42695652.html", 
        "intTime": 20090413, 
        "postID": 57, 
        "quote": "", 
        "reply": "FBI raids 3 Minneapolis money-transfer shops ----http://www.startribune.com/local/42695652.html", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:54:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "As far as the pirates go, either way ss fine with me as long as they have thier day in court and the punishment fots the crime - Death for Piracy on the high seas. Now I see the some people saying it's ok to bring Pirate Terrorist to the US to be placed on trial. Man some people have GOT to quit putting on that mask that has 2 faces. It really does them no justice.", 
        "intTime": 20090413, 
        "postID": 58, 
        "quote": "", 
        "reply": "As far as the pirates go, either way ss fine with me as long as they have thier day in court and the punishment fots the crime - Death for Piracy on the high seas. Now I see the some people saying it's ok to bring Pirate Terrorist to the US to be placed on trial. Man some people have GOT to quit putting on that mask that has 2 faces. It really does them no justice.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 14:02:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave", 
        "intTime": 20090413, 
        "postID": 59, 
        "quote": "", 
        "reply": "This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 14:59:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave Terrorist are criminals. Pirates are criminals. I see no difference. A crime is a crime. That has been my entire point from day 1. Why treat someone called a \"terrorist\" different from someone called a \"pirate\" that commit the same crime? The makes no sense. \"Kids\" these days that kill deserve the same punishment. The punishment should fit the crime not the punishment should fit a persons \"label\". Dumb...really dumb.", 
        "intTime": 20090413, 
        "postID": 60, 
        "quote": "Originally posted by Grachus: This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave", 
        "reply": " Terrorist are criminals. Pirates are criminals. I see no difference. A crime is a crime. That has been my entire point from day 1. Why treat someone called a \"terrorist\" different from someone called a \"pirate\" that commit the same crime? The makes no sense. \"Kids\" these days that kill deserve the same punishment. The punishment should fit the crime not the punishment should fit a persons \"label\". Dumb...really dumb.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 15:19:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "The Justice Department was considering whether to bring a detained Somali pirate to the U.S., Kenya or Somalia to face charges after the harrowing rescue of a cargo ship's U.S. captain. The FBI was preparing a case Monday, one of three possible options in what to do with the captured pirate. Both piracy and hostage-taking carry life sentences under U.S. law. He could also be handed over to Kenyan authorities, where other pirates have been convicted in the past, or sent back to Somalia. Somali media were identifying the pirate as 16-year-old Mohamed Abdi, according to the Somali Justice Advocacy Center in St. Paul, Minn. But a Justice Department official told FOX News that authorities have been unable to nail down exactly how old the pirate is as other reports indicated he is as young as 14. more here: \"http://www.foxnews.com/story/0,2933,514840,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090413, 
        "postID": 61, 
        "quote": "", 
        "reply": "The Justice Department was considering whether to bring a detained Somali pirate to the U.S., Kenya or Somalia to face charges after the harrowing rescue of a cargo ship's U.S. captain. The FBI was preparing a case Monday, one of three possible options in what to do with the captured pirate. Both piracy and hostage-taking carry life sentences under U.S. law. He could also be handed over to Kenyan authorities, where other pirates have been convicted in the past, or sent back to Somalia. Somali media were identifying the pirate as 16-year-old Mohamed Abdi, according to the Somali Justice Advocacy Center in St. Paul, Minn. But a Justice Department official told FOX News that authorities have been unable to nail down exactly how old the pirate is as other reports indicated he is as young as 14. more here: \"http://www.foxnews.com/story/0,2933,514840,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 10:02:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090413, 
        "postID": 62, 
        "quote": "", 
        "reply": "If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 10:07:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know. He can be tried as an adult in the US under federal Law. His was a major crime.", 
        "intTime": 20090413, 
        "postID": 63, 
        "quote": "Originally posted by Anbar7: If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know.", 
        "reply": " He can be tried as an adult in the US under federal Law. His was a major crime.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 10:16:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "If Kenya or Somalia is willing to try him, let them. No need in bring the little idiot to the US where he will get more exposure than he deserves and where it will be the US on trial under the scrutiny of everyone who has a microphone on how we treat the poor misunderstood Somalai youth who has no opportunity in life - Send him to a foster home! Like we need all that crap.", 
        "intTime": 20090413, 
        "postID": 64, 
        "quote": "", 
        "reply": "If Kenya or Somalia is willing to try him, let them. No need in bring the little idiot to the US where he will get more exposure than he deserves and where it will be the US on trial under the scrutiny of everyone who has a microphone on how we treat the poor misunderstood Somalai youth who has no opportunity in life - Send him to a foster home! Like we need all that crap.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:42:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "sw614"
    }, 
    {
        "content": "Honestly, I believe the little thug should be strung up from the nearest suitable structure.. as should all pirates, regardless of age. Assuming that that just outcome is unlikely, he should be tried and punished in Somalia, his country of origin.", 
        "intTime": 20090413, 
        "postID": 65, 
        "quote": "", 
        "reply": "Honestly, I believe the little thug should be strung up from the nearest suitable structure.. as should all pirates, regardless of age. Assuming that that just outcome is unlikely, he should be tried and punished in Somalia, his country of origin.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:47:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Just heard that this pirate may be as young as 14..... we may want to rethink our positions on what is appropriate punishment... maybe giving him a chance at a \"real\" life would be the better option. An act of generosity and kindness on our part just just may well produce a leader for a leaderless country. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090413, 
        "postID": 66, 
        "quote": "", 
        "reply": "Just heard that this pirate may be as young as 14..... we may want to rethink our positions on what is appropriate punishment... maybe giving him a chance at a \"real\" life would be the better option. An act of generosity and kindness on our part just just may well produce a leader for a leaderless country. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:48:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there.", 
        "intTime": 20090413, 
        "postID": 67, 
        "quote": "", 
        "reply": "If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:48:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty", 
        "intTime": 20090413, 
        "postID": 68, 
        "quote": "Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there.", 
        "reply": " McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:53:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Take him 300 miles out to sea and drop him off in the shipping lanes, since he likes to play out there. I'm sure some sympathetic container ship will \"rescue\" him... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090413, 
        "postID": 69, 
        "quote": "", 
        "reply": "Take him 300 miles out to sea and drop him off in the shipping lanes, since he likes to play out there. I'm sure some sympathetic container ship will \"rescue\" him... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:54:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile?", 
        "intTime": 20090413, 
        "postID": 70, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty", 
        "reply": " That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile?", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:08:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile? Adult... that law is on the books as well", 
        "intTime": 20090413, 
        "postID": 71, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile?", 
        "reply": " Adult... that law is on the books as well", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:11:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile? Adult... that law is on the books as well Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released.", 
        "intTime": 20090413, 
        "postID": 72, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile? Adult... that law is on the books as well", 
        "reply": " Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:12:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Is it necessary to have a trial? Just throw him to the sharks and be over with it.", 
        "intTime": 20090413, 
        "postID": 73, 
        "quote": "", 
        "reply": "Is it necessary to have a trial? Just throw him to the sharks and be over with it.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:36:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "Try him as an adult in US court. Allow complete news coverage of the process. If a case can be proven and he is convicted lock him up with his new BFF's and forget him.", 
        "intTime": 20090413, 
        "postID": 74, 
        "quote": "", 
        "reply": "Try him as an adult in US court. Allow complete news coverage of the process. If a case can be proven and he is convicted lock him up with his new BFF's and forget him.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:45:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "tragically disappears out in the middle of the sea...", 
        "intTime": 20090413, 
        "postID": 75, 
        "quote": "", 
        "reply": "tragically disappears out in the middle of the sea...", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:51:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released. Yeah, a young man with hate in his heart... so why not take advantage of an opportunity to mold this kid into something useful and productive.... and maybe instead of a hate filled man we have someone with a vision towards the future for his country. Are you guys telling me, those of you who have said \"hang em\", \"cut off parts\", \"throw him to the sharks\" -- are you telling me you, you yourselves, are capable of doing such? This is a very young person who, it is obvious, does not know any better, has never known any better nor most likely even knows the meaning of hope - then maybe, just maybe some form of structured, secure environment for him would be the better option. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090413, 
        "postID": 76, 
        "quote": "Originally posted by mcgreer: Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released.", 
        "reply": " Yeah, a young man with hate in his heart... so why not take advantage of an opportunity to mold this kid into something useful and productive.... and maybe instead of a hate filled man we have someone with a vision towards the future for his country. Are you guys telling me, those of you who have said \"hang em\", \"cut off parts\", \"throw him to the sharks\" -- are you telling me you, you yourselves, are capable of doing such? This is a very young person who, it is obvious, does not know any better, has never known any better nor most likely even knows the meaning of hope - then maybe, just maybe some form of structured, secure environment for him would be the better option. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:52:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "FBI raids 3 Minneapolis money-transfer shops ----http://www.startribune.com/local/42695652.html", 
        "intTime": 20090413, 
        "postID": 77, 
        "quote": "", 
        "reply": "FBI raids 3 Minneapolis money-transfer shops ----http://www.startribune.com/local/42695652.html", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:54:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "As far as the pirates go, either way ss fine with me as long as they have thier day in court and the punishment fots the crime - Death for Piracy on the high seas. Now I see the some people saying it's ok to bring Pirate Terrorist to the US to be placed on trial. Man some people have GOT to quit putting on that mask that has 2 faces. It really does them no justice.", 
        "intTime": 20090413, 
        "postID": 78, 
        "quote": "", 
        "reply": "As far as the pirates go, either way ss fine with me as long as they have thier day in court and the punishment fots the crime - Death for Piracy on the high seas. Now I see the some people saying it's ok to bring Pirate Terrorist to the US to be placed on trial. Man some people have GOT to quit putting on that mask that has 2 faces. It really does them no justice.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 14:02:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave", 
        "intTime": 20090413, 
        "postID": 79, 
        "quote": "", 
        "reply": "This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 14:59:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave Terrorist are criminals. Pirates are criminals. I see no difference. A crime is a crime. That has been my entire point from day 1. Why treat someone called a \"terrorist\" different from someone called a \"pirate\" that commit the same crime? The makes no sense. \"Kids\" these days that kill deserve the same punishment. The punishment should fit the crime not the punishment should fit a persons \"label\". Dumb...really dumb.", 
        "intTime": 20090413, 
        "postID": 80, 
        "quote": "Originally posted by Grachus: This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave", 
        "reply": " Terrorist are criminals. Pirates are criminals. I see no difference. A crime is a crime. That has been my entire point from day 1. Why treat someone called a \"terrorist\" different from someone called a \"pirate\" that commit the same crime? The makes no sense. \"Kids\" these days that kill deserve the same punishment. The punishment should fit the crime not the punishment should fit a persons \"label\". Dumb...really dumb.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 15:19:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "The Justice Department was considering whether to bring a detained Somali pirate to the U.S., Kenya or Somalia to face charges after the harrowing rescue of a cargo ship's U.S. captain. The FBI was preparing a case Monday, one of three possible options in what to do with the captured pirate. Both piracy and hostage-taking carry life sentences under U.S. law. He could also be handed over to Kenyan authorities, where other pirates have been convicted in the past, or sent back to Somalia. Somali media were identifying the pirate as 16-year-old Mohamed Abdi, according to the Somali Justice Advocacy Center in St. Paul, Minn. But a Justice Department official told FOX News that authorities have been unable to nail down exactly how old the pirate is as other reports indicated he is as young as 14. more here: \"http://www.foxnews.com/story/0,2933,514840,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090413, 
        "postID": 81, 
        "quote": "", 
        "reply": "The Justice Department was considering whether to bring a detained Somali pirate to the U.S., Kenya or Somalia to face charges after the harrowing rescue of a cargo ship's U.S. captain. The FBI was preparing a case Monday, one of three possible options in what to do with the captured pirate. Both piracy and hostage-taking carry life sentences under U.S. law. He could also be handed over to Kenyan authorities, where other pirates have been convicted in the past, or sent back to Somalia. Somali media were identifying the pirate as 16-year-old Mohamed Abdi, according to the Somali Justice Advocacy Center in St. Paul, Minn. But a Justice Department official told FOX News that authorities have been unable to nail down exactly how old the pirate is as other reports indicated he is as young as 14. more here: \"http://www.foxnews.com/story/0,2933,514840,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 10:02:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090413, 
        "postID": 82, 
        "quote": "", 
        "reply": "If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 10:07:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know. He can be tried as an adult in the US under federal Law. His was a major crime.", 
        "intTime": 20090413, 
        "postID": 83, 
        "quote": "Originally posted by Anbar7: If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know.", 
        "reply": " He can be tried as an adult in the US under federal Law. His was a major crime.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 10:16:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "If Kenya or Somalia is willing to try him, let them. No need in bring the little idiot to the US where he will get more exposure than he deserves and where it will be the US on trial under the scrutiny of everyone who has a microphone on how we treat the poor misunderstood Somalai youth who has no opportunity in life - Send him to a foster home! Like we need all that crap.", 
        "intTime": 20090413, 
        "postID": 84, 
        "quote": "", 
        "reply": "If Kenya or Somalia is willing to try him, let them. No need in bring the little idiot to the US where he will get more exposure than he deserves and where it will be the US on trial under the scrutiny of everyone who has a microphone on how we treat the poor misunderstood Somalai youth who has no opportunity in life - Send him to a foster home! Like we need all that crap.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:42:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "sw614"
    }, 
    {
        "content": "Honestly, I believe the little thug should be strung up from the nearest suitable structure.. as should all pirates, regardless of age. Assuming that that just outcome is unlikely, he should be tried and punished in Somalia, his country of origin.", 
        "intTime": 20090413, 
        "postID": 85, 
        "quote": "", 
        "reply": "Honestly, I believe the little thug should be strung up from the nearest suitable structure.. as should all pirates, regardless of age. Assuming that that just outcome is unlikely, he should be tried and punished in Somalia, his country of origin.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:47:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Just heard that this pirate may be as young as 14..... we may want to rethink our positions on what is appropriate punishment... maybe giving him a chance at a \"real\" life would be the better option. An act of generosity and kindness on our part just just may well produce a leader for a leaderless country. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090413, 
        "postID": 86, 
        "quote": "", 
        "reply": "Just heard that this pirate may be as young as 14..... we may want to rethink our positions on what is appropriate punishment... maybe giving him a chance at a \"real\" life would be the better option. An act of generosity and kindness on our part just just may well produce a leader for a leaderless country. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:48:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there.", 
        "intTime": 20090413, 
        "postID": 87, 
        "quote": "", 
        "reply": "If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:48:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty", 
        "intTime": 20090413, 
        "postID": 88, 
        "quote": "Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there.", 
        "reply": " McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:53:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Take him 300 miles out to sea and drop him off in the shipping lanes, since he likes to play out there. I'm sure some sympathetic container ship will \"rescue\" him... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090413, 
        "postID": 89, 
        "quote": "", 
        "reply": "Take him 300 miles out to sea and drop him off in the shipping lanes, since he likes to play out there. I'm sure some sympathetic container ship will \"rescue\" him... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:54:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile?", 
        "intTime": 20090413, 
        "postID": 90, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty", 
        "reply": " That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile?", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:08:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile? Adult... that law is on the books as well", 
        "intTime": 20090413, 
        "postID": 91, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile?", 
        "reply": " Adult... that law is on the books as well", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:11:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile? Adult... that law is on the books as well Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released.", 
        "intTime": 20090413, 
        "postID": 92, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile? Adult... that law is on the books as well", 
        "reply": " Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:12:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Is it necessary to have a trial? Just throw him to the sharks and be over with it.", 
        "intTime": 20090413, 
        "postID": 93, 
        "quote": "", 
        "reply": "Is it necessary to have a trial? Just throw him to the sharks and be over with it.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:36:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "Try him as an adult in US court. Allow complete news coverage of the process. If a case can be proven and he is convicted lock him up with his new BFF's and forget him.", 
        "intTime": 20090413, 
        "postID": 94, 
        "quote": "", 
        "reply": "Try him as an adult in US court. Allow complete news coverage of the process. If a case can be proven and he is convicted lock him up with his new BFF's and forget him.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:45:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "tragically disappears out in the middle of the sea...", 
        "intTime": 20090413, 
        "postID": 95, 
        "quote": "", 
        "reply": "tragically disappears out in the middle of the sea...", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:51:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released. Yeah, a young man with hate in his heart... so why not take advantage of an opportunity to mold this kid into something useful and productive.... and maybe instead of a hate filled man we have someone with a vision towards the future for his country. Are you guys telling me, those of you who have said \"hang em\", \"cut off parts\", \"throw him to the sharks\" -- are you telling me you, you yourselves, are capable of doing such? This is a very young person who, it is obvious, does not know any better, has never known any better nor most likely even knows the meaning of hope - then maybe, just maybe some form of structured, secure environment for him would be the better option. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090413, 
        "postID": 96, 
        "quote": "Originally posted by mcgreer: Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released.", 
        "reply": " Yeah, a young man with hate in his heart... so why not take advantage of an opportunity to mold this kid into something useful and productive.... and maybe instead of a hate filled man we have someone with a vision towards the future for his country. Are you guys telling me, those of you who have said \"hang em\", \"cut off parts\", \"throw him to the sharks\" -- are you telling me you, you yourselves, are capable of doing such? This is a very young person who, it is obvious, does not know any better, has never known any better nor most likely even knows the meaning of hope - then maybe, just maybe some form of structured, secure environment for him would be the better option. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:52:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "FBI raids 3 Minneapolis money-transfer shops ----http://www.startribune.com/local/42695652.html", 
        "intTime": 20090413, 
        "postID": 97, 
        "quote": "", 
        "reply": "FBI raids 3 Minneapolis money-transfer shops ----http://www.startribune.com/local/42695652.html", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:54:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "As far as the pirates go, either way ss fine with me as long as they have thier day in court and the punishment fots the crime - Death for Piracy on the high seas. Now I see the some people saying it's ok to bring Pirate Terrorist to the US to be placed on trial. Man some people have GOT to quit putting on that mask that has 2 faces. It really does them no justice.", 
        "intTime": 20090413, 
        "postID": 98, 
        "quote": "", 
        "reply": "As far as the pirates go, either way ss fine with me as long as they have thier day in court and the punishment fots the crime - Death for Piracy on the high seas. Now I see the some people saying it's ok to bring Pirate Terrorist to the US to be placed on trial. Man some people have GOT to quit putting on that mask that has 2 faces. It really does them no justice.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 14:02:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave", 
        "intTime": 20090413, 
        "postID": 99, 
        "quote": "", 
        "reply": "This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 14:59:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave Terrorist are criminals. Pirates are criminals. I see no difference. A crime is a crime. That has been my entire point from day 1. Why treat someone called a \"terrorist\" different from someone called a \"pirate\" that commit the same crime? The makes no sense. \"Kids\" these days that kill deserve the same punishment. The punishment should fit the crime not the punishment should fit a persons \"label\". Dumb...really dumb.", 
        "intTime": 20090413, 
        "postID": 100, 
        "quote": "Originally posted by Grachus: This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave", 
        "reply": " Terrorist are criminals. Pirates are criminals. I see no difference. A crime is a crime. That has been my entire point from day 1. Why treat someone called a \"terrorist\" different from someone called a \"pirate\" that commit the same crime? The makes no sense. \"Kids\" these days that kill deserve the same punishment. The punishment should fit the crime not the punishment should fit a persons \"label\". Dumb...really dumb.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 15:19:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "The Justice Department was considering whether to bring a detained Somali pirate to the U.S., Kenya or Somalia to face charges after the harrowing rescue of a cargo ship's U.S. captain. The FBI was preparing a case Monday, one of three possible options in what to do with the captured pirate. Both piracy and hostage-taking carry life sentences under U.S. law. He could also be handed over to Kenyan authorities, where other pirates have been convicted in the past, or sent back to Somalia. Somali media were identifying the pirate as 16-year-old Mohamed Abdi, according to the Somali Justice Advocacy Center in St. Paul, Minn. But a Justice Department official told FOX News that authorities have been unable to nail down exactly how old the pirate is as other reports indicated he is as young as 14. more here: \"http://www.foxnews.com/story/0,2933,514840,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090413, 
        "postID": 101, 
        "quote": "", 
        "reply": "The Justice Department was considering whether to bring a detained Somali pirate to the U.S., Kenya or Somalia to face charges after the harrowing rescue of a cargo ship's U.S. captain. The FBI was preparing a case Monday, one of three possible options in what to do with the captured pirate. Both piracy and hostage-taking carry life sentences under U.S. law. He could also be handed over to Kenyan authorities, where other pirates have been convicted in the past, or sent back to Somalia. Somali media were identifying the pirate as 16-year-old Mohamed Abdi, according to the Somali Justice Advocacy Center in St. Paul, Minn. But a Justice Department official told FOX News that authorities have been unable to nail down exactly how old the pirate is as other reports indicated he is as young as 14. more here: \"http://www.foxnews.com/story/0,2933,514840,00.html\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 10:02:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090413, 
        "postID": 102, 
        "quote": "", 
        "reply": "If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 10:07:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know. He can be tried as an adult in the US under federal Law. His was a major crime.", 
        "intTime": 20090413, 
        "postID": 103, 
        "quote": "Originally posted by Anbar7: If we bring him to the U.S. then he will be subject to our laws, but if that happens and he is only 14-16 years old...will he be tried as an adult? If we let him get tried in Somalia he will probably be killed. Kenya, I don't know.", 
        "reply": " He can be tried as an adult in the US under federal Law. His was a major crime.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 10:16:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "If Kenya or Somalia is willing to try him, let them. No need in bring the little idiot to the US where he will get more exposure than he deserves and where it will be the US on trial under the scrutiny of everyone who has a microphone on how we treat the poor misunderstood Somalai youth who has no opportunity in life - Send him to a foster home! Like we need all that crap.", 
        "intTime": 20090413, 
        "postID": 104, 
        "quote": "", 
        "reply": "If Kenya or Somalia is willing to try him, let them. No need in bring the little idiot to the US where he will get more exposure than he deserves and where it will be the US on trial under the scrutiny of everyone who has a microphone on how we treat the poor misunderstood Somalai youth who has no opportunity in life - Send him to a foster home! Like we need all that crap.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:42:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "sw614"
    }, 
    {
        "content": "Honestly, I believe the little thug should be strung up from the nearest suitable structure.. as should all pirates, regardless of age. Assuming that that just outcome is unlikely, he should be tried and punished in Somalia, his country of origin.", 
        "intTime": 20090413, 
        "postID": 105, 
        "quote": "", 
        "reply": "Honestly, I believe the little thug should be strung up from the nearest suitable structure.. as should all pirates, regardless of age. Assuming that that just outcome is unlikely, he should be tried and punished in Somalia, his country of origin.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:47:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "Just heard that this pirate may be as young as 14..... we may want to rethink our positions on what is appropriate punishment... maybe giving him a chance at a \"real\" life would be the better option. An act of generosity and kindness on our part just just may well produce a leader for a leaderless country. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090413, 
        "postID": 106, 
        "quote": "", 
        "reply": "Just heard that this pirate may be as young as 14..... we may want to rethink our positions on what is appropriate punishment... maybe giving him a chance at a \"real\" life would be the better option. An act of generosity and kindness on our part just just may well produce a leader for a leaderless country. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:48:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there.", 
        "intTime": 20090413, 
        "postID": 107, 
        "quote": "", 
        "reply": "If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:48:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty", 
        "intTime": 20090413, 
        "postID": 108, 
        "quote": "Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there.", 
        "reply": " McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:53:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Take him 300 miles out to sea and drop him off in the shipping lanes, since he likes to play out there. I'm sure some sympathetic container ship will \"rescue\" him... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090413, 
        "postID": 109, 
        "quote": "", 
        "reply": "Take him 300 miles out to sea and drop him off in the shipping lanes, since he likes to play out there. I'm sure some sympathetic container ship will \"rescue\" him... Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 12:54:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile?", 
        "intTime": 20090413, 
        "postID": 110, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty", 
        "reply": " That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile?", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:08:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile? Adult... that law is on the books as well", 
        "intTime": 20090413, 
        "postID": 111, 
        "quote": "Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile?", 
        "reply": " Adult... that law is on the books as well", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:11:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile? Adult... that law is on the books as well Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released.", 
        "intTime": 20090413, 
        "postID": 112, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by mcgreer: quote: Originally posted by ArtMarsh: quote: Originally posted by mcgreer: If he's Somali, what are the charges against him in Kenya? He won't receive any kind of trial in Somalia. Give him to the wrong tribal elder, and it's Goodbye, Kid. There's no point in bringing him here. We can't even decide what to do about the people at GTMO. I'd send him back to Somalia and let him fend for himself. He's doing that anyway; he will likely join up with some other land-based armed group and meet his end there. McGreer, unlike at Gitmo there are established laws on the books for high seas piracy and a history of the US trials on such. maximum sentence is life imprisonment if found guilty. No matter what the circumstances are... he was a pirate illegally on a ship in the attempt to capture and hold for ransom the same. He would be found guilty That's right - but, when we bring him to America, he's a 14 year-old. How do we try him: adult or juvenile? Adult... that law is on the books as well", 
        "reply": " Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:12:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "mcgreer"
    }, 
    {
        "content": "Is it necessary to have a trial? Just throw him to the sharks and be over with it.", 
        "intTime": 20090413, 
        "postID": 113, 
        "quote": "", 
        "reply": "Is it necessary to have a trial? Just throw him to the sharks and be over with it.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:36:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "Try him as an adult in US court. Allow complete news coverage of the process. If a case can be proven and he is convicted lock him up with his new BFF's and forget him.", 
        "intTime": 20090413, 
        "postID": 114, 
        "quote": "", 
        "reply": "Try him as an adult in US court. Allow complete news coverage of the process. If a case can be proven and he is convicted lock him up with his new BFF's and forget him.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:45:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "adminnco1"
    }, 
    {
        "content": "tragically disappears out in the middle of the sea...", 
        "intTime": 20090413, 
        "postID": 115, 
        "quote": "", 
        "reply": "tragically disappears out in the middle of the sea...", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:51:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released. Yeah, a young man with hate in his heart... so why not take advantage of an opportunity to mold this kid into something useful and productive.... and maybe instead of a hate filled man we have someone with a vision towards the future for his country. Are you guys telling me, those of you who have said \"hang em\", \"cut off parts\", \"throw him to the sharks\" -- are you telling me you, you yourselves, are capable of doing such? This is a very young person who, it is obvious, does not know any better, has never known any better nor most likely even knows the meaning of hope - then maybe, just maybe some form of structured, secure environment for him would be the better option. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090413, 
        "postID": 116, 
        "quote": "Originally posted by mcgreer: Well...there you go, then. That's an unfortunate thing for the kid, but I guess it's better than dying in the streets of Mogadishu or on the high seas. He'd probably still be a relatively young man when he's released.", 
        "reply": " Yeah, a young man with hate in his heart... so why not take advantage of an opportunity to mold this kid into something useful and productive.... and maybe instead of a hate filled man we have someone with a vision towards the future for his country. Are you guys telling me, those of you who have said \"hang em\", \"cut off parts\", \"throw him to the sharks\" -- are you telling me you, you yourselves, are capable of doing such? This is a very young person who, it is obvious, does not know any better, has never known any better nor most likely even knows the meaning of hope - then maybe, just maybe some form of structured, secure environment for him would be the better option. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:52:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "FBI raids 3 Minneapolis money-transfer shops ----http://www.startribune.com/local/42695652.html", 
        "intTime": 20090413, 
        "postID": 117, 
        "quote": "", 
        "reply": "FBI raids 3 Minneapolis money-transfer shops ----http://www.startribune.com/local/42695652.html", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 13:54:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "outlaws93"
    }, 
    {
        "content": "As far as the pirates go, either way ss fine with me as long as they have thier day in court and the punishment fots the crime - Death for Piracy on the high seas. Now I see the some people saying it's ok to bring Pirate Terrorist to the US to be placed on trial. Man some people have GOT to quit putting on that mask that has 2 faces. It really does them no justice.", 
        "intTime": 20090413, 
        "postID": 118, 
        "quote": "", 
        "reply": "As far as the pirates go, either way ss fine with me as long as they have thier day in court and the punishment fots the crime - Death for Piracy on the high seas. Now I see the some people saying it's ok to bring Pirate Terrorist to the US to be placed on trial. Man some people have GOT to quit putting on that mask that has 2 faces. It really does them no justice.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 14:02:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave", 
        "intTime": 20090413, 
        "postID": 119, 
        "quote": "", 
        "reply": "This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 14:59:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave Terrorist are criminals. Pirates are criminals. I see no difference. A crime is a crime. That has been my entire point from day 1. Why treat someone called a \"terrorist\" different from someone called a \"pirate\" that commit the same crime? The makes no sense. \"Kids\" these days that kill deserve the same punishment. The punishment should fit the crime not the punishment should fit a persons \"label\". Dumb...really dumb.", 
        "intTime": 20090413, 
        "postID": 120, 
        "quote": "Originally posted by Grachus: This is a fourteen year old kid. He's not a terrorist. He's a \"sidekick\" to a gang of robbers. Why is this bit about them being terrorists mindlessly repearted? Their criminals, no different than a bunch of bank robbers - We don't kill bank robbers in America, we sentence them to prison. If it's a kid, then taking out all the anger over 9/11 seems a bit over the top. Blaming him for Mogadishu, which took place before he was born, is over the top. Perhaps it's Right to try him as an adult. I will leave such decisions to the prosecutors who can better evaluate him then I can. Dave", 
        "reply": " Terrorist are criminals. Pirates are criminals. I see no difference. A crime is a crime. That has been my entire point from day 1. Why treat someone called a \"terrorist\" different from someone called a \"pirate\" that commit the same crime? The makes no sense. \"Kids\" these days that kill deserve the same punishment. The punishment should fit the crime not the punishment should fit a persons \"label\". Dumb...really dumb.", 
        "threadID": "672198221_4850095022001", 
        "time": "2009-04-13 15:19:00", 
        "title": "What to do with captured TEEN pirate?", 
        "userID": "crackerjacks61"
    }
]