[
    {
        "content": "From the \"Wired.com\" and a firearms technology blog: ++http://www.thefirearmblog.com/blog/2009/03/06/suicide-bomber-simulation-vest/ quote: Suicide Bomber Simulation Vest The US Naval Air Warfare Center funded a patent application, published two weeks ago, with the innocuous title of “Military Training Device”. The device turns out to be a suicide vest simulator for the Multiple Integrated Laser Engagement System (MILES) training system. The original MILES system was developed in the 1980’s to provide a realistic force-on-force training system for the US Army. The system utilized an array of sensors on soldiers clothing, equipment and vehicles. When a blank cartridge is fired from a MILES equipped rifle, the laser is activated and transmits information about the shooter, his weapon and ammunition. If a laser hits a sensor, the software calculates if the shot was a kill based on the range and what ammunition was being used. MILES is in use by many armed forces including the Australian, British, Czech, Irish, Israeli, Turkish and Canadian armies. The patent application, number 20090053679, describes a system where clothing is covered in light generating devices, such as LEDs, that when activated broadcast the appropriate MILES codes for a kill over a wide area. Sensors in the “blast” zone would then calculate the distance from the “explosion” and see if it resulted in a kill. Previous simulation systems for suicide bombers have just generated smoke and sound effects. The Kill Logic The system also allows for defensive action against suicide bombers. Sensors would also be placed on the bomber and certain hits would be able to disable the bomb - something the Israelis have demonstrated is possible in real life. The patent goes out of its way to be politically correct. The words “suicide bomber” are only used once. From the patent, emphasis mine: [0040]In act 112, electrical circuit 18 disables offensive capabilities of military training device 10. In the particular embodiment described above in which multiple integrated laser engagement system 14 includes light generating devices 16a as well as light detectors 16b, light generating devices 16a may be inhibited from further operation until the current military training maneuver is completed. In this manner, a particular trainee simulating a suicide bomber may be disabled from inflicting damage to other trainees. This is a very interesting system and I look forward to seeing it develop. Providing training with this level of realism can only... This message has been edited. Last edited by: Canuck_Centaur, Sat 07 March 2009 09:44 AM", 
        "intTime": 20090307, 
        "postID": 1, 
        "quote": "Suicide Bomber Simulation Vest The US Naval Air Warfare Center funded a patent application, published two weeks ago, with the innocuous title of “Military Training Device”. The device turns out to be a suicide vest simulator for the Multiple Integrated Laser Engagement System (MILES) training system. The original MILES system was developed in the 1980’s to provide a realistic force-on-force training system for the US Army. The system utilized an array of sensors on soldiers clothing, equipment and vehicles. When a blank cartridge is fired from a MILES equipped rifle, the laser is activated and transmits information about the shooter, his weapon and ammunition. If a laser hits a sensor, the software calculates if the shot was a kill based on the range and what ammunition was being used. MILES is in use by many armed forces including the Australian, British, Czech, Irish, Israeli, Turkish and Canadian armies. The patent application, number 20090053679, describes a system where clothing is covered in light generating devices, such as LEDs, that when activated broadcast the appropriate MILES codes for a kill over a wide area. Sensors in the “blast” zone would then calculate the distance from the “explosion” and see if it resulted in a kill. Previous simulation systems for suicide bombers have just generated smoke and sound effects. The Kill Logic The system also allows for defensive action against suicide bombers. Sensors would also be placed on the bomber and certain hits would be able to disable the bomb - something the Israelis have demonstrated is possible in real life. The patent goes out of its way to be politically correct. The words “suicide bomber” are only used once. From the patent, emphasis mine: [0040]In act 112, electrical circuit 18 disables offensive capabilities of military training device 10. In the particular embodiment described above in which multiple integrated laser engagement system 14 includes light generating devices 16a as well as light detectors 16b, light generating devices 16a may be inhibited from further operation until the current military training maneuver is completed. In this manner, a particular trainee simulating a suicide bomber may be disabled from inflicting damage to other trainees. This is a very interesting system and I look forward to seeing it develop. Providing training with this level of realism can only...", 
        "reply": "From the \"Wired.com\" and a firearms technology blog: ++http://www.thefirearmblog.com/blog/2009/03/06/suicide-bomber-simulation-vest/  This message has been edited. Last edited by: Canuck_Centaur, Sat 07 March 2009 09:44 AM", 
        "threadID": "672198221_4330091712001", 
        "time": "2009-03-07 08:59:00", 
        "title": "USN patents MILES Suicide Bomber simulation vest", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "This actually seems a bit outdated to me. Terrorists seem to have switched mainly to the more destructive IED's and VDIED's. There are certainly those groups that still employ suicide vests but the problem isn't in their effects; it's in trying to detect the person wearing the vest in the first place. This doesn't seem like it will be of much use.", 
        "intTime": 20090307, 
        "postID": 2, 
        "quote": "", 
        "reply": "This actually seems a bit outdated to me. Terrorists seem to have switched mainly to the more destructive IED's and VDIED's. There are certainly those groups that still employ suicide vests but the problem isn't in their effects; it's in trying to detect the person wearing the vest in the first place. This doesn't seem like it will be of much use.", 
        "threadID": "672198221_4330091712001", 
        "time": "2009-03-07 13:01:00", 
        "title": "USN patents MILES Suicide Bomber simulation vest", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: This actually seems a bit outdated to me. Terrorists seem to have switched mainly to the more destructive IED's and VDIED's. There are certainly those groups that still employ suicide vests but the problem isn't in their effects; it's in trying to detect the person wearing the vest in the first place. This doesn't seem like it will be of much use. I disagree, when I spent the last 18 months on Active Duty training deploying units, we used a similar device. This will definately help with ECP training and general POW search techniques, Surveillance techniques, etc. We have(at least in 1st Army) Training Aids IED's that use powder and Co2 that can be remotely initiated much like the real IED's. I ran Lanes at Drum, Dix, Cp. Smith, FTIG, with them. Suicide Bombs in Iraq are still being used. Witness the latest TTP of using Females or the Elderly. In Afghanistan they are now being used by Foreign Fighters check CALL or check with your S2 NCO", 
        "intTime": 20090307, 
        "postID": 3, 
        "quote": "Originally posted by foxred03: This actually seems a bit outdated to me. Terrorists seem to have switched mainly to the more destructive IED's and VDIED's. There are certainly those groups that still employ suicide vests but the problem isn't in their effects; it's in trying to detect the person wearing the vest in the first place. This doesn't seem like it will be of much use.", 
        "reply": " I disagree, when I spent the last 18 months on Active Duty training deploying units, we used a similar device. This will definately help with ECP training and general POW search techniques, Surveillance techniques, etc. We have(at least in 1st Army) Training Aids IED's that use powder and Co2 that can be remotely initiated much like the real IED's. I ran Lanes at Drum, Dix, Cp. Smith, FTIG, with them. Suicide Bombs in Iraq are still being used. Witness the latest TTP of using Females or the Elderly. In Afghanistan they are now being used by Foreign Fighters check CALL or check with your S2 NCO", 
        "threadID": "672198221_4330091712001", 
        "time": "2009-03-07 16:41:00", 
        "title": "USN patents MILES Suicide Bomber simulation vest", 
        "userID": "LineDoggie"
    }
]