[
    {
        "content": "quote: A hairdresser from Meshchovsk, a small town in Russia, subdued a would be robber at her salon, then tied him up in the back room and raped him for three days. At the end of the day on March 14, Olga was dealing with the last of her customers for the weekend when a man forced his way into the salon and demanded money. Other customers and employees at the establishment complied with his demands, but unbenounced to the robber, Olga just happened to be a yellow belt in karate. She overcame the robber and dragged him into the back room, then told everyone she would hold him until the police arrived. But Olga didn’t call the police, in fact, after everyone had left, she went to the back room and demanded that the robber remove his clothing and underwear, telling him if he didn’t do so she would hand him over to the police. He obeyed and, bound with a pair of pink furry handcuffs, spent the next 3 days at the mercy of Olga’s perverse imagination. Monday morning before the hair salon reopened for business, the robber was freed and went directly to the hospital for treatment of injuries to his genitals. After leaving the hospital, he went to the police. Olga was hostile when arrested later that day, saying: “What a *******. Yes, we had sex a couple of times. But I’ve bought him new jeans, gave him food and even gave him 1.000 roubles (around $ 30) when he left.” Both Olga and the robber Viktor have been charged and are awaiting sentencing. LOL +http://www.inquisitr.com/22016/russian-hairdresser-kidnaps-robber-rapes-him-for-three-days-p2s/ \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090420, 
        "postID": 1, 
        "quote": "A hairdresser from Meshchovsk, a small town in Russia, subdued a would be robber at her salon, then tied him up in the back room and raped him for three days. At the end of the day on March 14, Olga was dealing with the last of her customers for the weekend when a man forced his way into the salon and demanded money. Other customers and employees at the establishment complied with his demands, but unbenounced to the robber, Olga just happened to be a yellow belt in karate. She overcame the robber and dragged him into the back room, then told everyone she would hold him until the police arrived. But Olga didn’t call the police, in fact, after everyone had left, she went to the back room and demanded that the robber remove his clothing and underwear, telling him if he didn’t do so she would hand him over to the police. He obeyed and, bound with a pair of pink furry handcuffs, spent the next 3 days at the mercy of Olga’s perverse imagination. Monday morning before the hair salon reopened for business, the robber was freed and went directly to the hospital for treatment of injuries to his genitals. After leaving the hospital, he went to the police. Olga was hostile when arrested later that day, saying: “What a *******. Yes, we had sex a couple of times. But I’ve bought him new jeans, gave him food and even gave him 1.000 roubles (around $ 30) when he left.” Both Olga and the robber Viktor have been charged and are awaiting sentencing.", 
        "reply": " LOL +http://www.inquisitr.com/22016/russian-hairdresser-kidnaps-robber-rapes-him-for-three-days-p2s/ \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 07:50:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "NSNN"
    }, 
    {
        "content": "Wow...a yellow belt is one step above a white belt.", 
        "intTime": 20090420, 
        "postID": 2, 
        "quote": "", 
        "reply": "Wow...a yellow belt is one step above a white belt.", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 07:57:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Wow...a yellow belt is one step above a white belt. He must have been a real man’s man! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090420, 
        "postID": 3, 
        "quote": "Originally posted by foxred03: Wow...a yellow belt is one step above a white belt.", 
        "reply": " He must have been a real man’s man! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 08:03:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "NSNN"
    }, 
    {
        "content": "Olga must have been a few steps beyond coyote ugly for Viktor to have claimed rape...........", 
        "intTime": 20090420, 
        "postID": 4, 
        "quote": "", 
        "reply": "Olga must have been a few steps beyond coyote ugly for Viktor to have claimed rape...........", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 08:21:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "so what does this olga looks like??? we need pics...", 
        "intTime": 20090420, 
        "postID": 5, 
        "quote": "", 
        "reply": "so what does this olga looks like??? we need pics...", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 08:31:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "outlaws93"
    }, 
    {
        "content": "i use to live with a girl named helga her parents were from germany... her dad was apart of the french resistance during ww2....", 
        "intTime": 20090420, 
        "postID": 6, 
        "quote": "", 
        "reply": "i use to live with a girl named helga her parents were from germany... her dad was apart of the french resistance during ww2....", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 08:32:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: so what does this olga looks like??? we need pics... If he claimed rape, I don't think we want to see her pics.", 
        "intTime": 20090420, 
        "postID": 7, 
        "quote": "Originally posted by outlaws93: so what does this olga looks like??? we need pics...", 
        "reply": " If he claimed rape, I don't think we want to see her pics.", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 08:43:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Olga must have been a few steps beyond coyote ugly for Viktor to have claimed rape........... Picture 'OLGA', fat, sack dress, hair in bandana with a huge mole on her lip. Yip!!! probably the first sex she's had in years and it probably stunk too. Poor guy surely got the wrong end of the deal and the stink end too.", 
        "intTime": 20090420, 
        "postID": 8, 
        "quote": "Originally posted by PhoenixDark: Olga must have been a few steps beyond coyote ugly for Viktor to have claimed rape...........", 
        "reply": " Picture 'OLGA', fat, sack dress, hair in bandana with a huge mole on her lip. Yip!!! probably the first sex she's had in years and it probably stunk too. Poor guy surely got the wrong end of the deal and the stink end too.", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 08:49:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by PhoenixDark: Olga must have been a few steps beyond coyote ugly for Viktor to have claimed rape........... Picture 'OLGA', fat, sack dress, hair in bandana with a huge mole on her lip. Yip!!! probably the first sex she's had in years and it probably stunk too. Poor guy surely got the wrong end of the deal and the stink end too. No thanks, I just had breakfast and I'd prefer to keep it down", 
        "intTime": 20090420, 
        "postID": 9, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by PhoenixDark: Olga must have been a few steps beyond coyote ugly for Viktor to have claimed rape........... Picture 'OLGA', fat, sack dress, hair in bandana with a huge mole on her lip. Yip!!! probably the first sex she's had in years and it probably stunk too. Poor guy surely got the wrong end of the deal and the stink end too.", 
        "reply": " No thanks, I just had breakfast and I'd prefer to keep it down", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 08:54:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "I'm gonna start cutting my own hair after reading this, I wonder if \"Flowbies\" are still available.", 
        "intTime": 20090420, 
        "postID": 10, 
        "quote": "", 
        "reply": "I'm gonna start cutting my own hair after reading this, I wonder if \"Flowbies\" are still available.", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 09:17:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Come on guys, help me out. I'm suffering a real moral delema here. While we know the robbery was wrong, just what punishment, if any, does Olga deserve? Does three days of getting her rocks off, as opposed to him spending a year or two in jail, equal out? Come on, some feedback appreciated... Dave", 
        "intTime": 20090420, 
        "postID": 11, 
        "quote": "", 
        "reply": "Come on guys, help me out. I'm suffering a real moral delema here. While we know the robbery was wrong, just what punishment, if any, does Olga deserve? Does three days of getting her rocks off, as opposed to him spending a year or two in jail, equal out? Come on, some feedback appreciated... Dave", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 10:01:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "Grachus"
    }, 
    {
        "content": "Dave, hitting them both over the head with a hammer and ending it might be a option. Both are wingnuts.", 
        "intTime": 20090420, 
        "postID": 12, 
        "quote": "", 
        "reply": "Dave, hitting them both over the head with a hammer and ending it might be a option. Both are wingnuts.", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 11:49:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: Dave, hitting them both over the head with a hammer and ending it might be a option. Both are wingnuts. You're not being very helpful here. I mean come on man, I'm gonna be losing sleep over this... And a previous poster was right, some pictures of Olga would really help... Dave", 
        "intTime": 20090420, 
        "postID": 13, 
        "quote": "Originally posted by BAGodbehere: Dave, hitting them both over the head with a hammer and ending it might be a option. Both are wingnuts.", 
        "reply": " You're not being very helpful here. I mean come on man, I'm gonna be losing sleep over this... And a previous poster was right, some pictures of Olga would really help... Dave", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 11:55:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "Grachus"
    }, 
    {
        "content": "LMAO,,, I don't know if I really want to see her, especially after SSW's disription,, probably right on the money Damn , I gotta start watchin my spelling", 
        "intTime": 20090420, 
        "postID": 14, 
        "quote": "", 
        "reply": "LMAO,,, I don't know if I really want to see her, especially after SSW's disription,, probably right on the money Damn , I gotta start watchin my spelling", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 11:57:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by BAGodbehere: Dave, hitting them both over the head with a hammer and ending it might be a option. Both are wingnuts. You're not being very helpful here. I mean come on man, I'm gonna be losing sleep over this... And a previous poster was right, some pictures of Olga would really help... Dave The robber may have already paid for his crime...", 
        "intTime": 20090420, 
        "postID": 15, 
        "quote": "Originally posted by Grachus: quote: Originally posted by BAGodbehere: Dave, hitting them both over the head with a hammer and ending it might be a option. Both are wingnuts. You're not being very helpful here. I mean come on man, I'm gonna be losing sleep over this... And a previous poster was right, some pictures of Olga would really help... Dave", 
        "reply": " The robber may have already paid for his crime...", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 11:59:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "ahhhhh, omg,,,RUUUNNNNN,,,I can't stop laughing", 
        "intTime": 20090420, 
        "postID": 16, 
        "quote": "", 
        "reply": "ahhhhh, omg,,,RUUUNNNNN,,,I can't stop laughing", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 12:00:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "If this were the case, he has certianly paid for his crime,,I would feel sorry for him, he'd never rob anyone agian.", 
        "intTime": 20090420, 
        "postID": 17, 
        "quote": "", 
        "reply": "If this were the case, he has certianly paid for his crime,,I would feel sorry for him, he'd never rob anyone agian.", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 12:03:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: If this were the case, he has certianly paid for his crime,,I would feel sorry for him, he'd never rob anyone agian. Ok, ok, the picture WAS helpful. They should indeed let the guy go... He's no doubt learned his lesson. Who knows, maybe the NYPD will give her a green card to lecture on her crime fighting techniques? Naah Dave", 
        "intTime": 20090420, 
        "postID": 18, 
        "quote": "Originally posted by BAGodbehere: If this were the case, he has certianly paid for his crime,,I would feel sorry for him, he'd never rob anyone agian.", 
        "reply": " Ok, ok, the picture WAS helpful. They should indeed let the guy go... He's no doubt learned his lesson. Who knows, maybe the NYPD will give her a green card to lecture on her crime fighting techniques? Naah Dave", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 12:07:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by BAGodbehere: If this were the case, he has certianly paid for his crime,,I would feel sorry for him, he'd never rob anyone agian. Ok, ok, the picture WAS helpful. They should indeed let the guy go... He's no doubt learned his lesson. Who knows, maybe the NYPD will give her a green card to lecture on her crime fighting techniques? Naah Dave Won't work...can't teach ugly!", 
        "intTime": 20090420, 
        "postID": 19, 
        "quote": "Originally posted by Grachus: quote: Originally posted by BAGodbehere: If this were the case, he has certianly paid for his crime,,I would feel sorry for him, he'd never rob anyone agian. Ok, ok, the picture WAS helpful. They should indeed let the guy go... He's no doubt learned his lesson. Who knows, maybe the NYPD will give her a green card to lecture on her crime fighting techniques? Naah Dave", 
        "reply": " Won't work...can't teach ugly!", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 13:37:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by Grachus: quote: Originally posted by BAGodbehere: If this were the case, he has certianly paid for his crime,,I would feel sorry for him, he'd never rob anyone agian. Ok, ok, the picture WAS helpful. They should indeed let the guy go... He's no doubt learned his lesson. Who knows, maybe the NYPD will give her a green card to lecture on her crime fighting techniques? Naah Dave Won't work...can't teach ugly! Worse, she was only 38... Dave", 
        "intTime": 20090420, 
        "postID": 20, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by Grachus: quote: Originally posted by BAGodbehere: If this were the case, he has certianly paid for his crime,,I would feel sorry for him, he'd never rob anyone agian. Ok, ok, the picture WAS helpful. They should indeed let the guy go... He's no doubt learned his lesson. Who knows, maybe the NYPD will give her a green card to lecture on her crime fighting techniques? Naah Dave Won't work...can't teach ugly!", 
        "reply": " Worse, she was only 38... Dave", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 13:41:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: A hairdresser from Meshchovsk, a small town in Russia, subdued a would be robber at her salon, then tied him up in the back room and raped him for three days. At the end of the day on March 14, Olga was dealing with the last of her customers for the weekend when a man forced his way into the salon and demanded money. Other customers and employees at the establishment complied with his demands, but unbenounced to the robber, Olga just happened to be a yellow belt in karate. She overcame the robber and dragged him into the back room, then told everyone she would hold him until the police arrived. But Olga didn’t call the police, in fact, after everyone had left, she went to the back room and demanded that the robber remove his clothing and underwear, telling him if he didn’t do so she would hand him over to the police. He obeyed and, bound with a pair of pink furry handcuffs, spent the next 3 days at the mercy of Olga’s perverse imagination. Monday morning before the hair salon reopened for business, the robber was freed and went directly to the hospital for treatment of injuries to his genitals. After leaving the hospital, he went to the police. Olga was hostile when arrested later that day, saying: “What a *******. Yes, we had sex a couple of times. But I’ve bought him new jeans, gave him food and even gave him 1.000 roubles (around $ 30) when he left.” Both Olga and the robber Viktor have been charged and are awaiting sentencing. LOL +http://www.inquisitr.com/22016/russian-hairdresser-kidnaps-robber-rapes-him-for-three-days-p2s/ \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090420, 
        "postID": 21, 
        "quote": "A hairdresser from Meshchovsk, a small town in Russia, subdued a would be robber at her salon, then tied him up in the back room and raped him for three days. At the end of the day on March 14, Olga was dealing with the last of her customers for the weekend when a man forced his way into the salon and demanded money. Other customers and employees at the establishment complied with his demands, but unbenounced to the robber, Olga just happened to be a yellow belt in karate. She overcame the robber and dragged him into the back room, then told everyone she would hold him until the police arrived. But Olga didn’t call the police, in fact, after everyone had left, she went to the back room and demanded that the robber remove his clothing and underwear, telling him if he didn’t do so she would hand him over to the police. He obeyed and, bound with a pair of pink furry handcuffs, spent the next 3 days at the mercy of Olga’s perverse imagination. Monday morning before the hair salon reopened for business, the robber was freed and went directly to the hospital for treatment of injuries to his genitals. After leaving the hospital, he went to the police. Olga was hostile when arrested later that day, saying: “What a *******. Yes, we had sex a couple of times. But I’ve bought him new jeans, gave him food and even gave him 1.000 roubles (around $ 30) when he left.” Both Olga and the robber Viktor have been charged and are awaiting sentencing.", 
        "reply": " LOL +http://www.inquisitr.com/22016/russian-hairdresser-kidnaps-robber-rapes-him-for-three-days-p2s/ \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 07:50:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "NSNN"
    }, 
    {
        "content": "Wow...a yellow belt is one step above a white belt.", 
        "intTime": 20090420, 
        "postID": 22, 
        "quote": "", 
        "reply": "Wow...a yellow belt is one step above a white belt.", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 07:57:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by foxred03: Wow...a yellow belt is one step above a white belt. He must have been a real man’s man! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090420, 
        "postID": 23, 
        "quote": "Originally posted by foxred03: Wow...a yellow belt is one step above a white belt.", 
        "reply": " He must have been a real man’s man! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 08:03:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "NSNN"
    }, 
    {
        "content": "Olga must have been a few steps beyond coyote ugly for Viktor to have claimed rape...........", 
        "intTime": 20090420, 
        "postID": 24, 
        "quote": "", 
        "reply": "Olga must have been a few steps beyond coyote ugly for Viktor to have claimed rape...........", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 08:21:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "so what does this olga looks like??? we need pics...", 
        "intTime": 20090420, 
        "postID": 25, 
        "quote": "", 
        "reply": "so what does this olga looks like??? we need pics...", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 08:31:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "outlaws93"
    }, 
    {
        "content": "i use to live with a girl named helga her parents were from germany... her dad was apart of the french resistance during ww2....", 
        "intTime": 20090420, 
        "postID": 26, 
        "quote": "", 
        "reply": "i use to live with a girl named helga her parents were from germany... her dad was apart of the french resistance during ww2....", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 08:32:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: so what does this olga looks like??? we need pics... If he claimed rape, I don't think we want to see her pics.", 
        "intTime": 20090420, 
        "postID": 27, 
        "quote": "Originally posted by outlaws93: so what does this olga looks like??? we need pics...", 
        "reply": " If he claimed rape, I don't think we want to see her pics.", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 08:43:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Olga must have been a few steps beyond coyote ugly for Viktor to have claimed rape........... Picture 'OLGA', fat, sack dress, hair in bandana with a huge mole on her lip. Yip!!! probably the first sex she's had in years and it probably stunk too. Poor guy surely got the wrong end of the deal and the stink end too.", 
        "intTime": 20090420, 
        "postID": 28, 
        "quote": "Originally posted by PhoenixDark: Olga must have been a few steps beyond coyote ugly for Viktor to have claimed rape...........", 
        "reply": " Picture 'OLGA', fat, sack dress, hair in bandana with a huge mole on her lip. Yip!!! probably the first sex she's had in years and it probably stunk too. Poor guy surely got the wrong end of the deal and the stink end too.", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 08:49:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by PhoenixDark: Olga must have been a few steps beyond coyote ugly for Viktor to have claimed rape........... Picture 'OLGA', fat, sack dress, hair in bandana with a huge mole on her lip. Yip!!! probably the first sex she's had in years and it probably stunk too. Poor guy surely got the wrong end of the deal and the stink end too. No thanks, I just had breakfast and I'd prefer to keep it down", 
        "intTime": 20090420, 
        "postID": 29, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by PhoenixDark: Olga must have been a few steps beyond coyote ugly for Viktor to have claimed rape........... Picture 'OLGA', fat, sack dress, hair in bandana with a huge mole on her lip. Yip!!! probably the first sex she's had in years and it probably stunk too. Poor guy surely got the wrong end of the deal and the stink end too.", 
        "reply": " No thanks, I just had breakfast and I'd prefer to keep it down", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 08:54:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "I'm gonna start cutting my own hair after reading this, I wonder if \"Flowbies\" are still available.", 
        "intTime": 20090420, 
        "postID": 30, 
        "quote": "", 
        "reply": "I'm gonna start cutting my own hair after reading this, I wonder if \"Flowbies\" are still available.", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 09:17:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Come on guys, help me out. I'm suffering a real moral delema here. While we know the robbery was wrong, just what punishment, if any, does Olga deserve? Does three days of getting her rocks off, as opposed to him spending a year or two in jail, equal out? Come on, some feedback appreciated... Dave", 
        "intTime": 20090420, 
        "postID": 31, 
        "quote": "", 
        "reply": "Come on guys, help me out. I'm suffering a real moral delema here. While we know the robbery was wrong, just what punishment, if any, does Olga deserve? Does three days of getting her rocks off, as opposed to him spending a year or two in jail, equal out? Come on, some feedback appreciated... Dave", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 10:01:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "Grachus"
    }, 
    {
        "content": "Dave, hitting them both over the head with a hammer and ending it might be a option. Both are wingnuts.", 
        "intTime": 20090420, 
        "postID": 32, 
        "quote": "", 
        "reply": "Dave, hitting them both over the head with a hammer and ending it might be a option. Both are wingnuts.", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 11:49:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: Dave, hitting them both over the head with a hammer and ending it might be a option. Both are wingnuts. You're not being very helpful here. I mean come on man, I'm gonna be losing sleep over this... And a previous poster was right, some pictures of Olga would really help... Dave", 
        "intTime": 20090420, 
        "postID": 33, 
        "quote": "Originally posted by BAGodbehere: Dave, hitting them both over the head with a hammer and ending it might be a option. Both are wingnuts.", 
        "reply": " You're not being very helpful here. I mean come on man, I'm gonna be losing sleep over this... And a previous poster was right, some pictures of Olga would really help... Dave", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 11:55:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "Grachus"
    }, 
    {
        "content": "LMAO,,, I don't know if I really want to see her, especially after SSW's disription,, probably right on the money Damn , I gotta start watchin my spelling", 
        "intTime": 20090420, 
        "postID": 34, 
        "quote": "", 
        "reply": "LMAO,,, I don't know if I really want to see her, especially after SSW's disription,, probably right on the money Damn , I gotta start watchin my spelling", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 11:57:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by BAGodbehere: Dave, hitting them both over the head with a hammer and ending it might be a option. Both are wingnuts. You're not being very helpful here. I mean come on man, I'm gonna be losing sleep over this... And a previous poster was right, some pictures of Olga would really help... Dave The robber may have already paid for his crime...", 
        "intTime": 20090420, 
        "postID": 35, 
        "quote": "Originally posted by Grachus: quote: Originally posted by BAGodbehere: Dave, hitting them both over the head with a hammer and ending it might be a option. Both are wingnuts. You're not being very helpful here. I mean come on man, I'm gonna be losing sleep over this... And a previous poster was right, some pictures of Olga would really help... Dave", 
        "reply": " The robber may have already paid for his crime...", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 11:59:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "ahhhhh, omg,,,RUUUNNNNN,,,I can't stop laughing", 
        "intTime": 20090420, 
        "postID": 36, 
        "quote": "", 
        "reply": "ahhhhh, omg,,,RUUUNNNNN,,,I can't stop laughing", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 12:00:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "If this were the case, he has certianly paid for his crime,,I would feel sorry for him, he'd never rob anyone agian.", 
        "intTime": 20090420, 
        "postID": 37, 
        "quote": "", 
        "reply": "If this were the case, he has certianly paid for his crime,,I would feel sorry for him, he'd never rob anyone agian.", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 12:03:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: If this were the case, he has certianly paid for his crime,,I would feel sorry for him, he'd never rob anyone agian. Ok, ok, the picture WAS helpful. They should indeed let the guy go... He's no doubt learned his lesson. Who knows, maybe the NYPD will give her a green card to lecture on her crime fighting techniques? Naah Dave", 
        "intTime": 20090420, 
        "postID": 38, 
        "quote": "Originally posted by BAGodbehere: If this were the case, he has certianly paid for his crime,,I would feel sorry for him, he'd never rob anyone agian.", 
        "reply": " Ok, ok, the picture WAS helpful. They should indeed let the guy go... He's no doubt learned his lesson. Who knows, maybe the NYPD will give her a green card to lecture on her crime fighting techniques? Naah Dave", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 12:07:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by BAGodbehere: If this were the case, he has certianly paid for his crime,,I would feel sorry for him, he'd never rob anyone agian. Ok, ok, the picture WAS helpful. They should indeed let the guy go... He's no doubt learned his lesson. Who knows, maybe the NYPD will give her a green card to lecture on her crime fighting techniques? Naah Dave Won't work...can't teach ugly!", 
        "intTime": 20090420, 
        "postID": 39, 
        "quote": "Originally posted by Grachus: quote: Originally posted by BAGodbehere: If this were the case, he has certianly paid for his crime,,I would feel sorry for him, he'd never rob anyone agian. Ok, ok, the picture WAS helpful. They should indeed let the guy go... He's no doubt learned his lesson. Who knows, maybe the NYPD will give her a green card to lecture on her crime fighting techniques? Naah Dave", 
        "reply": " Won't work...can't teach ugly!", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 13:37:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by Grachus: quote: Originally posted by BAGodbehere: If this were the case, he has certianly paid for his crime,,I would feel sorry for him, he'd never rob anyone agian. Ok, ok, the picture WAS helpful. They should indeed let the guy go... He's no doubt learned his lesson. Who knows, maybe the NYPD will give her a green card to lecture on her crime fighting techniques? Naah Dave Won't work...can't teach ugly! Worse, she was only 38... Dave", 
        "intTime": 20090420, 
        "postID": 40, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by Grachus: quote: Originally posted by BAGodbehere: If this were the case, he has certianly paid for his crime,,I would feel sorry for him, he'd never rob anyone agian. Ok, ok, the picture WAS helpful. They should indeed let the guy go... He's no doubt learned his lesson. Who knows, maybe the NYPD will give her a green card to lecture on her crime fighting techniques? Naah Dave Won't work...can't teach ugly!", 
        "reply": " Worse, she was only 38... Dave", 
        "threadID": "672198221_7040062122001", 
        "time": "2009-04-20 13:41:00", 
        "title": "Russian Hairdresser Kidnaps Robber, Rapes him for Three Days", 
        "userID": "Grachus"
    }
]