[
    {
        "content": "Alfred Mann, 87, has struggled to eat and speak since he was injured in the land mine blast while serving with Royal Army Medical Corps in Italy in 1944. Mr Mann, who had no idea the half-inch shrapnel had lodged in his jaw, has spent years in pain, eating only soft foods...... Mr Mann suffered hearing loss, face, shoulder and leg injuries in the explosion in Monte Cassino while helping to treat injured soldiers. ...... Bet he'd like a Nice T-Bone Steak now XXXhttp://www.independent.co.uk/news/uk/home-news/soldier-finds-shrapnel-in-mouth-65-years-on-1690938.htmlXXX", 
        "intTime": 20090526, 
        "postID": 1, 
        "quote": "", 
        "reply": "Alfred Mann, 87, has struggled to eat and speak since he was injured in the land mine blast while serving with Royal Army Medical Corps in Italy in 1944. Mr Mann, who had no idea the half-inch shrapnel had lodged in his jaw, has spent years in pain, eating only soft foods...... Mr Mann suffered hearing loss, face, shoulder and leg injuries in the explosion in Monte Cassino while helping to treat injured soldiers. ...... Bet he'd like a Nice T-Bone Steak now XXXhttp://www.independent.co.uk/news/uk/home-news/soldier-finds-shrapnel-in-mouth-65-years-on-1690938.htmlXXX", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 09:10:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Somehow, \"ouch!\" doesn't seem to quite cut it. Didn't anyone bother to do an x-ray? Poor guy.", 
        "intTime": 20090526, 
        "postID": 2, 
        "quote": "", 
        "reply": "Somehow, \"ouch!\" doesn't seem to quite cut it. Didn't anyone bother to do an x-ray? Poor guy.", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 09:19:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: Somehow, \"ouch!\" doesn't seem to quite cut it. Didn't anyone bother to do an x-ray? Poor guy. Sixty-five years ago, vets returning to life as they left it, just wanted to move on with their life. They took the knocks and bumps and didn't complain. That was that generation. Our \"greatest generation\".", 
        "intTime": 20090526, 
        "postID": 3, 
        "quote": "Originally posted by Whirled_Peas: Somehow, \"ouch!\" doesn't seem to quite cut it. Didn't anyone bother to do an x-ray? Poor guy.", 
        "reply": " Sixty-five years ago, vets returning to life as they left it, just wanted to move on with their life. They took the knocks and bumps and didn't complain. That was that generation. Our \"greatest generation\".", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 09:23:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Whirled_Peas: Somehow, \"ouch!\" doesn't seem to quite cut it. Didn't anyone bother to do an x-ray? Poor guy. Sixty-five years ago, vets returning to life as they left it, just wanted to move on with their life. They took the knocks and bumps and didn't complain. That was that generation. Our \"greatest generation\". We also used to live in caves and sleep on rocks, but now that we have the technology to take better care of ourselves and each other, why should an honorable veteran be forced to live in pain due to an injury that could have been healed? Did your Jesus say to heal the sick, or did he tell the sick to \"take the knocks,\" shut up, and deal with it?", 
        "intTime": 20090526, 
        "postID": 4, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by Whirled_Peas: Somehow, \"ouch!\" doesn't seem to quite cut it. Didn't anyone bother to do an x-ray? Poor guy. Sixty-five years ago, vets returning to life as they left it, just wanted to move on with their life. They took the knocks and bumps and didn't complain. That was that generation. Our \"greatest generation\".", 
        "reply": " We also used to live in caves and sleep on rocks, but now that we have the technology to take better care of ourselves and each other, why should an honorable veteran be forced to live in pain due to an injury that could have been healed? Did your Jesus say to heal the sick, or did he tell the sick to \"take the knocks,\" shut up, and deal with it?", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 09:27:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Whirled_Peas: Somehow, \"ouch!\" doesn't seem to quite cut it. Didn't anyone bother to do an x-ray? Poor guy. Sixty-five years ago, vets returning to life as they left it, just wanted to move on with their life. They took the knocks and bumps and didn't complain. That was that generation. Our \"greatest generation\". We also used to live in caves and sleep on rocks, but now that we have the technology to take better care of ourselves and each other, why should an honorable veteran be forced to live in pain due to an injury that could have been healed? Did your Jesus say to heal the sick, or did he tell the sick to \"take the knocks,\" shut up, and deal with it? \"Your\" Jesus told me nothing, it was how I was raised. Probaly also why I chose the republican party, I was taught not to wait around for handouts. It was also why during my time in the Army when I should have gone on sick call, I took two aspirins and drove on like everyone else did. But....I guess it's just a personal pride thing.", 
        "intTime": 20090526, 
        "postID": 5, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Whirled_Peas: Somehow, \"ouch!\" doesn't seem to quite cut it. Didn't anyone bother to do an x-ray? Poor guy. Sixty-five years ago, vets returning to life as they left it, just wanted to move on with their life. They took the knocks and bumps and didn't complain. That was that generation. Our \"greatest generation\". We also used to live in caves and sleep on rocks, but now that we have the technology to take better care of ourselves and each other, why should an honorable veteran be forced to live in pain due to an injury that could have been healed? Did your Jesus say to heal the sick, or did he tell the sick to \"take the knocks,\" shut up, and deal with it?", 
        "reply": " \"Your\" Jesus told me nothing, it was how I was raised. Probaly also why I chose the republican party, I was taught not to wait around for handouts. It was also why during my time in the Army when I should have gone on sick call, I took two aspirins and drove on like everyone else did. But....I guess it's just a personal pride thing.", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 09:38:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: Somehow, \"ouch!\" doesn't seem to quite cut it. Didn't anyone bother to do an x-ray? Poor guy. It was only after being in Iraq I realized that many times they wont remove schrapnel from you. A Friend had schrapnel in his ulna and the Doc's wouldnt remove it, just round it off a bit and sew him up. He was back on duty a week later instead of being evaced out of theater. I still get tiny pieces of Asphalt coming out of my eyelids and face from a 2005 IED. And when that does happen, it hurts like nothing you've ever felt, especially next to the eye.", 
        "intTime": 20090526, 
        "postID": 6, 
        "quote": "Originally posted by Whirled_Peas: Somehow, \"ouch!\" doesn't seem to quite cut it. Didn't anyone bother to do an x-ray? Poor guy.", 
        "reply": " It was only after being in Iraq I realized that many times they wont remove schrapnel from you. A Friend had schrapnel in his ulna and the Doc's wouldnt remove it, just round it off a bit and sew him up. He was back on duty a week later instead of being evaced out of theater. I still get tiny pieces of Asphalt coming out of my eyelids and face from a 2005 IED. And when that does happen, it hurts like nothing you've ever felt, especially next to the eye.", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 09:38:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by Whirled_Peas: Somehow, \"ouch!\" doesn't seem to quite cut it. Didn't anyone bother to do an x-ray? Poor guy. It was only after being in Iraq I realized that many times they wont remove schrapnel from you. A Friend had schrapnel in his ulna and the Doc's wouldnt remove it, just round it off a bit and sew him up. He was back on duty a week later instead of being evaced out of theater. I still get tiny pieces of Asphalt coming out of my eyelids and face from a 2005 IED. And when that does happen, it hurts like nothing you've ever felt, especially next to the eye. Shrapnel removel depends upon it's location, if it's life threatening, yes, if it's not and the doc knows over time it will work itself to the service, that's where it stays.", 
        "intTime": 20090526, 
        "postID": 7, 
        "quote": "Originally posted by LineDoggie: quote: Originally posted by Whirled_Peas: Somehow, \"ouch!\" doesn't seem to quite cut it. Didn't anyone bother to do an x-ray? Poor guy. It was only after being in Iraq I realized that many times they wont remove schrapnel from you. A Friend had schrapnel in his ulna and the Doc's wouldnt remove it, just round it off a bit and sew him up. He was back on duty a week later instead of being evaced out of theater. I still get tiny pieces of Asphalt coming out of my eyelids and face from a 2005 IED. And when that does happen, it hurts like nothing you've ever felt, especially next to the eye.", 
        "reply": " Shrapnel removel depends upon it's location, if it's life threatening, yes, if it's not and the doc knows over time it will work itself to the service, that's where it stays.", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 09:42:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "I would assert that going to a doctor and getting treated isn't \"asking for a handout.\" Does that mean that every person who seeks a doctor's help, whether for a broken bone, kidney failure, cancer, or a heart condition is asking for a freakin' handout? That's like saying that if you go to a bakery and order a loaf of bread, you're asking for a handout. Or if you go to a restaurant and order a meal, and you expect the meal to be GOOD, you're asking for a handout. If I go to a doctor, whether I'm paying in cash or I'm covered by my insurance policy, I fully expect to be treated to the best of that doctor's ability. That's the doctor's job. For a doctor or hospital to brush aside a patient who is in constant pain is practically criminal. If you believe that it's a matter of pride to \"take two aspirin and drive on\" no matter what ails you, then that's up to you. If you decide that all you need when you go in for surgery is a shot of whiskey and a belt to bite when they cut into you, then that's your prerogative. Once upon a time, that's the best people had, and a lot of them died young or suffered for decades. I'd like to think our medical knowledge AND our society have advanced enough that people no longer think they need to put themselves through that sort of thing.", 
        "intTime": 20090526, 
        "postID": 8, 
        "quote": "", 
        "reply": "I would assert that going to a doctor and getting treated isn't \"asking for a handout.\" Does that mean that every person who seeks a doctor's help, whether for a broken bone, kidney failure, cancer, or a heart condition is asking for a freakin' handout? That's like saying that if you go to a bakery and order a loaf of bread, you're asking for a handout. Or if you go to a restaurant and order a meal, and you expect the meal to be GOOD, you're asking for a handout. If I go to a doctor, whether I'm paying in cash or I'm covered by my insurance policy, I fully expect to be treated to the best of that doctor's ability. That's the doctor's job. For a doctor or hospital to brush aside a patient who is in constant pain is practically criminal. If you believe that it's a matter of pride to \"take two aspirin and drive on\" no matter what ails you, then that's up to you. If you decide that all you need when you go in for surgery is a shot of whiskey and a belt to bite when they cut into you, then that's your prerogative. Once upon a time, that's the best people had, and a lot of them died young or suffered for decades. I'd like to think our medical knowledge AND our society have advanced enough that people no longer think they need to put themselves through that sort of thing.", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 09:57:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: I would assert that going to a doctor and getting treated isn't \"asking for a handout.\" Does that mean that every person who seeks a doctor's help, whether for a broken bone, kidney failure, cancer, or a heart condition is asking for a freakin' handout? That's like saying that if you go to a bakery and order a loaf of bread, you're asking for a handout. Or if you go to a restaurant and order a meal, and you expect the meal to be GOOD, you're asking for a handout. If I go to a doctor, whether I'm paying in cash or I'm covered by my insurance policy, I fully expect to be treated to the best of that doctor's ability. That's the doctor's job. For a doctor or hospital to brush aside a patient who is in constant pain is practically criminal. If you believe that it's a matter of pride to \"take two aspirin and drive on\" no matter what ails you, then that's up to you. If you decide that all you need when you go in for surgery is a shot of whiskey and a belt to bite when they cut into you, then that's your prerogative. Once upon a time, that's the best people had, and a lot of them died young or suffered for decades. I'd like to think our medical knowledge AND our society have advanced enough that people no longer think they need to put themselves through that sort of thing. When I go for a loaf of bread or out for a meal, I PAY for it and yes because I pay for it, I want my money's worth, it's common sense but if I am given a loaf of bread or a free meal, I don't go complaining how moldy it is. In other words, beggers shouldn't be choosie. If I'm sick and I can cure myself, which I most always do, I do it. I've never gone to VA and got aspirin or cold medicine, even though I'm entitled 100%, but I do go when my prostetic needs oil, I'd oil it myself but it's internal. I'm way overdue for a new model, but why tie up surgery when I can still crawl.", 
        "intTime": 20090526, 
        "postID": 9, 
        "quote": "Originally posted by Whirled_Peas: I would assert that going to a doctor and getting treated isn't \"asking for a handout.\" Does that mean that every person who seeks a doctor's help, whether for a broken bone, kidney failure, cancer, or a heart condition is asking for a freakin' handout? That's like saying that if you go to a bakery and order a loaf of bread, you're asking for a handout. Or if you go to a restaurant and order a meal, and you expect the meal to be GOOD, you're asking for a handout. If I go to a doctor, whether I'm paying in cash or I'm covered by my insurance policy, I fully expect to be treated to the best of that doctor's ability. That's the doctor's job. For a doctor or hospital to brush aside a patient who is in constant pain is practically criminal. If you believe that it's a matter of pride to \"take two aspirin and drive on\" no matter what ails you, then that's up to you. If you decide that all you need when you go in for surgery is a shot of whiskey and a belt to bite when they cut into you, then that's your prerogative. Once upon a time, that's the best people had, and a lot of them died young or suffered for decades. I'd like to think our medical knowledge AND our society have advanced enough that people no longer think they need to put themselves through that sort of thing.", 
        "reply": " When I go for a loaf of bread or out for a meal, I PAY for it and yes because I pay for it, I want my money's worth, it's common sense but if I am given a loaf of bread or a free meal, I don't go complaining how moldy it is. In other words, beggers shouldn't be choosie. If I'm sick and I can cure myself, which I most always do, I do it. I've never gone to VA and got aspirin or cold medicine, even though I'm entitled 100%, but I do go when my prostetic needs oil, I'd oil it myself but it's internal. I'm way overdue for a new model, but why tie up surgery when I can still crawl.", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 11:20:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by Whirled_Peas: I would assert that going to a doctor and getting treated isn't \"asking for a handout.\" Does that mean that every person who seeks a doctor's help, whether for a broken bone, kidney failure, cancer, or a heart condition is asking for a freakin' handout? That's like saying that if you go to a bakery and order a loaf of bread, you're asking for a handout. Or if you go to a restaurant and order a meal, and you expect the meal to be GOOD, you're asking for a handout. If I go to a doctor, whether I'm paying in cash or I'm covered by my insurance policy, I fully expect to be treated to the best of that doctor's ability. That's the doctor's job. For a doctor or hospital to brush aside a patient who is in constant pain is practically criminal. If you believe that it's a matter of pride to \"take two aspirin and drive on\" no matter what ails you, then that's up to you. If you decide that all you need when you go in for surgery is a shot of whiskey and a belt to bite when they cut into you, then that's your prerogative. Once upon a time, that's the best people had, and a lot of them died young or suffered for decades. I'd like to think our medical knowledge AND our society have advanced enough that people no longer think they need to put themselves through that sort of thing. When I go for a loaf of bread or out for a meal, I PAY for it and yes because I pay for it, I want my money's worth, it's common sense but if I am given a loaf of bread or a free meal, I don't go complaining how moldy it is. In other words, beggers shouldn't be choosie. If I'm sick and I can cure myself, which I most always do, I do it. I've never gone to VA and got aspirin or cold medicine, even though I'm entitled 100%, but I do go when my prostetic needs oil, I'd oil it myself but it's internal. I'm way overdue for a new model, but why tie up surgery when I can still crawl. See, I don't see medical care as a free handout. I pay for it. When I needed a lump removed from my left breast, but didn't have insurance, I showed up with cash... and they STILL turned me away. I'm not kidding. I was willing to pay, in cash, the full amount. THAT is my complaint... not people who want something for nothing, but those of us who want something FOR SOMETHING, and still can't get it. And as for the veterans... those who serve get paid a salary, of course, and one of the things they EARN as part of their compensation for their work is health care. That's the way I see it. In contrast, I believe that a person who has never worked (even if he or she is fully capable) and still wants goods and services just handed to them is a person begging for a handout. But to me, a veteran wanting legitimate medical care for an injury that occurred while he was serving... he earned it. That's just my take on it. Then, on the other hand, there's the matter of military women who can get military hospitals to give them cosmetic breast augmentation for free (they just need to pay for the actual implant bubbles). THAT is just insane. But anyway, those are my thoughts, for what it's worth.", 
        "intTime": 20090526, 
        "postID": 10, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by Whirled_Peas: I would assert that going to a doctor and getting treated isn't \"asking for a handout.\" Does that mean that every person who seeks a doctor's help, whether for a broken bone, kidney failure, cancer, or a heart condition is asking for a freakin' handout? That's like saying that if you go to a bakery and order a loaf of bread, you're asking for a handout. Or if you go to a restaurant and order a meal, and you expect the meal to be GOOD, you're asking for a handout. If I go to a doctor, whether I'm paying in cash or I'm covered by my insurance policy, I fully expect to be treated to the best of that doctor's ability. That's the doctor's job. For a doctor or hospital to brush aside a patient who is in constant pain is practically criminal. If you believe that it's a matter of pride to \"take two aspirin and drive on\" no matter what ails you, then that's up to you. If you decide that all you need when you go in for surgery is a shot of whiskey and a belt to bite when they cut into you, then that's your prerogative. Once upon a time, that's the best people had, and a lot of them died young or suffered for decades. I'd like to think our medical knowledge AND our society have advanced enough that people no longer think they need to put themselves through that sort of thing. When I go for a loaf of bread or out for a meal, I PAY for it and yes because I pay for it, I want my money's worth, it's common sense but if I am given a loaf of bread or a free meal, I don't go complaining how moldy it is. In other words, beggers shouldn't be choosie. If I'm sick and I can cure myself, which I most always do, I do it. I've never gone to VA and got aspirin or cold medicine, even though I'm entitled 100%, but I do go when my prostetic needs oil, I'd oil it myself but it's internal. I'm way overdue for a new model, but why tie up surgery when I can still crawl.", 
        "reply": " See, I don't see medical care as a free handout. I pay for it. When I needed a lump removed from my left breast, but didn't have insurance, I showed up with cash... and they STILL turned me away. I'm not kidding. I was willing to pay, in cash, the full amount. THAT is my complaint... not people who want something for nothing, but those of us who want something FOR SOMETHING, and still can't get it. And as for the veterans... those who serve get paid a salary, of course, and one of the things they EARN as part of their compensation for their work is health care. That's the way I see it. In contrast, I believe that a person who has never worked (even if he or she is fully capable) and still wants goods and services just handed to them is a person begging for a handout. But to me, a veteran wanting legitimate medical care for an injury that occurred while he was serving... he earned it. That's just my take on it. Then, on the other hand, there's the matter of military women who can get military hospitals to give them cosmetic breast augmentation for free (they just need to pay for the actual implant bubbles). THAT is just insane. But anyway, those are my thoughts, for what it's worth.", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 11:51:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: Somehow, \"ouch!\" doesn't seem to quite cut it. Didn't anyone bother to do an x-ray? Poor guy. Hello socialized medicine! Just like you want here. The guy is lucky that this came out before his autopsy.", 
        "intTime": 20090526, 
        "postID": 11, 
        "quote": "Originally posted by Whirled_Peas: Somehow, \"ouch!\" doesn't seem to quite cut it. Didn't anyone bother to do an x-ray? Poor guy.", 
        "reply": " Hello socialized medicine! Just like you want here. The guy is lucky that this came out before his autopsy.", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 15:58:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "McMax"
    }, 
    {
        "content": "quote: Originally posted by McMax: quote: Originally posted by Whirled_Peas: Somehow, \"ouch!\" doesn't seem to quite cut it. Didn't anyone bother to do an x-ray? Poor guy. Hello socialized medicine! Just like you want here. The guy is lucky that this came out before his autopsy. The doctors have to know what they're looking for and it doesn't actually say that he'd been to see one about his mouth since the War, he did have a bit of shrappy taken out in 1946 though. It has to be said that this sort of thing isn't uncommon, there was a story a year or two ago about an old soldier who had half a bullet taken out of his eye during a cataract operation. He'd had pain on and off for decades and been to the doctor with who'd referred him to a specialist who'd done every test he could think of and found nothing. It turns out that when he was wounded the surgeon had noted that he'd put a small metal plate in to support the orbit of the soldier's eye and the bullet fragment had been shielded from x-rays by this.", 
        "intTime": 20090526, 
        "postID": 12, 
        "quote": "Originally posted by McMax: quote: Originally posted by Whirled_Peas: Somehow, \"ouch!\" doesn't seem to quite cut it. Didn't anyone bother to do an x-ray? Poor guy. Hello socialized medicine! Just like you want here. The guy is lucky that this came out before his autopsy.", 
        "reply": " The doctors have to know what they're looking for and it doesn't actually say that he'd been to see one about his mouth since the War, he did have a bit of shrappy taken out in 1946 though. It has to be said that this sort of thing isn't uncommon, there was a story a year or two ago about an old soldier who had half a bullet taken out of his eye during a cataract operation. He'd had pain on and off for decades and been to the doctor with who'd referred him to a specialist who'd done every test he could think of and found nothing. It turns out that when he was wounded the surgeon had noted that he'd put a small metal plate in to support the orbit of the soldier's eye and the bullet fragment had been shielded from x-rays by this.", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 17:36:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "Two years ago I was having back problems and I went to the VA for help. They amputated my right arm and now my back feels fine.", 
        "intTime": 20090526, 
        "postID": 13, 
        "quote": "", 
        "reply": "Two years ago I was having back problems and I went to the VA for help. They amputated my right arm and now my back feels fine.", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 17:45:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Whirled_Peas I rarely agree with or defend the position of SignalSgt but I dont think his post was designed in a way to implicate anyone of looking for a handout. I think he was simply saying that this guy didnt complain for so many years because that generation had a strength and courage that seems to far exceed ours today. When I was a young child, I literaly thought World war 2 soldiers were all super heroes. To me they saved the world from Nazi rule and I painted them heroically as such. I think SignalSgt feels similarly and was just pointing that out by saying this guy isnt a complainer.", 
        "intTime": 20090526, 
        "postID": 14, 
        "quote": "Whirled_Peas", 
        "reply": " I rarely agree with or defend the position of SignalSgt but I dont think his post was designed in a way to implicate anyone of looking for a handout. I think he was simply saying that this guy didnt complain for so many years because that generation had a strength and courage that seems to far exceed ours today. When I was a young child, I literaly thought World war 2 soldiers were all super heroes. To me they saved the world from Nazi rule and I painted them heroically as such. I think SignalSgt feels similarly and was just pointing that out by saying this guy isnt a complainer.", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 17:45:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "KoRnAdvocate"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Two years ago I was having back problems and I went to the VA for help. They amputated my right arm and now my back feels fine. OH!!! Jesus Christ!!!! ROTFLMYAO.......... Spoken like a true vet............", 
        "intTime": 20090526, 
        "postID": 15, 
        "quote": "Originally posted by Duster6: Two years ago I was having back problems and I went to the VA for help. They amputated my right arm and now my back feels fine.", 
        "reply": " OH!!! Jesus Christ!!!! ROTFLMYAO.......... Spoken like a true vet............", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 19:03:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by KoRnAdvocate: I think SignalSgt feels similarly I sure do and damn proud I'm a result that came from that generation.", 
        "intTime": 20090526, 
        "postID": 16, 
        "quote": "Originally posted by KoRnAdvocate: I think SignalSgt feels similarly", 
        "reply": " I sure do and damn proud I'm a result that came from that generation.", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 19:07:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by KoRnAdvocate: I think SignalSgt feels similarly I sure do and damn proud I'm a result that came from that generation. I do see that point, and I'm sorry if I seemed like I was belittling that aspect of it. Believe me, I also think today's kids are the biggest bunch of pansies and wimps ever raised. They skin their knees and the parents fuss over them like they've nearly been killed, a paper cut gets antibiotics and bandages, and if they sneeze the parents drag them to the doctor to demand antibiotics and allergy meds. I DO appreciate the toughness people used to have, and wish more people had a bit more toughness. But I still wish this guy had been able to enjoy chewing solid foods without pain for all those decades.", 
        "intTime": 20090526, 
        "postID": 17, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by KoRnAdvocate: I think SignalSgt feels similarly I sure do and damn proud I'm a result that came from that generation.", 
        "reply": " I do see that point, and I'm sorry if I seemed like I was belittling that aspect of it. Believe me, I also think today's kids are the biggest bunch of pansies and wimps ever raised. They skin their knees and the parents fuss over them like they've nearly been killed, a paper cut gets antibiotics and bandages, and if they sneeze the parents drag them to the doctor to demand antibiotics and allergy meds. I DO appreciate the toughness people used to have, and wish more people had a bit more toughness. But I still wish this guy had been able to enjoy chewing solid foods without pain for all those decades.", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 19:56:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "Whirled_Peas"
    }, 
    {
        "content": "quote: Originally posted by Whirled_Peas: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by KoRnAdvocate: I think SignalSgt feels similarly I sure do and damn proud I'm a result that came from that generation. I do see that point, and I'm sorry if I seemed like I was belittling that aspect of it. Believe me, I also think today's kids are the biggest bunch of pansies and wimps ever raised. They skin their knees and the parents fuss over them like they've nearly been killed, a paper cut gets antibiotics and bandages, and if they sneeze the parents drag them to the doctor to demand antibiotics and allergy meds. I DO appreciate the toughness people used to have, and wish more people had a bit more toughness. But I still wish this guy had been able to enjoy chewing solid foods without pain for all those decades. This guy is a brit and I'm sure, as all brits do, lived off mushy peas, beans, mince and spuds, tattie scones and washed them down with a pint of ale all his life. Hell, I couldn't even eat a british steak, tough as Maindawg, I assure you.", 
        "intTime": 20090526, 
        "postID": 18, 
        "quote": "Originally posted by Whirled_Peas: quote: Originally posted by SignalSgtWilliams: quote: Originally posted by KoRnAdvocate: I think SignalSgt feels similarly I sure do and damn proud I'm a result that came from that generation. I do see that point, and I'm sorry if I seemed like I was belittling that aspect of it. Believe me, I also think today's kids are the biggest bunch of pansies and wimps ever raised. They skin their knees and the parents fuss over them like they've nearly been killed, a paper cut gets antibiotics and bandages, and if they sneeze the parents drag them to the doctor to demand antibiotics and allergy meds. I DO appreciate the toughness people used to have, and wish more people had a bit more toughness. But I still wish this guy had been able to enjoy chewing solid foods without pain for all those decades.", 
        "reply": " This guy is a brit and I'm sure, as all brits do, lived off mushy peas, beans, mince and spuds, tattie scones and washed them down with a pint of ale all his life. Hell, I couldn't even eat a british steak, tough as Maindawg, I assure you.", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 20:15:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: I still get tiny pieces of Asphalt coming out of my eyelids and face from a 2005 IED. And when that does happen, it hurts like nothing you've ever felt, especially next to the eye. Now THAT'S what I call BTDT!!! -", 
        "intTime": 20090526, 
        "postID": 19, 
        "quote": "Originally posted by LineDoggie: I still get tiny pieces of Asphalt coming out of my eyelids and face from a 2005 IED. And when that does happen, it hurts like nothing you've ever felt, especially next to the eye.", 
        "reply": " Now THAT'S what I call BTDT!!! -", 
        "threadID": "672198221_7570003422001", 
        "time": "2009-05-26 20:57:00", 
        "title": "British Medic spits out Schrapnel 65 years later", 
        "userID": "ANZACbiscuit"
    }
]