[
    {
        "content": "According to tonights 60 minutes. Can someone point me to a law that says they Fed Reserve chairman can invoke emergecy power? \"http://www.cbsnews.com/sections/60minutes/main3415.shtml\"", 
        "intTime": 20090315, 
        "postID": 1, 
        "quote": "", 
        "reply": "According to tonights 60 minutes. Can someone point me to a law that says they Fed Reserve chairman can invoke emergecy power? \"http://www.cbsnews.com/sections/60minutes/main3415.shtml\"", 
        "threadID": "672198221_6100069712001", 
        "time": "2009-03-15 16:14:00", 
        "title": "Fed Invoked \"Emergency Power\"", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: According to tonights 60 minutes. Can someone point me to a law that says they Fed Reserve chairman can invoke emergecy power? \"http://www.cbsnews.com/sections/60minutes/main3415.shtml\" \"To that end, the Fed invoked Depression-era emergency powers to begin buying commercial paper -- short-term funding that many companies rely on to pay their workers and buy supplies\" \"http://www.etruth.com/Know/Business/Story.aspx?ID=463819\"", 
        "intTime": 20090315, 
        "postID": 2, 
        "quote": "Originally posted by crackerjacks61: According to tonights 60 minutes. Can someone point me to a law that says they Fed Reserve chairman can invoke emergecy power? \"http://www.cbsnews.com/sections/60minutes/main3415.shtml\"", 
        "reply": " \"To that end, the Fed invoked Depression-era emergency powers to begin buying commercial paper -- short-term funding that many companies rely on to pay their workers and buy supplies\" \"http://www.etruth.com/Know/Business/Story.aspx?ID=463819\"", 
        "threadID": "672198221_6100069712001", 
        "time": "2009-03-15 17:55:00", 
        "title": "Fed Invoked \"Emergency Power\"", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "The end is near..................", 
        "intTime": 20090315, 
        "postID": 3, 
        "quote": "", 
        "reply": "The end is near..................", 
        "threadID": "672198221_6100069712001", 
        "time": "2009-03-15 18:01:00", 
        "title": "Fed Invoked \"Emergency Power\"", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Tight credit has made it increasingly difficult and expensive for companies to raise money to fund their operations Executive Bonuses.", 
        "intTime": 20090315, 
        "postID": 4, 
        "quote": "", 
        "reply": "Tight credit has made it increasingly difficult and expensive for companies to raise money to fund their operations Executive Bonuses.", 
        "threadID": "672198221_6100069712001", 
        "time": "2009-03-15 18:07:00", 
        "title": "Fed Invoked \"Emergency Power\"", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I read the whole link and I read nothing about the Fed Res evoking emergency power.", 
        "intTime": 20090315, 
        "postID": 5, 
        "quote": "", 
        "reply": "I read the whole link and I read nothing about the Fed Res evoking emergency power.", 
        "threadID": "672198221_6100069712001", 
        "time": "2009-03-15 18:19:00", 
        "title": "Fed Invoked \"Emergency Power\"", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: I read the whole link and I read nothing about the Fed Res evoking emergency power. 60 minutes quote when they aired the program. Watch the vid they were talking about Bailout I. I was just wondering where this \"Emergency Power\" they have come from and what other kind of \"Emergency Power\" The Fed has.", 
        "intTime": 20090315, 
        "postID": 6, 
        "quote": "Originally posted by SignalSgtWilliams: I read the whole link and I read nothing about the Fed Res evoking emergency power.", 
        "reply": " 60 minutes quote when they aired the program. Watch the vid they were talking about Bailout I. I was just wondering where this \"Emergency Power\" they have come from and what other kind of \"Emergency Power\" The Fed has.", 
        "threadID": "672198221_6100069712001", 
        "time": "2009-03-15 18:36:00", 
        "title": "Fed Invoked \"Emergency Power\"", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "\"Aside from the President, He is the most Powerful man working to save the economy\" Keep watching and you'll hear it. \"http://www.cbsnews.com/video/watch/?id=4866969n\" They act like the Fed is some kind of God or something. My God what has the government (past scince at least 1913 and present) done to this nation.", 
        "intTime": 20090315, 
        "postID": 7, 
        "quote": "", 
        "reply": "\"Aside from the President, He is the most Powerful man working to save the economy\" Keep watching and you'll hear it. \"http://www.cbsnews.com/video/watch/?id=4866969n\" They act like the Fed is some kind of God or something. My God what has the government (past scince at least 1913 and present) done to this nation.", 
        "threadID": "672198221_6100069712001", 
        "time": "2009-03-15 18:41:00", 
        "title": "Fed Invoked \"Emergency Power\"", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "\"I believe that banking institutions are more dangerous to our liberties than standing armies. If the American people ever allow private banks to control the issue of their currency, first by inflation, then by deflation, the banks and corporations that will grow up around [the banks] will deprive the people of all property until their children wake-up homeless on the continent their fathers conquered. The issuing power should be taken from the banks and restored to the people, to whom it properly belongs. Thomas Jefferson, (Attributed) 3rd president of US (1743 - 1826) \" \"The system of banking [is] a blot left in all our Constitutions, which, if not covered, will end in their destruction... I sincerely believe that banking institutions are more dangerous than standing armies; and that the principle of spending money to be paid by posterity... is but swindling futurity on a large scale.\"", 
        "intTime": 20090315, 
        "postID": 8, 
        "quote": "", 
        "reply": "\"I believe that banking institutions are more dangerous to our liberties than standing armies. If the American people ever allow private banks to control the issue of their currency, first by inflation, then by deflation, the banks and corporations that will grow up around [the banks] will deprive the people of all property until their children wake-up homeless on the continent their fathers conquered. The issuing power should be taken from the banks and restored to the people, to whom it properly belongs. Thomas Jefferson, (Attributed) 3rd president of US (1743 - 1826) \" \"The system of banking [is] a blot left in all our Constitutions, which, if not covered, will end in their destruction... I sincerely believe that banking institutions are more dangerous than standing armies; and that the principle of spending money to be paid by posterity... is but swindling futurity on a large scale.\"", 
        "threadID": "672198221_6100069712001", 
        "time": "2009-03-15 18:49:00", 
        "title": "Fed Invoked \"Emergency Power\"", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I implore all of you to contact your Congressmen and get them to cosponsor H.R. 1207. It is in committee right now. Here is the text: ---http://www.govtrack.us/congress/billtext.xpd?bill=h111-1207 \" The inability of the colonists to get the power to issue their own money permanently out of the hands of George III and the international bankers was the prime reason for the Revolutionary War .\" Benjamin Franklin \" The division of the US into federations of equal force was decided long before the Civil War by the high financial powers of Europe. These bankers were afraid that the US, if they remained as one block, and as one nation, would attain economic and financial independence, which would upset their financial domination over the world .\" Otto Von Bismark Unfortunately, once we passed the Federal Reserve Act of 1913, we fell right back into the hands of the international bankers. Thanks Congress.", 
        "intTime": 20090315, 
        "postID": 9, 
        "quote": "", 
        "reply": "I implore all of you to contact your Congressmen and get them to cosponsor H.R. 1207. It is in committee right now. Here is the text: ---http://www.govtrack.us/congress/billtext.xpd?bill=h111-1207 \" The inability of the colonists to get the power to issue their own money permanently out of the hands of George III and the international bankers was the prime reason for the Revolutionary War .\" Benjamin Franklin \" The division of the US into federations of equal force was decided long before the Civil War by the high financial powers of Europe. These bankers were afraid that the US, if they remained as one block, and as one nation, would attain economic and financial independence, which would upset their financial domination over the world .\" Otto Von Bismark Unfortunately, once we passed the Federal Reserve Act of 1913, we fell right back into the hands of the international bankers. Thanks Congress.", 
        "threadID": "672198221_6100069712001", 
        "time": "2009-03-15 18:57:00", 
        "title": "Fed Invoked \"Emergency Power\"", 
        "userID": "10Tenths"
    }, 
    {
        "content": "How much congressional support does this have. My feelings, they will never allow it to happen because the fed is and has been the secret ruler of this nation and the world.", 
        "intTime": 20090315, 
        "postID": 10, 
        "quote": "", 
        "reply": "How much congressional support does this have. My feelings, they will never allow it to happen because the fed is and has been the secret ruler of this nation and the world.", 
        "threadID": "672198221_6100069712001", 
        "time": "2009-03-15 19:06:00", 
        "title": "Fed Invoked \"Emergency Power\"", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: \"The inability of the colonists to get the power to issue their own money permanently out of the hands of George III and the international bankers was the prime reason for the Revolutionary War.\" Benjamin Franklin Why do you suppose that was so important to them?", 
        "intTime": 20090315, 
        "postID": 11, 
        "quote": "\"The inability of the colonists to get the power to issue their own money permanently out of the hands of George III and the international bankers was the prime reason for the Revolutionary War.\" Benjamin Franklin", 
        "reply": " Why do you suppose that was so important to them?", 
        "threadID": "672198221_6100069712001", 
        "time": "2009-03-15 19:08:00", 
        "title": "Fed Invoked \"Emergency Power\"", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Well, it has 28 cosponsors as of last friday. And, with the current situation, I think now is the prime time to get more support. But, unless the people start telling their representatives that they want this bill, their representative really has no reason to support it. Unless, of course, they have a conscience. It would be nice if the Fed was subject to audit and oversight, wouldn't it? That would truly be an historic moment.", 
        "intTime": 20090315, 
        "postID": 12, 
        "quote": "", 
        "reply": "Well, it has 28 cosponsors as of last friday. And, with the current situation, I think now is the prime time to get more support. But, unless the people start telling their representatives that they want this bill, their representative really has no reason to support it. Unless, of course, they have a conscience. It would be nice if the Fed was subject to audit and oversight, wouldn't it? That would truly be an historic moment.", 
        "threadID": "672198221_6100069712001", 
        "time": "2009-03-15 19:10:00", 
        "title": "Fed Invoked \"Emergency Power\"", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: \"The inability of the colonists to get the power to issue their own money permanently out of the hands of George III and the international bankers was the prime reason for the Revolutionary War.\" Benjamin Franklin Why do you suppose that was so important to them? Which side? The colonists or the international bankers? As far as I can see, the bankers did not want the colonies to be the only place that was free from their control. As it is today, the bankers have every country on earth by the short and curlies. That is easily displayed by how much of our money is being handed right over to them. They usually do it under the guise of taxation. Now, they are doing it right out in the open. And, that is only with the publicly owned banks. Who knows how much money the Fed is giving to the private banks. They do not have to disclose such information. All the more reason to get something like HR 1207 passed. I have a feeling that if it ever does get passed, what we find will get us much closer to abolishing the Fed altogether. If you think what you see on the news today is ugly and making you mad. Just wait and see how happy you are to find out what goes on in secrecy. Yikes! This message has been edited. Last edited by: 10Tenths, Sun 15 March 2009 07:40 PM", 
        "intTime": 20090315, 
        "postID": 13, 
        "quote": "Originally posted by crackerjacks61: quote: \"The inability of the colonists to get the power to issue their own money permanently out of the hands of George III and the international bankers was the prime reason for the Revolutionary War.\" Benjamin Franklin Why do you suppose that was so important to them?", 
        "reply": " Which side? The colonists or the international bankers? As far as I can see, the bankers did not want the colonies to be the only place that was free from their control. As it is today, the bankers have every country on earth by the short and curlies. That is easily displayed by how much of our money is being handed right over to them. They usually do it under the guise of taxation. Now, they are doing it right out in the open. And, that is only with the publicly owned banks. Who knows how much money the Fed is giving to the private banks. They do not have to disclose such information. All the more reason to get something like HR 1207 passed. I have a feeling that if it ever does get passed, what we find will get us much closer to abolishing the Fed altogether. If you think what you see on the news today is ugly and making you mad. Just wait and see how happy you are to find out what goes on in secrecy. Yikes! This message has been edited. Last edited by: 10Tenths, Sun 15 March 2009 07:40 PM", 
        "threadID": "672198221_6100069712001", 
        "time": "2009-03-15 19:24:00", 
        "title": "Fed Invoked \"Emergency Power\"", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: quote: Originally posted by crackerjacks61: quote: \"The inability of the colonists to get the power to issue their own money permanently out of the hands of George III and the international bankers was the prime reason for the Revolutionary War.\" Benjamin Franklin Why do you suppose that was so important to them? Which side? The colonists or the international bankers? As far as I can see, the bankers did not want the colonies to be the only place that was free from their control. As it is today, the bankers have every country on earth by the short and curlies. That is easily displayed by how much of our money is being handed right over to them. They usually do it under the guise of taxation. Now, they are doing it right out in the open. And, that is only with the publicly owned banks. Who knows how much money the Fed is giving to the private banks. They do not have to disclose such information. All the more reason to get something like HR 1207 passed. I have a feeling that if it ever does get passed, what we find will get us much closer to abolishing the Fed altogether. If you think what you see on the news today is ugly and making you mad. Just wait and see how happy you are to find out what goes on in secrecy. Yikes! Seemed to me the Colonies enjoyed freedom over monitary dictatorship. Money may have contributed, but certainly freedom was the overall decision for the War and wanting to break from England and it's King. Now we find ourselves back in the same boat, except 1 King to worry about, now we got hundreds.", 
        "intTime": 20090316, 
        "postID": 14, 
        "quote": "Originally posted by 10tenths: quote: Originally posted by crackerjacks61: quote: \"The inability of the colonists to get the power to issue their own money permanently out of the hands of George III and the international bankers was the prime reason for the Revolutionary War.\" Benjamin Franklin Why do you suppose that was so important to them? Which side? The colonists or the international bankers? As far as I can see, the bankers did not want the colonies to be the only place that was free from their control. As it is today, the bankers have every country on earth by the short and curlies. That is easily displayed by how much of our money is being handed right over to them. They usually do it under the guise of taxation. Now, they are doing it right out in the open. And, that is only with the publicly owned banks. Who knows how much money the Fed is giving to the private banks. They do not have to disclose such information. All the more reason to get something like HR 1207 passed. I have a feeling that if it ever does get passed, what we find will get us much closer to abolishing the Fed altogether. If you think what you see on the news today is ugly and making you mad. Just wait and see how happy you are to find out what goes on in secrecy. Yikes!", 
        "reply": " Seemed to me the Colonies enjoyed freedom over monitary dictatorship. Money may have contributed, but certainly freedom was the overall decision for the War and wanting to break from England and it's King. Now we find ourselves back in the same boat, except 1 King to worry about, now we got hundreds.", 
        "threadID": "672198221_6100069712001", 
        "time": "2009-03-16 15:54:00", 
        "title": "Fed Invoked \"Emergency Power\"", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "When I can buy a new Shelby 500KR Mustang for under $35,000 then and only then will I admit our economy is in bad shape. When a box seat in Yankee Stadium or Fenway Park cost less than $50 bucks then I'll be scared.", 
        "intTime": 20090316, 
        "postID": 15, 
        "quote": "", 
        "reply": "When I can buy a new Shelby 500KR Mustang for under $35,000 then and only then will I admit our economy is in bad shape. When a box seat in Yankee Stadium or Fenway Park cost less than $50 bucks then I'll be scared.", 
        "threadID": "672198221_6100069712001", 
        "time": "2009-03-16 15:59:00", 
        "title": "Fed Invoked \"Emergency Power\"", 
        "userID": "Duster6"
    }, 
    {
        "content": "Um, that will never happen. Deflation is good for us, bad for the banks. We will most certainly see rising prices over the next decade as the Fed induces inflation. It just has not happened yet as the economy is wanting to deflate and the banks are not lending.", 
        "intTime": 20090316, 
        "postID": 16, 
        "quote": "", 
        "reply": "Um, that will never happen. Deflation is good for us, bad for the banks. We will most certainly see rising prices over the next decade as the Fed induces inflation. It just has not happened yet as the economy is wanting to deflate and the banks are not lending.", 
        "threadID": "672198221_6100069712001", 
        "time": "2009-03-16 16:28:00", 
        "title": "Fed Invoked \"Emergency Power\"", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: According to tonights 60 minutes. Can someone point me to a law that says they Fed Reserve chairman can invoke emergecy power? \"http://www.cbsnews.com/sections/60minutes/main3415.shtml\" Believe they are talking about Section 13.3 of the Federal Reserve Act, although the wording in the law is \"unusual and exigent\" and not \"emergency\".", 
        "intTime": 20090316, 
        "postID": 17, 
        "quote": "Originally posted by crackerjacks61: According to tonights 60 minutes. Can someone point me to a law that says they Fed Reserve chairman can invoke emergecy power? \"http://www.cbsnews.com/sections/60minutes/main3415.shtml\"", 
        "reply": " Believe they are talking about Section 13.3 of the Federal Reserve Act, although the wording in the law is \"unusual and exigent\" and not \"emergency\".", 
        "threadID": "672198221_6100069712001", 
        "time": "2009-03-16 16:28:00", 
        "title": "Fed Invoked \"Emergency Power\"", 
        "userID": "92guru"
    }, 
    {
        "content": "quote: Originally posted by 92guru: quote: Originally posted by crackerjacks61: According to tonights 60 minutes. Can someone point me to a law that says they Fed Reserve chairman can invoke emergecy power? \"http://www.cbsnews.com/sections/60minutes/main3415.shtml\" Believe they are talking about Section 13.3 of the Federal Reserve Act, although the wording in the law is \"unusual and exigent\" and not \"emergency\". Thanks I'll check it out. Just seems to me a man does not have a chance with all these federal agencies having power to invoke whatever they want whenever they want.", 
        "intTime": 20090316, 
        "postID": 18, 
        "quote": "Originally posted by 92guru: quote: Originally posted by crackerjacks61: According to tonights 60 minutes. Can someone point me to a law that says they Fed Reserve chairman can invoke emergecy power? \"http://www.cbsnews.com/sections/60minutes/main3415.shtml\" Believe they are talking about Section 13.3 of the Federal Reserve Act, although the wording in the law is \"unusual and exigent\" and not \"emergency\".", 
        "reply": " Thanks I'll check it out. Just seems to me a man does not have a chance with all these federal agencies having power to invoke whatever they want whenever they want.", 
        "threadID": "672198221_6100069712001", 
        "time": "2009-03-16 17:07:00", 
        "title": "Fed Invoked \"Emergency Power\"", 
        "userID": "crackerjacks61"
    }
]