[
    {
        "content": "What a monumental blunder by President Barack Obama and the Democrat congress. Failure to make the law immediate and failure to put a cap on the interest just shows how much congress and the white house are in the pockets of the banksters. What a great show they made getting all the bankers in one room and President Barack Obama chewing their butts. We see now who really got reamed. We the people.", 
        "intTime": 20090526, 
        "postID": 1, 
        "quote": "", 
        "reply": "What a monumental blunder by President Barack Obama and the Democrat congress. Failure to make the law immediate and failure to put a cap on the interest just shows how much congress and the white house are in the pockets of the banksters. What a great show they made getting all the bankers in one room and President Barack Obama chewing their butts. We see now who really got reamed. We the people.", 
        "threadID": "672198221_6300003422001", 
        "time": "2009-05-26 05:34:00", 
        "title": "Credit Card Bill!", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "Check your mail today and look for your increase. No matter that you have good credit or have had no overcharges or failure to pay on time, your interest rates will be raised to usury levels. Banksters are raising everyones rates to over 25% to 40% to get in under the time until the bill become official in 2010. You can opt out which means you can't use the card but they can't raise the interest rate. This is what most people are doing and I highly recommend doing this.", 
        "intTime": 20090526, 
        "postID": 2, 
        "quote": "", 
        "reply": "Check your mail today and look for your increase. No matter that you have good credit or have had no overcharges or failure to pay on time, your interest rates will be raised to usury levels. Banksters are raising everyones rates to over 25% to 40% to get in under the time until the bill become official in 2010. You can opt out which means you can't use the card but they can't raise the interest rate. This is what most people are doing and I highly recommend doing this.", 
        "threadID": "672198221_6300003422001", 
        "time": "2009-05-26 05:40:00", 
        "title": "Credit Card Bill!", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "I don't need to check my mail. It already happened!!! -My credit limit went from $48,200 to $15,000. -My interest rate went from 9.99% to 15.99% -I've never been late, only had a $5,000 balance, and have had the card for 7 years!!! I paid the card off, closed it, and took all my money out of the bank. I'm glad Obama is doing something, even if it doesn't take effect immediately.", 
        "intTime": 20090526, 
        "postID": 3, 
        "quote": "", 
        "reply": "I don't need to check my mail. It already happened!!! -My credit limit went from $48,200 to $15,000. -My interest rate went from 9.99% to 15.99% -I've never been late, only had a $5,000 balance, and have had the card for 7 years!!! I paid the card off, closed it, and took all my money out of the bank. I'm glad Obama is doing something, even if it doesn't take effect immediately.", 
        "threadID": "672198221_6300003422001", 
        "time": "2009-05-26 06:06:00", 
        "title": "Credit Card Bill!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "I don't think a lot of people know or realize that they can 'opt out' of the changes to their credit card. You need to \"read the fine print\" I too am changing banks and moving to a credit union. B of A can kiss my grits.", 
        "intTime": 20090526, 
        "postID": 4, 
        "quote": "", 
        "reply": "I don't think a lot of people know or realize that they can 'opt out' of the changes to their credit card. You need to \"read the fine print\" I too am changing banks and moving to a credit union. B of A can kiss my grits.", 
        "threadID": "672198221_6300003422001", 
        "time": "2009-05-26 06:42:00", 
        "title": "Credit Card Bill!", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "The bail out is the problem, it embolden the mega banks to do what ever they want. What they should have done is let one of the mega banks fail just to show them they could.", 
        "intTime": 20090526, 
        "postID": 5, 
        "quote": "", 
        "reply": "The bail out is the problem, it embolden the mega banks to do what ever they want. What they should have done is let one of the mega banks fail just to show them they could.", 
        "threadID": "672198221_6300003422001", 
        "time": "2009-05-26 06:47:00", 
        "title": "Credit Card Bill!", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: The bail out is the problem, it embolden the mega banks to do what ever they want. What they should have done is let one of the mega banks fail just to show them they could. As one who does not agree with the megabank bailouts, I agree with part of your statement however the banks have been doing what they want for years. The practices of lowering allowable credit to place customers over the limit and changing due dates to cause late charges is business as usual with these people. WHAT'S IN YOUR WALLET?", 
        "intTime": 20090526, 
        "postID": 6, 
        "quote": "Originally posted by Another4Truth: The bail out is the problem, it embolden the mega banks to do what ever they want. What they should have done is let one of the mega banks fail just to show them they could.", 
        "reply": " As one who does not agree with the megabank bailouts, I agree with part of your statement however the banks have been doing what they want for years. The practices of lowering allowable credit to place customers over the limit and changing due dates to cause late charges is business as usual with these people. WHAT'S IN YOUR WALLET?", 
        "threadID": "672198221_6300003422001", 
        "time": "2009-05-26 06:53:00", 
        "title": "Credit Card Bill!", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: The bail out is the problem, it embolden the mega banks to do what ever they want. What they should have done is let one of the mega banks fail just to show them they could. The consequences of not having the bailout would have been far worse. If Citigroup, BoA, and AIG had all failed, our economy would have completely collapsed.", 
        "intTime": 20090526, 
        "postID": 7, 
        "quote": "Originally posted by Another4Truth: The bail out is the problem, it embolden the mega banks to do what ever they want. What they should have done is let one of the mega banks fail just to show them they could.", 
        "reply": " The consequences of not having the bailout would have been far worse. If Citigroup, BoA, and AIG had all failed, our economy would have completely collapsed.", 
        "threadID": "672198221_6300003422001", 
        "time": "2009-05-26 07:20:00", 
        "title": "Credit Card Bill!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Another4Truth: The bail out is the problem, it embolden the mega banks to do what ever they want. What they should have done is let one of the mega banks fail just to show them they could. The consequences of not having the bailout would have been far worse. If Citigroup, BoA, and AIG had all failed, our economy would have completely collapsed. True, but to bail them out and not put severe limits on them is crazy. Now they are free to do what they want and whose to stop them. Business as usual. The Banksters are free from failure and free to fleece America.", 
        "intTime": 20090526, 
        "postID": 8, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Another4Truth: The bail out is the problem, it embolden the mega banks to do what ever they want. What they should have done is let one of the mega banks fail just to show them they could. The consequences of not having the bailout would have been far worse. If Citigroup, BoA, and AIG had all failed, our economy would have completely collapsed.", 
        "reply": " True, but to bail them out and not put severe limits on them is crazy. Now they are free to do what they want and whose to stop them. Business as usual. The Banksters are free from failure and free to fleece America.", 
        "threadID": "672198221_6300003422001", 
        "time": "2009-05-26 07:52:00", 
        "title": "Credit Card Bill!", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "According to the details of the bill provided in an article in our local paper (so please spare me the usual \"faux news\" crap) the changes will cost us between $500 and $600 annually. We have not had a balance in over 25 years so interest rates are on no concern, but the lack of a dividend program and the reinstatement of annual fees certainly will. On average we receive roughly $500 in dividends on 2 card and that added to the guestimate of $50 or so for an annual fee equals $550 directly out of out pockets. I guess the joke is on us - practice fiscal responsibiliy, pay the bill in full when due and not get over extended and the return is less for more - not exactly change I am comfortable living with.", 
        "intTime": 20090526, 
        "postID": 9, 
        "quote": "", 
        "reply": "According to the details of the bill provided in an article in our local paper (so please spare me the usual \"faux news\" crap) the changes will cost us between $500 and $600 annually. We have not had a balance in over 25 years so interest rates are on no concern, but the lack of a dividend program and the reinstatement of annual fees certainly will. On average we receive roughly $500 in dividends on 2 card and that added to the guestimate of $50 or so for an annual fee equals $550 directly out of out pockets. I guess the joke is on us - practice fiscal responsibiliy, pay the bill in full when due and not get over extended and the return is less for more - not exactly change I am comfortable living with.", 
        "threadID": "672198221_6300003422001", 
        "time": "2009-05-26 08:09:00", 
        "title": "Credit Card Bill!", 
        "userID": "adminnco1"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: quote: Originally posted by mrmixitup: quote: Originally posted by Another4Truth: The bail out is the problem, it embolden the mega banks to do what ever they want. What they should have done is let one of the mega banks fail just to show them they could. The consequences of not having the bailout would have been far worse. If Citigroup, BoA, and AIG had all failed, our economy would have completely collapsed. True, but to bail them out and not put severe limits on them is crazy. Now they are free to do what they want and whose to stop them. Business as usual. The Banksters are free from failure and free to fleece America. Agreed, I am with BOA (Bank of Arses) and ready to switch banks after 13 years with them. They raised my credit card rates as well and I have never been late. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 10, 
        "quote": "Originally posted by Another4Truth: quote: Originally posted by mrmixitup: quote: Originally posted by Another4Truth: The bail out is the problem, it embolden the mega banks to do what ever they want. What they should have done is let one of the mega banks fail just to show them they could. The consequences of not having the bailout would have been far worse. If Citigroup, BoA, and AIG had all failed, our economy would have completely collapsed. True, but to bail them out and not put severe limits on them is crazy. Now they are free to do what they want and whose to stop them. Business as usual. The Banksters are free from failure and free to fleece America.", 
        "reply": " Agreed, I am with BOA (Bank of Arses) and ready to switch banks after 13 years with them. They raised my credit card rates as well and I have never been late. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6300003422001", 
        "time": "2009-05-26 08:10:00", 
        "title": "Credit Card Bill!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Another4Truth: The bail out is the problem, it embolden the mega banks to do what ever they want. What they should have done is let one of the mega banks fail just to show them they could. The consequences of not having the bailout would have been far worse. If Citigroup, BoA, and AIG had all failed, our economy would have completely collapsed. From the pespective of the banks that may well be true. The prospect of out of control inflation coupled with increased unemployment will no doubt lead to the same thing, with the exception that the bankers will be very comfortable while the rest of us scramble to make ends meet. This message has been edited. Last edited by: adminnco1, Tue 26 May 2009 08:32 AM", 
        "intTime": 20090526, 
        "postID": 11, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Another4Truth: The bail out is the problem, it embolden the mega banks to do what ever they want. What they should have done is let one of the mega banks fail just to show them they could. The consequences of not having the bailout would have been far worse. If Citigroup, BoA, and AIG had all failed, our economy would have completely collapsed.", 
        "reply": " From the pespective of the banks that may well be true. The prospect of out of control inflation coupled with increased unemployment will no doubt lead to the same thing, with the exception that the bankers will be very comfortable while the rest of us scramble to make ends meet. This message has been edited. Last edited by: adminnco1, Tue 26 May 2009 08:32 AM", 
        "threadID": "672198221_6300003422001", 
        "time": "2009-05-26 08:13:00", 
        "title": "Credit Card Bill!", 
        "userID": "adminnco1"
    }, 
    {
        "content": "/ / / / / I don't know what all the fuss about?!! You can do what I did with my Bank of America credit card! I paid off my credit card bill, called them up and told them to cancel my card! Then I give them a earful on why I will NEVER use their credit card again! Now if you can convince at lease 75% of the people in the USA to cancel their credit cards then you see them changing their ways. But now we have a bunch of sheep who are too scared to do it! Baaa Baaah!", 
        "intTime": 20090526, 
        "postID": 12, 
        "quote": "", 
        "reply": "/ / / / / I don't know what all the fuss about?!! You can do what I did with my Bank of America credit card! I paid off my credit card bill, called them up and told them to cancel my card! Then I give them a earful on why I will NEVER use their credit card again! Now if you can convince at lease 75% of the people in the USA to cancel their credit cards then you see them changing their ways. But now we have a bunch of sheep who are too scared to do it! Baaa Baaah!", 
        "threadID": "672198221_6300003422001", 
        "time": "2009-05-26 08:34:00", 
        "title": "Credit Card Bill!", 
        "userID": "SSGDuke53"
    }, 
    {
        "content": "I call the bankers 'Banksters' now which is a contraction of bankers, mobsters and gangsters. I think it fits!", 
        "intTime": 20090526, 
        "postID": 13, 
        "quote": "", 
        "reply": "I call the bankers 'Banksters' now which is a contraction of bankers, mobsters and gangsters. I think it fits!", 
        "threadID": "672198221_6300003422001", 
        "time": "2009-05-26 08:44:00", 
        "title": "Credit Card Bill!", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by SSGDuke53: / / / / / I don't know what all the fuss about?!! You can do what I did with my Bank of America credit card! I paid off my credit card bill, called them up and told them to cancel my card! Then I give them a earful on why I will NEVER use their credit card again! Now if you can convince at lease 75% of the people in the USA to cancel their credit cards then you see them changing their ways. But now we have a bunch of sheep who are too scared to do it! Baaa Baaah! I'm not so sure of that. Most of the folks I talk to have been hit by the recent credit card fraud perpetuated by the credit card companies and have opted out, as have I. What I don’t yet understand is that the companies don’t seem to be getting the message. Wake up American, it’s time to get off of the credit nipple. Let these *******s go out of business.", 
        "intTime": 20090526, 
        "postID": 14, 
        "quote": "Originally posted by SSGDuke53: / / / / / I don't know what all the fuss about?!! You can do what I did with my Bank of America credit card! I paid off my credit card bill, called them up and told them to cancel my card! Then I give them a earful on why I will NEVER use their credit card again! Now if you can convince at lease 75% of the people in the USA to cancel their credit cards then you see them changing their ways. But now we have a bunch of sheep who are too scared to do it! Baaa Baaah!", 
        "reply": " I'm not so sure of that. Most of the folks I talk to have been hit by the recent credit card fraud perpetuated by the credit card companies and have opted out, as have I. What I don’t yet understand is that the companies don’t seem to be getting the message. Wake up American, it’s time to get off of the credit nipple. Let these *******s go out of business.", 
        "threadID": "672198221_6300003422001", 
        "time": "2009-05-26 08:49:00", 
        "title": "Credit Card Bill!", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by SSGDuke53: / / / / / I don't know what all the fuss about?!! You can do what I did with my Bank of America credit card! I paid off my credit card bill, called them up and told them to cancel my card! Then I give them a earful on why I will NEVER use their credit card again! Now if you can convince at lease 75% of the people in the USA to cancel their credit cards then you see them changing their ways. But now we have a bunch of sheep who are too scared to do it! Baaa Baaah! I'm not so sure of that. Most of the folks I talk to have been hit by the recent credit card fraud perpetuated by the credit card companies and have opted out, as have I. What I don’t yet understand is that the companies don’t seem to be getting the message. Wake up American, it’s time to get off of the credit nipple. Let these *******s go out of business.", 
        "intTime": 20090526, 
        "postID": 15, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by SSGDuke53: / / / / / I don't know what all the fuss about?!! You can do what I did with my Bank of America credit card! I paid off my credit card bill, called them up and told them to cancel my card! Then I give them a earful on why I will NEVER use their credit card again! Now if you can convince at lease 75% of the people in the USA to cancel their credit cards then you see them changing their ways. But now we have a bunch of sheep who are too scared to do it! Baaa Baaah! I'm not so sure of that. Most of the folks I talk to have been hit by the recent credit card fraud perpetuated by the credit card companies and have opted out, as have I. What I don’t yet understand is that the companies don’t seem to be getting the message. Wake up American, it’s time to get off of the credit nipple. Let these *******s go out of business.", 
        "reply": "", 
        "threadID": "672198221_6300003422001", 
        "time": "2009-05-26 09:50:00", 
        "title": "Credit Card Bill!", 
        "userID": "6837602"
    }, 
    {
        "content": "So far, I haven't had any problems with my cards. In fact, my latest Am Ex card gave us the highest limit we've ever had. None of our limits have been lowered. I don't worry about interest rates. I haven't paid interest on a credit card in 20 years. I don't charge more than I can pay off each month. If any of them start charging annual fees, we'll probably drop them. But don't worry. The credit card industry is very competative. As soon as some of them start adding annual fees, others will be coming out advertising no annual fees! Actually, I don't think we'll see very many of them starting the annual fees. They won't want to lose their good customers. People who like to use credit cards for their convenience, and who are never late with payments, are good customers. Every time they use the card, the company makes money on the transaction. They aren't going to want to lose those customers. As for Bank of America, I try to avoid them for their poor service. I don't use banks that don't give good service. I just closed out one account simply because I couldn't change my address on line. I'm fixing to close another because they want to charge me monthly, every time I don't use their on line bill pay system, a service they advertise as completely free for members. (I mean really, a charge for not using a service?)", 
        "intTime": 20090526, 
        "postID": 16, 
        "quote": "", 
        "reply": "So far, I haven't had any problems with my cards. In fact, my latest Am Ex card gave us the highest limit we've ever had. None of our limits have been lowered. I don't worry about interest rates. I haven't paid interest on a credit card in 20 years. I don't charge more than I can pay off each month. If any of them start charging annual fees, we'll probably drop them. But don't worry. The credit card industry is very competative. As soon as some of them start adding annual fees, others will be coming out advertising no annual fees! Actually, I don't think we'll see very many of them starting the annual fees. They won't want to lose their good customers. People who like to use credit cards for their convenience, and who are never late with payments, are good customers. Every time they use the card, the company makes money on the transaction. They aren't going to want to lose those customers. As for Bank of America, I try to avoid them for their poor service. I don't use banks that don't give good service. I just closed out one account simply because I couldn't change my address on line. I'm fixing to close another because they want to charge me monthly, every time I don't use their on line bill pay system, a service they advertise as completely free for members. (I mean really, a charge for not using a service?)", 
        "threadID": "672198221_6300003422001", 
        "time": "2009-05-26 13:55:00", 
        "title": "Credit Card Bill!", 
        "userID": "witko1"
    }
]