[
    {
        "content": "quote: Iranians flocked en masse to celebrate thirty years since the 1979 Islamic revolution that toppled the Shah's regime. But unlike their elders, some young Iranians seized on the occasion to go far a hike, taking their hookah pipe with them. Iran. The name invokes countless images of a country that is stubborn, Islamic, revolutionary, isolated; but also proud, educated, modern and dynamic. The true face of modern-day Iran eludes most Westerners. FRANCE 24's Sophie Claudet and Alexandra Renard report from a country of a thousand and one contradictions. Thirty years ago, in February 1979, in the full glare of the world's media, the Ayatollah Khomeini flew back from exile in France, and overthrew Iran's Western-backed Shah. Iran's shift from monarchic to religious leadership was sudden, violent, and irrevocable. And this year's anniversary celebrations for the revolution have been intense. Like every year, tens of thousands of Iranians gathered to commemorate the anniversary by singing revolutionary songs. Businesses and schools are shut, and many families make it a day out. The father of the revolution, the Ayatollah Khomeini, is still celebrated as a hero, and the popular slogans “Down with Israel, down with the USA” are still on the crowd’s lips, even while President Mahmoud Ahmadinejad announced that \"the Iranian nation is ready for talks [with Washington], based on mutual respect.\" People who have gathered to celebrate the revolution’s anniversary seem less concerned with their president’s current diplomatic efforts, than with honouring the past. “The revolution took back our rights, it allowed us to stand on our own two feet, to defend our own rights, to have independence,” says one man in the crowd. Women also speak of the achievements attributed to the revolution. “Women's freedom is one of the most important ones,” explains one marcher, “I’m not talking about freedom to wear or not to wear the hijab, I’m talking about freedom in society. 60 percent of university students are women.” But not all Iranians celebrate the revolution the same way. North of Tehran, at the foot of a mountain, young people go for a hike, taking their hookah pipe with them. While the women wear veils, they are not tightly fastened, and some couples even choose to hold hands. Young people who were born well after the revolution are often not particularly inspired by the 30th anniversary celebrations. “We’d rather go the mountain,” says one young woman jokingly, “this is a march as well.” Valentine's Day Iran may be steeped in tradition and history, but two thirds of Iranians are under the age of 25, and are increasingly urban in culture. Tehran is a mega-tropolis that counts 12 million people. Every year the numbers swell as people flood in from the countryside. Almost all children go to school and then to university. Not just boys, but girls too -an achievement of the Islamic revolution that proud Iranians like to point out. Yet even the most traditionally-minded Iranians will tell you there is a long way to go before women achieve equality. “Since its shift to a religious state our country has placed a lower value on women from the start,” shares Fatimeh, a law student at the University of Tehran. “But this is changing now, bit by bit. We have to start from the grassroots and I believe things are improving.” Some young people are even willing to question what they consider the burdens of religious conservatism. Marzieh, an architecture student, has issues with the “morality police”: “Don’t tell me how I have to dress and don’t tell me how I have to be. That’s something that bothers me a lot and I think everybody in Iran is unhappy about that situation.” In a country that celebrates the anniversary of the overthrow of the Western-backed Shah in full fervor, young people are also evermore inclined to adopt Western holidays. In a trendy restaurant, a little off the beaten track in central Tehran, couples and groups of young people celebrate Valentine's Day. Twenty-eight-year-old Livniz and 25-year-old Sarah are far from a traditional couple. They are not married and they often go out in the evenings, without a chaperone. Over on the next table is a group of young men. They too are celebrating the festival of lovers, but very discreetly as homosexuality is punishable by death in Iran. “My birthday falls on Valentine's Day so we celebrated both,” says one man who chose not to be identified, “We take whatever reason to celebrate.” In spite of the risks, some gays are prepared to break taboos in public. Perhaps more surprisingly, the ultra-conservative regime is prepared to accept sex changes and even sometimes even funds sex change operations. Interesting article, and certainly paints a different picture of ordinary Iranians! +http://www.france24.com/en/20090403-iran-unfinished-islamic-revolution-youth-reporters-anniversary-30-years \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090410, 
        "postID": 1, 
        "quote": "Iranians flocked en masse to celebrate thirty years since the 1979 Islamic revolution that toppled the Shah's regime. But unlike their elders, some young Iranians seized on the occasion to go far a hike, taking their hookah pipe with them. Iran. The name invokes countless images of a country that is stubborn, Islamic, revolutionary, isolated; but also proud, educated, modern and dynamic. The true face of modern-day Iran eludes most Westerners. FRANCE 24's Sophie Claudet and Alexandra Renard report from a country of a thousand and one contradictions. Thirty years ago, in February 1979, in the full glare of the world's media, the Ayatollah Khomeini flew back from exile in France, and overthrew Iran's Western-backed Shah. Iran's shift from monarchic to religious leadership was sudden, violent, and irrevocable. And this year's anniversary celebrations for the revolution have been intense. Like every year, tens of thousands of Iranians gathered to commemorate the anniversary by singing revolutionary songs. Businesses and schools are shut, and many families make it a day out. The father of the revolution, the Ayatollah Khomeini, is still celebrated as a hero, and the popular slogans “Down with Israel, down with the USA” are still on the crowd’s lips, even while President Mahmoud Ahmadinejad announced that \"the Iranian nation is ready for talks [with Washington], based on mutual respect.\" People who have gathered to celebrate the revolution’s anniversary seem less concerned with their president’s current diplomatic efforts, than with honouring the past. “The revolution took back our rights, it allowed us to stand on our own two feet, to defend our own rights, to have independence,” says one man in the crowd. Women also speak of the achievements attributed to the revolution. “Women's freedom is one of the most important ones,” explains one marcher, “I’m not talking about freedom to wear or not to wear the hijab, I’m talking about freedom in society. 60 percent of university students are women.” But not all Iranians celebrate the revolution the same way. North of Tehran, at the foot of a mountain, young people go for a hike, taking their hookah pipe with them. While the women wear veils, they are not tightly fastened, and some couples even choose to hold hands. Young people who were born well after the revolution are often not particularly inspired by the 30th anniversary celebrations. “We’d rather go the mountain,” says one young woman jokingly, “this is a march as well.” Valentine's Day Iran may be steeped in tradition and history, but two thirds of Iranians are under the age of 25, and are increasingly urban in culture. Tehran is a mega-tropolis that counts 12 million people. Every year the numbers swell as people flood in from the countryside. Almost all children go to school and then to university. Not just boys, but girls too -an achievement of the Islamic revolution that proud Iranians like to point out. Yet even the most traditionally-minded Iranians will tell you there is a long way to go before women achieve equality. “Since its shift to a religious state our country has placed a lower value on women from the start,” shares Fatimeh, a law student at the University of Tehran. “But this is changing now, bit by bit. We have to start from the grassroots and I believe things are improving.” Some young people are even willing to question what they consider the burdens of religious conservatism. Marzieh, an architecture student, has issues with the “morality police”: “Don’t tell me how I have to dress and don’t tell me how I have to be. That’s something that bothers me a lot and I think everybody in Iran is unhappy about that situation.” In a country that celebrates the anniversary of the overthrow of the Western-backed Shah in full fervor, young people are also evermore inclined to adopt Western holidays. In a trendy restaurant, a little off the beaten track in central Tehran, couples and groups of young people celebrate Valentine's Day. Twenty-eight-year-old Livniz and 25-year-old Sarah are far from a traditional couple. They are not married and they often go out in the evenings, without a chaperone. Over on the next table is a group of young men. They too are celebrating the festival of lovers, but very discreetly as homosexuality is punishable by death in Iran. “My birthday falls on Valentine's Day so we celebrated both,” says one man who chose not to be identified, “We take whatever reason to celebrate.” In spite of the risks, some gays are prepared to break taboos in public. Perhaps more surprisingly, the ultra-conservative regime is prepared to accept sex changes and even sometimes even funds sex change operations.", 
        "reply": " Interesting article, and certainly paints a different picture of ordinary Iranians! +http://www.france24.com/en/20090403-iran-unfinished-islamic-revolution-youth-reporters-anniversary-30-years \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_2260073022001", 
        "time": "2009-04-10 12:50:00", 
        "title": "Iran's unfinished revolution", 
        "userID": "NSNN"
    }, 
    {
        "content": "marching, not Iranian why we fight?", 
        "intTime": 20090411, 
        "postID": 2, 
        "quote": "", 
        "reply": "marching, not Iranian why we fight?", 
        "threadID": "672198221_2260073022001", 
        "time": "2009-04-11 11:29:00", 
        "title": "Iran's unfinished revolution", 
        "userID": "EAG154"
    }, 
    {
        "content": "Is it me or is there a dirty old man in that picture?", 
        "intTime": 20090411, 
        "postID": 3, 
        "quote": "", 
        "reply": "Is it me or is there a dirty old man in that picture?", 
        "threadID": "672198221_2260073022001", 
        "time": "2009-04-11 14:22:00", 
        "title": "Iran's unfinished revolution", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by EAG154: marching, not Iranian why we fight? WOW!... O.K., I give, who are they and do they take male recruits?... Though I think that marching in those heels would be a bit hard on the feet... NO, YOU SMART AZZEZ, I DON'T KNOW FROM PRACTICAL EXPERIENCE!... SHEEZ!... LOL Respectfully, SUNLINER81", 
        "intTime": 20090411, 
        "postID": 4, 
        "quote": "Originally posted by EAG154: marching, not Iranian why we fight?", 
        "reply": " WOW!... O.K., I give, who are they and do they take male recruits?... Though I think that marching in those heels would be a bit hard on the feet... NO, YOU SMART AZZEZ, I DON'T KNOW FROM PRACTICAL EXPERIENCE!... SHEEZ!... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_2260073022001", 
        "time": "2009-04-11 15:01:00", 
        "title": "Iran's unfinished revolution", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "I admit I had to get my glasses on for this one. Still couldn't read the emblems. Started to save the photo and the name of the photo comes back \"Ukrainian Army\". The secret is out.", 
        "intTime": 20090411, 
        "postID": 5, 
        "quote": "", 
        "reply": "I admit I had to get my glasses on for this one. Still couldn't read the emblems. Started to save the photo and the name of the photo comes back \"Ukrainian Army\". The secret is out.", 
        "threadID": "672198221_2260073022001", 
        "time": "2009-04-11 15:47:00", 
        "title": "Iran's unfinished revolution", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: I admit I had to get my glasses on for this one. Still couldn't read the emblems. Started to save the photo and the name of the photo comes back \"Ukrainian Army\". The secret is out. COMRADE!... I gotta 6X6 full of nylons, Hershey bars, cartons of cigarettes and cases of whiskey, wanna date?... Sheez!... LOL Respectfully, SUNLINER81", 
        "intTime": 20090411, 
        "postID": 6, 
        "quote": "Originally posted by rayevinsonsr: I admit I had to get my glasses on for this one. Still couldn't read the emblems. Started to save the photo and the name of the photo comes back \"Ukrainian Army\". The secret is out.", 
        "reply": " COMRADE!... I gotta 6X6 full of nylons, Hershey bars, cartons of cigarettes and cases of whiskey, wanna date?... Sheez!... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_2260073022001", 
        "time": "2009-04-11 15:52:00", 
        "title": "Iran's unfinished revolution", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: I admit I had to get my glasses on for this one. Still couldn't read the emblems. Started to save the photo and the name of the photo comes back \"Ukrainian Army\". The secret is out. That would be the Royal Ukrainian Corps of Field Mattresses? These are Iranian gals:", 
        "intTime": 20090412, 
        "postID": 7, 
        "quote": "Originally posted by rayevinsonsr: I admit I had to get my glasses on for this one. Still couldn't read the emblems. Started to save the photo and the name of the photo comes back \"Ukrainian Army\". The secret is out.", 
        "reply": " That would be the Royal Ukrainian Corps of Field Mattresses? These are Iranian gals:", 
        "threadID": "672198221_2260073022001", 
        "time": "2009-04-12 18:11:00", 
        "title": "Iran's unfinished revolution", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: quote: Originally posted by rayevinsonsr: I admit I had to get my glasses on for this one. Still couldn't read the emblems. Started to save the photo and the name of the photo comes back \"Ukrainian Army\". The secret is out. That would be the Royal Ukrainian Corps of Field Mattresses? These are Iranian gals: Whew, used field mattresses... LOL Respectfully, SUNLINER81", 
        "intTime": 20090412, 
        "postID": 8, 
        "quote": "Originally posted by popsiq: quote: Originally posted by rayevinsonsr: I admit I had to get my glasses on for this one. Still couldn't read the emblems. Started to save the photo and the name of the photo comes back \"Ukrainian Army\". The secret is out. That would be the Royal Ukrainian Corps of Field Mattresses? These are Iranian gals:", 
        "reply": " Whew, used field mattresses... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_2260073022001", 
        "time": "2009-04-12 21:47:00", 
        "title": "Iran's unfinished revolution", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by popsiq: quote: Originally posted by rayevinsonsr: I admit I had to get my glasses on for this one. Still couldn't read the emblems. Started to save the photo and the name of the photo comes back \"Ukrainian Army\". The secret is out. That would be the Royal Ukrainian Corps of Field Mattresses? These are Iranian gals: Whew, used field mattresses... LOL Respectfully, SUNLINER81 Beauty is only a light switch away.", 
        "intTime": 20090413, 
        "postID": 9, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by popsiq: quote: Originally posted by rayevinsonsr: I admit I had to get my glasses on for this one. Still couldn't read the emblems. Started to save the photo and the name of the photo comes back \"Ukrainian Army\". The secret is out. That would be the Royal Ukrainian Corps of Field Mattresses? These are Iranian gals: Whew, used field mattresses... LOL Respectfully, SUNLINER81", 
        "reply": " Beauty is only a light switch away.", 
        "threadID": "672198221_2260073022001", 
        "time": "2009-04-13 01:00:00", 
        "title": "Iran's unfinished revolution", 
        "userID": "world_king377"
    }, 
    {
        "content": "quote: Originally posted by world_king377: quote: Originally posted by SUNLINER81: quote: Originally posted by popsiq: quote: Originally posted by rayevinsonsr: I admit I had to get my glasses on for this one. Still couldn't read the emblems. Started to save the photo and the name of the photo comes back \"Ukrainian Army\". The secret is out. That would be the Royal Ukrainian Corps of Field Mattresses? These are Iranian gals: Whew, used field mattresses... LOL Respectfully, SUNLINER81 Beauty is only a light switch away. And when you wake up, you pull a \"coyote\", to get away!... LOL Respectfully, SUNLINER81", 
        "intTime": 20090413, 
        "postID": 10, 
        "quote": "Originally posted by world_king377: quote: Originally posted by SUNLINER81: quote: Originally posted by popsiq: quote: Originally posted by rayevinsonsr: I admit I had to get my glasses on for this one. Still couldn't read the emblems. Started to save the photo and the name of the photo comes back \"Ukrainian Army\". The secret is out. That would be the Royal Ukrainian Corps of Field Mattresses? These are Iranian gals: Whew, used field mattresses... LOL Respectfully, SUNLINER81 Beauty is only a light switch away.", 
        "reply": " And when you wake up, you pull a \"coyote\", to get away!... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_2260073022001", 
        "time": "2009-04-13 02:29:00", 
        "title": "Iran's unfinished revolution", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by world_king377: quote: Originally posted by SUNLINER81: quote: Originally posted by popsiq: quote: Originally posted by rayevinsonsr: I admit I had to get my glasses on for this one. Still couldn't read the emblems. Started to save the photo and the name of the photo comes back \"Ukrainian Army\". The secret is out. That would be the Royal Ukrainian Corps of Field Mattresses? These are Iranian gals: Whew, used field mattresses... LOL Respectfully, SUNLINER81 Beauty is only a light switch away. A light switch & a fair amount of alcohol!", 
        "intTime": 20090413, 
        "postID": 11, 
        "quote": "Originally posted by world_king377: quote: Originally posted by SUNLINER81: quote: Originally posted by popsiq: quote: Originally posted by rayevinsonsr: I admit I had to get my glasses on for this one. Still couldn't read the emblems. Started to save the photo and the name of the photo comes back \"Ukrainian Army\". The secret is out. That would be the Royal Ukrainian Corps of Field Mattresses? These are Iranian gals: Whew, used field mattresses... LOL Respectfully, SUNLINER81 Beauty is only a light switch away.", 
        "reply": " A light switch & a fair amount of alcohol!", 
        "threadID": "672198221_2260073022001", 
        "time": "2009-04-13 07:19:00", 
        "title": "Iran's unfinished revolution", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by 67NOV: quote: Originally posted by world_king377: quote: Originally posted by SUNLINER81: quote: Originally posted by popsiq: quote: Originally posted by rayevinsonsr: I admit I had to get my glasses on for this one. Still couldn't read the emblems. Started to save the photo and the name of the photo comes back \"Ukrainian Army\". The secret is out. That would be the Royal Ukrainian Corps of Field Mattresses? These are Iranian gals: Whew, used field mattresses... LOL Respectfully, SUNLINER81 Beauty is only a light switch away. A light switch & a fair amount of alcohol! And two bags, one for her and one for you, in case her's falls off!... LOL Respectfully, SUNLINER81", 
        "intTime": 20090413, 
        "postID": 12, 
        "quote": "Originally posted by 67NOV: quote: Originally posted by world_king377: quote: Originally posted by SUNLINER81: quote: Originally posted by popsiq: quote: Originally posted by rayevinsonsr: I admit I had to get my glasses on for this one. Still couldn't read the emblems. Started to save the photo and the name of the photo comes back \"Ukrainian Army\". The secret is out. That would be the Royal Ukrainian Corps of Field Mattresses? These are Iranian gals: Whew, used field mattresses... LOL Respectfully, SUNLINER81 Beauty is only a light switch away. A light switch & a fair amount of alcohol!", 
        "reply": " And two bags, one for her and one for you, in case her's falls off!... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_2260073022001", 
        "time": "2009-04-13 15:06:00", 
        "title": "Iran's unfinished revolution", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Wasn't the very fit bint from the awful JAG (Google supplies the name Catherine Bell) of Iranian extraction? I also recall thinking that the Iranian emigre stand up Shappi Khorsandi was quite pretty when I saw her on telly the other day. So they aren't all rough monobrows... unless all the attractive ones have felt the country.", 
        "intTime": 20090413, 
        "postID": 13, 
        "quote": "", 
        "reply": "Wasn't the very fit bint from the awful JAG (Google supplies the name Catherine Bell) of Iranian extraction? I also recall thinking that the Iranian emigre stand up Shappi Khorsandi was quite pretty when I saw her on telly the other day. So they aren't all rough monobrows... unless all the attractive ones have felt the country.", 
        "threadID": "672198221_2260073022001", 
        "time": "2009-04-13 17:02:00", 
        "title": "Iran's unfinished revolution", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: Wasn't the very fit bint from the awful JAG (Google supplies the name Catherine Bell) of Iranian extraction? I also recall thinking that the Iranian emigre stand up Shappi Khorsandi was quite pretty when I saw her on telly the other day. So they aren't all rough monobrows... unless all the attractive ones have felt the country. If you look at the above picture of the Iranian women, you'd think that all of the pretty ones did leave... Yes, the actress on JAG, miserable show, was of Iranian extraction... Hope that she isn't the exception to the rule... LOL Respectfully, SUNLINER81", 
        "intTime": 20090413, 
        "postID": 14, 
        "quote": "Originally posted by Bladensburg: Wasn't the very fit bint from the awful JAG (Google supplies the name Catherine Bell) of Iranian extraction? I also recall thinking that the Iranian emigre stand up Shappi Khorsandi was quite pretty when I saw her on telly the other day. So they aren't all rough monobrows... unless all the attractive ones have felt the country.", 
        "reply": " If you look at the above picture of the Iranian women, you'd think that all of the pretty ones did leave... Yes, the actress on JAG, miserable show, was of Iranian extraction... Hope that she isn't the exception to the rule... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_2260073022001", 
        "time": "2009-04-13 17:16:00", 
        "title": "Iran's unfinished revolution", 
        "userID": "SUNLINER81"
    }
]