[
    {
        "content": "Those two Boarder Patrol agents that were sent to prison for shooting that Mexican drug dealer and were pardoned by Bush gave their first TV interview. They were on the Glenn Beck show of Fox news. Mr. Beck never stopped caring about them and one of them thanked him live on TV for taking the time to help and look out for his family while he was in Prison. They have been under House Arrest for the past 30 days and still can't talk allot about their case because they have a Supreme Court Case coming up to clear their names. I guess the other news networks will be falling all over their selfs now trying to get an interview. Can't wait to see how NBC is going to cover this story.", 
        "intTime": 20090320, 
        "postID": 1, 
        "quote": "", 
        "reply": "Those two Boarder Patrol agents that were sent to prison for shooting that Mexican drug dealer and were pardoned by Bush gave their first TV interview. They were on the Glenn Beck show of Fox news. Mr. Beck never stopped caring about them and one of them thanked him live on TV for taking the time to help and look out for his family while he was in Prison. They have been under House Arrest for the past 30 days and still can't talk allot about their case because they have a Supreme Court Case coming up to clear their names. I guess the other news networks will be falling all over their selfs now trying to get an interview. Can't wait to see how NBC is going to cover this story.", 
        "threadID": "672198221_5610054812001", 
        "time": "2009-03-20 15:16:00", 
        "title": "The two border patrol agents give their first TV interview.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Got a link?", 
        "intTime": 20090320, 
        "postID": 2, 
        "quote": "", 
        "reply": "Got a link?", 
        "threadID": "672198221_5610054812001", 
        "time": "2009-03-20 16:02:00", 
        "title": "The two border patrol agents give their first TV interview.", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Link please, Duster. Otherwise this thread will be moved to General Discussion. Thanks!", 
        "intTime": 20090320, 
        "postID": 3, 
        "quote": "", 
        "reply": "Link please, Duster. Otherwise this thread will be moved to General Discussion. Thanks!", 
        "threadID": "672198221_5610054812001", 
        "time": "2009-03-20 17:12:00", 
        "title": "The two border patrol agents give their first TV interview.", 
        "userID": "pipedreamsandbabies"
    }, 
    {
        "content": "I don't have a link. I was just making this story up....Please, I beg you all not to go on goggle.com and look up the Glenn Beck show or program. Please don't do it. You will ruin my reputation.", 
        "intTime": 20090320, 
        "postID": 4, 
        "quote": "", 
        "reply": "I don't have a link. I was just making this story up....Please, I beg you all not to go on goggle.com and look up the Glenn Beck show or program. Please don't do it. You will ruin my reputation.", 
        "threadID": "672198221_5610054812001", 
        "time": "2009-03-20 19:40:00", 
        "title": "The two border patrol agents give their first TV interview.", 
        "userID": "Duster6"
    }, 
    {
        "content": "Duster6, you should know better than post good stuff on here,the libs hate that!!and shooting a drug runnin criminal,well it's just un-American. Your reputation????????????????.", 
        "intTime": 20090320, 
        "postID": 5, 
        "quote": "", 
        "reply": "Duster6, you should know better than post good stuff on here,the libs hate that!!and shooting a drug runnin criminal,well it's just un-American. Your reputation????????????????.", 
        "threadID": "672198221_5610054812001", 
        "time": "2009-03-20 19:51:00", 
        "title": "The two border patrol agents give their first TV interview.", 
        "userID": "KSHAYMAN"
    }, 
    {
        "content": "A link for the interview. \"www.glennbeck.com/content/articles/article/196/22979/\"", 
        "intTime": 20090320, 
        "postID": 6, 
        "quote": "", 
        "reply": "A link for the interview. \"www.glennbeck.com/content/articles/article/196/22979/\"", 
        "threadID": "672198221_5610054812001", 
        "time": "2009-03-20 20:03:00", 
        "title": "The two border patrol agents give their first TV interview.", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "quote: Originally posted by gypsysnipe: A link for the interview. \"www.glennbeck.com/content/articles/article/196/22979/\" gypsysnipe, why do you always step in and save me? I never fib about things I post on In The News. I just want these others to do their own homework. If they don't they will never learn anything.", 
        "intTime": 20090320, 
        "postID": 7, 
        "quote": "Originally posted by gypsysnipe: A link for the interview. \"www.glennbeck.com/content/articles/article/196/22979/\"", 
        "reply": " gypsysnipe, why do you always step in and save me? I never fib about things I post on In The News. I just want these others to do their own homework. If they don't they will never learn anything.", 
        "threadID": "672198221_5610054812001", 
        "time": "2009-03-20 20:08:00", 
        "title": "The two border patrol agents give their first TV interview.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: quote: Originally posted by gypsysnipe: A link for the interview. \"www.glennbeck.com/content/articles/article/196/22979/\" gypsysnipe, why do you always step in and save me? I never fib about things I post on In The News. I just want these others to do their own homework. If they don't they will never learn anything. Ahh, because it's part of my job?", 
        "intTime": 20090320, 
        "postID": 8, 
        "quote": "Originally posted by Duster6: quote: Originally posted by gypsysnipe: A link for the interview. \"www.glennbeck.com/content/articles/article/196/22979/\" gypsysnipe, why do you always step in and save me? I never fib about things I post on In The News. I just want these others to do their own homework. If they don't they will never learn anything.", 
        "reply": " Ahh, because it's part of my job?", 
        "threadID": "672198221_5610054812001", 
        "time": "2009-03-20 20:43:00", 
        "title": "The two border patrol agents give their first TV interview.", 
        "userID": "gypsysnipe"
    }, 
    {
        "content": "Of all the things Bush did that really ticked me off, this one was the worst. The fact that two border patrol agents sat in prison for 2.5 years for shooting a drug dealer (who has at least one additional drug-running conviction since) in the ass is an unforgivable travesty. Absolutely disgusting and shameful that they weren't pardoned before anyone had a chance to slap cuffs on them. It enrages me just to think about it!", 
        "intTime": 20090321, 
        "postID": 9, 
        "quote": "", 
        "reply": "Of all the things Bush did that really ticked me off, this one was the worst. The fact that two border patrol agents sat in prison for 2.5 years for shooting a drug dealer (who has at least one additional drug-running conviction since) in the ass is an unforgivable travesty. Absolutely disgusting and shameful that they weren't pardoned before anyone had a chance to slap cuffs on them. It enrages me just to think about it!", 
        "threadID": "672198221_5610054812001", 
        "time": "2009-03-21 01:04:00", 
        "title": "The two border patrol agents give their first TV interview.", 
        "userID": "freakzilla60"
    }, 
    {
        "content": "I feel the same way about Tim Geithner being in charge of my money.", 
        "intTime": 20090321, 
        "postID": 10, 
        "quote": "", 
        "reply": "I feel the same way about Tim Geithner being in charge of my money.", 
        "threadID": "672198221_5610054812001", 
        "time": "2009-03-21 04:00:00", 
        "title": "The two border patrol agents give their first TV interview.", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: www.glennbeck.com/content/articles/article/196/22979/ Not much of an interview. More like a nice chat. I want to hear their side from their mouths. Understandable why they are not talking out yet though. I do hope they do later in the future though.", 
        "intTime": 20090321, 
        "postID": 11, 
        "quote": "www.glennbeck.com/content/articles/article/196/22979/", 
        "reply": " Not much of an interview. More like a nice chat. I want to hear their side from their mouths. Understandable why they are not talking out yet though. I do hope they do later in the future though.", 
        "threadID": "672198221_5610054812001", 
        "time": "2009-03-21 07:16:00", 
        "title": "The two border patrol agents give their first TV interview.", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Those two Boarder Patrol agents that were sent to prison for shooting that Mexican drug dealer and were pardoned by Bush gave their first TV interview. They were on the Glenn Beck show of Fox news. Mr. Beck never stopped caring about them and one of them thanked him live on TV for taking the time to help and look out for his family while he was in Prison. They have been under House Arrest for the past 30 days and still can't talk allot about their case because they have a Supreme Court Case coming up to clear their names. I guess the other news networks will be falling all over their selfs now trying to get an interview. Can't wait to see how NBC is going to cover this story. I was pleased to see not only Beck but also Lou Dobbs and Bill O'Reilly kept the issue active while they were still in jail. Don", 
        "intTime": 20090321, 
        "postID": 12, 
        "quote": "Originally posted by Duster6: Those two Boarder Patrol agents that were sent to prison for shooting that Mexican drug dealer and were pardoned by Bush gave their first TV interview. They were on the Glenn Beck show of Fox news. Mr. Beck never stopped caring about them and one of them thanked him live on TV for taking the time to help and look out for his family while he was in Prison. They have been under House Arrest for the past 30 days and still can't talk allot about their case because they have a Supreme Court Case coming up to clear their names. I guess the other news networks will be falling all over their selfs now trying to get an interview. Can't wait to see how NBC is going to cover this story.", 
        "reply": " I was pleased to see not only Beck but also Lou Dobbs and Bill O'Reilly kept the issue active while they were still in jail. Don", 
        "threadID": "672198221_5610054812001", 
        "time": "2009-03-21 09:50:00", 
        "title": "The two border patrol agents give their first TV interview.", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by freakzilla60: Of all the things Bush did that really ticked me off, this one was the worst. The fact that two border patrol agents sat in prison for 2.5 years for shooting a drug dealer (who has at least one additional drug-running conviction since) in the ass is an unforgivable travesty. Absolutely disgusting and shameful that they weren't pardoned before anyone had a chance to slap cuffs on them. It enrages me just to think about it! actually, they were in prison for COVERING up the shooting and not reporting the incident. any officer wheo discharges his weapon is required to explain himself. they crossed over to the Mexican side in the shooting (or at least their bullets did).. they knew they could get in trouble for having a cross border battle, so they decided \"mum's the word\" THAT is why they ended up in prison not for shooting a drug smuggler. (they should be commended for THAT)", 
        "intTime": 20090321, 
        "postID": 13, 
        "quote": "Originally posted by freakzilla60: Of all the things Bush did that really ticked me off, this one was the worst. The fact that two border patrol agents sat in prison for 2.5 years for shooting a drug dealer (who has at least one additional drug-running conviction since) in the ass is an unforgivable travesty. Absolutely disgusting and shameful that they weren't pardoned before anyone had a chance to slap cuffs on them. It enrages me just to think about it!", 
        "reply": " actually, they were in prison for COVERING up the shooting and not reporting the incident. any officer wheo discharges his weapon is required to explain himself. they crossed over to the Mexican side in the shooting (or at least their bullets did).. they knew they could get in trouble for having a cross border battle, so they decided \"mum's the word\" THAT is why they ended up in prison not for shooting a drug smuggler. (they should be commended for THAT)", 
        "threadID": "672198221_5610054812001", 
        "time": "2009-03-21 10:51:00", 
        "title": "The two border patrol agents give their first TV interview.", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: actually, they were in prison for COVERING up the shooting and not reporting the incident. They made a mistake by doing so. The mistake did not warrant the punishment they received. When you make an honest mistake at work do you go to prison for it? Don't want to argue it was a shooting blah blah crasp either, we all work and we all do different things and make different mistakes. The most they should have got was fired. I saw no malice I saw them wanting to do the right thing and made a nad judgement call like we all do every single day of our lives. BTW, I THINK it was Lou that broke this story or at least 1st put it on TV.", 
        "intTime": 20090321, 
        "postID": 14, 
        "quote": "actually, they were in prison for COVERING up the shooting and not reporting the incident.", 
        "reply": " They made a mistake by doing so. The mistake did not warrant the punishment they received. When you make an honest mistake at work do you go to prison for it? Don't want to argue it was a shooting blah blah crasp either, we all work and we all do different things and make different mistakes. The most they should have got was fired. I saw no malice I saw them wanting to do the right thing and made a nad judgement call like we all do every single day of our lives. BTW, I THINK it was Lou that broke this story or at least 1st put it on TV.", 
        "threadID": "672198221_5610054812001", 
        "time": "2009-03-21 11:00:00", 
        "title": "The two border patrol agents give their first TV interview.", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: actually, they were in prison for COVERING up the shooting and not reporting the incident. They made a mistake by doing so. The mistake did not warrant the punishment they received. When you make an honest mistake at work do you go to prison for it? Don't want to argue it was a shooting blah blah crasp either, we all work and we all do different things and make different mistakes. The most they should have got was fired. I saw no malice I saw them wanting to do the right thing and made a nad judgement call like we all do every single day of our lives. BTW, I THINK it was Lou that broke this story or at least 1st put it on TV. key word there being \"honest\" mistake i personally think the two of them should have been fired, not sent to prison, but any LEA caugfht covering up a crime (the shooting agaimst them) is piunisheable by law.. or am i mistaken there?", 
        "intTime": 20090321, 
        "postID": 15, 
        "quote": "Originally posted by crackerjacks61: quote: actually, they were in prison for COVERING up the shooting and not reporting the incident. They made a mistake by doing so. The mistake did not warrant the punishment they received. When you make an honest mistake at work do you go to prison for it? Don't want to argue it was a shooting blah blah crasp either, we all work and we all do different things and make different mistakes. The most they should have got was fired. I saw no malice I saw them wanting to do the right thing and made a nad judgement call like we all do every single day of our lives. BTW, I THINK it was Lou that broke this story or at least 1st put it on TV.", 
        "reply": " key word there being \"honest\" mistake i personally think the two of them should have been fired, not sent to prison, but any LEA caugfht covering up a crime (the shooting agaimst them) is piunisheable by law.. or am i mistaken there?", 
        "threadID": "672198221_5610054812001", 
        "time": "2009-03-21 11:27:00", 
        "title": "The two border patrol agents give their first TV interview.", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: quote: Originally posted by freakzilla60: Of all the things Bush did that really ticked me off, this one was the worst. The fact that two border patrol agents sat in prison for 2.5 years for shooting a drug dealer (who has at least one additional drug-running conviction since) in the ass is an unforgivable travesty. Absolutely disgusting and shameful that they weren't pardoned before anyone had a chance to slap cuffs on them. It enrages me just to think about it! actually, they were in prison for COVERING up the shooting and not reporting the incident. any officer wheo discharges his weapon is required to explain himself. they crossed over to the Mexican side in the shooting (or at least their bullets did).. they knew they could get in trouble for having a cross border battle, so they decided \"mum's the word\" THAT is why they ended up in prison not for shooting a drug smuggler. (they should be commended for THAT) And how far have we fallen as a society when two federal agents think that they would have to cover up shooting a drug smuggler because the shooting may have not met the ACLU's criteria for legality? They would have been subject to a withering courtroom barrage no matter what happened. From now on, every border patrol station should be equipped with a wood chipper and a pig farm. Imagine how much they'd save on the legal defense of their agents! Not to mention the abrupt drop-off in drug smuggling.", 
        "intTime": 20090321, 
        "postID": 16, 
        "quote": "Originally posted by Elesso: quote: Originally posted by freakzilla60: Of all the things Bush did that really ticked me off, this one was the worst. The fact that two border patrol agents sat in prison for 2.5 years for shooting a drug dealer (who has at least one additional drug-running conviction since) in the ass is an unforgivable travesty. Absolutely disgusting and shameful that they weren't pardoned before anyone had a chance to slap cuffs on them. It enrages me just to think about it! actually, they were in prison for COVERING up the shooting and not reporting the incident. any officer wheo discharges his weapon is required to explain himself. they crossed over to the Mexican side in the shooting (or at least their bullets did).. they knew they could get in trouble for having a cross border battle, so they decided \"mum's the word\" THAT is why they ended up in prison not for shooting a drug smuggler. (they should be commended for THAT)", 
        "reply": " And how far have we fallen as a society when two federal agents think that they would have to cover up shooting a drug smuggler because the shooting may have not met the ACLU's criteria for legality? They would have been subject to a withering courtroom barrage no matter what happened. From now on, every border patrol station should be equipped with a wood chipper and a pig farm. Imagine how much they'd save on the legal defense of their agents! Not to mention the abrupt drop-off in drug smuggling.", 
        "threadID": "672198221_5610054812001", 
        "time": "2009-03-21 22:15:00", 
        "title": "The two border patrol agents give their first TV interview.", 
        "userID": "freakzilla60"
    }
]