[
    {
        "content": "No apparent advance in brain size or power in modern liberals! \"http://www.msnbc.msn.com/id/30826552/", 
        "intTime": 20090519, 
        "postID": 1, 
        "quote": "", 
        "reply": "No apparent advance in brain size or power in modern liberals! \"http://www.msnbc.msn.com/id/30826552/", 
        "threadID": "672198221_5130017322001", 
        "time": "2009-05-19 18:05:00", 
        "title": "acient liberal found!", 
        "userID": "EAG154"
    }, 
    {
        "content": "Man didn't evolve from an Ape. It was Adam and Eve. They had Cain and Abel. Then Cain and Abel had children............ And..... Oh, wait.", 
        "intTime": 20090519, 
        "postID": 2, 
        "quote": "", 
        "reply": "Man didn't evolve from an Ape. It was Adam and Eve. They had Cain and Abel. Then Cain and Abel had children............ And..... Oh, wait.", 
        "threadID": "672198221_5130017322001", 
        "time": "2009-05-19 18:23:00", 
        "title": "acient liberal found!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "I hope the ancient conservatives were able to spell and put together basic sentences, because it looks like the modern day ones are having some difficulties.", 
        "intTime": 20090519, 
        "postID": 3, 
        "quote": "", 
        "reply": "I hope the ancient conservatives were able to spell and put together basic sentences, because it looks like the modern day ones are having some difficulties.", 
        "threadID": "672198221_5130017322001", 
        "time": "2009-05-19 18:25:00", 
        "title": "acient liberal found!", 
        "userID": "AKinNC"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: Man didn't evolve from an Ape. It was Adam and Eve. They had Cain and Abel. Then Cain and Abel had children............ And..... Oh, wait. And then there was Obama", 
        "intTime": 20090519, 
        "postID": 4, 
        "quote": "Originally posted by mrmixitup: Man didn't evolve from an Ape. It was Adam and Eve. They had Cain and Abel. Then Cain and Abel had children............ And..... Oh, wait.", 
        "reply": " And then there was Obama", 
        "threadID": "672198221_5130017322001", 
        "time": "2009-05-19 18:29:00", 
        "title": "acient liberal found!", 
        "userID": "EAG154"
    }, 
    {
        "content": "Dig a bit further and they will find the stash of carbon credits it wasted all of it's money on and some ****ty book on atheism.", 
        "intTime": 20090519, 
        "postID": 5, 
        "quote": "", 
        "reply": "Dig a bit further and they will find the stash of carbon credits it wasted all of it's money on and some ****ty book on atheism.", 
        "threadID": "672198221_5130017322001", 
        "time": "2009-05-19 18:34:00", 
        "title": "acient liberal found!", 
        "userID": "ReconTeam"
    }, 
    {
        "content": "quote: EAG154 Keep it up EAG154 and friends -- Your rhetoric will just keep driving the young further away from your party and make the lefts job so much easier. per Gallup polling \"As was shown earlier, the GOP's loss in leaned support over this time is evident among nearly every subgroup. The losses are substantial among college graduates, which have shown a decline in GOP support of 10 points. (The losses are even greater -- 13 points -- among the subset of college graduates with postgraduate educations.)\" Insulting the opposition does not make a case for the rights policies,Quiet the opposite really it just shows that`s all you have left is insults. -- Savage", 
        "intTime": 20090519, 
        "postID": 6, 
        "quote": "EAG154", 
        "reply": " Keep it up EAG154 and friends -- Your rhetoric will just keep driving the young further away from your party and make the lefts job so much easier. per Gallup polling \"As was shown earlier, the GOP's loss in leaned support over this time is evident among nearly every subgroup. The losses are substantial among college graduates, which have shown a decline in GOP support of 10 points. (The losses are even greater -- 13 points -- among the subset of college graduates with postgraduate educations.)\" Insulting the opposition does not make a case for the rights policies,Quiet the opposite really it just shows that`s all you have left is insults. -- Savage", 
        "threadID": "672198221_5130017322001", 
        "time": "2009-05-19 18:55:00", 
        "title": "acient liberal found!", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: Originally posted by EAG154: No apparent advance in brain size or power in modern liberals! \"http://www.msnbc.msn.com/id/30826552/ kinda looks like N.Patooie in X-Ray form when she wants to attack the Republicans. Just saying is all. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090519, 
        "postID": 7, 
        "quote": "Originally posted by EAG154: No apparent advance in brain size or power in modern liberals! \"http://www.msnbc.msn.com/id/30826552/", 
        "reply": " kinda looks like N.Patooie in X-Ray form when she wants to attack the Republicans. Just saying is all. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_5130017322001", 
        "time": "2009-05-19 19:17:00", 
        "title": "acient liberal found!", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Keep it up EAG154 and friends -- Your rhetoric will just keep driving the young further away from your party and make the lefts job so much easier. per Gallup polling \"As was shown earlier, the GOP's loss in leaned support over this time is evident among nearly every subgroup. The losses are substantial among college graduates, which have shown a decline in GOP support of 10 points. Thats not surprising given the fact that many colleges have become liberal indoctrination camps and the bar is constantly being lowered. How many college graduates that still cant do math without a computer or calculator or those who cant spell without spellcheck? Its not pretty.", 
        "intTime": 20090519, 
        "postID": 8, 
        "quote": "Keep it up EAG154 and friends -- Your rhetoric will just keep driving the young further away from your party and make the lefts job so much easier. per Gallup polling \"As was shown earlier, the GOP's loss in leaned support over this time is evident among nearly every subgroup. The losses are substantial among college graduates, which have shown a decline in GOP support of 10 points.", 
        "reply": " Thats not surprising given the fact that many colleges have become liberal indoctrination camps and the bar is constantly being lowered. How many college graduates that still cant do math without a computer or calculator or those who cant spell without spellcheck? Its not pretty.", 
        "threadID": "672198221_5130017322001", 
        "time": "2009-05-19 20:22:00", 
        "title": "acient liberal found!", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by EAG154: No apparent advance in brain size or power in modern liberals! \"http://www.msnbc.msn.com/id/30826552/ kinda looks like N.Patooie in X-Ray form when she wants to attack the Republicans. Just saying is all. You know it does kinda look like a Weasel so perhaps it was a prehistoric politician", 
        "intTime": 20090519, 
        "postID": 9, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by EAG154: No apparent advance in brain size or power in modern liberals! \"http://www.msnbc.msn.com/id/30826552/ kinda looks like N.Patooie in X-Ray form when she wants to attack the Republicans. Just saying is all.", 
        "reply": " You know it does kinda look like a Weasel so perhaps it was a prehistoric politician", 
        "threadID": "672198221_5130017322001", 
        "time": "2009-05-19 20:23:00", 
        "title": "acient liberal found!", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Note the outstretched arms to embracing a tree..... Sullivan013", 
        "intTime": 20090520, 
        "postID": 10, 
        "quote": "", 
        "reply": "Note the outstretched arms to embracing a tree..... Sullivan013", 
        "threadID": "672198221_5130017322001", 
        "time": "2009-05-20 05:35:00", 
        "title": "acient liberal found!", 
        "userID": "sullivan013"
    }, 
    {
        "content": "quote: EAG154 Thank you EAG154 for posting this. The article is very interesting. It has nothing to do with neither the criminal right wing extremist philosophy of hate and subjugation nor the democrats philosophy of enlightenment, truthfulness, and the nobleness of mankind, but it is very informative.", 
        "intTime": 20090520, 
        "postID": 11, 
        "quote": "EAG154", 
        "reply": " Thank you EAG154 for posting this. The article is very interesting. It has nothing to do with neither the criminal right wing extremist philosophy of hate and subjugation nor the democrats philosophy of enlightenment, truthfulness, and the nobleness of mankind, but it is very informative.", 
        "threadID": "672198221_5130017322001", 
        "time": "2009-05-20 05:50:00", 
        "title": "acient liberal found!", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: Keep it up EAG154 and friends -- Your rhetoric will just keep driving the young further away from your party and make the lefts job so much easier. per Gallup polling \"As was shown earlier, the GOP's loss in leaned support over this time is evident among nearly every subgroup. The losses are substantial among college graduates, which have shown a decline in GOP support of 10 points. Thats not surprising given the fact that many colleges have become liberal indoctrination camps and the bar is constantly being lowered. How many college graduates that still cant do math without a computer or calculator or those who cant spell without spellcheck? Its not pretty. College enrollment is down across the board anyways. So the numbers are misleading.", 
        "intTime": 20090520, 
        "postID": 12, 
        "quote": "Originally posted by FlankerFlyer: quote: Keep it up EAG154 and friends -- Your rhetoric will just keep driving the young further away from your party and make the lefts job so much easier. per Gallup polling \"As was shown earlier, the GOP's loss in leaned support over this time is evident among nearly every subgroup. The losses are substantial among college graduates, which have shown a decline in GOP support of 10 points. Thats not surprising given the fact that many colleges have become liberal indoctrination camps and the bar is constantly being lowered. How many college graduates that still cant do math without a computer or calculator or those who cant spell without spellcheck? Its not pretty.", 
        "reply": " College enrollment is down across the board anyways. So the numbers are misleading.", 
        "threadID": "672198221_5130017322001", 
        "time": "2009-05-20 06:09:00", 
        "title": "acient liberal found!", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by 6837602: quote: EAG154 Thank you EAG154 for posting this. The article is very interesting. It has nothing to do with neither the criminal right wing extremist philosophy of hate and subjugation nor the democrats philosophy of enlightenment, truthfulness, and the nobleness of mankind, but it is very informative. You forgot fiscal irresponsibillity of the left....", 
        "intTime": 20090520, 
        "postID": 13, 
        "quote": "Originally posted by 6837602: quote: EAG154 Thank you EAG154 for posting this. The article is very interesting. It has nothing to do with neither the criminal right wing extremist philosophy of hate and subjugation nor the democrats philosophy of enlightenment, truthfulness, and the nobleness of mankind, but it is very informative.", 
        "reply": " You forgot fiscal irresponsibillity of the left....", 
        "threadID": "672198221_5130017322001", 
        "time": "2009-05-20 06:10:00", 
        "title": "acient liberal found!", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by A_Savage: quote: EAG154 Keep it up EAG154 and friends -- Your rhetoric will just keep driving the young further away from your party and make the lefts job so much easier. per Gallup polling \"As was shown earlier, the GOP's loss in leaned support over this time is evident among nearly every subgroup. The losses are substantial among college graduates, which have shown a decline in GOP support of 10 points. (The losses are even greater -- 13 points -- among the subset of college graduates with postgraduate educations.)\" Insulting the opposition does not make a case for the rights policies,Quiet the opposite really it just shows that`s all you have left is insults. -- Savage Time to thiken the skin a bit. It was obviousely a joke. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090520, 
        "postID": 14, 
        "quote": "Originally posted by A_Savage: quote: EAG154 Keep it up EAG154 and friends -- Your rhetoric will just keep driving the young further away from your party and make the lefts job so much easier. per Gallup polling \"As was shown earlier, the GOP's loss in leaned support over this time is evident among nearly every subgroup. The losses are substantial among college graduates, which have shown a decline in GOP support of 10 points. (The losses are even greater -- 13 points -- among the subset of college graduates with postgraduate educations.)\" Insulting the opposition does not make a case for the rights policies,Quiet the opposite really it just shows that`s all you have left is insults. -- Savage", 
        "reply": " Time to thiken the skin a bit. It was obviousely a joke. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5130017322001", 
        "time": "2009-05-20 07:48:00", 
        "title": "acient liberal found!", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: quote: Originally posted by 6837602: quote: EAG154 Thank you EAG154 for posting this. The article is very interesting. It has nothing to do with neither the criminal right wing extremist philosophy of hate and subjugation nor the democrats philosophy of enlightenment, truthfulness, and the nobleness of mankind, but it is very informative. You forgot fiscal irresponsibillity of the left.... And the Right. Remember I'm not an Obama supporter but do recognise that the republicans were responsible for some nasty debt as well. Not as much as the Dems, but 2 wrongs don't make 1 right. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090520, 
        "postID": 15, 
        "quote": "Originally posted by NickBrand: quote: Originally posted by 6837602: quote: EAG154 Thank you EAG154 for posting this. The article is very interesting. It has nothing to do with neither the criminal right wing extremist philosophy of hate and subjugation nor the democrats philosophy of enlightenment, truthfulness, and the nobleness of mankind, but it is very informative. You forgot fiscal irresponsibillity of the left....", 
        "reply": " And the Right. Remember I'm not an Obama supporter but do recognise that the republicans were responsible for some nasty debt as well. Not as much as the Dems, but 2 wrongs don't make 1 right. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5130017322001", 
        "time": "2009-05-20 07:50:00", 
        "title": "acient liberal found!", 
        "userID": "L0A1"
    }, 
    {
        "content": "Before this get's out of control I am closing the thread. You will still be able to use the link to see the artical. MD", 
        "intTime": 20090520, 
        "postID": 16, 
        "quote": "", 
        "reply": "Before this get's out of control I am closing the thread. You will still be able to use the link to see the artical. MD", 
        "threadID": "672198221_5130017322001", 
        "time": "2009-05-20 07:59:00", 
        "title": "acient liberal found!", 
        "userID": "mainedawg"
    }
]