[
    {
        "content": "quote: TEHRAN — President Mahmoud Ahmadinejad, in a rare effort to intervene in the justice system, urged Tehran’s chief prosecutor on Sunday to fairly examine the cases of an Iranian-American journalist and an Iranian-Canadian blogger. The Iranian-American journalist, Roxana Saberi, has been sentenced to eight years in prison on charges of spying for Washington, her lawyer reported Saturday. The other detainee is Hossein Derakhshan, a blogger who has been jailed since November without any official charges. Mr. Ahmadinejad, who will be attending an international conference on racism on Monday and is expected to seek re-election in June, may be seeking to cast himself as a defender of human rights, analysts said. He may also be trying to prevent radical forces from sabotaging a possible reconciliation between Iran and the United States. President Obama, speaking at a news conference in Trinidad on Sunday, said he was “gravely concerned” about Ms. Saberi’s safety and called for her release. “She is an American citizen, and I have complete confidence that she was not engaging in any sort of espionage,” Mr. Obama said, adding that the United States would ask Iran for “a proper disposition of this case.” Meanwhile, Ms. Saberi’s father said in an interview on Sunday that neither she nor her lawyer had been given any notice of her trial last week, which he said lasted less than an hour. In Mr. Ahmadinejad’s letter, he urged Tehran’s prosecutor general, Saeed Mortazavi, to examine the cases fairly, the official IRNA news agency reported. Although the court’s workings are secret, Mr. Mortazavi, known as a hard-line conservative, would be the one to at least oversee the prosecution of both cases. (....) Analysts here suggested the letter’s intent may have been to stake out a political position before the June 12 election, where he would face liberal opposition and may want to inoculate himself against criticism on the human rights front. One analyst, Alireza Rajaee, said that he might be looking past the election to a possible bid to improve relations with the United States. In a conciliatory speech last week, responding to overtures by Mr. Obama, he said that Iran would welcome change by the United States. “He wants to present himself as a man eligible for international talks and also dialogue with the United States,” Mr. Rajaee said. “He is confident that he will win another term and wants to send a positive signal inside the country and to make sure that talks with Washington will proceed.” (....) Hopefully this game of kicking the ball back and forth will end with her release! +http://www.nytimes.com/2009/04/20/world/middleeast/20iran.html?ref=middleeast \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090419, 
        "postID": 1, 
        "quote": "TEHRAN — President Mahmoud Ahmadinejad, in a rare effort to intervene in the justice system, urged Tehran’s chief prosecutor on Sunday to fairly examine the cases of an Iranian-American journalist and an Iranian-Canadian blogger. The Iranian-American journalist, Roxana Saberi, has been sentenced to eight years in prison on charges of spying for Washington, her lawyer reported Saturday. The other detainee is Hossein Derakhshan, a blogger who has been jailed since November without any official charges. Mr. Ahmadinejad, who will be attending an international conference on racism on Monday and is expected to seek re-election in June, may be seeking to cast himself as a defender of human rights, analysts said. He may also be trying to prevent radical forces from sabotaging a possible reconciliation between Iran and the United States. President Obama, speaking at a news conference in Trinidad on Sunday, said he was “gravely concerned” about Ms. Saberi’s safety and called for her release. “She is an American citizen, and I have complete confidence that she was not engaging in any sort of espionage,” Mr. Obama said, adding that the United States would ask Iran for “a proper disposition of this case.” Meanwhile, Ms. Saberi’s father said in an interview on Sunday that neither she nor her lawyer had been given any notice of her trial last week, which he said lasted less than an hour. In Mr. Ahmadinejad’s letter, he urged Tehran’s prosecutor general, Saeed Mortazavi, to examine the cases fairly, the official IRNA news agency reported. Although the court’s workings are secret, Mr. Mortazavi, known as a hard-line conservative, would be the one to at least oversee the prosecution of both cases. (....) Analysts here suggested the letter’s intent may have been to stake out a political position before the June 12 election, where he would face liberal opposition and may want to inoculate himself against criticism on the human rights front. One analyst, Alireza Rajaee, said that he might be looking past the election to a possible bid to improve relations with the United States. In a conciliatory speech last week, responding to overtures by Mr. Obama, he said that Iran would welcome change by the United States. “He wants to present himself as a man eligible for international talks and also dialogue with the United States,” Mr. Rajaee said. “He is confident that he will win another term and wants to send a positive signal inside the country and to make sure that talks with Washington will proceed.” (....)", 
        "reply": " Hopefully this game of kicking the ball back and forth will end with her release! +http://www.nytimes.com/2009/04/20/world/middleeast/20iran.html?ref=middleeast \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3370012122001", 
        "time": "2009-04-19 17:20:00", 
        "title": "Iranian President Asks Court to Reconsider Spy Case", 
        "userID": "NSNN"
    }, 
    {
        "content": "Hmmmmm......An Amercan held i Iran illegally and an American President unable to deal with it.....Where have I seen this before??? More change you can believe in I guess.. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090419, 
        "postID": 2, 
        "quote": "", 
        "reply": "Hmmmmm......An Amercan held i Iran illegally and an American President unable to deal with it.....Where have I seen this before??? More change you can believe in I guess.. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "threadID": "672198221_3370012122001", 
        "time": "2009-04-19 20:03:00", 
        "title": "Iranian President Asks Court to Reconsider Spy Case", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by Proudformermarine: Hmmmmm......An Amercan held i Iran illegally and an American President unable to deal with it.....Where have I seen this before??? More change you can believe in I guess.. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 Iran got what they wanted: President Obama practically begging them to release the prisoner...", 
        "intTime": 20090419, 
        "postID": 3, 
        "quote": "Originally posted by Proudformermarine: Hmmmmm......An Amercan held i Iran illegally and an American President unable to deal with it.....Where have I seen this before??? More change you can believe in I guess.. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "reply": " Iran got what they wanted: President Obama practically begging them to release the prisoner...", 
        "threadID": "672198221_3370012122001", 
        "time": "2009-04-19 20:28:00", 
        "title": "Iranian President Asks Court to Reconsider Spy Case", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Proudformermarine: Hmmmmm......An Amercan held i Iran illegally and an American President unable to deal with it.....Where have I seen this before??? More change you can believe in I guess.. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 I don't like to give PO much credit but I do try to be fair and balanced..... that said from what you said what would Bush or any other president have done..... better yet, and be honest, what would you do? The answer -- nothing. Nothing physical against Iran anyway. And as for Ach-mood-amidineajab making this gesture..... only posturing IMHO. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090419, 
        "postID": 4, 
        "quote": "Originally posted by Proudformermarine: Hmmmmm......An Amercan held i Iran illegally and an American President unable to deal with it.....Where have I seen this before??? More change you can believe in I guess.. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989", 
        "reply": " I don't like to give PO much credit but I do try to be fair and balanced..... that said from what you said what would Bush or any other president have done..... better yet, and be honest, what would you do? The answer -- nothing. Nothing physical against Iran anyway. And as for Ach-mood-amidineajab making this gesture..... only posturing IMHO. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_3370012122001", 
        "time": "2009-04-19 21:43:00", 
        "title": "Iranian President Asks Court to Reconsider Spy Case", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by Proudformermarine: Hmmmmm......An Amercan held i Iran illegally and an American President unable to deal with it.....Where have I seen this before??? More change you can believe in I guess.. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 I don't like to give PO much credit but I do try to be fair and balanced..... that said from what you said what would Bush or any other president have done..... better yet, and be honest, what would you do? The answer -- nothing. Nothing physical against Iran anyway. And as for Ach-mood-amidineajab making this gesture..... only posturing IMHO. Me? I'd be lookin' for a way to make things uncomfortable for the Russians economically if they go through with their sale of those AA missles to Iran. Stopping that would send a message to both. And let them know that if Our citizen wasn't released toot freakin' sweet that I'd be more inclined to find something else to do when Israel does a live fire exercise in Iranian Air Space than get on the phone with Israel when they have aircraft aloft...... Duane A. Brinson Lahaina Hi. U.S.M.C. 1985-1989", 
        "intTime": 20090419, 
        "postID": 5, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by Proudformermarine: Hmmmmm......An Amercan held i Iran illegally and an American President unable to deal with it.....Where have I seen this before??? More change you can believe in I guess.. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 I don't like to give PO much credit but I do try to be fair and balanced..... that said from what you said what would Bush or any other president have done..... better yet, and be honest, what would you do? The answer -- nothing. Nothing physical against Iran anyway. And as for Ach-mood-amidineajab making this gesture..... only posturing IMHO.", 
        "reply": " Me? I'd be lookin' for a way to make things uncomfortable for the Russians economically if they go through with their sale of those AA missles to Iran. Stopping that would send a message to both. And let them know that if Our citizen wasn't released toot freakin' sweet that I'd be more inclined to find something else to do when Israel does a live fire exercise in Iranian Air Space than get on the phone with Israel when they have aircraft aloft...... Duane A. Brinson Lahaina Hi. U.S.M.C. 1985-1989", 
        "threadID": "672198221_3370012122001", 
        "time": "2009-04-19 22:18:00", 
        "title": "Iranian President Asks Court to Reconsider Spy Case", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: And as for Ach-mood-amidineajab making this gesture..... only posturing IMHO. As the article states, there’s an election up coming, and if he really wanted friendlier more stable relations with us, this would be a good opportunity to show it...or not! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090420, 
        "postID": 6, 
        "quote": "Originally posted by m551sheridan: And as for Ach-mood-amidineajab making this gesture..... only posturing IMHO.", 
        "reply": " As the article states, there’s an election up coming, and if he really wanted friendlier more stable relations with us, this would be a good opportunity to show it...or not! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3370012122001", 
        "time": "2009-04-20 05:49:00", 
        "title": "Iranian President Asks Court to Reconsider Spy Case", 
        "userID": "NSNN"
    }
]