[
    {
        "content": "At least this broke the shoe-throwing trend. ++http://cosmos.bcst.yahoo.com/up/player/popup/index.php?rn=222561&cl=12356124&ch=6535903 ++http://ca.news.yahoo.com/s/afp/090308/world/britain_politics_environment_offbeat_police quote: Police arrest custard-hurling protester Module body 1 hour, 24 minutes ago What's this LONDON (AFP) - The climate change protester who hurled green custard into the face of Business Secretary Peter Mandelson has been arrested, police said on Sunday. Leila Deen, 29, attended a central London police station \"by appointment\" on Saturday in connection with an investigation into the incident, a Metropolitan Police spokesman said. \"She was arrested by officers from Westminster Criminal Investigations Department and was bailed to return to a central London police station on a date in early April pending further enquiries,\" the spokesman told AFP. Deen hurled a cupful of custard at Lord Mandelson on Friday to highlight opposition to a new runway at Heathrow airport. She gave television interviews afterwards, but was not detained by police. \"I was slightly surprised that she could just saunter off without being apprehended... but we do not live in a police state in Britain and thank goodness for it,\" Mandelson told the BBC. As a former Northern Ireland secretary, Mandelson is entitled to round-the-clock security... (...)", 
        "intTime": 20090308, 
        "postID": 1, 
        "quote": "Police arrest custard-hurling protester Module body 1 hour, 24 minutes ago What's this LONDON (AFP) - The climate change protester who hurled green custard into the face of Business Secretary Peter Mandelson has been arrested, police said on Sunday. Leila Deen, 29, attended a central London police station \"by appointment\" on Saturday in connection with an investigation into the incident, a Metropolitan Police spokesman said. \"She was arrested by officers from Westminster Criminal Investigations Department and was bailed to return to a central London police station on a date in early April pending further enquiries,\" the spokesman told AFP. Deen hurled a cupful of custard at Lord Mandelson on Friday to highlight opposition to a new runway at Heathrow airport. She gave television interviews afterwards, but was not detained by police. \"I was slightly surprised that she could just saunter off without being apprehended... but we do not live in a police state in Britain and thank goodness for it,\" Mandelson told the BBC. As a former Northern Ireland secretary, Mandelson is entitled to round-the-clock security... (...)", 
        "reply": "At least this broke the shoe-throwing trend. ++http://cosmos.bcst.yahoo.com/up/player/popup/index.php?rn=222561&cl=12356124&ch=6535903 ++http://ca.news.yahoo.com/s/afp/090308/world/britain_politics_environment_offbeat_police ", 
        "threadID": "672198221_2390052712001", 
        "time": "2009-03-08 10:20:00", 
        "title": "Woman who attacked British Minister with Custard arrested 2 days after", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: \"I was slightly surprised that she could just saunter off without being apprehended... but we do not live in a police state in Britain and thank goodness for it,\" Mandelson told the BBC. This dude hasn't been paying attention. With universal disarmament of citizens and cameras everywhere monitoring the \"proles\", sounds like a Libertarian paradise to me.", 
        "intTime": 20090308, 
        "postID": 2, 
        "quote": "\"I was slightly surprised that she could just saunter off without being apprehended... but we do not live in a police state in Britain and thank goodness for it,\" Mandelson told the BBC.", 
        "reply": " This dude hasn't been paying attention. With universal disarmament of citizens and cameras everywhere monitoring the \"proles\", sounds like a Libertarian paradise to me.", 
        "threadID": "672198221_2390052712001", 
        "time": "2009-03-08 10:28:00", 
        "title": "Woman who attacked British Minister with Custard arrested 2 days after", 
        "userID": "NM11AZ"
    }, 
    {
        "content": "quote: Originally posted by NM11AZ: quote: \"I was slightly surprised that she could just saunter off without being apprehended... but we do not live in a police state in Britain and thank goodness for it,\" Mandelson told the BBC. This dude hasn't been paying attention. With universal disarmament of citizens and cameras everywhere monitoring the \"proles\", sounds like a Libertarian paradise to me. Hmm, which would I rather have a nation where a minister of the Crown who certainly deserves it gets covered in custard on his doorstep or one where there are so many guns floating around that she'd have been shot dead before she got within ten feet? I might not like the cameras everywhere (but I live in the country so I rarely see any) but I'll take them over the almost paranoia over \"personal protection\" that seems to be the norm in America these days.", 
        "intTime": 20090308, 
        "postID": 3, 
        "quote": "Originally posted by NM11AZ: quote: \"I was slightly surprised that she could just saunter off without being apprehended... but we do not live in a police state in Britain and thank goodness for it,\" Mandelson told the BBC. This dude hasn't been paying attention. With universal disarmament of citizens and cameras everywhere monitoring the \"proles\", sounds like a Libertarian paradise to me.", 
        "reply": " Hmm, which would I rather have a nation where a minister of the Crown who certainly deserves it gets covered in custard on his doorstep or one where there are so many guns floating around that she'd have been shot dead before she got within ten feet? I might not like the cameras everywhere (but I live in the country so I rarely see any) but I'll take them over the almost paranoia over \"personal protection\" that seems to be the norm in America these days.", 
        "threadID": "672198221_2390052712001", 
        "time": "2009-03-08 17:55:00", 
        "title": "Woman who attacked British Minister with Custard arrested 2 days after", 
        "userID": "Bladensburg"
    }
]