[
    {
        "content": "\"http://www.thetimesherald.com/article/20090530/NEWS01/905300301&referrer=FRONTPAGECAROUSEL\" quote: If he didn't see it happen, Ron Ceglarek said he probably wouldn't believe it. A squirrel - weighing about 3 pounds - got up on its hind legs, tore a small American flag from a small staff next to a grave stone, rolled it up and carried it up a tree to a waiting mate building a nest. It happened not just once, but about dozen times. \"He plucks them right off,\" Ceglarek, superintendent of Mount Hope Cemetery in Port Huron, said of a rogue squirrel that is stealing flags. \"If I didn't see it, and I didn't follow the squirrel, I never would have believed it. \"But it is a band of tree rodents.\" Every Memorial Day, volunteers put small American flags next to grave stones of the about 965 veterans buried at the Krafft Road cemetery. All the flags were undisturbed during a Mass on Memorial Day. But the next day, cemetery workers noticed the flags were disappearing - the small, wooden staffs still were in the ground, but Old Glory itself had been removed. At first, the cemetery's staff was confused. Then, Ceglarek spotted the thief in action. \"It looked like he had a little bandana in his mouth,\" he said of the squirrel. Ceglarek has collected a handful of bare staffs. The staples used to attach the flags remain firmly in place with pieces of red, white and blue fabric stuck to them. The squirrels' nest is in Ward L of the cemetery - a ward now conspicuously without flags. \"Clean as a whistle,\" Ceglarek said. The nest, which is about 45 feet up a spruce tree, can be seen by an observant cemetery visitor as red, white and blue cloth drapes over branches. \"Maybe they are trying to tell us it is going to be a hard winter,\" Ceglarek said with a laugh. \"Why use leaves when you can get flags?\"", 
        "intTime": 20090601, 
        "postID": 1, 
        "quote": "If he didn't see it happen, Ron Ceglarek said he probably wouldn't believe it. A squirrel - weighing about 3 pounds - got up on its hind legs, tore a small American flag from a small staff next to a grave stone, rolled it up and carried it up a tree to a waiting mate building a nest. It happened not just once, but about dozen times. \"He plucks them right off,\" Ceglarek, superintendent of Mount Hope Cemetery in Port Huron, said of a rogue squirrel that is stealing flags. \"If I didn't see it, and I didn't follow the squirrel, I never would have believed it. \"But it is a band of tree rodents.\" Every Memorial Day, volunteers put small American flags next to grave stones of the about 965 veterans buried at the Krafft Road cemetery. All the flags were undisturbed during a Mass on Memorial Day. But the next day, cemetery workers noticed the flags were disappearing - the small, wooden staffs still were in the ground, but Old Glory itself had been removed. At first, the cemetery's staff was confused. Then, Ceglarek spotted the thief in action. \"It looked like he had a little bandana in his mouth,\" he said of the squirrel. Ceglarek has collected a handful of bare staffs. The staples used to attach the flags remain firmly in place with pieces of red, white and blue fabric stuck to them. The squirrels' nest is in Ward L of the cemetery - a ward now conspicuously without flags. \"Clean as a whistle,\" Ceglarek said. The nest, which is about 45 feet up a spruce tree, can be seen by an observant cemetery visitor as red, white and blue cloth drapes over branches. \"Maybe they are trying to tell us it is going to be a hard winter,\" Ceglarek said with a laugh. \"Why use leaves when you can get flags?\"", 
        "reply": "\"http://www.thetimesherald.com/article/20090530/NEWS01/905300301&referrer=FRONTPAGECAROUSEL\" ", 
        "threadID": "672198221_1390008422001", 
        "time": "2009-06-01 11:24:00", 
        "title": "Anti-American squirrels vandalize veteran's graves", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: \"http://www.thetimesherald.com/article/20090530/NEWS01/905300301&referrer=FRONTPAGECAROUSEL\" quote: If he didn't see it happen, Ron Ceglarek said he probably wouldn't believe it. A squirrel - weighing about 3 pounds - got up on its hind legs, tore a small American flag from a small staff next to a grave stone, rolled it up and carried it up a tree to a waiting mate building a nest. It happened not just once, but about dozen times. \"He plucks them right off,\" Ceglarek, superintendent of Mount Hope Cemetery in Port Huron, said of a rogue squirrel that is stealing flags. \"If I didn't see it, and I didn't follow the squirrel, I never would have believed it. \"But it is a band of tree rodents.\" Every Memorial Day, volunteers put small American flags next to grave stones of the about 965 veterans buried at the Krafft Road cemetery. All the flags were undisturbed during a Mass on Memorial Day. But the next day, cemetery workers noticed the flags were disappearing - the small, wooden staffs still were in the ground, but Old Glory itself had been removed. At first, the cemetery's staff was confused. Then, Ceglarek spotted the thief in action. \"It looked like he had a little bandana in his mouth,\" he said of the squirrel. Ceglarek has collected a handful of bare staffs. The staples used to attach the flags remain firmly in place with pieces of red, white and blue fabric stuck to them. The squirrels' nest is in Ward L of the cemetery - a ward now conspicuously without flags. \"Clean as a whistle,\" Ceglarek said. The nest, which is about 45 feet up a spruce tree, can be seen by an observant cemetery visitor as red, white and blue cloth drapes over branches. \"Maybe they are trying to tell us it is going to be a hard winter,\" Ceglarek said with a laugh. \"Why use leaves when you can get flags?\" Time to get Bill Murray as the Groundskeeper. He'll fix-em, the feckin lil rodents.", 
        "intTime": 20090601, 
        "postID": 2, 
        "quote": "Originally posted by Fightdirector: \"http://www.thetimesherald.com/article/20090530/NEWS01/905300301&referrer=FRONTPAGECAROUSEL\" quote: If he didn't see it happen, Ron Ceglarek said he probably wouldn't believe it. A squirrel - weighing about 3 pounds - got up on its hind legs, tore a small American flag from a small staff next to a grave stone, rolled it up and carried it up a tree to a waiting mate building a nest. It happened not just once, but about dozen times. \"He plucks them right off,\" Ceglarek, superintendent of Mount Hope Cemetery in Port Huron, said of a rogue squirrel that is stealing flags. \"If I didn't see it, and I didn't follow the squirrel, I never would have believed it. \"But it is a band of tree rodents.\" Every Memorial Day, volunteers put small American flags next to grave stones of the about 965 veterans buried at the Krafft Road cemetery. All the flags were undisturbed during a Mass on Memorial Day. But the next day, cemetery workers noticed the flags were disappearing - the small, wooden staffs still were in the ground, but Old Glory itself had been removed. At first, the cemetery's staff was confused. Then, Ceglarek spotted the thief in action. \"It looked like he had a little bandana in his mouth,\" he said of the squirrel. Ceglarek has collected a handful of bare staffs. The staples used to attach the flags remain firmly in place with pieces of red, white and blue fabric stuck to them. The squirrels' nest is in Ward L of the cemetery - a ward now conspicuously without flags. \"Clean as a whistle,\" Ceglarek said. The nest, which is about 45 feet up a spruce tree, can be seen by an observant cemetery visitor as red, white and blue cloth drapes over branches. \"Maybe they are trying to tell us it is going to be a hard winter,\" Ceglarek said with a laugh. \"Why use leaves when you can get flags?\"", 
        "reply": " Time to get Bill Murray as the Groundskeeper. He'll fix-em, the feckin lil rodents.", 
        "threadID": "672198221_1390008422001", 
        "time": "2009-06-01 11:32:00", 
        "title": "Anti-American squirrels vandalize veteran's graves", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "- Disrespectful little scamps. *searches for .22* -", 
        "intTime": 20090601, 
        "postID": 3, 
        "quote": "", 
        "reply": "- Disrespectful little scamps. *searches for .22* -", 
        "threadID": "672198221_1390008422001", 
        "time": "2009-06-01 20:02:00", 
        "title": "Anti-American squirrels vandalize veteran's graves", 
        "userID": "ANZACbiscuit"
    }
]