[
    {
        "content": "Just heard on the news that an airline in Texas is hiring mechanics who cannot read english. It said the airline was hiring on the cheap. Now, how can a problem be fixed when the person doing the fix cannot read the manual which describes how the problem is to be fixed. Just wondering. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090520, 
        "postID": 1, 
        "quote": "", 
        "reply": "Just heard on the news that an airline in Texas is hiring mechanics who cannot read english. It said the airline was hiring on the cheap. Now, how can a problem be fixed when the person doing the fix cannot read the manual which describes how the problem is to be fixed. Just wondering. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-20 09:23:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years.", 
        "intTime": 20090520, 
        "postID": 2, 
        "quote": "", 
        "reply": "Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years.", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-20 09:49:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090520, 
        "postID": 3, 
        "quote": "Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years.", 
        "reply": " Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-20 09:53:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "Anbar7"
    }, 
    {
        "content": "It just said that the FAA says that the work can be done by someone who does not have a good command of the language BUT repairs HAD to be inspected by a \"certified\" mechanic.... and one stipulation of that certificate was to be able to read and understand English. Still don't like it. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090520, 
        "postID": 4, 
        "quote": "", 
        "reply": "It just said that the FAA says that the work can be done by someone who does not have a good command of the language BUT repairs HAD to be inspected by a \"certified\" mechanic.... and one stipulation of that certificate was to be able to read and understand English. Still don't like it. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-20 10:20:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Which airline?", 
        "intTime": 20090520, 
        "postID": 5, 
        "quote": "", 
        "reply": "Which airline?", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-20 14:44:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "Let's hope it's Air Force One quote: Originally posted by PhoenixDark: Which airline?", 
        "intTime": 20090521, 
        "postID": 6, 
        "quote": "Originally posted by PhoenixDark: Which airline?", 
        "reply": "Let's hope it's Air Force One ", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 05:21:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "aaronl1369"
    }, 
    {
        "content": "Yeah, seriously, which airline?", 
        "intTime": 20090521, 
        "postID": 7, 
        "quote": "", 
        "reply": "Yeah, seriously, which airline?", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 05:42:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "sabow"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. I'm thinking you can thank Reagan, he was the President that granted amnesty. You might also thank the company management for putting profits above public safety (now there's a surprise).", 
        "intTime": 20090521, 
        "postID": 8, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas.", 
        "reply": " I'm thinking you can thank Reagan, he was the President that granted amnesty. You might also thank the company management for putting profits above public safety (now there's a surprise).", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 06:54:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. ass-u-me where is an article? a link? some supporting info? \"i just heard\" is not even news: it is gossip. futhermore, airline mechanics come from all countries. what if this guy has 30 plus years fixing aircraft? YOU and I do not know just Ass-u-me", 
        "intTime": 20090521, 
        "postID": 9, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas.", 
        "reply": " ass-u-me where is an article? a link? some supporting info? \"i just heard\" is not even news: it is gossip. futhermore, airline mechanics come from all countries. what if this guy has 30 plus years fixing aircraft? YOU and I do not know just Ass-u-me", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 07:02:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "Elesso"
    }, 
    {
        "content": "Here's a link to what I think they're talking about: \"http://www.wfaa.com/sharedcontent/dws/wfaa/localnews/investigates/stories/wfaa090515-_lj_harris.7a4a7d4.html\"", 
        "intTime": 20090521, 
        "postID": 10, 
        "quote": "", 
        "reply": "Here's a link to what I think they're talking about: \"http://www.wfaa.com/sharedcontent/dws/wfaa/localnews/investigates/stories/wfaa090515-_lj_harris.7a4a7d4.html\"", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 07:09:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Here's a link to what I think they're talking about: \"http://www.wfaa.com/sharedcontent/dws/wfaa/localnews/investigates/stories/wfaa090515-_lj_harris.7a4a7d4.html\" ok. i see the article. is it just me? or does it seem very vague on details? the one man quoted dealt with PILOTS, amd not mechanics, and the complainants wanted to remain annonymous to protect their jobs. i do not doubt that there are non english speaking persons working on aircraft. what i doubt is the veracity of THIS article. it leads in with a plane crashing in 2003 and then it goes on to descrivbe non english speaking mechanics. there is no connection other than \"it could have happened\" then it goes on to describe what COULD happen, and even called for an arrest of supervisos for hiring them, because some plane is going to crash and kill a bunch of people. is there any verified fact in this article? are there belly aching workers who are pizzed off because Igor, or Paco, or Vlad got the job he wanted. and got it for what the cpomplainant THINKS they got it for. Payroll records are not public to the employees, and since the workers cannot read of write English one would assume they do not speak it either. so... how does the guy complaining KNOW what they make unless he speaks the language of the other guy and was told by the target? in other words, i see a LOT of assuming here, and still little fact. are there any supporting stories from other papers? any interviews with FAA? any interviews with the companies? inquiries? IRS investigations? federal investigations am i supposed to take the word of one single reporter as \"fact\"?", 
        "intTime": 20090521, 
        "postID": 11, 
        "quote": "Originally posted by PhoenixDark: Here's a link to what I think they're talking about: \"http://www.wfaa.com/sharedcontent/dws/wfaa/localnews/investigates/stories/wfaa090515-_lj_harris.7a4a7d4.html\"", 
        "reply": " ok. i see the article. is it just me? or does it seem very vague on details? the one man quoted dealt with PILOTS, amd not mechanics, and the complainants wanted to remain annonymous to protect their jobs. i do not doubt that there are non english speaking persons working on aircraft. what i doubt is the veracity of THIS article. it leads in with a plane crashing in 2003 and then it goes on to descrivbe non english speaking mechanics. there is no connection other than \"it could have happened\" then it goes on to describe what COULD happen, and even called for an arrest of supervisos for hiring them, because some plane is going to crash and kill a bunch of people. is there any verified fact in this article? are there belly aching workers who are pizzed off because Igor, or Paco, or Vlad got the job he wanted. and got it for what the cpomplainant THINKS they got it for. Payroll records are not public to the employees, and since the workers cannot read of write English one would assume they do not speak it either. so... how does the guy complaining KNOW what they make unless he speaks the language of the other guy and was told by the target? in other words, i see a LOT of assuming here, and still little fact. are there any supporting stories from other papers? any interviews with FAA? any interviews with the companies? inquiries? IRS investigations? federal investigations am i supposed to take the word of one single reporter as \"fact\"?", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 07:30:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: ass-u-me where is an article? a link? some supporting info? \"i just heard\" is not even news: it is gossip. futhermore, airline mechanics come from all countries. what if this guy has 30 plus years fixing aircraft? YOU and I do not know just Ass-u-me I do not have a link....... I was listening to FOX news on the TV and this story came up.... therefore my phrase \"I just heard\". One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090521, 
        "postID": 12, 
        "quote": "Originally posted by Elesso: ass-u-me where is an article? a link? some supporting info? \"i just heard\" is not even news: it is gossip. futhermore, airline mechanics come from all countries. what if this guy has 30 plus years fixing aircraft? YOU and I do not know just Ass-u-me", 
        "reply": " I do not have a link....... I was listening to FOX news on the TV and this story came up.... therefore my phrase \"I just heard\". One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 08:45:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by Elesso: ass-u-me where is an article? a link? some supporting info? \"i just heard\" is not even news: it is gossip. futhermore, airline mechanics come from all countries. what if this guy has 30 plus years fixing aircraft? YOU and I do not know just Ass-u-me I do not have a link....... I was listening to FOX news on the TV and this story came up.... therefore my phrase \"I just heard\". nuff said", 
        "intTime": 20090521, 
        "postID": 13, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by Elesso: ass-u-me where is an article? a link? some supporting info? \"i just heard\" is not even news: it is gossip. futhermore, airline mechanics come from all countries. what if this guy has 30 plus years fixing aircraft? YOU and I do not know just Ass-u-me I do not have a link....... I was listening to FOX news on the TV and this story came up.... therefore my phrase \"I just heard\".", 
        "reply": " nuff said", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 08:54:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. I'm thinking you can thank Reagan, he was the President that granted amnesty. You might also thank the company management for putting profits above public safety (now there's a surprise). Yep, slam the companies. They need to be held responsible. We also need to get on the FAA for not keeping a better eye on testing facilities. As far as Reagan goes, the amnesty was very limited and also called for congress to appropriate funds for control of the borders IIRC. No one really supported the follow-up. That politicians would rather have the voting block versus controlling both legal and illegal immigration is why our borders are so porous.", 
        "intTime": 20090521, 
        "postID": 14, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. I'm thinking you can thank Reagan, he was the President that granted amnesty. You might also thank the company management for putting profits above public safety (now there's a surprise).", 
        "reply": " Yep, slam the companies. They need to be held responsible. We also need to get on the FAA for not keeping a better eye on testing facilities. As far as Reagan goes, the amnesty was very limited and also called for congress to appropriate funds for control of the borders IIRC. No one really supported the follow-up. That politicians would rather have the voting block versus controlling both legal and illegal immigration is why our borders are so porous.", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 09:01:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. The very reason I am no longer employed as an A&P mechanic. Repair facilities do not want to pay what the work is worth. This crap is one reason why and it will bite them in the a$$ sooner or later. And not being able to read tech data is just plain scary.", 
        "intTime": 20090521, 
        "postID": 15, 
        "quote": "Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years.", 
        "reply": " The very reason I am no longer employed as an A&P mechanic. Repair facilities do not want to pay what the work is worth. This crap is one reason why and it will bite them in the a$$ sooner or later. And not being able to read tech data is just plain scary.", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 09:04:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. I'm thinking you can thank Reagan, he was the President that granted amnesty. You might also thank the company management for putting profits above public safety (now there's a surprise). Yep, slam the companies. They need to be held responsible. We also need to get on the FAA for not keeping a better eye on testing facilities. As far as Reagan goes, the amnesty was very limited and also called for congress to appropriate funds for control of the borders IIRC. No one really supported the follow-up. That politicians would rather have the voting block versus controlling both legal and illegal immigration is why our borders are so porous. Illegal immigrants do not constitute a voting block, they do however constitute CHEAP LABOR!", 
        "intTime": 20090521, 
        "postID": 16, 
        "quote": "Originally posted by sw614: quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. I'm thinking you can thank Reagan, he was the President that granted amnesty. You might also thank the company management for putting profits above public safety (now there's a surprise). Yep, slam the companies. They need to be held responsible. We also need to get on the FAA for not keeping a better eye on testing facilities. As far as Reagan goes, the amnesty was very limited and also called for congress to appropriate funds for control of the borders IIRC. No one really supported the follow-up. That politicians would rather have the voting block versus controlling both legal and illegal immigration is why our borders are so porous.", 
        "reply": " Illegal immigrants do not constitute a voting block, they do however constitute CHEAP LABOR!", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 09:08:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "Why is that any worse that United, US Air and some other airlines outsourcing their maintenance to foriegn countries where NO workers speak English? Not to mention that some airlines fly European-built aircraft (Fokker, Airbus) and even our english-speaking mechanics can't read the manuals.", 
        "intTime": 20090521, 
        "postID": 17, 
        "quote": "", 
        "reply": "Why is that any worse that United, US Air and some other airlines outsourcing their maintenance to foriegn countries where NO workers speak English? Not to mention that some airlines fly European-built aircraft (Fokker, Airbus) and even our english-speaking mechanics can't read the manuals.", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 09:47:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Why is that any worse that United, US Air and some other airlines outsourcing their maintenance to foriegn countries where NO workers speak English? Not to mention that some airlines fly European-built aircraft (Fokker, Airbus) and even our english-speaking mechanics can't read the manuals. There are lots of Hispanics in general that don't speak or read English. If it is broke they will fix it. It may be discriminatory to require that on a job description. You don't seriously believe that even the English-readers read, do you? Better yet, even the Congress doesn't read! \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090521, 
        "postID": 18, 
        "quote": "Originally posted by stillkit: Why is that any worse that United, US Air and some other airlines outsourcing their maintenance to foriegn countries where NO workers speak English? Not to mention that some airlines fly European-built aircraft (Fokker, Airbus) and even our english-speaking mechanics can't read the manuals.", 
        "reply": " There are lots of Hispanics in general that don't speak or read English. If it is broke they will fix it. It may be discriminatory to require that on a job description. You don't seriously believe that even the English-readers read, do you? Better yet, even the Congress doesn't read! \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 16:10:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "There are only a few options: boycott the airline, or march on washington. But somehow, I do not think it is the airline itself that is hiring non-english speaking workers. This is a scam in the following order: 1.The way these things work is that small groups of people want to divert workers' paychecks into their own bank account. This is illegal. Plus, the workers would have a recourse: they can have their days in court. 2. NOW: since the above scenario is illegal, the same groups of people advocate for things like NAFTA. This way, the small groups of people can put themsleves in a position where their only job is getting paid, while foreigners do the work. 3. This gets done by Contracting. So, here is the order: a. Company xyz hires and pays 100 American workers. b. 5 people form Contractor 123. c. These same people lobby for things like NAFTA. Then, they sign contracts with company xyz. Company xyz than lays off all 100 American workers, and hires the 5 people to do the same jobs. d. So, the 5 people collect the paychecks that the 100 American workers collected. AND immigrants who work for nothing do the work, while the 5 people get paid. I expose free trade for what it is, I think it is the legalization of the diversion of paychecks is all it is. Like I said, had it not been for NAFTA and free trade agreements, these same 5 people would be doing ID theft schemes, and diverting American workers paychecks into their own bank acounts. quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years.", 
        "intTime": 20090521, 
        "postID": 19, 
        "quote": "Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years.", 
        "reply": "There are only a few options: boycott the airline, or march on washington. But somehow, I do not think it is the airline itself that is hiring non-english speaking workers. This is a scam in the following order: 1.The way these things work is that small groups of people want to divert workers' paychecks into their own bank account. This is illegal. Plus, the workers would have a recourse: they can have their days in court. 2. NOW: since the above scenario is illegal, the same groups of people advocate for things like NAFTA. This way, the small groups of people can put themsleves in a position where their only job is getting paid, while foreigners do the work. 3. This gets done by Contracting. So, here is the order: a. Company xyz hires and pays 100 American workers. b. 5 people form Contractor 123. c. These same people lobby for things like NAFTA. Then, they sign contracts with company xyz. Company xyz than lays off all 100 American workers, and hires the 5 people to do the same jobs. d. So, the 5 people collect the paychecks that the 100 American workers collected. AND immigrants who work for nothing do the work, while the 5 people get paid. I expose free trade for what it is, I think it is the legalization of the diversion of paychecks is all it is. Like I said, had it not been for NAFTA and free trade agreements, these same 5 people would be doing ID theft schemes, and diverting American workers paychecks into their own bank acounts. ", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 17:08:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "cybercafe"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. The very reason I am no longer employed as an A&P mechanic. Repair facilities do not want to pay what the work is worth. This crap is one reason why and it will bite them in the a$$ sooner or later. And not being able to read tech data is just plain scary. I know that's what I never will. It cost mega bucks to get certified and for what? crap.", 
        "intTime": 20090521, 
        "postID": 20, 
        "quote": "Originally posted by sw614: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. The very reason I am no longer employed as an A&P mechanic. Repair facilities do not want to pay what the work is worth. This crap is one reason why and it will bite them in the a$$ sooner or later. And not being able to read tech data is just plain scary.", 
        "reply": " I know that's what I never will. It cost mega bucks to get certified and for what? crap.", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 18:07:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Just heard on the news that an airline in Texas is hiring mechanics who cannot read english. It said the airline was hiring on the cheap. Now, how can a problem be fixed when the person doing the fix cannot read the manual which describes how the problem is to be fixed. Just wondering. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090520, 
        "postID": 21, 
        "quote": "", 
        "reply": "Just heard on the news that an airline in Texas is hiring mechanics who cannot read english. It said the airline was hiring on the cheap. Now, how can a problem be fixed when the person doing the fix cannot read the manual which describes how the problem is to be fixed. Just wondering. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-20 09:23:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years.", 
        "intTime": 20090520, 
        "postID": 22, 
        "quote": "", 
        "reply": "Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years.", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-20 09:49:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090520, 
        "postID": 23, 
        "quote": "Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years.", 
        "reply": " Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-20 09:53:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "Anbar7"
    }, 
    {
        "content": "It just said that the FAA says that the work can be done by someone who does not have a good command of the language BUT repairs HAD to be inspected by a \"certified\" mechanic.... and one stipulation of that certificate was to be able to read and understand English. Still don't like it. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090520, 
        "postID": 24, 
        "quote": "", 
        "reply": "It just said that the FAA says that the work can be done by someone who does not have a good command of the language BUT repairs HAD to be inspected by a \"certified\" mechanic.... and one stipulation of that certificate was to be able to read and understand English. Still don't like it. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-20 10:20:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Which airline?", 
        "intTime": 20090520, 
        "postID": 25, 
        "quote": "", 
        "reply": "Which airline?", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-20 14:44:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "Let's hope it's Air Force One quote: Originally posted by PhoenixDark: Which airline?", 
        "intTime": 20090521, 
        "postID": 26, 
        "quote": "Originally posted by PhoenixDark: Which airline?", 
        "reply": "Let's hope it's Air Force One ", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 05:21:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "aaronl1369"
    }, 
    {
        "content": "Yeah, seriously, which airline?", 
        "intTime": 20090521, 
        "postID": 27, 
        "quote": "", 
        "reply": "Yeah, seriously, which airline?", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 05:42:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "sabow"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. I'm thinking you can thank Reagan, he was the President that granted amnesty. You might also thank the company management for putting profits above public safety (now there's a surprise).", 
        "intTime": 20090521, 
        "postID": 28, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas.", 
        "reply": " I'm thinking you can thank Reagan, he was the President that granted amnesty. You might also thank the company management for putting profits above public safety (now there's a surprise).", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 06:54:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. ass-u-me where is an article? a link? some supporting info? \"i just heard\" is not even news: it is gossip. futhermore, airline mechanics come from all countries. what if this guy has 30 plus years fixing aircraft? YOU and I do not know just Ass-u-me", 
        "intTime": 20090521, 
        "postID": 29, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas.", 
        "reply": " ass-u-me where is an article? a link? some supporting info? \"i just heard\" is not even news: it is gossip. futhermore, airline mechanics come from all countries. what if this guy has 30 plus years fixing aircraft? YOU and I do not know just Ass-u-me", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 07:02:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "Elesso"
    }, 
    {
        "content": "Here's a link to what I think they're talking about: \"http://www.wfaa.com/sharedcontent/dws/wfaa/localnews/investigates/stories/wfaa090515-_lj_harris.7a4a7d4.html\"", 
        "intTime": 20090521, 
        "postID": 30, 
        "quote": "", 
        "reply": "Here's a link to what I think they're talking about: \"http://www.wfaa.com/sharedcontent/dws/wfaa/localnews/investigates/stories/wfaa090515-_lj_harris.7a4a7d4.html\"", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 07:09:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Here's a link to what I think they're talking about: \"http://www.wfaa.com/sharedcontent/dws/wfaa/localnews/investigates/stories/wfaa090515-_lj_harris.7a4a7d4.html\" ok. i see the article. is it just me? or does it seem very vague on details? the one man quoted dealt with PILOTS, amd not mechanics, and the complainants wanted to remain annonymous to protect their jobs. i do not doubt that there are non english speaking persons working on aircraft. what i doubt is the veracity of THIS article. it leads in with a plane crashing in 2003 and then it goes on to descrivbe non english speaking mechanics. there is no connection other than \"it could have happened\" then it goes on to describe what COULD happen, and even called for an arrest of supervisos for hiring them, because some plane is going to crash and kill a bunch of people. is there any verified fact in this article? are there belly aching workers who are pizzed off because Igor, or Paco, or Vlad got the job he wanted. and got it for what the cpomplainant THINKS they got it for. Payroll records are not public to the employees, and since the workers cannot read of write English one would assume they do not speak it either. so... how does the guy complaining KNOW what they make unless he speaks the language of the other guy and was told by the target? in other words, i see a LOT of assuming here, and still little fact. are there any supporting stories from other papers? any interviews with FAA? any interviews with the companies? inquiries? IRS investigations? federal investigations am i supposed to take the word of one single reporter as \"fact\"?", 
        "intTime": 20090521, 
        "postID": 31, 
        "quote": "Originally posted by PhoenixDark: Here's a link to what I think they're talking about: \"http://www.wfaa.com/sharedcontent/dws/wfaa/localnews/investigates/stories/wfaa090515-_lj_harris.7a4a7d4.html\"", 
        "reply": " ok. i see the article. is it just me? or does it seem very vague on details? the one man quoted dealt with PILOTS, amd not mechanics, and the complainants wanted to remain annonymous to protect their jobs. i do not doubt that there are non english speaking persons working on aircraft. what i doubt is the veracity of THIS article. it leads in with a plane crashing in 2003 and then it goes on to descrivbe non english speaking mechanics. there is no connection other than \"it could have happened\" then it goes on to describe what COULD happen, and even called for an arrest of supervisos for hiring them, because some plane is going to crash and kill a bunch of people. is there any verified fact in this article? are there belly aching workers who are pizzed off because Igor, or Paco, or Vlad got the job he wanted. and got it for what the cpomplainant THINKS they got it for. Payroll records are not public to the employees, and since the workers cannot read of write English one would assume they do not speak it either. so... how does the guy complaining KNOW what they make unless he speaks the language of the other guy and was told by the target? in other words, i see a LOT of assuming here, and still little fact. are there any supporting stories from other papers? any interviews with FAA? any interviews with the companies? inquiries? IRS investigations? federal investigations am i supposed to take the word of one single reporter as \"fact\"?", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 07:30:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: ass-u-me where is an article? a link? some supporting info? \"i just heard\" is not even news: it is gossip. futhermore, airline mechanics come from all countries. what if this guy has 30 plus years fixing aircraft? YOU and I do not know just Ass-u-me I do not have a link....... I was listening to FOX news on the TV and this story came up.... therefore my phrase \"I just heard\". One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090521, 
        "postID": 32, 
        "quote": "Originally posted by Elesso: ass-u-me where is an article? a link? some supporting info? \"i just heard\" is not even news: it is gossip. futhermore, airline mechanics come from all countries. what if this guy has 30 plus years fixing aircraft? YOU and I do not know just Ass-u-me", 
        "reply": " I do not have a link....... I was listening to FOX news on the TV and this story came up.... therefore my phrase \"I just heard\". One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 08:45:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by Elesso: ass-u-me where is an article? a link? some supporting info? \"i just heard\" is not even news: it is gossip. futhermore, airline mechanics come from all countries. what if this guy has 30 plus years fixing aircraft? YOU and I do not know just Ass-u-me I do not have a link....... I was listening to FOX news on the TV and this story came up.... therefore my phrase \"I just heard\". nuff said", 
        "intTime": 20090521, 
        "postID": 33, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by Elesso: ass-u-me where is an article? a link? some supporting info? \"i just heard\" is not even news: it is gossip. futhermore, airline mechanics come from all countries. what if this guy has 30 plus years fixing aircraft? YOU and I do not know just Ass-u-me I do not have a link....... I was listening to FOX news on the TV and this story came up.... therefore my phrase \"I just heard\".", 
        "reply": " nuff said", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 08:54:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. I'm thinking you can thank Reagan, he was the President that granted amnesty. You might also thank the company management for putting profits above public safety (now there's a surprise). Yep, slam the companies. They need to be held responsible. We also need to get on the FAA for not keeping a better eye on testing facilities. As far as Reagan goes, the amnesty was very limited and also called for congress to appropriate funds for control of the borders IIRC. No one really supported the follow-up. That politicians would rather have the voting block versus controlling both legal and illegal immigration is why our borders are so porous.", 
        "intTime": 20090521, 
        "postID": 34, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. I'm thinking you can thank Reagan, he was the President that granted amnesty. You might also thank the company management for putting profits above public safety (now there's a surprise).", 
        "reply": " Yep, slam the companies. They need to be held responsible. We also need to get on the FAA for not keeping a better eye on testing facilities. As far as Reagan goes, the amnesty was very limited and also called for congress to appropriate funds for control of the borders IIRC. No one really supported the follow-up. That politicians would rather have the voting block versus controlling both legal and illegal immigration is why our borders are so porous.", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 09:01:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. The very reason I am no longer employed as an A&P mechanic. Repair facilities do not want to pay what the work is worth. This crap is one reason why and it will bite them in the a$$ sooner or later. And not being able to read tech data is just plain scary.", 
        "intTime": 20090521, 
        "postID": 35, 
        "quote": "Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years.", 
        "reply": " The very reason I am no longer employed as an A&P mechanic. Repair facilities do not want to pay what the work is worth. This crap is one reason why and it will bite them in the a$$ sooner or later. And not being able to read tech data is just plain scary.", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 09:04:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. I'm thinking you can thank Reagan, he was the President that granted amnesty. You might also thank the company management for putting profits above public safety (now there's a surprise). Yep, slam the companies. They need to be held responsible. We also need to get on the FAA for not keeping a better eye on testing facilities. As far as Reagan goes, the amnesty was very limited and also called for congress to appropriate funds for control of the borders IIRC. No one really supported the follow-up. That politicians would rather have the voting block versus controlling both legal and illegal immigration is why our borders are so porous. Illegal immigrants do not constitute a voting block, they do however constitute CHEAP LABOR!", 
        "intTime": 20090521, 
        "postID": 36, 
        "quote": "Originally posted by sw614: quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. I'm thinking you can thank Reagan, he was the President that granted amnesty. You might also thank the company management for putting profits above public safety (now there's a surprise). Yep, slam the companies. They need to be held responsible. We also need to get on the FAA for not keeping a better eye on testing facilities. As far as Reagan goes, the amnesty was very limited and also called for congress to appropriate funds for control of the borders IIRC. No one really supported the follow-up. That politicians would rather have the voting block versus controlling both legal and illegal immigration is why our borders are so porous.", 
        "reply": " Illegal immigrants do not constitute a voting block, they do however constitute CHEAP LABOR!", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 09:08:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "Why is that any worse that United, US Air and some other airlines outsourcing their maintenance to foriegn countries where NO workers speak English? Not to mention that some airlines fly European-built aircraft (Fokker, Airbus) and even our english-speaking mechanics can't read the manuals.", 
        "intTime": 20090521, 
        "postID": 37, 
        "quote": "", 
        "reply": "Why is that any worse that United, US Air and some other airlines outsourcing their maintenance to foriegn countries where NO workers speak English? Not to mention that some airlines fly European-built aircraft (Fokker, Airbus) and even our english-speaking mechanics can't read the manuals.", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 09:47:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Why is that any worse that United, US Air and some other airlines outsourcing their maintenance to foriegn countries where NO workers speak English? Not to mention that some airlines fly European-built aircraft (Fokker, Airbus) and even our english-speaking mechanics can't read the manuals. There are lots of Hispanics in general that don't speak or read English. If it is broke they will fix it. It may be discriminatory to require that on a job description. You don't seriously believe that even the English-readers read, do you? Better yet, even the Congress doesn't read! \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090521, 
        "postID": 38, 
        "quote": "Originally posted by stillkit: Why is that any worse that United, US Air and some other airlines outsourcing their maintenance to foriegn countries where NO workers speak English? Not to mention that some airlines fly European-built aircraft (Fokker, Airbus) and even our english-speaking mechanics can't read the manuals.", 
        "reply": " There are lots of Hispanics in general that don't speak or read English. If it is broke they will fix it. It may be discriminatory to require that on a job description. You don't seriously believe that even the English-readers read, do you? Better yet, even the Congress doesn't read! \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 16:10:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "There are only a few options: boycott the airline, or march on washington. But somehow, I do not think it is the airline itself that is hiring non-english speaking workers. This is a scam in the following order: 1.The way these things work is that small groups of people want to divert workers' paychecks into their own bank account. This is illegal. Plus, the workers would have a recourse: they can have their days in court. 2. NOW: since the above scenario is illegal, the same groups of people advocate for things like NAFTA. This way, the small groups of people can put themsleves in a position where their only job is getting paid, while foreigners do the work. 3. This gets done by Contracting. So, here is the order: a. Company xyz hires and pays 100 American workers. b. 5 people form Contractor 123. c. These same people lobby for things like NAFTA. Then, they sign contracts with company xyz. Company xyz than lays off all 100 American workers, and hires the 5 people to do the same jobs. d. So, the 5 people collect the paychecks that the 100 American workers collected. AND immigrants who work for nothing do the work, while the 5 people get paid. I expose free trade for what it is, I think it is the legalization of the diversion of paychecks is all it is. Like I said, had it not been for NAFTA and free trade agreements, these same 5 people would be doing ID theft schemes, and diverting American workers paychecks into their own bank acounts. quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years.", 
        "intTime": 20090521, 
        "postID": 39, 
        "quote": "Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years.", 
        "reply": "There are only a few options: boycott the airline, or march on washington. But somehow, I do not think it is the airline itself that is hiring non-english speaking workers. This is a scam in the following order: 1.The way these things work is that small groups of people want to divert workers' paychecks into their own bank account. This is illegal. Plus, the workers would have a recourse: they can have their days in court. 2. NOW: since the above scenario is illegal, the same groups of people advocate for things like NAFTA. This way, the small groups of people can put themsleves in a position where their only job is getting paid, while foreigners do the work. 3. This gets done by Contracting. So, here is the order: a. Company xyz hires and pays 100 American workers. b. 5 people form Contractor 123. c. These same people lobby for things like NAFTA. Then, they sign contracts with company xyz. Company xyz than lays off all 100 American workers, and hires the 5 people to do the same jobs. d. So, the 5 people collect the paychecks that the 100 American workers collected. AND immigrants who work for nothing do the work, while the 5 people get paid. I expose free trade for what it is, I think it is the legalization of the diversion of paychecks is all it is. Like I said, had it not been for NAFTA and free trade agreements, these same 5 people would be doing ID theft schemes, and diverting American workers paychecks into their own bank acounts. ", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 17:08:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "cybercafe"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. The very reason I am no longer employed as an A&P mechanic. Repair facilities do not want to pay what the work is worth. This crap is one reason why and it will bite them in the a$$ sooner or later. And not being able to read tech data is just plain scary. I know that's what I never will. It cost mega bucks to get certified and for what? crap.", 
        "intTime": 20090521, 
        "postID": 40, 
        "quote": "Originally posted by sw614: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. The very reason I am no longer employed as an A&P mechanic. Repair facilities do not want to pay what the work is worth. This crap is one reason why and it will bite them in the a$$ sooner or later. And not being able to read tech data is just plain scary.", 
        "reply": " I know that's what I never will. It cost mega bucks to get certified and for what? crap.", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 18:07:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Just heard on the news that an airline in Texas is hiring mechanics who cannot read english. It said the airline was hiring on the cheap. Now, how can a problem be fixed when the person doing the fix cannot read the manual which describes how the problem is to be fixed. Just wondering. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090520, 
        "postID": 41, 
        "quote": "", 
        "reply": "Just heard on the news that an airline in Texas is hiring mechanics who cannot read english. It said the airline was hiring on the cheap. Now, how can a problem be fixed when the person doing the fix cannot read the manual which describes how the problem is to be fixed. Just wondering. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-20 09:23:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years.", 
        "intTime": 20090520, 
        "postID": 42, 
        "quote": "", 
        "reply": "Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years.", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-20 09:49:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090520, 
        "postID": 43, 
        "quote": "Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years.", 
        "reply": " Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-20 09:53:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "Anbar7"
    }, 
    {
        "content": "It just said that the FAA says that the work can be done by someone who does not have a good command of the language BUT repairs HAD to be inspected by a \"certified\" mechanic.... and one stipulation of that certificate was to be able to read and understand English. Still don't like it. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090520, 
        "postID": 44, 
        "quote": "", 
        "reply": "It just said that the FAA says that the work can be done by someone who does not have a good command of the language BUT repairs HAD to be inspected by a \"certified\" mechanic.... and one stipulation of that certificate was to be able to read and understand English. Still don't like it. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-20 10:20:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Which airline?", 
        "intTime": 20090520, 
        "postID": 45, 
        "quote": "", 
        "reply": "Which airline?", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-20 14:44:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "Let's hope it's Air Force One quote: Originally posted by PhoenixDark: Which airline?", 
        "intTime": 20090521, 
        "postID": 46, 
        "quote": "Originally posted by PhoenixDark: Which airline?", 
        "reply": "Let's hope it's Air Force One ", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 05:21:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "aaronl1369"
    }, 
    {
        "content": "Yeah, seriously, which airline?", 
        "intTime": 20090521, 
        "postID": 47, 
        "quote": "", 
        "reply": "Yeah, seriously, which airline?", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 05:42:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "sabow"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. I'm thinking you can thank Reagan, he was the President that granted amnesty. You might also thank the company management for putting profits above public safety (now there's a surprise).", 
        "intTime": 20090521, 
        "postID": 48, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas.", 
        "reply": " I'm thinking you can thank Reagan, he was the President that granted amnesty. You might also thank the company management for putting profits above public safety (now there's a surprise).", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 06:54:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. ass-u-me where is an article? a link? some supporting info? \"i just heard\" is not even news: it is gossip. futhermore, airline mechanics come from all countries. what if this guy has 30 plus years fixing aircraft? YOU and I do not know just Ass-u-me", 
        "intTime": 20090521, 
        "postID": 49, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas.", 
        "reply": " ass-u-me where is an article? a link? some supporting info? \"i just heard\" is not even news: it is gossip. futhermore, airline mechanics come from all countries. what if this guy has 30 plus years fixing aircraft? YOU and I do not know just Ass-u-me", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 07:02:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "Elesso"
    }, 
    {
        "content": "Here's a link to what I think they're talking about: \"http://www.wfaa.com/sharedcontent/dws/wfaa/localnews/investigates/stories/wfaa090515-_lj_harris.7a4a7d4.html\"", 
        "intTime": 20090521, 
        "postID": 50, 
        "quote": "", 
        "reply": "Here's a link to what I think they're talking about: \"http://www.wfaa.com/sharedcontent/dws/wfaa/localnews/investigates/stories/wfaa090515-_lj_harris.7a4a7d4.html\"", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 07:09:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: Here's a link to what I think they're talking about: \"http://www.wfaa.com/sharedcontent/dws/wfaa/localnews/investigates/stories/wfaa090515-_lj_harris.7a4a7d4.html\" ok. i see the article. is it just me? or does it seem very vague on details? the one man quoted dealt with PILOTS, amd not mechanics, and the complainants wanted to remain annonymous to protect their jobs. i do not doubt that there are non english speaking persons working on aircraft. what i doubt is the veracity of THIS article. it leads in with a plane crashing in 2003 and then it goes on to descrivbe non english speaking mechanics. there is no connection other than \"it could have happened\" then it goes on to describe what COULD happen, and even called for an arrest of supervisos for hiring them, because some plane is going to crash and kill a bunch of people. is there any verified fact in this article? are there belly aching workers who are pizzed off because Igor, or Paco, or Vlad got the job he wanted. and got it for what the cpomplainant THINKS they got it for. Payroll records are not public to the employees, and since the workers cannot read of write English one would assume they do not speak it either. so... how does the guy complaining KNOW what they make unless he speaks the language of the other guy and was told by the target? in other words, i see a LOT of assuming here, and still little fact. are there any supporting stories from other papers? any interviews with FAA? any interviews with the companies? inquiries? IRS investigations? federal investigations am i supposed to take the word of one single reporter as \"fact\"?", 
        "intTime": 20090521, 
        "postID": 51, 
        "quote": "Originally posted by PhoenixDark: Here's a link to what I think they're talking about: \"http://www.wfaa.com/sharedcontent/dws/wfaa/localnews/investigates/stories/wfaa090515-_lj_harris.7a4a7d4.html\"", 
        "reply": " ok. i see the article. is it just me? or does it seem very vague on details? the one man quoted dealt with PILOTS, amd not mechanics, and the complainants wanted to remain annonymous to protect their jobs. i do not doubt that there are non english speaking persons working on aircraft. what i doubt is the veracity of THIS article. it leads in with a plane crashing in 2003 and then it goes on to descrivbe non english speaking mechanics. there is no connection other than \"it could have happened\" then it goes on to describe what COULD happen, and even called for an arrest of supervisos for hiring them, because some plane is going to crash and kill a bunch of people. is there any verified fact in this article? are there belly aching workers who are pizzed off because Igor, or Paco, or Vlad got the job he wanted. and got it for what the cpomplainant THINKS they got it for. Payroll records are not public to the employees, and since the workers cannot read of write English one would assume they do not speak it either. so... how does the guy complaining KNOW what they make unless he speaks the language of the other guy and was told by the target? in other words, i see a LOT of assuming here, and still little fact. are there any supporting stories from other papers? any interviews with FAA? any interviews with the companies? inquiries? IRS investigations? federal investigations am i supposed to take the word of one single reporter as \"fact\"?", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 07:30:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by Elesso: ass-u-me where is an article? a link? some supporting info? \"i just heard\" is not even news: it is gossip. futhermore, airline mechanics come from all countries. what if this guy has 30 plus years fixing aircraft? YOU and I do not know just Ass-u-me I do not have a link....... I was listening to FOX news on the TV and this story came up.... therefore my phrase \"I just heard\". One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090521, 
        "postID": 52, 
        "quote": "Originally posted by Elesso: ass-u-me where is an article? a link? some supporting info? \"i just heard\" is not even news: it is gossip. futhermore, airline mechanics come from all countries. what if this guy has 30 plus years fixing aircraft? YOU and I do not know just Ass-u-me", 
        "reply": " I do not have a link....... I was listening to FOX news on the TV and this story came up.... therefore my phrase \"I just heard\". One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 08:45:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: quote: Originally posted by Elesso: ass-u-me where is an article? a link? some supporting info? \"i just heard\" is not even news: it is gossip. futhermore, airline mechanics come from all countries. what if this guy has 30 plus years fixing aircraft? YOU and I do not know just Ass-u-me I do not have a link....... I was listening to FOX news on the TV and this story came up.... therefore my phrase \"I just heard\". nuff said", 
        "intTime": 20090521, 
        "postID": 53, 
        "quote": "Originally posted by m551sheridan: quote: Originally posted by Elesso: ass-u-me where is an article? a link? some supporting info? \"i just heard\" is not even news: it is gossip. futhermore, airline mechanics come from all countries. what if this guy has 30 plus years fixing aircraft? YOU and I do not know just Ass-u-me I do not have a link....... I was listening to FOX news on the TV and this story came up.... therefore my phrase \"I just heard\".", 
        "reply": " nuff said", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 08:54:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. I'm thinking you can thank Reagan, he was the President that granted amnesty. You might also thank the company management for putting profits above public safety (now there's a surprise). Yep, slam the companies. They need to be held responsible. We also need to get on the FAA for not keeping a better eye on testing facilities. As far as Reagan goes, the amnesty was very limited and also called for congress to appropriate funds for control of the borders IIRC. No one really supported the follow-up. That politicians would rather have the voting block versus controlling both legal and illegal immigration is why our borders are so porous.", 
        "intTime": 20090521, 
        "postID": 54, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. I'm thinking you can thank Reagan, he was the President that granted amnesty. You might also thank the company management for putting profits above public safety (now there's a surprise).", 
        "reply": " Yep, slam the companies. They need to be held responsible. We also need to get on the FAA for not keeping a better eye on testing facilities. As far as Reagan goes, the amnesty was very limited and also called for congress to appropriate funds for control of the borders IIRC. No one really supported the follow-up. That politicians would rather have the voting block versus controlling both legal and illegal immigration is why our borders are so porous.", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 09:01:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. The very reason I am no longer employed as an A&P mechanic. Repair facilities do not want to pay what the work is worth. This crap is one reason why and it will bite them in the a$$ sooner or later. And not being able to read tech data is just plain scary.", 
        "intTime": 20090521, 
        "postID": 55, 
        "quote": "Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years.", 
        "reply": " The very reason I am no longer employed as an A&P mechanic. Repair facilities do not want to pay what the work is worth. This crap is one reason why and it will bite them in the a$$ sooner or later. And not being able to read tech data is just plain scary.", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 09:04:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. I'm thinking you can thank Reagan, he was the President that granted amnesty. You might also thank the company management for putting profits above public safety (now there's a surprise). Yep, slam the companies. They need to be held responsible. We also need to get on the FAA for not keeping a better eye on testing facilities. As far as Reagan goes, the amnesty was very limited and also called for congress to appropriate funds for control of the borders IIRC. No one really supported the follow-up. That politicians would rather have the voting block versus controlling both legal and illegal immigration is why our borders are so porous. Illegal immigrants do not constitute a voting block, they do however constitute CHEAP LABOR!", 
        "intTime": 20090521, 
        "postID": 56, 
        "quote": "Originally posted by sw614: quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. Hey you can thank Pelosi....it is unAmerican to speak of hispanics like that...I'm assuming by the way that the person is Hispanic because it is Texas. I'm thinking you can thank Reagan, he was the President that granted amnesty. You might also thank the company management for putting profits above public safety (now there's a surprise). Yep, slam the companies. They need to be held responsible. We also need to get on the FAA for not keeping a better eye on testing facilities. As far as Reagan goes, the amnesty was very limited and also called for congress to appropriate funds for control of the borders IIRC. No one really supported the follow-up. That politicians would rather have the voting block versus controlling both legal and illegal immigration is why our borders are so porous.", 
        "reply": " Illegal immigrants do not constitute a voting block, they do however constitute CHEAP LABOR!", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 09:08:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "Why is that any worse that United, US Air and some other airlines outsourcing their maintenance to foriegn countries where NO workers speak English? Not to mention that some airlines fly European-built aircraft (Fokker, Airbus) and even our english-speaking mechanics can't read the manuals.", 
        "intTime": 20090521, 
        "postID": 57, 
        "quote": "", 
        "reply": "Why is that any worse that United, US Air and some other airlines outsourcing their maintenance to foriegn countries where NO workers speak English? Not to mention that some airlines fly European-built aircraft (Fokker, Airbus) and even our english-speaking mechanics can't read the manuals.", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 09:47:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "stillkit"
    }, 
    {
        "content": "quote: Originally posted by stillkit: Why is that any worse that United, US Air and some other airlines outsourcing their maintenance to foriegn countries where NO workers speak English? Not to mention that some airlines fly European-built aircraft (Fokker, Airbus) and even our english-speaking mechanics can't read the manuals. There are lots of Hispanics in general that don't speak or read English. If it is broke they will fix it. It may be discriminatory to require that on a job description. You don't seriously believe that even the English-readers read, do you? Better yet, even the Congress doesn't read! \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "intTime": 20090521, 
        "postID": 58, 
        "quote": "Originally posted by stillkit: Why is that any worse that United, US Air and some other airlines outsourcing their maintenance to foriegn countries where NO workers speak English? Not to mention that some airlines fly European-built aircraft (Fokker, Airbus) and even our english-speaking mechanics can't read the manuals.", 
        "reply": " There are lots of Hispanics in general that don't speak or read English. If it is broke they will fix it. It may be discriminatory to require that on a job description. You don't seriously believe that even the English-readers read, do you? Better yet, even the Congress doesn't read! \"They love our milk and honey but they preach about some other way of living When you’re running down my country, Hoss you’re walking on the fighting side of me\" - - Merle Haggard", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 16:10:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "aggie_swife"
    }, 
    {
        "content": "There are only a few options: boycott the airline, or march on washington. But somehow, I do not think it is the airline itself that is hiring non-english speaking workers. This is a scam in the following order: 1.The way these things work is that small groups of people want to divert workers' paychecks into their own bank account. This is illegal. Plus, the workers would have a recourse: they can have their days in court. 2. NOW: since the above scenario is illegal, the same groups of people advocate for things like NAFTA. This way, the small groups of people can put themsleves in a position where their only job is getting paid, while foreigners do the work. 3. This gets done by Contracting. So, here is the order: a. Company xyz hires and pays 100 American workers. b. 5 people form Contractor 123. c. These same people lobby for things like NAFTA. Then, they sign contracts with company xyz. Company xyz than lays off all 100 American workers, and hires the 5 people to do the same jobs. d. So, the 5 people collect the paychecks that the 100 American workers collected. AND immigrants who work for nothing do the work, while the 5 people get paid. I expose free trade for what it is, I think it is the legalization of the diversion of paychecks is all it is. Like I said, had it not been for NAFTA and free trade agreements, these same 5 people would be doing ID theft schemes, and diverting American workers paychecks into their own bank acounts. quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years.", 
        "intTime": 20090521, 
        "postID": 59, 
        "quote": "Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years.", 
        "reply": "There are only a few options: boycott the airline, or march on washington. But somehow, I do not think it is the airline itself that is hiring non-english speaking workers. This is a scam in the following order: 1.The way these things work is that small groups of people want to divert workers' paychecks into their own bank account. This is illegal. Plus, the workers would have a recourse: they can have their days in court. 2. NOW: since the above scenario is illegal, the same groups of people advocate for things like NAFTA. This way, the small groups of people can put themsleves in a position where their only job is getting paid, while foreigners do the work. 3. This gets done by Contracting. So, here is the order: a. Company xyz hires and pays 100 American workers. b. 5 people form Contractor 123. c. These same people lobby for things like NAFTA. Then, they sign contracts with company xyz. Company xyz than lays off all 100 American workers, and hires the 5 people to do the same jobs. d. So, the 5 people collect the paychecks that the 100 American workers collected. AND immigrants who work for nothing do the work, while the 5 people get paid. I expose free trade for what it is, I think it is the legalization of the diversion of paychecks is all it is. Like I said, had it not been for NAFTA and free trade agreements, these same 5 people would be doing ID theft schemes, and diverting American workers paychecks into their own bank acounts. ", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 17:08:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "cybercafe"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. The very reason I am no longer employed as an A&P mechanic. Repair facilities do not want to pay what the work is worth. This crap is one reason why and it will bite them in the a$$ sooner or later. And not being able to read tech data is just plain scary. I know that's what I never will. It cost mega bucks to get certified and for what? crap.", 
        "intTime": 20090521, 
        "postID": 60, 
        "quote": "Originally posted by sw614: quote: Originally posted by crackerjacks61: Man this is scary. I will never fly again. I'm serious too. It also ****es me off that they are allowed to hire cheap labor foreigners while here I am a jet mechanic for 20 years. The very reason I am no longer employed as an A&P mechanic. Repair facilities do not want to pay what the work is worth. This crap is one reason why and it will bite them in the a$$ sooner or later. And not being able to read tech data is just plain scary.", 
        "reply": " I know that's what I never will. It cost mega bucks to get certified and for what? crap.", 
        "threadID": "672198221_4470057322001", 
        "time": "2009-05-21 18:07:00", 
        "title": "Airline in Texas Hires Mechanics who cannot read English", 
        "userID": "crackerjacks61"
    }
]