[
    {
        "content": "\"http://news.yahoo.com/s/ap/20090414/ap_on_go_co/murtha_suit_2\" Didn't think he could do it. This message has been edited. Last edited by: USNVet940, Tue 14 April 2009 11:43 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090414,
        "postID": 1,
        "quote": "",
        "reply": "\"http://news.yahoo.com/s/ap/20090414/ap_on_go_co/murtha_suit_2\" Didn't think he could do it. This message has been edited. Last edited by: USNVet940, Tue 14 April 2009 11:43 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9120007022001",
        "time": "2009-04-14 10:25:00",
        "title": "Marine Cannot Sue Rep. Murtha - Appeals Court Rules",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090414/ap_on_go_co/murtha_suit_2\" Didn't think he could do it. Marines cant but marines who Arnt active or in reserves can I bet",
        "intTime": 20090415,
        "postID": 2,
        "quote": "Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090414/ap_on_go_co/murtha_suit_2\" Didn't think he could do it.",
        "reply": " Marines cant but marines who Arnt active or in reserves can I bet",
        "threadID": "672198221_9120007022001",
        "time": "2009-04-15 01:11:00",
        "title": "Marine Cannot Sue Rep. Murtha - Appeals Court Rules",
        "userID": "world_king377"
    },
    {
        "content": "Who's paying for his lawyer? Doubt he's using his own money for this. I'd like to know what organization is funding this.",
        "intTime": 20090415,
        "postID": 3,
        "quote": "",
        "reply": "Who's paying for his lawyer? Doubt he's using his own money for this. I'd like to know what organization is funding this.",
        "threadID": "672198221_9120007022001",
        "time": "2009-04-15 04:25:00",
        "title": "Marine Cannot Sue Rep. Murtha - Appeals Court Rules",
        "userID": "mrmixitup"
    },
    {
        "content": "quote: Originally posted by mrmixitup: Who's paying for his lawyer? Doubt he's using his own money for this. I'd like to know what organization is funding this. Why does it matter? Are you saying that it wouldn't be a big deal if someone slandered you and your squad in front of the world before an investigation was completed? IMHO, anyone in congress should be held just as accountable as we ordinary citizens.",
        "intTime": 20090415,
        "postID": 4,
        "quote": "Originally posted by mrmixitup: Who's paying for his lawyer? Doubt he's using his own money for this. I'd like to know what organization is funding this.",
        "reply": " Why does it matter? Are you saying that it wouldn't be a big deal if someone slandered you and your squad in front of the world before an investigation was completed? IMHO, anyone in congress should be held just as accountable as we ordinary citizens.",
        "threadID": "672198221_9120007022001",
        "time": "2009-04-15 05:49:00",
        "title": "Marine Cannot Sue Rep. Murtha - Appeals Court Rules",
        "userID": "Woody_in_La"
    },
    {
        "content": "quote: Originally posted by Woody_in_La: quote: Originally posted by mrmixitup: Who's paying for his lawyer? Doubt he's using his own money for this. I'd like to know what organization is funding this. Why does it matter? Are you saying that it wouldn't be a big deal if someone slandered you and your squad in front of the world before an investigation was completed? IMHO, anyone in congress should be held just as accountable as we ordinary citizens. Whether Murtha was wrong or right, there is simply no case of \"slander.\" The reason for that is quite simple - They were indicted. For there to be slander, there would have to also be no indictment. That he gave his \"opinion\" that the indictment was justified, is just that, opinion. The \"fact\" is in the indicment. There simply was no case of slander. I don't know about the Military system of Justice, but if this was a civilian court, they could, in theory sue the state for wrongful arrest - But even then they would have to prove that the evidence was frivoulus or lacked ANY credibility. Very few win those kinds of cases. Dave",
        "intTime": 20090415,
        "postID": 5,
        "quote": "Originally posted by Woody_in_La: quote: Originally posted by mrmixitup: Who's paying for his lawyer? Doubt he's using his own money for this. I'd like to know what organization is funding this. Why does it matter? Are you saying that it wouldn't be a big deal if someone slandered you and your squad in front of the world before an investigation was completed? IMHO, anyone in congress should be held just as accountable as we ordinary citizens.",
        "reply": " Whether Murtha was wrong or right, there is simply no case of \"slander.\" The reason for that is quite simple - They were indicted. For there to be slander, there would have to also be no indictment. That he gave his \"opinion\" that the indictment was justified, is just that, opinion. The \"fact\" is in the indicment. There simply was no case of slander. I don't know about the Military system of Justice, but if this was a civilian court, they could, in theory sue the state for wrongful arrest - But even then they would have to prove that the evidence was frivoulus or lacked ANY credibility. Very few win those kinds of cases. Dave",
        "threadID": "672198221_9120007022001",
        "time": "2009-04-15 07:03:00",
        "title": "Marine Cannot Sue Rep. Murtha - Appeals Court Rules",
        "userID": "Grachus"
    },
    {
        "content": "quote: They were indicted. For there to be slander, there would have to also be no indictment. That he gave his \"opinion\" that the indictment was justified, is just that, opinion. The \"fact\" is in the indicment. Huh? He ran his crooked mouth before there was even an investigation ... much less an \"indictment\". While I expected the ruling to be what it is ... let's base it on facts, not an invalid timeline.",
        "intTime": 20090415,
        "postID": 6,
        "quote": "They were indicted. For there to be slander, there would have to also be no indictment. That he gave his \"opinion\" that the indictment was justified, is just that, opinion. The \"fact\" is in the indicment.",
        "reply": " Huh? He ran his crooked mouth before there was even an investigation ... much less an \"indictment\". While I expected the ruling to be what it is ... let's base it on facts, not an invalid timeline.",
        "threadID": "672198221_9120007022001",
        "time": "2009-04-15 08:07:00",
        "title": "Marine Cannot Sue Rep. Murtha - Appeals Court Rules",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: They were indicted. For there to be slander, there would have to also be no indictment. That he gave his \"opinion\" that the indictment was justified, is just that, opinion. The \"fact\" is in the indicment. Huh? He ran his crooked mouth before there was even an investigation ... much less an \"indictment\". While I expected the ruling to be what it is ... let's base it on facts, not an invalid timeline. Spot on",
        "intTime": 20090415,
        "postID": 7,
        "quote": "Originally posted by I_M_Qwerty: quote: They were indicted. For there to be slander, there would have to also be no indictment. That he gave his \"opinion\" that the indictment was justified, is just that, opinion. The \"fact\" is in the indicment. Huh? He ran his crooked mouth before there was even an investigation ... much less an \"indictment\". While I expected the ruling to be what it is ... let's base it on facts, not an invalid timeline.",
        "reply": " Spot on",
        "threadID": "672198221_9120007022001",
        "time": "2009-04-15 08:36:00",
        "title": "Marine Cannot Sue Rep. Murtha - Appeals Court Rules",
        "userID": "NickBrand"
    },
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: They were indicted. For there to be slander, there would have to also be no indictment. That he gave his \"opinion\" that the indictment was justified, is just that, opinion. The \"fact\" is in the indicment. Huh? He ran his crooked mouth before there was even an investigation ... much less an \"indictment\". While I expected the ruling to be what it is ... let's base it on facts, not an invalid timeline. So true, so very very true. He had diarrhea of the mouth before anything had happened. It was slander. Based on his assumption I could say anything I wanted to and if came true within a few months then it wouldn't be slander because it happened later on. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090415,
        "postID": 8,
        "quote": "Originally posted by I_M_Qwerty: quote: They were indicted. For there to be slander, there would have to also be no indictment. That he gave his \"opinion\" that the indictment was justified, is just that, opinion. The \"fact\" is in the indicment. Huh? He ran his crooked mouth before there was even an investigation ... much less an \"indictment\". While I expected the ruling to be what it is ... let's base it on facts, not an invalid timeline.",
        "reply": " So true, so very very true. He had diarrhea of the mouth before anything had happened. It was slander. Based on his assumption I could say anything I wanted to and if came true within a few months then it wouldn't be slander because it happened later on. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9120007022001",
        "time": "2009-04-15 08:40:00",
        "title": "Marine Cannot Sue Rep. Murtha - Appeals Court Rules",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: They were indicted. For there to be slander, there would have to also be no indictment. That he gave his \"opinion\" that the indictment was justified, is just that, opinion. The \"fact\" is in the indicment. Huh? He ran his crooked mouth before there was even an investigation ... much less an \"indictment\". While I expected the ruling to be what it is ... let's base it on facts, not an invalid timeline. The fact that an indictment took place is the \"fact\" that makes a slander case against him, dead in the water. While you've raised this before, I know damn well that Murtha wasn't going to risk those statements if he didn't know an indictment was coming. A pro-forma denial by the military doesn't mean a damn thing - Anbar... quote: Based on his assumption I could say anything I wanted to and if came true within a few months then it wouldn't be slander because it happened later on. You are correct... As long as it's the exact same incident being described. Dave",
        "intTime": 20090415,
        "postID": 9,
        "quote": "Originally posted by I_M_Qwerty: quote: They were indicted. For there to be slander, there would have to also be no indictment. That he gave his \"opinion\" that the indictment was justified, is just that, opinion. The \"fact\" is in the indicment. Huh? He ran his crooked mouth before there was even an investigation ... much less an \"indictment\". While I expected the ruling to be what it is ... let's base it on facts, not an invalid timeline.",
        "reply": " The fact that an indictment took place is the \"fact\" that makes a slander case against him, dead in the water. While you've raised this before, I know damn well that Murtha wasn't going to risk those statements if he didn't know an indictment was coming. A pro-forma denial by the military doesn't mean a damn thing - Anbar... quote: Based on his assumption I could say anything I wanted to and if came true within a few months then it wouldn't be slander because it happened later on. You are correct... As long as it's the exact same incident being described. Dave",
        "threadID": "672198221_9120007022001",
        "time": "2009-04-15 08:49:00",
        "title": "Marine Cannot Sue Rep. Murtha - Appeals Court Rules",
        "userID": "Grachus"
    },
    {
        "content": "quote: The fact that an indictment took place is the \"fact\" that makes a slander case against him, dead in the water. While you've raised this before, I know damn well that Murtha wasn't going to risk those statements if he didn't know an indictment was coming. A pro-forma denial by the military doesn't mean a damn thing - You are right ... I have raised it before ... and been right before. Predicting an \"indictment\" is one thing ... though speculative at best when the investigation hasn't been completed much less acted upon by the appointing authority ... but you claimed - quote: That he gave his \"opinion\" that the indictment was justified, is just that, opinion. That is flat wrong. You can't have an opinion on an indictment that doesn't exist. Edited to add - Besides, I am not aware of any statement by Murtha on the \"indictment\" (results of the ART 32 investigation). He simply ran his mouth about the Marines involved before the investigation really got off the ground. BTW, he won't comment on Haditha at all now ... allegedly because it is an active legal matter. Too bad he didn't bridle his tongue in the first place ... when it was a far more active legal matter.",
        "intTime": 20090415,
        "postID": 10,
        "quote": "The fact that an indictment took place is the \"fact\" that makes a slander case against him, dead in the water. While you've raised this before, I know damn well that Murtha wasn't going to risk those statements if he didn't know an indictment was coming. A pro-forma denial by the military doesn't mean a damn thing -",
        "reply": " You are right ... I have raised it before ... and been right before. Predicting an \"indictment\" is one thing ... though speculative at best when the investigation hasn't been completed much less acted upon by the appointing authority ... but you claimed - quote: That he gave his \"opinion\" that the indictment was justified, is just that, opinion. That is flat wrong. You can't have an opinion on an indictment that doesn't exist. Edited to add - Besides, I am not aware of any statement by Murtha on the \"indictment\" (results of the ART 32 investigation). He simply ran his mouth about the Marines involved before the investigation really got off the ground. BTW, he won't comment on Haditha at all now ... allegedly because it is an active legal matter. Too bad he didn't bridle his tongue in the first place ... when it was a far more active legal matter.",
        "threadID": "672198221_9120007022001",
        "time": "2009-04-15 09:01:00",
        "title": "Marine Cannot Sue Rep. Murtha - Appeals Court Rules",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: The fact that an indictment took place is the \"fact\" that makes a slander case against him, dead in the water. While you've raised this before, I know damn well that Murtha wasn't going to risk those statements if he didn't know an indictment was coming. A pro-forma denial by the military doesn't mean a damn thing - You are right ... I have raised it before ... and been right before. Predicting an \"indictment\" is one thing ... though speculative at best when the investigation hasn't been completed much less acted upon by the appointing authority ... but you claimed - quote: That he gave his \"opinion\" that the indictment was justified, is just that, opinion. That is flat wrong. You can't have an opinion on an indictment that doesn't exist. Edited to add - Besides, I am not aware of any statement by Murtha on the \"indictment\" (results of the ART 32 investigation). He simply ran his mouth about the Marines involved before the investigation really got off the ground. BTW, he won't comment on Haditha at all now ... allegedly because it is an active legal matter. Too bad he didn't bridle his tongue in the first place ... when it was a far more active legal matter. I will correct my sentence: \"That he gave his \"opinion\" that the pending indictment was justified, is just that, opinion.\" Now you state quite emphatically that the investigation had not reached the indictment stage - And you \"prove it\" by pointing out that the investigation was not over. I disagree. I'm sure HE was told that the investigation was a done deal. Statements by the military (which they HAVE to make) does not change this. And in fact, there was a very strong indictment. BTW - This thread is NOT about Murtha, but rather whether there is a legal leg for a slander suit. I say there is NO legal leg for a slander suit. Have you commented about the thread yet? Dave",
        "intTime": 20090415,
        "postID": 11,
        "quote": "Originally posted by I_M_Qwerty: quote: The fact that an indictment took place is the \"fact\" that makes a slander case against him, dead in the water. While you've raised this before, I know damn well that Murtha wasn't going to risk those statements if he didn't know an indictment was coming. A pro-forma denial by the military doesn't mean a damn thing - You are right ... I have raised it before ... and been right before. Predicting an \"indictment\" is one thing ... though speculative at best when the investigation hasn't been completed much less acted upon by the appointing authority ... but you claimed - quote: That he gave his \"opinion\" that the indictment was justified, is just that, opinion. That is flat wrong. You can't have an opinion on an indictment that doesn't exist. Edited to add - Besides, I am not aware of any statement by Murtha on the \"indictment\" (results of the ART 32 investigation). He simply ran his mouth about the Marines involved before the investigation really got off the ground. BTW, he won't comment on Haditha at all now ... allegedly because it is an active legal matter. Too bad he didn't bridle his tongue in the first place ... when it was a far more active legal matter.",
        "reply": " I will correct my sentence: \"That he gave his \"opinion\" that the pending indictment was justified, is just that, opinion.\" Now you state quite emphatically that the investigation had not reached the indictment stage - And you \"prove it\" by pointing out that the investigation was not over. I disagree. I'm sure HE was told that the investigation was a done deal. Statements by the military (which they HAVE to make) does not change this. And in fact, there was a very strong indictment. BTW - This thread is NOT about Murtha, but rather whether there is a legal leg for a slander suit. I say there is NO legal leg for a slander suit. Have you commented about the thread yet? Dave",
        "threadID": "672198221_9120007022001",
        "time": "2009-04-15 09:47:00",
        "title": "Marine Cannot Sue Rep. Murtha - Appeals Court Rules",
        "userID": "Grachus"
    },
    {
        "content": "quote: Have you commented about the thread yet? Yep ... said I expected this ruling. Not much more to say. My dislike of Murtha doesn't trump the legitimacy of the ruling ... IMHO. I note you didn't comment on my observation that Murtha appears to have suddenly gotten religion ... and won't comment on that which he commented on so vociferously early on in the process. I don't understand how it could have been right then for him to shoot off his mouth ... but isn't right now ... without his having been wrong in the first place.",
        "intTime": 20090415,
        "postID": 12,
        "quote": "Have you commented about the thread yet?",
        "reply": " Yep ... said I expected this ruling. Not much more to say. My dislike of Murtha doesn't trump the legitimacy of the ruling ... IMHO. I note you didn't comment on my observation that Murtha appears to have suddenly gotten religion ... and won't comment on that which he commented on so vociferously early on in the process. I don't understand how it could have been right then for him to shoot off his mouth ... but isn't right now ... without his having been wrong in the first place.",
        "threadID": "672198221_9120007022001",
        "time": "2009-04-15 09:52:00",
        "title": "Marine Cannot Sue Rep. Murtha - Appeals Court Rules",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Have you commented about the thread yet? Yep ... said I expected this ruling. Not much more to say. My dislike of Murtha doesn't trump the legitimacy of the ruling ... IMHO. I note you didn't comment on my observation that Murtha appears to have suddenly gotten religion ... and won't comment on that which he commented on so vociferously early on in the process. I don't understand how it could have been right then for him to shoot off his mouth ... but isn't right now ... without his having been wrong in the first place. Well, I always said it was stupid for Murtha to shoot off his mouth. But there is a big difference between \"stupid\" and criminal. Dave",
        "intTime": 20090415,
        "postID": 13,
        "quote": "Originally posted by I_M_Qwerty: quote: Have you commented about the thread yet? Yep ... said I expected this ruling. Not much more to say. My dislike of Murtha doesn't trump the legitimacy of the ruling ... IMHO. I note you didn't comment on my observation that Murtha appears to have suddenly gotten religion ... and won't comment on that which he commented on so vociferously early on in the process. I don't understand how it could have been right then for him to shoot off his mouth ... but isn't right now ... without his having been wrong in the first place.",
        "reply": " Well, I always said it was stupid for Murtha to shoot off his mouth. But there is a big difference between \"stupid\" and criminal. Dave",
        "threadID": "672198221_9120007022001",
        "time": "2009-04-15 09:58:00",
        "title": "Marine Cannot Sue Rep. Murtha - Appeals Court Rules",
        "userID": "Grachus"
    },
    {
        "content": "Sticks and stones.........",
        "intTime": 20090415,
        "postID": 14,
        "quote": "",
        "reply": "Sticks and stones.........",
        "threadID": "672198221_9120007022001",
        "time": "2009-04-15 11:00:00",
        "title": "Marine Cannot Sue Rep. Murtha - Appeals Court Rules",
        "userID": "mrmixitup"
    },
    {
        "content": "And if it were You accused in the National Press before an article 32 concluded? I doubt you'd be so flippant",
        "intTime": 20090415,
        "postID": 15,
        "quote": "",
        "reply": "And if it were You accused in the National Press before an article 32 concluded? I doubt you'd be so flippant",
        "threadID": "672198221_9120007022001",
        "time": "2009-04-15 11:53:00",
        "title": "Marine Cannot Sue Rep. Murtha - Appeals Court Rules",
        "userID": "LineDoggie"
    }
]