[
    {
        "content": "here is copy and paste as part of house bill H.R.45 ------------------------- SEC. 2. FINDINGS AND PURPOSES. (a) Findings- Congress finds that-- (1) the manufacture, distribution, and importation of firearms is inherently commercial in nature; (2) firearms regularly move in interstate commerce; (3) to the extent that firearms trafficking is intrastate in nature, it arises out of and is substantially connected with a commercial transaction, which, when viewed in the aggregate, substantially affects interstate commerce; (4) because the intrastate and interstate trafficking of firearms are so commingled, full regulation of interstate commerce requires the incidental regulation of intrastate commerce; (5) gun violence in the United States is associated with the majority of homicides, over half the suicides, and two-thirds of non-fatal violent injuries; and (6) on the afternoon of May 10, 2007, Blair Holt, a junior at Julian High School in Chicago, was killed on a public bus riding home from school when he used his body to shield a girl who was in the line of fire after a young man boarded the bus and started shooting. (b) Sense of the Congress- It is the sense of the Congress that-- (1) firearms trafficking is prevalent and widespread in and among the States, and it is usually impossible to distinguish between intrastate trafficking and interstate trafficking; and (2) it is in the national interest and within the role of the Federal Government to ensure that the regulation of firearms is uniform among the States, that law enforcement can quickly and effectively trace firearms used in crime, and that firearms owners know how to use and safely store their firearms. (c) Purposes- The purposes of this Act and the amendments made by this Act are-- (1) to protect the public against the unreasonable risk of injury and death associated with the unrecorded sale or transfer of qualifying firearms to criminals and youth; (2) to ensure that owners of qualifying firearms are knowledgeable in the safe use, handling, and storage of those firearms; (3) to restrict the availability of qualifying firearms to criminals, youth, and other persons prohibited by Federal law from receiving firearms; and (4) to facilitate the tracing of qualifying firearms used in crime by Federal and State law enforcement agencies. SEC. 3. DEFINITIONS. (a) In General- In this Act: (1) FIREARM; LICENSED DEALER; LICENSED MANUFACTURER; STATE- The terms `firearm', `licensed dealer', `licensed manufacturer', and `State' have the meanings given those terms in section 921(a) of title 18, United States Code. (2) QUALIFYING FIREARM- The term `qualifying firearm' has the meaning given the term in section 921(a) of title 18, United States Code, as amended by subsection (b) of this section. (b) Amendment to Title 18, United States Code- Section 921(a) of title 18, United States Code, is amended by adding at the end the following: `(36) The term `qualifying firearm'-- `(A) means-- `(i) any handgun; or `(ii) any semiautomatic firearm that can accept any detachable ammunition feeding device; and `(B) does not include any antique.'. ------------------------ here is the link to the site I first saw and the second link is from the full text from library of congress. http://www.guncontrolkills.com/351/guncontrol/first-gun...al-gun-registration/ http://thomas.loc.gov/cgi-bin/query/z?c111:H.R.45: any thoughts?", 
        "intTime": 20090422, 
        "postID": 1, 
        "quote": "", 
        "reply": "here is copy and paste as part of house bill H.R.45 ------------------------- SEC. 2. FINDINGS AND PURPOSES. (a) Findings- Congress finds that-- (1) the manufacture, distribution, and importation of firearms is inherently commercial in nature; (2) firearms regularly move in interstate commerce; (3) to the extent that firearms trafficking is intrastate in nature, it arises out of and is substantially connected with a commercial transaction, which, when viewed in the aggregate, substantially affects interstate commerce; (4) because the intrastate and interstate trafficking of firearms are so commingled, full regulation of interstate commerce requires the incidental regulation of intrastate commerce; (5) gun violence in the United States is associated with the majority of homicides, over half the suicides, and two-thirds of non-fatal violent injuries; and (6) on the afternoon of May 10, 2007, Blair Holt, a junior at Julian High School in Chicago, was killed on a public bus riding home from school when he used his body to shield a girl who was in the line of fire after a young man boarded the bus and started shooting. (b) Sense of the Congress- It is the sense of the Congress that-- (1) firearms trafficking is prevalent and widespread in and among the States, and it is usually impossible to distinguish between intrastate trafficking and interstate trafficking; and (2) it is in the national interest and within the role of the Federal Government to ensure that the regulation of firearms is uniform among the States, that law enforcement can quickly and effectively trace firearms used in crime, and that firearms owners know how to use and safely store their firearms. (c) Purposes- The purposes of this Act and the amendments made by this Act are-- (1) to protect the public against the unreasonable risk of injury and death associated with the unrecorded sale or transfer of qualifying firearms to criminals and youth; (2) to ensure that owners of qualifying firearms are knowledgeable in the safe use, handling, and storage of those firearms; (3) to restrict the availability of qualifying firearms to criminals, youth, and other persons prohibited by Federal law from receiving firearms; and (4) to facilitate the tracing of qualifying firearms used in crime by Federal and State law enforcement agencies. SEC. 3. DEFINITIONS. (a) In General- In this Act: (1) FIREARM; LICENSED DEALER; LICENSED MANUFACTURER; STATE- The terms `firearm', `licensed dealer', `licensed manufacturer', and `State' have the meanings given those terms in section 921(a) of title 18, United States Code. (2) QUALIFYING FIREARM- The term `qualifying firearm' has the meaning given the term in section 921(a) of title 18, United States Code, as amended by subsection (b) of this section. (b) Amendment to Title 18, United States Code- Section 921(a) of title 18, United States Code, is amended by adding at the end the following: `(36) The term `qualifying firearm'-- `(A) means-- `(i) any handgun; or `(ii) any semiautomatic firearm that can accept any detachable ammunition feeding device; and `(B) does not include any antique.'. ------------------------ here is the link to the site I first saw and the second link is from the full text from library of congress. http://www.guncontrolkills.com/351/guncontrol/first-gun...al-gun-registration/ http://thomas.loc.gov/cgi-bin/query/z?c111:H.R.45: any thoughts?", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 10:10:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Donnie_January_Jr"
    }, 
    {
        "content": "Are you sure this is right? I can't believe that this administration and this congress would do something like this. I never heard Obama say anything like this on the campaign trail.....DARN IT!", 
        "intTime": 20090422, 
        "postID": 2, 
        "quote": "", 
        "reply": "Are you sure this is right? I can't believe that this administration and this congress would do something like this. I never heard Obama say anything like this on the campaign trail.....DARN IT!", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 10:16:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "comingofage"
    }, 
    {
        "content": "Yeah - why does the ability to trace ownership of a weapon a problem for you? Your loved one gets blown away, and the murder weapon is found - do you think it's a problem if the police want to be able to talk to the registered owner of the gun? Solving the crime would be much easier if law enforcement had this ability - or do you think it's an infringement on your \"rights\"?", 
        "intTime": 20090422, 
        "postID": 3, 
        "quote": "", 
        "reply": "Yeah - why does the ability to trace ownership of a weapon a problem for you? Your loved one gets blown away, and the murder weapon is found - do you think it's a problem if the police want to be able to talk to the registered owner of the gun? Solving the crime would be much easier if law enforcement had this ability - or do you think it's an infringement on your \"rights\"?", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 10:19:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "There are, the last time I checked, 435 members of Congress. Some of them believe this is a good law. This bill will NOT become law, will not even come up for a vote - It will be killed in the Judiciary Committee. It is in my opinion unConstitutional on it's face. But as I point out above, there are MANY members of Congress and they, like us, are free to have any damn opinion that they want to. There have been bills introduced to Congress that would effectively ban free speech. There have been bills introduced to Congress that would force the Country to Recognise Chrisitanity as the \"Official Religion of the United States.\" And? Dave", 
        "intTime": 20090422, 
        "postID": 4, 
        "quote": "", 
        "reply": "There are, the last time I checked, 435 members of Congress. Some of them believe this is a good law. This bill will NOT become law, will not even come up for a vote - It will be killed in the Judiciary Committee. It is in my opinion unConstitutional on it's face. But as I point out above, there are MANY members of Congress and they, like us, are free to have any damn opinion that they want to. There have been bills introduced to Congress that would effectively ban free speech. There have been bills introduced to Congress that would force the Country to Recognise Chrisitanity as the \"Official Religion of the United States.\" And? Dave", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 10:30:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Grachus"
    }, 
    {
        "content": "But, don't the states already have gun registration laws? Don't gun owners often point to education when we are looking for answers after some idiot goes on a shooting spree? Don't you all complain about criminals with weapons, often gotten illegally? Do you believe that anyone should be able to buy a gun without registering it? If so, why?", 
        "intTime": 20090422, 
        "postID": 5, 
        "quote": "", 
        "reply": "But, don't the states already have gun registration laws? Don't gun owners often point to education when we are looking for answers after some idiot goes on a shooting spree? Don't you all complain about criminals with weapons, often gotten illegally? Do you believe that anyone should be able to buy a gun without registering it? If so, why?", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 10:39:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: But, don't the states already have gun registration laws? Don't gun owners often point to education when we are looking for answers after some idiot goes on a shooting spree? Don't you all complain about criminals with weapons, often gotten illegally? Do you believe that anyone should be able to buy a gun without registering it? If so, why? The NRA is prepared to endorse background checks to prevent criminals or the insane to get fire arms. ALl they insist on, is that the actual records of purchase not be permenent. The purpose of the amendment is to guarranttee freedom FROM the government, not to expedite their \"potential\" ability to disarm us. Background checks, keeping looney bin types, and criminals from owning guns - fine - Registration? No! And like I say, THIS bill is going no where. Dave", 
        "intTime": 20090422, 
        "postID": 6, 
        "quote": "Originally posted by mcgreer: But, don't the states already have gun registration laws? Don't gun owners often point to education when we are looking for answers after some idiot goes on a shooting spree? Don't you all complain about criminals with weapons, often gotten illegally? Do you believe that anyone should be able to buy a gun without registering it? If so, why?", 
        "reply": " The NRA is prepared to endorse background checks to prevent criminals or the insane to get fire arms. ALl they insist on, is that the actual records of purchase not be permenent. The purpose of the amendment is to guarranttee freedom FROM the government, not to expedite their \"potential\" ability to disarm us. Background checks, keeping looney bin types, and criminals from owning guns - fine - Registration? No! And like I say, THIS bill is going no where. Dave", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 10:45:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Grachus"
    }, 
    {
        "content": "I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own.", 
        "intTime": 20090422, 
        "postID": 7, 
        "quote": "", 
        "reply": "I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own.", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 10:49:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Donnie_January_Jr"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by mcgreer: But, don't the states already have gun registration laws? Don't gun owners often point to education when we are looking for answers after some idiot goes on a shooting spree? Don't you all complain about criminals with weapons, often gotten illegally? Do you believe that anyone should be able to buy a gun without registering it? If so, why? The NRA is prepared to endorse background checks to prevent criminals or the insane to get fire arms. ALl they insist on, is that the actual records of purchase not be permenent. The purpose of the amendment is to guarranttee freedom FROM the government, not to expedite their \"potential\" ability to disarm us. Background checks, keeping looney bin types, and criminals from owning guns - fine - Registration? No! And like I say, THIS bill is going no where. Dave It probably won't - and that's largely because of the more paranoid gun owners out here and their enablers. Those guys are some of the biggest conspiracy theory propagators in this country.", 
        "intTime": 20090422, 
        "postID": 8, 
        "quote": "Originally posted by Grachus: quote: Originally posted by mcgreer: But, don't the states already have gun registration laws? Don't gun owners often point to education when we are looking for answers after some idiot goes on a shooting spree? Don't you all complain about criminals with weapons, often gotten illegally? Do you believe that anyone should be able to buy a gun without registering it? If so, why? The NRA is prepared to endorse background checks to prevent criminals or the insane to get fire arms. ALl they insist on, is that the actual records of purchase not be permenent. The purpose of the amendment is to guarranttee freedom FROM the government, not to expedite their \"potential\" ability to disarm us. Background checks, keeping looney bin types, and criminals from owning guns - fine - Registration? No! And like I say, THIS bill is going no where. Dave", 
        "reply": " It probably won't - and that's largely because of the more paranoid gun owners out here and their enablers. Those guys are some of the biggest conspiracy theory propagators in this country.", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 10:58:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Yeah - why does the ability to trace ownership of a weapon a problem for you? Your loved one gets blown away, and the murder weapon is found - do you think it's a problem if the police want to be able to talk to the registered owner of the gun? Solving the crime would be much easier if law enforcement had this ability - or do you think it's an infringement on your \"rights\"? That is in the movies. In reality the murder weapon is rarely found and if it is then yes it would be good to have it registered, but who is to say that it wasn't stolen and then used, there is no way to trace it then is there. If the only reason to register a firearm is to trace it, then that is stupid. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090422, 
        "postID": 9, 
        "quote": "Originally posted by mcgreer: Yeah - why does the ability to trace ownership of a weapon a problem for you? Your loved one gets blown away, and the murder weapon is found - do you think it's a problem if the police want to be able to talk to the registered owner of the gun? Solving the crime would be much easier if law enforcement had this ability - or do you think it's an infringement on your \"rights\"?", 
        "reply": " That is in the movies. In reality the murder weapon is rarely found and if it is then yes it would be good to have it registered, but who is to say that it wasn't stolen and then used, there is no way to trace it then is there. If the only reason to register a firearm is to trace it, then that is stupid. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 11:04:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave", 
        "intTime": 20090422, 
        "postID": 10, 
        "quote": "Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own.", 
        "reply": " I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 11:04:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. No, they are not trying to use interstate commerce as a means to regulate firearms. They're saying that,because of interstate commerce, the registration of firearms across the states is necessary - again, as a tool to aid law enforcement in case it's necessary to trace a gun that's used in a crime. A person can buy a gun in a show in, say, New Hampshire, use it to kill someone in Minnesota, and dump the weapon. How difficult is it for law enforcement to trace that weapon? Granted, someone can come into a stolen or otherwise illegally-obtained weapon. This bill will reduce the ability to have this weapon used and not be traced to someone. If you have weapons stolen, and they were registered, you'd be able to exonerate yourself (if you reported the theft) if it were used in a criminal act. Guns are way too lethal to not have them properly accounted for. It's why responsible gun owners take precautions to prevent their unathorized use. Why can't the Federal government?", 
        "intTime": 20090422, 
        "postID": 11, 
        "quote": "Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own.", 
        "reply": " No, they are not trying to use interstate commerce as a means to regulate firearms. They're saying that,because of interstate commerce, the registration of firearms across the states is necessary - again, as a tool to aid law enforcement in case it's necessary to trace a gun that's used in a crime. A person can buy a gun in a show in, say, New Hampshire, use it to kill someone in Minnesota, and dump the weapon. How difficult is it for law enforcement to trace that weapon? Granted, someone can come into a stolen or otherwise illegally-obtained weapon. This bill will reduce the ability to have this weapon used and not be traced to someone. If you have weapons stolen, and they were registered, you'd be able to exonerate yourself (if you reported the theft) if it were used in a criminal act. Guns are way too lethal to not have them properly accounted for. It's why responsible gun owners take precautions to prevent their unathorized use. Why can't the Federal government?", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 11:05:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave You need more people in government who respect the Constitution - your problems would likely be over.", 
        "intTime": 20090422, 
        "postID": 12, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave", 
        "reply": " You need more people in government who respect the Constitution - your problems would likely be over.", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 11:07:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave I agree with what you are saying, No I do not want them to know everything and especially the things you mention. What I am meaning is though I am against registering my guns it isn't because of some conspiracy theory or anything like that it is simply because I don't think it is any of their business. That being said the I have nothing to hide comment is more directed at I havn't violated any laws and if registration were absolutly required to own a firearm I would do it. Not that I would like it or that I think they should be registered. I am simply saying that I have nothing to hide (in that respect) as far as other things you are right it is none of their d a m n business. hmm I guess the easiest way to explain it is... uh forget I said \"I have nothing to hide\" lol I don't think they should require registering a gun but when you buy a new gun as it is it is registered in your name as the owner already. that should be enough. sound any better?", 
        "intTime": 20090422, 
        "postID": 13, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave", 
        "reply": " I agree with what you are saying, No I do not want them to know everything and especially the things you mention. What I am meaning is though I am against registering my guns it isn't because of some conspiracy theory or anything like that it is simply because I don't think it is any of their business. That being said the I have nothing to hide comment is more directed at I havn't violated any laws and if registration were absolutly required to own a firearm I would do it. Not that I would like it or that I think they should be registered. I am simply saying that I have nothing to hide (in that respect) as far as other things you are right it is none of their d a m n business. hmm I guess the easiest way to explain it is... uh forget I said \"I have nothing to hide\" lol I don't think they should require registering a gun but when you buy a new gun as it is it is registered in your name as the owner already. that should be enough. sound any better?", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 11:16:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Donnie_January_Jr"
    }, 
    {
        "content": "H.R.45 talks about (if I understood correctly) people under 18 not being able to have access to guns. Would this apply to if I wanted to take my kid hunting? Keep in mind I am not posting any of this to start arguments or conspiracy theories or anything like that. Just opening up for discussion. and that part was a little unclear to me.", 
        "intTime": 20090422, 
        "postID": 14, 
        "quote": "", 
        "reply": "H.R.45 talks about (if I understood correctly) people under 18 not being able to have access to guns. Would this apply to if I wanted to take my kid hunting? Keep in mind I am not posting any of this to start arguments or conspiracy theories or anything like that. Just opening up for discussion. and that part was a little unclear to me.", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 11:19:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Donnie_January_Jr"
    }, 
    {
        "content": "quote: Originally posted by Grachus: I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave quote: Originally posted by mcgreer: You need more people in government who respect the Constitution - your problems would likely be over. \"Government\" consists of millions of people. Sure, the more honest people we get the better. The more who respect the Constitution, the better. But our Constitution has a premise - Government cannot help but USE power, no matter who is in government. Government HAS to have some powers. The less the better - The less the better, BECAUSE government is composed of people not paper, and rules and regulations will never stop \"people\" from abusing opportunity. Dave", 
        "intTime": 20090422, 
        "postID": 15, 
        "quote": "Originally posted by Grachus: I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave", 
        "reply": " quote: Originally posted by mcgreer: You need more people in government who respect the Constitution - your problems would likely be over. \"Government\" consists of millions of people. Sure, the more honest people we get the better. The more who respect the Constitution, the better. But our Constitution has a premise - Government cannot help but USE power, no matter who is in government. Government HAS to have some powers. The less the better - The less the better, BECAUSE government is composed of people not paper, and rules and regulations will never stop \"people\" from abusing opportunity. Dave", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 11:49:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Donnie_January_Jr: quote: Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave I agree with what you are saying, No I do not want them to know everything and especially the things you mention. What I am meaning is though I am against registering my guns it isn't because of some conspiracy theory or anything like that it is simply because I don't think it is any of their business. That being said the I have nothing to hide comment is more directed at I havn't violated any laws and if registration were absolutly required to own a firearm I would do it. Not that I would like it or that I think they should be registered. I am simply saying that I have nothing to hide (in that respect) as far as other things you are right it is none of their d a m n business. hmm I guess the easiest way to explain it is... uh forget I said \"I have nothing to hide\" lol I don't think they should require registering a gun but when you buy a new gun as it is it is registered in your name as the owner already. that should be enough. sound any better? He, heh, he - The right to own a register gun is better than not having the right to OWN a gun at all - How can I argue that? But what's wrong with the NRA position? You have to submit to a background check. The background check is done - You pass, and therecord of the check is then deleted. So, the NRA is saying, (pardon the quotes) \"Society has a right to protect itself from allowing the criminal and the certifiably insane from acquiring lethal weapons. Other than that, Society has NO RIGHT to regulate rights. You might as well have your rights to speech, or privacy \"registered.\" Dave", 
        "intTime": 20090422, 
        "postID": 16, 
        "quote": "Originally posted by Donnie_January_Jr: quote: Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave I agree with what you are saying, No I do not want them to know everything and especially the things you mention. What I am meaning is though I am against registering my guns it isn't because of some conspiracy theory or anything like that it is simply because I don't think it is any of their business. That being said the I have nothing to hide comment is more directed at I havn't violated any laws and if registration were absolutly required to own a firearm I would do it. Not that I would like it or that I think they should be registered. I am simply saying that I have nothing to hide (in that respect) as far as other things you are right it is none of their d a m n business. hmm I guess the easiest way to explain it is... uh forget I said \"I have nothing to hide\" lol I don't think they should require registering a gun but when you buy a new gun as it is it is registered in your name as the owner already. that should be enough. sound any better?", 
        "reply": " He, heh, he - The right to own a register gun is better than not having the right to OWN a gun at all - How can I argue that? But what's wrong with the NRA position? You have to submit to a background check. The background check is done - You pass, and therecord of the check is then deleted. So, the NRA is saying, (pardon the quotes) \"Society has a right to protect itself from allowing the criminal and the certifiably insane from acquiring lethal weapons. Other than that, Society has NO RIGHT to regulate rights. You might as well have your rights to speech, or privacy \"registered.\" Dave", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 11:55:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: quote: Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave I agree with what you are saying, No I do not want them to know everything and especially the things you mention. What I am meaning is though I am against registering my guns it isn't because of some conspiracy theory or anything like that it is simply because I don't think it is any of their business. That being said the I have nothing to hide comment is more directed at I havn't violated any laws and if registration were absolutly required to own a firearm I would do it. Not that I would like it or that I think they should be registered. I am simply saying that I have nothing to hide (in that respect) as far as other things you are right it is none of their d a m n business. hmm I guess the easiest way to explain it is... uh forget I said \"I have nothing to hide\" lol I don't think they should require registering a gun but when you buy a new gun as it is it is registered in your name as the owner already. that should be enough. sound any better? He, heh, he - The right to own a register gun is better than not having the right to OWN a gun at all - How can I argue that? But what's wrong with the NRA position? You have to submit to a background check. The background check is done - You pass, and therecord of the check is then deleted. So, the NRA is saying, (pardon the quotes) \"Society has a right to protect itself from allowing the criminal and the certifiably insane from acquiring lethal weapons. Other than that, Society has NO RIGHT to regulate rights. You might as well have your rights to speech, or privacy \"registered.\" Dave Give em time now that you have given them the idia it will probly happen soon. just couldnt resist D.J. SR", 
        "intTime": 20090422, 
        "postID": 17, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: quote: Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave I agree with what you are saying, No I do not want them to know everything and especially the things you mention. What I am meaning is though I am against registering my guns it isn't because of some conspiracy theory or anything like that it is simply because I don't think it is any of their business. That being said the I have nothing to hide comment is more directed at I havn't violated any laws and if registration were absolutly required to own a firearm I would do it. Not that I would like it or that I think they should be registered. I am simply saying that I have nothing to hide (in that respect) as far as other things you are right it is none of their d a m n business. hmm I guess the easiest way to explain it is... uh forget I said \"I have nothing to hide\" lol I don't think they should require registering a gun but when you buy a new gun as it is it is registered in your name as the owner already. that should be enough. sound any better? He, heh, he - The right to own a register gun is better than not having the right to OWN a gun at all - How can I argue that? But what's wrong with the NRA position? You have to submit to a background check. The background check is done - You pass, and therecord of the check is then deleted. So, the NRA is saying, (pardon the quotes) \"Society has a right to protect itself from allowing the criminal and the certifiably insane from acquiring lethal weapons. Other than that, Society has NO RIGHT to regulate rights. You might as well have your rights to speech, or privacy \"registered.\" Dave", 
        "reply": " Give em time now that you have given them the idia it will probly happen soon. just couldnt resist D.J. SR", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 12:00:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "\"He, heh, he - The right to own a register gun is better than not having the right to OWN a gun at all - How can I argue that? But what's wrong with the NRA position? You have to submit to a background check. The background check is done - You pass, and therecord of the check is then deleted. So, the NRA is saying, (pardon the quotes) \"Society has a right to protect itself from allowing the criminal and the certifiably insane from acquiring lethal weapons. Other than that, Society has NO RIGHT to regulate rights. You might as well have your rights to speech, or privacy \"registered.\" Dave\" Agreed", 
        "intTime": 20090422, 
        "postID": 18, 
        "quote": "", 
        "reply": "\"He, heh, he - The right to own a register gun is better than not having the right to OWN a gun at all - How can I argue that? But what's wrong with the NRA position? You have to submit to a background check. The background check is done - You pass, and therecord of the check is then deleted. So, the NRA is saying, (pardon the quotes) \"Society has a right to protect itself from allowing the criminal and the certifiably insane from acquiring lethal weapons. Other than that, Society has NO RIGHT to regulate rights. You might as well have your rights to speech, or privacy \"registered.\" Dave\" Agreed", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 12:00:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Donnie_January_Jr"
    }, 
    {
        "content": "quote: Originally posted by Donnie_January_Jr: \"He, heh, he - The right to own a register gun is better than not having the right to OWN a gun at all - How can I argue that? But what's wrong with the NRA position? You have to submit to a background check. The background check is done - You pass, and therecord of the check is then deleted. So, the NRA is saying, (pardon the quotes) \"Society has a right to protect itself from allowing the criminal and the certifiably insane from acquiring lethal weapons. Other than that, Society has NO RIGHT to regulate rights. You might as well have your rights to speech, or privacy \"registered.\" Dave\" Agreed You know, ever since you guys called me out on \"sr\" and \"jr\" being two different people, I've been a good boy, and look to see who I'm replying to. Well at least on this issue, we are all on the same page... Dave", 
        "intTime": 20090422, 
        "postID": 19, 
        "quote": "Originally posted by Donnie_January_Jr: \"He, heh, he - The right to own a register gun is better than not having the right to OWN a gun at all - How can I argue that? But what's wrong with the NRA position? You have to submit to a background check. The background check is done - You pass, and therecord of the check is then deleted. So, the NRA is saying, (pardon the quotes) \"Society has a right to protect itself from allowing the criminal and the certifiably insane from acquiring lethal weapons. Other than that, Society has NO RIGHT to regulate rights. You might as well have your rights to speech, or privacy \"registered.\" Dave\" Agreed", 
        "reply": " You know, ever since you guys called me out on \"sr\" and \"jr\" being two different people, I've been a good boy, and look to see who I'm replying to. Well at least on this issue, we are all on the same page... Dave", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 12:06:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Grachus"
    }, 
    {
        "content": "lol,", 
        "intTime": 20090422, 
        "postID": 20, 
        "quote": "", 
        "reply": "lol,", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 12:08:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Donnie_January_Jr"
    }, 
    {
        "content": "here is copy and paste as part of house bill H.R.45 ------------------------- SEC. 2. FINDINGS AND PURPOSES. (a) Findings- Congress finds that-- (1) the manufacture, distribution, and importation of firearms is inherently commercial in nature; (2) firearms regularly move in interstate commerce; (3) to the extent that firearms trafficking is intrastate in nature, it arises out of and is substantially connected with a commercial transaction, which, when viewed in the aggregate, substantially affects interstate commerce; (4) because the intrastate and interstate trafficking of firearms are so commingled, full regulation of interstate commerce requires the incidental regulation of intrastate commerce; (5) gun violence in the United States is associated with the majority of homicides, over half the suicides, and two-thirds of non-fatal violent injuries; and (6) on the afternoon of May 10, 2007, Blair Holt, a junior at Julian High School in Chicago, was killed on a public bus riding home from school when he used his body to shield a girl who was in the line of fire after a young man boarded the bus and started shooting. (b) Sense of the Congress- It is the sense of the Congress that-- (1) firearms trafficking is prevalent and widespread in and among the States, and it is usually impossible to distinguish between intrastate trafficking and interstate trafficking; and (2) it is in the national interest and within the role of the Federal Government to ensure that the regulation of firearms is uniform among the States, that law enforcement can quickly and effectively trace firearms used in crime, and that firearms owners know how to use and safely store their firearms. (c) Purposes- The purposes of this Act and the amendments made by this Act are-- (1) to protect the public against the unreasonable risk of injury and death associated with the unrecorded sale or transfer of qualifying firearms to criminals and youth; (2) to ensure that owners of qualifying firearms are knowledgeable in the safe use, handling, and storage of those firearms; (3) to restrict the availability of qualifying firearms to criminals, youth, and other persons prohibited by Federal law from receiving firearms; and (4) to facilitate the tracing of qualifying firearms used in crime by Federal and State law enforcement agencies. SEC. 3. DEFINITIONS. (a) In General- In this Act: (1) FIREARM; LICENSED DEALER; LICENSED MANUFACTURER; STATE- The terms `firearm', `licensed dealer', `licensed manufacturer', and `State' have the meanings given those terms in section 921(a) of title 18, United States Code. (2) QUALIFYING FIREARM- The term `qualifying firearm' has the meaning given the term in section 921(a) of title 18, United States Code, as amended by subsection (b) of this section. (b) Amendment to Title 18, United States Code- Section 921(a) of title 18, United States Code, is amended by adding at the end the following: `(36) The term `qualifying firearm'-- `(A) means-- `(i) any handgun; or `(ii) any semiautomatic firearm that can accept any detachable ammunition feeding device; and `(B) does not include any antique.'. ------------------------ here is the link to the site I first saw and the second link is from the full text from library of congress. http://www.guncontrolkills.com/351/guncontrol/first-gun...al-gun-registration/ http://thomas.loc.gov/cgi-bin/query/z?c111:H.R.45: any thoughts?", 
        "intTime": 20090422, 
        "postID": 21, 
        "quote": "", 
        "reply": "here is copy and paste as part of house bill H.R.45 ------------------------- SEC. 2. FINDINGS AND PURPOSES. (a) Findings- Congress finds that-- (1) the manufacture, distribution, and importation of firearms is inherently commercial in nature; (2) firearms regularly move in interstate commerce; (3) to the extent that firearms trafficking is intrastate in nature, it arises out of and is substantially connected with a commercial transaction, which, when viewed in the aggregate, substantially affects interstate commerce; (4) because the intrastate and interstate trafficking of firearms are so commingled, full regulation of interstate commerce requires the incidental regulation of intrastate commerce; (5) gun violence in the United States is associated with the majority of homicides, over half the suicides, and two-thirds of non-fatal violent injuries; and (6) on the afternoon of May 10, 2007, Blair Holt, a junior at Julian High School in Chicago, was killed on a public bus riding home from school when he used his body to shield a girl who was in the line of fire after a young man boarded the bus and started shooting. (b) Sense of the Congress- It is the sense of the Congress that-- (1) firearms trafficking is prevalent and widespread in and among the States, and it is usually impossible to distinguish between intrastate trafficking and interstate trafficking; and (2) it is in the national interest and within the role of the Federal Government to ensure that the regulation of firearms is uniform among the States, that law enforcement can quickly and effectively trace firearms used in crime, and that firearms owners know how to use and safely store their firearms. (c) Purposes- The purposes of this Act and the amendments made by this Act are-- (1) to protect the public against the unreasonable risk of injury and death associated with the unrecorded sale or transfer of qualifying firearms to criminals and youth; (2) to ensure that owners of qualifying firearms are knowledgeable in the safe use, handling, and storage of those firearms; (3) to restrict the availability of qualifying firearms to criminals, youth, and other persons prohibited by Federal law from receiving firearms; and (4) to facilitate the tracing of qualifying firearms used in crime by Federal and State law enforcement agencies. SEC. 3. DEFINITIONS. (a) In General- In this Act: (1) FIREARM; LICENSED DEALER; LICENSED MANUFACTURER; STATE- The terms `firearm', `licensed dealer', `licensed manufacturer', and `State' have the meanings given those terms in section 921(a) of title 18, United States Code. (2) QUALIFYING FIREARM- The term `qualifying firearm' has the meaning given the term in section 921(a) of title 18, United States Code, as amended by subsection (b) of this section. (b) Amendment to Title 18, United States Code- Section 921(a) of title 18, United States Code, is amended by adding at the end the following: `(36) The term `qualifying firearm'-- `(A) means-- `(i) any handgun; or `(ii) any semiautomatic firearm that can accept any detachable ammunition feeding device; and `(B) does not include any antique.'. ------------------------ here is the link to the site I first saw and the second link is from the full text from library of congress. http://www.guncontrolkills.com/351/guncontrol/first-gun...al-gun-registration/ http://thomas.loc.gov/cgi-bin/query/z?c111:H.R.45: any thoughts?", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 10:10:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Donnie_January_Jr"
    }, 
    {
        "content": "Are you sure this is right? I can't believe that this administration and this congress would do something like this. I never heard Obama say anything like this on the campaign trail.....DARN IT!", 
        "intTime": 20090422, 
        "postID": 22, 
        "quote": "", 
        "reply": "Are you sure this is right? I can't believe that this administration and this congress would do something like this. I never heard Obama say anything like this on the campaign trail.....DARN IT!", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 10:16:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "comingofage"
    }, 
    {
        "content": "Yeah - why does the ability to trace ownership of a weapon a problem for you? Your loved one gets blown away, and the murder weapon is found - do you think it's a problem if the police want to be able to talk to the registered owner of the gun? Solving the crime would be much easier if law enforcement had this ability - or do you think it's an infringement on your \"rights\"?", 
        "intTime": 20090422, 
        "postID": 23, 
        "quote": "", 
        "reply": "Yeah - why does the ability to trace ownership of a weapon a problem for you? Your loved one gets blown away, and the murder weapon is found - do you think it's a problem if the police want to be able to talk to the registered owner of the gun? Solving the crime would be much easier if law enforcement had this ability - or do you think it's an infringement on your \"rights\"?", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 10:19:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "There are, the last time I checked, 435 members of Congress. Some of them believe this is a good law. This bill will NOT become law, will not even come up for a vote - It will be killed in the Judiciary Committee. It is in my opinion unConstitutional on it's face. But as I point out above, there are MANY members of Congress and they, like us, are free to have any damn opinion that they want to. There have been bills introduced to Congress that would effectively ban free speech. There have been bills introduced to Congress that would force the Country to Recognise Chrisitanity as the \"Official Religion of the United States.\" And? Dave", 
        "intTime": 20090422, 
        "postID": 24, 
        "quote": "", 
        "reply": "There are, the last time I checked, 435 members of Congress. Some of them believe this is a good law. This bill will NOT become law, will not even come up for a vote - It will be killed in the Judiciary Committee. It is in my opinion unConstitutional on it's face. But as I point out above, there are MANY members of Congress and they, like us, are free to have any damn opinion that they want to. There have been bills introduced to Congress that would effectively ban free speech. There have been bills introduced to Congress that would force the Country to Recognise Chrisitanity as the \"Official Religion of the United States.\" And? Dave", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 10:30:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Grachus"
    }, 
    {
        "content": "But, don't the states already have gun registration laws? Don't gun owners often point to education when we are looking for answers after some idiot goes on a shooting spree? Don't you all complain about criminals with weapons, often gotten illegally? Do you believe that anyone should be able to buy a gun without registering it? If so, why?", 
        "intTime": 20090422, 
        "postID": 25, 
        "quote": "", 
        "reply": "But, don't the states already have gun registration laws? Don't gun owners often point to education when we are looking for answers after some idiot goes on a shooting spree? Don't you all complain about criminals with weapons, often gotten illegally? Do you believe that anyone should be able to buy a gun without registering it? If so, why?", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 10:39:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: But, don't the states already have gun registration laws? Don't gun owners often point to education when we are looking for answers after some idiot goes on a shooting spree? Don't you all complain about criminals with weapons, often gotten illegally? Do you believe that anyone should be able to buy a gun without registering it? If so, why? The NRA is prepared to endorse background checks to prevent criminals or the insane to get fire arms. ALl they insist on, is that the actual records of purchase not be permenent. The purpose of the amendment is to guarranttee freedom FROM the government, not to expedite their \"potential\" ability to disarm us. Background checks, keeping looney bin types, and criminals from owning guns - fine - Registration? No! And like I say, THIS bill is going no where. Dave", 
        "intTime": 20090422, 
        "postID": 26, 
        "quote": "Originally posted by mcgreer: But, don't the states already have gun registration laws? Don't gun owners often point to education when we are looking for answers after some idiot goes on a shooting spree? Don't you all complain about criminals with weapons, often gotten illegally? Do you believe that anyone should be able to buy a gun without registering it? If so, why?", 
        "reply": " The NRA is prepared to endorse background checks to prevent criminals or the insane to get fire arms. ALl they insist on, is that the actual records of purchase not be permenent. The purpose of the amendment is to guarranttee freedom FROM the government, not to expedite their \"potential\" ability to disarm us. Background checks, keeping looney bin types, and criminals from owning guns - fine - Registration? No! And like I say, THIS bill is going no where. Dave", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 10:45:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Grachus"
    }, 
    {
        "content": "I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own.", 
        "intTime": 20090422, 
        "postID": 27, 
        "quote": "", 
        "reply": "I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own.", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 10:49:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Donnie_January_Jr"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by mcgreer: But, don't the states already have gun registration laws? Don't gun owners often point to education when we are looking for answers after some idiot goes on a shooting spree? Don't you all complain about criminals with weapons, often gotten illegally? Do you believe that anyone should be able to buy a gun without registering it? If so, why? The NRA is prepared to endorse background checks to prevent criminals or the insane to get fire arms. ALl they insist on, is that the actual records of purchase not be permenent. The purpose of the amendment is to guarranttee freedom FROM the government, not to expedite their \"potential\" ability to disarm us. Background checks, keeping looney bin types, and criminals from owning guns - fine - Registration? No! And like I say, THIS bill is going no where. Dave It probably won't - and that's largely because of the more paranoid gun owners out here and their enablers. Those guys are some of the biggest conspiracy theory propagators in this country.", 
        "intTime": 20090422, 
        "postID": 28, 
        "quote": "Originally posted by Grachus: quote: Originally posted by mcgreer: But, don't the states already have gun registration laws? Don't gun owners often point to education when we are looking for answers after some idiot goes on a shooting spree? Don't you all complain about criminals with weapons, often gotten illegally? Do you believe that anyone should be able to buy a gun without registering it? If so, why? The NRA is prepared to endorse background checks to prevent criminals or the insane to get fire arms. ALl they insist on, is that the actual records of purchase not be permenent. The purpose of the amendment is to guarranttee freedom FROM the government, not to expedite their \"potential\" ability to disarm us. Background checks, keeping looney bin types, and criminals from owning guns - fine - Registration? No! And like I say, THIS bill is going no where. Dave", 
        "reply": " It probably won't - and that's largely because of the more paranoid gun owners out here and their enablers. Those guys are some of the biggest conspiracy theory propagators in this country.", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 10:58:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by mcgreer: Yeah - why does the ability to trace ownership of a weapon a problem for you? Your loved one gets blown away, and the murder weapon is found - do you think it's a problem if the police want to be able to talk to the registered owner of the gun? Solving the crime would be much easier if law enforcement had this ability - or do you think it's an infringement on your \"rights\"? That is in the movies. In reality the murder weapon is rarely found and if it is then yes it would be good to have it registered, but who is to say that it wasn't stolen and then used, there is no way to trace it then is there. If the only reason to register a firearm is to trace it, then that is stupid. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090422, 
        "postID": 29, 
        "quote": "Originally posted by mcgreer: Yeah - why does the ability to trace ownership of a weapon a problem for you? Your loved one gets blown away, and the murder weapon is found - do you think it's a problem if the police want to be able to talk to the registered owner of the gun? Solving the crime would be much easier if law enforcement had this ability - or do you think it's an infringement on your \"rights\"?", 
        "reply": " That is in the movies. In reality the murder weapon is rarely found and if it is then yes it would be good to have it registered, but who is to say that it wasn't stolen and then used, there is no way to trace it then is there. If the only reason to register a firearm is to trace it, then that is stupid. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 11:04:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave", 
        "intTime": 20090422, 
        "postID": 30, 
        "quote": "Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own.", 
        "reply": " I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 11:04:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. No, they are not trying to use interstate commerce as a means to regulate firearms. They're saying that,because of interstate commerce, the registration of firearms across the states is necessary - again, as a tool to aid law enforcement in case it's necessary to trace a gun that's used in a crime. A person can buy a gun in a show in, say, New Hampshire, use it to kill someone in Minnesota, and dump the weapon. How difficult is it for law enforcement to trace that weapon? Granted, someone can come into a stolen or otherwise illegally-obtained weapon. This bill will reduce the ability to have this weapon used and not be traced to someone. If you have weapons stolen, and they were registered, you'd be able to exonerate yourself (if you reported the theft) if it were used in a criminal act. Guns are way too lethal to not have them properly accounted for. It's why responsible gun owners take precautions to prevent their unathorized use. Why can't the Federal government?", 
        "intTime": 20090422, 
        "postID": 31, 
        "quote": "Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own.", 
        "reply": " No, they are not trying to use interstate commerce as a means to regulate firearms. They're saying that,because of interstate commerce, the registration of firearms across the states is necessary - again, as a tool to aid law enforcement in case it's necessary to trace a gun that's used in a crime. A person can buy a gun in a show in, say, New Hampshire, use it to kill someone in Minnesota, and dump the weapon. How difficult is it for law enforcement to trace that weapon? Granted, someone can come into a stolen or otherwise illegally-obtained weapon. This bill will reduce the ability to have this weapon used and not be traced to someone. If you have weapons stolen, and they were registered, you'd be able to exonerate yourself (if you reported the theft) if it were used in a criminal act. Guns are way too lethal to not have them properly accounted for. It's why responsible gun owners take precautions to prevent their unathorized use. Why can't the Federal government?", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 11:05:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave You need more people in government who respect the Constitution - your problems would likely be over.", 
        "intTime": 20090422, 
        "postID": 32, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave", 
        "reply": " You need more people in government who respect the Constitution - your problems would likely be over.", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 11:07:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave I agree with what you are saying, No I do not want them to know everything and especially the things you mention. What I am meaning is though I am against registering my guns it isn't because of some conspiracy theory or anything like that it is simply because I don't think it is any of their business. That being said the I have nothing to hide comment is more directed at I havn't violated any laws and if registration were absolutly required to own a firearm I would do it. Not that I would like it or that I think they should be registered. I am simply saying that I have nothing to hide (in that respect) as far as other things you are right it is none of their d a m n business. hmm I guess the easiest way to explain it is... uh forget I said \"I have nothing to hide\" lol I don't think they should require registering a gun but when you buy a new gun as it is it is registered in your name as the owner already. that should be enough. sound any better?", 
        "intTime": 20090422, 
        "postID": 33, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave", 
        "reply": " I agree with what you are saying, No I do not want them to know everything and especially the things you mention. What I am meaning is though I am against registering my guns it isn't because of some conspiracy theory or anything like that it is simply because I don't think it is any of their business. That being said the I have nothing to hide comment is more directed at I havn't violated any laws and if registration were absolutly required to own a firearm I would do it. Not that I would like it or that I think they should be registered. I am simply saying that I have nothing to hide (in that respect) as far as other things you are right it is none of their d a m n business. hmm I guess the easiest way to explain it is... uh forget I said \"I have nothing to hide\" lol I don't think they should require registering a gun but when you buy a new gun as it is it is registered in your name as the owner already. that should be enough. sound any better?", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 11:16:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Donnie_January_Jr"
    }, 
    {
        "content": "H.R.45 talks about (if I understood correctly) people under 18 not being able to have access to guns. Would this apply to if I wanted to take my kid hunting? Keep in mind I am not posting any of this to start arguments or conspiracy theories or anything like that. Just opening up for discussion. and that part was a little unclear to me.", 
        "intTime": 20090422, 
        "postID": 34, 
        "quote": "", 
        "reply": "H.R.45 talks about (if I understood correctly) people under 18 not being able to have access to guns. Would this apply to if I wanted to take my kid hunting? Keep in mind I am not posting any of this to start arguments or conspiracy theories or anything like that. Just opening up for discussion. and that part was a little unclear to me.", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 11:19:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Donnie_January_Jr"
    }, 
    {
        "content": "quote: Originally posted by Grachus: I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave quote: Originally posted by mcgreer: You need more people in government who respect the Constitution - your problems would likely be over. \"Government\" consists of millions of people. Sure, the more honest people we get the better. The more who respect the Constitution, the better. But our Constitution has a premise - Government cannot help but USE power, no matter who is in government. Government HAS to have some powers. The less the better - The less the better, BECAUSE government is composed of people not paper, and rules and regulations will never stop \"people\" from abusing opportunity. Dave", 
        "intTime": 20090422, 
        "postID": 35, 
        "quote": "Originally posted by Grachus: I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave", 
        "reply": " quote: Originally posted by mcgreer: You need more people in government who respect the Constitution - your problems would likely be over. \"Government\" consists of millions of people. Sure, the more honest people we get the better. The more who respect the Constitution, the better. But our Constitution has a premise - Government cannot help but USE power, no matter who is in government. Government HAS to have some powers. The less the better - The less the better, BECAUSE government is composed of people not paper, and rules and regulations will never stop \"people\" from abusing opportunity. Dave", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 11:49:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Donnie_January_Jr: quote: Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave I agree with what you are saying, No I do not want them to know everything and especially the things you mention. What I am meaning is though I am against registering my guns it isn't because of some conspiracy theory or anything like that it is simply because I don't think it is any of their business. That being said the I have nothing to hide comment is more directed at I havn't violated any laws and if registration were absolutly required to own a firearm I would do it. Not that I would like it or that I think they should be registered. I am simply saying that I have nothing to hide (in that respect) as far as other things you are right it is none of their d a m n business. hmm I guess the easiest way to explain it is... uh forget I said \"I have nothing to hide\" lol I don't think they should require registering a gun but when you buy a new gun as it is it is registered in your name as the owner already. that should be enough. sound any better? He, heh, he - The right to own a register gun is better than not having the right to OWN a gun at all - How can I argue that? But what's wrong with the NRA position? You have to submit to a background check. The background check is done - You pass, and therecord of the check is then deleted. So, the NRA is saying, (pardon the quotes) \"Society has a right to protect itself from allowing the criminal and the certifiably insane from acquiring lethal weapons. Other than that, Society has NO RIGHT to regulate rights. You might as well have your rights to speech, or privacy \"registered.\" Dave", 
        "intTime": 20090422, 
        "postID": 36, 
        "quote": "Originally posted by Donnie_January_Jr: quote: Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave I agree with what you are saying, No I do not want them to know everything and especially the things you mention. What I am meaning is though I am against registering my guns it isn't because of some conspiracy theory or anything like that it is simply because I don't think it is any of their business. That being said the I have nothing to hide comment is more directed at I havn't violated any laws and if registration were absolutly required to own a firearm I would do it. Not that I would like it or that I think they should be registered. I am simply saying that I have nothing to hide (in that respect) as far as other things you are right it is none of their d a m n business. hmm I guess the easiest way to explain it is... uh forget I said \"I have nothing to hide\" lol I don't think they should require registering a gun but when you buy a new gun as it is it is registered in your name as the owner already. that should be enough. sound any better?", 
        "reply": " He, heh, he - The right to own a register gun is better than not having the right to OWN a gun at all - How can I argue that? But what's wrong with the NRA position? You have to submit to a background check. The background check is done - You pass, and therecord of the check is then deleted. So, the NRA is saying, (pardon the quotes) \"Society has a right to protect itself from allowing the criminal and the certifiably insane from acquiring lethal weapons. Other than that, Society has NO RIGHT to regulate rights. You might as well have your rights to speech, or privacy \"registered.\" Dave", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 11:55:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: quote: Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave I agree with what you are saying, No I do not want them to know everything and especially the things you mention. What I am meaning is though I am against registering my guns it isn't because of some conspiracy theory or anything like that it is simply because I don't think it is any of their business. That being said the I have nothing to hide comment is more directed at I havn't violated any laws and if registration were absolutly required to own a firearm I would do it. Not that I would like it or that I think they should be registered. I am simply saying that I have nothing to hide (in that respect) as far as other things you are right it is none of their d a m n business. hmm I guess the easiest way to explain it is... uh forget I said \"I have nothing to hide\" lol I don't think they should require registering a gun but when you buy a new gun as it is it is registered in your name as the owner already. that should be enough. sound any better? He, heh, he - The right to own a register gun is better than not having the right to OWN a gun at all - How can I argue that? But what's wrong with the NRA position? You have to submit to a background check. The background check is done - You pass, and therecord of the check is then deleted. So, the NRA is saying, (pardon the quotes) \"Society has a right to protect itself from allowing the criminal and the certifiably insane from acquiring lethal weapons. Other than that, Society has NO RIGHT to regulate rights. You might as well have your rights to speech, or privacy \"registered.\" Dave Give em time now that you have given them the idia it will probly happen soon. just couldnt resist D.J. SR", 
        "intTime": 20090422, 
        "postID": 37, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: quote: Originally posted by Grachus: quote: Originally posted by Donnie_January_Jr: I am not saying anything. I just find it interesting that according to this. (and I suggest following the link to read the bill it'self and not just going of this section) that they are trying to use interstate commerce as a way to regulate the firearms. Lets face it reguardless of the law criminals will get guns, will use guns and I'm betting won't register them to themselves if at all. I am all for people being trained in gun safty. I own many guns myself and feel that gun safty is of utmost importance especially sinc eI have kids. I just don't see how requiring registration or implementing bans or anything else will keep them out of the hands of the criminals useing them. It just makes it more of a pain in the @$$ for the rest of us. however, since I have nothing to hide I am not afraid to have my firearms registered. The only gun laws I am really against are any that would limit what guns I am allowed to have because I don't think that the gov should be able to tell me what I can and cannot own. I begrudge every dot on a sentence that the government knows about me. What do you mean, \"I have nothing to hide?\" Do you want government to monitor your political opinions? Your banking records? Your sex life? Government consists of people. Once data is collected, then it's up to luck whether some government bureaucrat decides to do something with it. In this sense, there is No Such Thing as Government. It's up to luck whether some clown forgets his computer in a cab. And at the same time private companies have huge data bases, which they peddle to the highest bidder, and BUY at top dollar. You have nothing to hide? I have PLENTY to hide. My life! My life is no ones buisness but my own. We need MORE laws to protect our privacy, from government, from corporations from any damn fool who gets their rocks off. If you are suspected of a crime, our Constitution allows law enforcement to get a warrant and investigate you. That's about the only TIME government has business in someones personal life. Dave I agree with what you are saying, No I do not want them to know everything and especially the things you mention. What I am meaning is though I am against registering my guns it isn't because of some conspiracy theory or anything like that it is simply because I don't think it is any of their business. That being said the I have nothing to hide comment is more directed at I havn't violated any laws and if registration were absolutly required to own a firearm I would do it. Not that I would like it or that I think they should be registered. I am simply saying that I have nothing to hide (in that respect) as far as other things you are right it is none of their d a m n business. hmm I guess the easiest way to explain it is... uh forget I said \"I have nothing to hide\" lol I don't think they should require registering a gun but when you buy a new gun as it is it is registered in your name as the owner already. that should be enough. sound any better? He, heh, he - The right to own a register gun is better than not having the right to OWN a gun at all - How can I argue that? But what's wrong with the NRA position? You have to submit to a background check. The background check is done - You pass, and therecord of the check is then deleted. So, the NRA is saying, (pardon the quotes) \"Society has a right to protect itself from allowing the criminal and the certifiably insane from acquiring lethal weapons. Other than that, Society has NO RIGHT to regulate rights. You might as well have your rights to speech, or privacy \"registered.\" Dave", 
        "reply": " Give em time now that you have given them the idia it will probly happen soon. just couldnt resist D.J. SR", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 12:00:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "\"He, heh, he - The right to own a register gun is better than not having the right to OWN a gun at all - How can I argue that? But what's wrong with the NRA position? You have to submit to a background check. The background check is done - You pass, and therecord of the check is then deleted. So, the NRA is saying, (pardon the quotes) \"Society has a right to protect itself from allowing the criminal and the certifiably insane from acquiring lethal weapons. Other than that, Society has NO RIGHT to regulate rights. You might as well have your rights to speech, or privacy \"registered.\" Dave\" Agreed", 
        "intTime": 20090422, 
        "postID": 38, 
        "quote": "", 
        "reply": "\"He, heh, he - The right to own a register gun is better than not having the right to OWN a gun at all - How can I argue that? But what's wrong with the NRA position? You have to submit to a background check. The background check is done - You pass, and therecord of the check is then deleted. So, the NRA is saying, (pardon the quotes) \"Society has a right to protect itself from allowing the criminal and the certifiably insane from acquiring lethal weapons. Other than that, Society has NO RIGHT to regulate rights. You might as well have your rights to speech, or privacy \"registered.\" Dave\" Agreed", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 12:00:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Donnie_January_Jr"
    }, 
    {
        "content": "quote: Originally posted by Donnie_January_Jr: \"He, heh, he - The right to own a register gun is better than not having the right to OWN a gun at all - How can I argue that? But what's wrong with the NRA position? You have to submit to a background check. The background check is done - You pass, and therecord of the check is then deleted. So, the NRA is saying, (pardon the quotes) \"Society has a right to protect itself from allowing the criminal and the certifiably insane from acquiring lethal weapons. Other than that, Society has NO RIGHT to regulate rights. You might as well have your rights to speech, or privacy \"registered.\" Dave\" Agreed You know, ever since you guys called me out on \"sr\" and \"jr\" being two different people, I've been a good boy, and look to see who I'm replying to. Well at least on this issue, we are all on the same page... Dave", 
        "intTime": 20090422, 
        "postID": 39, 
        "quote": "Originally posted by Donnie_January_Jr: \"He, heh, he - The right to own a register gun is better than not having the right to OWN a gun at all - How can I argue that? But what's wrong with the NRA position? You have to submit to a background check. The background check is done - You pass, and therecord of the check is then deleted. So, the NRA is saying, (pardon the quotes) \"Society has a right to protect itself from allowing the criminal and the certifiably insane from acquiring lethal weapons. Other than that, Society has NO RIGHT to regulate rights. You might as well have your rights to speech, or privacy \"registered.\" Dave\" Agreed", 
        "reply": " You know, ever since you guys called me out on \"sr\" and \"jr\" being two different people, I've been a good boy, and look to see who I'm replying to. Well at least on this issue, we are all on the same page... Dave", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 12:06:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Grachus"
    }, 
    {
        "content": "lol,", 
        "intTime": 20090422, 
        "postID": 40, 
        "quote": "", 
        "reply": "lol,", 
        "threadID": "672198221_2100064122001", 
        "time": "2009-04-22 12:08:00", 
        "title": "Another Gun Control Bill if you havn't seen it yet.", 
        "userID": "Donnie_January_Jr"
    }
]