[
    {
        "content": "++http://www.vancouversun.com/Girl+believes+that+black+people+should+court+hears/1630973/story.html quote: Just seven years old, she showed up at school with neo-Nazi propaganda written all over her body, calmly described how to kill black people, and spoke proudly about white people being superior to all other races. Now the girl's disturbing views are at the centre of a heated child-custody case that began Monday. \"Black people don't belong. What people don't understand is that black people should die,\" the little girl stated calmly in the 2008 interview with a Manitoba Child and Family Services worker after she and her brother had been seized by the province... So how does this kind of disturbing mentality continue to fester?", 
        "intTime": 20090526, 
        "postID": 1, 
        "quote": "Just seven years old, she showed up at school with neo-Nazi propaganda written all over her body, calmly described how to kill black people, and spoke proudly about white people being superior to all other races. Now the girl's disturbing views are at the centre of a heated child-custody case that began Monday. \"Black people don't belong. What people don't understand is that black people should die,\" the little girl stated calmly in the 2008 interview with a Manitoba Child and Family Services worker after she and her brother had been seized by the province...", 
        "reply": "++http://www.vancouversun.com/Girl+believes+that+black+people+should+court+hears/1630973/story.html  So how does this kind of disturbing mentality continue to fester?", 
        "threadID": "672198221_3030043422001", 
        "time": "2009-05-26 14:52:00", 
        "title": "Girl,7, from Winnipeg, Canada, proudly tells social worker \"black people should die\"", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: ++http://www.vancouversun.com/Girl+believes+that+black+people+should+court+hears/1630973/story.html quote: Just seven years old, she showed up at school with neo-Nazi propaganda written all over her body, calmly described how to kill black people, and spoke proudly about white people being superior to all other races. Now the girl's disturbing views are at the centre of a heated child-custody case that began Monday. \"Black people don't belong. What people don't understand is that black people should die,\" the little girl stated calmly in the 2008 interview with a Manitoba Child and Family Services worker after she and her brother had been seized by the province... So how does this kind of disturbing mentality continue to fester? It is because we continue to look the other way.", 
        "intTime": 20090526, 
        "postID": 2, 
        "quote": "Originally posted by Canuck_Centaur: ++http://www.vancouversun.com/Girl+believes+that+black+people+should+court+hears/1630973/story.html quote: Just seven years old, she showed up at school with neo-Nazi propaganda written all over her body, calmly described how to kill black people, and spoke proudly about white people being superior to all other races. Now the girl's disturbing views are at the centre of a heated child-custody case that began Monday. \"Black people don't belong. What people don't understand is that black people should die,\" the little girl stated calmly in the 2008 interview with a Manitoba Child and Family Services worker after she and her brother had been seized by the province... So how does this kind of disturbing mentality continue to fester?", 
        "reply": " It is because we continue to look the other way.", 
        "threadID": "672198221_3030043422001", 
        "time": "2009-05-26 14:57:00", 
        "title": "Girl,7, from Winnipeg, Canada, proudly tells social worker \"black people should die\"", 
        "userID": "stormtiger39"
    }, 
    {
        "content": "This is an unfortunae situation, and it makes you wonder just how much indoctrination this little girl was subjected too...or witnessed. How does this still happen? Its life, thats why peple still murder, rape, and rob....it sucks but its a part of our fabric..", 
        "intTime": 20090526, 
        "postID": 3, 
        "quote": "", 
        "reply": "This is an unfortunae situation, and it makes you wonder just how much indoctrination this little girl was subjected too...or witnessed. How does this still happen? Its life, thats why peple still murder, rape, and rob....it sucks but its a part of our fabric..", 
        "threadID": "672198221_3030043422001", 
        "time": "2009-05-26 14:57:00", 
        "title": "Girl,7, from Winnipeg, Canada, proudly tells social worker \"black people should die\"", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Soooo, the USA isn't the only nation with Racist in it? Good fact to know. As far as the child, can't punish her, need to whack the parents though. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 4, 
        "quote": "", 
        "reply": "Soooo, the USA isn't the only nation with Racist in it? Good fact to know. As far as the child, can't punish her, need to whack the parents though. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3030043422001", 
        "time": "2009-05-26 15:03:00", 
        "title": "Girl,7, from Winnipeg, Canada, proudly tells social worker \"black people should die\"", 
        "userID": "L0A1"
    }, 
    {
        "content": "Part of our fabric? lol Unless people decide to take the final dirt nap, this is going to continue. Not only is it going to continue here but in every other nation as well. Utopia is a dream and thus that's where you will find it; in your dreams. While it is sad that little one is being taught, so were the German children, the Jim Jones children, Branch Divinity children, and Jhihad children.... the list goes on. In America, if it is reported, the child will be removed from the home. However, that's often not a better situation and that form of abuse is also turned away from. Bottom line; help those you can and pray for those you can't.", 
        "intTime": 20090526, 
        "postID": 5, 
        "quote": "", 
        "reply": "Part of our fabric? lol Unless people decide to take the final dirt nap, this is going to continue. Not only is it going to continue here but in every other nation as well. Utopia is a dream and thus that's where you will find it; in your dreams. While it is sad that little one is being taught, so were the German children, the Jim Jones children, Branch Divinity children, and Jhihad children.... the list goes on. In America, if it is reported, the child will be removed from the home. However, that's often not a better situation and that form of abuse is also turned away from. Bottom line; help those you can and pray for those you can't.", 
        "threadID": "672198221_3030043422001", 
        "time": "2009-05-26 15:05:00", 
        "title": "Girl,7, from Winnipeg, Canada, proudly tells social worker \"black people should die\"", 
        "userID": "charlie_echo"
    }, 
    {
        "content": "The teacher tried washing the crap off and her 'daddy' is looking for an assault charge. He claims the teacher said the markings were garbage and the little one was offended. Winnipeg. Winter. No hat. It changes they way you think.", 
        "intTime": 20090526, 
        "postID": 6, 
        "quote": "", 
        "reply": "The teacher tried washing the crap off and her 'daddy' is looking for an assault charge. He claims the teacher said the markings were garbage and the little one was offended. Winnipeg. Winter. No hat. It changes they way you think.", 
        "threadID": "672198221_3030043422001", 
        "time": "2009-05-26 15:09:00", 
        "title": "Girl,7, from Winnipeg, Canada, proudly tells social worker \"black people should die\"", 
        "userID": "AliBubba"
    }, 
    {
        "content": "quote: Originally posted by AliBubba: The teacher tried washing the crap off and her 'daddy' is looking for an assault charge. He claims the teacher said the markings were garbage and the little one was offended. Winnipeg. Winter. No hat. It changes they way you think. A few long German Winters in the mountains will do that as well. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090526, 
        "postID": 7, 
        "quote": "Originally posted by AliBubba: The teacher tried washing the crap off and her 'daddy' is looking for an assault charge. He claims the teacher said the markings were garbage and the little one was offended. Winnipeg. Winter. No hat. It changes they way you think.", 
        "reply": " A few long German Winters in the mountains will do that as well. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3030043422001", 
        "time": "2009-05-26 15:23:00", 
        "title": "Girl,7, from Winnipeg, Canada, proudly tells social worker \"black people should die\"", 
        "userID": "L0A1"
    }, 
    {
        "content": "Vancouver? Neo nazis in Vancouver? They have to go that far North now? LOL. Well, there's always Greenland.", 
        "intTime": 20090526, 
        "postID": 8, 
        "quote": "", 
        "reply": "Vancouver? Neo nazis in Vancouver? They have to go that far North now? LOL. Well, there's always Greenland.", 
        "threadID": "672198221_3030043422001", 
        "time": "2009-05-26 18:07:00", 
        "title": "Girl,7, from Winnipeg, Canada, proudly tells social worker \"black people should die\"", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Ok I expect to see no further wisecracks about the deep south now... This is just disturbing though. I understand that there are some fruits out there, and I can cope with an adult being willfully ignorant and a bit insane, but indoctrinating a 7 year old kind into these kinds of beliefs is just wrong on so many levels I can't wrap my mind around it... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "intTime": 20090526, 
        "postID": 9, 
        "quote": "", 
        "reply": "Ok I expect to see no further wisecracks about the deep south now... This is just disturbing though. I understand that there are some fruits out there, and I can cope with an adult being willfully ignorant and a bit insane, but indoctrinating a 7 year old kind into these kinds of beliefs is just wrong on so many levels I can't wrap my mind around it... “If you bring these leaders to trial, it will condemn the North, for by the Constitution, secession is not rebellion...His (Jeff Davis') capture was a mistake. His trial will be a greater one. We cannot convict him of treason.\" Chief Justice Salmon P. Chase, 1867.", 
        "threadID": "672198221_3030043422001", 
        "time": "2009-05-26 18:20:00", 
        "title": "Girl,7, from Winnipeg, Canada, proudly tells social worker \"black people should die\"", 
        "userID": "MM2_ss_Lewis"
    }, 
    {
        "content": "quote: Originally posted by MM2_ss_Lewis: Ok I expect to see no further wisecracks about the deep south now... This is just disturbing though. I understand that there are some fruits out there, and I can cope with an adult being willfully ignorant and a bit insane, but indoctrinating a 7 year old kind into these kinds of beliefs is just wrong on so many levels I can't wrap my mind around it... Why? A bigot, or even a lot of bigots, in one place does NOT mean there are not a lot of bigots somewhere else. Just my opinion as a High Tech. Redneck. My mother tells a story about when I was a child. My brother and I were playing near the street with a black child when his mother ran up, picked up her child and start appoligising to my mother. She was afraid that the locals in SC would attack her 4 year old and the rest of the family for him daring to play with a white child and her letting it happen.", 
        "intTime": 20090526, 
        "postID": 10, 
        "quote": "Originally posted by MM2_ss_Lewis: Ok I expect to see no further wisecracks about the deep south now... This is just disturbing though. I understand that there are some fruits out there, and I can cope with an adult being willfully ignorant and a bit insane, but indoctrinating a 7 year old kind into these kinds of beliefs is just wrong on so many levels I can't wrap my mind around it...", 
        "reply": " Why? A bigot, or even a lot of bigots, in one place does NOT mean there are not a lot of bigots somewhere else. Just my opinion as a High Tech. Redneck. My mother tells a story about when I was a child. My brother and I were playing near the street with a black child when his mother ran up, picked up her child and start appoligising to my mother. She was afraid that the locals in SC would attack her 4 year old and the rest of the family for him daring to play with a white child and her letting it happen.", 
        "threadID": "672198221_3030043422001", 
        "time": "2009-05-26 19:02:00", 
        "title": "Girl,7, from Winnipeg, Canada, proudly tells social worker \"black people should die\"", 
        "userID": "rayld2"
    }
]