[
    {
        "content": "$30 billion two days ago went through AIG 'like a pig through shunners'.And so to-day,like Arnie, they're baaaack! Insuring all that junk mortgage origami, has tapped the world's insurer. Now it's the Banking system's greatest source of welfare funding. Note: AIG payments aren't 'public money' as far as banks are concerned, they're due to wise insurance-buying - so somebody really 'deserves' their bonus. Questions: What was AIG doing with all the premiums they were getting for these insurances. Did anyone evaluate risk? When did insurance companies start carrying policies they had no resources to cover? This message has been edited. Last edited by: stillkit, Tue 10 March 2009 08:27 PM",
        "intTime": 20090310,
        "postID": 1,
        "quote": "",
        "reply": "$30 billion two days ago went through AIG 'like a pig through shunners'.And so to-day,like Arnie, they're baaaack! Insuring all that junk mortgage origami, has tapped the world's insurer. Now it's the Banking system's greatest source of welfare funding. Note: AIG payments aren't 'public money' as far as banks are concerned, they're due to wise insurance-buying - so somebody really 'deserves' their bonus. Questions: What was AIG doing with all the premiums they were getting for these insurances. Did anyone evaluate risk? When did insurance companies start carrying policies they had no resources to cover? This message has been edited. Last edited by: stillkit, Tue 10 March 2009 08:27 PM",
        "threadID": "672198221_9990024712001",
        "time": "2009-03-10 06:47:00",
        "title": "AIG Needs 4th Bailout",
        "userID": "popsiq"
    },
    {
        "content": "Let them fail. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090310,
        "postID": 2,
        "quote": "",
        "reply": "Let them fail. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9990024712001",
        "time": "2009-03-10 08:12:00",
        "title": "AIG Needs 4th Bailout",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by Anbar7: Let them fail. Agreed.",
        "intTime": 20090310,
        "postID": 3,
        "quote": "Originally posted by Anbar7: Let them fail.",
        "reply": " Agreed.",
        "threadID": "672198221_9990024712001",
        "time": "2009-03-10 08:18:00",
        "title": "AIG Needs 4th Bailout",
        "userID": "Whirled_Peas"
    },
    {
        "content": "Maybe if we let them fail, then others will realize it ain't no joke and decide to do something. More people would go to that place and maybe it would be cheaper that way too. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090310,
        "postID": 4,
        "quote": "",
        "reply": "Maybe if we let them fail, then others will realize it ain't no joke and decide to do something. More people would go to that place and maybe it would be cheaper that way too. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9990024712001",
        "time": "2009-03-10 08:20:00",
        "title": "AIG Needs 4th Bailout",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by Anbar7: Let them fail. Hate to admit it but you may be right on this call. They just keep coming back for a drink! Correct me if I'm wrong...they're not a bank, they're an insurance company, right? So what exactly brought this on? Was this outrageously bad investments made by arrogant, power drunk managers? Did the labor unions cause AIG to fail? Come on folks, toss me a bone. There has to be a way to mitigate the negative impact on other businesses when they finally collapse, and judging from their performance this year, that won’t be long. This message has been edited. Last edited by: Ol_Doc, Tue 10 March 2009 09:24 AM",
        "intTime": 20090310,
        "postID": 5,
        "quote": "Originally posted by Anbar7: Let them fail.",
        "reply": " Hate to admit it but you may be right on this call. They just keep coming back for a drink! Correct me if I'm wrong...they're not a bank, they're an insurance company, right? So what exactly brought this on? Was this outrageously bad investments made by arrogant, power drunk managers? Did the labor unions cause AIG to fail? Come on folks, toss me a bone. There has to be a way to mitigate the negative impact on other businesses when they finally collapse, and judging from their performance this year, that won’t be long. This message has been edited. Last edited by: Ol_Doc, Tue 10 March 2009 09:24 AM",
        "threadID": "672198221_9990024712001",
        "time": "2009-03-10 08:25:00",
        "title": "AIG Needs 4th Bailout",
        "userID": "Ol_Doc"
    },
    {
        "content": "I keep hearing they are \"too big\" to just let fail. But they are the \"intersection windshield washers\" of Wall Street. Their arms arms paralyzed in a gimmie-gimmie position. I say let them fall flat on their face.",
        "intTime": 20090310,
        "postID": 6,
        "quote": "",
        "reply": "I keep hearing they are \"too big\" to just let fail. But they are the \"intersection windshield washers\" of Wall Street. Their arms arms paralyzed in a gimmie-gimmie position. I say let them fall flat on their face.",
        "threadID": "672198221_9990024712001",
        "time": "2009-03-10 08:32:00",
        "title": "AIG Needs 4th Bailout",
        "userID": "badmac933"
    },
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: Let them fail. Hate to admit it but you may be right on this call. They just keep coming back for a drink! Correct me if I'm wrong...they're not a bank, they're an insurance company, right? So what exactly brought this on? Was this outrageously bad investments made by arrogant, power drunk managers? Did the labor unions cause AIG to fail? Come on folks, toss me a bone. There has to be a way to mitigate the negative impact on other businesses when they finally collapse, and judging from their performance this year, that won’t be long. That is correct, they are an insurance company. Insuring all those housing mortgages has got them here. They do keep asking for more money or coming back for a \"drink\" as you put it. I think if they fail, then others will see and might decide they need to do something instead of making themselves wealthy with bonuses. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090310,
        "postID": 7,
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by Anbar7: Let them fail. Hate to admit it but you may be right on this call. They just keep coming back for a drink! Correct me if I'm wrong...they're not a bank, they're an insurance company, right? So what exactly brought this on? Was this outrageously bad investments made by arrogant, power drunk managers? Did the labor unions cause AIG to fail? Come on folks, toss me a bone. There has to be a way to mitigate the negative impact on other businesses when they finally collapse, and judging from their performance this year, that won’t be long.",
        "reply": " That is correct, they are an insurance company. Insuring all those housing mortgages has got them here. They do keep asking for more money or coming back for a \"drink\" as you put it. I think if they fail, then others will see and might decide they need to do something instead of making themselves wealthy with bonuses. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9990024712001",
        "time": "2009-03-10 10:24:00",
        "title": "AIG Needs 4th Bailout",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by Anbar7: Let them fail. Agreed, but also investigate and where necessary prosecute. Failure at this level is criminal and should be treated as such. Letting these clowns continue to pretend to be \"masters of the universe\" is the worst possible thing that can come out of this.",
        "intTime": 20090310,
        "postID": 8,
        "quote": "Originally posted by Anbar7: Let them fail.",
        "reply": " Agreed, but also investigate and where necessary prosecute. Failure at this level is criminal and should be treated as such. Letting these clowns continue to pretend to be \"masters of the universe\" is the worst possible thing that can come out of this.",
        "threadID": "672198221_9990024712001",
        "time": "2009-03-10 13:29:00",
        "title": "AIG Needs 4th Bailout",
        "userID": "adminnco1"
    },
    {
        "content": "AIG is a totally different mess than the banks, but for the same reason. They were the insurer of the mortgage backed securities that are the toxic assets the banks are holding. AIG's bailout is unique in that it isn't injecting much of that capital directly into AIG for use by AIG. . AIG is the initial receipient of the money, but they are not the final beneficiary. AIG's bailout is money going to banks and financial institutions around the world, much of it in Europe. The money going to AIG is being paid off to counterparties. All of the parties are unknown, but it is known that money has gone to Goldman Sachs, Deutsche Bank, Royal Bank of Scotland, HSB, Calyon (a French Bank) etc. The AIG bailout is a huge mess, but even though I can't even pretend to understand it all the failure of AIG could possibly bring down much of the banking system worldwide.",
        "intTime": 20090310,
        "postID": 9,
        "quote": "",
        "reply": "AIG is a totally different mess than the banks, but for the same reason. They were the insurer of the mortgage backed securities that are the toxic assets the banks are holding. AIG's bailout is unique in that it isn't injecting much of that capital directly into AIG for use by AIG. . AIG is the initial receipient of the money, but they are not the final beneficiary. AIG's bailout is money going to banks and financial institutions around the world, much of it in Europe. The money going to AIG is being paid off to counterparties. All of the parties are unknown, but it is known that money has gone to Goldman Sachs, Deutsche Bank, Royal Bank of Scotland, HSB, Calyon (a French Bank) etc. The AIG bailout is a huge mess, but even though I can't even pretend to understand it all the failure of AIG could possibly bring down much of the banking system worldwide.",
        "threadID": "672198221_9990024712001",
        "time": "2009-03-10 14:16:00",
        "title": "AIG Needs 4th Bailout",
        "userID": "nspreitler"
    },
    {
        "content": "quote: Originally posted by nspreitler: AIG is a totally different mess than the banks, but for the same reason. They were the insurer of the mortgage backed securities that are the toxic assets the banks are holding. AIG's bailout is unique in that it isn't injecting much of that capital directly into AIG for use by AIG. . AIG is the initial receipient of the money, but they are not the final beneficiary. AIG's bailout is money going to banks and financial institutions around the world, much of it in Europe. The money going to AIG is being paid off to counterparties. All of the parties are unknown, but it is known that money has gone to Goldman Sachs, Deutsche Bank, Royal Bank of Scotland, HSB, Calyon (a French Bank) etc. The AIG bailout is a huge mess, but even though I can't even pretend to understand it all the failure of AIG could possibly bring down much of the banking system worldwide. As NSPreitler said, my understanding is that the reason AIG is in trouble is because it was the insurer of approximately $500 billion in credit default swaps (i.e., an insurer of risky mortgages). Throughout the last decade, most of AIG's business was as a typical, profitable insurance company (home and auto insurance, etc.), subject to regulation and required to maintain adequate capital reserves to pay any claims. The problem is that they also developed a completely unregulated side business insuring the high-risk mortgages of the last decades, writing contracts worth a half trillion dollars without hardly any reserves to cover claims. For several years, as property values rose, they had few if any claims. When the housing market collapsed, hundreds of billions of dollars in claims arose and AIG had no money set aside to cover them. The rest of AIG remained profitable, but this one business sank the company. Shutting down AIG completely would leave homeowners, drivers, injured auto accident victims, etc. without coverage. While state insurance guaranty associations offer some coverage in the event of failed insurance companies, the state plans often do not fully cover losses. However, rather than pumping endless funds into AIG, I wonder why the government cannot simply offer to fully or partially guaranty the policies issued under the regulated portion of AIG's business (auto insurance, home insurance, etc.). These policyholders (and their victims) are innocent victims of AIG's collapse: they did the right thing, buying insurance from a well-known, regulated insurance company. In contrast, I don't see any need for the federal government to guarantee policies issued under the unregulated part of AIG's business (credit default insurance). These policyholders were sophisticated banks and financial institutions who knew (or should have known) they were investing in high-risk mortgage instruments and purchasing totally unregulated insurance. It would be a lot less expensive for the federal government to insure the occasional serious auto accident or fire loss covered by an AIG policy than to plunge hundreds of billions of dollars into trying to protect a company and its financial customers from the consequences of their own recklessness. (There are innocent victims even at AIG. The people who sold and paid claims in AIG's traditional insurance lines ran a profitable business, and it is not their fault the company failed. Unfortunately, one division ran amok and brought down the entire enterprise.",
        "intTime": 20090310,
        "postID": 10,
        "quote": "Originally posted by nspreitler: AIG is a totally different mess than the banks, but for the same reason. They were the insurer of the mortgage backed securities that are the toxic assets the banks are holding. AIG's bailout is unique in that it isn't injecting much of that capital directly into AIG for use by AIG. . AIG is the initial receipient of the money, but they are not the final beneficiary. AIG's bailout is money going to banks and financial institutions around the world, much of it in Europe. The money going to AIG is being paid off to counterparties. All of the parties are unknown, but it is known that money has gone to Goldman Sachs, Deutsche Bank, Royal Bank of Scotland, HSB, Calyon (a French Bank) etc. The AIG bailout is a huge mess, but even though I can't even pretend to understand it all the failure of AIG could possibly bring down much of the banking system worldwide.",
        "reply": " As NSPreitler said, my understanding is that the reason AIG is in trouble is because it was the insurer of approximately $500 billion in credit default swaps (i.e., an insurer of risky mortgages). Throughout the last decade, most of AIG's business was as a typical, profitable insurance company (home and auto insurance, etc.), subject to regulation and required to maintain adequate capital reserves to pay any claims. The problem is that they also developed a completely unregulated side business insuring the high-risk mortgages of the last decades, writing contracts worth a half trillion dollars without hardly any reserves to cover claims. For several years, as property values rose, they had few if any claims. When the housing market collapsed, hundreds of billions of dollars in claims arose and AIG had no money set aside to cover them. The rest of AIG remained profitable, but this one business sank the company. Shutting down AIG completely would leave homeowners, drivers, injured auto accident victims, etc. without coverage. While state insurance guaranty associations offer some coverage in the event of failed insurance companies, the state plans often do not fully cover losses. However, rather than pumping endless funds into AIG, I wonder why the government cannot simply offer to fully or partially guaranty the policies issued under the regulated portion of AIG's business (auto insurance, home insurance, etc.). These policyholders (and their victims) are innocent victims of AIG's collapse: they did the right thing, buying insurance from a well-known, regulated insurance company. In contrast, I don't see any need for the federal government to guarantee policies issued under the unregulated part of AIG's business (credit default insurance). These policyholders were sophisticated banks and financial institutions who knew (or should have known) they were investing in high-risk mortgage instruments and purchasing totally unregulated insurance. It would be a lot less expensive for the federal government to insure the occasional serious auto accident or fire loss covered by an AIG policy than to plunge hundreds of billions of dollars into trying to protect a company and its financial customers from the consequences of their own recklessness. (There are innocent victims even at AIG. The people who sold and paid claims in AIG's traditional insurance lines ran a profitable business, and it is not their fault the company failed. Unfortunately, one division ran amok and brought down the entire enterprise.",
        "threadID": "672198221_9990024712001",
        "time": "2009-03-10 17:53:00",
        "title": "AIG Needs 4th Bailout",
        "userID": "RPCVDR"
    },
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by Anbar7: Let them fail. Hate to admit it but you may be right on this call. They just keep coming back for a drink! Correct me if I'm wrong...they're not a bank, they're an insurance company, right? So what exactly brought this on? Was this outrageously bad investments made by arrogant, power drunk managers? Did the labor unions cause AIG to fail? Come on folks, toss me a bone. There has to be a way to mitigate the negative impact on other businesses when they finally collapse, and judging from their performance this year, that won’t be long. AIG is the largest holder of all of the Credit-Default Swaps that insure the shady Collateral Debt Obligations and the Mortgage Backed Securities that make up those CDOs. Essentially, ever time a CDO or MBS tanks, if the investor was paying for a CDF, AIG has to pay that investor whatever amount they lost. It is investment insurance. AIG holds most of the Credit-Default Swaps throughout the world. So, they are losing a ton. And, not only are we propping up AIG, but we are allowing them to pay out on these CDFs; of which are held by just about every major investor around the world. If AIG fails, everybody goes down. You may ask yourself, \"does that mean that American taxpayer money is being used to pay out on the CDSs to foreign investor en mass\"? The answer is Yes! I say let 'em fail.",
        "intTime": 20090310,
        "postID": 11,
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by Anbar7: Let them fail. Hate to admit it but you may be right on this call. They just keep coming back for a drink! Correct me if I'm wrong...they're not a bank, they're an insurance company, right? So what exactly brought this on? Was this outrageously bad investments made by arrogant, power drunk managers? Did the labor unions cause AIG to fail? Come on folks, toss me a bone. There has to be a way to mitigate the negative impact on other businesses when they finally collapse, and judging from their performance this year, that won’t be long.",
        "reply": " AIG is the largest holder of all of the Credit-Default Swaps that insure the shady Collateral Debt Obligations and the Mortgage Backed Securities that make up those CDOs. Essentially, ever time a CDO or MBS tanks, if the investor was paying for a CDF, AIG has to pay that investor whatever amount they lost. It is investment insurance. AIG holds most of the Credit-Default Swaps throughout the world. So, they are losing a ton. And, not only are we propping up AIG, but we are allowing them to pay out on these CDFs; of which are held by just about every major investor around the world. If AIG fails, everybody goes down. You may ask yourself, \"does that mean that American taxpayer money is being used to pay out on the CDSs to foreign investor en mass\"? The answer is Yes! I say let 'em fail.",
        "threadID": "672198221_9990024712001",
        "time": "2009-03-10 19:08:00",
        "title": "AIG Needs 4th Bailout",
        "userID": "10Tenths"
    },
    {
        "content": "I've read that the total obligation of the dud mortgage paper is a staggering 27 Trillion dollars. As insurer to the nations, does it stand to reason that AIG is the front-liner for all the losses? The premiums for this coverage must have been massive too. Where did they go?",
        "intTime": 20090310,
        "postID": 12,
        "quote": "",
        "reply": "I've read that the total obligation of the dud mortgage paper is a staggering 27 Trillion dollars. As insurer to the nations, does it stand to reason that AIG is the front-liner for all the losses? The premiums for this coverage must have been massive too. Where did they go?",
        "threadID": "672198221_9990024712001",
        "time": "2009-03-10 19:29:00",
        "title": "AIG Needs 4th Bailout",
        "userID": "popsiq"
    },
    {
        "content": ">http://www.nydailynews.com/money/2009/03/14/2009-03-14_aig_to_payout_big_bonuses_to_execs_but_a.html Nice to see that the legalities are being attended. By Sunday, AIG \"has to\" disburse its annual bonuses for the stellar performance of the management teat, er team. But, hear this! There will be no more bonuses until the S&P rating gets back on the sunny side of zero, or whenever government handouts are no longer needed - whichever comes first. So the honchos will just have to get by on eight figures. Tough old world!",
        "intTime": 20090314,
        "postID": 13,
        "quote": "",
        "reply": ">http://www.nydailynews.com/money/2009/03/14/2009-03-14_aig_to_payout_big_bonuses_to_execs_but_a.html Nice to see that the legalities are being attended. By Sunday, AIG \"has to\" disburse its annual bonuses for the stellar performance of the management teat, er team. But, hear this! There will be no more bonuses until the S&P rating gets back on the sunny side of zero, or whenever government handouts are no longer needed - whichever comes first. So the honchos will just have to get by on eight figures. Tough old world!",
        "threadID": "672198221_9990024712001",
        "time": "2009-03-14 19:43:00",
        "title": "AIG Needs 4th Bailout",
        "userID": "popsiq"
    },
    {
        "content": "Three failed bailouts...heck why not a 4th. What's the next strategic bailout? Maybe billions for the Edsel? Don",
        "intTime": 20090315,
        "postID": 14,
        "quote": "",
        "reply": "Three failed bailouts...heck why not a 4th. What's the next strategic bailout? Maybe billions for the Edsel? Don",
        "threadID": "672198221_9990024712001",
        "time": "2009-03-15 07:59:00",
        "title": "AIG Needs 4th Bailout",
        "userID": "21yrsUSCGUSCS"
    },
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: Three failed bailouts...heck why not a 4th. What's the next strategic bailout? Maybe billions for the Edsel? Don Beleive it or not the Edsel was a pretty cool car, I remember seeing them cruseing around!",
        "intTime": 20090315,
        "postID": 15,
        "quote": "Originally posted by 21yrsUSCGUSCS: Three failed bailouts...heck why not a 4th. What's the next strategic bailout? Maybe billions for the Edsel? Don",
        "reply": " Beleive it or not the Edsel was a pretty cool car, I remember seeing them cruseing around!",
        "threadID": "672198221_9990024712001",
        "time": "2009-03-15 09:35:00",
        "title": "AIG Needs 4th Bailout",
        "userID": "EAG154"
    },
    {
        "content": "I think the amount of hand-holding between AIG and the government is excessive considering how reliant AIG (well, Summers actually) was upon complex, opaque financial models, which gave the wrong answer about 1% of the time. One percent is a small number, but Summers thought they were infallable, and so when an anomalous event like our current recession came along, boom.",
        "intTime": 20090315,
        "postID": 16,
        "quote": "",
        "reply": "I think the amount of hand-holding between AIG and the government is excessive considering how reliant AIG (well, Summers actually) was upon complex, opaque financial models, which gave the wrong answer about 1% of the time. One percent is a small number, but Summers thought they were infallable, and so when an anomalous event like our current recession came along, boom.",
        "threadID": "672198221_9990024712001",
        "time": "2009-03-15 22:08:00",
        "title": "AIG Needs 4th Bailout",
        "userID": "sammy_the_shark"
    }
]