[
    {
        "content": "RE: http://www.military.com/forums/0,15240,189765,00.html Afghanistan will be easy to win if you do the following things: 1. Buy the opium paste directly from the farmers. This cuts off the drug lords from the cash. We did it in Turkey. 2. Deploy Afghan troops at all road intersections to interdict drugs and guns. 3. Negotiate a policy where Afghan troops (not NATO troops)squeeze the Taliban from the west and enter the SWAT valley, thus creating a allied moderate Muslim effort to destroy the Taliban. 4. Create a NATO Foreign Legion of Afghan warriors ready to assist national troops of any government in the region. It's cheap and it beats these long deployments of US troops.", 
        "intTime": 20090429, 
        "postID": 1, 
        "quote": "", 
        "reply": "RE: http://www.military.com/forums/0,15240,189765,00.html Afghanistan will be easy to win if you do the following things: 1. Buy the opium paste directly from the farmers. This cuts off the drug lords from the cash. We did it in Turkey. 2. Deploy Afghan troops at all road intersections to interdict drugs and guns. 3. Negotiate a policy where Afghan troops (not NATO troops)squeeze the Taliban from the west and enter the SWAT valley, thus creating a allied moderate Muslim effort to destroy the Taliban. 4. Create a NATO Foreign Legion of Afghan warriors ready to assist national troops of any government in the region. It's cheap and it beats these long deployments of US troops.", 
        "threadID": "672198221_1960050222001", 
        "time": "2009-04-29 08:25:00", 
        "title": "Filling Holes in Afghan Strategy", 
        "userID": "12802051"
    }, 
    {
        "content": "quote: Originally posted by 12802051: Afghanistan will be easy to win if you do the following things: 1. Buy the opium paste directly from the farmers. This cuts off the drug lords from the cash. We did it in Turkey. Pretty sure it's illegal for the U.S. to buy drugs. Also, if we're buying instead of them, that doesn't eliminate the demand and doesn't really solve anything, other than greatly increasing the amount of money we already **** away there. quote: Originally posted by 12802051: 2. Deploy Afghan troops at all road intersections to interdict drugs and guns. This doesn't work. They either don't do it, or simply take bribes. They are undisciplined and lazy. I should know. I wasted my time training some. quote: Originally posted by 12802051: 3. Negotiate a policy where Afghan troops (not NATO troops)squeeze the Taliban from the west and enter the SWAT valley, thus creating a allied moderate Muslim effort to destroy the Taliban. They're not ready yet. They still run away when the bad guys shoot at them. They can't conduct any offensive operations without our assistance. quote: Originally posted by 12802051: 4. Create a NATO Foreign Legion of Afghan warriors ready to assist national troops of any government in the region. It's cheap and it beats these long deployments of US troops. Again, I can't stress enough how poorly the Afghan troops perform unless we are right there. They really only serve for the money, and don't have much of an interest in making their country any safer. They just want to be left alone.", 
        "intTime": 20090429, 
        "postID": 2, 
        "quote": "Originally posted by 12802051: Afghanistan will be easy to win if you do the following things: 1. Buy the opium paste directly from the farmers. This cuts off the drug lords from the cash. We did it in Turkey.", 
        "reply": " Pretty sure it's illegal for the U.S. to buy drugs. Also, if we're buying instead of them, that doesn't eliminate the demand and doesn't really solve anything, other than greatly increasing the amount of money we already **** away there. quote: Originally posted by 12802051: 2. Deploy Afghan troops at all road intersections to interdict drugs and guns. This doesn't work. They either don't do it, or simply take bribes. They are undisciplined and lazy. I should know. I wasted my time training some. quote: Originally posted by 12802051: 3. Negotiate a policy where Afghan troops (not NATO troops)squeeze the Taliban from the west and enter the SWAT valley, thus creating a allied moderate Muslim effort to destroy the Taliban. They're not ready yet. They still run away when the bad guys shoot at them. They can't conduct any offensive operations without our assistance. quote: Originally posted by 12802051: 4. Create a NATO Foreign Legion of Afghan warriors ready to assist national troops of any government in the region. It's cheap and it beats these long deployments of US troops. Again, I can't stress enough how poorly the Afghan troops perform unless we are right there. They really only serve for the money, and don't have much of an interest in making their country any safer. They just want to be left alone.", 
        "threadID": "672198221_1960050222001", 
        "time": "2009-04-29 08:33:00", 
        "title": "Filling Holes in Afghan Strategy", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Eight years and no intelligence? That speaks volumes about the Bush administration's negligence. If they hadn't been chasing larger goals in Iraq, we might have had this situation under control by now.", 
        "intTime": 20090429, 
        "postID": 3, 
        "quote": "", 
        "reply": "Eight years and no intelligence? That speaks volumes about the Bush administration's negligence. If they hadn't been chasing larger goals in Iraq, we might have had this situation under control by now.", 
        "threadID": "672198221_1960050222001", 
        "time": "2009-04-29 09:57:00", 
        "title": "Filling Holes in Afghan Strategy", 
        "userID": "PhilLeech"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: Bring our people home. Disband the military and shut down military.com because it's no longer wanted. I'm so tired of people disparaging our military and the job that they've done. And I am sick and tired of uninformed people confusing our service members and the excellent job they are doing with bad foreign policy.", 
        "intTime": 20090429, 
        "postID": 4, 
        "quote": "Originally posted by klassylady25: Bring our people home. Disband the military and shut down military.com because it's no longer wanted. I'm so tired of people disparaging our military and the job that they've done.", 
        "reply": " And I am sick and tired of uninformed people confusing our service members and the excellent job they are doing with bad foreign policy.", 
        "threadID": "672198221_1960050222001", 
        "time": "2009-04-29 10:06:00", 
        "title": "Filling Holes in Afghan Strategy", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by PhilLeech: Eight years and no intelligence? That speaks volumes about the Bush administration's negligence. If they hadn't been chasing larger goals in Iraq, we might have had this situation under control by now. LOL, BDS anyone? Repeat after me, Bush is gone, President Obama is in office now. Then take a deep breath and relax. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090429, 
        "postID": 5, 
        "quote": "Originally posted by PhilLeech: Eight years and no intelligence? That speaks volumes about the Bush administration's negligence. If they hadn't been chasing larger goals in Iraq, we might have had this situation under control by now.", 
        "reply": " LOL, BDS anyone? Repeat after me, Bush is gone, President Obama is in office now. Then take a deep breath and relax. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_1960050222001", 
        "time": "2009-04-29 10:09:00", 
        "title": "Filling Holes in Afghan Strategy", 
        "userID": "L0A1"
    }, 
    {
        "content": "I will agree with you on Point one. Buying the raw Opium does not constitute an offence, for the US or any other nation, it is the base component for many legal applications within the pharmaceutical industry, and at present there is an Opiate shortage. Two birds with one stone? I think so. The main problem with operations in Afghanistan is the lack of unity of effort. Have a simple goal and ALL work towards that end. Therby hangs success, this is a winable conflict if the rules of COIN are followed.", 
        "intTime": 20090502, 
        "postID": 6, 
        "quote": "", 
        "reply": "I will agree with you on Point one. Buying the raw Opium does not constitute an offence, for the US or any other nation, it is the base component for many legal applications within the pharmaceutical industry, and at present there is an Opiate shortage. Two birds with one stone? I think so. The main problem with operations in Afghanistan is the lack of unity of effort. Have a simple goal and ALL work towards that end. Therby hangs success, this is a winable conflict if the rules of COIN are followed.", 
        "threadID": "672198221_1960050222001", 
        "time": "2009-05-02 07:55:00", 
        "title": "Filling Holes in Afghan Strategy", 
        "userID": "redcoat72"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by klassylady25: Bring our people home. Disband the military and shut down military.com because it's no longer wanted. I'm so tired of people disparaging our military and the job that they've done. And I am sick and tired of uninformed people confusing our service members and the excellent job they are doing with bad foreign policy. Ol_Doc, you hit the nail on the head with that.", 
        "intTime": 20090502, 
        "postID": 7, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by klassylady25: Bring our people home. Disband the military and shut down military.com because it's no longer wanted. I'm so tired of people disparaging our military and the job that they've done. And I am sick and tired of uninformed people confusing our service members and the excellent job they are doing with bad foreign policy.", 
        "reply": " Ol_Doc, you hit the nail on the head with that.", 
        "threadID": "672198221_1960050222001", 
        "time": "2009-05-02 08:20:00", 
        "title": "Filling Holes in Afghan Strategy", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "filling holes? I thought we'd paved all the useful roads with asphalt to deter IEDs and prevent those 'land fortesses' from rolling over on patrol. Oh, this is about controlling dopes ....", 
        "intTime": 20090502, 
        "postID": 8, 
        "quote": "", 
        "reply": "filling holes? I thought we'd paved all the useful roads with asphalt to deter IEDs and prevent those 'land fortesses' from rolling over on patrol. Oh, this is about controlling dopes ....", 
        "threadID": "672198221_1960050222001", 
        "time": "2009-05-02 08:56:00", 
        "title": "Filling Holes in Afghan Strategy", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by PhilLeech: Eight years and no intelligence? That speaks volumes about the Bush administration's negligence. If they hadn't been chasing larger goals in Iraq, we might have had this situation under control by now. LOL, BDS anyone? Repeat after me, Bush is gone, President Obama is in office now. Then take a deep breath and relax. The past is relevant or we will never know how we got here - To reverse mistakes, you FIRST have to acknowledge them. To my mind, the best thing we could do is get rid of Karzai and company, because their just a coalition of tame fundamentalists and dope dealers. If we don't start with this understanding, we will just get deeper and deeper into a quagmire. Dave", 
        "intTime": 20090502, 
        "postID": 9, 
        "quote": "Originally posted by L0A1: quote: Originally posted by PhilLeech: Eight years and no intelligence? That speaks volumes about the Bush administration's negligence. If they hadn't been chasing larger goals in Iraq, we might have had this situation under control by now. LOL, BDS anyone? Repeat after me, Bush is gone, President Obama is in office now. Then take a deep breath and relax.", 
        "reply": " The past is relevant or we will never know how we got here - To reverse mistakes, you FIRST have to acknowledge them. To my mind, the best thing we could do is get rid of Karzai and company, because their just a coalition of tame fundamentalists and dope dealers. If we don't start with this understanding, we will just get deeper and deeper into a quagmire. Dave", 
        "threadID": "672198221_1960050222001", 
        "time": "2009-05-02 10:05:00", 
        "title": "Filling Holes in Afghan Strategy", 
        "userID": "Grachus"
    }
]