[
    {
        "content": "Another example of how grave \"losing one's face\" is seen in East Asian socieities like China and South Korea. ++http://news.yahoo.com/s/ap/20090523/ap_on_re_as/as_skorea_obit_roh quote: By JEAN H. LEE, Associated Press Writer Jean H. Lee, Associated Press Writer – 1 hr 2 mins ago SEOUL, South Korea – Former South Korean President Roh Moo-hyun — whose hard-won reputation as a corruption fighter was tarnished by bribery allegations that drew in his family and closest associates — jumped to his death Saturday while hiking in the mountains behind his rural home. He was 62. After leaving his family a suicide note, Roh threw himself off a steep cliff around 6:40 a.m., police and lawyer Moon Jae-in said in the southern port city of Busan. \"I'm indebted to too many people. Too many people are suffering because of me,\" Roh wrote in the note left on his computer. \"Don't be sorry; don't blame anybody. It's destiny.\" He asked to be cremated and a small gravestone erected in his hometown. A self-taught lawyer who lifted himself out of poverty to reach the nation's highest office in 2003, Roh had prided himself on being a \"clean\" politician in a country with a long history of corruption. Recent allegations that he accepted $6 million in bribes from a Seoul businessman were deeply troubling to the ex-leader. \"I have no face to show to the people. I am sorry for disappointing you,\" an emotional Roh said last month before turning himself over to Seoul prosecutors who grilled him for 13 hours about the allegations. His suicide — the first in South Korea by an ex-president — stunned the nation. South Koreans nationwide huddled around TV screens watching news broadcasts. Supporters flooded his Web site with condolences. (...) His supporters claimed the probe was politically motivated by conservative opponents. (...) Part way up, Roh hurled himself off a 100-foot (30-meter) -high cliff known as Owl's Rock, suffering multiple injuries, police said. He was rushed to a local hospital before being transferred to Busan National University Hospital, where he was declared dead several hours later. (...) Roh's death was a tragic end for the son of farmers who never attended college but still managed to pass the country's competitive bar exam in 1975. He built his reputation defending students accused of sedition under previous military-backed administrations, and once was arrested and his law license suspended for supporting an outlawed labor protest. His political career took off with his election as a liberal lawmaker to the National Assembly in 1988. Roh's ascension to the presidency came in a surprise 2002 election win on a campaign pledge not to \"kowtow\" to the United States, which resonated with young voters. He maintained predecessor President Kim Dae-jung's \"sunshine policy\" of offering North Korea aid as way to facilitate reconciliation, holding a summit in Pyongyang with North Korean leader Kim Jong Il in 2007, the second such meeting between leaders of the two countries that technically remain at war. Though criticized as standoffish and confrontational by some, he was praised by others as a candid leader who cared for the underprivileged and fought against corruption. Roh was the first South Korean president with an Internet fan club. But in 2004, Roh urged voters to support candidates from his Uri Party — a violation of political neutrality laws. He became the first South Korean president impeached over the violation, but was reinstated several months later after a court ruled against the impeachment. \"He shocked us twice: first, by betraying our trust in him as the keeper of justice when it was revealed that he'd received the illegitimate money; now, in showing that he was not even responsible enough to face the consequences of his action,\" said Kim Hye-jung, 35, of Seoul. \"As a supporter of the values he stood for, I feel greatly let down.\" Roh is survived by his wife, Kwon Yang-sook, son Roh Gun-ho and daughter Roh Jeong-yeon. Funeral arrangements were not immediately available...", 
        "intTime": 20090523, 
        "postID": 1, 
        "quote": "By JEAN H. LEE, Associated Press Writer Jean H. Lee, Associated Press Writer – 1 hr 2 mins ago SEOUL, South Korea – Former South Korean President Roh Moo-hyun — whose hard-won reputation as a corruption fighter was tarnished by bribery allegations that drew in his family and closest associates — jumped to his death Saturday while hiking in the mountains behind his rural home. He was 62. After leaving his family a suicide note, Roh threw himself off a steep cliff around 6:40 a.m., police and lawyer Moon Jae-in said in the southern port city of Busan. \"I'm indebted to too many people. Too many people are suffering because of me,\" Roh wrote in the note left on his computer. \"Don't be sorry; don't blame anybody. It's destiny.\" He asked to be cremated and a small gravestone erected in his hometown. A self-taught lawyer who lifted himself out of poverty to reach the nation's highest office in 2003, Roh had prided himself on being a \"clean\" politician in a country with a long history of corruption. Recent allegations that he accepted $6 million in bribes from a Seoul businessman were deeply troubling to the ex-leader. \"I have no face to show to the people. I am sorry for disappointing you,\" an emotional Roh said last month before turning himself over to Seoul prosecutors who grilled him for 13 hours about the allegations. His suicide — the first in South Korea by an ex-president — stunned the nation. South Koreans nationwide huddled around TV screens watching news broadcasts. Supporters flooded his Web site with condolences. (...) His supporters claimed the probe was politically motivated by conservative opponents. (...) Part way up, Roh hurled himself off a 100-foot (30-meter) -high cliff known as Owl's Rock, suffering multiple injuries, police said. He was rushed to a local hospital before being transferred to Busan National University Hospital, where he was declared dead several hours later. (...) Roh's death was a tragic end for the son of farmers who never attended college but still managed to pass the country's competitive bar exam in 1975. He built his reputation defending students accused of sedition under previous military-backed administrations, and once was arrested and his law license suspended for supporting an outlawed labor protest. His political career took off with his election as a liberal lawmaker to the National Assembly in 1988. Roh's ascension to the presidency came in a surprise 2002 election win on a campaign pledge not to \"kowtow\" to the United States, which resonated with young voters. He maintained predecessor President Kim Dae-jung's \"sunshine policy\" of offering North Korea aid as way to facilitate reconciliation, holding a summit in Pyongyang with North Korean leader Kim Jong Il in 2007, the second such meeting between leaders of the two countries that technically remain at war. Though criticized as standoffish and confrontational by some, he was praised by others as a candid leader who cared for the underprivileged and fought against corruption. Roh was the first South Korean president with an Internet fan club. But in 2004, Roh urged voters to support candidates from his Uri Party — a violation of political neutrality laws. He became the first South Korean president impeached over the violation, but was reinstated several months later after a court ruled against the impeachment. \"He shocked us twice: first, by betraying our trust in him as the keeper of justice when it was revealed that he'd received the illegitimate money; now, in showing that he was not even responsible enough to face the consequences of his action,\" said Kim Hye-jung, 35, of Seoul. \"As a supporter of the values he stood for, I feel greatly let down.\" Roh is survived by his wife, Kwon Yang-sook, son Roh Gun-ho and daughter Roh Jeong-yeon. Funeral arrangements were not immediately available...", 
        "reply": "Another example of how grave \"losing one's face\" is seen in East Asian socieities like China and South Korea. ++http://news.yahoo.com/s/ap/20090523/ap_on_re_as/as_skorea_obit_roh ", 
        "threadID": "672198221_3690040422001", 
        "time": "2009-05-23 07:00:00", 
        "title": "Embattled South Korean ex-President jumps to his death, shocks all of South Korea", 
        "userID": "Canuck_Centaur"
    }
]