[
    {
        "content": "++http://ca.news.yahoo.com/s/capress/090529/world/us_prince_harry quote: Prince Harry visits World Trade Center site on 1st official U.S. trip Fri May 29, 5:06 PM By Verena Dobnik, The Associated Press NEW YORK - Prince Harry bowed his head in prayer at Ground Zero on Friday \"in admiration of the courage shown by the people of this great city\" - as he wrote on a wreath he placed at the site of the Sept. 11 terror attack. 24-year-old prince - famed for his youthful, at times embarrassing, escapades - is on his first official trip to the United States. Clearly, Harry had a different agenda as he started his two-day New York trip. Dressed sombrely in a blue suit, red-and-blue striped tie and black toe-cap shoes, he arrived at the World Trade Center just after noon. Greeted by New York Gov. David Paterson and Christopher Ward, executive director of the agency that owns the site, Harry spent about 15 minutes quietly speaking to a half-dozen relatives of Sept. 11 victims... For anyone interested, there is also another similar, related topic at the British and Commonwealth forums of military.com: \"Prince Harry takes wounded comrade with him on NYC tour\" thread of military.com", 
        "intTime": 20090529, 
        "postID": 1, 
        "quote": "Prince Harry visits World Trade Center site on 1st official U.S. trip Fri May 29, 5:06 PM By Verena Dobnik, The Associated Press NEW YORK - Prince Harry bowed his head in prayer at Ground Zero on Friday \"in admiration of the courage shown by the people of this great city\" - as he wrote on a wreath he placed at the site of the Sept. 11 terror attack. 24-year-old prince - famed for his youthful, at times embarrassing, escapades - is on his first official trip to the United States. Clearly, Harry had a different agenda as he started his two-day New York trip. Dressed sombrely in a blue suit, red-and-blue striped tie and black toe-cap shoes, he arrived at the World Trade Center just after noon. Greeted by New York Gov. David Paterson and Christopher Ward, executive director of the agency that owns the site, Harry spent about 15 minutes quietly speaking to a half-dozen relatives of Sept. 11 victims...", 
        "reply": "++http://ca.news.yahoo.com/s/capress/090529/world/us_prince_harry  For anyone interested, there is also another similar, related topic at the British and Commonwealth forums of military.com: \"Prince Harry takes wounded comrade with him on NYC tour\" thread of military.com", 
        "threadID": "672198221_3900036422001", 
        "time": "2009-05-29 17:32:00", 
        "title": "Prince Harry visits World Trade Center,tours NYC on 1st official US trip", 
        "userID": "Canuck_Centaur"
    }
]