[
    {
        "content": "A proposal to get California mostly out of the quandry they've created has been floating around. Maybe unlikely to happen, but it might be entertaining to contemplate. The first link is more detailed, but I was unable to copy and post. The second is posted below. quote: ++http://www.breakingviews.com/2009/05/21/california%20break-up.aspx?sg=nytimes ++http://www.professorbainbridge.com/professorbainbridgecom/2009/05/break-up-california.html \"Break up California? As I watch the California economy crumble into the sea, pondering whether the state will default first on my municipal bonds, my salary, or my pension, I'm struck by the absurdity that the world's eighth largest economy (we used to be seventh, BTW) is essentially ungovernable. There's a radical solution floating around, upon which Joe Weisenthal comments: ... the state's uber-democratic system is broken beyond repair. It's truly a failed state, in the classic political science sense of the term. If it were its own country, the US would be consulting with the UN and NATO about establishing a presence and supervising elections. So the state needs radical help, and a bailout will only make things worse. But theoretically the state is salvageable, argues Breakingviews, if only because the state could both afford higher taxes and reduce state spending. Spending is far from bare-bones levels, and state employees are extremely well paid. But Breakingviews actually proposes a much more radical solution, which is breaking California up into 4 distinct states (seriously). Think of it like good bank/bad bank, but for states. Actually it's a little different. The idea is not that this will solve the state's financial problems, but that it will split it into four coherent political units, which would be: San Diego/Orange County/Inland Empire (socially conservative, Hispanic, heavily military) Greater LA (Hollywood and Hispanics, very liberal) San Francisco/Silicon Valley (Liberal, but very dynamic and market oriented) Central (Conservative, Kansas-like) This is a political scientist's late night fantasy and doing this might actually solve some political problems, but in the end it wouldn't work. The first state to go would be Greater LA. You see, the Hollywood liberal types may love to support government spending and immigration, but the moment the entire burden fell on them to support the rest of the population they'd scream bloody murder. You know they would. And it's probably a gloss-over to just say that the San Diego state would be solidly \"conservative\" just because there's a lot of military and socially conservative Hispanics there. There'd be huge public support tensions over spending and government safety nets. Beyond that, national Republicans would never go for this, since you'd essentially be creating three new Democratic states (it sounds like Central would probably be Republican), giving Democrats permanent dominance in the US Senate. As for his second point, what if we broke Texas up into the 5 states contemplated by its annexation agreement? Most of them would be GOP states, which would balance out the new democratic states formed by breaking up California. The more serious objection would be the near impossibility of allocating water rights. Even so, it's at least as plausible an idea as the laughable hypothesis that the legislature can actually fix out budget problems... And here is a map from one of the plans, IIRC.",
        "intTime": 20090524,
        "postID": 1,
        "quote": "++http://www.breakingviews.com/2009/05/21/california%20break-up.aspx?sg=nytimes ++http://www.professorbainbridge.com/professorbainbridgecom/2009/05/break-up-california.html \"Break up California? As I watch the California economy crumble into the sea, pondering whether the state will default first on my municipal bonds, my salary, or my pension, I'm struck by the absurdity that the world's eighth largest economy (we used to be seventh, BTW) is essentially ungovernable. There's a radical solution floating around, upon which Joe Weisenthal comments: ... the state's uber-democratic system is broken beyond repair. It's truly a failed state, in the classic political science sense of the term. If it were its own country, the US would be consulting with the UN and NATO about establishing a presence and supervising elections. So the state needs radical help, and a bailout will only make things worse. But theoretically the state is salvageable, argues Breakingviews, if only because the state could both afford higher taxes and reduce state spending. Spending is far from bare-bones levels, and state employees are extremely well paid. But Breakingviews actually proposes a much more radical solution, which is breaking California up into 4 distinct states (seriously). Think of it like good bank/bad bank, but for states. Actually it's a little different. The idea is not that this will solve the state's financial problems, but that it will split it into four coherent political units, which would be: San Diego/Orange County/Inland Empire (socially conservative, Hispanic, heavily military) Greater LA (Hollywood and Hispanics, very liberal) San Francisco/Silicon Valley (Liberal, but very dynamic and market oriented) Central (Conservative, Kansas-like) This is a political scientist's late night fantasy and doing this might actually solve some political problems, but in the end it wouldn't work. The first state to go would be Greater LA. You see, the Hollywood liberal types may love to support government spending and immigration, but the moment the entire burden fell on them to support the rest of the population they'd scream bloody murder. You know they would. And it's probably a gloss-over to just say that the San Diego state would be solidly \"conservative\" just because there's a lot of military and socially conservative Hispanics there. There'd be huge public support tensions over spending and government safety nets. Beyond that, national Republicans would never go for this, since you'd essentially be creating three new Democratic states (it sounds like Central would probably be Republican), giving Democrats permanent dominance in the US Senate. As for his second point, what if we broke Texas up into the 5 states contemplated by its annexation agreement? Most of them would be GOP states, which would balance out the new democratic states formed by breaking up California. The more serious objection would be the near impossibility of allocating water rights. Even so, it's at least as plausible an idea as the laughable hypothesis that the legislature can actually fix out budget problems...",
        "reply": "A proposal to get California mostly out of the quandry they've created has been floating around. Maybe unlikely to happen, but it might be entertaining to contemplate. The first link is more detailed, but I was unable to copy and post. The second is posted below.  And here is a map from one of the plans, IIRC.",
        "threadID": "672198221_9370051422001",
        "time": "2009-05-24 11:33:00",
        "title": "Plan to break up California revealed?",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "CA is a conservative state.",
        "intTime": 20090524,
        "postID": 2,
        "quote": "",
        "reply": "CA is a conservative state.",
        "threadID": "672198221_9370051422001",
        "time": "2009-05-24 12:33:00",
        "title": "Plan to break up California revealed?",
        "userID": "cybercafe"
    },
    {
        "content": "LOL...It would be retarded not to include all of southern california together, including Los Angeles...",
        "intTime": 20090524,
        "postID": 3,
        "quote": "",
        "reply": "LOL...It would be retarded not to include all of southern california together, including Los Angeles...",
        "threadID": "672198221_9370051422001",
        "time": "2009-05-24 12:42:00",
        "title": "Plan to break up California revealed?",
        "userID": "Irwin_R_Schyster"
    },
    {
        "content": "Wouldn't it be easier just to let if fall into the ocean? Just make sure Pelosi's in town when it does.",
        "intTime": 20090524,
        "postID": 4,
        "quote": "",
        "reply": "Wouldn't it be easier just to let if fall into the ocean? Just make sure Pelosi's in town when it does.",
        "threadID": "672198221_9370051422001",
        "time": "2009-05-24 16:06:00",
        "title": "Plan to break up California revealed?",
        "userID": "fishnfanatic"
    },
    {
        "content": "Easier to just legalize marijuana.",
        "intTime": 20090524,
        "postID": 5,
        "quote": "",
        "reply": "Easier to just legalize marijuana.",
        "threadID": "672198221_9370051422001",
        "time": "2009-05-24 16:17:00",
        "title": "Plan to break up California revealed?",
        "userID": "SeaWitch1220"
    },
    {
        "content": "How's about we just sell it back to Mexico to cover the debt?",
        "intTime": 20090524,
        "postID": 6,
        "quote": "",
        "reply": "How's about we just sell it back to Mexico to cover the debt?",
        "threadID": "672198221_9370051422001",
        "time": "2009-05-24 21:15:00",
        "title": "Plan to break up California revealed?",
        "userID": "ronald45"
    },
    {
        "content": "quote: Originally posted by ronald45: How's about we just sell it back to Mexico to cover the debt? They could pay us with our own drug money.",
        "intTime": 20090525,
        "postID": 7,
        "quote": "Originally posted by ronald45: How's about we just sell it back to Mexico to cover the debt?",
        "reply": " They could pay us with our own drug money.",
        "threadID": "672198221_9370051422001",
        "time": "2009-05-25 09:09:00",
        "title": "Plan to break up California revealed?",
        "userID": "mrmixitup"
    },
    {
        "content": "Think Mexico would want it back? Wait a minute, not a bad idea. Pelosi won't be in office anymore. WOOHOO!!",
        "intTime": 20090525,
        "postID": 8,
        "quote": "",
        "reply": "Think Mexico would want it back? Wait a minute, not a bad idea. Pelosi won't be in office anymore. WOOHOO!!",
        "threadID": "672198221_9370051422001",
        "time": "2009-05-25 10:24:00",
        "title": "Plan to break up California revealed?",
        "userID": "fishnfanatic"
    },
    {
        "content": "At least we could probably get something for California...we probably have to pay Mexico to take Texas.",
        "intTime": 20090525,
        "postID": 9,
        "quote": "",
        "reply": "At least we could probably get something for California...we probably have to pay Mexico to take Texas.",
        "threadID": "672198221_9370051422001",
        "time": "2009-05-25 10:51:00",
        "title": "Plan to break up California revealed?",
        "userID": "Ol_Doc"
    },
    {
        "content": "quote: Originally posted by ronald45: How's about we just sell it back to Mexico to cover the debt? Why should Mexico pay anything even if they had the ability to do so since in time they will get it back anyway... At least by the way things are going. Remember patients is a virtue and since Mexico has little of anything else... patients seems to be the way to go.",
        "intTime": 20090525,
        "postID": 10,
        "quote": "Originally posted by ronald45: How's about we just sell it back to Mexico to cover the debt?",
        "reply": " Why should Mexico pay anything even if they had the ability to do so since in time they will get it back anyway... At least by the way things are going. Remember patients is a virtue and since Mexico has little of anything else... patients seems to be the way to go.",
        "threadID": "672198221_9370051422001",
        "time": "2009-05-25 11:05:00",
        "title": "Plan to break up California revealed?",
        "userID": "bill12351"
    },
    {
        "content": "quote: since in time they will get it back anyway How's that sir?",
        "intTime": 20090525,
        "postID": 11,
        "quote": "since in time they will get it back anyway",
        "reply": " How's that sir?",
        "threadID": "672198221_9370051422001",
        "time": "2009-05-25 12:14:00",
        "title": "Plan to break up California revealed?",
        "userID": "KoRnAdvocate"
    },
    {
        "content": "quote: Originally posted by KoRnAdvocate: quote: since in time they will get it back anyway How's that sir? I guess he's implying by all the Mexicans living in CA.",
        "intTime": 20090525,
        "postID": 12,
        "quote": "Originally posted by KoRnAdvocate: quote: since in time they will get it back anyway How's that sir?",
        "reply": " I guess he's implying by all the Mexicans living in CA.",
        "threadID": "672198221_9370051422001",
        "time": "2009-05-25 12:17:00",
        "title": "Plan to break up California revealed?",
        "userID": "mrmixitup"
    },
    {
        "content": "quote: I guess he's implying by all the Mexicans living in CA. The population of Wisconsin is over 40% German in ancestry. I see no threat of Wisconsin becoming German territory.",
        "intTime": 20090525,
        "postID": 13,
        "quote": "I guess he's implying by all the Mexicans living in CA.",
        "reply": " The population of Wisconsin is over 40% German in ancestry. I see no threat of Wisconsin becoming German territory.",
        "threadID": "672198221_9370051422001",
        "time": "2009-05-25 12:23:00",
        "title": "Plan to break up California revealed?",
        "userID": "KoRnAdvocate"
    },
    {
        "content": "They wouldnt need to break up the state, all they need to do is sack all the liberal politicians including the worthless Governor who wasnt even born in California (Though I know its not required by law, he just doenst give a rats a** about the state and is totally out of touch with reality)! Its very simple, the last 20 to 30 years, the liberals in the state of California through their stupidy and stubborness have waisted our state away. There answer to everything was to raise taxes and sell more bonds to fund more state socialist projects. What California is experiencing is the fall of an attempted Socialist state with a combination of ECO freak policies, and the greedy real estaters, bankers and get rich quick sceemers who have overspeculated our economy to the verge of destruction. To add to all of this, our state politicians have failed California with securing our border, allowing millions of illegals to take advantage of state social programs that have cost the tax payers their shirts. How to solve the problem? Well, normally in big business, if the businees is losing big money for a few consecutive years and on the verge of bankruptcy, you have two options. 1, replace those in charge and start looking for ways to streamline and become more effecient. 2. Sell the company to the highest bidder. Since in Californias case, option 2 is not an option, then California has only one option, the first one. I was born in California, I know how the state works, how the people think, what makes money. I also understand Mathematics. I know how to balance my check book. Since Im not rich like Arnold, I dont have plenty of money to waist, so I have to be smarter with my money and even smarter with other peoples money. We dont need to break up the state, we just need to kick out all the idiots!",
        "intTime": 20090525,
        "postID": 14,
        "quote": "",
        "reply": "They wouldnt need to break up the state, all they need to do is sack all the liberal politicians including the worthless Governor who wasnt even born in California (Though I know its not required by law, he just doenst give a rats a** about the state and is totally out of touch with reality)! Its very simple, the last 20 to 30 years, the liberals in the state of California through their stupidy and stubborness have waisted our state away. There answer to everything was to raise taxes and sell more bonds to fund more state socialist projects. What California is experiencing is the fall of an attempted Socialist state with a combination of ECO freak policies, and the greedy real estaters, bankers and get rich quick sceemers who have overspeculated our economy to the verge of destruction. To add to all of this, our state politicians have failed California with securing our border, allowing millions of illegals to take advantage of state social programs that have cost the tax payers their shirts. How to solve the problem? Well, normally in big business, if the businees is losing big money for a few consecutive years and on the verge of bankruptcy, you have two options. 1, replace those in charge and start looking for ways to streamline and become more effecient. 2. Sell the company to the highest bidder. Since in Californias case, option 2 is not an option, then California has only one option, the first one. I was born in California, I know how the state works, how the people think, what makes money. I also understand Mathematics. I know how to balance my check book. Since Im not rich like Arnold, I dont have plenty of money to waist, so I have to be smarter with my money and even smarter with other peoples money. We dont need to break up the state, we just need to kick out all the idiots!",
        "threadID": "672198221_9370051422001",
        "time": "2009-05-25 14:04:00",
        "title": "Plan to break up California revealed?",
        "userID": "TheGoodOne"
    },
    {
        "content": "Believe it and not common sense is not dead in California as thegoodone has demonstrated with his post. The idea that you can be all things to all people just by taxing those who have to support the much larger majority of those who do not... has demonstrated its fallacy quite well in the state of California. Maybe California should be a good example for the United States itself as to what happens when you spend more than you can possibly take in to support its social welfare services. Well it seems that a lot of Californians are waking up to this reality telling the government no more taxes, dump some of your welfare giveaways and balance your books... but not on the back of the majority of taxpaying citizens.",
        "intTime": 20090525,
        "postID": 15,
        "quote": "",
        "reply": "Believe it and not common sense is not dead in California as thegoodone has demonstrated with his post. The idea that you can be all things to all people just by taxing those who have to support the much larger majority of those who do not... has demonstrated its fallacy quite well in the state of California. Maybe California should be a good example for the United States itself as to what happens when you spend more than you can possibly take in to support its social welfare services. Well it seems that a lot of Californians are waking up to this reality telling the government no more taxes, dump some of your welfare giveaways and balance your books... but not on the back of the majority of taxpaying citizens.",
        "threadID": "672198221_9370051422001",
        "time": "2009-05-25 15:50:00",
        "title": "Plan to break up California revealed?",
        "userID": "bill12351"
    },
    {
        "content": "The funny part is, that some idiots have been proposing this since the late 1940s, now they think they actually have a chance... There used to be this big hay barn to the east of the 5 freeway, as you are getting near to the Oregon border that you used to say, maybe still does, \"Welcome to the state of Jefferson\", that's what they want to call it, Jefferson... Nothing new and never will happen... Respectfully, SUNLINER81",
        "intTime": 20090525,
        "postID": 16,
        "quote": "",
        "reply": "The funny part is, that some idiots have been proposing this since the late 1940s, now they think they actually have a chance... There used to be this big hay barn to the east of the 5 freeway, as you are getting near to the Oregon border that you used to say, maybe still does, \"Welcome to the state of Jefferson\", that's what they want to call it, Jefferson... Nothing new and never will happen... Respectfully, SUNLINER81",
        "threadID": "672198221_9370051422001",
        "time": "2009-05-25 15:54:00",
        "title": "Plan to break up California revealed?",
        "userID": "SUNLINER81"
    }
]