[
    {
        "content": "It's quite apparent they respect the new President. This message has been edited. Last edited by: stillkit, Thu 23 April 2009 03:53 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090421, 
        "postID": 1, 
        "quote": "", 
        "reply": "It's quite apparent they respect the new President. This message has been edited. Last edited by: stillkit, Thu 23 April 2009 03:53 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 09:30:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: It's quite apparent they respect the new President. They must always respect the office that is held This message has been edited. Last edited by: stillkit, Thu 23 April 2009 03:59 AM", 
        "intTime": 20090421, 
        "postID": 2, 
        "quote": "Originally posted by jack_flats: It's quite apparent they respect the new President.", 
        "reply": " They must always respect the office that is held This message has been edited. Last edited by: stillkit, Thu 23 April 2009 03:59 AM", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 09:42:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by jack_flats: It's quite apparent they respect the new President. They must always respect the office that is held They were not forced to stand and cheer for him. This message has been edited. Last edited by: stillkit, Thu 23 April 2009 03:59 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090421, 
        "postID": 3, 
        "quote": "Originally posted by ss_287: quote: Originally posted by jack_flats: It's quite apparent they respect the new President. They must always respect the office that is held", 
        "reply": " They were not forced to stand and cheer for him. This message has been edited. Last edited by: stillkit, Thu 23 April 2009 03:59 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 09:45:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Return to normalcy is appreciated by all.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 4, 
        "quote": "", 
        "reply": "Return to normalcy is appreciated by all.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 09:59:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by ss_287: quote: Originally posted by jack_flats: It's quite apparent they respect the new President. They must always respect the office that is held They were not forced to stand and cheer for him. Right, they have the option of standing up with their hands in their pockets for an incoming President... This message has been edited. Last edited by: stillkit, Thu 23 April 2009 04:00 AM", 
        "intTime": 20090421, 
        "postID": 5, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by ss_287: quote: Originally posted by jack_flats: It's quite apparent they respect the new President. They must always respect the office that is held They were not forced to stand and cheer for him.", 
        "reply": " Right, they have the option of standing up with their hands in their pockets for an incoming President... This message has been edited. Last edited by: stillkit, Thu 23 April 2009 04:00 AM", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:03:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Newsflash: Fed Gubmint employees give the POTUS a warm reception. Wow! This's not only completely unexpected, but totally unprecedented as well!", 
        "intTime": 20090421, 
        "postID": 6, 
        "quote": "", 
        "reply": "Newsflash: Fed Gubmint employees give the POTUS a warm reception. Wow! This's not only completely unexpected, but totally unprecedented as well!", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:10:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by jack_flats: quote: Originally posted by ss_287: quote: Originally posted by jack_flats: ] It's quite apparent they respect the new President. They must always respect the office that is held They were not forced to stand and cheer for him. Right, they have the option of standing up with their hands in their pockets for an incoming President... Everytime the Bush administration ran into trouble they passed the buck to the CIA. Basically they said, \"Why blame us? It's the fault of those who handed us the intelligence?\" No wonder they appreciate Obama (or McCain if he had won.) Dave This message has been edited. Last edited by: stillkit, Thu 23 April 2009 04:00 AM", 
        "intTime": 20090421, 
        "postID": 7, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by jack_flats: quote: Originally posted by ss_287: quote: Originally posted by jack_flats: ] It's quite apparent they respect the new President. They must always respect the office that is held They were not forced to stand and cheer for him. Right, they have the option of standing up with their hands in their pockets for an incoming President...", 
        "reply": " Everytime the Bush administration ran into trouble they passed the buck to the CIA. Basically they said, \"Why blame us? It's the fault of those who handed us the intelligence?\" No wonder they appreciate Obama (or McCain if he had won.) Dave This message has been edited. Last edited by: stillkit, Thu 23 April 2009 04:00 AM", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:11:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Grachus"
    }, 
    {
        "content": "yea they better or their butts will be in a sling next./...", 
        "intTime": 20090421, 
        "postID": 8, 
        "quote": "", 
        "reply": "yea they better or their butts will be in a sling next./...", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:21:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Right, they have the option of standing up with their hands in their pockets for an incoming President... Exactly,, everyone bolts from their seats and goes straight to attn. No matter who the President is.", 
        "intTime": 20090421, 
        "postID": 9, 
        "quote": "Right, they have the option of standing up with their hands in their pockets for an incoming President...", 
        "reply": " Exactly,, everyone bolts from their seats and goes straight to attn. No matter who the President is.", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:22:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: quote: Right, they have the option of standing up with their hands in their pockets for an incoming President... Exactly,, everyone bolts from their seats and goes straight to attn. No matter who the President is. quote: If there were hard feelings, they weren't on public display at the Central Intelligence Agency. Hundreds of agency employees packed the lobby of the original headquarters building to hear Obama and exploded in cheers and applause when he strode in with CIA director Leon Panetta. \"Don't be discouraged by what's happened the last few weeks. Don't be discouraged that we have to acknowledge potentially we have made some mistakes -- that's how we learn,\" Obama said. \"But the fact that we are willing to acknowledge them and then move forward, that is precisely why I am proud to be president of the United States and that's why you should be proud to be members of the CIA.\" Hmm? \"exploded in cheers?\" Maybe they like to hear someone say, \"Don't be discouraged that we have to acknowledge potentially we have made some mistakes -- that's how we learn,\" Obama said.\" As opposed to, (pardon the quotes)\"None of this is our fault, just some incompetents in the CIA. We didn't make ANY mistakes, they did.\" Dave", 
        "intTime": 20090421, 
        "postID": 10, 
        "quote": "Originally posted by BAGodbehere: quote: Right, they have the option of standing up with their hands in their pockets for an incoming President... Exactly,, everyone bolts from their seats and goes straight to attn. No matter who the President is.", 
        "reply": " quote: If there were hard feelings, they weren't on public display at the Central Intelligence Agency. Hundreds of agency employees packed the lobby of the original headquarters building to hear Obama and exploded in cheers and applause when he strode in with CIA director Leon Panetta. \"Don't be discouraged by what's happened the last few weeks. Don't be discouraged that we have to acknowledge potentially we have made some mistakes -- that's how we learn,\" Obama said. \"But the fact that we are willing to acknowledge them and then move forward, that is precisely why I am proud to be president of the United States and that's why you should be proud to be members of the CIA.\" Hmm? \"exploded in cheers?\" Maybe they like to hear someone say, \"Don't be discouraged that we have to acknowledge potentially we have made some mistakes -- that's how we learn,\" Obama said.\" As opposed to, (pardon the quotes)\"None of this is our fault, just some incompetents in the CIA. We didn't make ANY mistakes, they did.\" Dave", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:30:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: quote: Right, they have the option of standing up with their hands in their pockets for an incoming President... Exactly,, everyone bolts from their seats and goes straight to attn. No matter who the President is. They’re civilians, why would they be required to stand at attention? Also, there is a huge difference between standing at attention, and cheering! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 11, 
        "quote": "Originally posted by BAGodbehere: quote: Right, they have the option of standing up with their hands in their pockets for an incoming President... Exactly,, everyone bolts from their seats and goes straight to attn. No matter who the President is.", 
        "reply": " They’re civilians, why would they be required to stand at attention? Also, there is a huge difference between standing at attention, and cheering! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:31:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "NSNN"
    }, 
    {
        "content": "CIA is civilians? What about the Secret Service, FBI, DEA, etc. They are just as much in the Service of the USA than the US Navy. The CIA suffered under President Clinton because the cold war was over and the State department became the clearance center on security matters. Once American citizens being killed, Khobar Towers and the USS Cole suddenly Osama Ben Laden became a household word and the CIA had a new and bigger mission. We've been playing catch up ever since and Homeland secuirty is not producing the results it should. Thank the good Lord there were some grey beards in that crowd at Langley. Asst Director of the CIA was not ecstatic. After being handed your head by a politician simply to disperse critical observations of the weakness of the new leadership comes close to a prosecutional offense more than attaining information savings the lives of Americans. I wish I could have been at the formal meeting that preceded the cheerleading ceremonies.", 
        "intTime": 20090421, 
        "postID": 12, 
        "quote": "", 
        "reply": "CIA is civilians? What about the Secret Service, FBI, DEA, etc. They are just as much in the Service of the USA than the US Navy. The CIA suffered under President Clinton because the cold war was over and the State department became the clearance center on security matters. Once American citizens being killed, Khobar Towers and the USS Cole suddenly Osama Ben Laden became a household word and the CIA had a new and bigger mission. We've been playing catch up ever since and Homeland secuirty is not producing the results it should. Thank the good Lord there were some grey beards in that crowd at Langley. Asst Director of the CIA was not ecstatic. After being handed your head by a politician simply to disperse critical observations of the weakness of the new leadership comes close to a prosecutional offense more than attaining information savings the lives of Americans. I wish I could have been at the formal meeting that preceded the cheerleading ceremonies.", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:55:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: They’re civilians, why would they be required to stand at attention? Also, there is a huge difference between standing at attention, and cheering! I understand this, I just wrote the first thing that popped to mind, standing none the less. Cheering,,,whatever they wish to do. Myself, I would stand at attn.", 
        "intTime": 20090421, 
        "postID": 13, 
        "quote": "They’re civilians, why would they be required to stand at attention? Also, there is a huge difference between standing at attention, and cheering!", 
        "reply": " I understand this, I just wrote the first thing that popped to mind, standing none the less. Cheering,,,whatever they wish to do. Myself, I would stand at attn.", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:08:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: CIA is civilians? What about the Secret Service, FBI, DEA, etc. They are just as much in the Service of the USA than the US Navy. So thy are required to stand at attention and salute? The CIA suffered under President Clinton because the cold war was over and the State department became the clearance center on security matters. Once American citizens being killed, Khobar Towers and the USS Cole suddenly Osama Ben Laden became a household word and the CIA had a new and bigger mission. We've been playing catch up ever since and Homeland secuirty is not producing the results it should. Thank the good Lord there were some grey beards in that crowd at Langley. Asst Director of the CIA was not ecstatic. After being handed your head by a politician simply to disperse critical observations of the weakness of the new leadership comes close to a prosecutional offense more than attaining information savings the lives of Americans. I wish I could have been at the formal meeting that preceded the cheerleading ceremonies. What does any of this have to do with CIA’s euphoric welcome of POTUS? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 14, 
        "quote": "Originally posted by rayevinsonsr: CIA is civilians? What about the Secret Service, FBI, DEA, etc. They are just as much in the Service of the USA than the US Navy. So thy are required to stand at attention and salute? The CIA suffered under President Clinton because the cold war was over and the State department became the clearance center on security matters. Once American citizens being killed, Khobar Towers and the USS Cole suddenly Osama Ben Laden became a household word and the CIA had a new and bigger mission. We've been playing catch up ever since and Homeland secuirty is not producing the results it should. Thank the good Lord there were some grey beards in that crowd at Langley. Asst Director of the CIA was not ecstatic. After being handed your head by a politician simply to disperse critical observations of the weakness of the new leadership comes close to a prosecutional offense more than attaining information savings the lives of Americans. I wish I could have been at the formal meeting that preceded the cheerleading ceremonies. What does any of this have to do with CIA’s euphoric welcome of POTUS?", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:09:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: It's quite apparent they respect the new President. They may respect the Pres., but they didn't like his pick for the director! This message has been edited. Last edited by: stillkit, Thu 23 April 2009 04:01 AM \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090421, 
        "postID": 15, 
        "quote": "Originally posted by jack_flats: It's quite apparent they respect the new President.", 
        "reply": " They may respect the Pres., but they didn't like his pick for the director! This message has been edited. Last edited by: stillkit, Thu 23 April 2009 04:01 AM \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:18:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by rayevinsonsr: CIA is civilians? What about the Secret Service, FBI, DEA, etc. They are just as much in the Service of the USA than the US Navy. So thy are required to stand at attention and salute? The CIA suffered under President Clinton because the cold war was over and the State department became the clearance center on security matters. Once American citizens being killed, Khobar Towers and the USS Cole suddenly Osama Ben Laden became a household word and the CIA had a new and bigger mission. We've been playing catch up ever since and Homeland secuirty is not producing the results it should. Thank the good Lord there were some grey beards in that crowd at Langley. Asst Director of the CIA was not ecstatic. After being handed your head by a politician simply to disperse critical observations of the weakness of the new leadership comes close to a prosecutional offense more than attaining information savings the lives of Americans. I wish I could have been at the formal meeting that preceded the cheerleading ceremonies. What does any of this have to do with CIA’s euphoric welcome of POTUS? Saluting a manifestation in your own mind, I never mentioned it. I don't explain common sense.", 
        "intTime": 20090421, 
        "postID": 16, 
        "quote": "Originally posted by NSNN: quote: Originally posted by rayevinsonsr: CIA is civilians? What about the Secret Service, FBI, DEA, etc. They are just as much in the Service of the USA than the US Navy. So thy are required to stand at attention and salute? The CIA suffered under President Clinton because the cold war was over and the State department became the clearance center on security matters. Once American citizens being killed, Khobar Towers and the USS Cole suddenly Osama Ben Laden became a household word and the CIA had a new and bigger mission. We've been playing catch up ever since and Homeland secuirty is not producing the results it should. Thank the good Lord there were some grey beards in that crowd at Langley. Asst Director of the CIA was not ecstatic. After being handed your head by a politician simply to disperse critical observations of the weakness of the new leadership comes close to a prosecutional offense more than attaining information savings the lives of Americans. I wish I could have been at the formal meeting that preceded the cheerleading ceremonies. What does any of this have to do with CIA’s euphoric welcome of POTUS?", 
        "reply": " Saluting a manifestation in your own mind, I never mentioned it. I don't explain common sense.", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:23:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too?", 
        "intTime": 20090421, 
        "postID": 17, 
        "quote": "", 
        "reply": "All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too?", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:28:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too? Funny, the only CIA agent that has been recently outed was outed by the previous administration, if memory serves correct.", 
        "intTime": 20090421, 
        "postID": 18, 
        "quote": "Originally posted by peter3_1: All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too?", 
        "reply": " Funny, the only CIA agent that has been recently outed was outed by the previous administration, if memory serves correct.", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:32:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by peter3_1: All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too? Funny, the only CIA agent that has been recently outed was outed by the previous administration, if memory serves correct. Was that before or after the Vanity Fair piece with the pictures on the cover? She was no longer a field agent, but rather an office pogue relegated to sharpening pencils and answering the phones. \"The World's Finest\"", 
        "intTime": 20090421, 
        "postID": 19, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by peter3_1: All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too? Funny, the only CIA agent that has been recently outed was outed by the previous administration, if memory serves correct.", 
        "reply": " Was that before or after the Vanity Fair piece with the pictures on the cover? She was no longer a field agent, but rather an office pogue relegated to sharpening pencils and answering the phones. \"The World's Finest\"", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:40:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Ol_Doc: quote: Originally posted by peter3_1: All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too? Funny, the only CIA agent that has been recently outed was outed by the previous administration, if memory serves correct. Was that before or after the Vanity Fair piece with the pictures on the cover? She was no longer a field agent, but rather an office pogue relegated to sharpening pencils and answering the phones. Not according to the CIA which initiated the investigation...but what do they know, you know, faulty intel.", 
        "intTime": 20090421, 
        "postID": 20, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Ol_Doc: quote: Originally posted by peter3_1: All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too? Funny, the only CIA agent that has been recently outed was outed by the previous administration, if memory serves correct. Was that before or after the Vanity Fair piece with the pictures on the cover? She was no longer a field agent, but rather an office pogue relegated to sharpening pencils and answering the phones.", 
        "reply": " Not according to the CIA which initiated the investigation...but what do they know, you know, faulty intel.", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:42:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "It's quite apparent they respect the new President. This message has been edited. Last edited by: stillkit, Thu 23 April 2009 03:53 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090421, 
        "postID": 21, 
        "quote": "", 
        "reply": "It's quite apparent they respect the new President. This message has been edited. Last edited by: stillkit, Thu 23 April 2009 03:53 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 09:30:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: It's quite apparent they respect the new President. They must always respect the office that is held This message has been edited. Last edited by: stillkit, Thu 23 April 2009 03:59 AM", 
        "intTime": 20090421, 
        "postID": 22, 
        "quote": "Originally posted by jack_flats: It's quite apparent they respect the new President.", 
        "reply": " They must always respect the office that is held This message has been edited. Last edited by: stillkit, Thu 23 April 2009 03:59 AM", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 09:42:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by jack_flats: It's quite apparent they respect the new President. They must always respect the office that is held They were not forced to stand and cheer for him. This message has been edited. Last edited by: stillkit, Thu 23 April 2009 03:59 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090421, 
        "postID": 23, 
        "quote": "Originally posted by ss_287: quote: Originally posted by jack_flats: It's quite apparent they respect the new President. They must always respect the office that is held", 
        "reply": " They were not forced to stand and cheer for him. This message has been edited. Last edited by: stillkit, Thu 23 April 2009 03:59 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 09:45:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Return to normalcy is appreciated by all.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 24, 
        "quote": "", 
        "reply": "Return to normalcy is appreciated by all.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 09:59:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by ss_287: quote: Originally posted by jack_flats: It's quite apparent they respect the new President. They must always respect the office that is held They were not forced to stand and cheer for him. Right, they have the option of standing up with their hands in their pockets for an incoming President... This message has been edited. Last edited by: stillkit, Thu 23 April 2009 04:00 AM", 
        "intTime": 20090421, 
        "postID": 25, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by ss_287: quote: Originally posted by jack_flats: It's quite apparent they respect the new President. They must always respect the office that is held They were not forced to stand and cheer for him.", 
        "reply": " Right, they have the option of standing up with their hands in their pockets for an incoming President... This message has been edited. Last edited by: stillkit, Thu 23 April 2009 04:00 AM", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:03:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Newsflash: Fed Gubmint employees give the POTUS a warm reception. Wow! This's not only completely unexpected, but totally unprecedented as well!", 
        "intTime": 20090421, 
        "postID": 26, 
        "quote": "", 
        "reply": "Newsflash: Fed Gubmint employees give the POTUS a warm reception. Wow! This's not only completely unexpected, but totally unprecedented as well!", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:10:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by jack_flats: quote: Originally posted by ss_287: quote: Originally posted by jack_flats: ] It's quite apparent they respect the new President. They must always respect the office that is held They were not forced to stand and cheer for him. Right, they have the option of standing up with their hands in their pockets for an incoming President... Everytime the Bush administration ran into trouble they passed the buck to the CIA. Basically they said, \"Why blame us? It's the fault of those who handed us the intelligence?\" No wonder they appreciate Obama (or McCain if he had won.) Dave This message has been edited. Last edited by: stillkit, Thu 23 April 2009 04:00 AM", 
        "intTime": 20090421, 
        "postID": 27, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by jack_flats: quote: Originally posted by ss_287: quote: Originally posted by jack_flats: ] It's quite apparent they respect the new President. They must always respect the office that is held They were not forced to stand and cheer for him. Right, they have the option of standing up with their hands in their pockets for an incoming President...", 
        "reply": " Everytime the Bush administration ran into trouble they passed the buck to the CIA. Basically they said, \"Why blame us? It's the fault of those who handed us the intelligence?\" No wonder they appreciate Obama (or McCain if he had won.) Dave This message has been edited. Last edited by: stillkit, Thu 23 April 2009 04:00 AM", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:11:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Grachus"
    }, 
    {
        "content": "yea they better or their butts will be in a sling next./...", 
        "intTime": 20090421, 
        "postID": 28, 
        "quote": "", 
        "reply": "yea they better or their butts will be in a sling next./...", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:21:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Right, they have the option of standing up with their hands in their pockets for an incoming President... Exactly,, everyone bolts from their seats and goes straight to attn. No matter who the President is.", 
        "intTime": 20090421, 
        "postID": 29, 
        "quote": "Right, they have the option of standing up with their hands in their pockets for an incoming President...", 
        "reply": " Exactly,, everyone bolts from their seats and goes straight to attn. No matter who the President is.", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:22:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: quote: Right, they have the option of standing up with their hands in their pockets for an incoming President... Exactly,, everyone bolts from their seats and goes straight to attn. No matter who the President is. quote: If there were hard feelings, they weren't on public display at the Central Intelligence Agency. Hundreds of agency employees packed the lobby of the original headquarters building to hear Obama and exploded in cheers and applause when he strode in with CIA director Leon Panetta. \"Don't be discouraged by what's happened the last few weeks. Don't be discouraged that we have to acknowledge potentially we have made some mistakes -- that's how we learn,\" Obama said. \"But the fact that we are willing to acknowledge them and then move forward, that is precisely why I am proud to be president of the United States and that's why you should be proud to be members of the CIA.\" Hmm? \"exploded in cheers?\" Maybe they like to hear someone say, \"Don't be discouraged that we have to acknowledge potentially we have made some mistakes -- that's how we learn,\" Obama said.\" As opposed to, (pardon the quotes)\"None of this is our fault, just some incompetents in the CIA. We didn't make ANY mistakes, they did.\" Dave", 
        "intTime": 20090421, 
        "postID": 30, 
        "quote": "Originally posted by BAGodbehere: quote: Right, they have the option of standing up with their hands in their pockets for an incoming President... Exactly,, everyone bolts from their seats and goes straight to attn. No matter who the President is.", 
        "reply": " quote: If there were hard feelings, they weren't on public display at the Central Intelligence Agency. Hundreds of agency employees packed the lobby of the original headquarters building to hear Obama and exploded in cheers and applause when he strode in with CIA director Leon Panetta. \"Don't be discouraged by what's happened the last few weeks. Don't be discouraged that we have to acknowledge potentially we have made some mistakes -- that's how we learn,\" Obama said. \"But the fact that we are willing to acknowledge them and then move forward, that is precisely why I am proud to be president of the United States and that's why you should be proud to be members of the CIA.\" Hmm? \"exploded in cheers?\" Maybe they like to hear someone say, \"Don't be discouraged that we have to acknowledge potentially we have made some mistakes -- that's how we learn,\" Obama said.\" As opposed to, (pardon the quotes)\"None of this is our fault, just some incompetents in the CIA. We didn't make ANY mistakes, they did.\" Dave", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:30:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: quote: Right, they have the option of standing up with their hands in their pockets for an incoming President... Exactly,, everyone bolts from their seats and goes straight to attn. No matter who the President is. They’re civilians, why would they be required to stand at attention? Also, there is a huge difference between standing at attention, and cheering! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 31, 
        "quote": "Originally posted by BAGodbehere: quote: Right, they have the option of standing up with their hands in their pockets for an incoming President... Exactly,, everyone bolts from their seats and goes straight to attn. No matter who the President is.", 
        "reply": " They’re civilians, why would they be required to stand at attention? Also, there is a huge difference between standing at attention, and cheering! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:31:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "NSNN"
    }, 
    {
        "content": "CIA is civilians? What about the Secret Service, FBI, DEA, etc. They are just as much in the Service of the USA than the US Navy. The CIA suffered under President Clinton because the cold war was over and the State department became the clearance center on security matters. Once American citizens being killed, Khobar Towers and the USS Cole suddenly Osama Ben Laden became a household word and the CIA had a new and bigger mission. We've been playing catch up ever since and Homeland secuirty is not producing the results it should. Thank the good Lord there were some grey beards in that crowd at Langley. Asst Director of the CIA was not ecstatic. After being handed your head by a politician simply to disperse critical observations of the weakness of the new leadership comes close to a prosecutional offense more than attaining information savings the lives of Americans. I wish I could have been at the formal meeting that preceded the cheerleading ceremonies.", 
        "intTime": 20090421, 
        "postID": 32, 
        "quote": "", 
        "reply": "CIA is civilians? What about the Secret Service, FBI, DEA, etc. They are just as much in the Service of the USA than the US Navy. The CIA suffered under President Clinton because the cold war was over and the State department became the clearance center on security matters. Once American citizens being killed, Khobar Towers and the USS Cole suddenly Osama Ben Laden became a household word and the CIA had a new and bigger mission. We've been playing catch up ever since and Homeland secuirty is not producing the results it should. Thank the good Lord there were some grey beards in that crowd at Langley. Asst Director of the CIA was not ecstatic. After being handed your head by a politician simply to disperse critical observations of the weakness of the new leadership comes close to a prosecutional offense more than attaining information savings the lives of Americans. I wish I could have been at the formal meeting that preceded the cheerleading ceremonies.", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:55:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: They’re civilians, why would they be required to stand at attention? Also, there is a huge difference between standing at attention, and cheering! I understand this, I just wrote the first thing that popped to mind, standing none the less. Cheering,,,whatever they wish to do. Myself, I would stand at attn.", 
        "intTime": 20090421, 
        "postID": 33, 
        "quote": "They’re civilians, why would they be required to stand at attention? Also, there is a huge difference between standing at attention, and cheering!", 
        "reply": " I understand this, I just wrote the first thing that popped to mind, standing none the less. Cheering,,,whatever they wish to do. Myself, I would stand at attn.", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:08:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: CIA is civilians? What about the Secret Service, FBI, DEA, etc. They are just as much in the Service of the USA than the US Navy. So thy are required to stand at attention and salute? The CIA suffered under President Clinton because the cold war was over and the State department became the clearance center on security matters. Once American citizens being killed, Khobar Towers and the USS Cole suddenly Osama Ben Laden became a household word and the CIA had a new and bigger mission. We've been playing catch up ever since and Homeland secuirty is not producing the results it should. Thank the good Lord there were some grey beards in that crowd at Langley. Asst Director of the CIA was not ecstatic. After being handed your head by a politician simply to disperse critical observations of the weakness of the new leadership comes close to a prosecutional offense more than attaining information savings the lives of Americans. I wish I could have been at the formal meeting that preceded the cheerleading ceremonies. What does any of this have to do with CIA’s euphoric welcome of POTUS? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 34, 
        "quote": "Originally posted by rayevinsonsr: CIA is civilians? What about the Secret Service, FBI, DEA, etc. They are just as much in the Service of the USA than the US Navy. So thy are required to stand at attention and salute? The CIA suffered under President Clinton because the cold war was over and the State department became the clearance center on security matters. Once American citizens being killed, Khobar Towers and the USS Cole suddenly Osama Ben Laden became a household word and the CIA had a new and bigger mission. We've been playing catch up ever since and Homeland secuirty is not producing the results it should. Thank the good Lord there were some grey beards in that crowd at Langley. Asst Director of the CIA was not ecstatic. After being handed your head by a politician simply to disperse critical observations of the weakness of the new leadership comes close to a prosecutional offense more than attaining information savings the lives of Americans. I wish I could have been at the formal meeting that preceded the cheerleading ceremonies. What does any of this have to do with CIA’s euphoric welcome of POTUS?", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:09:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: It's quite apparent they respect the new President. They may respect the Pres., but they didn't like his pick for the director! This message has been edited. Last edited by: stillkit, Thu 23 April 2009 04:01 AM \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090421, 
        "postID": 35, 
        "quote": "Originally posted by jack_flats: It's quite apparent they respect the new President.", 
        "reply": " They may respect the Pres., but they didn't like his pick for the director! This message has been edited. Last edited by: stillkit, Thu 23 April 2009 04:01 AM \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:18:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by rayevinsonsr: CIA is civilians? What about the Secret Service, FBI, DEA, etc. They are just as much in the Service of the USA than the US Navy. So thy are required to stand at attention and salute? The CIA suffered under President Clinton because the cold war was over and the State department became the clearance center on security matters. Once American citizens being killed, Khobar Towers and the USS Cole suddenly Osama Ben Laden became a household word and the CIA had a new and bigger mission. We've been playing catch up ever since and Homeland secuirty is not producing the results it should. Thank the good Lord there were some grey beards in that crowd at Langley. Asst Director of the CIA was not ecstatic. After being handed your head by a politician simply to disperse critical observations of the weakness of the new leadership comes close to a prosecutional offense more than attaining information savings the lives of Americans. I wish I could have been at the formal meeting that preceded the cheerleading ceremonies. What does any of this have to do with CIA’s euphoric welcome of POTUS? Saluting a manifestation in your own mind, I never mentioned it. I don't explain common sense.", 
        "intTime": 20090421, 
        "postID": 36, 
        "quote": "Originally posted by NSNN: quote: Originally posted by rayevinsonsr: CIA is civilians? What about the Secret Service, FBI, DEA, etc. They are just as much in the Service of the USA than the US Navy. So thy are required to stand at attention and salute? The CIA suffered under President Clinton because the cold war was over and the State department became the clearance center on security matters. Once American citizens being killed, Khobar Towers and the USS Cole suddenly Osama Ben Laden became a household word and the CIA had a new and bigger mission. We've been playing catch up ever since and Homeland secuirty is not producing the results it should. Thank the good Lord there were some grey beards in that crowd at Langley. Asst Director of the CIA was not ecstatic. After being handed your head by a politician simply to disperse critical observations of the weakness of the new leadership comes close to a prosecutional offense more than attaining information savings the lives of Americans. I wish I could have been at the formal meeting that preceded the cheerleading ceremonies. What does any of this have to do with CIA’s euphoric welcome of POTUS?", 
        "reply": " Saluting a manifestation in your own mind, I never mentioned it. I don't explain common sense.", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:23:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too?", 
        "intTime": 20090421, 
        "postID": 37, 
        "quote": "", 
        "reply": "All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too?", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:28:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too? Funny, the only CIA agent that has been recently outed was outed by the previous administration, if memory serves correct.", 
        "intTime": 20090421, 
        "postID": 38, 
        "quote": "Originally posted by peter3_1: All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too?", 
        "reply": " Funny, the only CIA agent that has been recently outed was outed by the previous administration, if memory serves correct.", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:32:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by peter3_1: All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too? Funny, the only CIA agent that has been recently outed was outed by the previous administration, if memory serves correct. Was that before or after the Vanity Fair piece with the pictures on the cover? She was no longer a field agent, but rather an office pogue relegated to sharpening pencils and answering the phones. \"The World's Finest\"", 
        "intTime": 20090421, 
        "postID": 39, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by peter3_1: All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too? Funny, the only CIA agent that has been recently outed was outed by the previous administration, if memory serves correct.", 
        "reply": " Was that before or after the Vanity Fair piece with the pictures on the cover? She was no longer a field agent, but rather an office pogue relegated to sharpening pencils and answering the phones. \"The World's Finest\"", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:40:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Ol_Doc: quote: Originally posted by peter3_1: All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too? Funny, the only CIA agent that has been recently outed was outed by the previous administration, if memory serves correct. Was that before or after the Vanity Fair piece with the pictures on the cover? She was no longer a field agent, but rather an office pogue relegated to sharpening pencils and answering the phones. Not according to the CIA which initiated the investigation...but what do they know, you know, faulty intel.", 
        "intTime": 20090421, 
        "postID": 40, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Ol_Doc: quote: Originally posted by peter3_1: All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too? Funny, the only CIA agent that has been recently outed was outed by the previous administration, if memory serves correct. Was that before or after the Vanity Fair piece with the pictures on the cover? She was no longer a field agent, but rather an office pogue relegated to sharpening pencils and answering the phones.", 
        "reply": " Not according to the CIA which initiated the investigation...but what do they know, you know, faulty intel.", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:42:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "It's quite apparent they respect the new President. This message has been edited. Last edited by: stillkit, Thu 23 April 2009 03:53 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090421, 
        "postID": 41, 
        "quote": "", 
        "reply": "It's quite apparent they respect the new President. This message has been edited. Last edited by: stillkit, Thu 23 April 2009 03:53 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 09:30:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: It's quite apparent they respect the new President. They must always respect the office that is held This message has been edited. Last edited by: stillkit, Thu 23 April 2009 03:59 AM", 
        "intTime": 20090421, 
        "postID": 42, 
        "quote": "Originally posted by jack_flats: It's quite apparent they respect the new President.", 
        "reply": " They must always respect the office that is held This message has been edited. Last edited by: stillkit, Thu 23 April 2009 03:59 AM", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 09:42:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by jack_flats: It's quite apparent they respect the new President. They must always respect the office that is held They were not forced to stand and cheer for him. This message has been edited. Last edited by: stillkit, Thu 23 April 2009 03:59 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090421, 
        "postID": 43, 
        "quote": "Originally posted by ss_287: quote: Originally posted by jack_flats: It's quite apparent they respect the new President. They must always respect the office that is held", 
        "reply": " They were not forced to stand and cheer for him. This message has been edited. Last edited by: stillkit, Thu 23 April 2009 03:59 AM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 09:45:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Return to normalcy is appreciated by all.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 44, 
        "quote": "", 
        "reply": "Return to normalcy is appreciated by all.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 09:59:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by ss_287: quote: Originally posted by jack_flats: It's quite apparent they respect the new President. They must always respect the office that is held They were not forced to stand and cheer for him. Right, they have the option of standing up with their hands in their pockets for an incoming President... This message has been edited. Last edited by: stillkit, Thu 23 April 2009 04:00 AM", 
        "intTime": 20090421, 
        "postID": 45, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by ss_287: quote: Originally posted by jack_flats: It's quite apparent they respect the new President. They must always respect the office that is held They were not forced to stand and cheer for him.", 
        "reply": " Right, they have the option of standing up with their hands in their pockets for an incoming President... This message has been edited. Last edited by: stillkit, Thu 23 April 2009 04:00 AM", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:03:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Newsflash: Fed Gubmint employees give the POTUS a warm reception. Wow! This's not only completely unexpected, but totally unprecedented as well!", 
        "intTime": 20090421, 
        "postID": 46, 
        "quote": "", 
        "reply": "Newsflash: Fed Gubmint employees give the POTUS a warm reception. Wow! This's not only completely unexpected, but totally unprecedented as well!", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:10:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by jack_flats: quote: Originally posted by ss_287: quote: Originally posted by jack_flats: ] It's quite apparent they respect the new President. They must always respect the office that is held They were not forced to stand and cheer for him. Right, they have the option of standing up with their hands in their pockets for an incoming President... Everytime the Bush administration ran into trouble they passed the buck to the CIA. Basically they said, \"Why blame us? It's the fault of those who handed us the intelligence?\" No wonder they appreciate Obama (or McCain if he had won.) Dave This message has been edited. Last edited by: stillkit, Thu 23 April 2009 04:00 AM", 
        "intTime": 20090421, 
        "postID": 47, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by jack_flats: quote: Originally posted by ss_287: quote: Originally posted by jack_flats: ] It's quite apparent they respect the new President. They must always respect the office that is held They were not forced to stand and cheer for him. Right, they have the option of standing up with their hands in their pockets for an incoming President...", 
        "reply": " Everytime the Bush administration ran into trouble they passed the buck to the CIA. Basically they said, \"Why blame us? It's the fault of those who handed us the intelligence?\" No wonder they appreciate Obama (or McCain if he had won.) Dave This message has been edited. Last edited by: stillkit, Thu 23 April 2009 04:00 AM", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:11:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Grachus"
    }, 
    {
        "content": "yea they better or their butts will be in a sling next./...", 
        "intTime": 20090421, 
        "postID": 48, 
        "quote": "", 
        "reply": "yea they better or their butts will be in a sling next./...", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:21:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "outlaws93"
    }, 
    {
        "content": "quote: Right, they have the option of standing up with their hands in their pockets for an incoming President... Exactly,, everyone bolts from their seats and goes straight to attn. No matter who the President is.", 
        "intTime": 20090421, 
        "postID": 49, 
        "quote": "Right, they have the option of standing up with their hands in their pockets for an incoming President...", 
        "reply": " Exactly,, everyone bolts from their seats and goes straight to attn. No matter who the President is.", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:22:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: quote: Right, they have the option of standing up with their hands in their pockets for an incoming President... Exactly,, everyone bolts from their seats and goes straight to attn. No matter who the President is. quote: If there were hard feelings, they weren't on public display at the Central Intelligence Agency. Hundreds of agency employees packed the lobby of the original headquarters building to hear Obama and exploded in cheers and applause when he strode in with CIA director Leon Panetta. \"Don't be discouraged by what's happened the last few weeks. Don't be discouraged that we have to acknowledge potentially we have made some mistakes -- that's how we learn,\" Obama said. \"But the fact that we are willing to acknowledge them and then move forward, that is precisely why I am proud to be president of the United States and that's why you should be proud to be members of the CIA.\" Hmm? \"exploded in cheers?\" Maybe they like to hear someone say, \"Don't be discouraged that we have to acknowledge potentially we have made some mistakes -- that's how we learn,\" Obama said.\" As opposed to, (pardon the quotes)\"None of this is our fault, just some incompetents in the CIA. We didn't make ANY mistakes, they did.\" Dave", 
        "intTime": 20090421, 
        "postID": 50, 
        "quote": "Originally posted by BAGodbehere: quote: Right, they have the option of standing up with their hands in their pockets for an incoming President... Exactly,, everyone bolts from their seats and goes straight to attn. No matter who the President is.", 
        "reply": " quote: If there were hard feelings, they weren't on public display at the Central Intelligence Agency. Hundreds of agency employees packed the lobby of the original headquarters building to hear Obama and exploded in cheers and applause when he strode in with CIA director Leon Panetta. \"Don't be discouraged by what's happened the last few weeks. Don't be discouraged that we have to acknowledge potentially we have made some mistakes -- that's how we learn,\" Obama said. \"But the fact that we are willing to acknowledge them and then move forward, that is precisely why I am proud to be president of the United States and that's why you should be proud to be members of the CIA.\" Hmm? \"exploded in cheers?\" Maybe they like to hear someone say, \"Don't be discouraged that we have to acknowledge potentially we have made some mistakes -- that's how we learn,\" Obama said.\" As opposed to, (pardon the quotes)\"None of this is our fault, just some incompetents in the CIA. We didn't make ANY mistakes, they did.\" Dave", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:30:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: quote: Right, they have the option of standing up with their hands in their pockets for an incoming President... Exactly,, everyone bolts from their seats and goes straight to attn. No matter who the President is. They’re civilians, why would they be required to stand at attention? Also, there is a huge difference between standing at attention, and cheering! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 51, 
        "quote": "Originally posted by BAGodbehere: quote: Right, they have the option of standing up with their hands in their pockets for an incoming President... Exactly,, everyone bolts from their seats and goes straight to attn. No matter who the President is.", 
        "reply": " They’re civilians, why would they be required to stand at attention? Also, there is a huge difference between standing at attention, and cheering! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:31:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "NSNN"
    }, 
    {
        "content": "CIA is civilians? What about the Secret Service, FBI, DEA, etc. They are just as much in the Service of the USA than the US Navy. The CIA suffered under President Clinton because the cold war was over and the State department became the clearance center on security matters. Once American citizens being killed, Khobar Towers and the USS Cole suddenly Osama Ben Laden became a household word and the CIA had a new and bigger mission. We've been playing catch up ever since and Homeland secuirty is not producing the results it should. Thank the good Lord there were some grey beards in that crowd at Langley. Asst Director of the CIA was not ecstatic. After being handed your head by a politician simply to disperse critical observations of the weakness of the new leadership comes close to a prosecutional offense more than attaining information savings the lives of Americans. I wish I could have been at the formal meeting that preceded the cheerleading ceremonies.", 
        "intTime": 20090421, 
        "postID": 52, 
        "quote": "", 
        "reply": "CIA is civilians? What about the Secret Service, FBI, DEA, etc. They are just as much in the Service of the USA than the US Navy. The CIA suffered under President Clinton because the cold war was over and the State department became the clearance center on security matters. Once American citizens being killed, Khobar Towers and the USS Cole suddenly Osama Ben Laden became a household word and the CIA had a new and bigger mission. We've been playing catch up ever since and Homeland secuirty is not producing the results it should. Thank the good Lord there were some grey beards in that crowd at Langley. Asst Director of the CIA was not ecstatic. After being handed your head by a politician simply to disperse critical observations of the weakness of the new leadership comes close to a prosecutional offense more than attaining information savings the lives of Americans. I wish I could have been at the formal meeting that preceded the cheerleading ceremonies.", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 10:55:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: They’re civilians, why would they be required to stand at attention? Also, there is a huge difference between standing at attention, and cheering! I understand this, I just wrote the first thing that popped to mind, standing none the less. Cheering,,,whatever they wish to do. Myself, I would stand at attn.", 
        "intTime": 20090421, 
        "postID": 53, 
        "quote": "They’re civilians, why would they be required to stand at attention? Also, there is a huge difference between standing at attention, and cheering!", 
        "reply": " I understand this, I just wrote the first thing that popped to mind, standing none the less. Cheering,,,whatever they wish to do. Myself, I would stand at attn.", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:08:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: CIA is civilians? What about the Secret Service, FBI, DEA, etc. They are just as much in the Service of the USA than the US Navy. So thy are required to stand at attention and salute? The CIA suffered under President Clinton because the cold war was over and the State department became the clearance center on security matters. Once American citizens being killed, Khobar Towers and the USS Cole suddenly Osama Ben Laden became a household word and the CIA had a new and bigger mission. We've been playing catch up ever since and Homeland secuirty is not producing the results it should. Thank the good Lord there were some grey beards in that crowd at Langley. Asst Director of the CIA was not ecstatic. After being handed your head by a politician simply to disperse critical observations of the weakness of the new leadership comes close to a prosecutional offense more than attaining information savings the lives of Americans. I wish I could have been at the formal meeting that preceded the cheerleading ceremonies. What does any of this have to do with CIA’s euphoric welcome of POTUS? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090421, 
        "postID": 54, 
        "quote": "Originally posted by rayevinsonsr: CIA is civilians? What about the Secret Service, FBI, DEA, etc. They are just as much in the Service of the USA than the US Navy. So thy are required to stand at attention and salute? The CIA suffered under President Clinton because the cold war was over and the State department became the clearance center on security matters. Once American citizens being killed, Khobar Towers and the USS Cole suddenly Osama Ben Laden became a household word and the CIA had a new and bigger mission. We've been playing catch up ever since and Homeland secuirty is not producing the results it should. Thank the good Lord there were some grey beards in that crowd at Langley. Asst Director of the CIA was not ecstatic. After being handed your head by a politician simply to disperse critical observations of the weakness of the new leadership comes close to a prosecutional offense more than attaining information savings the lives of Americans. I wish I could have been at the formal meeting that preceded the cheerleading ceremonies. What does any of this have to do with CIA’s euphoric welcome of POTUS?", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:09:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: It's quite apparent they respect the new President. They may respect the Pres., but they didn't like his pick for the director! This message has been edited. Last edited by: stillkit, Thu 23 April 2009 04:01 AM \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090421, 
        "postID": 55, 
        "quote": "Originally posted by jack_flats: It's quite apparent they respect the new President.", 
        "reply": " They may respect the Pres., but they didn't like his pick for the director! This message has been edited. Last edited by: stillkit, Thu 23 April 2009 04:01 AM \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:18:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by rayevinsonsr: CIA is civilians? What about the Secret Service, FBI, DEA, etc. They are just as much in the Service of the USA than the US Navy. So thy are required to stand at attention and salute? The CIA suffered under President Clinton because the cold war was over and the State department became the clearance center on security matters. Once American citizens being killed, Khobar Towers and the USS Cole suddenly Osama Ben Laden became a household word and the CIA had a new and bigger mission. We've been playing catch up ever since and Homeland secuirty is not producing the results it should. Thank the good Lord there were some grey beards in that crowd at Langley. Asst Director of the CIA was not ecstatic. After being handed your head by a politician simply to disperse critical observations of the weakness of the new leadership comes close to a prosecutional offense more than attaining information savings the lives of Americans. I wish I could have been at the formal meeting that preceded the cheerleading ceremonies. What does any of this have to do with CIA’s euphoric welcome of POTUS? Saluting a manifestation in your own mind, I never mentioned it. I don't explain common sense.", 
        "intTime": 20090421, 
        "postID": 56, 
        "quote": "Originally posted by NSNN: quote: Originally posted by rayevinsonsr: CIA is civilians? What about the Secret Service, FBI, DEA, etc. They are just as much in the Service of the USA than the US Navy. So thy are required to stand at attention and salute? The CIA suffered under President Clinton because the cold war was over and the State department became the clearance center on security matters. Once American citizens being killed, Khobar Towers and the USS Cole suddenly Osama Ben Laden became a household word and the CIA had a new and bigger mission. We've been playing catch up ever since and Homeland secuirty is not producing the results it should. Thank the good Lord there were some grey beards in that crowd at Langley. Asst Director of the CIA was not ecstatic. After being handed your head by a politician simply to disperse critical observations of the weakness of the new leadership comes close to a prosecutional offense more than attaining information savings the lives of Americans. I wish I could have been at the formal meeting that preceded the cheerleading ceremonies. What does any of this have to do with CIA’s euphoric welcome of POTUS?", 
        "reply": " Saluting a manifestation in your own mind, I never mentioned it. I don't explain common sense.", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:23:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too?", 
        "intTime": 20090421, 
        "postID": 57, 
        "quote": "", 
        "reply": "All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too?", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:28:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too? Funny, the only CIA agent that has been recently outed was outed by the previous administration, if memory serves correct.", 
        "intTime": 20090421, 
        "postID": 58, 
        "quote": "Originally posted by peter3_1: All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too?", 
        "reply": " Funny, the only CIA agent that has been recently outed was outed by the previous administration, if memory serves correct.", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:32:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by peter3_1: All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too? Funny, the only CIA agent that has been recently outed was outed by the previous administration, if memory serves correct. Was that before or after the Vanity Fair piece with the pictures on the cover? She was no longer a field agent, but rather an office pogue relegated to sharpening pencils and answering the phones. \"The World's Finest\"", 
        "intTime": 20090421, 
        "postID": 59, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by peter3_1: All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too? Funny, the only CIA agent that has been recently outed was outed by the previous administration, if memory serves correct.", 
        "reply": " Was that before or after the Vanity Fair piece with the pictures on the cover? She was no longer a field agent, but rather an office pogue relegated to sharpening pencils and answering the phones. \"The World's Finest\"", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:40:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Ol_Doc: quote: Originally posted by peter3_1: All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too? Funny, the only CIA agent that has been recently outed was outed by the previous administration, if memory serves correct. Was that before or after the Vanity Fair piece with the pictures on the cover? She was no longer a field agent, but rather an office pogue relegated to sharpening pencils and answering the phones. Not according to the CIA which initiated the investigation...but what do they know, you know, faulty intel.", 
        "intTime": 20090421, 
        "postID": 60, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Ol_Doc: quote: Originally posted by peter3_1: All those secret agents there outed now shaking hands with the POTUS...and no outcry from the left....strange, isn't it? Or were they , you know, the secratery pool people, the janitorial staff, public greeters, etc etc? Oh, question, hot links, MILITARY.COM ok, iS ANYTHING from Google ok too? Funny, the only CIA agent that has been recently outed was outed by the previous administration, if memory serves correct. Was that before or after the Vanity Fair piece with the pictures on the cover? She was no longer a field agent, but rather an office pogue relegated to sharpening pencils and answering the phones.", 
        "reply": " Not according to the CIA which initiated the investigation...but what do they know, you know, faulty intel.", 
        "threadID": "672198221_7610073122001", 
        "time": "2009-04-21 11:42:00", 
        "title": "President Obama Given a Euphoric Welcome at CIA", 
        "userID": "Ol_Doc"
    }
]