[
    {
        "content": "Apparently she was still living in denial that he is just not that into her. From the Associated Press: quote: Wife cuffs, bites estranged husband By THE ASSOCIATED PRESS FAIRFIELD, Conn. - A woman attempting to reconcile with her estranged husband handcuffed herself to him as he slept and then bit him on his torso and arms as he phoned for help, police said. Helen Sun, 37, told police she wanted to have a conversation with Robert Drawbough without him leaving. She changed the locks on their bedroom door and, while he was sleeping Monday, handcuffed herself to him, authorities said. Drawbough was able to dial 911 from his cellphone. Nearly out of breath, he told dispatchers he woke up handcuffed, was still bound to his wife and was holding her down, according to a recording released by police. Dispatchers heard Drawbough scream in agony, apparently as his wife bit him. \"Owwww!,\" Drawbough shouts repeatedly. \"Are they almost here? Oh God. I need help!\" Asked by dispatchers why his wife was attacking him, Drawbough said it was because he divorced her, adding that she had a history of violence. Drawbough was treated at a hospital, police said. Sun told investigators that restraining Drawbough was the only way she could get him to speak to her, authorities said. Police charged Sun with third-degree assault, disorderly conduct, reckless endangerment and unlawful restraint. She was being held on $15,000 bond after an appearance Tuesday in Bridgeport Superior Court, according to a court clerk. Sun was represented by a public defender who did not immediately return a message left by The Associated Press. Drawbough has been living in Los Angeles, but returned to Connecticut about a week ago, police said. He told police his wife is obsessive and a danger to him and his friends and family. He said his wife hired private investigators to follow him, according to police. The status of their divorce was unclear. Sun's mother said the couple had...", 
        "intTime": 20090325, 
        "postID": 1, 
        "quote": "Wife cuffs, bites estranged husband By THE ASSOCIATED PRESS FAIRFIELD, Conn. - A woman attempting to reconcile with her estranged husband handcuffed herself to him as he slept and then bit him on his torso and arms as he phoned for help, police said. Helen Sun, 37, told police she wanted to have a conversation with Robert Drawbough without him leaving. She changed the locks on their bedroom door and, while he was sleeping Monday, handcuffed herself to him, authorities said. Drawbough was able to dial 911 from his cellphone. Nearly out of breath, he told dispatchers he woke up handcuffed, was still bound to his wife and was holding her down, according to a recording released by police. Dispatchers heard Drawbough scream in agony, apparently as his wife bit him. \"Owwww!,\" Drawbough shouts repeatedly. \"Are they almost here? Oh God. I need help!\" Asked by dispatchers why his wife was attacking him, Drawbough said it was because he divorced her, adding that she had a history of violence. Drawbough was treated at a hospital, police said. Sun told investigators that restraining Drawbough was the only way she could get him to speak to her, authorities said. Police charged Sun with third-degree assault, disorderly conduct, reckless endangerment and unlawful restraint. She was being held on $15,000 bond after an appearance Tuesday in Bridgeport Superior Court, according to a court clerk. Sun was represented by a public defender who did not immediately return a message left by The Associated Press. Drawbough has been living in Los Angeles, but returned to Connecticut about a week ago, police said. He told police his wife is obsessive and a danger to him and his friends and family. He said his wife hired private investigators to follow him, according to police. The status of their divorce was unclear. Sun's mother said the couple had...", 
        "reply": "Apparently she was still living in denial that he is just not that into her. From the Associated Press: ", 
        "threadID": "672198221_3450029812001", 
        "time": "2009-03-25 21:04:00", 
        "title": "Wife handcuffs self to ex-husband while he's sleeping", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Women....gotta love em...or not", 
        "intTime": 20090325, 
        "postID": 2, 
        "quote": "", 
        "reply": "Women....gotta love em...or not", 
        "threadID": "672198221_3450029812001", 
        "time": "2009-03-25 21:40:00", 
        "title": "Wife handcuffs self to ex-husband while he's sleeping", 
        "userID": "Bad_Moon_Rising"
    }, 
    {
        "content": "\"Misery\" Kathleen Bates wannabe", 
        "intTime": 20090325, 
        "postID": 3, 
        "quote": "", 
        "reply": "\"Misery\" Kathleen Bates wannabe", 
        "threadID": "672198221_3450029812001", 
        "time": "2009-03-25 22:06:00", 
        "title": "Wife handcuffs self to ex-husband while he's sleeping", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "Wow...that story is really strange", 
        "intTime": 20090326, 
        "postID": 4, 
        "quote": "", 
        "reply": "Wow...that story is really strange", 
        "threadID": "672198221_3450029812001", 
        "time": "2009-03-26 08:12:00", 
        "title": "Wife handcuffs self to ex-husband while he's sleeping", 
        "userID": "CombatNAC"
    }, 
    {
        "content": "I heard them talking about this on \"Imus in the Morning\" yesterday. I was wondering if it was one of my three exes? Don", 
        "intTime": 20090326, 
        "postID": 5, 
        "quote": "", 
        "reply": "I heard them talking about this on \"Imus in the Morning\" yesterday. I was wondering if it was one of my three exes? Don", 
        "threadID": "672198221_3450029812001", 
        "time": "2009-03-26 08:16:00", 
        "title": "Wife handcuffs self to ex-husband while he's sleeping", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: I heard them talking about this on \"Imus in the Morning\" yesterday. I was wondering if it was one of my three exes? Don Scary story. Don, did you get the email I sent?", 
        "intTime": 20090326, 
        "postID": 6, 
        "quote": "Originally posted by 21yrsUSCGUSCS: I heard them talking about this on \"Imus in the Morning\" yesterday. I was wondering if it was one of my three exes? Don", 
        "reply": " Scary story. Don, did you get the email I sent?", 
        "threadID": "672198221_3450029812001", 
        "time": "2009-03-26 08:18:00", 
        "title": "Wife handcuffs self to ex-husband while he's sleeping", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: Don, did you get the email I sent? Just saw it....tell him \"Thank You\" for me when you get a chance to speak to him. Don Proud father of a US Marine, Cpl, AAVs", 
        "intTime": 20090326, 
        "postID": 7, 
        "quote": "Originally posted by busnrete8: Don, did you get the email I sent?", 
        "reply": " Just saw it....tell him \"Thank You\" for me when you get a chance to speak to him. Don Proud father of a US Marine, Cpl, AAVs", 
        "threadID": "672198221_3450029812001", 
        "time": "2009-03-26 08:44:00", 
        "title": "Wife handcuffs self to ex-husband while he's sleeping", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "What is up with Connecticut? First it was chimp lady and now this", 
        "intTime": 20090326, 
        "postID": 8, 
        "quote": "", 
        "reply": "What is up with Connecticut? First it was chimp lady and now this", 
        "threadID": "672198221_3450029812001", 
        "time": "2009-03-26 08:46:00", 
        "title": "Wife handcuffs self to ex-husband while he's sleeping", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Adds a new meaning to the \"Ol'ball n Chain\".", 
        "intTime": 20090326, 
        "postID": 9, 
        "quote": "", 
        "reply": "Adds a new meaning to the \"Ol'ball n Chain\".", 
        "threadID": "672198221_3450029812001", 
        "time": "2009-03-26 08:47:00", 
        "title": "Wife handcuffs self to ex-husband while he's sleeping", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "I believe the clinical term for this women is psychoticlingy.", 
        "intTime": 20090326, 
        "postID": 10, 
        "quote": "", 
        "reply": "I believe the clinical term for this women is psychoticlingy.", 
        "threadID": "672198221_3450029812001", 
        "time": "2009-03-26 08:47:00", 
        "title": "Wife handcuffs self to ex-husband while he's sleeping", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by adminnco1: What is up with Connecticut? First it was chimp lady and now this Its gone to the apes bud. Connecticut is just a stepping stone to a full blown planet of the apes!", 
        "intTime": 20090326, 
        "postID": 11, 
        "quote": "Originally posted by adminnco1: What is up with Connecticut? First it was chimp lady and now this", 
        "reply": " Its gone to the apes bud. Connecticut is just a stepping stone to a full blown planet of the apes!", 
        "threadID": "672198221_3450029812001", 
        "time": "2009-03-26 08:49:00", 
        "title": "Wife handcuffs self to ex-husband while he's sleeping", 
        "userID": "NickBrand"
    }, 
    {
        "content": "If i only had a dime for all the times I had to pay a women to handcuff herself to me i'd be a rich man. Did I just say that out loud?", 
        "intTime": 20090326, 
        "postID": 12, 
        "quote": "", 
        "reply": "If i only had a dime for all the times I had to pay a women to handcuff herself to me i'd be a rich man. Did I just say that out loud?", 
        "threadID": "672198221_3450029812001", 
        "time": "2009-03-26 14:27:00", 
        "title": "Wife handcuffs self to ex-husband while he's sleeping", 
        "userID": "shuman14"
    }, 
    {
        "content": "Is she good looking?", 
        "intTime": 20090326, 
        "postID": 13, 
        "quote": "", 
        "reply": "Is she good looking?", 
        "threadID": "672198221_3450029812001", 
        "time": "2009-03-26 14:28:00", 
        "title": "Wife handcuffs self to ex-husband while he's sleeping", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "I heard the 911 tape .. I heard it yesterday on a radio show. Couldnt understand the dude he was crying way to much.", 
        "intTime": 20090327, 
        "postID": 14, 
        "quote": "", 
        "reply": "I heard the 911 tape .. I heard it yesterday on a radio show. Couldnt understand the dude he was crying way to much.", 
        "threadID": "672198221_3450029812001", 
        "time": "2009-03-27 05:41:00", 
        "title": "Wife handcuffs self to ex-husband while he's sleeping", 
        "userID": "meyoumeyou07"
    }, 
    {
        "content": "quote: Originally posted by shuman14: If i only had a dime for all the times I had to pay a women to handcuff herself to me i'd be a rich man. Did I just say that out loud? worse ya typed it. there go your political aspirations...", 
        "intTime": 20090327, 
        "postID": 15, 
        "quote": "Originally posted by shuman14: If i only had a dime for all the times I had to pay a women to handcuff herself to me i'd be a rich man. Did I just say that out loud?", 
        "reply": " worse ya typed it. there go your political aspirations...", 
        "threadID": "672198221_3450029812001", 
        "time": "2009-03-27 07:37:00", 
        "title": "Wife handcuffs self to ex-husband while he's sleeping", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "quote: worse ya typed it. there go your political aspirations...", 
        "intTime": 20090327, 
        "postID": 16, 
        "quote": "worse ya typed it. there go your political aspirations...", 
        "reply": "", 
        "threadID": "672198221_3450029812001", 
        "time": "2009-03-27 09:10:00", 
        "title": "Wife handcuffs self to ex-husband while he's sleeping", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: quote: Originally posted by adminnco1: What is up with Connecticut? First it was chimp lady and now this Its gone to the apes bud. Connecticut is just a stepping stone to a full blown planet of the apes! We left CT just as the state income tax was being implemented and things do not seem to have improved.", 
        "intTime": 20090327, 
        "postID": 17, 
        "quote": "Originally posted by NickBrand: quote: Originally posted by adminnco1: What is up with Connecticut? First it was chimp lady and now this Its gone to the apes bud. Connecticut is just a stepping stone to a full blown planet of the apes!", 
        "reply": " We left CT just as the state income tax was being implemented and things do not seem to have improved.", 
        "threadID": "672198221_3450029812001", 
        "time": "2009-03-27 19:02:00", 
        "title": "Wife handcuffs self to ex-husband while he's sleeping", 
        "userID": "adminnco1"
    }
]