[
    {
        "content": "It wasn't too long ago that the democrats appropriately crowned republicans with the \"culture of corruption\" title. However, in just the past few months, the democrats have gained substantial ground in reclaiming this disgraceful honor. Is this what Obama meant by his \"change\" mantra? Or is this just politics as usual? quote: Democrats took back Congress in 2006 and the presidency in 2008 in no small part because of their ability to bang their spoons on their high chairs about what they called the Republican “culture of corruption.” Their choreographed outrage was coordinated with the precision of a North Korean missile-launch pageant. And, to be fair, they had a point. The GOP did have its legitimate embarrassments. California Rep. Randy “Duke” Cunningham and lobbyist Jack Abramoff were fair game, and so was Rep. Mark Foley, the twisted Florida congressman who allegedly wanted male congressional pages cleaned and perfumed and brought to his tent, as it were. Of course, it wasn’t as if Democrats were without sin. Louisiana Rep. William Jefferson was indicted on fraud, bribery, and corruption charges in 2007, after an investigation unearthed, among other things, $90,000 in his freezer. Then–New York governor Eliot Spitzer was busted in a prostitution scandal. But that’s all yesterday’s news. Let’s look at the here and now. Barack Obama, who vowed he’d provide a transparent administration staffed with disinterested public servants with the self-restraint of Roman castrati, appointed an admitted tax cheat to run the Treasury Department — and he’s hardly the only one in the administration. New York representative Charles Rangel, chairman of the House Ways and Means Committee, is under investigation for, among other things, failing to report income from his Caribbean villa. Meanwhile, Sen. Christopher Dodd, chairman of the Senate Banking Committee, got sweetheart deals from subprime lender Countrywide and has yet to adequately explain his too-good-to-be-true deal on his million-dollar “cottage” in Ireland, which he may have gotten in exchange for finagling a pardon (from President Clinton) for a felon. Oh, Dodd also secretly protected those AIG bonuses that raised such a ruckus. Rep. Jack Murtha of Pennsylvania, Nancy Pelosi’s moral authority on military matters during the Iraq war, has been revealed as a kleptomaniac of sorts, delivering as much of the federal budget as possible to various cronies and lobbyists. Former senator John Edwards, who had an affair even as he was scoring Oprah-points as the supportive husband during his wife’s battle with breast cancer, is being investigated by the feds for the improper use of campaign funds. It looks like the silky-haired champion of the little guys may have used their donations to bribe the alleged “baby mama” into silence. And it would be a shame to let it pass that Obama’s Senate seat was put up for sale by the then-governor of Illinois, Rod Blagojevich. A congressional ethics board is investigating whether Illinois Rep. Jesse Jackson Jr. tried to buy it. But you know what? We ain’t seen nothing yet. For starters, the real corruption isn’t what the media are ignoring or downplaying as isolated incidents. It’s what the media are hailing as strokes of bold, inspirational leadership. The White House, as a matter of policy, is rewriting legal contracts, picking winners (mostly labor unions and mortgage defaulters) and singling out losers (evil “speculators”), while much of the media continue to ponder whether Obama is already a greater president than FDR. If a Republican administration, staffed with cronies from Goldman Sachs and Citibank, were cutting special deals for its political allies, I suspect we’d be hearing fewer FDR analogies and more nouns ending with the suffix “gate.” Take Obama’s “car czar,” Steven Rattner. According to ABC’s Jake Tapper, Rattner is accused of threatening to use the White House to smear a Chrysler creditor if it refused to back the administration’s Chrysler bankruptcy plan. He’s also connected to a massive pension-fund scandal involving the investment firm he used to run. It’s alleged that Rattner’s firm bought the less-than-worthless DVD distribution rights to the achingly awful film Chooch — produced by the brother of an official in the New York comptroller’s office — as a thinly veiled bribe to gain access to New York pensions funds. Chooch, by the way, is Italian slang for “jackass,” which just happens to be the Democrats’ mascot. More to the point, political corruption is inevitable whenever you give hacks — of either party — too much discretion over public funds. Businesses look to Washington for profits instead of to the market. The thing is, this has become the governing philosophy of the Democratic party, from banking and cars to health care and now student loans. The federal government is taking over, and the culture of corruption inevitably trickles down. That in itself should be a scandal. Call it “Choochgate.” Source: \"http://townhall.com/columnists/JonahGoldberg/2009/05/06/trickle-down_corruption\" \"The World's Finest\"", 
        "intTime": 20090506, 
        "postID": 1, 
        "quote": "Democrats took back Congress in 2006 and the presidency in 2008 in no small part because of their ability to bang their spoons on their high chairs about what they called the Republican “culture of corruption.” Their choreographed outrage was coordinated with the precision of a North Korean missile-launch pageant. And, to be fair, they had a point. The GOP did have its legitimate embarrassments. California Rep. Randy “Duke” Cunningham and lobbyist Jack Abramoff were fair game, and so was Rep. Mark Foley, the twisted Florida congressman who allegedly wanted male congressional pages cleaned and perfumed and brought to his tent, as it were. Of course, it wasn’t as if Democrats were without sin. Louisiana Rep. William Jefferson was indicted on fraud, bribery, and corruption charges in 2007, after an investigation unearthed, among other things, $90,000 in his freezer. Then–New York governor Eliot Spitzer was busted in a prostitution scandal. But that’s all yesterday’s news. Let’s look at the here and now. Barack Obama, who vowed he’d provide a transparent administration staffed with disinterested public servants with the self-restraint of Roman castrati, appointed an admitted tax cheat to run the Treasury Department — and he’s hardly the only one in the administration. New York representative Charles Rangel, chairman of the House Ways and Means Committee, is under investigation for, among other things, failing to report income from his Caribbean villa. Meanwhile, Sen. Christopher Dodd, chairman of the Senate Banking Committee, got sweetheart deals from subprime lender Countrywide and has yet to adequately explain his too-good-to-be-true deal on his million-dollar “cottage” in Ireland, which he may have gotten in exchange for finagling a pardon (from President Clinton) for a felon. Oh, Dodd also secretly protected those AIG bonuses that raised such a ruckus. Rep. Jack Murtha of Pennsylvania, Nancy Pelosi’s moral authority on military matters during the Iraq war, has been revealed as a kleptomaniac of sorts, delivering as much of the federal budget as possible to various cronies and lobbyists. Former senator John Edwards, who had an affair even as he was scoring Oprah-points as the supportive husband during his wife’s battle with breast cancer, is being investigated by the feds for the improper use of campaign funds. It looks like the silky-haired champion of the little guys may have used their donations to bribe the alleged “baby mama” into silence. And it would be a shame to let it pass that Obama’s Senate seat was put up for sale by the then-governor of Illinois, Rod Blagojevich. A congressional ethics board is investigating whether Illinois Rep. Jesse Jackson Jr. tried to buy it. But you know what? We ain’t seen nothing yet. For starters, the real corruption isn’t what the media are ignoring or downplaying as isolated incidents. It’s what the media are hailing as strokes of bold, inspirational leadership. The White House, as a matter of policy, is rewriting legal contracts, picking winners (mostly labor unions and mortgage defaulters) and singling out losers (evil “speculators”), while much of the media continue to ponder whether Obama is already a greater president than FDR. If a Republican administration, staffed with cronies from Goldman Sachs and Citibank, were cutting special deals for its political allies, I suspect we’d be hearing fewer FDR analogies and more nouns ending with the suffix “gate.” Take Obama’s “car czar,” Steven Rattner. According to ABC’s Jake Tapper, Rattner is accused of threatening to use the White House to smear a Chrysler creditor if it refused to back the administration’s Chrysler bankruptcy plan. He’s also connected to a massive pension-fund scandal involving the investment firm he used to run. It’s alleged that Rattner’s firm bought the less-than-worthless DVD distribution rights to the achingly awful film Chooch — produced by the brother of an official in the New York comptroller’s office — as a thinly veiled bribe to gain access to New York pensions funds. Chooch, by the way, is Italian slang for “jackass,” which just happens to be the Democrats’ mascot. More to the point, political corruption is inevitable whenever you give hacks — of either party — too much discretion over public funds. Businesses look to Washington for profits instead of to the market. The thing is, this has become the governing philosophy of the Democratic party, from banking and cars to health care and now student loans. The federal government is taking over, and the culture of corruption inevitably trickles down. That in itself should be a scandal. Call it “Choochgate.”", 
        "reply": "It wasn't too long ago that the democrats appropriately crowned republicans with the \"culture of corruption\" title. However, in just the past few months, the democrats have gained substantial ground in reclaiming this disgraceful honor. Is this what Obama meant by his \"change\" mantra? Or is this just politics as usual?  Source: \"http://townhall.com/columnists/JonahGoldberg/2009/05/06/trickle-down_corruption\" \"The World's Finest\"", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 06:06:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Yep, vote republican, we were doing much better then, right?", 
        "intTime": 20090506, 
        "postID": 2, 
        "quote": "", 
        "reply": "Yep, vote republican, we were doing much better then, right?", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 09:36:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: Yep, vote republican, we were doing much better then, right? Come on Doc, is that all you got? For you to come back with the ole, Republicans were worse mantra makes no sense, especially when you consider WHO has truly broken the law, how many were Dems, how many were republicans? It doesn't matter becvause they are both corrupt. Why vote republican, why note vote Independent or Libitarian? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 3, 
        "quote": "Originally posted by Ol_Doc: Yep, vote republican, we were doing much better then, right?", 
        "reply": " Come on Doc, is that all you got? For you to come back with the ole, Republicans were worse mantra makes no sense, especially when you consider WHO has truly broken the law, how many were Dems, how many were republicans? It doesn't matter becvause they are both corrupt. Why vote republican, why note vote Independent or Libitarian? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 09:44:00", 
        "title": "Trickle Down Corruption", 
        "userID": "L0A1"
    }, 
    {
        "content": "Here is a good place that you can post whatever you like and update your profile whenever you like!! Just take the asterisk out when you paste this in your address bar. This message has been edited. Last edited by: <NEMESIS1960>, Wed 06 May 2009 01:48 PM", 
        "intTime": 20090506, 
        "postID": 4, 
        "quote": "", 
        "reply": "Here is a good place that you can post whatever you like and update your profile whenever you like!! Just take the asterisk out when you paste this in your address bar. This message has been edited. Last edited by: <NEMESIS1960>, Wed 06 May 2009 01:48 PM", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 09:46:00", 
        "title": "Trickle Down Corruption", 
        "userID": "ArtyOps"
    }, 
    {
        "content": "quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer.", 
        "intTime": 20090506, 
        "postID": 5, 
        "quote": "Yep, vote republican, we were doing much better then, right?", 
        "reply": " Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer.", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 09:48:00", 
        "title": "Trickle Down Corruption", 
        "userID": "ACR26"
    }, 
    {
        "content": "That whole screed is pretty thin gruel. Walt", 
        "intTime": 20090506, 
        "postID": 6, 
        "quote": "", 
        "reply": "That whole screed is pretty thin gruel. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:13:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by ArtyOps: Here is a good place that you can post whatever you like and update your profile whenever you like!! \"http://u*smilnet.com/smf/index.php?action=forum\" Just take the asterisk out when you paste this in your address bar. You are gonna get a slap for your hotlink and for advertising another site. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 7, 
        "quote": "Originally posted by ArtyOps: Here is a good place that you can post whatever you like and update your profile whenever you like!! \"http://u*smilnet.com/smf/index.php?action=forum\" Just take the asterisk out when you paste this in your address bar.", 
        "reply": " You are gonna get a slap for your hotlink and for advertising another site. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:23:00", 
        "title": "Trickle Down Corruption", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument.", 
        "intTime": 20090506, 
        "postID": 8, 
        "quote": "Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer.", 
        "reply": " Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument.", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:29:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I've been waiting for it.", 
        "intTime": 20090506, 
        "postID": 9, 
        "quote": "", 
        "reply": "I've been waiting for it.", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:31:00", 
        "title": "Trickle Down Corruption", 
        "userID": "ArtyOps"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something?", 
        "intTime": 20090506, 
        "postID": 10, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument.", 
        "reply": " I don't recall Bill Clinton being impeached. Did I miss something?", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:36:00", 
        "title": "Trickle Down Corruption", 
        "userID": "ArtyOps"
    }, 
    {
        "content": "Let's go down memory lane. Consider the Nixon administration where the president himself had to be pardoned and the attorney general - highest law enforcment officer - actually went to prison. There were lots of others. Oh, and Reagan - this is just for Iran-Contra. Summary of Prosecutions After Independent Counsel Lawrence E. Walsh's appointment in December 1986, 14 persons were charged with criminal offenses. Eleven persons were convicted, but two convictions were overturned on appeal. Two persons were pardoned before trial and one case was dismissed when the Bush Administration declined to declassify information necessary for trial. On December 24, 1992, President Bush pardoned Caspar W. Weinberger, Duane R. Clarridge, Clair E. George, Elliott Abrams, Alan D. Fiers, Jr., and Robert C. McFarlane. Completed Trials and Pleas Elliott Abrams -- Pleaded guilty October 7, 1991, to two misdemeanor charges of withholding information from Congress about secret government efforts to support the Nicaraguan contra rebels during a ban on such aid. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced Abrams November 15, 1991, to two years probation and 100 hours community service. Abrams was pardoned December 24, 1992. Carl R. Channell -- Pleaded guilty April 29, 1987, to one felony count of conspiracy to defraud the United States. U.S. District Judge Stanley S. Harris sentenced Channell on July 7, 1989, to two years probation. Thomas G. Clines -- Indicted February 22, 1990, on four felony counts of underreporting his earnings to the IRS in the 1985 and 1986 tax years; and falsely stating on his 1985 and 1986 tax returns that he had no foreign financial accounts. On September 18, 1990, Clines was found guilty of all charges. U.S. District Judge Norman P. Ramsey in Baltimore, Md., on December 13, 1990, sentenced Clines to 16 months in prison and $40,000 in fines. He was ordered to pay the cost of the prosecution. The Fourth Circuit U.S. Court of Appeals in Richmond, Va., on February 27, 1992, upheld the convictions. Clines served his prison sentence. Alan D. Fiers, Jr. -- Pleaded guilty July 9, 1991, to two misdemeanor counts of withholding information from Congress about secret efforts to aid the Nicaraguan contras. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced Fiers January 31, 1992, to one year probation and 100 hours community service. Fiers was pardoned December 24, 1992. Clair E. George -- Indicted September 6, 1991, on 10 counts of perjury, false statements and obstruction in connection with congressional and Grand Jury investigations. George's trial on nine counts ended in a mistrial on August 26, 1992. Following a second trial on seven counts, George was found guilty December 9, 1992, of two felony charges of false statements and perjury before Congress. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Royce C. Lamberth set sentencing for February 18, 1993. George was pardoned on December 24, 1992, before sentencing occurred. Albert Hakim -- Pleaded guilty November 21, 1989, to a misdemeanor of supplementing the salary of Oliver L. North. Lake Resources Inc., in which Hakim was the principal shareholder, pleaded guilty to a corporate felony of theft of government property in diverting Iran arms sales proceeds to the Nicaraguan contras and other activities. Hakim was sentenced by U.S. District Judge Gerhard A. Gesell on February 1, 1990, to two years probation and a $5,000 fine; Lake Resources was ordered dissolved. Robert C. McFarlane -- Pleaded guilty March 11, 1988, to four misdemeanor counts of withholding information from Congress. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced McFarlane on March 3, 1989, to two years probation, $20,000 in fines and 200 hours community service. McFarlane was pardoned December 24, 1992. Richard R. Miller -- Pleaded guilty May 6, 1987, to one felony count of conspiracy to defraud the United States. U.S. District Judge Stanley S. Harris sentenced Miller on July 6, 1989, to two years probation and 120 hours of community service. Oliver L. North -- Indicted March 16, 1988, on 16 felony counts. After standing trial on 12, North was convicted May 4, 1989 of three charges: accepting an illegal gratuity, aiding and abetting in the obstruction of a congressional inquiry, and destruction of documents. He was sentenced by U.S. District Judge Gerhard A. Gesell on July 5, 1989, to a three-year suspended prison term, two years probation, $150,000 in fines and 1,200 hours community service. A three-judge appeals panel on July 20, 1990, vacated North's conviction for further proceedings to determine whether his immunized testimony influenced witnesses in the trial. The Supreme Court declined to review the case. Judge Gesell dismissed the case September 16, 1991, after hearings on the immunity issue, on the motion of Independent Counsel. John M. Poindexter -- Indicted March 16, 1988, on seven felony charges. After standing trial on five charges, Poindexter was found guilty April 7, 1990, on all counts: conspiracy (obstruction of inquiries and proceedings, false statements, falsification, destruction and removal of documents); two counts of obstruction of Congress and two counts of false statements. U.S. District Judge Harold H. Greene sentenced Poindexter June 11, 1990, to six months in prison on each count, to be served concurrently. A three-judge appeals panel on November 15, 1991, reversed the convictions on the ground that Poindexter's immunized testimony may have influenced the trial testimony of witnesses. The Supreme Court on December 7, 1992, declined to review the case. In 1993, the indictment was dismissed on the motion of Independent Counsel. Richard V. Secord -- Indicted March 16, 1988 on six felony charges. On May 11, 1989, a second indictment was issued charging nine counts of impeding and obstructing the Select Iran/contra Committees. Secord was scheduled to stand trial on 12 charges. He pleaded guilty November 8, 1989, to one felony count of false statements to Congress. Secord was sentenced by U.S. District Chief Judge Aubrey E. Robinson, Jr., on January 24, 1990, to two years probation. Pre-trial Pardons Duane R. Clarridge -- Indicted November 26, 1991, on seven counts of perjury and false statements about a secret shipment of U.S. HAWK missiles to Iran. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Harold H. Greene set a March 15, 1993, trial date. Clarridge was pardoned December 24, 1992. Caspar W. Weinberger -- Indicted June 16, 1992, on five counts of obstruction, perjury and false statements in connection with congressional and Independent Counsel investigations of Iran/ contra. On September 29, the obstruction count was dismissed. On October 30, a second indictment was issued, charging one false statement count. The second indictment was dismissed December 11, leaving four counts remaining. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Thomas F. Hogan set a January 5, 1993, trial date. Weinberger was pardoned December 24, 1992. Dismissal Joseph F. Fernandez -- Indicted June 20, 1988 on five counts of conspiracy to defraud the United States, obstructing the inquiry of the Tower Commission and making false statements to government agencies. The case was dismissed in the District of Columbia for venue reasons on the motion of Independent Counsel. A four-count indictment was issued in the Eastern District of Virginia on April 24, 1989. U.S. District Judge Claude M. Hilton dismissed the four-count case November 24, 1989, after Attorney General Richard Thornburgh blocked the disclosure of classified information ruled relevant to the defense. The U.S. Court of Appeals for the Fourth Circuit in Richmond, Va., on September 6, 1990, upheld Judge Hilton's rulings under the Classified Information Procedures Act (CIPA). On October 12, 1990, the Attorney General filed a final declaration that he would not disclose the classified information. -------------------- Oh, and the above John Poindexter is same the guy the Bushies thought would be a great pick to run the Total Information Awareness part of their domestic spying operation. This article about Obama -- One of his picks didn't pay his taxes correctly? What a hoot for the pathetic peeps attacking PResident Obama. Walt", 
        "intTime": 20090506, 
        "postID": 11, 
        "quote": "", 
        "reply": "Let's go down memory lane. Consider the Nixon administration where the president himself had to be pardoned and the attorney general - highest law enforcment officer - actually went to prison. There were lots of others. Oh, and Reagan - this is just for Iran-Contra. Summary of Prosecutions After Independent Counsel Lawrence E. Walsh's appointment in December 1986, 14 persons were charged with criminal offenses. Eleven persons were convicted, but two convictions were overturned on appeal. Two persons were pardoned before trial and one case was dismissed when the Bush Administration declined to declassify information necessary for trial. On December 24, 1992, President Bush pardoned Caspar W. Weinberger, Duane R. Clarridge, Clair E. George, Elliott Abrams, Alan D. Fiers, Jr., and Robert C. McFarlane. Completed Trials and Pleas Elliott Abrams -- Pleaded guilty October 7, 1991, to two misdemeanor charges of withholding information from Congress about secret government efforts to support the Nicaraguan contra rebels during a ban on such aid. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced Abrams November 15, 1991, to two years probation and 100 hours community service. Abrams was pardoned December 24, 1992. Carl R. Channell -- Pleaded guilty April 29, 1987, to one felony count of conspiracy to defraud the United States. U.S. District Judge Stanley S. Harris sentenced Channell on July 7, 1989, to two years probation. Thomas G. Clines -- Indicted February 22, 1990, on four felony counts of underreporting his earnings to the IRS in the 1985 and 1986 tax years; and falsely stating on his 1985 and 1986 tax returns that he had no foreign financial accounts. On September 18, 1990, Clines was found guilty of all charges. U.S. District Judge Norman P. Ramsey in Baltimore, Md., on December 13, 1990, sentenced Clines to 16 months in prison and $40,000 in fines. He was ordered to pay the cost of the prosecution. The Fourth Circuit U.S. Court of Appeals in Richmond, Va., on February 27, 1992, upheld the convictions. Clines served his prison sentence. Alan D. Fiers, Jr. -- Pleaded guilty July 9, 1991, to two misdemeanor counts of withholding information from Congress about secret efforts to aid the Nicaraguan contras. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced Fiers January 31, 1992, to one year probation and 100 hours community service. Fiers was pardoned December 24, 1992. Clair E. George -- Indicted September 6, 1991, on 10 counts of perjury, false statements and obstruction in connection with congressional and Grand Jury investigations. George's trial on nine counts ended in a mistrial on August 26, 1992. Following a second trial on seven counts, George was found guilty December 9, 1992, of two felony charges of false statements and perjury before Congress. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Royce C. Lamberth set sentencing for February 18, 1993. George was pardoned on December 24, 1992, before sentencing occurred. Albert Hakim -- Pleaded guilty November 21, 1989, to a misdemeanor of supplementing the salary of Oliver L. North. Lake Resources Inc., in which Hakim was the principal shareholder, pleaded guilty to a corporate felony of theft of government property in diverting Iran arms sales proceeds to the Nicaraguan contras and other activities. Hakim was sentenced by U.S. District Judge Gerhard A. Gesell on February 1, 1990, to two years probation and a $5,000 fine; Lake Resources was ordered dissolved. Robert C. McFarlane -- Pleaded guilty March 11, 1988, to four misdemeanor counts of withholding information from Congress. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced McFarlane on March 3, 1989, to two years probation, $20,000 in fines and 200 hours community service. McFarlane was pardoned December 24, 1992. Richard R. Miller -- Pleaded guilty May 6, 1987, to one felony count of conspiracy to defraud the United States. U.S. District Judge Stanley S. Harris sentenced Miller on July 6, 1989, to two years probation and 120 hours of community service. Oliver L. North -- Indicted March 16, 1988, on 16 felony counts. After standing trial on 12, North was convicted May 4, 1989 of three charges: accepting an illegal gratuity, aiding and abetting in the obstruction of a congressional inquiry, and destruction of documents. He was sentenced by U.S. District Judge Gerhard A. Gesell on July 5, 1989, to a three-year suspended prison term, two years probation, $150,000 in fines and 1,200 hours community service. A three-judge appeals panel on July 20, 1990, vacated North's conviction for further proceedings to determine whether his immunized testimony influenced witnesses in the trial. The Supreme Court declined to review the case. Judge Gesell dismissed the case September 16, 1991, after hearings on the immunity issue, on the motion of Independent Counsel. John M. Poindexter -- Indicted March 16, 1988, on seven felony charges. After standing trial on five charges, Poindexter was found guilty April 7, 1990, on all counts: conspiracy (obstruction of inquiries and proceedings, false statements, falsification, destruction and removal of documents); two counts of obstruction of Congress and two counts of false statements. U.S. District Judge Harold H. Greene sentenced Poindexter June 11, 1990, to six months in prison on each count, to be served concurrently. A three-judge appeals panel on November 15, 1991, reversed the convictions on the ground that Poindexter's immunized testimony may have influenced the trial testimony of witnesses. The Supreme Court on December 7, 1992, declined to review the case. In 1993, the indictment was dismissed on the motion of Independent Counsel. Richard V. Secord -- Indicted March 16, 1988 on six felony charges. On May 11, 1989, a second indictment was issued charging nine counts of impeding and obstructing the Select Iran/contra Committees. Secord was scheduled to stand trial on 12 charges. He pleaded guilty November 8, 1989, to one felony count of false statements to Congress. Secord was sentenced by U.S. District Chief Judge Aubrey E. Robinson, Jr., on January 24, 1990, to two years probation. Pre-trial Pardons Duane R. Clarridge -- Indicted November 26, 1991, on seven counts of perjury and false statements about a secret shipment of U.S. HAWK missiles to Iran. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Harold H. Greene set a March 15, 1993, trial date. Clarridge was pardoned December 24, 1992. Caspar W. Weinberger -- Indicted June 16, 1992, on five counts of obstruction, perjury and false statements in connection with congressional and Independent Counsel investigations of Iran/ contra. On September 29, the obstruction count was dismissed. On October 30, a second indictment was issued, charging one false statement count. The second indictment was dismissed December 11, leaving four counts remaining. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Thomas F. Hogan set a January 5, 1993, trial date. Weinberger was pardoned December 24, 1992. Dismissal Joseph F. Fernandez -- Indicted June 20, 1988 on five counts of conspiracy to defraud the United States, obstructing the inquiry of the Tower Commission and making false statements to government agencies. The case was dismissed in the District of Columbia for venue reasons on the motion of Independent Counsel. A four-count indictment was issued in the Eastern District of Virginia on April 24, 1989. U.S. District Judge Claude M. Hilton dismissed the four-count case November 24, 1989, after Attorney General Richard Thornburgh blocked the disclosure of classified information ruled relevant to the defense. The U.S. Court of Appeals for the Fourth Circuit in Richmond, Va., on September 6, 1990, upheld Judge Hilton's rulings under the Classified Information Procedures Act (CIPA). On October 12, 1990, the Attorney General filed a final declaration that he would not disclose the classified information. -------------------- Oh, and the above John Poindexter is same the guy the Bushies thought would be a great pick to run the Total Information Awareness part of their domestic spying operation. This article about Obama -- One of his picks didn't pay his taxes correctly? What a hoot for the pathetic peeps attacking PResident Obama. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:40:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt", 
        "intTime": 20090506, 
        "postID": 12, 
        "quote": "Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something?", 
        "reply": " Yes, civics class. CLinton was impeached, but not convicted. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:41:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Reagan had by far the most corrupt administration ever. \"By the end of his term, 138 Reagan administration officials had been convicted, had been indicted, or had been the subject of official investigations for official misconduct and/or criminal violations. In terms of number of officials involved, the record of his administration was the worst ever.\" 1. Lyn Nofziger--White House Press Secretary - Convicted on charges of illegal lobbying of White House in Wedtech scandal. The lobbying would not have been illegal had he not been White House Press Secretary. 2. Michael Deaver, Reagan's Chief of Staff, received three years' probation and was fined one hundred thousand dollars after being convicted for lying to a congressional subcommittee and a federal grand jury about his lobbying activities after leaving the White House. Same as with Lyn Nofziger. 3. James Watt, Reagan's Secretary of the Interior was indicted on 41 felony counts for using connections at the Department of Housing and Urban Development to help his private clients seek federal funds for housing projects in Maryland, New Jersey, Massachusetts, Puerto Rico and the Virgin Islands. Watt conceded that he had received $500,000 from clients who were granted very favorable housing contracts after he had intervened on their behalf. Watt was eventually sentenced to five years in prison and 500 hours of community service. 4. John Poindexter, Reagan's national security advisor, guilty of five criminal counts involving conspiracy to mislead Congress, obstructing congressional inquiries, lying to lawmakers, used \"high national security\" to mask deceit and wrong-doing... 5. Richard Secord pleaded guilty to a felony charge of lying to Congress over Iran-Contra. Appointed by William Casey to assist Oliver North. 6. Elliott Abrams was appointed by President Reagan in 1985 to head the State Department's Latin American Bureau. He was closely linked with ex-White House aide Lt. Col. Oliver North's covert movement to aid the Contras. Working for North, Abrams coordinated inter-agency support for the contras and helped solicit illegal funding from foreign powers as well as domestic contributors. Abrams agreed to cooperate with Iran-Contra investigators and pled guilty to two charges reduced to misdemeanors. He was sentenced in 1991 to two years probation and 100 hours of community service but was pardoned by President George Bush... 7. Robert C. McFarlane, Reagan's National Security Advisor, pled guilty to four misdemeanors and was sentenced to two years probation and 200 hours of community service. He was also fined $20,000. He received a blanket pardon from President George Bush... 8. Alan D. Fiers was the Chief of the Central Intelligence Agency's Central American Task Force. Fiers pled guilty in 1991 to two counts of withholding information from congress about Oliver North's activities and the diversion of Iran arms sale money to aid the Contras. He was sentenced to one year of probation and 100 hours of community service. Alan Fiers received a blanket pardon for his crimes from President Bush... Thomas G. Clines: convicted of four counts of tax-related offenses for failing to report income from the operations; Carl R. Channel - Office of Public Diplomacy , partner in International Business- first person convicted in the Iran/Contra scandal, pleaded guilty of one count of defrauding the United States Richard R. Miller - Partner with Oliver North in IBC, a Office of Public Diplomacy front group, convicted of conspiracy to defraud the United States. Frank Gomez 13.. Donald Fortier Clair George was Chief of the CIA's Division of Covert Operations under President Reagan. George was convicted of lying to two congressional committees in 1986. George faced a maximum five year federal prison sentence and a $20,000 fine for each of the two convictions. Jurors cleared George of five other charges including two counts of lying to a federal grand jury. Clair George received a blanket pardon for his crimes from President George Bush... Rita Lavelle was indicted, tried and convicted of lying to Congress and served three months of a six-month prison sentence. Philip Winn - Assistant HUD Secretary. Pleaded guilty to one count of scheming to give illegal gratuities. Thomas Demery - Assistand HUD Secretary - pleaded guilty to steering HUD subsidies to politically connected donors. Deborah Gore Dean - executive assistant to Samuel Pierce - indicted on thirteen counts, three counts of conspiracy, one count of accepting an illegal gratuity, four counts of perjury, and five counts of concealing articles. She was convicted on twelve accounts. She appealed and prevailed on several accounts but the convictions for conspiracy remained. Catalina Villaponda - Former US Treasurer Joseph A. Strauss - Accepting kickbacks from developers ------------- More at the link. >http://www.dailykos.com/story/2005/10/17/194133/16< Walt", 
        "intTime": 20090506, 
        "postID": 13, 
        "quote": "", 
        "reply": "Reagan had by far the most corrupt administration ever. \"By the end of his term, 138 Reagan administration officials had been convicted, had been indicted, or had been the subject of official investigations for official misconduct and/or criminal violations. In terms of number of officials involved, the record of his administration was the worst ever.\" 1. Lyn Nofziger--White House Press Secretary - Convicted on charges of illegal lobbying of White House in Wedtech scandal. The lobbying would not have been illegal had he not been White House Press Secretary. 2. Michael Deaver, Reagan's Chief of Staff, received three years' probation and was fined one hundred thousand dollars after being convicted for lying to a congressional subcommittee and a federal grand jury about his lobbying activities after leaving the White House. Same as with Lyn Nofziger. 3. James Watt, Reagan's Secretary of the Interior was indicted on 41 felony counts for using connections at the Department of Housing and Urban Development to help his private clients seek federal funds for housing projects in Maryland, New Jersey, Massachusetts, Puerto Rico and the Virgin Islands. Watt conceded that he had received $500,000 from clients who were granted very favorable housing contracts after he had intervened on their behalf. Watt was eventually sentenced to five years in prison and 500 hours of community service. 4. John Poindexter, Reagan's national security advisor, guilty of five criminal counts involving conspiracy to mislead Congress, obstructing congressional inquiries, lying to lawmakers, used \"high national security\" to mask deceit and wrong-doing... 5. Richard Secord pleaded guilty to a felony charge of lying to Congress over Iran-Contra. Appointed by William Casey to assist Oliver North. 6. Elliott Abrams was appointed by President Reagan in 1985 to head the State Department's Latin American Bureau. He was closely linked with ex-White House aide Lt. Col. Oliver North's covert movement to aid the Contras. Working for North, Abrams coordinated inter-agency support for the contras and helped solicit illegal funding from foreign powers as well as domestic contributors. Abrams agreed to cooperate with Iran-Contra investigators and pled guilty to two charges reduced to misdemeanors. He was sentenced in 1991 to two years probation and 100 hours of community service but was pardoned by President George Bush... 7. Robert C. McFarlane, Reagan's National Security Advisor, pled guilty to four misdemeanors and was sentenced to two years probation and 200 hours of community service. He was also fined $20,000. He received a blanket pardon from President George Bush... 8. Alan D. Fiers was the Chief of the Central Intelligence Agency's Central American Task Force. Fiers pled guilty in 1991 to two counts of withholding information from congress about Oliver North's activities and the diversion of Iran arms sale money to aid the Contras. He was sentenced to one year of probation and 100 hours of community service. Alan Fiers received a blanket pardon for his crimes from President Bush... Thomas G. Clines: convicted of four counts of tax-related offenses for failing to report income from the operations; Carl R. Channel - Office of Public Diplomacy , partner in International Business- first person convicted in the Iran/Contra scandal, pleaded guilty of one count of defrauding the United States Richard R. Miller - Partner with Oliver North in IBC, a Office of Public Diplomacy front group, convicted of conspiracy to defraud the United States. Frank Gomez 13.. Donald Fortier Clair George was Chief of the CIA's Division of Covert Operations under President Reagan. George was convicted of lying to two congressional committees in 1986. George faced a maximum five year federal prison sentence and a $20,000 fine for each of the two convictions. Jurors cleared George of five other charges including two counts of lying to a federal grand jury. Clair George received a blanket pardon for his crimes from President George Bush... Rita Lavelle was indicted, tried and convicted of lying to Congress and served three months of a six-month prison sentence. Philip Winn - Assistant HUD Secretary. Pleaded guilty to one count of scheming to give illegal gratuities. Thomas Demery - Assistand HUD Secretary - pleaded guilty to steering HUD subsidies to politically connected donors. Deborah Gore Dean - executive assistant to Samuel Pierce - indicted on thirteen counts, three counts of conspiracy, one count of accepting an illegal gratuity, four counts of perjury, and five counts of concealing articles. She was convicted on twelve accounts. She appealed and prevailed on several accounts but the convictions for conspiracy remained. Catalina Villaponda - Former US Treasurer Joseph A. Strauss - Accepting kickbacks from developers ------------- More at the link. >http://www.dailykos.com/story/2005/10/17/194133/16< Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:46:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt Now now, don't be hard on him. They don't teach civics in school anymore. Apearently \"how our government works\" isn't important enough to spend the time and trouble.", 
        "intTime": 20090506, 
        "postID": 14, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt", 
        "reply": " Now now, don't be hard on him. They don't teach civics in school anymore. Apearently \"how our government works\" isn't important enough to spend the time and trouble.", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:02:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL", 
        "intTime": 20090506, 
        "postID": 15, 
        "quote": "Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt", 
        "reply": " XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:03:00", 
        "title": "Trickle Down Corruption", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL >shrug< Nixon was pardoned, which by definition includes admission of guilt. Walt", 
        "intTime": 20090506, 
        "postID": 16, 
        "quote": "Originally posted by LineDoggie: quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL", 
        "reply": " >shrug< Nixon was pardoned, which by definition includes admission of guilt. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:22:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Impeachment is the first of two stages in a specific process for a legislative body to consider whether or not to forcibly remove a government official from office. The impeachment itself brings the charges against the government. Impeachment does not necessarily result in removal from office; it is only a legal statement of charges, parallel to an indictment in criminal law. An official who is impeached faces a second legislative vote (whether by the same body or another), which determines conviction, or failure to convict, on the charges embodied by the impeachment. \"http://en.wikipedia.org/wiki/Impeachment\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090506, 
        "postID": 17, 
        "quote": "Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something?", 
        "reply": " Impeachment is the first of two stages in a specific process for a legislative body to consider whether or not to forcibly remove a government official from office. The impeachment itself brings the charges against the government. Impeachment does not necessarily result in removal from office; it is only a legal statement of charges, parallel to an indictment in criminal law. An official who is impeached faces a second legislative vote (whether by the same body or another), which determines conviction, or failure to convict, on the charges embodied by the impeachment. \"http://en.wikipedia.org/wiki/Impeachment\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:26:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by WhiskeyPapa: quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt Now now, don't be hard on him. They don't teach civics in school anymore. Apearently \"how our government works\" isn't important enough to spend the time and trouble. Well, any American should certainly know that Andrew Johnson was impeached and his trial fell one vote short of conviction. If you don't know the history, you can't be a good citizen. It takes more than just putting out flags and yellow ribbons. And you have to care about what is done in your name. Walt", 
        "intTime": 20090506, 
        "postID": 18, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by WhiskeyPapa: quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt Now now, don't be hard on him. They don't teach civics in school anymore. Apearently \"how our government works\" isn't important enough to spend the time and trouble.", 
        "reply": " Well, any American should certainly know that Andrew Johnson was impeached and his trial fell one vote short of conviction. If you don't know the history, you can't be a good citizen. It takes more than just putting out flags and yellow ribbons. And you have to care about what is done in your name. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:30:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by LineDoggie: quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL >shrug< Nixon was pardoned, which by definition includes admission of guilt. Walt >Sigh< Nixons Pardon had no consequence on the Supreme Courts ability to hand down a Disbarrment. His pardon would have stopped Potential Criminal consequences", 
        "intTime": 20090506, 
        "postID": 19, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by LineDoggie: quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL >shrug< Nixon was pardoned, which by definition includes admission of guilt. Walt", 
        "reply": " >Sigh< Nixons Pardon had no consequence on the Supreme Courts ability to hand down a Disbarrment. His pardon would have stopped Potential Criminal consequences", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:33:00", 
        "title": "Trickle Down Corruption", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Sorry guys. The facts have a liberal bias. Walt", 
        "intTime": 20090506, 
        "postID": 20, 
        "quote": "", 
        "reply": "Sorry guys. The facts have a liberal bias. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:48:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "It wasn't too long ago that the democrats appropriately crowned republicans with the \"culture of corruption\" title. However, in just the past few months, the democrats have gained substantial ground in reclaiming this disgraceful honor. Is this what Obama meant by his \"change\" mantra? Or is this just politics as usual? quote: Democrats took back Congress in 2006 and the presidency in 2008 in no small part because of their ability to bang their spoons on their high chairs about what they called the Republican “culture of corruption.” Their choreographed outrage was coordinated with the precision of a North Korean missile-launch pageant. And, to be fair, they had a point. The GOP did have its legitimate embarrassments. California Rep. Randy “Duke” Cunningham and lobbyist Jack Abramoff were fair game, and so was Rep. Mark Foley, the twisted Florida congressman who allegedly wanted male congressional pages cleaned and perfumed and brought to his tent, as it were. Of course, it wasn’t as if Democrats were without sin. Louisiana Rep. William Jefferson was indicted on fraud, bribery, and corruption charges in 2007, after an investigation unearthed, among other things, $90,000 in his freezer. Then–New York governor Eliot Spitzer was busted in a prostitution scandal. But that’s all yesterday’s news. Let’s look at the here and now. Barack Obama, who vowed he’d provide a transparent administration staffed with disinterested public servants with the self-restraint of Roman castrati, appointed an admitted tax cheat to run the Treasury Department — and he’s hardly the only one in the administration. New York representative Charles Rangel, chairman of the House Ways and Means Committee, is under investigation for, among other things, failing to report income from his Caribbean villa. Meanwhile, Sen. Christopher Dodd, chairman of the Senate Banking Committee, got sweetheart deals from subprime lender Countrywide and has yet to adequately explain his too-good-to-be-true deal on his million-dollar “cottage” in Ireland, which he may have gotten in exchange for finagling a pardon (from President Clinton) for a felon. Oh, Dodd also secretly protected those AIG bonuses that raised such a ruckus. Rep. Jack Murtha of Pennsylvania, Nancy Pelosi’s moral authority on military matters during the Iraq war, has been revealed as a kleptomaniac of sorts, delivering as much of the federal budget as possible to various cronies and lobbyists. Former senator John Edwards, who had an affair even as he was scoring Oprah-points as the supportive husband during his wife’s battle with breast cancer, is being investigated by the feds for the improper use of campaign funds. It looks like the silky-haired champion of the little guys may have used their donations to bribe the alleged “baby mama” into silence. And it would be a shame to let it pass that Obama’s Senate seat was put up for sale by the then-governor of Illinois, Rod Blagojevich. A congressional ethics board is investigating whether Illinois Rep. Jesse Jackson Jr. tried to buy it. But you know what? We ain’t seen nothing yet. For starters, the real corruption isn’t what the media are ignoring or downplaying as isolated incidents. It’s what the media are hailing as strokes of bold, inspirational leadership. The White House, as a matter of policy, is rewriting legal contracts, picking winners (mostly labor unions and mortgage defaulters) and singling out losers (evil “speculators”), while much of the media continue to ponder whether Obama is already a greater president than FDR. If a Republican administration, staffed with cronies from Goldman Sachs and Citibank, were cutting special deals for its political allies, I suspect we’d be hearing fewer FDR analogies and more nouns ending with the suffix “gate.” Take Obama’s “car czar,” Steven Rattner. According to ABC’s Jake Tapper, Rattner is accused of threatening to use the White House to smear a Chrysler creditor if it refused to back the administration’s Chrysler bankruptcy plan. He’s also connected to a massive pension-fund scandal involving the investment firm he used to run. It’s alleged that Rattner’s firm bought the less-than-worthless DVD distribution rights to the achingly awful film Chooch — produced by the brother of an official in the New York comptroller’s office — as a thinly veiled bribe to gain access to New York pensions funds. Chooch, by the way, is Italian slang for “jackass,” which just happens to be the Democrats’ mascot. More to the point, political corruption is inevitable whenever you give hacks — of either party — too much discretion over public funds. Businesses look to Washington for profits instead of to the market. The thing is, this has become the governing philosophy of the Democratic party, from banking and cars to health care and now student loans. The federal government is taking over, and the culture of corruption inevitably trickles down. That in itself should be a scandal. Call it “Choochgate.” Source: \"http://townhall.com/columnists/JonahGoldberg/2009/05/06/trickle-down_corruption\" \"The World's Finest\"", 
        "intTime": 20090506, 
        "postID": 21, 
        "quote": "Democrats took back Congress in 2006 and the presidency in 2008 in no small part because of their ability to bang their spoons on their high chairs about what they called the Republican “culture of corruption.” Their choreographed outrage was coordinated with the precision of a North Korean missile-launch pageant. And, to be fair, they had a point. The GOP did have its legitimate embarrassments. California Rep. Randy “Duke” Cunningham and lobbyist Jack Abramoff were fair game, and so was Rep. Mark Foley, the twisted Florida congressman who allegedly wanted male congressional pages cleaned and perfumed and brought to his tent, as it were. Of course, it wasn’t as if Democrats were without sin. Louisiana Rep. William Jefferson was indicted on fraud, bribery, and corruption charges in 2007, after an investigation unearthed, among other things, $90,000 in his freezer. Then–New York governor Eliot Spitzer was busted in a prostitution scandal. But that’s all yesterday’s news. Let’s look at the here and now. Barack Obama, who vowed he’d provide a transparent administration staffed with disinterested public servants with the self-restraint of Roman castrati, appointed an admitted tax cheat to run the Treasury Department — and he’s hardly the only one in the administration. New York representative Charles Rangel, chairman of the House Ways and Means Committee, is under investigation for, among other things, failing to report income from his Caribbean villa. Meanwhile, Sen. Christopher Dodd, chairman of the Senate Banking Committee, got sweetheart deals from subprime lender Countrywide and has yet to adequately explain his too-good-to-be-true deal on his million-dollar “cottage” in Ireland, which he may have gotten in exchange for finagling a pardon (from President Clinton) for a felon. Oh, Dodd also secretly protected those AIG bonuses that raised such a ruckus. Rep. Jack Murtha of Pennsylvania, Nancy Pelosi’s moral authority on military matters during the Iraq war, has been revealed as a kleptomaniac of sorts, delivering as much of the federal budget as possible to various cronies and lobbyists. Former senator John Edwards, who had an affair even as he was scoring Oprah-points as the supportive husband during his wife’s battle with breast cancer, is being investigated by the feds for the improper use of campaign funds. It looks like the silky-haired champion of the little guys may have used their donations to bribe the alleged “baby mama” into silence. And it would be a shame to let it pass that Obama’s Senate seat was put up for sale by the then-governor of Illinois, Rod Blagojevich. A congressional ethics board is investigating whether Illinois Rep. Jesse Jackson Jr. tried to buy it. But you know what? We ain’t seen nothing yet. For starters, the real corruption isn’t what the media are ignoring or downplaying as isolated incidents. It’s what the media are hailing as strokes of bold, inspirational leadership. The White House, as a matter of policy, is rewriting legal contracts, picking winners (mostly labor unions and mortgage defaulters) and singling out losers (evil “speculators”), while much of the media continue to ponder whether Obama is already a greater president than FDR. If a Republican administration, staffed with cronies from Goldman Sachs and Citibank, were cutting special deals for its political allies, I suspect we’d be hearing fewer FDR analogies and more nouns ending with the suffix “gate.” Take Obama’s “car czar,” Steven Rattner. According to ABC’s Jake Tapper, Rattner is accused of threatening to use the White House to smear a Chrysler creditor if it refused to back the administration’s Chrysler bankruptcy plan. He’s also connected to a massive pension-fund scandal involving the investment firm he used to run. It’s alleged that Rattner’s firm bought the less-than-worthless DVD distribution rights to the achingly awful film Chooch — produced by the brother of an official in the New York comptroller’s office — as a thinly veiled bribe to gain access to New York pensions funds. Chooch, by the way, is Italian slang for “jackass,” which just happens to be the Democrats’ mascot. More to the point, political corruption is inevitable whenever you give hacks — of either party — too much discretion over public funds. Businesses look to Washington for profits instead of to the market. The thing is, this has become the governing philosophy of the Democratic party, from banking and cars to health care and now student loans. The federal government is taking over, and the culture of corruption inevitably trickles down. That in itself should be a scandal. Call it “Choochgate.”", 
        "reply": "It wasn't too long ago that the democrats appropriately crowned republicans with the \"culture of corruption\" title. However, in just the past few months, the democrats have gained substantial ground in reclaiming this disgraceful honor. Is this what Obama meant by his \"change\" mantra? Or is this just politics as usual?  Source: \"http://townhall.com/columnists/JonahGoldberg/2009/05/06/trickle-down_corruption\" \"The World's Finest\"", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 06:06:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Yep, vote republican, we were doing much better then, right?", 
        "intTime": 20090506, 
        "postID": 22, 
        "quote": "", 
        "reply": "Yep, vote republican, we were doing much better then, right?", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 09:36:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: Yep, vote republican, we were doing much better then, right? Come on Doc, is that all you got? For you to come back with the ole, Republicans were worse mantra makes no sense, especially when you consider WHO has truly broken the law, how many were Dems, how many were republicans? It doesn't matter becvause they are both corrupt. Why vote republican, why note vote Independent or Libitarian? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 23, 
        "quote": "Originally posted by Ol_Doc: Yep, vote republican, we were doing much better then, right?", 
        "reply": " Come on Doc, is that all you got? For you to come back with the ole, Republicans were worse mantra makes no sense, especially when you consider WHO has truly broken the law, how many were Dems, how many were republicans? It doesn't matter becvause they are both corrupt. Why vote republican, why note vote Independent or Libitarian? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 09:44:00", 
        "title": "Trickle Down Corruption", 
        "userID": "L0A1"
    }, 
    {
        "content": "Here is a good place that you can post whatever you like and update your profile whenever you like!! Just take the asterisk out when you paste this in your address bar. This message has been edited. Last edited by: <NEMESIS1960>, Wed 06 May 2009 01:48 PM", 
        "intTime": 20090506, 
        "postID": 24, 
        "quote": "", 
        "reply": "Here is a good place that you can post whatever you like and update your profile whenever you like!! Just take the asterisk out when you paste this in your address bar. This message has been edited. Last edited by: <NEMESIS1960>, Wed 06 May 2009 01:48 PM", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 09:46:00", 
        "title": "Trickle Down Corruption", 
        "userID": "ArtyOps"
    }, 
    {
        "content": "quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer.", 
        "intTime": 20090506, 
        "postID": 25, 
        "quote": "Yep, vote republican, we were doing much better then, right?", 
        "reply": " Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer.", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 09:48:00", 
        "title": "Trickle Down Corruption", 
        "userID": "ACR26"
    }, 
    {
        "content": "That whole screed is pretty thin gruel. Walt", 
        "intTime": 20090506, 
        "postID": 26, 
        "quote": "", 
        "reply": "That whole screed is pretty thin gruel. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:13:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by ArtyOps: Here is a good place that you can post whatever you like and update your profile whenever you like!! \"http://u*smilnet.com/smf/index.php?action=forum\" Just take the asterisk out when you paste this in your address bar. You are gonna get a slap for your hotlink and for advertising another site. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 27, 
        "quote": "Originally posted by ArtyOps: Here is a good place that you can post whatever you like and update your profile whenever you like!! \"http://u*smilnet.com/smf/index.php?action=forum\" Just take the asterisk out when you paste this in your address bar.", 
        "reply": " You are gonna get a slap for your hotlink and for advertising another site. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:23:00", 
        "title": "Trickle Down Corruption", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument.", 
        "intTime": 20090506, 
        "postID": 28, 
        "quote": "Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer.", 
        "reply": " Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument.", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:29:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I've been waiting for it.", 
        "intTime": 20090506, 
        "postID": 29, 
        "quote": "", 
        "reply": "I've been waiting for it.", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:31:00", 
        "title": "Trickle Down Corruption", 
        "userID": "ArtyOps"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something?", 
        "intTime": 20090506, 
        "postID": 30, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument.", 
        "reply": " I don't recall Bill Clinton being impeached. Did I miss something?", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:36:00", 
        "title": "Trickle Down Corruption", 
        "userID": "ArtyOps"
    }, 
    {
        "content": "Let's go down memory lane. Consider the Nixon administration where the president himself had to be pardoned and the attorney general - highest law enforcment officer - actually went to prison. There were lots of others. Oh, and Reagan - this is just for Iran-Contra. Summary of Prosecutions After Independent Counsel Lawrence E. Walsh's appointment in December 1986, 14 persons were charged with criminal offenses. Eleven persons were convicted, but two convictions were overturned on appeal. Two persons were pardoned before trial and one case was dismissed when the Bush Administration declined to declassify information necessary for trial. On December 24, 1992, President Bush pardoned Caspar W. Weinberger, Duane R. Clarridge, Clair E. George, Elliott Abrams, Alan D. Fiers, Jr., and Robert C. McFarlane. Completed Trials and Pleas Elliott Abrams -- Pleaded guilty October 7, 1991, to two misdemeanor charges of withholding information from Congress about secret government efforts to support the Nicaraguan contra rebels during a ban on such aid. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced Abrams November 15, 1991, to two years probation and 100 hours community service. Abrams was pardoned December 24, 1992. Carl R. Channell -- Pleaded guilty April 29, 1987, to one felony count of conspiracy to defraud the United States. U.S. District Judge Stanley S. Harris sentenced Channell on July 7, 1989, to two years probation. Thomas G. Clines -- Indicted February 22, 1990, on four felony counts of underreporting his earnings to the IRS in the 1985 and 1986 tax years; and falsely stating on his 1985 and 1986 tax returns that he had no foreign financial accounts. On September 18, 1990, Clines was found guilty of all charges. U.S. District Judge Norman P. Ramsey in Baltimore, Md., on December 13, 1990, sentenced Clines to 16 months in prison and $40,000 in fines. He was ordered to pay the cost of the prosecution. The Fourth Circuit U.S. Court of Appeals in Richmond, Va., on February 27, 1992, upheld the convictions. Clines served his prison sentence. Alan D. Fiers, Jr. -- Pleaded guilty July 9, 1991, to two misdemeanor counts of withholding information from Congress about secret efforts to aid the Nicaraguan contras. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced Fiers January 31, 1992, to one year probation and 100 hours community service. Fiers was pardoned December 24, 1992. Clair E. George -- Indicted September 6, 1991, on 10 counts of perjury, false statements and obstruction in connection with congressional and Grand Jury investigations. George's trial on nine counts ended in a mistrial on August 26, 1992. Following a second trial on seven counts, George was found guilty December 9, 1992, of two felony charges of false statements and perjury before Congress. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Royce C. Lamberth set sentencing for February 18, 1993. George was pardoned on December 24, 1992, before sentencing occurred. Albert Hakim -- Pleaded guilty November 21, 1989, to a misdemeanor of supplementing the salary of Oliver L. North. Lake Resources Inc., in which Hakim was the principal shareholder, pleaded guilty to a corporate felony of theft of government property in diverting Iran arms sales proceeds to the Nicaraguan contras and other activities. Hakim was sentenced by U.S. District Judge Gerhard A. Gesell on February 1, 1990, to two years probation and a $5,000 fine; Lake Resources was ordered dissolved. Robert C. McFarlane -- Pleaded guilty March 11, 1988, to four misdemeanor counts of withholding information from Congress. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced McFarlane on March 3, 1989, to two years probation, $20,000 in fines and 200 hours community service. McFarlane was pardoned December 24, 1992. Richard R. Miller -- Pleaded guilty May 6, 1987, to one felony count of conspiracy to defraud the United States. U.S. District Judge Stanley S. Harris sentenced Miller on July 6, 1989, to two years probation and 120 hours of community service. Oliver L. North -- Indicted March 16, 1988, on 16 felony counts. After standing trial on 12, North was convicted May 4, 1989 of three charges: accepting an illegal gratuity, aiding and abetting in the obstruction of a congressional inquiry, and destruction of documents. He was sentenced by U.S. District Judge Gerhard A. Gesell on July 5, 1989, to a three-year suspended prison term, two years probation, $150,000 in fines and 1,200 hours community service. A three-judge appeals panel on July 20, 1990, vacated North's conviction for further proceedings to determine whether his immunized testimony influenced witnesses in the trial. The Supreme Court declined to review the case. Judge Gesell dismissed the case September 16, 1991, after hearings on the immunity issue, on the motion of Independent Counsel. John M. Poindexter -- Indicted March 16, 1988, on seven felony charges. After standing trial on five charges, Poindexter was found guilty April 7, 1990, on all counts: conspiracy (obstruction of inquiries and proceedings, false statements, falsification, destruction and removal of documents); two counts of obstruction of Congress and two counts of false statements. U.S. District Judge Harold H. Greene sentenced Poindexter June 11, 1990, to six months in prison on each count, to be served concurrently. A three-judge appeals panel on November 15, 1991, reversed the convictions on the ground that Poindexter's immunized testimony may have influenced the trial testimony of witnesses. The Supreme Court on December 7, 1992, declined to review the case. In 1993, the indictment was dismissed on the motion of Independent Counsel. Richard V. Secord -- Indicted March 16, 1988 on six felony charges. On May 11, 1989, a second indictment was issued charging nine counts of impeding and obstructing the Select Iran/contra Committees. Secord was scheduled to stand trial on 12 charges. He pleaded guilty November 8, 1989, to one felony count of false statements to Congress. Secord was sentenced by U.S. District Chief Judge Aubrey E. Robinson, Jr., on January 24, 1990, to two years probation. Pre-trial Pardons Duane R. Clarridge -- Indicted November 26, 1991, on seven counts of perjury and false statements about a secret shipment of U.S. HAWK missiles to Iran. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Harold H. Greene set a March 15, 1993, trial date. Clarridge was pardoned December 24, 1992. Caspar W. Weinberger -- Indicted June 16, 1992, on five counts of obstruction, perjury and false statements in connection with congressional and Independent Counsel investigations of Iran/ contra. On September 29, the obstruction count was dismissed. On October 30, a second indictment was issued, charging one false statement count. The second indictment was dismissed December 11, leaving four counts remaining. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Thomas F. Hogan set a January 5, 1993, trial date. Weinberger was pardoned December 24, 1992. Dismissal Joseph F. Fernandez -- Indicted June 20, 1988 on five counts of conspiracy to defraud the United States, obstructing the inquiry of the Tower Commission and making false statements to government agencies. The case was dismissed in the District of Columbia for venue reasons on the motion of Independent Counsel. A four-count indictment was issued in the Eastern District of Virginia on April 24, 1989. U.S. District Judge Claude M. Hilton dismissed the four-count case November 24, 1989, after Attorney General Richard Thornburgh blocked the disclosure of classified information ruled relevant to the defense. The U.S. Court of Appeals for the Fourth Circuit in Richmond, Va., on September 6, 1990, upheld Judge Hilton's rulings under the Classified Information Procedures Act (CIPA). On October 12, 1990, the Attorney General filed a final declaration that he would not disclose the classified information. -------------------- Oh, and the above John Poindexter is same the guy the Bushies thought would be a great pick to run the Total Information Awareness part of their domestic spying operation. This article about Obama -- One of his picks didn't pay his taxes correctly? What a hoot for the pathetic peeps attacking PResident Obama. Walt", 
        "intTime": 20090506, 
        "postID": 31, 
        "quote": "", 
        "reply": "Let's go down memory lane. Consider the Nixon administration where the president himself had to be pardoned and the attorney general - highest law enforcment officer - actually went to prison. There were lots of others. Oh, and Reagan - this is just for Iran-Contra. Summary of Prosecutions After Independent Counsel Lawrence E. Walsh's appointment in December 1986, 14 persons were charged with criminal offenses. Eleven persons were convicted, but two convictions were overturned on appeal. Two persons were pardoned before trial and one case was dismissed when the Bush Administration declined to declassify information necessary for trial. On December 24, 1992, President Bush pardoned Caspar W. Weinberger, Duane R. Clarridge, Clair E. George, Elliott Abrams, Alan D. Fiers, Jr., and Robert C. McFarlane. Completed Trials and Pleas Elliott Abrams -- Pleaded guilty October 7, 1991, to two misdemeanor charges of withholding information from Congress about secret government efforts to support the Nicaraguan contra rebels during a ban on such aid. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced Abrams November 15, 1991, to two years probation and 100 hours community service. Abrams was pardoned December 24, 1992. Carl R. Channell -- Pleaded guilty April 29, 1987, to one felony count of conspiracy to defraud the United States. U.S. District Judge Stanley S. Harris sentenced Channell on July 7, 1989, to two years probation. Thomas G. Clines -- Indicted February 22, 1990, on four felony counts of underreporting his earnings to the IRS in the 1985 and 1986 tax years; and falsely stating on his 1985 and 1986 tax returns that he had no foreign financial accounts. On September 18, 1990, Clines was found guilty of all charges. U.S. District Judge Norman P. Ramsey in Baltimore, Md., on December 13, 1990, sentenced Clines to 16 months in prison and $40,000 in fines. He was ordered to pay the cost of the prosecution. The Fourth Circuit U.S. Court of Appeals in Richmond, Va., on February 27, 1992, upheld the convictions. Clines served his prison sentence. Alan D. Fiers, Jr. -- Pleaded guilty July 9, 1991, to two misdemeanor counts of withholding information from Congress about secret efforts to aid the Nicaraguan contras. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced Fiers January 31, 1992, to one year probation and 100 hours community service. Fiers was pardoned December 24, 1992. Clair E. George -- Indicted September 6, 1991, on 10 counts of perjury, false statements and obstruction in connection with congressional and Grand Jury investigations. George's trial on nine counts ended in a mistrial on August 26, 1992. Following a second trial on seven counts, George was found guilty December 9, 1992, of two felony charges of false statements and perjury before Congress. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Royce C. Lamberth set sentencing for February 18, 1993. George was pardoned on December 24, 1992, before sentencing occurred. Albert Hakim -- Pleaded guilty November 21, 1989, to a misdemeanor of supplementing the salary of Oliver L. North. Lake Resources Inc., in which Hakim was the principal shareholder, pleaded guilty to a corporate felony of theft of government property in diverting Iran arms sales proceeds to the Nicaraguan contras and other activities. Hakim was sentenced by U.S. District Judge Gerhard A. Gesell on February 1, 1990, to two years probation and a $5,000 fine; Lake Resources was ordered dissolved. Robert C. McFarlane -- Pleaded guilty March 11, 1988, to four misdemeanor counts of withholding information from Congress. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced McFarlane on March 3, 1989, to two years probation, $20,000 in fines and 200 hours community service. McFarlane was pardoned December 24, 1992. Richard R. Miller -- Pleaded guilty May 6, 1987, to one felony count of conspiracy to defraud the United States. U.S. District Judge Stanley S. Harris sentenced Miller on July 6, 1989, to two years probation and 120 hours of community service. Oliver L. North -- Indicted March 16, 1988, on 16 felony counts. After standing trial on 12, North was convicted May 4, 1989 of three charges: accepting an illegal gratuity, aiding and abetting in the obstruction of a congressional inquiry, and destruction of documents. He was sentenced by U.S. District Judge Gerhard A. Gesell on July 5, 1989, to a three-year suspended prison term, two years probation, $150,000 in fines and 1,200 hours community service. A three-judge appeals panel on July 20, 1990, vacated North's conviction for further proceedings to determine whether his immunized testimony influenced witnesses in the trial. The Supreme Court declined to review the case. Judge Gesell dismissed the case September 16, 1991, after hearings on the immunity issue, on the motion of Independent Counsel. John M. Poindexter -- Indicted March 16, 1988, on seven felony charges. After standing trial on five charges, Poindexter was found guilty April 7, 1990, on all counts: conspiracy (obstruction of inquiries and proceedings, false statements, falsification, destruction and removal of documents); two counts of obstruction of Congress and two counts of false statements. U.S. District Judge Harold H. Greene sentenced Poindexter June 11, 1990, to six months in prison on each count, to be served concurrently. A three-judge appeals panel on November 15, 1991, reversed the convictions on the ground that Poindexter's immunized testimony may have influenced the trial testimony of witnesses. The Supreme Court on December 7, 1992, declined to review the case. In 1993, the indictment was dismissed on the motion of Independent Counsel. Richard V. Secord -- Indicted March 16, 1988 on six felony charges. On May 11, 1989, a second indictment was issued charging nine counts of impeding and obstructing the Select Iran/contra Committees. Secord was scheduled to stand trial on 12 charges. He pleaded guilty November 8, 1989, to one felony count of false statements to Congress. Secord was sentenced by U.S. District Chief Judge Aubrey E. Robinson, Jr., on January 24, 1990, to two years probation. Pre-trial Pardons Duane R. Clarridge -- Indicted November 26, 1991, on seven counts of perjury and false statements about a secret shipment of U.S. HAWK missiles to Iran. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Harold H. Greene set a March 15, 1993, trial date. Clarridge was pardoned December 24, 1992. Caspar W. Weinberger -- Indicted June 16, 1992, on five counts of obstruction, perjury and false statements in connection with congressional and Independent Counsel investigations of Iran/ contra. On September 29, the obstruction count was dismissed. On October 30, a second indictment was issued, charging one false statement count. The second indictment was dismissed December 11, leaving four counts remaining. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Thomas F. Hogan set a January 5, 1993, trial date. Weinberger was pardoned December 24, 1992. Dismissal Joseph F. Fernandez -- Indicted June 20, 1988 on five counts of conspiracy to defraud the United States, obstructing the inquiry of the Tower Commission and making false statements to government agencies. The case was dismissed in the District of Columbia for venue reasons on the motion of Independent Counsel. A four-count indictment was issued in the Eastern District of Virginia on April 24, 1989. U.S. District Judge Claude M. Hilton dismissed the four-count case November 24, 1989, after Attorney General Richard Thornburgh blocked the disclosure of classified information ruled relevant to the defense. The U.S. Court of Appeals for the Fourth Circuit in Richmond, Va., on September 6, 1990, upheld Judge Hilton's rulings under the Classified Information Procedures Act (CIPA). On October 12, 1990, the Attorney General filed a final declaration that he would not disclose the classified information. -------------------- Oh, and the above John Poindexter is same the guy the Bushies thought would be a great pick to run the Total Information Awareness part of their domestic spying operation. This article about Obama -- One of his picks didn't pay his taxes correctly? What a hoot for the pathetic peeps attacking PResident Obama. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:40:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt", 
        "intTime": 20090506, 
        "postID": 32, 
        "quote": "Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something?", 
        "reply": " Yes, civics class. CLinton was impeached, but not convicted. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:41:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Reagan had by far the most corrupt administration ever. \"By the end of his term, 138 Reagan administration officials had been convicted, had been indicted, or had been the subject of official investigations for official misconduct and/or criminal violations. In terms of number of officials involved, the record of his administration was the worst ever.\" 1. Lyn Nofziger--White House Press Secretary - Convicted on charges of illegal lobbying of White House in Wedtech scandal. The lobbying would not have been illegal had he not been White House Press Secretary. 2. Michael Deaver, Reagan's Chief of Staff, received three years' probation and was fined one hundred thousand dollars after being convicted for lying to a congressional subcommittee and a federal grand jury about his lobbying activities after leaving the White House. Same as with Lyn Nofziger. 3. James Watt, Reagan's Secretary of the Interior was indicted on 41 felony counts for using connections at the Department of Housing and Urban Development to help his private clients seek federal funds for housing projects in Maryland, New Jersey, Massachusetts, Puerto Rico and the Virgin Islands. Watt conceded that he had received $500,000 from clients who were granted very favorable housing contracts after he had intervened on their behalf. Watt was eventually sentenced to five years in prison and 500 hours of community service. 4. John Poindexter, Reagan's national security advisor, guilty of five criminal counts involving conspiracy to mislead Congress, obstructing congressional inquiries, lying to lawmakers, used \"high national security\" to mask deceit and wrong-doing... 5. Richard Secord pleaded guilty to a felony charge of lying to Congress over Iran-Contra. Appointed by William Casey to assist Oliver North. 6. Elliott Abrams was appointed by President Reagan in 1985 to head the State Department's Latin American Bureau. He was closely linked with ex-White House aide Lt. Col. Oliver North's covert movement to aid the Contras. Working for North, Abrams coordinated inter-agency support for the contras and helped solicit illegal funding from foreign powers as well as domestic contributors. Abrams agreed to cooperate with Iran-Contra investigators and pled guilty to two charges reduced to misdemeanors. He was sentenced in 1991 to two years probation and 100 hours of community service but was pardoned by President George Bush... 7. Robert C. McFarlane, Reagan's National Security Advisor, pled guilty to four misdemeanors and was sentenced to two years probation and 200 hours of community service. He was also fined $20,000. He received a blanket pardon from President George Bush... 8. Alan D. Fiers was the Chief of the Central Intelligence Agency's Central American Task Force. Fiers pled guilty in 1991 to two counts of withholding information from congress about Oliver North's activities and the diversion of Iran arms sale money to aid the Contras. He was sentenced to one year of probation and 100 hours of community service. Alan Fiers received a blanket pardon for his crimes from President Bush... Thomas G. Clines: convicted of four counts of tax-related offenses for failing to report income from the operations; Carl R. Channel - Office of Public Diplomacy , partner in International Business- first person convicted in the Iran/Contra scandal, pleaded guilty of one count of defrauding the United States Richard R. Miller - Partner with Oliver North in IBC, a Office of Public Diplomacy front group, convicted of conspiracy to defraud the United States. Frank Gomez 13.. Donald Fortier Clair George was Chief of the CIA's Division of Covert Operations under President Reagan. George was convicted of lying to two congressional committees in 1986. George faced a maximum five year federal prison sentence and a $20,000 fine for each of the two convictions. Jurors cleared George of five other charges including two counts of lying to a federal grand jury. Clair George received a blanket pardon for his crimes from President George Bush... Rita Lavelle was indicted, tried and convicted of lying to Congress and served three months of a six-month prison sentence. Philip Winn - Assistant HUD Secretary. Pleaded guilty to one count of scheming to give illegal gratuities. Thomas Demery - Assistand HUD Secretary - pleaded guilty to steering HUD subsidies to politically connected donors. Deborah Gore Dean - executive assistant to Samuel Pierce - indicted on thirteen counts, three counts of conspiracy, one count of accepting an illegal gratuity, four counts of perjury, and five counts of concealing articles. She was convicted on twelve accounts. She appealed and prevailed on several accounts but the convictions for conspiracy remained. Catalina Villaponda - Former US Treasurer Joseph A. Strauss - Accepting kickbacks from developers ------------- More at the link. >http://www.dailykos.com/story/2005/10/17/194133/16< Walt", 
        "intTime": 20090506, 
        "postID": 33, 
        "quote": "", 
        "reply": "Reagan had by far the most corrupt administration ever. \"By the end of his term, 138 Reagan administration officials had been convicted, had been indicted, or had been the subject of official investigations for official misconduct and/or criminal violations. In terms of number of officials involved, the record of his administration was the worst ever.\" 1. Lyn Nofziger--White House Press Secretary - Convicted on charges of illegal lobbying of White House in Wedtech scandal. The lobbying would not have been illegal had he not been White House Press Secretary. 2. Michael Deaver, Reagan's Chief of Staff, received three years' probation and was fined one hundred thousand dollars after being convicted for lying to a congressional subcommittee and a federal grand jury about his lobbying activities after leaving the White House. Same as with Lyn Nofziger. 3. James Watt, Reagan's Secretary of the Interior was indicted on 41 felony counts for using connections at the Department of Housing and Urban Development to help his private clients seek federal funds for housing projects in Maryland, New Jersey, Massachusetts, Puerto Rico and the Virgin Islands. Watt conceded that he had received $500,000 from clients who were granted very favorable housing contracts after he had intervened on their behalf. Watt was eventually sentenced to five years in prison and 500 hours of community service. 4. John Poindexter, Reagan's national security advisor, guilty of five criminal counts involving conspiracy to mislead Congress, obstructing congressional inquiries, lying to lawmakers, used \"high national security\" to mask deceit and wrong-doing... 5. Richard Secord pleaded guilty to a felony charge of lying to Congress over Iran-Contra. Appointed by William Casey to assist Oliver North. 6. Elliott Abrams was appointed by President Reagan in 1985 to head the State Department's Latin American Bureau. He was closely linked with ex-White House aide Lt. Col. Oliver North's covert movement to aid the Contras. Working for North, Abrams coordinated inter-agency support for the contras and helped solicit illegal funding from foreign powers as well as domestic contributors. Abrams agreed to cooperate with Iran-Contra investigators and pled guilty to two charges reduced to misdemeanors. He was sentenced in 1991 to two years probation and 100 hours of community service but was pardoned by President George Bush... 7. Robert C. McFarlane, Reagan's National Security Advisor, pled guilty to four misdemeanors and was sentenced to two years probation and 200 hours of community service. He was also fined $20,000. He received a blanket pardon from President George Bush... 8. Alan D. Fiers was the Chief of the Central Intelligence Agency's Central American Task Force. Fiers pled guilty in 1991 to two counts of withholding information from congress about Oliver North's activities and the diversion of Iran arms sale money to aid the Contras. He was sentenced to one year of probation and 100 hours of community service. Alan Fiers received a blanket pardon for his crimes from President Bush... Thomas G. Clines: convicted of four counts of tax-related offenses for failing to report income from the operations; Carl R. Channel - Office of Public Diplomacy , partner in International Business- first person convicted in the Iran/Contra scandal, pleaded guilty of one count of defrauding the United States Richard R. Miller - Partner with Oliver North in IBC, a Office of Public Diplomacy front group, convicted of conspiracy to defraud the United States. Frank Gomez 13.. Donald Fortier Clair George was Chief of the CIA's Division of Covert Operations under President Reagan. George was convicted of lying to two congressional committees in 1986. George faced a maximum five year federal prison sentence and a $20,000 fine for each of the two convictions. Jurors cleared George of five other charges including two counts of lying to a federal grand jury. Clair George received a blanket pardon for his crimes from President George Bush... Rita Lavelle was indicted, tried and convicted of lying to Congress and served three months of a six-month prison sentence. Philip Winn - Assistant HUD Secretary. Pleaded guilty to one count of scheming to give illegal gratuities. Thomas Demery - Assistand HUD Secretary - pleaded guilty to steering HUD subsidies to politically connected donors. Deborah Gore Dean - executive assistant to Samuel Pierce - indicted on thirteen counts, three counts of conspiracy, one count of accepting an illegal gratuity, four counts of perjury, and five counts of concealing articles. She was convicted on twelve accounts. She appealed and prevailed on several accounts but the convictions for conspiracy remained. Catalina Villaponda - Former US Treasurer Joseph A. Strauss - Accepting kickbacks from developers ------------- More at the link. >http://www.dailykos.com/story/2005/10/17/194133/16< Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:46:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt Now now, don't be hard on him. They don't teach civics in school anymore. Apearently \"how our government works\" isn't important enough to spend the time and trouble.", 
        "intTime": 20090506, 
        "postID": 34, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt", 
        "reply": " Now now, don't be hard on him. They don't teach civics in school anymore. Apearently \"how our government works\" isn't important enough to spend the time and trouble.", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:02:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL", 
        "intTime": 20090506, 
        "postID": 35, 
        "quote": "Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt", 
        "reply": " XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:03:00", 
        "title": "Trickle Down Corruption", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL >shrug< Nixon was pardoned, which by definition includes admission of guilt. Walt", 
        "intTime": 20090506, 
        "postID": 36, 
        "quote": "Originally posted by LineDoggie: quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL", 
        "reply": " >shrug< Nixon was pardoned, which by definition includes admission of guilt. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:22:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Impeachment is the first of two stages in a specific process for a legislative body to consider whether or not to forcibly remove a government official from office. The impeachment itself brings the charges against the government. Impeachment does not necessarily result in removal from office; it is only a legal statement of charges, parallel to an indictment in criminal law. An official who is impeached faces a second legislative vote (whether by the same body or another), which determines conviction, or failure to convict, on the charges embodied by the impeachment. \"http://en.wikipedia.org/wiki/Impeachment\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090506, 
        "postID": 37, 
        "quote": "Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something?", 
        "reply": " Impeachment is the first of two stages in a specific process for a legislative body to consider whether or not to forcibly remove a government official from office. The impeachment itself brings the charges against the government. Impeachment does not necessarily result in removal from office; it is only a legal statement of charges, parallel to an indictment in criminal law. An official who is impeached faces a second legislative vote (whether by the same body or another), which determines conviction, or failure to convict, on the charges embodied by the impeachment. \"http://en.wikipedia.org/wiki/Impeachment\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:26:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by WhiskeyPapa: quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt Now now, don't be hard on him. They don't teach civics in school anymore. Apearently \"how our government works\" isn't important enough to spend the time and trouble. Well, any American should certainly know that Andrew Johnson was impeached and his trial fell one vote short of conviction. If you don't know the history, you can't be a good citizen. It takes more than just putting out flags and yellow ribbons. And you have to care about what is done in your name. Walt", 
        "intTime": 20090506, 
        "postID": 38, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by WhiskeyPapa: quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt Now now, don't be hard on him. They don't teach civics in school anymore. Apearently \"how our government works\" isn't important enough to spend the time and trouble.", 
        "reply": " Well, any American should certainly know that Andrew Johnson was impeached and his trial fell one vote short of conviction. If you don't know the history, you can't be a good citizen. It takes more than just putting out flags and yellow ribbons. And you have to care about what is done in your name. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:30:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by LineDoggie: quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL >shrug< Nixon was pardoned, which by definition includes admission of guilt. Walt >Sigh< Nixons Pardon had no consequence on the Supreme Courts ability to hand down a Disbarrment. His pardon would have stopped Potential Criminal consequences", 
        "intTime": 20090506, 
        "postID": 39, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by LineDoggie: quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL >shrug< Nixon was pardoned, which by definition includes admission of guilt. Walt", 
        "reply": " >Sigh< Nixons Pardon had no consequence on the Supreme Courts ability to hand down a Disbarrment. His pardon would have stopped Potential Criminal consequences", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:33:00", 
        "title": "Trickle Down Corruption", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Sorry guys. The facts have a liberal bias. Walt", 
        "intTime": 20090506, 
        "postID": 40, 
        "quote": "", 
        "reply": "Sorry guys. The facts have a liberal bias. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:48:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "It wasn't too long ago that the democrats appropriately crowned republicans with the \"culture of corruption\" title. However, in just the past few months, the democrats have gained substantial ground in reclaiming this disgraceful honor. Is this what Obama meant by his \"change\" mantra? Or is this just politics as usual? quote: Democrats took back Congress in 2006 and the presidency in 2008 in no small part because of their ability to bang their spoons on their high chairs about what they called the Republican “culture of corruption.” Their choreographed outrage was coordinated with the precision of a North Korean missile-launch pageant. And, to be fair, they had a point. The GOP did have its legitimate embarrassments. California Rep. Randy “Duke” Cunningham and lobbyist Jack Abramoff were fair game, and so was Rep. Mark Foley, the twisted Florida congressman who allegedly wanted male congressional pages cleaned and perfumed and brought to his tent, as it were. Of course, it wasn’t as if Democrats were without sin. Louisiana Rep. William Jefferson was indicted on fraud, bribery, and corruption charges in 2007, after an investigation unearthed, among other things, $90,000 in his freezer. Then–New York governor Eliot Spitzer was busted in a prostitution scandal. But that’s all yesterday’s news. Let’s look at the here and now. Barack Obama, who vowed he’d provide a transparent administration staffed with disinterested public servants with the self-restraint of Roman castrati, appointed an admitted tax cheat to run the Treasury Department — and he’s hardly the only one in the administration. New York representative Charles Rangel, chairman of the House Ways and Means Committee, is under investigation for, among other things, failing to report income from his Caribbean villa. Meanwhile, Sen. Christopher Dodd, chairman of the Senate Banking Committee, got sweetheart deals from subprime lender Countrywide and has yet to adequately explain his too-good-to-be-true deal on his million-dollar “cottage” in Ireland, which he may have gotten in exchange for finagling a pardon (from President Clinton) for a felon. Oh, Dodd also secretly protected those AIG bonuses that raised such a ruckus. Rep. Jack Murtha of Pennsylvania, Nancy Pelosi’s moral authority on military matters during the Iraq war, has been revealed as a kleptomaniac of sorts, delivering as much of the federal budget as possible to various cronies and lobbyists. Former senator John Edwards, who had an affair even as he was scoring Oprah-points as the supportive husband during his wife’s battle with breast cancer, is being investigated by the feds for the improper use of campaign funds. It looks like the silky-haired champion of the little guys may have used their donations to bribe the alleged “baby mama” into silence. And it would be a shame to let it pass that Obama’s Senate seat was put up for sale by the then-governor of Illinois, Rod Blagojevich. A congressional ethics board is investigating whether Illinois Rep. Jesse Jackson Jr. tried to buy it. But you know what? We ain’t seen nothing yet. For starters, the real corruption isn’t what the media are ignoring or downplaying as isolated incidents. It’s what the media are hailing as strokes of bold, inspirational leadership. The White House, as a matter of policy, is rewriting legal contracts, picking winners (mostly labor unions and mortgage defaulters) and singling out losers (evil “speculators”), while much of the media continue to ponder whether Obama is already a greater president than FDR. If a Republican administration, staffed with cronies from Goldman Sachs and Citibank, were cutting special deals for its political allies, I suspect we’d be hearing fewer FDR analogies and more nouns ending with the suffix “gate.” Take Obama’s “car czar,” Steven Rattner. According to ABC’s Jake Tapper, Rattner is accused of threatening to use the White House to smear a Chrysler creditor if it refused to back the administration’s Chrysler bankruptcy plan. He’s also connected to a massive pension-fund scandal involving the investment firm he used to run. It’s alleged that Rattner’s firm bought the less-than-worthless DVD distribution rights to the achingly awful film Chooch — produced by the brother of an official in the New York comptroller’s office — as a thinly veiled bribe to gain access to New York pensions funds. Chooch, by the way, is Italian slang for “jackass,” which just happens to be the Democrats’ mascot. More to the point, political corruption is inevitable whenever you give hacks — of either party — too much discretion over public funds. Businesses look to Washington for profits instead of to the market. The thing is, this has become the governing philosophy of the Democratic party, from banking and cars to health care and now student loans. The federal government is taking over, and the culture of corruption inevitably trickles down. That in itself should be a scandal. Call it “Choochgate.” Source: \"http://townhall.com/columnists/JonahGoldberg/2009/05/06/trickle-down_corruption\" \"The World's Finest\"", 
        "intTime": 20090506, 
        "postID": 41, 
        "quote": "Democrats took back Congress in 2006 and the presidency in 2008 in no small part because of their ability to bang their spoons on their high chairs about what they called the Republican “culture of corruption.” Their choreographed outrage was coordinated with the precision of a North Korean missile-launch pageant. And, to be fair, they had a point. The GOP did have its legitimate embarrassments. California Rep. Randy “Duke” Cunningham and lobbyist Jack Abramoff were fair game, and so was Rep. Mark Foley, the twisted Florida congressman who allegedly wanted male congressional pages cleaned and perfumed and brought to his tent, as it were. Of course, it wasn’t as if Democrats were without sin. Louisiana Rep. William Jefferson was indicted on fraud, bribery, and corruption charges in 2007, after an investigation unearthed, among other things, $90,000 in his freezer. Then–New York governor Eliot Spitzer was busted in a prostitution scandal. But that’s all yesterday’s news. Let’s look at the here and now. Barack Obama, who vowed he’d provide a transparent administration staffed with disinterested public servants with the self-restraint of Roman castrati, appointed an admitted tax cheat to run the Treasury Department — and he’s hardly the only one in the administration. New York representative Charles Rangel, chairman of the House Ways and Means Committee, is under investigation for, among other things, failing to report income from his Caribbean villa. Meanwhile, Sen. Christopher Dodd, chairman of the Senate Banking Committee, got sweetheart deals from subprime lender Countrywide and has yet to adequately explain his too-good-to-be-true deal on his million-dollar “cottage” in Ireland, which he may have gotten in exchange for finagling a pardon (from President Clinton) for a felon. Oh, Dodd also secretly protected those AIG bonuses that raised such a ruckus. Rep. Jack Murtha of Pennsylvania, Nancy Pelosi’s moral authority on military matters during the Iraq war, has been revealed as a kleptomaniac of sorts, delivering as much of the federal budget as possible to various cronies and lobbyists. Former senator John Edwards, who had an affair even as he was scoring Oprah-points as the supportive husband during his wife’s battle with breast cancer, is being investigated by the feds for the improper use of campaign funds. It looks like the silky-haired champion of the little guys may have used their donations to bribe the alleged “baby mama” into silence. And it would be a shame to let it pass that Obama’s Senate seat was put up for sale by the then-governor of Illinois, Rod Blagojevich. A congressional ethics board is investigating whether Illinois Rep. Jesse Jackson Jr. tried to buy it. But you know what? We ain’t seen nothing yet. For starters, the real corruption isn’t what the media are ignoring or downplaying as isolated incidents. It’s what the media are hailing as strokes of bold, inspirational leadership. The White House, as a matter of policy, is rewriting legal contracts, picking winners (mostly labor unions and mortgage defaulters) and singling out losers (evil “speculators”), while much of the media continue to ponder whether Obama is already a greater president than FDR. If a Republican administration, staffed with cronies from Goldman Sachs and Citibank, were cutting special deals for its political allies, I suspect we’d be hearing fewer FDR analogies and more nouns ending with the suffix “gate.” Take Obama’s “car czar,” Steven Rattner. According to ABC’s Jake Tapper, Rattner is accused of threatening to use the White House to smear a Chrysler creditor if it refused to back the administration’s Chrysler bankruptcy plan. He’s also connected to a massive pension-fund scandal involving the investment firm he used to run. It’s alleged that Rattner’s firm bought the less-than-worthless DVD distribution rights to the achingly awful film Chooch — produced by the brother of an official in the New York comptroller’s office — as a thinly veiled bribe to gain access to New York pensions funds. Chooch, by the way, is Italian slang for “jackass,” which just happens to be the Democrats’ mascot. More to the point, political corruption is inevitable whenever you give hacks — of either party — too much discretion over public funds. Businesses look to Washington for profits instead of to the market. The thing is, this has become the governing philosophy of the Democratic party, from banking and cars to health care and now student loans. The federal government is taking over, and the culture of corruption inevitably trickles down. That in itself should be a scandal. Call it “Choochgate.”", 
        "reply": "It wasn't too long ago that the democrats appropriately crowned republicans with the \"culture of corruption\" title. However, in just the past few months, the democrats have gained substantial ground in reclaiming this disgraceful honor. Is this what Obama meant by his \"change\" mantra? Or is this just politics as usual?  Source: \"http://townhall.com/columnists/JonahGoldberg/2009/05/06/trickle-down_corruption\" \"The World's Finest\"", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 06:06:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Yep, vote republican, we were doing much better then, right?", 
        "intTime": 20090506, 
        "postID": 42, 
        "quote": "", 
        "reply": "Yep, vote republican, we were doing much better then, right?", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 09:36:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: Yep, vote republican, we were doing much better then, right? Come on Doc, is that all you got? For you to come back with the ole, Republicans were worse mantra makes no sense, especially when you consider WHO has truly broken the law, how many were Dems, how many were republicans? It doesn't matter becvause they are both corrupt. Why vote republican, why note vote Independent or Libitarian? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 43, 
        "quote": "Originally posted by Ol_Doc: Yep, vote republican, we were doing much better then, right?", 
        "reply": " Come on Doc, is that all you got? For you to come back with the ole, Republicans were worse mantra makes no sense, especially when you consider WHO has truly broken the law, how many were Dems, how many were republicans? It doesn't matter becvause they are both corrupt. Why vote republican, why note vote Independent or Libitarian? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 09:44:00", 
        "title": "Trickle Down Corruption", 
        "userID": "L0A1"
    }, 
    {
        "content": "Here is a good place that you can post whatever you like and update your profile whenever you like!! Just take the asterisk out when you paste this in your address bar. This message has been edited. Last edited by: <NEMESIS1960>, Wed 06 May 2009 01:48 PM", 
        "intTime": 20090506, 
        "postID": 44, 
        "quote": "", 
        "reply": "Here is a good place that you can post whatever you like and update your profile whenever you like!! Just take the asterisk out when you paste this in your address bar. This message has been edited. Last edited by: <NEMESIS1960>, Wed 06 May 2009 01:48 PM", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 09:46:00", 
        "title": "Trickle Down Corruption", 
        "userID": "ArtyOps"
    }, 
    {
        "content": "quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer.", 
        "intTime": 20090506, 
        "postID": 45, 
        "quote": "Yep, vote republican, we were doing much better then, right?", 
        "reply": " Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer.", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 09:48:00", 
        "title": "Trickle Down Corruption", 
        "userID": "ACR26"
    }, 
    {
        "content": "That whole screed is pretty thin gruel. Walt", 
        "intTime": 20090506, 
        "postID": 46, 
        "quote": "", 
        "reply": "That whole screed is pretty thin gruel. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:13:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by ArtyOps: Here is a good place that you can post whatever you like and update your profile whenever you like!! \"http://u*smilnet.com/smf/index.php?action=forum\" Just take the asterisk out when you paste this in your address bar. You are gonna get a slap for your hotlink and for advertising another site. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 47, 
        "quote": "Originally posted by ArtyOps: Here is a good place that you can post whatever you like and update your profile whenever you like!! \"http://u*smilnet.com/smf/index.php?action=forum\" Just take the asterisk out when you paste this in your address bar.", 
        "reply": " You are gonna get a slap for your hotlink and for advertising another site. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:23:00", 
        "title": "Trickle Down Corruption", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument.", 
        "intTime": 20090506, 
        "postID": 48, 
        "quote": "Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer.", 
        "reply": " Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument.", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:29:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I've been waiting for it.", 
        "intTime": 20090506, 
        "postID": 49, 
        "quote": "", 
        "reply": "I've been waiting for it.", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:31:00", 
        "title": "Trickle Down Corruption", 
        "userID": "ArtyOps"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something?", 
        "intTime": 20090506, 
        "postID": 50, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument.", 
        "reply": " I don't recall Bill Clinton being impeached. Did I miss something?", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:36:00", 
        "title": "Trickle Down Corruption", 
        "userID": "ArtyOps"
    }, 
    {
        "content": "Let's go down memory lane. Consider the Nixon administration where the president himself had to be pardoned and the attorney general - highest law enforcment officer - actually went to prison. There were lots of others. Oh, and Reagan - this is just for Iran-Contra. Summary of Prosecutions After Independent Counsel Lawrence E. Walsh's appointment in December 1986, 14 persons were charged with criminal offenses. Eleven persons were convicted, but two convictions were overturned on appeal. Two persons were pardoned before trial and one case was dismissed when the Bush Administration declined to declassify information necessary for trial. On December 24, 1992, President Bush pardoned Caspar W. Weinberger, Duane R. Clarridge, Clair E. George, Elliott Abrams, Alan D. Fiers, Jr., and Robert C. McFarlane. Completed Trials and Pleas Elliott Abrams -- Pleaded guilty October 7, 1991, to two misdemeanor charges of withholding information from Congress about secret government efforts to support the Nicaraguan contra rebels during a ban on such aid. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced Abrams November 15, 1991, to two years probation and 100 hours community service. Abrams was pardoned December 24, 1992. Carl R. Channell -- Pleaded guilty April 29, 1987, to one felony count of conspiracy to defraud the United States. U.S. District Judge Stanley S. Harris sentenced Channell on July 7, 1989, to two years probation. Thomas G. Clines -- Indicted February 22, 1990, on four felony counts of underreporting his earnings to the IRS in the 1985 and 1986 tax years; and falsely stating on his 1985 and 1986 tax returns that he had no foreign financial accounts. On September 18, 1990, Clines was found guilty of all charges. U.S. District Judge Norman P. Ramsey in Baltimore, Md., on December 13, 1990, sentenced Clines to 16 months in prison and $40,000 in fines. He was ordered to pay the cost of the prosecution. The Fourth Circuit U.S. Court of Appeals in Richmond, Va., on February 27, 1992, upheld the convictions. Clines served his prison sentence. Alan D. Fiers, Jr. -- Pleaded guilty July 9, 1991, to two misdemeanor counts of withholding information from Congress about secret efforts to aid the Nicaraguan contras. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced Fiers January 31, 1992, to one year probation and 100 hours community service. Fiers was pardoned December 24, 1992. Clair E. George -- Indicted September 6, 1991, on 10 counts of perjury, false statements and obstruction in connection with congressional and Grand Jury investigations. George's trial on nine counts ended in a mistrial on August 26, 1992. Following a second trial on seven counts, George was found guilty December 9, 1992, of two felony charges of false statements and perjury before Congress. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Royce C. Lamberth set sentencing for February 18, 1993. George was pardoned on December 24, 1992, before sentencing occurred. Albert Hakim -- Pleaded guilty November 21, 1989, to a misdemeanor of supplementing the salary of Oliver L. North. Lake Resources Inc., in which Hakim was the principal shareholder, pleaded guilty to a corporate felony of theft of government property in diverting Iran arms sales proceeds to the Nicaraguan contras and other activities. Hakim was sentenced by U.S. District Judge Gerhard A. Gesell on February 1, 1990, to two years probation and a $5,000 fine; Lake Resources was ordered dissolved. Robert C. McFarlane -- Pleaded guilty March 11, 1988, to four misdemeanor counts of withholding information from Congress. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced McFarlane on March 3, 1989, to two years probation, $20,000 in fines and 200 hours community service. McFarlane was pardoned December 24, 1992. Richard R. Miller -- Pleaded guilty May 6, 1987, to one felony count of conspiracy to defraud the United States. U.S. District Judge Stanley S. Harris sentenced Miller on July 6, 1989, to two years probation and 120 hours of community service. Oliver L. North -- Indicted March 16, 1988, on 16 felony counts. After standing trial on 12, North was convicted May 4, 1989 of three charges: accepting an illegal gratuity, aiding and abetting in the obstruction of a congressional inquiry, and destruction of documents. He was sentenced by U.S. District Judge Gerhard A. Gesell on July 5, 1989, to a three-year suspended prison term, two years probation, $150,000 in fines and 1,200 hours community service. A three-judge appeals panel on July 20, 1990, vacated North's conviction for further proceedings to determine whether his immunized testimony influenced witnesses in the trial. The Supreme Court declined to review the case. Judge Gesell dismissed the case September 16, 1991, after hearings on the immunity issue, on the motion of Independent Counsel. John M. Poindexter -- Indicted March 16, 1988, on seven felony charges. After standing trial on five charges, Poindexter was found guilty April 7, 1990, on all counts: conspiracy (obstruction of inquiries and proceedings, false statements, falsification, destruction and removal of documents); two counts of obstruction of Congress and two counts of false statements. U.S. District Judge Harold H. Greene sentenced Poindexter June 11, 1990, to six months in prison on each count, to be served concurrently. A three-judge appeals panel on November 15, 1991, reversed the convictions on the ground that Poindexter's immunized testimony may have influenced the trial testimony of witnesses. The Supreme Court on December 7, 1992, declined to review the case. In 1993, the indictment was dismissed on the motion of Independent Counsel. Richard V. Secord -- Indicted March 16, 1988 on six felony charges. On May 11, 1989, a second indictment was issued charging nine counts of impeding and obstructing the Select Iran/contra Committees. Secord was scheduled to stand trial on 12 charges. He pleaded guilty November 8, 1989, to one felony count of false statements to Congress. Secord was sentenced by U.S. District Chief Judge Aubrey E. Robinson, Jr., on January 24, 1990, to two years probation. Pre-trial Pardons Duane R. Clarridge -- Indicted November 26, 1991, on seven counts of perjury and false statements about a secret shipment of U.S. HAWK missiles to Iran. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Harold H. Greene set a March 15, 1993, trial date. Clarridge was pardoned December 24, 1992. Caspar W. Weinberger -- Indicted June 16, 1992, on five counts of obstruction, perjury and false statements in connection with congressional and Independent Counsel investigations of Iran/ contra. On September 29, the obstruction count was dismissed. On October 30, a second indictment was issued, charging one false statement count. The second indictment was dismissed December 11, leaving four counts remaining. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Thomas F. Hogan set a January 5, 1993, trial date. Weinberger was pardoned December 24, 1992. Dismissal Joseph F. Fernandez -- Indicted June 20, 1988 on five counts of conspiracy to defraud the United States, obstructing the inquiry of the Tower Commission and making false statements to government agencies. The case was dismissed in the District of Columbia for venue reasons on the motion of Independent Counsel. A four-count indictment was issued in the Eastern District of Virginia on April 24, 1989. U.S. District Judge Claude M. Hilton dismissed the four-count case November 24, 1989, after Attorney General Richard Thornburgh blocked the disclosure of classified information ruled relevant to the defense. The U.S. Court of Appeals for the Fourth Circuit in Richmond, Va., on September 6, 1990, upheld Judge Hilton's rulings under the Classified Information Procedures Act (CIPA). On October 12, 1990, the Attorney General filed a final declaration that he would not disclose the classified information. -------------------- Oh, and the above John Poindexter is same the guy the Bushies thought would be a great pick to run the Total Information Awareness part of their domestic spying operation. This article about Obama -- One of his picks didn't pay his taxes correctly? What a hoot for the pathetic peeps attacking PResident Obama. Walt", 
        "intTime": 20090506, 
        "postID": 51, 
        "quote": "", 
        "reply": "Let's go down memory lane. Consider the Nixon administration where the president himself had to be pardoned and the attorney general - highest law enforcment officer - actually went to prison. There were lots of others. Oh, and Reagan - this is just for Iran-Contra. Summary of Prosecutions After Independent Counsel Lawrence E. Walsh's appointment in December 1986, 14 persons were charged with criminal offenses. Eleven persons were convicted, but two convictions were overturned on appeal. Two persons were pardoned before trial and one case was dismissed when the Bush Administration declined to declassify information necessary for trial. On December 24, 1992, President Bush pardoned Caspar W. Weinberger, Duane R. Clarridge, Clair E. George, Elliott Abrams, Alan D. Fiers, Jr., and Robert C. McFarlane. Completed Trials and Pleas Elliott Abrams -- Pleaded guilty October 7, 1991, to two misdemeanor charges of withholding information from Congress about secret government efforts to support the Nicaraguan contra rebels during a ban on such aid. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced Abrams November 15, 1991, to two years probation and 100 hours community service. Abrams was pardoned December 24, 1992. Carl R. Channell -- Pleaded guilty April 29, 1987, to one felony count of conspiracy to defraud the United States. U.S. District Judge Stanley S. Harris sentenced Channell on July 7, 1989, to two years probation. Thomas G. Clines -- Indicted February 22, 1990, on four felony counts of underreporting his earnings to the IRS in the 1985 and 1986 tax years; and falsely stating on his 1985 and 1986 tax returns that he had no foreign financial accounts. On September 18, 1990, Clines was found guilty of all charges. U.S. District Judge Norman P. Ramsey in Baltimore, Md., on December 13, 1990, sentenced Clines to 16 months in prison and $40,000 in fines. He was ordered to pay the cost of the prosecution. The Fourth Circuit U.S. Court of Appeals in Richmond, Va., on February 27, 1992, upheld the convictions. Clines served his prison sentence. Alan D. Fiers, Jr. -- Pleaded guilty July 9, 1991, to two misdemeanor counts of withholding information from Congress about secret efforts to aid the Nicaraguan contras. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced Fiers January 31, 1992, to one year probation and 100 hours community service. Fiers was pardoned December 24, 1992. Clair E. George -- Indicted September 6, 1991, on 10 counts of perjury, false statements and obstruction in connection with congressional and Grand Jury investigations. George's trial on nine counts ended in a mistrial on August 26, 1992. Following a second trial on seven counts, George was found guilty December 9, 1992, of two felony charges of false statements and perjury before Congress. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Royce C. Lamberth set sentencing for February 18, 1993. George was pardoned on December 24, 1992, before sentencing occurred. Albert Hakim -- Pleaded guilty November 21, 1989, to a misdemeanor of supplementing the salary of Oliver L. North. Lake Resources Inc., in which Hakim was the principal shareholder, pleaded guilty to a corporate felony of theft of government property in diverting Iran arms sales proceeds to the Nicaraguan contras and other activities. Hakim was sentenced by U.S. District Judge Gerhard A. Gesell on February 1, 1990, to two years probation and a $5,000 fine; Lake Resources was ordered dissolved. Robert C. McFarlane -- Pleaded guilty March 11, 1988, to four misdemeanor counts of withholding information from Congress. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced McFarlane on March 3, 1989, to two years probation, $20,000 in fines and 200 hours community service. McFarlane was pardoned December 24, 1992. Richard R. Miller -- Pleaded guilty May 6, 1987, to one felony count of conspiracy to defraud the United States. U.S. District Judge Stanley S. Harris sentenced Miller on July 6, 1989, to two years probation and 120 hours of community service. Oliver L. North -- Indicted March 16, 1988, on 16 felony counts. After standing trial on 12, North was convicted May 4, 1989 of three charges: accepting an illegal gratuity, aiding and abetting in the obstruction of a congressional inquiry, and destruction of documents. He was sentenced by U.S. District Judge Gerhard A. Gesell on July 5, 1989, to a three-year suspended prison term, two years probation, $150,000 in fines and 1,200 hours community service. A three-judge appeals panel on July 20, 1990, vacated North's conviction for further proceedings to determine whether his immunized testimony influenced witnesses in the trial. The Supreme Court declined to review the case. Judge Gesell dismissed the case September 16, 1991, after hearings on the immunity issue, on the motion of Independent Counsel. John M. Poindexter -- Indicted March 16, 1988, on seven felony charges. After standing trial on five charges, Poindexter was found guilty April 7, 1990, on all counts: conspiracy (obstruction of inquiries and proceedings, false statements, falsification, destruction and removal of documents); two counts of obstruction of Congress and two counts of false statements. U.S. District Judge Harold H. Greene sentenced Poindexter June 11, 1990, to six months in prison on each count, to be served concurrently. A three-judge appeals panel on November 15, 1991, reversed the convictions on the ground that Poindexter's immunized testimony may have influenced the trial testimony of witnesses. The Supreme Court on December 7, 1992, declined to review the case. In 1993, the indictment was dismissed on the motion of Independent Counsel. Richard V. Secord -- Indicted March 16, 1988 on six felony charges. On May 11, 1989, a second indictment was issued charging nine counts of impeding and obstructing the Select Iran/contra Committees. Secord was scheduled to stand trial on 12 charges. He pleaded guilty November 8, 1989, to one felony count of false statements to Congress. Secord was sentenced by U.S. District Chief Judge Aubrey E. Robinson, Jr., on January 24, 1990, to two years probation. Pre-trial Pardons Duane R. Clarridge -- Indicted November 26, 1991, on seven counts of perjury and false statements about a secret shipment of U.S. HAWK missiles to Iran. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Harold H. Greene set a March 15, 1993, trial date. Clarridge was pardoned December 24, 1992. Caspar W. Weinberger -- Indicted June 16, 1992, on five counts of obstruction, perjury and false statements in connection with congressional and Independent Counsel investigations of Iran/ contra. On September 29, the obstruction count was dismissed. On October 30, a second indictment was issued, charging one false statement count. The second indictment was dismissed December 11, leaving four counts remaining. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Thomas F. Hogan set a January 5, 1993, trial date. Weinberger was pardoned December 24, 1992. Dismissal Joseph F. Fernandez -- Indicted June 20, 1988 on five counts of conspiracy to defraud the United States, obstructing the inquiry of the Tower Commission and making false statements to government agencies. The case was dismissed in the District of Columbia for venue reasons on the motion of Independent Counsel. A four-count indictment was issued in the Eastern District of Virginia on April 24, 1989. U.S. District Judge Claude M. Hilton dismissed the four-count case November 24, 1989, after Attorney General Richard Thornburgh blocked the disclosure of classified information ruled relevant to the defense. The U.S. Court of Appeals for the Fourth Circuit in Richmond, Va., on September 6, 1990, upheld Judge Hilton's rulings under the Classified Information Procedures Act (CIPA). On October 12, 1990, the Attorney General filed a final declaration that he would not disclose the classified information. -------------------- Oh, and the above John Poindexter is same the guy the Bushies thought would be a great pick to run the Total Information Awareness part of their domestic spying operation. This article about Obama -- One of his picks didn't pay his taxes correctly? What a hoot for the pathetic peeps attacking PResident Obama. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:40:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt", 
        "intTime": 20090506, 
        "postID": 52, 
        "quote": "Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something?", 
        "reply": " Yes, civics class. CLinton was impeached, but not convicted. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:41:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Reagan had by far the most corrupt administration ever. \"By the end of his term, 138 Reagan administration officials had been convicted, had been indicted, or had been the subject of official investigations for official misconduct and/or criminal violations. In terms of number of officials involved, the record of his administration was the worst ever.\" 1. Lyn Nofziger--White House Press Secretary - Convicted on charges of illegal lobbying of White House in Wedtech scandal. The lobbying would not have been illegal had he not been White House Press Secretary. 2. Michael Deaver, Reagan's Chief of Staff, received three years' probation and was fined one hundred thousand dollars after being convicted for lying to a congressional subcommittee and a federal grand jury about his lobbying activities after leaving the White House. Same as with Lyn Nofziger. 3. James Watt, Reagan's Secretary of the Interior was indicted on 41 felony counts for using connections at the Department of Housing and Urban Development to help his private clients seek federal funds for housing projects in Maryland, New Jersey, Massachusetts, Puerto Rico and the Virgin Islands. Watt conceded that he had received $500,000 from clients who were granted very favorable housing contracts after he had intervened on their behalf. Watt was eventually sentenced to five years in prison and 500 hours of community service. 4. John Poindexter, Reagan's national security advisor, guilty of five criminal counts involving conspiracy to mislead Congress, obstructing congressional inquiries, lying to lawmakers, used \"high national security\" to mask deceit and wrong-doing... 5. Richard Secord pleaded guilty to a felony charge of lying to Congress over Iran-Contra. Appointed by William Casey to assist Oliver North. 6. Elliott Abrams was appointed by President Reagan in 1985 to head the State Department's Latin American Bureau. He was closely linked with ex-White House aide Lt. Col. Oliver North's covert movement to aid the Contras. Working for North, Abrams coordinated inter-agency support for the contras and helped solicit illegal funding from foreign powers as well as domestic contributors. Abrams agreed to cooperate with Iran-Contra investigators and pled guilty to two charges reduced to misdemeanors. He was sentenced in 1991 to two years probation and 100 hours of community service but was pardoned by President George Bush... 7. Robert C. McFarlane, Reagan's National Security Advisor, pled guilty to four misdemeanors and was sentenced to two years probation and 200 hours of community service. He was also fined $20,000. He received a blanket pardon from President George Bush... 8. Alan D. Fiers was the Chief of the Central Intelligence Agency's Central American Task Force. Fiers pled guilty in 1991 to two counts of withholding information from congress about Oliver North's activities and the diversion of Iran arms sale money to aid the Contras. He was sentenced to one year of probation and 100 hours of community service. Alan Fiers received a blanket pardon for his crimes from President Bush... Thomas G. Clines: convicted of four counts of tax-related offenses for failing to report income from the operations; Carl R. Channel - Office of Public Diplomacy , partner in International Business- first person convicted in the Iran/Contra scandal, pleaded guilty of one count of defrauding the United States Richard R. Miller - Partner with Oliver North in IBC, a Office of Public Diplomacy front group, convicted of conspiracy to defraud the United States. Frank Gomez 13.. Donald Fortier Clair George was Chief of the CIA's Division of Covert Operations under President Reagan. George was convicted of lying to two congressional committees in 1986. George faced a maximum five year federal prison sentence and a $20,000 fine for each of the two convictions. Jurors cleared George of five other charges including two counts of lying to a federal grand jury. Clair George received a blanket pardon for his crimes from President George Bush... Rita Lavelle was indicted, tried and convicted of lying to Congress and served three months of a six-month prison sentence. Philip Winn - Assistant HUD Secretary. Pleaded guilty to one count of scheming to give illegal gratuities. Thomas Demery - Assistand HUD Secretary - pleaded guilty to steering HUD subsidies to politically connected donors. Deborah Gore Dean - executive assistant to Samuel Pierce - indicted on thirteen counts, three counts of conspiracy, one count of accepting an illegal gratuity, four counts of perjury, and five counts of concealing articles. She was convicted on twelve accounts. She appealed and prevailed on several accounts but the convictions for conspiracy remained. Catalina Villaponda - Former US Treasurer Joseph A. Strauss - Accepting kickbacks from developers ------------- More at the link. >http://www.dailykos.com/story/2005/10/17/194133/16< Walt", 
        "intTime": 20090506, 
        "postID": 53, 
        "quote": "", 
        "reply": "Reagan had by far the most corrupt administration ever. \"By the end of his term, 138 Reagan administration officials had been convicted, had been indicted, or had been the subject of official investigations for official misconduct and/or criminal violations. In terms of number of officials involved, the record of his administration was the worst ever.\" 1. Lyn Nofziger--White House Press Secretary - Convicted on charges of illegal lobbying of White House in Wedtech scandal. The lobbying would not have been illegal had he not been White House Press Secretary. 2. Michael Deaver, Reagan's Chief of Staff, received three years' probation and was fined one hundred thousand dollars after being convicted for lying to a congressional subcommittee and a federal grand jury about his lobbying activities after leaving the White House. Same as with Lyn Nofziger. 3. James Watt, Reagan's Secretary of the Interior was indicted on 41 felony counts for using connections at the Department of Housing and Urban Development to help his private clients seek federal funds for housing projects in Maryland, New Jersey, Massachusetts, Puerto Rico and the Virgin Islands. Watt conceded that he had received $500,000 from clients who were granted very favorable housing contracts after he had intervened on their behalf. Watt was eventually sentenced to five years in prison and 500 hours of community service. 4. John Poindexter, Reagan's national security advisor, guilty of five criminal counts involving conspiracy to mislead Congress, obstructing congressional inquiries, lying to lawmakers, used \"high national security\" to mask deceit and wrong-doing... 5. Richard Secord pleaded guilty to a felony charge of lying to Congress over Iran-Contra. Appointed by William Casey to assist Oliver North. 6. Elliott Abrams was appointed by President Reagan in 1985 to head the State Department's Latin American Bureau. He was closely linked with ex-White House aide Lt. Col. Oliver North's covert movement to aid the Contras. Working for North, Abrams coordinated inter-agency support for the contras and helped solicit illegal funding from foreign powers as well as domestic contributors. Abrams agreed to cooperate with Iran-Contra investigators and pled guilty to two charges reduced to misdemeanors. He was sentenced in 1991 to two years probation and 100 hours of community service but was pardoned by President George Bush... 7. Robert C. McFarlane, Reagan's National Security Advisor, pled guilty to four misdemeanors and was sentenced to two years probation and 200 hours of community service. He was also fined $20,000. He received a blanket pardon from President George Bush... 8. Alan D. Fiers was the Chief of the Central Intelligence Agency's Central American Task Force. Fiers pled guilty in 1991 to two counts of withholding information from congress about Oliver North's activities and the diversion of Iran arms sale money to aid the Contras. He was sentenced to one year of probation and 100 hours of community service. Alan Fiers received a blanket pardon for his crimes from President Bush... Thomas G. Clines: convicted of four counts of tax-related offenses for failing to report income from the operations; Carl R. Channel - Office of Public Diplomacy , partner in International Business- first person convicted in the Iran/Contra scandal, pleaded guilty of one count of defrauding the United States Richard R. Miller - Partner with Oliver North in IBC, a Office of Public Diplomacy front group, convicted of conspiracy to defraud the United States. Frank Gomez 13.. Donald Fortier Clair George was Chief of the CIA's Division of Covert Operations under President Reagan. George was convicted of lying to two congressional committees in 1986. George faced a maximum five year federal prison sentence and a $20,000 fine for each of the two convictions. Jurors cleared George of five other charges including two counts of lying to a federal grand jury. Clair George received a blanket pardon for his crimes from President George Bush... Rita Lavelle was indicted, tried and convicted of lying to Congress and served three months of a six-month prison sentence. Philip Winn - Assistant HUD Secretary. Pleaded guilty to one count of scheming to give illegal gratuities. Thomas Demery - Assistand HUD Secretary - pleaded guilty to steering HUD subsidies to politically connected donors. Deborah Gore Dean - executive assistant to Samuel Pierce - indicted on thirteen counts, three counts of conspiracy, one count of accepting an illegal gratuity, four counts of perjury, and five counts of concealing articles. She was convicted on twelve accounts. She appealed and prevailed on several accounts but the convictions for conspiracy remained. Catalina Villaponda - Former US Treasurer Joseph A. Strauss - Accepting kickbacks from developers ------------- More at the link. >http://www.dailykos.com/story/2005/10/17/194133/16< Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:46:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt Now now, don't be hard on him. They don't teach civics in school anymore. Apearently \"how our government works\" isn't important enough to spend the time and trouble.", 
        "intTime": 20090506, 
        "postID": 54, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt", 
        "reply": " Now now, don't be hard on him. They don't teach civics in school anymore. Apearently \"how our government works\" isn't important enough to spend the time and trouble.", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:02:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL", 
        "intTime": 20090506, 
        "postID": 55, 
        "quote": "Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt", 
        "reply": " XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:03:00", 
        "title": "Trickle Down Corruption", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL >shrug< Nixon was pardoned, which by definition includes admission of guilt. Walt", 
        "intTime": 20090506, 
        "postID": 56, 
        "quote": "Originally posted by LineDoggie: quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL", 
        "reply": " >shrug< Nixon was pardoned, which by definition includes admission of guilt. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:22:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Impeachment is the first of two stages in a specific process for a legislative body to consider whether or not to forcibly remove a government official from office. The impeachment itself brings the charges against the government. Impeachment does not necessarily result in removal from office; it is only a legal statement of charges, parallel to an indictment in criminal law. An official who is impeached faces a second legislative vote (whether by the same body or another), which determines conviction, or failure to convict, on the charges embodied by the impeachment. \"http://en.wikipedia.org/wiki/Impeachment\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090506, 
        "postID": 57, 
        "quote": "Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something?", 
        "reply": " Impeachment is the first of two stages in a specific process for a legislative body to consider whether or not to forcibly remove a government official from office. The impeachment itself brings the charges against the government. Impeachment does not necessarily result in removal from office; it is only a legal statement of charges, parallel to an indictment in criminal law. An official who is impeached faces a second legislative vote (whether by the same body or another), which determines conviction, or failure to convict, on the charges embodied by the impeachment. \"http://en.wikipedia.org/wiki/Impeachment\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:26:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by WhiskeyPapa: quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt Now now, don't be hard on him. They don't teach civics in school anymore. Apearently \"how our government works\" isn't important enough to spend the time and trouble. Well, any American should certainly know that Andrew Johnson was impeached and his trial fell one vote short of conviction. If you don't know the history, you can't be a good citizen. It takes more than just putting out flags and yellow ribbons. And you have to care about what is done in your name. Walt", 
        "intTime": 20090506, 
        "postID": 58, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by WhiskeyPapa: quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt Now now, don't be hard on him. They don't teach civics in school anymore. Apearently \"how our government works\" isn't important enough to spend the time and trouble.", 
        "reply": " Well, any American should certainly know that Andrew Johnson was impeached and his trial fell one vote short of conviction. If you don't know the history, you can't be a good citizen. It takes more than just putting out flags and yellow ribbons. And you have to care about what is done in your name. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:30:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by LineDoggie: quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL >shrug< Nixon was pardoned, which by definition includes admission of guilt. Walt >Sigh< Nixons Pardon had no consequence on the Supreme Courts ability to hand down a Disbarrment. His pardon would have stopped Potential Criminal consequences", 
        "intTime": 20090506, 
        "postID": 59, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by LineDoggie: quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL >shrug< Nixon was pardoned, which by definition includes admission of guilt. Walt", 
        "reply": " >Sigh< Nixons Pardon had no consequence on the Supreme Courts ability to hand down a Disbarrment. His pardon would have stopped Potential Criminal consequences", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:33:00", 
        "title": "Trickle Down Corruption", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Sorry guys. The facts have a liberal bias. Walt", 
        "intTime": 20090506, 
        "postID": 60, 
        "quote": "", 
        "reply": "Sorry guys. The facts have a liberal bias. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:48:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "It wasn't too long ago that the democrats appropriately crowned republicans with the \"culture of corruption\" title. However, in just the past few months, the democrats have gained substantial ground in reclaiming this disgraceful honor. Is this what Obama meant by his \"change\" mantra? Or is this just politics as usual? quote: Democrats took back Congress in 2006 and the presidency in 2008 in no small part because of their ability to bang their spoons on their high chairs about what they called the Republican “culture of corruption.” Their choreographed outrage was coordinated with the precision of a North Korean missile-launch pageant. And, to be fair, they had a point. The GOP did have its legitimate embarrassments. California Rep. Randy “Duke” Cunningham and lobbyist Jack Abramoff were fair game, and so was Rep. Mark Foley, the twisted Florida congressman who allegedly wanted male congressional pages cleaned and perfumed and brought to his tent, as it were. Of course, it wasn’t as if Democrats were without sin. Louisiana Rep. William Jefferson was indicted on fraud, bribery, and corruption charges in 2007, after an investigation unearthed, among other things, $90,000 in his freezer. Then–New York governor Eliot Spitzer was busted in a prostitution scandal. But that’s all yesterday’s news. Let’s look at the here and now. Barack Obama, who vowed he’d provide a transparent administration staffed with disinterested public servants with the self-restraint of Roman castrati, appointed an admitted tax cheat to run the Treasury Department — and he’s hardly the only one in the administration. New York representative Charles Rangel, chairman of the House Ways and Means Committee, is under investigation for, among other things, failing to report income from his Caribbean villa. Meanwhile, Sen. Christopher Dodd, chairman of the Senate Banking Committee, got sweetheart deals from subprime lender Countrywide and has yet to adequately explain his too-good-to-be-true deal on his million-dollar “cottage” in Ireland, which he may have gotten in exchange for finagling a pardon (from President Clinton) for a felon. Oh, Dodd also secretly protected those AIG bonuses that raised such a ruckus. Rep. Jack Murtha of Pennsylvania, Nancy Pelosi’s moral authority on military matters during the Iraq war, has been revealed as a kleptomaniac of sorts, delivering as much of the federal budget as possible to various cronies and lobbyists. Former senator John Edwards, who had an affair even as he was scoring Oprah-points as the supportive husband during his wife’s battle with breast cancer, is being investigated by the feds for the improper use of campaign funds. It looks like the silky-haired champion of the little guys may have used their donations to bribe the alleged “baby mama” into silence. And it would be a shame to let it pass that Obama’s Senate seat was put up for sale by the then-governor of Illinois, Rod Blagojevich. A congressional ethics board is investigating whether Illinois Rep. Jesse Jackson Jr. tried to buy it. But you know what? We ain’t seen nothing yet. For starters, the real corruption isn’t what the media are ignoring or downplaying as isolated incidents. It’s what the media are hailing as strokes of bold, inspirational leadership. The White House, as a matter of policy, is rewriting legal contracts, picking winners (mostly labor unions and mortgage defaulters) and singling out losers (evil “speculators”), while much of the media continue to ponder whether Obama is already a greater president than FDR. If a Republican administration, staffed with cronies from Goldman Sachs and Citibank, were cutting special deals for its political allies, I suspect we’d be hearing fewer FDR analogies and more nouns ending with the suffix “gate.” Take Obama’s “car czar,” Steven Rattner. According to ABC’s Jake Tapper, Rattner is accused of threatening to use the White House to smear a Chrysler creditor if it refused to back the administration’s Chrysler bankruptcy plan. He’s also connected to a massive pension-fund scandal involving the investment firm he used to run. It’s alleged that Rattner’s firm bought the less-than-worthless DVD distribution rights to the achingly awful film Chooch — produced by the brother of an official in the New York comptroller’s office — as a thinly veiled bribe to gain access to New York pensions funds. Chooch, by the way, is Italian slang for “jackass,” which just happens to be the Democrats’ mascot. More to the point, political corruption is inevitable whenever you give hacks — of either party — too much discretion over public funds. Businesses look to Washington for profits instead of to the market. The thing is, this has become the governing philosophy of the Democratic party, from banking and cars to health care and now student loans. The federal government is taking over, and the culture of corruption inevitably trickles down. That in itself should be a scandal. Call it “Choochgate.” Source: \"http://townhall.com/columnists/JonahGoldberg/2009/05/06/trickle-down_corruption\" \"The World's Finest\"", 
        "intTime": 20090506, 
        "postID": 61, 
        "quote": "Democrats took back Congress in 2006 and the presidency in 2008 in no small part because of their ability to bang their spoons on their high chairs about what they called the Republican “culture of corruption.” Their choreographed outrage was coordinated with the precision of a North Korean missile-launch pageant. And, to be fair, they had a point. The GOP did have its legitimate embarrassments. California Rep. Randy “Duke” Cunningham and lobbyist Jack Abramoff were fair game, and so was Rep. Mark Foley, the twisted Florida congressman who allegedly wanted male congressional pages cleaned and perfumed and brought to his tent, as it were. Of course, it wasn’t as if Democrats were without sin. Louisiana Rep. William Jefferson was indicted on fraud, bribery, and corruption charges in 2007, after an investigation unearthed, among other things, $90,000 in his freezer. Then–New York governor Eliot Spitzer was busted in a prostitution scandal. But that’s all yesterday’s news. Let’s look at the here and now. Barack Obama, who vowed he’d provide a transparent administration staffed with disinterested public servants with the self-restraint of Roman castrati, appointed an admitted tax cheat to run the Treasury Department — and he’s hardly the only one in the administration. New York representative Charles Rangel, chairman of the House Ways and Means Committee, is under investigation for, among other things, failing to report income from his Caribbean villa. Meanwhile, Sen. Christopher Dodd, chairman of the Senate Banking Committee, got sweetheart deals from subprime lender Countrywide and has yet to adequately explain his too-good-to-be-true deal on his million-dollar “cottage” in Ireland, which he may have gotten in exchange for finagling a pardon (from President Clinton) for a felon. Oh, Dodd also secretly protected those AIG bonuses that raised such a ruckus. Rep. Jack Murtha of Pennsylvania, Nancy Pelosi’s moral authority on military matters during the Iraq war, has been revealed as a kleptomaniac of sorts, delivering as much of the federal budget as possible to various cronies and lobbyists. Former senator John Edwards, who had an affair even as he was scoring Oprah-points as the supportive husband during his wife’s battle with breast cancer, is being investigated by the feds for the improper use of campaign funds. It looks like the silky-haired champion of the little guys may have used their donations to bribe the alleged “baby mama” into silence. And it would be a shame to let it pass that Obama’s Senate seat was put up for sale by the then-governor of Illinois, Rod Blagojevich. A congressional ethics board is investigating whether Illinois Rep. Jesse Jackson Jr. tried to buy it. But you know what? We ain’t seen nothing yet. For starters, the real corruption isn’t what the media are ignoring or downplaying as isolated incidents. It’s what the media are hailing as strokes of bold, inspirational leadership. The White House, as a matter of policy, is rewriting legal contracts, picking winners (mostly labor unions and mortgage defaulters) and singling out losers (evil “speculators”), while much of the media continue to ponder whether Obama is already a greater president than FDR. If a Republican administration, staffed with cronies from Goldman Sachs and Citibank, were cutting special deals for its political allies, I suspect we’d be hearing fewer FDR analogies and more nouns ending with the suffix “gate.” Take Obama’s “car czar,” Steven Rattner. According to ABC’s Jake Tapper, Rattner is accused of threatening to use the White House to smear a Chrysler creditor if it refused to back the administration’s Chrysler bankruptcy plan. He’s also connected to a massive pension-fund scandal involving the investment firm he used to run. It’s alleged that Rattner’s firm bought the less-than-worthless DVD distribution rights to the achingly awful film Chooch — produced by the brother of an official in the New York comptroller’s office — as a thinly veiled bribe to gain access to New York pensions funds. Chooch, by the way, is Italian slang for “jackass,” which just happens to be the Democrats’ mascot. More to the point, political corruption is inevitable whenever you give hacks — of either party — too much discretion over public funds. Businesses look to Washington for profits instead of to the market. The thing is, this has become the governing philosophy of the Democratic party, from banking and cars to health care and now student loans. The federal government is taking over, and the culture of corruption inevitably trickles down. That in itself should be a scandal. Call it “Choochgate.”", 
        "reply": "It wasn't too long ago that the democrats appropriately crowned republicans with the \"culture of corruption\" title. However, in just the past few months, the democrats have gained substantial ground in reclaiming this disgraceful honor. Is this what Obama meant by his \"change\" mantra? Or is this just politics as usual?  Source: \"http://townhall.com/columnists/JonahGoldberg/2009/05/06/trickle-down_corruption\" \"The World's Finest\"", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 06:06:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Kegler300"
    }, 
    {
        "content": "Yep, vote republican, we were doing much better then, right?", 
        "intTime": 20090506, 
        "postID": 62, 
        "quote": "", 
        "reply": "Yep, vote republican, we were doing much better then, right?", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 09:36:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: Yep, vote republican, we were doing much better then, right? Come on Doc, is that all you got? For you to come back with the ole, Republicans were worse mantra makes no sense, especially when you consider WHO has truly broken the law, how many were Dems, how many were republicans? It doesn't matter becvause they are both corrupt. Why vote republican, why note vote Independent or Libitarian? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 63, 
        "quote": "Originally posted by Ol_Doc: Yep, vote republican, we were doing much better then, right?", 
        "reply": " Come on Doc, is that all you got? For you to come back with the ole, Republicans were worse mantra makes no sense, especially when you consider WHO has truly broken the law, how many were Dems, how many were republicans? It doesn't matter becvause they are both corrupt. Why vote republican, why note vote Independent or Libitarian? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 09:44:00", 
        "title": "Trickle Down Corruption", 
        "userID": "L0A1"
    }, 
    {
        "content": "Here is a good place that you can post whatever you like and update your profile whenever you like!! Just take the asterisk out when you paste this in your address bar. This message has been edited. Last edited by: <NEMESIS1960>, Wed 06 May 2009 01:48 PM", 
        "intTime": 20090506, 
        "postID": 64, 
        "quote": "", 
        "reply": "Here is a good place that you can post whatever you like and update your profile whenever you like!! Just take the asterisk out when you paste this in your address bar. This message has been edited. Last edited by: <NEMESIS1960>, Wed 06 May 2009 01:48 PM", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 09:46:00", 
        "title": "Trickle Down Corruption", 
        "userID": "ArtyOps"
    }, 
    {
        "content": "quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer.", 
        "intTime": 20090506, 
        "postID": 65, 
        "quote": "Yep, vote republican, we were doing much better then, right?", 
        "reply": " Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer.", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 09:48:00", 
        "title": "Trickle Down Corruption", 
        "userID": "ACR26"
    }, 
    {
        "content": "That whole screed is pretty thin gruel. Walt", 
        "intTime": 20090506, 
        "postID": 66, 
        "quote": "", 
        "reply": "That whole screed is pretty thin gruel. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:13:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by ArtyOps: Here is a good place that you can post whatever you like and update your profile whenever you like!! \"http://u*smilnet.com/smf/index.php?action=forum\" Just take the asterisk out when you paste this in your address bar. You are gonna get a slap for your hotlink and for advertising another site. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090506, 
        "postID": 67, 
        "quote": "Originally posted by ArtyOps: Here is a good place that you can post whatever you like and update your profile whenever you like!! \"http://u*smilnet.com/smf/index.php?action=forum\" Just take the asterisk out when you paste this in your address bar.", 
        "reply": " You are gonna get a slap for your hotlink and for advertising another site. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:23:00", 
        "title": "Trickle Down Corruption", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument.", 
        "intTime": 20090506, 
        "postID": 68, 
        "quote": "Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer.", 
        "reply": " Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument.", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:29:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I've been waiting for it.", 
        "intTime": 20090506, 
        "postID": 69, 
        "quote": "", 
        "reply": "I've been waiting for it.", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:31:00", 
        "title": "Trickle Down Corruption", 
        "userID": "ArtyOps"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something?", 
        "intTime": 20090506, 
        "postID": 70, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument.", 
        "reply": " I don't recall Bill Clinton being impeached. Did I miss something?", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:36:00", 
        "title": "Trickle Down Corruption", 
        "userID": "ArtyOps"
    }, 
    {
        "content": "Let's go down memory lane. Consider the Nixon administration where the president himself had to be pardoned and the attorney general - highest law enforcment officer - actually went to prison. There were lots of others. Oh, and Reagan - this is just for Iran-Contra. Summary of Prosecutions After Independent Counsel Lawrence E. Walsh's appointment in December 1986, 14 persons were charged with criminal offenses. Eleven persons were convicted, but two convictions were overturned on appeal. Two persons were pardoned before trial and one case was dismissed when the Bush Administration declined to declassify information necessary for trial. On December 24, 1992, President Bush pardoned Caspar W. Weinberger, Duane R. Clarridge, Clair E. George, Elliott Abrams, Alan D. Fiers, Jr., and Robert C. McFarlane. Completed Trials and Pleas Elliott Abrams -- Pleaded guilty October 7, 1991, to two misdemeanor charges of withholding information from Congress about secret government efforts to support the Nicaraguan contra rebels during a ban on such aid. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced Abrams November 15, 1991, to two years probation and 100 hours community service. Abrams was pardoned December 24, 1992. Carl R. Channell -- Pleaded guilty April 29, 1987, to one felony count of conspiracy to defraud the United States. U.S. District Judge Stanley S. Harris sentenced Channell on July 7, 1989, to two years probation. Thomas G. Clines -- Indicted February 22, 1990, on four felony counts of underreporting his earnings to the IRS in the 1985 and 1986 tax years; and falsely stating on his 1985 and 1986 tax returns that he had no foreign financial accounts. On September 18, 1990, Clines was found guilty of all charges. U.S. District Judge Norman P. Ramsey in Baltimore, Md., on December 13, 1990, sentenced Clines to 16 months in prison and $40,000 in fines. He was ordered to pay the cost of the prosecution. The Fourth Circuit U.S. Court of Appeals in Richmond, Va., on February 27, 1992, upheld the convictions. Clines served his prison sentence. Alan D. Fiers, Jr. -- Pleaded guilty July 9, 1991, to two misdemeanor counts of withholding information from Congress about secret efforts to aid the Nicaraguan contras. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced Fiers January 31, 1992, to one year probation and 100 hours community service. Fiers was pardoned December 24, 1992. Clair E. George -- Indicted September 6, 1991, on 10 counts of perjury, false statements and obstruction in connection with congressional and Grand Jury investigations. George's trial on nine counts ended in a mistrial on August 26, 1992. Following a second trial on seven counts, George was found guilty December 9, 1992, of two felony charges of false statements and perjury before Congress. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Royce C. Lamberth set sentencing for February 18, 1993. George was pardoned on December 24, 1992, before sentencing occurred. Albert Hakim -- Pleaded guilty November 21, 1989, to a misdemeanor of supplementing the salary of Oliver L. North. Lake Resources Inc., in which Hakim was the principal shareholder, pleaded guilty to a corporate felony of theft of government property in diverting Iran arms sales proceeds to the Nicaraguan contras and other activities. Hakim was sentenced by U.S. District Judge Gerhard A. Gesell on February 1, 1990, to two years probation and a $5,000 fine; Lake Resources was ordered dissolved. Robert C. McFarlane -- Pleaded guilty March 11, 1988, to four misdemeanor counts of withholding information from Congress. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced McFarlane on March 3, 1989, to two years probation, $20,000 in fines and 200 hours community service. McFarlane was pardoned December 24, 1992. Richard R. Miller -- Pleaded guilty May 6, 1987, to one felony count of conspiracy to defraud the United States. U.S. District Judge Stanley S. Harris sentenced Miller on July 6, 1989, to two years probation and 120 hours of community service. Oliver L. North -- Indicted March 16, 1988, on 16 felony counts. After standing trial on 12, North was convicted May 4, 1989 of three charges: accepting an illegal gratuity, aiding and abetting in the obstruction of a congressional inquiry, and destruction of documents. He was sentenced by U.S. District Judge Gerhard A. Gesell on July 5, 1989, to a three-year suspended prison term, two years probation, $150,000 in fines and 1,200 hours community service. A three-judge appeals panel on July 20, 1990, vacated North's conviction for further proceedings to determine whether his immunized testimony influenced witnesses in the trial. The Supreme Court declined to review the case. Judge Gesell dismissed the case September 16, 1991, after hearings on the immunity issue, on the motion of Independent Counsel. John M. Poindexter -- Indicted March 16, 1988, on seven felony charges. After standing trial on five charges, Poindexter was found guilty April 7, 1990, on all counts: conspiracy (obstruction of inquiries and proceedings, false statements, falsification, destruction and removal of documents); two counts of obstruction of Congress and two counts of false statements. U.S. District Judge Harold H. Greene sentenced Poindexter June 11, 1990, to six months in prison on each count, to be served concurrently. A three-judge appeals panel on November 15, 1991, reversed the convictions on the ground that Poindexter's immunized testimony may have influenced the trial testimony of witnesses. The Supreme Court on December 7, 1992, declined to review the case. In 1993, the indictment was dismissed on the motion of Independent Counsel. Richard V. Secord -- Indicted March 16, 1988 on six felony charges. On May 11, 1989, a second indictment was issued charging nine counts of impeding and obstructing the Select Iran/contra Committees. Secord was scheduled to stand trial on 12 charges. He pleaded guilty November 8, 1989, to one felony count of false statements to Congress. Secord was sentenced by U.S. District Chief Judge Aubrey E. Robinson, Jr., on January 24, 1990, to two years probation. Pre-trial Pardons Duane R. Clarridge -- Indicted November 26, 1991, on seven counts of perjury and false statements about a secret shipment of U.S. HAWK missiles to Iran. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Harold H. Greene set a March 15, 1993, trial date. Clarridge was pardoned December 24, 1992. Caspar W. Weinberger -- Indicted June 16, 1992, on five counts of obstruction, perjury and false statements in connection with congressional and Independent Counsel investigations of Iran/ contra. On September 29, the obstruction count was dismissed. On October 30, a second indictment was issued, charging one false statement count. The second indictment was dismissed December 11, leaving four counts remaining. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Thomas F. Hogan set a January 5, 1993, trial date. Weinberger was pardoned December 24, 1992. Dismissal Joseph F. Fernandez -- Indicted June 20, 1988 on five counts of conspiracy to defraud the United States, obstructing the inquiry of the Tower Commission and making false statements to government agencies. The case was dismissed in the District of Columbia for venue reasons on the motion of Independent Counsel. A four-count indictment was issued in the Eastern District of Virginia on April 24, 1989. U.S. District Judge Claude M. Hilton dismissed the four-count case November 24, 1989, after Attorney General Richard Thornburgh blocked the disclosure of classified information ruled relevant to the defense. The U.S. Court of Appeals for the Fourth Circuit in Richmond, Va., on September 6, 1990, upheld Judge Hilton's rulings under the Classified Information Procedures Act (CIPA). On October 12, 1990, the Attorney General filed a final declaration that he would not disclose the classified information. -------------------- Oh, and the above John Poindexter is same the guy the Bushies thought would be a great pick to run the Total Information Awareness part of their domestic spying operation. This article about Obama -- One of his picks didn't pay his taxes correctly? What a hoot for the pathetic peeps attacking PResident Obama. Walt", 
        "intTime": 20090506, 
        "postID": 71, 
        "quote": "", 
        "reply": "Let's go down memory lane. Consider the Nixon administration where the president himself had to be pardoned and the attorney general - highest law enforcment officer - actually went to prison. There were lots of others. Oh, and Reagan - this is just for Iran-Contra. Summary of Prosecutions After Independent Counsel Lawrence E. Walsh's appointment in December 1986, 14 persons were charged with criminal offenses. Eleven persons were convicted, but two convictions were overturned on appeal. Two persons were pardoned before trial and one case was dismissed when the Bush Administration declined to declassify information necessary for trial. On December 24, 1992, President Bush pardoned Caspar W. Weinberger, Duane R. Clarridge, Clair E. George, Elliott Abrams, Alan D. Fiers, Jr., and Robert C. McFarlane. Completed Trials and Pleas Elliott Abrams -- Pleaded guilty October 7, 1991, to two misdemeanor charges of withholding information from Congress about secret government efforts to support the Nicaraguan contra rebels during a ban on such aid. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced Abrams November 15, 1991, to two years probation and 100 hours community service. Abrams was pardoned December 24, 1992. Carl R. Channell -- Pleaded guilty April 29, 1987, to one felony count of conspiracy to defraud the United States. U.S. District Judge Stanley S. Harris sentenced Channell on July 7, 1989, to two years probation. Thomas G. Clines -- Indicted February 22, 1990, on four felony counts of underreporting his earnings to the IRS in the 1985 and 1986 tax years; and falsely stating on his 1985 and 1986 tax returns that he had no foreign financial accounts. On September 18, 1990, Clines was found guilty of all charges. U.S. District Judge Norman P. Ramsey in Baltimore, Md., on December 13, 1990, sentenced Clines to 16 months in prison and $40,000 in fines. He was ordered to pay the cost of the prosecution. The Fourth Circuit U.S. Court of Appeals in Richmond, Va., on February 27, 1992, upheld the convictions. Clines served his prison sentence. Alan D. Fiers, Jr. -- Pleaded guilty July 9, 1991, to two misdemeanor counts of withholding information from Congress about secret efforts to aid the Nicaraguan contras. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced Fiers January 31, 1992, to one year probation and 100 hours community service. Fiers was pardoned December 24, 1992. Clair E. George -- Indicted September 6, 1991, on 10 counts of perjury, false statements and obstruction in connection with congressional and Grand Jury investigations. George's trial on nine counts ended in a mistrial on August 26, 1992. Following a second trial on seven counts, George was found guilty December 9, 1992, of two felony charges of false statements and perjury before Congress. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Royce C. Lamberth set sentencing for February 18, 1993. George was pardoned on December 24, 1992, before sentencing occurred. Albert Hakim -- Pleaded guilty November 21, 1989, to a misdemeanor of supplementing the salary of Oliver L. North. Lake Resources Inc., in which Hakim was the principal shareholder, pleaded guilty to a corporate felony of theft of government property in diverting Iran arms sales proceeds to the Nicaraguan contras and other activities. Hakim was sentenced by U.S. District Judge Gerhard A. Gesell on February 1, 1990, to two years probation and a $5,000 fine; Lake Resources was ordered dissolved. Robert C. McFarlane -- Pleaded guilty March 11, 1988, to four misdemeanor counts of withholding information from Congress. U.S. District Chief Judge Aubrey E. Robinson, Jr., sentenced McFarlane on March 3, 1989, to two years probation, $20,000 in fines and 200 hours community service. McFarlane was pardoned December 24, 1992. Richard R. Miller -- Pleaded guilty May 6, 1987, to one felony count of conspiracy to defraud the United States. U.S. District Judge Stanley S. Harris sentenced Miller on July 6, 1989, to two years probation and 120 hours of community service. Oliver L. North -- Indicted March 16, 1988, on 16 felony counts. After standing trial on 12, North was convicted May 4, 1989 of three charges: accepting an illegal gratuity, aiding and abetting in the obstruction of a congressional inquiry, and destruction of documents. He was sentenced by U.S. District Judge Gerhard A. Gesell on July 5, 1989, to a three-year suspended prison term, two years probation, $150,000 in fines and 1,200 hours community service. A three-judge appeals panel on July 20, 1990, vacated North's conviction for further proceedings to determine whether his immunized testimony influenced witnesses in the trial. The Supreme Court declined to review the case. Judge Gesell dismissed the case September 16, 1991, after hearings on the immunity issue, on the motion of Independent Counsel. John M. Poindexter -- Indicted March 16, 1988, on seven felony charges. After standing trial on five charges, Poindexter was found guilty April 7, 1990, on all counts: conspiracy (obstruction of inquiries and proceedings, false statements, falsification, destruction and removal of documents); two counts of obstruction of Congress and two counts of false statements. U.S. District Judge Harold H. Greene sentenced Poindexter June 11, 1990, to six months in prison on each count, to be served concurrently. A three-judge appeals panel on November 15, 1991, reversed the convictions on the ground that Poindexter's immunized testimony may have influenced the trial testimony of witnesses. The Supreme Court on December 7, 1992, declined to review the case. In 1993, the indictment was dismissed on the motion of Independent Counsel. Richard V. Secord -- Indicted March 16, 1988 on six felony charges. On May 11, 1989, a second indictment was issued charging nine counts of impeding and obstructing the Select Iran/contra Committees. Secord was scheduled to stand trial on 12 charges. He pleaded guilty November 8, 1989, to one felony count of false statements to Congress. Secord was sentenced by U.S. District Chief Judge Aubrey E. Robinson, Jr., on January 24, 1990, to two years probation. Pre-trial Pardons Duane R. Clarridge -- Indicted November 26, 1991, on seven counts of perjury and false statements about a secret shipment of U.S. HAWK missiles to Iran. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Harold H. Greene set a March 15, 1993, trial date. Clarridge was pardoned December 24, 1992. Caspar W. Weinberger -- Indicted June 16, 1992, on five counts of obstruction, perjury and false statements in connection with congressional and Independent Counsel investigations of Iran/ contra. On September 29, the obstruction count was dismissed. On October 30, a second indictment was issued, charging one false statement count. The second indictment was dismissed December 11, leaving four counts remaining. The maximum penalty for each count was five years in prison and $250,000 in fines. U.S. District Judge Thomas F. Hogan set a January 5, 1993, trial date. Weinberger was pardoned December 24, 1992. Dismissal Joseph F. Fernandez -- Indicted June 20, 1988 on five counts of conspiracy to defraud the United States, obstructing the inquiry of the Tower Commission and making false statements to government agencies. The case was dismissed in the District of Columbia for venue reasons on the motion of Independent Counsel. A four-count indictment was issued in the Eastern District of Virginia on April 24, 1989. U.S. District Judge Claude M. Hilton dismissed the four-count case November 24, 1989, after Attorney General Richard Thornburgh blocked the disclosure of classified information ruled relevant to the defense. The U.S. Court of Appeals for the Fourth Circuit in Richmond, Va., on September 6, 1990, upheld Judge Hilton's rulings under the Classified Information Procedures Act (CIPA). On October 12, 1990, the Attorney General filed a final declaration that he would not disclose the classified information. -------------------- Oh, and the above John Poindexter is same the guy the Bushies thought would be a great pick to run the Total Information Awareness part of their domestic spying operation. This article about Obama -- One of his picks didn't pay his taxes correctly? What a hoot for the pathetic peeps attacking PResident Obama. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:40:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt", 
        "intTime": 20090506, 
        "postID": 72, 
        "quote": "Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something?", 
        "reply": " Yes, civics class. CLinton was impeached, but not convicted. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:41:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "Reagan had by far the most corrupt administration ever. \"By the end of his term, 138 Reagan administration officials had been convicted, had been indicted, or had been the subject of official investigations for official misconduct and/or criminal violations. In terms of number of officials involved, the record of his administration was the worst ever.\" 1. Lyn Nofziger--White House Press Secretary - Convicted on charges of illegal lobbying of White House in Wedtech scandal. The lobbying would not have been illegal had he not been White House Press Secretary. 2. Michael Deaver, Reagan's Chief of Staff, received three years' probation and was fined one hundred thousand dollars after being convicted for lying to a congressional subcommittee and a federal grand jury about his lobbying activities after leaving the White House. Same as with Lyn Nofziger. 3. James Watt, Reagan's Secretary of the Interior was indicted on 41 felony counts for using connections at the Department of Housing and Urban Development to help his private clients seek federal funds for housing projects in Maryland, New Jersey, Massachusetts, Puerto Rico and the Virgin Islands. Watt conceded that he had received $500,000 from clients who were granted very favorable housing contracts after he had intervened on their behalf. Watt was eventually sentenced to five years in prison and 500 hours of community service. 4. John Poindexter, Reagan's national security advisor, guilty of five criminal counts involving conspiracy to mislead Congress, obstructing congressional inquiries, lying to lawmakers, used \"high national security\" to mask deceit and wrong-doing... 5. Richard Secord pleaded guilty to a felony charge of lying to Congress over Iran-Contra. Appointed by William Casey to assist Oliver North. 6. Elliott Abrams was appointed by President Reagan in 1985 to head the State Department's Latin American Bureau. He was closely linked with ex-White House aide Lt. Col. Oliver North's covert movement to aid the Contras. Working for North, Abrams coordinated inter-agency support for the contras and helped solicit illegal funding from foreign powers as well as domestic contributors. Abrams agreed to cooperate with Iran-Contra investigators and pled guilty to two charges reduced to misdemeanors. He was sentenced in 1991 to two years probation and 100 hours of community service but was pardoned by President George Bush... 7. Robert C. McFarlane, Reagan's National Security Advisor, pled guilty to four misdemeanors and was sentenced to two years probation and 200 hours of community service. He was also fined $20,000. He received a blanket pardon from President George Bush... 8. Alan D. Fiers was the Chief of the Central Intelligence Agency's Central American Task Force. Fiers pled guilty in 1991 to two counts of withholding information from congress about Oliver North's activities and the diversion of Iran arms sale money to aid the Contras. He was sentenced to one year of probation and 100 hours of community service. Alan Fiers received a blanket pardon for his crimes from President Bush... Thomas G. Clines: convicted of four counts of tax-related offenses for failing to report income from the operations; Carl R. Channel - Office of Public Diplomacy , partner in International Business- first person convicted in the Iran/Contra scandal, pleaded guilty of one count of defrauding the United States Richard R. Miller - Partner with Oliver North in IBC, a Office of Public Diplomacy front group, convicted of conspiracy to defraud the United States. Frank Gomez 13.. Donald Fortier Clair George was Chief of the CIA's Division of Covert Operations under President Reagan. George was convicted of lying to two congressional committees in 1986. George faced a maximum five year federal prison sentence and a $20,000 fine for each of the two convictions. Jurors cleared George of five other charges including two counts of lying to a federal grand jury. Clair George received a blanket pardon for his crimes from President George Bush... Rita Lavelle was indicted, tried and convicted of lying to Congress and served three months of a six-month prison sentence. Philip Winn - Assistant HUD Secretary. Pleaded guilty to one count of scheming to give illegal gratuities. Thomas Demery - Assistand HUD Secretary - pleaded guilty to steering HUD subsidies to politically connected donors. Deborah Gore Dean - executive assistant to Samuel Pierce - indicted on thirteen counts, three counts of conspiracy, one count of accepting an illegal gratuity, four counts of perjury, and five counts of concealing articles. She was convicted on twelve accounts. She appealed and prevailed on several accounts but the convictions for conspiracy remained. Catalina Villaponda - Former US Treasurer Joseph A. Strauss - Accepting kickbacks from developers ------------- More at the link. >http://www.dailykos.com/story/2005/10/17/194133/16< Walt", 
        "intTime": 20090506, 
        "postID": 73, 
        "quote": "", 
        "reply": "Reagan had by far the most corrupt administration ever. \"By the end of his term, 138 Reagan administration officials had been convicted, had been indicted, or had been the subject of official investigations for official misconduct and/or criminal violations. In terms of number of officials involved, the record of his administration was the worst ever.\" 1. Lyn Nofziger--White House Press Secretary - Convicted on charges of illegal lobbying of White House in Wedtech scandal. The lobbying would not have been illegal had he not been White House Press Secretary. 2. Michael Deaver, Reagan's Chief of Staff, received three years' probation and was fined one hundred thousand dollars after being convicted for lying to a congressional subcommittee and a federal grand jury about his lobbying activities after leaving the White House. Same as with Lyn Nofziger. 3. James Watt, Reagan's Secretary of the Interior was indicted on 41 felony counts for using connections at the Department of Housing and Urban Development to help his private clients seek federal funds for housing projects in Maryland, New Jersey, Massachusetts, Puerto Rico and the Virgin Islands. Watt conceded that he had received $500,000 from clients who were granted very favorable housing contracts after he had intervened on their behalf. Watt was eventually sentenced to five years in prison and 500 hours of community service. 4. John Poindexter, Reagan's national security advisor, guilty of five criminal counts involving conspiracy to mislead Congress, obstructing congressional inquiries, lying to lawmakers, used \"high national security\" to mask deceit and wrong-doing... 5. Richard Secord pleaded guilty to a felony charge of lying to Congress over Iran-Contra. Appointed by William Casey to assist Oliver North. 6. Elliott Abrams was appointed by President Reagan in 1985 to head the State Department's Latin American Bureau. He was closely linked with ex-White House aide Lt. Col. Oliver North's covert movement to aid the Contras. Working for North, Abrams coordinated inter-agency support for the contras and helped solicit illegal funding from foreign powers as well as domestic contributors. Abrams agreed to cooperate with Iran-Contra investigators and pled guilty to two charges reduced to misdemeanors. He was sentenced in 1991 to two years probation and 100 hours of community service but was pardoned by President George Bush... 7. Robert C. McFarlane, Reagan's National Security Advisor, pled guilty to four misdemeanors and was sentenced to two years probation and 200 hours of community service. He was also fined $20,000. He received a blanket pardon from President George Bush... 8. Alan D. Fiers was the Chief of the Central Intelligence Agency's Central American Task Force. Fiers pled guilty in 1991 to two counts of withholding information from congress about Oliver North's activities and the diversion of Iran arms sale money to aid the Contras. He was sentenced to one year of probation and 100 hours of community service. Alan Fiers received a blanket pardon for his crimes from President Bush... Thomas G. Clines: convicted of four counts of tax-related offenses for failing to report income from the operations; Carl R. Channel - Office of Public Diplomacy , partner in International Business- first person convicted in the Iran/Contra scandal, pleaded guilty of one count of defrauding the United States Richard R. Miller - Partner with Oliver North in IBC, a Office of Public Diplomacy front group, convicted of conspiracy to defraud the United States. Frank Gomez 13.. Donald Fortier Clair George was Chief of the CIA's Division of Covert Operations under President Reagan. George was convicted of lying to two congressional committees in 1986. George faced a maximum five year federal prison sentence and a $20,000 fine for each of the two convictions. Jurors cleared George of five other charges including two counts of lying to a federal grand jury. Clair George received a blanket pardon for his crimes from President George Bush... Rita Lavelle was indicted, tried and convicted of lying to Congress and served three months of a six-month prison sentence. Philip Winn - Assistant HUD Secretary. Pleaded guilty to one count of scheming to give illegal gratuities. Thomas Demery - Assistand HUD Secretary - pleaded guilty to steering HUD subsidies to politically connected donors. Deborah Gore Dean - executive assistant to Samuel Pierce - indicted on thirteen counts, three counts of conspiracy, one count of accepting an illegal gratuity, four counts of perjury, and five counts of concealing articles. She was convicted on twelve accounts. She appealed and prevailed on several accounts but the convictions for conspiracy remained. Catalina Villaponda - Former US Treasurer Joseph A. Strauss - Accepting kickbacks from developers ------------- More at the link. >http://www.dailykos.com/story/2005/10/17/194133/16< Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 10:46:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt Now now, don't be hard on him. They don't teach civics in school anymore. Apearently \"how our government works\" isn't important enough to spend the time and trouble.", 
        "intTime": 20090506, 
        "postID": 74, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt", 
        "reply": " Now now, don't be hard on him. They don't teach civics in school anymore. Apearently \"how our government works\" isn't important enough to spend the time and trouble.", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:02:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL", 
        "intTime": 20090506, 
        "postID": 75, 
        "quote": "Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt", 
        "reply": " XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:03:00", 
        "title": "Trickle Down Corruption", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL >shrug< Nixon was pardoned, which by definition includes admission of guilt. Walt", 
        "intTime": 20090506, 
        "postID": 76, 
        "quote": "Originally posted by LineDoggie: quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL", 
        "reply": " >shrug< Nixon was pardoned, which by definition includes admission of guilt. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:22:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Impeachment is the first of two stages in a specific process for a legislative body to consider whether or not to forcibly remove a government official from office. The impeachment itself brings the charges against the government. Impeachment does not necessarily result in removal from office; it is only a legal statement of charges, parallel to an indictment in criminal law. An official who is impeached faces a second legislative vote (whether by the same body or another), which determines conviction, or failure to convict, on the charges embodied by the impeachment. \"http://en.wikipedia.org/wiki/Impeachment\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090506, 
        "postID": 77, 
        "quote": "Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something?", 
        "reply": " Impeachment is the first of two stages in a specific process for a legislative body to consider whether or not to forcibly remove a government official from office. The impeachment itself brings the charges against the government. Impeachment does not necessarily result in removal from office; it is only a legal statement of charges, parallel to an indictment in criminal law. An official who is impeached faces a second legislative vote (whether by the same body or another), which determines conviction, or failure to convict, on the charges embodied by the impeachment. \"http://en.wikipedia.org/wiki/Impeachment\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:26:00", 
        "title": "Trickle Down Corruption", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by WhiskeyPapa: quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt Now now, don't be hard on him. They don't teach civics in school anymore. Apearently \"how our government works\" isn't important enough to spend the time and trouble. Well, any American should certainly know that Andrew Johnson was impeached and his trial fell one vote short of conviction. If you don't know the history, you can't be a good citizen. It takes more than just putting out flags and yellow ribbons. And you have to care about what is done in your name. Walt", 
        "intTime": 20090506, 
        "postID": 78, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by WhiskeyPapa: quote: Originally posted by ArtyOps: quote: Originally posted by Ol_Doc: quote: Originally posted by ACR26: quote: Yep, vote republican, we were doing much better then, right? Nahhh. That is not what he is saying. Out of the list from the Repubs...where are they now? Then look at the list of the Dems. Where are they now? Hmmm... So I must conclude. If you are a Repub and do bad things you will be removed from office post haste. If you are a Dem and do bad things then ...I ask you Ol_Doc for your answer. Bill Clinton was impeached for lying about a BJ! Bush and gang will get away with violating nearly every international treaty we've signed regarding treatment of captives. So no, I really don't agree with that argument. I don't recall Bill Clinton being impeached. Did I miss something? Yes, civics class. CLinton was impeached, but not convicted. Walt Now now, don't be hard on him. They don't teach civics in school anymore. Apearently \"how our government works\" isn't important enough to spend the time and trouble.", 
        "reply": " Well, any American should certainly know that Andrew Johnson was impeached and his trial fell one vote short of conviction. If you don't know the history, you can't be a good citizen. It takes more than just putting out flags and yellow ribbons. And you have to care about what is done in your name. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:30:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by LineDoggie: quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL >shrug< Nixon was pardoned, which by definition includes admission of guilt. Walt >Sigh< Nixons Pardon had no consequence on the Supreme Courts ability to hand down a Disbarrment. His pardon would have stopped Potential Criminal consequences", 
        "intTime": 20090506, 
        "postID": 79, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by LineDoggie: quote: Originally posted by WhiskeyPapa: Yes, civics class. CLinton was impeached, but not convicted. Walt XXXhttp://archives.cnn.com/2001/LAW/10/01/scotus.clinton/XXX XXXhttp://archives.cnn.com/2001/ALLPOLITICS/11/09/clinton.bar/XXX Slick Willie was a Perjuror who cut a deal after he was about to be Permanently suspended before the Supreme Court. He lost the ability to practice law for 5 years for his perjury. Even Nixon didnt get that censure LOL >shrug< Nixon was pardoned, which by definition includes admission of guilt. Walt", 
        "reply": " >Sigh< Nixons Pardon had no consequence on the Supreme Courts ability to hand down a Disbarrment. His pardon would have stopped Potential Criminal consequences", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:33:00", 
        "title": "Trickle Down Corruption", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Sorry guys. The facts have a liberal bias. Walt", 
        "intTime": 20090506, 
        "postID": 80, 
        "quote": "", 
        "reply": "Sorry guys. The facts have a liberal bias. Walt", 
        "threadID": "672198221_4190016222001", 
        "time": "2009-05-06 11:48:00", 
        "title": "Trickle Down Corruption", 
        "userID": "WhiskeyPapa"
    }
]