[
    {
        "content": "Petraeus supports closure of Guantanamo LAWRENCEVILLE, Ga. — Closing the military prison at Guantanamo Bay would purge the U.S. of a symbol used by enemies to divide the nation, the head of the U.S. Central Command said Friday. Army Gen. David Petraeus said the U.S. military is \"beat around the head and shoulders\" with images of detainees held in Guantanamo, the facility in Cuba President Barack Obama has vowed to close. He said closing Guantanamo and ensuring detainees are dealt with by an appropriate judicial system would bolster the nation's war effort in Afghanistan and Iraq. \"I do believe very strongly that we should live our values,\" he said. \"Generations of soldiers have fought to defend those values, and we should not shrink from living them, from operationalizing them, on the battlefield.\" Petraeus, who oversees U.S. military involvement throughout the Middle East, Afghanistan and Central Asia, is dealing with another symbol of American hostility after dozens of civilians died in western Afghanistan this month. \"We do not want our soldiers fighting with one arm behind their back; we do not want fair fights. We want our soldiers to be able to employ all the means that we've employed over there to support them and enable them when we make contact with the enemy,\" he said. Read entire article at ... >>>http://www.armytimes.com/news/2009/05/ap_petraeus_gitmoclosing_052909w/", 
        "intTime": 20090530, 
        "postID": 1, 
        "quote": "", 
        "reply": "Petraeus supports closure of Guantanamo LAWRENCEVILLE, Ga. — Closing the military prison at Guantanamo Bay would purge the U.S. of a symbol used by enemies to divide the nation, the head of the U.S. Central Command said Friday. Army Gen. David Petraeus said the U.S. military is \"beat around the head and shoulders\" with images of detainees held in Guantanamo, the facility in Cuba President Barack Obama has vowed to close. He said closing Guantanamo and ensuring detainees are dealt with by an appropriate judicial system would bolster the nation's war effort in Afghanistan and Iraq. \"I do believe very strongly that we should live our values,\" he said. \"Generations of soldiers have fought to defend those values, and we should not shrink from living them, from operationalizing them, on the battlefield.\" Petraeus, who oversees U.S. military involvement throughout the Middle East, Afghanistan and Central Asia, is dealing with another symbol of American hostility after dozens of civilians died in western Afghanistan this month. \"We do not want our soldiers fighting with one arm behind their back; we do not want fair fights. We want our soldiers to be able to employ all the means that we've employed over there to support them and enable them when we make contact with the enemy,\" he said. Read entire article at ... >>>http://www.armytimes.com/news/2009/05/ap_petraeus_gitmoclosing_052909w/", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-30 19:12:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job)", 
        "intTime": 20090530, 
        "postID": 2, 
        "quote": "", 
        "reply": "Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job)", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-30 19:17:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job) You got that right! The General is simply giving \"aid and comfort \" to the enemy. When will we wake up to what these Communist/Socialists are doing? Dave", 
        "intTime": 20090530, 
        "postID": 3, 
        "quote": "Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job)", 
        "reply": " You got that right! The General is simply giving \"aid and comfort \" to the enemy. When will we wake up to what these Communist/Socialists are doing? Dave", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-30 19:27:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job) You got that right! The General is simply giving \"aid and comfort \" to the enemy. When will we wake up to what these Communist/Socialists are doing? Dave The General also say's that in torturing, the United States has indeed violated the Geneva Conventions. It appears to me and to many others who overestimated the political leanings of the General, that he most certainly does \"not\" agree with the radical views of the ultra-orthodox right-wingers of the Republican Party, led by neo-seditionists Limbaugh, Cheney, Savage, and others. He appears very much more in sync with Colin Powell. Oh how very-very right the General is ... This message has been edited. Last edited by: jack_flats, Sun 31 May 2009 02:34 PM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090531, 
        "postID": 4, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job) You got that right! The General is simply giving \"aid and comfort \" to the enemy. When will we wake up to what these Communist/Socialists are doing? Dave", 
        "reply": " The General also say's that in torturing, the United States has indeed violated the Geneva Conventions. It appears to me and to many others who overestimated the political leanings of the General, that he most certainly does \"not\" agree with the radical views of the ultra-orthodox right-wingers of the Republican Party, led by neo-seditionists Limbaugh, Cheney, Savage, and others. He appears very much more in sync with Colin Powell. Oh how very-very right the General is ... This message has been edited. Last edited by: jack_flats, Sun 31 May 2009 02:34 PM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 14:14:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you", 
        "intTime": 20090531, 
        "postID": 5, 
        "quote": "", 
        "reply": "Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 14:26:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you Why you want to believe Bush? Bush also said in all certainty, that the Iraqi's have WMD's, and condoned the outing of active CIA operatives for political purposes. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090531, 
        "postID": 6, 
        "quote": "Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you", 
        "reply": " Why you want to believe Bush? Bush also said in all certainty, that the Iraqi's have WMD's, and condoned the outing of active CIA operatives for political purposes. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 14:33:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Jaaaaack, could you possibly provide a Source or Quote that supports your inane supposition that President Bush Condoned Outing the CIA Employee Plame? By the way Einstein, these Democrats also said Saddam had WMD \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" President Clinton, Feb. 4, 1998-Truth! This was a quote from President Clinton during a presentation at the Pentagon defending a decision to conduct military strikes against Iraq. \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" President Clinton, Feb. 17, 1998-Truth! Bill Clinton went to the Pentagon on this occasion to be briefed by top military officials about Iraq and weapons of mass destruction. His remarks followed that briefing. \"Iraq is a long way from USA but, what happens there matters a great deal here. For the risks that the leaders of a rogue state will use nuclear, chemical or biological weapons against us or our allies is the greatest security threat we face.\" Madeline Albright, Feb 18, 1998-Truth! This is a quote from Albright during an appearance at Ohio State University by Albright, who was Secretary of State for Bill Clinton. \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" Sandy Berger, Clinton National Security Adviser, Feb, 18, 1998-Truth! This was at the same Ohio State University appearance as Madeline Albright. \"We urge you, after consulting with Congress, and consistent with the U.S.Constitution and Laws, to take necessary actions, (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton, signed by Sens. Carl Levin, Tom Daschle, John Kerry, and others Oct. 9, 1998-Truth! According to the U.S. Senate website, the text of this letter was signed by several Senators, both Democrat and Republican, including Senator John McCain and Joseph Lieberman. \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" Rep. Nancy Pelosi (D, CA), Dec. 16, 1998-Truth! The text of this statement by Nancy Pelosi is posted on her congressional website. \"Hussein has .. chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" Madeline Albright, Clinton Secretary of State, Nov. 10, 1999-Truth! This was from an appearance Albright made in Chicago. She was addressing the embargo of Iraq that was in effect at the time and criticism that it may have prevented needed medical supplies from getting into the country. Albright said, \"There has never been an embargo against food and medicine. It's just that Hussein has just not chosen to spend his money on that. Instead, he has chosen to spend his money on building weapons of mass destruction, and palaces for his cronies.\" \"There is no doubt that ... Saddam Hussein has invigorated his weapons programs. Reports indicate that biological, chemical and nuclear programs continue a pace and may be back to pre-Gulf War status. In addition, Saddam continues to redefine delivery systems and is doubtless using the cover of a licit missile program to develop longer-range missiles that will threaten the United States and our allies.\" Letter to President Bush, Signed by Sen. Bob Graham (D, FL,) and others, December 5, 2001Truth! The only letter with this quote from December 5, 2001 that we could find did not include the participation of Senator Bob Graham, but it was signed nine other senators including Democrat Joe Lieberman. It urged President Bush to take quicker action against Iraq. \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandated of the United Nations and is building weapons of mass destruction and the means of delivering them.\" Sen. Carl Levin (D, MI), Sept. 19, 2002-Truth! These were remarks from Senator Levin to a Senate committee on that date. \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" Al Gore, Sept. 23, 2002-Truth! This and the quote below was part of prepared remarks for a speech in San Francisco to The Commonwealth Club. \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" Al Gore, Sept. 23, 2002-Truth! \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" Sen. Ted Kennedy (D, MA), Sept. 27, 2002-Truth! Part of a speech he gave at Johns Hopkins. \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" Sen. Robert Byrd (D, WV), Oct. 3, 2002-Truth! On the floor of the Senate during debate over the resolution that would authorize using force against Iraq. He was urging caution about going to war and commented that even though there was confidence about the weapons in Iraq, there had not been the need to take military action for a number of years and he asked why there would be the need at that point. \"I will be voting to give the President of the United States the authority to use force-- if necessary-- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" Sen. John F. Kerry (D, MA), Oct. 9, 2002-Truth! Senator Kerry's comments were made to the Senate as part of the same debate over the resolution to use force against Saddam Hussein. \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" Sen. Jay Rockefeller (D, WV), Oct 10, 2002-Truth! Senator Rockefeller's statements were a part of the debate over using force against Saddam Hussein. \"He has systematically violated, over the course of the past 11 years, every significant UN resolution that has demanded that he disarm and destroy his chemical and biological weapons, and any nuclear capacity. This he has refused to do\" Rep. Henry Waxman (D, CA), Oct. 10, 2002-Truth! Senator Waxman's contribution to the Senate debate over going to war. \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members. It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" Sen. Hillary Clinton (D, NY), Oct 10, 2002-Truth! Senator Clinton acknowledged the threat of Saddam Hussein but said she did not feel that using force at that time was a good option. \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction So the threat of Saddam Hussein with weapons of mass destruction is real ...\" Sen. John F. Kerry (D, MA), Jan.23.2003-Truth! In a speech to Georgetown University.", 
        "intTime": 20090531, 
        "postID": 7, 
        "quote": "", 
        "reply": "Jaaaaack, could you possibly provide a Source or Quote that supports your inane supposition that President Bush Condoned Outing the CIA Employee Plame? By the way Einstein, these Democrats also said Saddam had WMD \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" President Clinton, Feb. 4, 1998-Truth! This was a quote from President Clinton during a presentation at the Pentagon defending a decision to conduct military strikes against Iraq. \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" President Clinton, Feb. 17, 1998-Truth! Bill Clinton went to the Pentagon on this occasion to be briefed by top military officials about Iraq and weapons of mass destruction. His remarks followed that briefing. \"Iraq is a long way from USA but, what happens there matters a great deal here. For the risks that the leaders of a rogue state will use nuclear, chemical or biological weapons against us or our allies is the greatest security threat we face.\" Madeline Albright, Feb 18, 1998-Truth! This is a quote from Albright during an appearance at Ohio State University by Albright, who was Secretary of State for Bill Clinton. \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" Sandy Berger, Clinton National Security Adviser, Feb, 18, 1998-Truth! This was at the same Ohio State University appearance as Madeline Albright. \"We urge you, after consulting with Congress, and consistent with the U.S.Constitution and Laws, to take necessary actions, (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton, signed by Sens. Carl Levin, Tom Daschle, John Kerry, and others Oct. 9, 1998-Truth! According to the U.S. Senate website, the text of this letter was signed by several Senators, both Democrat and Republican, including Senator John McCain and Joseph Lieberman. \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" Rep. Nancy Pelosi (D, CA), Dec. 16, 1998-Truth! The text of this statement by Nancy Pelosi is posted on her congressional website. \"Hussein has .. chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" Madeline Albright, Clinton Secretary of State, Nov. 10, 1999-Truth! This was from an appearance Albright made in Chicago. She was addressing the embargo of Iraq that was in effect at the time and criticism that it may have prevented needed medical supplies from getting into the country. Albright said, \"There has never been an embargo against food and medicine. It's just that Hussein has just not chosen to spend his money on that. Instead, he has chosen to spend his money on building weapons of mass destruction, and palaces for his cronies.\" \"There is no doubt that ... Saddam Hussein has invigorated his weapons programs. Reports indicate that biological, chemical and nuclear programs continue a pace and may be back to pre-Gulf War status. In addition, Saddam continues to redefine delivery systems and is doubtless using the cover of a licit missile program to develop longer-range missiles that will threaten the United States and our allies.\" Letter to President Bush, Signed by Sen. Bob Graham (D, FL,) and others, December 5, 2001Truth! The only letter with this quote from December 5, 2001 that we could find did not include the participation of Senator Bob Graham, but it was signed nine other senators including Democrat Joe Lieberman. It urged President Bush to take quicker action against Iraq. \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandated of the United Nations and is building weapons of mass destruction and the means of delivering them.\" Sen. Carl Levin (D, MI), Sept. 19, 2002-Truth! These were remarks from Senator Levin to a Senate committee on that date. \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" Al Gore, Sept. 23, 2002-Truth! This and the quote below was part of prepared remarks for a speech in San Francisco to The Commonwealth Club. \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" Al Gore, Sept. 23, 2002-Truth! \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" Sen. Ted Kennedy (D, MA), Sept. 27, 2002-Truth! Part of a speech he gave at Johns Hopkins. \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" Sen. Robert Byrd (D, WV), Oct. 3, 2002-Truth! On the floor of the Senate during debate over the resolution that would authorize using force against Iraq. He was urging caution about going to war and commented that even though there was confidence about the weapons in Iraq, there had not been the need to take military action for a number of years and he asked why there would be the need at that point. \"I will be voting to give the President of the United States the authority to use force-- if necessary-- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" Sen. John F. Kerry (D, MA), Oct. 9, 2002-Truth! Senator Kerry's comments were made to the Senate as part of the same debate over the resolution to use force against Saddam Hussein. \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" Sen. Jay Rockefeller (D, WV), Oct 10, 2002-Truth! Senator Rockefeller's statements were a part of the debate over using force against Saddam Hussein. \"He has systematically violated, over the course of the past 11 years, every significant UN resolution that has demanded that he disarm and destroy his chemical and biological weapons, and any nuclear capacity. This he has refused to do\" Rep. Henry Waxman (D, CA), Oct. 10, 2002-Truth! Senator Waxman's contribution to the Senate debate over going to war. \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members. It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" Sen. Hillary Clinton (D, NY), Oct 10, 2002-Truth! Senator Clinton acknowledged the threat of Saddam Hussein but said she did not feel that using force at that time was a good option. \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction So the threat of Saddam Hussein with weapons of mass destruction is real ...\" Sen. John F. Kerry (D, MA), Jan.23.2003-Truth! In a speech to Georgetown University.", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 15:01:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "It's so terribly easy to Marginalize your inane posts", 
        "intTime": 20090531, 
        "postID": 8, 
        "quote": "", 
        "reply": "It's so terribly easy to Marginalize your inane posts", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 15:02:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you You really ought to e-mail your comment to Mr. Cheney. He regards closing Guantanamo as a risk to the very existance of America... Dave", 
        "intTime": 20090531, 
        "postID": 9, 
        "quote": "Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you", 
        "reply": " You really ought to e-mail your comment to Mr. Cheney. He regards closing Guantanamo as a risk to the very existance of America... Dave", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 17:27:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Jaaaaack, could you possibly provide a Source or Quote that supports your inane supposition that President Bush Condoned Outing the CIA Employee Plame? By the way Einstein, these Democrats also said Saddam had WMD \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" President Clinton, Feb. 4, 1998-Truth! This was a quote from President Clinton during a presentation at the Pentagon defending a decision to conduct military strikes against Iraq. \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" President Clinton, Feb. 17, 1998-Truth! Bill Clinton went to the Pentagon on this occasion to be briefed by top military officials about Iraq and weapons of mass destruction. His remarks followed that briefing. \"Iraq is a long way from USA but, what happens there matters a great deal here. For the risks that the leaders of a rogue state will use nuclear, chemical or biological weapons against us or our allies is the greatest security threat we face.\" Madeline Albright, Feb 18, 1998-Truth! This is a quote from Albright during an appearance at Ohio State University by Albright, who was Secretary of State for Bill Clinton. \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" Sandy Berger, Clinton National Security Adviser, Feb, 18, 1998-Truth! This was at the same Ohio State University appearance as Madeline Albright. \"We urge you, after consulting with Congress, and consistent with the U.S.Constitution and Laws, to take necessary actions, (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton, signed by Sens. Carl Levin, Tom Daschle, John Kerry, and others Oct. 9, 1998-Truth! According to the U.S. Senate website, the text of this letter was signed by several Senators, both Democrat and Republican, including Senator John McCain and Joseph Lieberman. \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" Rep. Nancy Pelosi (D, CA), Dec. 16, 1998-Truth! The text of this statement by Nancy Pelosi is posted on her congressional website. \"Hussein has .. chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" Madeline Albright, Clinton Secretary of State, Nov. 10, 1999-Truth! This was from an appearance Albright made in Chicago. She was addressing the embargo of Iraq that was in effect at the time and criticism that it may have prevented needed medical supplies from getting into the country. Albright said, \"There has never been an embargo against food and medicine. It's just that Hussein has just not chosen to spend his money on that. Instead, he has chosen to spend his money on building weapons of mass destruction, and palaces for his cronies.\" \"There is no doubt that ... Saddam Hussein has invigorated his weapons programs. Reports indicate that biological, chemical and nuclear programs continue a pace and may be back to pre-Gulf War status. In addition, Saddam continues to redefine delivery systems and is doubtless using the cover of a licit missile program to develop longer-range missiles that will threaten the United States and our allies.\" Letter to President Bush, Signed by Sen. Bob Graham (D, FL,) and others, December 5, 2001Truth! The only letter with this quote from December 5, 2001 that we could find did not include the participation of Senator Bob Graham, but it was signed nine other senators including Democrat Joe Lieberman. It urged President Bush to take quicker action against Iraq. \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandated of the United Nations and is building weapons of mass destruction and the means of delivering them.\" Sen. Carl Levin (D, MI), Sept. 19, 2002-Truth! These were remarks from Senator Levin to a Senate committee on that date. \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" Al Gore, Sept. 23, 2002-Truth! This and the quote below was part of prepared remarks for a speech in San Francisco to The Commonwealth Club. \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" Al Gore, Sept. 23, 2002-Truth! \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" Sen. Ted Kennedy (D, MA), Sept. 27, 2002-Truth! Part of a speech he gave at Johns Hopkins. \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" Sen. Robert Byrd (D, WV), Oct. 3, 2002-Truth! On the floor of the Senate during debate over the resolution that would authorize using force against Iraq. He was urging caution about going to war and commented that even though there was confidence about the weapons in Iraq, there had not been the need to take military action for a number of years and he asked why there would be the need at that point. \"I will be voting to give the President of the United States the authority to use force-- if necessary-- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" Sen. John F. Kerry (D, MA), Oct. 9, 2002-Truth! Senator Kerry's comments were made to the Senate as part of the same debate over the resolution to use force against Saddam Hussein. \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" Sen. Jay Rockefeller (D, WV), Oct 10, 2002-Truth! Senator Rockefeller's statements were a part of the debate over using force against Saddam Hussein. \"He has systematically violated, over the course of the past 11 years, every significant UN resolution that has demanded that he disarm and destroy his chemical and biological weapons, and any nuclear capacity. This he has refused to do\" Rep. Henry Waxman (D, CA), Oct. 10, 2002-Truth! Senator Waxman's contribution to the Senate debate over going to war. \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members. It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" Sen. Hillary Clinton (D, NY), Oct 10, 2002-Truth! Senator Clinton acknowledged the threat of Saddam Hussein but said she did not feel that using force at that time was a good option. \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction So the threat of Saddam Hussein with weapons of mass destruction is real ...\" Sen. John F. Kerry (D, MA), Jan.23.2003-Truth! In a speech to Georgetown University. You can post this stuff from today till tommorow. Plain fact is that Sadaam let the inspectors back in, and after innitial delays, Sadaam cooperated with them. And THEY reported that there were no WMD's, and they could finish up in eight weeks. You might also note that Byrd, Waxman, Levin and Kennedy all voted against the war authorisation act. There's a difference between believing Sadaam might still have weapons and deciding to go to war over this. Dave", 
        "intTime": 20090531, 
        "postID": 10, 
        "quote": "Originally posted by LineDoggie: Jaaaaack, could you possibly provide a Source or Quote that supports your inane supposition that President Bush Condoned Outing the CIA Employee Plame? By the way Einstein, these Democrats also said Saddam had WMD \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" President Clinton, Feb. 4, 1998-Truth! This was a quote from President Clinton during a presentation at the Pentagon defending a decision to conduct military strikes against Iraq. \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" President Clinton, Feb. 17, 1998-Truth! Bill Clinton went to the Pentagon on this occasion to be briefed by top military officials about Iraq and weapons of mass destruction. His remarks followed that briefing. \"Iraq is a long way from USA but, what happens there matters a great deal here. For the risks that the leaders of a rogue state will use nuclear, chemical or biological weapons against us or our allies is the greatest security threat we face.\" Madeline Albright, Feb 18, 1998-Truth! This is a quote from Albright during an appearance at Ohio State University by Albright, who was Secretary of State for Bill Clinton. \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" Sandy Berger, Clinton National Security Adviser, Feb, 18, 1998-Truth! This was at the same Ohio State University appearance as Madeline Albright. \"We urge you, after consulting with Congress, and consistent with the U.S.Constitution and Laws, to take necessary actions, (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton, signed by Sens. Carl Levin, Tom Daschle, John Kerry, and others Oct. 9, 1998-Truth! According to the U.S. Senate website, the text of this letter was signed by several Senators, both Democrat and Republican, including Senator John McCain and Joseph Lieberman. \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" Rep. Nancy Pelosi (D, CA), Dec. 16, 1998-Truth! The text of this statement by Nancy Pelosi is posted on her congressional website. \"Hussein has .. chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" Madeline Albright, Clinton Secretary of State, Nov. 10, 1999-Truth! This was from an appearance Albright made in Chicago. She was addressing the embargo of Iraq that was in effect at the time and criticism that it may have prevented needed medical supplies from getting into the country. Albright said, \"There has never been an embargo against food and medicine. It's just that Hussein has just not chosen to spend his money on that. Instead, he has chosen to spend his money on building weapons of mass destruction, and palaces for his cronies.\" \"There is no doubt that ... Saddam Hussein has invigorated his weapons programs. Reports indicate that biological, chemical and nuclear programs continue a pace and may be back to pre-Gulf War status. In addition, Saddam continues to redefine delivery systems and is doubtless using the cover of a licit missile program to develop longer-range missiles that will threaten the United States and our allies.\" Letter to President Bush, Signed by Sen. Bob Graham (D, FL,) and others, December 5, 2001Truth! The only letter with this quote from December 5, 2001 that we could find did not include the participation of Senator Bob Graham, but it was signed nine other senators including Democrat Joe Lieberman. It urged President Bush to take quicker action against Iraq. \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandated of the United Nations and is building weapons of mass destruction and the means of delivering them.\" Sen. Carl Levin (D, MI), Sept. 19, 2002-Truth! These were remarks from Senator Levin to a Senate committee on that date. \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" Al Gore, Sept. 23, 2002-Truth! This and the quote below was part of prepared remarks for a speech in San Francisco to The Commonwealth Club. \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" Al Gore, Sept. 23, 2002-Truth! \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" Sen. Ted Kennedy (D, MA), Sept. 27, 2002-Truth! Part of a speech he gave at Johns Hopkins. \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" Sen. Robert Byrd (D, WV), Oct. 3, 2002-Truth! On the floor of the Senate during debate over the resolution that would authorize using force against Iraq. He was urging caution about going to war and commented that even though there was confidence about the weapons in Iraq, there had not been the need to take military action for a number of years and he asked why there would be the need at that point. \"I will be voting to give the President of the United States the authority to use force-- if necessary-- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" Sen. John F. Kerry (D, MA), Oct. 9, 2002-Truth! Senator Kerry's comments were made to the Senate as part of the same debate over the resolution to use force against Saddam Hussein. \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" Sen. Jay Rockefeller (D, WV), Oct 10, 2002-Truth! Senator Rockefeller's statements were a part of the debate over using force against Saddam Hussein. \"He has systematically violated, over the course of the past 11 years, every significant UN resolution that has demanded that he disarm and destroy his chemical and biological weapons, and any nuclear capacity. This he has refused to do\" Rep. Henry Waxman (D, CA), Oct. 10, 2002-Truth! Senator Waxman's contribution to the Senate debate over going to war. \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members. It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" Sen. Hillary Clinton (D, NY), Oct 10, 2002-Truth! Senator Clinton acknowledged the threat of Saddam Hussein but said she did not feel that using force at that time was a good option. \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction So the threat of Saddam Hussein with weapons of mass destruction is real ...\" Sen. John F. Kerry (D, MA), Jan.23.2003-Truth! In a speech to Georgetown University.", 
        "reply": " You can post this stuff from today till tommorow. Plain fact is that Sadaam let the inspectors back in, and after innitial delays, Sadaam cooperated with them. And THEY reported that there were no WMD's, and they could finish up in eight weeks. You might also note that Byrd, Waxman, Levin and Kennedy all voted against the war authorisation act. There's a difference between believing Sadaam might still have weapons and deciding to go to war over this. Dave", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 17:31:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job) Calling people \"Bushies\", only makes it difficult, in some peoples minds, should the previous President need to be investigated for war crime... It fuels some people to think that political motivation is your only goal... Keep using the term and you will only prevent people from actually seeing what may have taken place in their names... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090531, 
        "postID": 11, 
        "quote": "Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job)", 
        "reply": " Calling people \"Bushies\", only makes it difficult, in some peoples minds, should the previous President need to be investigated for war crime... It fuels some people to think that political motivation is your only goal... Keep using the term and you will only prevent people from actually seeing what may have taken place in their names... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 17:37:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job) You got that right! The General is simply giving \"aid and comfort \" to the enemy. When will we wake up to what these Communist/Socialists are doing? Dave D@mn it Dave, will you keep Chato off the keyboard, he's beginning to make sense again... LOL Respectfully, SUNLINER81", 
        "intTime": 20090531, 
        "postID": 12, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job) You got that right! The General is simply giving \"aid and comfort \" to the enemy. When will we wake up to what these Communist/Socialists are doing? Dave", 
        "reply": " D@mn it Dave, will you keep Chato off the keyboard, he's beginning to make sense again... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 17:39:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job) You got that right! The General is simply giving \"aid and comfort \" to the enemy. When will we wake up to what these Communist/Socialists are doing? Dave The General also say's that in torturing, the United States has indeed violated the Geneva Conventions. It appears to me and to many others who overestimated the political leanings of the General, that he most certainly does \"not\" agree with the radical views of the ultra-orthodox right-wingers of the Republican Party, led by neo-seditionists Limbaugh, Cheney, Savage, and others. He appears very much more in sync with Colin Powell. Oh how very-very right the General is ... Oh, before, when he spoke the truth and you didn't like it, he was a scumbag but now, he's the apple of your eye?... Uh huh... One wonders... Respectfully, SUNLINER81", 
        "intTime": 20090531, 
        "postID": 13, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job) You got that right! The General is simply giving \"aid and comfort \" to the enemy. When will we wake up to what these Communist/Socialists are doing? Dave The General also say's that in torturing, the United States has indeed violated the Geneva Conventions. It appears to me and to many others who overestimated the political leanings of the General, that he most certainly does \"not\" agree with the radical views of the ultra-orthodox right-wingers of the Republican Party, led by neo-seditionists Limbaugh, Cheney, Savage, and others. He appears very much more in sync with Colin Powell. Oh how very-very right the General is ...", 
        "reply": " Oh, before, when he spoke the truth and you didn't like it, he was a scumbag but now, he's the apple of your eye?... Uh huh... One wonders... Respectfully, SUNLINER81", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 17:41:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you Why you want to believe Bush? Bush also said in all certainty, that the Iraqi's have WMD's, and condoned the outing of active CIA operatives for political purposes. Why do you want to believe Petraeus now?... When he was in favor of the surge, you called him \"Betraeus\"... How about some consistency?... One wonders... Respectfully, SUNLINER81", 
        "intTime": 20090531, 
        "postID": 14, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you Why you want to believe Bush? Bush also said in all certainty, that the Iraqi's have WMD's, and condoned the outing of active CIA operatives for political purposes.", 
        "reply": " Why do you want to believe Petraeus now?... When he was in favor of the surge, you called him \"Betraeus\"... How about some consistency?... One wonders... Respectfully, SUNLINER81", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 17:43:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Jaaaaack, could you possibly provide a Source or Quote that supports your inane supposition that President Bush Condoned Outing the CIA Employee Plame? By the way Einstein, these Democrats also said Saddam had WMD \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" President Clinton, Feb. 4, 1998-Truth! This was a quote from President Clinton during a presentation at the Pentagon defending a decision to conduct military strikes against Iraq. \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" President Clinton, Feb. 17, 1998-Truth! Bill Clinton went to the Pentagon on this occasion to be briefed by top military officials about Iraq and weapons of mass destruction. His remarks followed that briefing. \"Iraq is a long way from USA but, what happens there matters a great deal here. For the risks that the leaders of a rogue state will use nuclear, chemical or biological weapons against us or our allies is the greatest security threat we face.\" Madeline Albright, Feb 18, 1998-Truth! This is a quote from Albright during an appearance at Ohio State University by Albright, who was Secretary of State for Bill Clinton. \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" Sandy Berger, Clinton National Security Adviser, Feb, 18, 1998-Truth! This was at the same Ohio State University appearance as Madeline Albright. \"We urge you, after consulting with Congress, and consistent with the U.S.Constitution and Laws, to take necessary actions, (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton, signed by Sens. Carl Levin, Tom Daschle, John Kerry, and others Oct. 9, 1998-Truth! According to the U.S. Senate website, the text of this letter was signed by several Senators, both Democrat and Republican, including Senator John McCain and Joseph Lieberman. \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" Rep. Nancy Pelosi (D, CA), Dec. 16, 1998-Truth! The text of this statement by Nancy Pelosi is posted on her congressional website. \"Hussein has .. chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" Madeline Albright, Clinton Secretary of State, Nov. 10, 1999-Truth! This was from an appearance Albright made in Chicago. She was addressing the embargo of Iraq that was in effect at the time and criticism that it may have prevented needed medical supplies from getting into the country. Albright said, \"There has never been an embargo against food and medicine. It's just that Hussein has just not chosen to spend his money on that. Instead, he has chosen to spend his money on building weapons of mass destruction, and palaces for his cronies.\" \"There is no doubt that ... Saddam Hussein has invigorated his weapons programs. Reports indicate that biological, chemical and nuclear programs continue a pace and may be back to pre-Gulf War status. In addition, Saddam continues to redefine delivery systems and is doubtless using the cover of a licit missile program to develop longer-range missiles that will threaten the United States and our allies.\" Letter to President Bush, Signed by Sen. Bob Graham (D, FL,) and others, December 5, 2001Truth! The only letter with this quote from December 5, 2001 that we could find did not include the participation of Senator Bob Graham, but it was signed nine other senators including Democrat Joe Lieberman. It urged President Bush to take quicker action against Iraq. \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandated of the United Nations and is building weapons of mass destruction and the means of delivering them.\" Sen. Carl Levin (D, MI), Sept. 19, 2002-Truth! These were remarks from Senator Levin to a Senate committee on that date. \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" Al Gore, Sept. 23, 2002-Truth! This and the quote below was part of prepared remarks for a speech in San Francisco to The Commonwealth Club. \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" Al Gore, Sept. 23, 2002-Truth! \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" Sen. Ted Kennedy (D, MA), Sept. 27, 2002-Truth! Part of a speech he gave at Johns Hopkins. \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" Sen. Robert Byrd (D, WV), Oct. 3, 2002-Truth! On the floor of the Senate during debate over the resolution that would authorize using force against Iraq. He was urging caution about going to war and commented that even though there was confidence about the weapons in Iraq, there had not been the need to take military action for a number of years and he asked why there would be the need at that point. \"I will be voting to give the President of the United States the authority to use force-- if necessary-- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" Sen. John F. Kerry (D, MA), Oct. 9, 2002-Truth! Senator Kerry's comments were made to the Senate as part of the same debate over the resolution to use force against Saddam Hussein. \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" Sen. Jay Rockefeller (D, WV), Oct 10, 2002-Truth! Senator Rockefeller's statements were a part of the debate over using force against Saddam Hussein. \"He has systematically violated, over the course of the past 11 years, every significant UN resolution that has demanded that he disarm and destroy his chemical and biological weapons, and any nuclear capacity. This he has refused to do\" Rep. Henry Waxman (D, CA), Oct. 10, 2002-Truth! Senator Waxman's contribution to the Senate debate over going to war. \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members. It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" Sen. Hillary Clinton (D, NY), Oct 10, 2002-Truth! Senator Clinton acknowledged the threat of Saddam Hussein but said she did not feel that using force at that time was a good option. \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction So the threat of Saddam Hussein with weapons of mass destruction is real ...\" Sen. John F. Kerry (D, MA), Jan.23.2003-Truth! In a speech to Georgetown University. They, the Democrats you listed, may have been reading and believing the same intelligence as Bush did, but they didn't decide to go to war over it, like your hero George W. did. It was becoming very-very clear that the UN nuke hunters were finding nothing in their search of Iraq nukes, but Bush cut them short and invaded Iraq, because he needed that excuse to invade. So, did you suddenly find some new words to insult and degrade those who disagree with you, namely, \"i-n-a-n-e\" and \"m-o-o-k-s.\" Does it make you feel more of a man, because it only shows to me that you can't handle a good argument without losing your cool and calling people silly names that in any civil conversation would be considered insulting.", 
        "intTime": 20090531, 
        "postID": 15, 
        "quote": "Originally posted by LineDoggie: Jaaaaack, could you possibly provide a Source or Quote that supports your inane supposition that President Bush Condoned Outing the CIA Employee Plame? By the way Einstein, these Democrats also said Saddam had WMD \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" President Clinton, Feb. 4, 1998-Truth! This was a quote from President Clinton during a presentation at the Pentagon defending a decision to conduct military strikes against Iraq. \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" President Clinton, Feb. 17, 1998-Truth! Bill Clinton went to the Pentagon on this occasion to be briefed by top military officials about Iraq and weapons of mass destruction. His remarks followed that briefing. \"Iraq is a long way from USA but, what happens there matters a great deal here. For the risks that the leaders of a rogue state will use nuclear, chemical or biological weapons against us or our allies is the greatest security threat we face.\" Madeline Albright, Feb 18, 1998-Truth! This is a quote from Albright during an appearance at Ohio State University by Albright, who was Secretary of State for Bill Clinton. \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" Sandy Berger, Clinton National Security Adviser, Feb, 18, 1998-Truth! This was at the same Ohio State University appearance as Madeline Albright. \"We urge you, after consulting with Congress, and consistent with the U.S.Constitution and Laws, to take necessary actions, (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton, signed by Sens. Carl Levin, Tom Daschle, John Kerry, and others Oct. 9, 1998-Truth! According to the U.S. Senate website, the text of this letter was signed by several Senators, both Democrat and Republican, including Senator John McCain and Joseph Lieberman. \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" Rep. Nancy Pelosi (D, CA), Dec. 16, 1998-Truth! The text of this statement by Nancy Pelosi is posted on her congressional website. \"Hussein has .. chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" Madeline Albright, Clinton Secretary of State, Nov. 10, 1999-Truth! This was from an appearance Albright made in Chicago. She was addressing the embargo of Iraq that was in effect at the time and criticism that it may have prevented needed medical supplies from getting into the country. Albright said, \"There has never been an embargo against food and medicine. It's just that Hussein has just not chosen to spend his money on that. Instead, he has chosen to spend his money on building weapons of mass destruction, and palaces for his cronies.\" \"There is no doubt that ... Saddam Hussein has invigorated his weapons programs. Reports indicate that biological, chemical and nuclear programs continue a pace and may be back to pre-Gulf War status. In addition, Saddam continues to redefine delivery systems and is doubtless using the cover of a licit missile program to develop longer-range missiles that will threaten the United States and our allies.\" Letter to President Bush, Signed by Sen. Bob Graham (D, FL,) and others, December 5, 2001Truth! The only letter with this quote from December 5, 2001 that we could find did not include the participation of Senator Bob Graham, but it was signed nine other senators including Democrat Joe Lieberman. It urged President Bush to take quicker action against Iraq. \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandated of the United Nations and is building weapons of mass destruction and the means of delivering them.\" Sen. Carl Levin (D, MI), Sept. 19, 2002-Truth! These were remarks from Senator Levin to a Senate committee on that date. \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" Al Gore, Sept. 23, 2002-Truth! This and the quote below was part of prepared remarks for a speech in San Francisco to The Commonwealth Club. \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" Al Gore, Sept. 23, 2002-Truth! \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" Sen. Ted Kennedy (D, MA), Sept. 27, 2002-Truth! Part of a speech he gave at Johns Hopkins. \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" Sen. Robert Byrd (D, WV), Oct. 3, 2002-Truth! On the floor of the Senate during debate over the resolution that would authorize using force against Iraq. He was urging caution about going to war and commented that even though there was confidence about the weapons in Iraq, there had not been the need to take military action for a number of years and he asked why there would be the need at that point. \"I will be voting to give the President of the United States the authority to use force-- if necessary-- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" Sen. John F. Kerry (D, MA), Oct. 9, 2002-Truth! Senator Kerry's comments were made to the Senate as part of the same debate over the resolution to use force against Saddam Hussein. \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" Sen. Jay Rockefeller (D, WV), Oct 10, 2002-Truth! Senator Rockefeller's statements were a part of the debate over using force against Saddam Hussein. \"He has systematically violated, over the course of the past 11 years, every significant UN resolution that has demanded that he disarm and destroy his chemical and biological weapons, and any nuclear capacity. This he has refused to do\" Rep. Henry Waxman (D, CA), Oct. 10, 2002-Truth! Senator Waxman's contribution to the Senate debate over going to war. \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members. It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" Sen. Hillary Clinton (D, NY), Oct 10, 2002-Truth! Senator Clinton acknowledged the threat of Saddam Hussein but said she did not feel that using force at that time was a good option. \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction So the threat of Saddam Hussein with weapons of mass destruction is real ...\" Sen. John F. Kerry (D, MA), Jan.23.2003-Truth! In a speech to Georgetown University.", 
        "reply": " They, the Democrats you listed, may have been reading and believing the same intelligence as Bush did, but they didn't decide to go to war over it, like your hero George W. did. It was becoming very-very clear that the UN nuke hunters were finding nothing in their search of Iraq nukes, but Bush cut them short and invaded Iraq, because he needed that excuse to invade. So, did you suddenly find some new words to insult and degrade those who disagree with you, namely, \"i-n-a-n-e\" and \"m-o-o-k-s.\" Does it make you feel more of a man, because it only shows to me that you can't handle a good argument without losing your cool and calling people silly names that in any civil conversation would be considered insulting.", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 19:33:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "JRRutherford"
    }, 
    {
        "content": "Ahhh, the Other Bookend has arrived", 
        "intTime": 20090531, 
        "postID": 16, 
        "quote": "", 
        "reply": "Ahhh, the Other Bookend has arrived", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 19:34:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you Why you want to believe Bush? Bush also said in all certainty, that the Iraqi's have WMD's, and condoned the outing of active CIA operatives for political purposes. Why do you want to believe Petraeus now?... When he was in favor of the surge, you called him \"Betraeus\"... How about some consistency?... One wonders... Respectfully, SUNLINER81 I'll have to admit sunliner, you had me going. I just did a search of all my posts and looked for the words \"scumbag\" and \"Betraeus\" in any of them, only to come up empty. I was sure I never used those words to describe the General. I wasn't a very big fan of his for the longest time, but I didn't quite remember describing him that way when I may have posted my concerns about the man. Perhaps you should try vetting what you post about someone before you actually press \"send\" on this public forum. By the way, if the \"surge\" was so much of a success, why are there still American GI's and Iraqi's still dying there? Another one of a George Bush-like \"Mission Accomplished\" claim before it really came to pass ... perhaps???? Thank You. This message has been edited. Last edited by: jack_flats, Sun 31 May 2009 09:30 PM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090531, 
        "postID": 17, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you Why you want to believe Bush? Bush also said in all certainty, that the Iraqi's have WMD's, and condoned the outing of active CIA operatives for political purposes. Why do you want to believe Petraeus now?... When he was in favor of the surge, you called him \"Betraeus\"... How about some consistency?... One wonders... Respectfully, SUNLINER81", 
        "reply": " I'll have to admit sunliner, you had me going. I just did a search of all my posts and looked for the words \"scumbag\" and \"Betraeus\" in any of them, only to come up empty. I was sure I never used those words to describe the General. I wasn't a very big fan of his for the longest time, but I didn't quite remember describing him that way when I may have posted my concerns about the man. Perhaps you should try vetting what you post about someone before you actually press \"send\" on this public forum. By the way, if the \"surge\" was so much of a success, why are there still American GI's and Iraqi's still dying there? Another one of a George Bush-like \"Mission Accomplished\" claim before it really came to pass ... perhaps???? Thank You. This message has been edited. Last edited by: jack_flats, Sun 31 May 2009 09:30 PM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 20:21:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: It's so terribly easy to Marginalize your inane posts \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090531, 
        "postID": 18, 
        "quote": "Originally posted by LineDoggie: It's so terribly easy to Marginalize your inane posts", 
        "reply": " \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 20:23:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: It's so terribly easy to Marginalize your inane posts Yup, that's what we think of your posts Inane, Obtuse, & Pathetic.", 
        "intTime": 20090531, 
        "postID": 19, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by LineDoggie: It's so terribly easy to Marginalize your inane posts", 
        "reply": " Yup, that's what we think of your posts Inane, Obtuse, & Pathetic.", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 20:31:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by SUNLINER81: quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you Why you want to believe Bush? Bush also said in all certainty, that the Iraqi's have WMD's, and condoned the outing of active CIA operatives for political purposes. Why do you want to believe Petraeus now?... When he was in favor of the surge, you called him \"Betraeus\"... How about some consistency?... One wonders... Respectfully, SUNLINER81 I'll have to admit sunliner, you had me going. I just did a search of all my posts and looked for the words \"scumbag\" and \"Betraeus\" in any of them, only to come up empty. I was sure I never used those words to describe the General. I wasn't a very big fan of his for the longest time, but I didn't quite remember describing him that way when I may have posted my concerns about the man. Perhaps you should try vetting what you post about someone before you actually press \"send\" on this public forum. Thank You. Let's see, you supported those articles that called the general Betrayus when they were discussed on here and then of course, you support those that singled out Petraeus for ridicule and so I guess in your mind if you can't find where you used those exact words, hey it's o.k., right?... You forget, there are too many of us on here that remember the stances that you have taken in the past... NEXT!... Respectfully, SUNLINER81", 
        "intTime": 20090531, 
        "postID": 20, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by SUNLINER81: quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you Why you want to believe Bush? Bush also said in all certainty, that the Iraqi's have WMD's, and condoned the outing of active CIA operatives for political purposes. Why do you want to believe Petraeus now?... When he was in favor of the surge, you called him \"Betraeus\"... How about some consistency?... One wonders... Respectfully, SUNLINER81 I'll have to admit sunliner, you had me going. I just did a search of all my posts and looked for the words \"scumbag\" and \"Betraeus\" in any of them, only to come up empty. I was sure I never used those words to describe the General. I wasn't a very big fan of his for the longest time, but I didn't quite remember describing him that way when I may have posted my concerns about the man. Perhaps you should try vetting what you post about someone before you actually press \"send\" on this public forum. Thank You.", 
        "reply": " Let's see, you supported those articles that called the general Betrayus when they were discussed on here and then of course, you support those that singled out Petraeus for ridicule and so I guess in your mind if you can't find where you used those exact words, hey it's o.k., right?... You forget, there are too many of us on here that remember the stances that you have taken in the past... NEXT!... Respectfully, SUNLINER81", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 21:30:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Petraeus supports closure of Guantanamo LAWRENCEVILLE, Ga. — Closing the military prison at Guantanamo Bay would purge the U.S. of a symbol used by enemies to divide the nation, the head of the U.S. Central Command said Friday. Army Gen. David Petraeus said the U.S. military is \"beat around the head and shoulders\" with images of detainees held in Guantanamo, the facility in Cuba President Barack Obama has vowed to close. He said closing Guantanamo and ensuring detainees are dealt with by an appropriate judicial system would bolster the nation's war effort in Afghanistan and Iraq. \"I do believe very strongly that we should live our values,\" he said. \"Generations of soldiers have fought to defend those values, and we should not shrink from living them, from operationalizing them, on the battlefield.\" Petraeus, who oversees U.S. military involvement throughout the Middle East, Afghanistan and Central Asia, is dealing with another symbol of American hostility after dozens of civilians died in western Afghanistan this month. \"We do not want our soldiers fighting with one arm behind their back; we do not want fair fights. We want our soldiers to be able to employ all the means that we've employed over there to support them and enable them when we make contact with the enemy,\" he said. Read entire article at ... >>>http://www.armytimes.com/news/2009/05/ap_petraeus_gitmoclosing_052909w/", 
        "intTime": 20090530, 
        "postID": 21, 
        "quote": "", 
        "reply": "Petraeus supports closure of Guantanamo LAWRENCEVILLE, Ga. — Closing the military prison at Guantanamo Bay would purge the U.S. of a symbol used by enemies to divide the nation, the head of the U.S. Central Command said Friday. Army Gen. David Petraeus said the U.S. military is \"beat around the head and shoulders\" with images of detainees held in Guantanamo, the facility in Cuba President Barack Obama has vowed to close. He said closing Guantanamo and ensuring detainees are dealt with by an appropriate judicial system would bolster the nation's war effort in Afghanistan and Iraq. \"I do believe very strongly that we should live our values,\" he said. \"Generations of soldiers have fought to defend those values, and we should not shrink from living them, from operationalizing them, on the battlefield.\" Petraeus, who oversees U.S. military involvement throughout the Middle East, Afghanistan and Central Asia, is dealing with another symbol of American hostility after dozens of civilians died in western Afghanistan this month. \"We do not want our soldiers fighting with one arm behind their back; we do not want fair fights. We want our soldiers to be able to employ all the means that we've employed over there to support them and enable them when we make contact with the enemy,\" he said. Read entire article at ... >>>http://www.armytimes.com/news/2009/05/ap_petraeus_gitmoclosing_052909w/", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-30 19:12:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job)", 
        "intTime": 20090530, 
        "postID": 22, 
        "quote": "", 
        "reply": "Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job)", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-30 19:17:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job) You got that right! The General is simply giving \"aid and comfort \" to the enemy. When will we wake up to what these Communist/Socialists are doing? Dave", 
        "intTime": 20090530, 
        "postID": 23, 
        "quote": "Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job)", 
        "reply": " You got that right! The General is simply giving \"aid and comfort \" to the enemy. When will we wake up to what these Communist/Socialists are doing? Dave", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-30 19:27:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job) You got that right! The General is simply giving \"aid and comfort \" to the enemy. When will we wake up to what these Communist/Socialists are doing? Dave The General also say's that in torturing, the United States has indeed violated the Geneva Conventions. It appears to me and to many others who overestimated the political leanings of the General, that he most certainly does \"not\" agree with the radical views of the ultra-orthodox right-wingers of the Republican Party, led by neo-seditionists Limbaugh, Cheney, Savage, and others. He appears very much more in sync with Colin Powell. Oh how very-very right the General is ... This message has been edited. Last edited by: jack_flats, Sun 31 May 2009 02:34 PM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090531, 
        "postID": 24, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job) You got that right! The General is simply giving \"aid and comfort \" to the enemy. When will we wake up to what these Communist/Socialists are doing? Dave", 
        "reply": " The General also say's that in torturing, the United States has indeed violated the Geneva Conventions. It appears to me and to many others who overestimated the political leanings of the General, that he most certainly does \"not\" agree with the radical views of the ultra-orthodox right-wingers of the Republican Party, led by neo-seditionists Limbaugh, Cheney, Savage, and others. He appears very much more in sync with Colin Powell. Oh how very-very right the General is ... This message has been edited. Last edited by: jack_flats, Sun 31 May 2009 02:34 PM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 14:14:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you", 
        "intTime": 20090531, 
        "postID": 25, 
        "quote": "", 
        "reply": "Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 14:26:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you Why you want to believe Bush? Bush also said in all certainty, that the Iraqi's have WMD's, and condoned the outing of active CIA operatives for political purposes. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090531, 
        "postID": 26, 
        "quote": "Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you", 
        "reply": " Why you want to believe Bush? Bush also said in all certainty, that the Iraqi's have WMD's, and condoned the outing of active CIA operatives for political purposes. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 14:33:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Jaaaaack, could you possibly provide a Source or Quote that supports your inane supposition that President Bush Condoned Outing the CIA Employee Plame? By the way Einstein, these Democrats also said Saddam had WMD \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" President Clinton, Feb. 4, 1998-Truth! This was a quote from President Clinton during a presentation at the Pentagon defending a decision to conduct military strikes against Iraq. \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" President Clinton, Feb. 17, 1998-Truth! Bill Clinton went to the Pentagon on this occasion to be briefed by top military officials about Iraq and weapons of mass destruction. His remarks followed that briefing. \"Iraq is a long way from USA but, what happens there matters a great deal here. For the risks that the leaders of a rogue state will use nuclear, chemical or biological weapons against us or our allies is the greatest security threat we face.\" Madeline Albright, Feb 18, 1998-Truth! This is a quote from Albright during an appearance at Ohio State University by Albright, who was Secretary of State for Bill Clinton. \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" Sandy Berger, Clinton National Security Adviser, Feb, 18, 1998-Truth! This was at the same Ohio State University appearance as Madeline Albright. \"We urge you, after consulting with Congress, and consistent with the U.S.Constitution and Laws, to take necessary actions, (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton, signed by Sens. Carl Levin, Tom Daschle, John Kerry, and others Oct. 9, 1998-Truth! According to the U.S. Senate website, the text of this letter was signed by several Senators, both Democrat and Republican, including Senator John McCain and Joseph Lieberman. \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" Rep. Nancy Pelosi (D, CA), Dec. 16, 1998-Truth! The text of this statement by Nancy Pelosi is posted on her congressional website. \"Hussein has .. chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" Madeline Albright, Clinton Secretary of State, Nov. 10, 1999-Truth! This was from an appearance Albright made in Chicago. She was addressing the embargo of Iraq that was in effect at the time and criticism that it may have prevented needed medical supplies from getting into the country. Albright said, \"There has never been an embargo against food and medicine. It's just that Hussein has just not chosen to spend his money on that. Instead, he has chosen to spend his money on building weapons of mass destruction, and palaces for his cronies.\" \"There is no doubt that ... Saddam Hussein has invigorated his weapons programs. Reports indicate that biological, chemical and nuclear programs continue a pace and may be back to pre-Gulf War status. In addition, Saddam continues to redefine delivery systems and is doubtless using the cover of a licit missile program to develop longer-range missiles that will threaten the United States and our allies.\" Letter to President Bush, Signed by Sen. Bob Graham (D, FL,) and others, December 5, 2001Truth! The only letter with this quote from December 5, 2001 that we could find did not include the participation of Senator Bob Graham, but it was signed nine other senators including Democrat Joe Lieberman. It urged President Bush to take quicker action against Iraq. \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandated of the United Nations and is building weapons of mass destruction and the means of delivering them.\" Sen. Carl Levin (D, MI), Sept. 19, 2002-Truth! These were remarks from Senator Levin to a Senate committee on that date. \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" Al Gore, Sept. 23, 2002-Truth! This and the quote below was part of prepared remarks for a speech in San Francisco to The Commonwealth Club. \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" Al Gore, Sept. 23, 2002-Truth! \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" Sen. Ted Kennedy (D, MA), Sept. 27, 2002-Truth! Part of a speech he gave at Johns Hopkins. \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" Sen. Robert Byrd (D, WV), Oct. 3, 2002-Truth! On the floor of the Senate during debate over the resolution that would authorize using force against Iraq. He was urging caution about going to war and commented that even though there was confidence about the weapons in Iraq, there had not been the need to take military action for a number of years and he asked why there would be the need at that point. \"I will be voting to give the President of the United States the authority to use force-- if necessary-- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" Sen. John F. Kerry (D, MA), Oct. 9, 2002-Truth! Senator Kerry's comments were made to the Senate as part of the same debate over the resolution to use force against Saddam Hussein. \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" Sen. Jay Rockefeller (D, WV), Oct 10, 2002-Truth! Senator Rockefeller's statements were a part of the debate over using force against Saddam Hussein. \"He has systematically violated, over the course of the past 11 years, every significant UN resolution that has demanded that he disarm and destroy his chemical and biological weapons, and any nuclear capacity. This he has refused to do\" Rep. Henry Waxman (D, CA), Oct. 10, 2002-Truth! Senator Waxman's contribution to the Senate debate over going to war. \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members. It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" Sen. Hillary Clinton (D, NY), Oct 10, 2002-Truth! Senator Clinton acknowledged the threat of Saddam Hussein but said she did not feel that using force at that time was a good option. \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction So the threat of Saddam Hussein with weapons of mass destruction is real ...\" Sen. John F. Kerry (D, MA), Jan.23.2003-Truth! In a speech to Georgetown University.", 
        "intTime": 20090531, 
        "postID": 27, 
        "quote": "", 
        "reply": "Jaaaaack, could you possibly provide a Source or Quote that supports your inane supposition that President Bush Condoned Outing the CIA Employee Plame? By the way Einstein, these Democrats also said Saddam had WMD \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" President Clinton, Feb. 4, 1998-Truth! This was a quote from President Clinton during a presentation at the Pentagon defending a decision to conduct military strikes against Iraq. \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" President Clinton, Feb. 17, 1998-Truth! Bill Clinton went to the Pentagon on this occasion to be briefed by top military officials about Iraq and weapons of mass destruction. His remarks followed that briefing. \"Iraq is a long way from USA but, what happens there matters a great deal here. For the risks that the leaders of a rogue state will use nuclear, chemical or biological weapons against us or our allies is the greatest security threat we face.\" Madeline Albright, Feb 18, 1998-Truth! This is a quote from Albright during an appearance at Ohio State University by Albright, who was Secretary of State for Bill Clinton. \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" Sandy Berger, Clinton National Security Adviser, Feb, 18, 1998-Truth! This was at the same Ohio State University appearance as Madeline Albright. \"We urge you, after consulting with Congress, and consistent with the U.S.Constitution and Laws, to take necessary actions, (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton, signed by Sens. Carl Levin, Tom Daschle, John Kerry, and others Oct. 9, 1998-Truth! According to the U.S. Senate website, the text of this letter was signed by several Senators, both Democrat and Republican, including Senator John McCain and Joseph Lieberman. \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" Rep. Nancy Pelosi (D, CA), Dec. 16, 1998-Truth! The text of this statement by Nancy Pelosi is posted on her congressional website. \"Hussein has .. chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" Madeline Albright, Clinton Secretary of State, Nov. 10, 1999-Truth! This was from an appearance Albright made in Chicago. She was addressing the embargo of Iraq that was in effect at the time and criticism that it may have prevented needed medical supplies from getting into the country. Albright said, \"There has never been an embargo against food and medicine. It's just that Hussein has just not chosen to spend his money on that. Instead, he has chosen to spend his money on building weapons of mass destruction, and palaces for his cronies.\" \"There is no doubt that ... Saddam Hussein has invigorated his weapons programs. Reports indicate that biological, chemical and nuclear programs continue a pace and may be back to pre-Gulf War status. In addition, Saddam continues to redefine delivery systems and is doubtless using the cover of a licit missile program to develop longer-range missiles that will threaten the United States and our allies.\" Letter to President Bush, Signed by Sen. Bob Graham (D, FL,) and others, December 5, 2001Truth! The only letter with this quote from December 5, 2001 that we could find did not include the participation of Senator Bob Graham, but it was signed nine other senators including Democrat Joe Lieberman. It urged President Bush to take quicker action against Iraq. \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandated of the United Nations and is building weapons of mass destruction and the means of delivering them.\" Sen. Carl Levin (D, MI), Sept. 19, 2002-Truth! These were remarks from Senator Levin to a Senate committee on that date. \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" Al Gore, Sept. 23, 2002-Truth! This and the quote below was part of prepared remarks for a speech in San Francisco to The Commonwealth Club. \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" Al Gore, Sept. 23, 2002-Truth! \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" Sen. Ted Kennedy (D, MA), Sept. 27, 2002-Truth! Part of a speech he gave at Johns Hopkins. \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" Sen. Robert Byrd (D, WV), Oct. 3, 2002-Truth! On the floor of the Senate during debate over the resolution that would authorize using force against Iraq. He was urging caution about going to war and commented that even though there was confidence about the weapons in Iraq, there had not been the need to take military action for a number of years and he asked why there would be the need at that point. \"I will be voting to give the President of the United States the authority to use force-- if necessary-- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" Sen. John F. Kerry (D, MA), Oct. 9, 2002-Truth! Senator Kerry's comments were made to the Senate as part of the same debate over the resolution to use force against Saddam Hussein. \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" Sen. Jay Rockefeller (D, WV), Oct 10, 2002-Truth! Senator Rockefeller's statements were a part of the debate over using force against Saddam Hussein. \"He has systematically violated, over the course of the past 11 years, every significant UN resolution that has demanded that he disarm and destroy his chemical and biological weapons, and any nuclear capacity. This he has refused to do\" Rep. Henry Waxman (D, CA), Oct. 10, 2002-Truth! Senator Waxman's contribution to the Senate debate over going to war. \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members. It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" Sen. Hillary Clinton (D, NY), Oct 10, 2002-Truth! Senator Clinton acknowledged the threat of Saddam Hussein but said she did not feel that using force at that time was a good option. \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction So the threat of Saddam Hussein with weapons of mass destruction is real ...\" Sen. John F. Kerry (D, MA), Jan.23.2003-Truth! In a speech to Georgetown University.", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 15:01:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "It's so terribly easy to Marginalize your inane posts", 
        "intTime": 20090531, 
        "postID": 28, 
        "quote": "", 
        "reply": "It's so terribly easy to Marginalize your inane posts", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 15:02:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you You really ought to e-mail your comment to Mr. Cheney. He regards closing Guantanamo as a risk to the very existance of America... Dave", 
        "intTime": 20090531, 
        "postID": 29, 
        "quote": "Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you", 
        "reply": " You really ought to e-mail your comment to Mr. Cheney. He regards closing Guantanamo as a risk to the very existance of America... Dave", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 17:27:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Jaaaaack, could you possibly provide a Source or Quote that supports your inane supposition that President Bush Condoned Outing the CIA Employee Plame? By the way Einstein, these Democrats also said Saddam had WMD \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" President Clinton, Feb. 4, 1998-Truth! This was a quote from President Clinton during a presentation at the Pentagon defending a decision to conduct military strikes against Iraq. \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" President Clinton, Feb. 17, 1998-Truth! Bill Clinton went to the Pentagon on this occasion to be briefed by top military officials about Iraq and weapons of mass destruction. His remarks followed that briefing. \"Iraq is a long way from USA but, what happens there matters a great deal here. For the risks that the leaders of a rogue state will use nuclear, chemical or biological weapons against us or our allies is the greatest security threat we face.\" Madeline Albright, Feb 18, 1998-Truth! This is a quote from Albright during an appearance at Ohio State University by Albright, who was Secretary of State for Bill Clinton. \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" Sandy Berger, Clinton National Security Adviser, Feb, 18, 1998-Truth! This was at the same Ohio State University appearance as Madeline Albright. \"We urge you, after consulting with Congress, and consistent with the U.S.Constitution and Laws, to take necessary actions, (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton, signed by Sens. Carl Levin, Tom Daschle, John Kerry, and others Oct. 9, 1998-Truth! According to the U.S. Senate website, the text of this letter was signed by several Senators, both Democrat and Republican, including Senator John McCain and Joseph Lieberman. \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" Rep. Nancy Pelosi (D, CA), Dec. 16, 1998-Truth! The text of this statement by Nancy Pelosi is posted on her congressional website. \"Hussein has .. chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" Madeline Albright, Clinton Secretary of State, Nov. 10, 1999-Truth! This was from an appearance Albright made in Chicago. She was addressing the embargo of Iraq that was in effect at the time and criticism that it may have prevented needed medical supplies from getting into the country. Albright said, \"There has never been an embargo against food and medicine. It's just that Hussein has just not chosen to spend his money on that. Instead, he has chosen to spend his money on building weapons of mass destruction, and palaces for his cronies.\" \"There is no doubt that ... Saddam Hussein has invigorated his weapons programs. Reports indicate that biological, chemical and nuclear programs continue a pace and may be back to pre-Gulf War status. In addition, Saddam continues to redefine delivery systems and is doubtless using the cover of a licit missile program to develop longer-range missiles that will threaten the United States and our allies.\" Letter to President Bush, Signed by Sen. Bob Graham (D, FL,) and others, December 5, 2001Truth! The only letter with this quote from December 5, 2001 that we could find did not include the participation of Senator Bob Graham, but it was signed nine other senators including Democrat Joe Lieberman. It urged President Bush to take quicker action against Iraq. \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandated of the United Nations and is building weapons of mass destruction and the means of delivering them.\" Sen. Carl Levin (D, MI), Sept. 19, 2002-Truth! These were remarks from Senator Levin to a Senate committee on that date. \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" Al Gore, Sept. 23, 2002-Truth! This and the quote below was part of prepared remarks for a speech in San Francisco to The Commonwealth Club. \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" Al Gore, Sept. 23, 2002-Truth! \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" Sen. Ted Kennedy (D, MA), Sept. 27, 2002-Truth! Part of a speech he gave at Johns Hopkins. \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" Sen. Robert Byrd (D, WV), Oct. 3, 2002-Truth! On the floor of the Senate during debate over the resolution that would authorize using force against Iraq. He was urging caution about going to war and commented that even though there was confidence about the weapons in Iraq, there had not been the need to take military action for a number of years and he asked why there would be the need at that point. \"I will be voting to give the President of the United States the authority to use force-- if necessary-- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" Sen. John F. Kerry (D, MA), Oct. 9, 2002-Truth! Senator Kerry's comments were made to the Senate as part of the same debate over the resolution to use force against Saddam Hussein. \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" Sen. Jay Rockefeller (D, WV), Oct 10, 2002-Truth! Senator Rockefeller's statements were a part of the debate over using force against Saddam Hussein. \"He has systematically violated, over the course of the past 11 years, every significant UN resolution that has demanded that he disarm and destroy his chemical and biological weapons, and any nuclear capacity. This he has refused to do\" Rep. Henry Waxman (D, CA), Oct. 10, 2002-Truth! Senator Waxman's contribution to the Senate debate over going to war. \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members. It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" Sen. Hillary Clinton (D, NY), Oct 10, 2002-Truth! Senator Clinton acknowledged the threat of Saddam Hussein but said she did not feel that using force at that time was a good option. \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction So the threat of Saddam Hussein with weapons of mass destruction is real ...\" Sen. John F. Kerry (D, MA), Jan.23.2003-Truth! In a speech to Georgetown University. You can post this stuff from today till tommorow. Plain fact is that Sadaam let the inspectors back in, and after innitial delays, Sadaam cooperated with them. And THEY reported that there were no WMD's, and they could finish up in eight weeks. You might also note that Byrd, Waxman, Levin and Kennedy all voted against the war authorisation act. There's a difference between believing Sadaam might still have weapons and deciding to go to war over this. Dave", 
        "intTime": 20090531, 
        "postID": 30, 
        "quote": "Originally posted by LineDoggie: Jaaaaack, could you possibly provide a Source or Quote that supports your inane supposition that President Bush Condoned Outing the CIA Employee Plame? By the way Einstein, these Democrats also said Saddam had WMD \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" President Clinton, Feb. 4, 1998-Truth! This was a quote from President Clinton during a presentation at the Pentagon defending a decision to conduct military strikes against Iraq. \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" President Clinton, Feb. 17, 1998-Truth! Bill Clinton went to the Pentagon on this occasion to be briefed by top military officials about Iraq and weapons of mass destruction. His remarks followed that briefing. \"Iraq is a long way from USA but, what happens there matters a great deal here. For the risks that the leaders of a rogue state will use nuclear, chemical or biological weapons against us or our allies is the greatest security threat we face.\" Madeline Albright, Feb 18, 1998-Truth! This is a quote from Albright during an appearance at Ohio State University by Albright, who was Secretary of State for Bill Clinton. \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" Sandy Berger, Clinton National Security Adviser, Feb, 18, 1998-Truth! This was at the same Ohio State University appearance as Madeline Albright. \"We urge you, after consulting with Congress, and consistent with the U.S.Constitution and Laws, to take necessary actions, (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton, signed by Sens. Carl Levin, Tom Daschle, John Kerry, and others Oct. 9, 1998-Truth! According to the U.S. Senate website, the text of this letter was signed by several Senators, both Democrat and Republican, including Senator John McCain and Joseph Lieberman. \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" Rep. Nancy Pelosi (D, CA), Dec. 16, 1998-Truth! The text of this statement by Nancy Pelosi is posted on her congressional website. \"Hussein has .. chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" Madeline Albright, Clinton Secretary of State, Nov. 10, 1999-Truth! This was from an appearance Albright made in Chicago. She was addressing the embargo of Iraq that was in effect at the time and criticism that it may have prevented needed medical supplies from getting into the country. Albright said, \"There has never been an embargo against food and medicine. It's just that Hussein has just not chosen to spend his money on that. Instead, he has chosen to spend his money on building weapons of mass destruction, and palaces for his cronies.\" \"There is no doubt that ... Saddam Hussein has invigorated his weapons programs. Reports indicate that biological, chemical and nuclear programs continue a pace and may be back to pre-Gulf War status. In addition, Saddam continues to redefine delivery systems and is doubtless using the cover of a licit missile program to develop longer-range missiles that will threaten the United States and our allies.\" Letter to President Bush, Signed by Sen. Bob Graham (D, FL,) and others, December 5, 2001Truth! The only letter with this quote from December 5, 2001 that we could find did not include the participation of Senator Bob Graham, but it was signed nine other senators including Democrat Joe Lieberman. It urged President Bush to take quicker action against Iraq. \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandated of the United Nations and is building weapons of mass destruction and the means of delivering them.\" Sen. Carl Levin (D, MI), Sept. 19, 2002-Truth! These were remarks from Senator Levin to a Senate committee on that date. \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" Al Gore, Sept. 23, 2002-Truth! This and the quote below was part of prepared remarks for a speech in San Francisco to The Commonwealth Club. \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" Al Gore, Sept. 23, 2002-Truth! \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" Sen. Ted Kennedy (D, MA), Sept. 27, 2002-Truth! Part of a speech he gave at Johns Hopkins. \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" Sen. Robert Byrd (D, WV), Oct. 3, 2002-Truth! On the floor of the Senate during debate over the resolution that would authorize using force against Iraq. He was urging caution about going to war and commented that even though there was confidence about the weapons in Iraq, there had not been the need to take military action for a number of years and he asked why there would be the need at that point. \"I will be voting to give the President of the United States the authority to use force-- if necessary-- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" Sen. John F. Kerry (D, MA), Oct. 9, 2002-Truth! Senator Kerry's comments were made to the Senate as part of the same debate over the resolution to use force against Saddam Hussein. \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" Sen. Jay Rockefeller (D, WV), Oct 10, 2002-Truth! Senator Rockefeller's statements were a part of the debate over using force against Saddam Hussein. \"He has systematically violated, over the course of the past 11 years, every significant UN resolution that has demanded that he disarm and destroy his chemical and biological weapons, and any nuclear capacity. This he has refused to do\" Rep. Henry Waxman (D, CA), Oct. 10, 2002-Truth! Senator Waxman's contribution to the Senate debate over going to war. \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members. It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" Sen. Hillary Clinton (D, NY), Oct 10, 2002-Truth! Senator Clinton acknowledged the threat of Saddam Hussein but said she did not feel that using force at that time was a good option. \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction So the threat of Saddam Hussein with weapons of mass destruction is real ...\" Sen. John F. Kerry (D, MA), Jan.23.2003-Truth! In a speech to Georgetown University.", 
        "reply": " You can post this stuff from today till tommorow. Plain fact is that Sadaam let the inspectors back in, and after innitial delays, Sadaam cooperated with them. And THEY reported that there were no WMD's, and they could finish up in eight weeks. You might also note that Byrd, Waxman, Levin and Kennedy all voted against the war authorisation act. There's a difference between believing Sadaam might still have weapons and deciding to go to war over this. Dave", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 17:31:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job) Calling people \"Bushies\", only makes it difficult, in some peoples minds, should the previous President need to be investigated for war crime... It fuels some people to think that political motivation is your only goal... Keep using the term and you will only prevent people from actually seeing what may have taken place in their names... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090531, 
        "postID": 31, 
        "quote": "Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job)", 
        "reply": " Calling people \"Bushies\", only makes it difficult, in some peoples minds, should the previous President need to be investigated for war crime... It fuels some people to think that political motivation is your only goal... Keep using the term and you will only prevent people from actually seeing what may have taken place in their names... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 17:37:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job) You got that right! The General is simply giving \"aid and comfort \" to the enemy. When will we wake up to what these Communist/Socialists are doing? Dave D@mn it Dave, will you keep Chato off the keyboard, he's beginning to make sense again... LOL Respectfully, SUNLINER81", 
        "intTime": 20090531, 
        "postID": 32, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job) You got that right! The General is simply giving \"aid and comfort \" to the enemy. When will we wake up to what these Communist/Socialists are doing? Dave", 
        "reply": " D@mn it Dave, will you keep Chato off the keyboard, he's beginning to make sense again... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 17:39:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job) You got that right! The General is simply giving \"aid and comfort \" to the enemy. When will we wake up to what these Communist/Socialists are doing? Dave The General also say's that in torturing, the United States has indeed violated the Geneva Conventions. It appears to me and to many others who overestimated the political leanings of the General, that he most certainly does \"not\" agree with the radical views of the ultra-orthodox right-wingers of the Republican Party, led by neo-seditionists Limbaugh, Cheney, Savage, and others. He appears very much more in sync with Colin Powell. Oh how very-very right the General is ... Oh, before, when he spoke the truth and you didn't like it, he was a scumbag but now, he's the apple of your eye?... Uh huh... One wonders... Respectfully, SUNLINER81", 
        "intTime": 20090531, 
        "postID": 33, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Opps....that article was suppose to be kept secret along with the rest of the memos. There you go again IHawker...busting the bushies bubble. (good job) You got that right! The General is simply giving \"aid and comfort \" to the enemy. When will we wake up to what these Communist/Socialists are doing? Dave The General also say's that in torturing, the United States has indeed violated the Geneva Conventions. It appears to me and to many others who overestimated the political leanings of the General, that he most certainly does \"not\" agree with the radical views of the ultra-orthodox right-wingers of the Republican Party, led by neo-seditionists Limbaugh, Cheney, Savage, and others. He appears very much more in sync with Colin Powell. Oh how very-very right the General is ...", 
        "reply": " Oh, before, when he spoke the truth and you didn't like it, he was a scumbag but now, he's the apple of your eye?... Uh huh... One wonders... Respectfully, SUNLINER81", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 17:41:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you Why you want to believe Bush? Bush also said in all certainty, that the Iraqi's have WMD's, and condoned the outing of active CIA operatives for political purposes. Why do you want to believe Petraeus now?... When he was in favor of the surge, you called him \"Betraeus\"... How about some consistency?... One wonders... Respectfully, SUNLINER81", 
        "intTime": 20090531, 
        "postID": 34, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you Why you want to believe Bush? Bush also said in all certainty, that the Iraqi's have WMD's, and condoned the outing of active CIA operatives for political purposes.", 
        "reply": " Why do you want to believe Petraeus now?... When he was in favor of the surge, you called him \"Betraeus\"... How about some consistency?... One wonders... Respectfully, SUNLINER81", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 17:43:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: Jaaaaack, could you possibly provide a Source or Quote that supports your inane supposition that President Bush Condoned Outing the CIA Employee Plame? By the way Einstein, these Democrats also said Saddam had WMD \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" President Clinton, Feb. 4, 1998-Truth! This was a quote from President Clinton during a presentation at the Pentagon defending a decision to conduct military strikes against Iraq. \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" President Clinton, Feb. 17, 1998-Truth! Bill Clinton went to the Pentagon on this occasion to be briefed by top military officials about Iraq and weapons of mass destruction. His remarks followed that briefing. \"Iraq is a long way from USA but, what happens there matters a great deal here. For the risks that the leaders of a rogue state will use nuclear, chemical or biological weapons against us or our allies is the greatest security threat we face.\" Madeline Albright, Feb 18, 1998-Truth! This is a quote from Albright during an appearance at Ohio State University by Albright, who was Secretary of State for Bill Clinton. \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" Sandy Berger, Clinton National Security Adviser, Feb, 18, 1998-Truth! This was at the same Ohio State University appearance as Madeline Albright. \"We urge you, after consulting with Congress, and consistent with the U.S.Constitution and Laws, to take necessary actions, (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton, signed by Sens. Carl Levin, Tom Daschle, John Kerry, and others Oct. 9, 1998-Truth! According to the U.S. Senate website, the text of this letter was signed by several Senators, both Democrat and Republican, including Senator John McCain and Joseph Lieberman. \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" Rep. Nancy Pelosi (D, CA), Dec. 16, 1998-Truth! The text of this statement by Nancy Pelosi is posted on her congressional website. \"Hussein has .. chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" Madeline Albright, Clinton Secretary of State, Nov. 10, 1999-Truth! This was from an appearance Albright made in Chicago. She was addressing the embargo of Iraq that was in effect at the time and criticism that it may have prevented needed medical supplies from getting into the country. Albright said, \"There has never been an embargo against food and medicine. It's just that Hussein has just not chosen to spend his money on that. Instead, he has chosen to spend his money on building weapons of mass destruction, and palaces for his cronies.\" \"There is no doubt that ... Saddam Hussein has invigorated his weapons programs. Reports indicate that biological, chemical and nuclear programs continue a pace and may be back to pre-Gulf War status. In addition, Saddam continues to redefine delivery systems and is doubtless using the cover of a licit missile program to develop longer-range missiles that will threaten the United States and our allies.\" Letter to President Bush, Signed by Sen. Bob Graham (D, FL,) and others, December 5, 2001Truth! The only letter with this quote from December 5, 2001 that we could find did not include the participation of Senator Bob Graham, but it was signed nine other senators including Democrat Joe Lieberman. It urged President Bush to take quicker action against Iraq. \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandated of the United Nations and is building weapons of mass destruction and the means of delivering them.\" Sen. Carl Levin (D, MI), Sept. 19, 2002-Truth! These were remarks from Senator Levin to a Senate committee on that date. \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" Al Gore, Sept. 23, 2002-Truth! This and the quote below was part of prepared remarks for a speech in San Francisco to The Commonwealth Club. \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" Al Gore, Sept. 23, 2002-Truth! \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" Sen. Ted Kennedy (D, MA), Sept. 27, 2002-Truth! Part of a speech he gave at Johns Hopkins. \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" Sen. Robert Byrd (D, WV), Oct. 3, 2002-Truth! On the floor of the Senate during debate over the resolution that would authorize using force against Iraq. He was urging caution about going to war and commented that even though there was confidence about the weapons in Iraq, there had not been the need to take military action for a number of years and he asked why there would be the need at that point. \"I will be voting to give the President of the United States the authority to use force-- if necessary-- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" Sen. John F. Kerry (D, MA), Oct. 9, 2002-Truth! Senator Kerry's comments were made to the Senate as part of the same debate over the resolution to use force against Saddam Hussein. \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" Sen. Jay Rockefeller (D, WV), Oct 10, 2002-Truth! Senator Rockefeller's statements were a part of the debate over using force against Saddam Hussein. \"He has systematically violated, over the course of the past 11 years, every significant UN resolution that has demanded that he disarm and destroy his chemical and biological weapons, and any nuclear capacity. This he has refused to do\" Rep. Henry Waxman (D, CA), Oct. 10, 2002-Truth! Senator Waxman's contribution to the Senate debate over going to war. \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members. It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" Sen. Hillary Clinton (D, NY), Oct 10, 2002-Truth! Senator Clinton acknowledged the threat of Saddam Hussein but said she did not feel that using force at that time was a good option. \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction So the threat of Saddam Hussein with weapons of mass destruction is real ...\" Sen. John F. Kerry (D, MA), Jan.23.2003-Truth! In a speech to Georgetown University. They, the Democrats you listed, may have been reading and believing the same intelligence as Bush did, but they didn't decide to go to war over it, like your hero George W. did. It was becoming very-very clear that the UN nuke hunters were finding nothing in their search of Iraq nukes, but Bush cut them short and invaded Iraq, because he needed that excuse to invade. So, did you suddenly find some new words to insult and degrade those who disagree with you, namely, \"i-n-a-n-e\" and \"m-o-o-k-s.\" Does it make you feel more of a man, because it only shows to me that you can't handle a good argument without losing your cool and calling people silly names that in any civil conversation would be considered insulting.", 
        "intTime": 20090531, 
        "postID": 35, 
        "quote": "Originally posted by LineDoggie: Jaaaaack, could you possibly provide a Source or Quote that supports your inane supposition that President Bush Condoned Outing the CIA Employee Plame? By the way Einstein, these Democrats also said Saddam had WMD \"One way or the other, we are determined to deny Iraq the capacity to develop weapons of mass destruction and the missiles to deliver them. That is our bottom line.\" President Clinton, Feb. 4, 1998-Truth! This was a quote from President Clinton during a presentation at the Pentagon defending a decision to conduct military strikes against Iraq. \"If Saddam rejects peace and we have to use force, our purpose is clear. We want to seriously diminish the threat posed by Iraq's weapons of mass destruction program.\" President Clinton, Feb. 17, 1998-Truth! Bill Clinton went to the Pentagon on this occasion to be briefed by top military officials about Iraq and weapons of mass destruction. His remarks followed that briefing. \"Iraq is a long way from USA but, what happens there matters a great deal here. For the risks that the leaders of a rogue state will use nuclear, chemical or biological weapons against us or our allies is the greatest security threat we face.\" Madeline Albright, Feb 18, 1998-Truth! This is a quote from Albright during an appearance at Ohio State University by Albright, who was Secretary of State for Bill Clinton. \"He will use those weapons of mass destruction again, as he has ten times since 1983.\" Sandy Berger, Clinton National Security Adviser, Feb, 18, 1998-Truth! This was at the same Ohio State University appearance as Madeline Albright. \"We urge you, after consulting with Congress, and consistent with the U.S.Constitution and Laws, to take necessary actions, (including, if appropriate, air and missile strikes on suspect Iraqi sites) to respond effectively to the threat posed by Iraq's refusal to end its weapons of mass destruction programs.\" Letter to President Clinton, signed by Sens. Carl Levin, Tom Daschle, John Kerry, and others Oct. 9, 1998-Truth! According to the U.S. Senate website, the text of this letter was signed by several Senators, both Democrat and Republican, including Senator John McCain and Joseph Lieberman. \"Saddam Hussein has been engaged in the development of weapons of mass destruction technology which is a threat to countries in the region and he has made a mockery of the weapons inspection process.\" Rep. Nancy Pelosi (D, CA), Dec. 16, 1998-Truth! The text of this statement by Nancy Pelosi is posted on her congressional website. \"Hussein has .. chosen to spend his money on building weapons of mass destruction and palaces for his cronies.\" Madeline Albright, Clinton Secretary of State, Nov. 10, 1999-Truth! This was from an appearance Albright made in Chicago. She was addressing the embargo of Iraq that was in effect at the time and criticism that it may have prevented needed medical supplies from getting into the country. Albright said, \"There has never been an embargo against food and medicine. It's just that Hussein has just not chosen to spend his money on that. Instead, he has chosen to spend his money on building weapons of mass destruction, and palaces for his cronies.\" \"There is no doubt that ... Saddam Hussein has invigorated his weapons programs. Reports indicate that biological, chemical and nuclear programs continue a pace and may be back to pre-Gulf War status. In addition, Saddam continues to redefine delivery systems and is doubtless using the cover of a licit missile program to develop longer-range missiles that will threaten the United States and our allies.\" Letter to President Bush, Signed by Sen. Bob Graham (D, FL,) and others, December 5, 2001Truth! The only letter with this quote from December 5, 2001 that we could find did not include the participation of Senator Bob Graham, but it was signed nine other senators including Democrat Joe Lieberman. It urged President Bush to take quicker action against Iraq. \"We begin with the common belief that Saddam Hussein is a tyrant and a threat to the peace and stability of the region. He has ignored the mandated of the United Nations and is building weapons of mass destruction and the means of delivering them.\" Sen. Carl Levin (D, MI), Sept. 19, 2002-Truth! These were remarks from Senator Levin to a Senate committee on that date. \"We know that he has stored secret supplies of biological and chemical weapons throughout his country.\" Al Gore, Sept. 23, 2002-Truth! This and the quote below was part of prepared remarks for a speech in San Francisco to The Commonwealth Club. \"Iraq's search for weapons of mass destruction has proven impossible to deter and we should assume that it will continue for as long as Saddam is in power.\" Al Gore, Sept. 23, 2002-Truth! \"We have known for many years that Saddam Hussein is seeking and developing weapons of mass destruction.\" Sen. Ted Kennedy (D, MA), Sept. 27, 2002-Truth! Part of a speech he gave at Johns Hopkins. \"The last UN weapons inspectors left Iraq in October of 1998. We are confident that Saddam Hussein retains some stockpiles of chemical and biological weapons, and that he has since embarked on a crash course to build up his chemical and biological warfare capabilities. Intelligence reports indicate that he is seeking nuclear weapons...\" Sen. Robert Byrd (D, WV), Oct. 3, 2002-Truth! On the floor of the Senate during debate over the resolution that would authorize using force against Iraq. He was urging caution about going to war and commented that even though there was confidence about the weapons in Iraq, there had not been the need to take military action for a number of years and he asked why there would be the need at that point. \"I will be voting to give the President of the United States the authority to use force-- if necessary-- to disarm Saddam Hussein because I believe that a deadly arsenal of weapons of mass destruction in his hands is a real and grave threat to our security.\" Sen. John F. Kerry (D, MA), Oct. 9, 2002-Truth! Senator Kerry's comments were made to the Senate as part of the same debate over the resolution to use force against Saddam Hussein. \"There is unmistakable evidence that Saddam Hussein is working aggressively to develop nuclear weapons and will likely have nuclear weapons within the next five years ... We also should remember we have always underestimated the progress Saddam has made in development of weapons of mass destruction.\" Sen. Jay Rockefeller (D, WV), Oct 10, 2002-Truth! Senator Rockefeller's statements were a part of the debate over using force against Saddam Hussein. \"He has systematically violated, over the course of the past 11 years, every significant UN resolution that has demanded that he disarm and destroy his chemical and biological weapons, and any nuclear capacity. This he has refused to do\" Rep. Henry Waxman (D, CA), Oct. 10, 2002-Truth! Senator Waxman's contribution to the Senate debate over going to war. \"In the four years since the inspectors left, intelligence reports show that Saddam Hussein has worked to rebuild his chemical and biological weapons stock, his missile delivery capability, and his nuclear program. He has also given aid, comfort, and sanctuary to terrorists, including al Qaeda members. It is clear, however, that if left unchecked, Saddam Hussein will continue to increase his capacity to wage biological and chemical warfare, and will keep trying to develop nuclear weapons.\" Sen. Hillary Clinton (D, NY), Oct 10, 2002-Truth! Senator Clinton acknowledged the threat of Saddam Hussein but said she did not feel that using force at that time was a good option. \"Without question, we need to disarm Saddam Hussein. He is a brutal, murderous dictator, leading an oppressive regime He presents a particularly grievous threat because he is so consistently prone to miscalculation ... And now he is miscalculating America's response to his continued deceit and his consistent grasp for weapons of mass destruction So the threat of Saddam Hussein with weapons of mass destruction is real ...\" Sen. John F. Kerry (D, MA), Jan.23.2003-Truth! In a speech to Georgetown University.", 
        "reply": " They, the Democrats you listed, may have been reading and believing the same intelligence as Bush did, but they didn't decide to go to war over it, like your hero George W. did. It was becoming very-very clear that the UN nuke hunters were finding nothing in their search of Iraq nukes, but Bush cut them short and invaded Iraq, because he needed that excuse to invade. So, did you suddenly find some new words to insult and degrade those who disagree with you, namely, \"i-n-a-n-e\" and \"m-o-o-k-s.\" Does it make you feel more of a man, because it only shows to me that you can't handle a good argument without losing your cool and calling people silly names that in any civil conversation would be considered insulting.", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 19:33:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "JRRutherford"
    }, 
    {
        "content": "Ahhh, the Other Bookend has arrived", 
        "intTime": 20090531, 
        "postID": 36, 
        "quote": "", 
        "reply": "Ahhh, the Other Bookend has arrived", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 19:34:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you Why you want to believe Bush? Bush also said in all certainty, that the Iraqi's have WMD's, and condoned the outing of active CIA operatives for political purposes. Why do you want to believe Petraeus now?... When he was in favor of the surge, you called him \"Betraeus\"... How about some consistency?... One wonders... Respectfully, SUNLINER81 I'll have to admit sunliner, you had me going. I just did a search of all my posts and looked for the words \"scumbag\" and \"Betraeus\" in any of them, only to come up empty. I was sure I never used those words to describe the General. I wasn't a very big fan of his for the longest time, but I didn't quite remember describing him that way when I may have posted my concerns about the man. Perhaps you should try vetting what you post about someone before you actually press \"send\" on this public forum. By the way, if the \"surge\" was so much of a success, why are there still American GI's and Iraqi's still dying there? Another one of a George Bush-like \"Mission Accomplished\" claim before it really came to pass ... perhaps???? Thank You. This message has been edited. Last edited by: jack_flats, Sun 31 May 2009 09:30 PM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090531, 
        "postID": 37, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you Why you want to believe Bush? Bush also said in all certainty, that the Iraqi's have WMD's, and condoned the outing of active CIA operatives for political purposes. Why do you want to believe Petraeus now?... When he was in favor of the surge, you called him \"Betraeus\"... How about some consistency?... One wonders... Respectfully, SUNLINER81", 
        "reply": " I'll have to admit sunliner, you had me going. I just did a search of all my posts and looked for the words \"scumbag\" and \"Betraeus\" in any of them, only to come up empty. I was sure I never used those words to describe the General. I wasn't a very big fan of his for the longest time, but I didn't quite remember describing him that way when I may have posted my concerns about the man. Perhaps you should try vetting what you post about someone before you actually press \"send\" on this public forum. By the way, if the \"surge\" was so much of a success, why are there still American GI's and Iraqi's still dying there? Another one of a George Bush-like \"Mission Accomplished\" claim before it really came to pass ... perhaps???? Thank You. This message has been edited. Last edited by: jack_flats, Sun 31 May 2009 09:30 PM \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 20:21:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: It's so terribly easy to Marginalize your inane posts \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090531, 
        "postID": 38, 
        "quote": "Originally posted by LineDoggie: It's so terribly easy to Marginalize your inane posts", 
        "reply": " \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 20:23:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: It's so terribly easy to Marginalize your inane posts Yup, that's what we think of your posts Inane, Obtuse, & Pathetic.", 
        "intTime": 20090531, 
        "postID": 39, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by LineDoggie: It's so terribly easy to Marginalize your inane posts", 
        "reply": " Yup, that's what we think of your posts Inane, Obtuse, & Pathetic.", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 20:31:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: quote: Originally posted by SUNLINER81: quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you Why you want to believe Bush? Bush also said in all certainty, that the Iraqi's have WMD's, and condoned the outing of active CIA operatives for political purposes. Why do you want to believe Petraeus now?... When he was in favor of the surge, you called him \"Betraeus\"... How about some consistency?... One wonders... Respectfully, SUNLINER81 I'll have to admit sunliner, you had me going. I just did a search of all my posts and looked for the words \"scumbag\" and \"Betraeus\" in any of them, only to come up empty. I was sure I never used those words to describe the General. I wasn't a very big fan of his for the longest time, but I didn't quite remember describing him that way when I may have posted my concerns about the man. Perhaps you should try vetting what you post about someone before you actually press \"send\" on this public forum. Thank You. Let's see, you supported those articles that called the general Betrayus when they were discussed on here and then of course, you support those that singled out Petraeus for ridicule and so I guess in your mind if you can't find where you used those exact words, hey it's o.k., right?... You forget, there are too many of us on here that remember the stances that you have taken in the past... NEXT!... Respectfully, SUNLINER81", 
        "intTime": 20090531, 
        "postID": 40, 
        "quote": "Originally posted by jack_flats: quote: Originally posted by SUNLINER81: quote: Originally posted by jack_flats: quote: Originally posted by LineDoggie: Sad Little Mooks, Bush Himself said Guantanamo should be closed XXXhttp://www.newsobserver.com/politics/story/614167.htmlXXX Jun. 23, 2007 \"Closing the Guantanamo Bay prison is only a matter of time now, the White House says. \" \"it should be a goal of the nation to shut down Guantanamo\"-President George Bush August, 2007 but hey dont let your lingering BDS stop you Why you want to believe Bush? Bush also said in all certainty, that the Iraqi's have WMD's, and condoned the outing of active CIA operatives for political purposes. Why do you want to believe Petraeus now?... When he was in favor of the surge, you called him \"Betraeus\"... How about some consistency?... One wonders... Respectfully, SUNLINER81 I'll have to admit sunliner, you had me going. I just did a search of all my posts and looked for the words \"scumbag\" and \"Betraeus\" in any of them, only to come up empty. I was sure I never used those words to describe the General. I wasn't a very big fan of his for the longest time, but I didn't quite remember describing him that way when I may have posted my concerns about the man. Perhaps you should try vetting what you post about someone before you actually press \"send\" on this public forum. Thank You.", 
        "reply": " Let's see, you supported those articles that called the general Betrayus when they were discussed on here and then of course, you support those that singled out Petraeus for ridicule and so I guess in your mind if you can't find where you used those exact words, hey it's o.k., right?... You forget, there are too many of us on here that remember the stances that you have taken in the past... NEXT!... Respectfully, SUNLINER81", 
        "threadID": "672198221_7170096422001", 
        "time": "2009-05-31 21:30:00", 
        "title": "Petraeus supports closure of Guantanamo", 
        "userID": "SUNLINER81"
    }
]