[
    {
        "content": "\"http://www.msnbc.msn.com/id/30641236/\" Spokesman for Florida agency took nude photos of teen boys TAMPA, Fla. - A former spokesman for Florida's child welfare agency was sentenced to more than 24 years in prison Friday for taking nude photos of teenage boys, including a 16-year-old under the agency's care. Al Zimmerman's arrest prompted a review of hiring policies and personnel files at the Florida Department of Children and Families to make sure every employee has had a criminal background check. The former TV newsman pleaded guilty in January to a charge of producing child pornography. Other charges were dropped as part of a plea agreement. Zimmerman apologized to the victims and his family.", 
        "intTime": 20090508, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.msnbc.msn.com/id/30641236/\" Spokesman for Florida agency took nude photos of teen boys TAMPA, Fla. - A former spokesman for Florida's child welfare agency was sentenced to more than 24 years in prison Friday for taking nude photos of teenage boys, including a 16-year-old under the agency's care. Al Zimmerman's arrest prompted a review of hiring policies and personnel files at the Florida Department of Children and Families to make sure every employee has had a criminal background check. The former TV newsman pleaded guilty in January to a charge of producing child pornography. Other charges were dropped as part of a plea agreement. Zimmerman apologized to the victims and his family.", 
        "threadID": "672198221_7400038222001", 
        "time": "2009-05-08 10:54:00", 
        "title": "Child welfare official jailed 24 years for kid porn", 
        "userID": "ss_287"
    }, 
    {
        "content": "ss_287; quote: Al Zimmerman's arrest prompted a review of hiring policies and personnel files at the Florida Department of Children and Families to make sure every employee has had a criminal background check. The problem with criminal background checks is they only show something IF the person has been arrested and convicted of a crime. So while yes, it can certainly help weed out some folks from applying, it won't weed out the others..", 
        "intTime": 20090508, 
        "postID": 2, 
        "quote": "Al Zimmerman's arrest prompted a review of hiring policies and personnel files at the Florida Department of Children and Families to make sure every employee has had a criminal background check.", 
        "reply": "ss_287;  The problem with criminal background checks is they only show something IF the person has been arrested and convicted of a crime. So while yes, it can certainly help weed out some folks from applying, it won't weed out the others..", 
        "threadID": "672198221_7400038222001", 
        "time": "2009-05-08 11:38:00", 
        "title": "Child welfare official jailed 24 years for kid porn", 
        "userID": "3678131"
    }, 
    {
        "content": "They hadn't already thought of background checks for people working with children?", 
        "intTime": 20090508, 
        "postID": 3, 
        "quote": "", 
        "reply": "They hadn't already thought of background checks for people working with children?", 
        "threadID": "672198221_7400038222001", 
        "time": "2009-05-08 19:46:00", 
        "title": "Child welfare official jailed 24 years for kid porn", 
        "userID": "iamgonzo"
    }
]