[
    {
        "content": "RE: http://www.military.com/opinio...202,191517_2,00.html Plan \"A\": there is no Plan, Plan \"B\": Revert to Plan \"A\" Or Plan \"C\" have a Military Coup in Afghanistan, so they can run the Government, Reward those Generals that work with the US..push for the Afghan Army to be more in the forefront of the fighting, and the US Train them into a More professional force with support.. I can't believe I'm actual advocating a Dictatorship, but that's what this place needs...is their such a thing as a Democratic Dictatorship?", 
        "intTime": 20090526, 
        "postID": 1, 
        "quote": "", 
        "reply": "RE: http://www.military.com/opinio...202,191517_2,00.html Plan \"A\": there is no Plan, Plan \"B\": Revert to Plan \"A\" Or Plan \"C\" have a Military Coup in Afghanistan, so they can run the Government, Reward those Generals that work with the US..push for the Afghan Army to be more in the forefront of the fighting, and the US Train them into a More professional force with support.. I can't believe I'm actual advocating a Dictatorship, but that's what this place needs...is their such a thing as a Democratic Dictatorship?", 
        "threadID": "672198221_2310003422001", 
        "time": "2009-05-26 06:01:00", 
        "title": "Trust the Afghan Army", 
        "userID": "6362250"
    }, 
    {
        "content": "Iraq and Afghanistan don't know how to do a damn thing unless some crazy guy in a military uniform is threatening their lives and the lives of their families. It's pathetic. I've said all along that no matter how long we stay in Iraq a dictator will take over after we leave. The Iraq military aren't loyal to the government or country now, and they never will be.", 
        "intTime": 20090526, 
        "postID": 2, 
        "quote": "", 
        "reply": "Iraq and Afghanistan don't know how to do a damn thing unless some crazy guy in a military uniform is threatening their lives and the lives of their families. It's pathetic. I've said all along that no matter how long we stay in Iraq a dictator will take over after we leave. The Iraq military aren't loyal to the government or country now, and they never will be.", 
        "threadID": "672198221_2310003422001", 
        "time": "2009-05-26 06:09:00", 
        "title": "Trust the Afghan Army", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by 6362250: RE: http://www.military.com/opinio...202,191517_2,00.html Plan \"A\": there is no Plan, Plan \"B\": Revert to Plan \"A\" Or Plan \"C\" have a Military Coup in Afghanistan, so they can run the Government, Reward those Generals that work with the US..push for the Afghan Army to be more in the forefront of the fighting, and the US Train them into a More professional force with support.. I can't believe I'm actual advocating a Dictatorship, but that's what this place needs...is their such a thing as a Democratic Dictatorship? I guess the closest you would get is what they have in Iran I guess if the plan was an \"ends justifies the means\" by installing a military dictatorship, the only way it wouldn't leave a bad taste in anyone mouth is if that dictator was benevolent enough to essentially abdicate their position and give the power back to the people when all is said and done... but, what's the likelihood of that ever happening?", 
        "intTime": 20090526, 
        "postID": 3, 
        "quote": "Originally posted by 6362250: RE: http://www.military.com/opinio...202,191517_2,00.html Plan \"A\": there is no Plan, Plan \"B\": Revert to Plan \"A\" Or Plan \"C\" have a Military Coup in Afghanistan, so they can run the Government, Reward those Generals that work with the US..push for the Afghan Army to be more in the forefront of the fighting, and the US Train them into a More professional force with support.. I can't believe I'm actual advocating a Dictatorship, but that's what this place needs...is their such a thing as a Democratic Dictatorship?", 
        "reply": " I guess the closest you would get is what they have in Iran I guess if the plan was an \"ends justifies the means\" by installing a military dictatorship, the only way it wouldn't leave a bad taste in anyone mouth is if that dictator was benevolent enough to essentially abdicate their position and give the power back to the people when all is said and done... but, what's the likelihood of that ever happening?", 
        "threadID": "672198221_2310003422001", 
        "time": "2009-05-26 09:02:00", 
        "title": "Trust the Afghan Army", 
        "userID": "DevilDog2847"
    }, 
    {
        "content": "I thought that President Obama's plan for Afghanistan was inj a large part, to ramp-up the training of the Afghan Army? They are supposed to be too small to be of much use at this point - not counting the logistical problems.", 
        "intTime": 20090526, 
        "postID": 4, 
        "quote": "", 
        "reply": "I thought that President Obama's plan for Afghanistan was inj a large part, to ramp-up the training of the Afghan Army? They are supposed to be too small to be of much use at this point - not counting the logistical problems.", 
        "threadID": "672198221_2310003422001", 
        "time": "2009-05-26 11:59:00", 
        "title": "Trust the Afghan Army", 
        "userID": "PolicyWonk"
    }, 
    {
        "content": "quote: Originally posted by PolicyWonk: I thought that President Obama's plan for Afghanistan was inj a large part, to ramp-up the training of the Afghan Army? They are supposed to be too small to be of much use at this point - not counting the logistical problems. I think it is the plan, but I think the question(s) are: a)can we achieve the target numbers of Afghans to be trained (I don't know the numbers, but I think they want somewhere close to 200,000) and b)once you do get that many trained, will t be worth it if the central gov't (i.e. Karzai)is weak? If you get a particularly ambitious General of the army, it could reasonably create a situation where the gov't and military are at odds instead of in concert. I think the author is proposing the question as to whether or not it would be better to promote a gov't whose strength IS the military. I suppose if we supported that we couldn't criticize Castro anymore... I don't think I'm keen on that idea because I mentioned above, in order for it to be in keeping with what we are trying to help implement, it would ALL hinge on someone who would use an iron fist to gain order, then disolve their position. That concept is not in keeping with their culture, and it would require someone who would have to be a visionary on a grand scale, such as the conquerors of old.", 
        "intTime": 20090526, 
        "postID": 5, 
        "quote": "Originally posted by PolicyWonk: I thought that President Obama's plan for Afghanistan was inj a large part, to ramp-up the training of the Afghan Army? They are supposed to be too small to be of much use at this point - not counting the logistical problems.", 
        "reply": " I think it is the plan, but I think the question(s) are: a)can we achieve the target numbers of Afghans to be trained (I don't know the numbers, but I think they want somewhere close to 200,000) and b)once you do get that many trained, will t be worth it if the central gov't (i.e. Karzai)is weak? If you get a particularly ambitious General of the army, it could reasonably create a situation where the gov't and military are at odds instead of in concert. I think the author is proposing the question as to whether or not it would be better to promote a gov't whose strength IS the military. I suppose if we supported that we couldn't criticize Castro anymore... I don't think I'm keen on that idea because I mentioned above, in order for it to be in keeping with what we are trying to help implement, it would ALL hinge on someone who would use an iron fist to gain order, then disolve their position. That concept is not in keeping with their culture, and it would require someone who would have to be a visionary on a grand scale, such as the conquerors of old.", 
        "threadID": "672198221_2310003422001", 
        "time": "2009-05-26 15:04:00", 
        "title": "Trust the Afghan Army", 
        "userID": "DevilDog2847"
    }, 
    {
        "content": "Let's send in some of those ivy league scholarship recipients to perform their \"community service\" assisting Pakis and Afghanis and strategically turn the tide of against the Taliban. After all, the peacenicks seem to preach that's all we need and it would work. Oh! And without the protection of the US military.", 
        "intTime": 20090526, 
        "postID": 6, 
        "quote": "", 
        "reply": "Let's send in some of those ivy league scholarship recipients to perform their \"community service\" assisting Pakis and Afghanis and strategically turn the tide of against the Taliban. After all, the peacenicks seem to preach that's all we need and it would work. Oh! And without the protection of the US military.", 
        "threadID": "672198221_2310003422001", 
        "time": "2009-05-26 17:37:00", 
        "title": "Trust the Afghan Army", 
        "userID": "yanqui69"
    }, 
    {
        "content": "quote: Originally posted by yanqui69: Let's send in some of those ivy league scholarship recipients to perform their \"community service\" assisting Pakis and Afghanis and strategically turn the tide of against the Taliban. After all, the peacenicks seem to preach that's all we need and it would work. Oh! And without the protection of the US military. Community service is one of the greatest contributions one can do for their country short of military service. I really like Obama's idea. God forbid we encourage people to give back to our nation once in a while.", 
        "intTime": 20090526, 
        "postID": 7, 
        "quote": "Originally posted by yanqui69: Let's send in some of those ivy league scholarship recipients to perform their \"community service\" assisting Pakis and Afghanis and strategically turn the tide of against the Taliban. After all, the peacenicks seem to preach that's all we need and it would work. Oh! And without the protection of the US military.", 
        "reply": " Community service is one of the greatest contributions one can do for their country short of military service. I really like Obama's idea. God forbid we encourage people to give back to our nation once in a while.", 
        "threadID": "672198221_2310003422001", 
        "time": "2009-05-26 17:58:00", 
        "title": "Trust the Afghan Army", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "As Abraham Lincoln told George McLellan when the latter was apponted commander of the armies, and having heard that 'Little Mac' favored a military dictatorship: \"You get the victories,and I'll risk the dictatorship.\" Only a victorious general can dictate. So far the Afghan people have prevented that.", 
        "intTime": 20090526, 
        "postID": 8, 
        "quote": "", 
        "reply": "As Abraham Lincoln told George McLellan when the latter was apponted commander of the armies, and having heard that 'Little Mac' favored a military dictatorship: \"You get the victories,and I'll risk the dictatorship.\" Only a victorious general can dictate. So far the Afghan people have prevented that.", 
        "threadID": "672198221_2310003422001", 
        "time": "2009-05-26 19:56:00", 
        "title": "Trust the Afghan Army", 
        "userID": "AliBubba"
    }, 
    {
        "content": "quote: Originally posted by AliBubba: As Abraham Lincoln told George McLellan when hee appointed him commander of the armies, and having heard that 'Little Mac' favored a military dictatorship: \"You get the victories,and I'll risk the dictatorship.\" Only a victorious general can dictate. So far the Afghan people have prevented that. Actually it was General Joe Hooker who \"Honest\" Abe was saying that to...After General Hooker said that \"what this Country needs is a Dictator\"....But then again, Ol' \"Fighting Joe\" (a moniker he despised, by the way) got a fine come-uppance at Chancellorsville thanks to the Military Genius of General Robert E. Lee and Lt. General Thomas J. \"Stonewall\" Jackson and the valor and fighting spirit of the soldiers of the legendary Army of Northern Virginia...... Duane A. Brinson \"on the road\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "intTime": 20090526, 
        "postID": 9, 
        "quote": "Originally posted by AliBubba: As Abraham Lincoln told George McLellan when hee appointed him commander of the armies, and having heard that 'Little Mac' favored a military dictatorship: \"You get the victories,and I'll risk the dictatorship.\" Only a victorious general can dictate. So far the Afghan people have prevented that.", 
        "reply": " Actually it was General Joe Hooker who \"Honest\" Abe was saying that to...After General Hooker said that \"what this Country needs is a Dictator\"....But then again, Ol' \"Fighting Joe\" (a moniker he despised, by the way) got a fine come-uppance at Chancellorsville thanks to the Military Genius of General Robert E. Lee and Lt. General Thomas J. \"Stonewall\" Jackson and the valor and fighting spirit of the soldiers of the legendary Army of Northern Virginia...... Duane A. Brinson \"on the road\" U.S.M.C. 1985-1989 \"In the face of terrorism and murder; the call for peace is NOT patriotic, it's COWARDICE\"", 
        "threadID": "672198221_2310003422001", 
        "time": "2009-05-26 20:06:00", 
        "title": "Trust the Afghan Army", 
        "userID": "Proudformermarine"
    }, 
    {
        "content": "quote: Originally posted by DevilDog2847: quote: Originally posted by PolicyWonk: I thought that President Obama's plan for Afghanistan was inj a large part, to ramp-up the training of the Afghan Army? They are supposed to be too small to be of much use at this point - not counting the logistical problems. I think it is the plan, but I think the question(s) are: a)can we achieve the target numbers of Afghans to be trained (I don't know the numbers, but I think they want somewhere close to 200,000) and b)once you do get that many trained, will t be worth it if the central gov't (i.e. Karzai)is weak? If you get a particularly ambitious General of the army, it could reasonably create a situation where the gov't and military are at odds instead of in concert. I think the author is proposing the question as to whether or not it would be better to promote a gov't whose strength IS the military. I suppose if we supported that we couldn't criticize Castro anymore... I don't think I'm keen on that idea because I mentioned above, in order for it to be in keeping with what we are trying to help implement, it would ALL hinge on someone who would use an iron fist to gain order, then disolve their position. That concept is not in keeping with their culture, and it would require someone who would have to be a visionary on a grand scale, such as the conquerors of old. I can see many problems with a large national Afghan army. An Afghan army would almost have to be made of soldiers from that region which presents problems with tribal loyalties and fighting against their relatives and neighbors, plus the constant threat of reprisal attacks on their familes. The best units in the Iraq army were made of soldiers from all over the country or at least they operated outside of their home regions. Even in Iraq this is difficult because the pay is all cash, so the soldiers have to travel across the country to take their pay to their familes. Afghanistan is the same way, but in Iraq it only takes a day to get from Baghdad to Basra, travel in Afghanistan would make having a true national army almost impossible if they don't have a reasonable way of taking pay to their families.", 
        "intTime": 20090526, 
        "postID": 10, 
        "quote": "Originally posted by DevilDog2847: quote: Originally posted by PolicyWonk: I thought that President Obama's plan for Afghanistan was inj a large part, to ramp-up the training of the Afghan Army? They are supposed to be too small to be of much use at this point - not counting the logistical problems. I think it is the plan, but I think the question(s) are: a)can we achieve the target numbers of Afghans to be trained (I don't know the numbers, but I think they want somewhere close to 200,000) and b)once you do get that many trained, will t be worth it if the central gov't (i.e. Karzai)is weak? If you get a particularly ambitious General of the army, it could reasonably create a situation where the gov't and military are at odds instead of in concert. I think the author is proposing the question as to whether or not it would be better to promote a gov't whose strength IS the military. I suppose if we supported that we couldn't criticize Castro anymore... I don't think I'm keen on that idea because I mentioned above, in order for it to be in keeping with what we are trying to help implement, it would ALL hinge on someone who would use an iron fist to gain order, then disolve their position. That concept is not in keeping with their culture, and it would require someone who would have to be a visionary on a grand scale, such as the conquerors of old.", 
        "reply": " I can see many problems with a large national Afghan army. An Afghan army would almost have to be made of soldiers from that region which presents problems with tribal loyalties and fighting against their relatives and neighbors, plus the constant threat of reprisal attacks on their familes. The best units in the Iraq army were made of soldiers from all over the country or at least they operated outside of their home regions. Even in Iraq this is difficult because the pay is all cash, so the soldiers have to travel across the country to take their pay to their familes. Afghanistan is the same way, but in Iraq it only takes a day to get from Baghdad to Basra, travel in Afghanistan would make having a true national army almost impossible if they don't have a reasonable way of taking pay to their families.", 
        "threadID": "672198221_2310003422001", 
        "time": "2009-05-26 20:28:00", 
        "title": "Trust the Afghan Army", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by DevilDog2847: quote: Originally posted by PolicyWonk: I thought that President Obama's plan for Afghanistan was inj a large part, to ramp-up the training of the Afghan Army? They are supposed to be too small to be of much use at this point - not counting the logistical problems. I think it is the plan, but I think the question(s) are: a)can we achieve the target numbers of Afghans to be trained (I don't know the numbers, but I think they want somewhere close to 200,000) and b)once you do get that many trained, will t be worth it if the central gov't (i.e. Karzai)is weak? If you get a particularly ambitious General of the army, it could reasonably create a situation where the gov't and military are at odds instead of in concert. I think the author is proposing the question as to whether or not it would be better to promote a gov't whose strength IS the military. I suppose if we supported that we couldn't criticize Castro anymore... I don't think I'm keen on that idea because I mentioned above, in order for it to be in keeping with what we are trying to help implement, it would ALL hinge on someone who would use an iron fist to gain order, then disolve their position. That concept is not in keeping with their culture, and it would require someone who would have to be a visionary on a grand scale, such as the conquerors of old. One thing that the Taliban did do, is to (comparitively) bring stability to Afghanistan (granted, their methods left a lot to be desired, to be generous). But despite that, the tribal culture and divisions between them remained a problem even for the Taliban. But Karzai is pretty weak, and Afghani culture is corrupt at the roots (its hard to remove thousands of years of tradition). The US has had its history of supporting some pretty unsavory characters in the past, and the memories of the people are long (they tend to recall our support for these folks), which is why (in some cases) we aren't looked at favorably in the middle east (amongst other places). So I think we're better off (for the time being) supporting (and working on) Karzai, getting the Afghan army whipped into shape (such as it is), and gradually handing territory over to them. At the same time, we have to help the Afghans build social institutions, hospitals, and infrastructure, etc, so that they can see tangible government actions on their behalf. The key thing is that their lives have to improve visibly or the problems will persist. A difficult load of problems to solve...", 
        "intTime": 20090527, 
        "postID": 11, 
        "quote": "Originally posted by DevilDog2847: quote: Originally posted by PolicyWonk: I thought that President Obama's plan for Afghanistan was inj a large part, to ramp-up the training of the Afghan Army? They are supposed to be too small to be of much use at this point - not counting the logistical problems. I think it is the plan, but I think the question(s) are: a)can we achieve the target numbers of Afghans to be trained (I don't know the numbers, but I think they want somewhere close to 200,000) and b)once you do get that many trained, will t be worth it if the central gov't (i.e. Karzai)is weak? If you get a particularly ambitious General of the army, it could reasonably create a situation where the gov't and military are at odds instead of in concert. I think the author is proposing the question as to whether or not it would be better to promote a gov't whose strength IS the military. I suppose if we supported that we couldn't criticize Castro anymore... I don't think I'm keen on that idea because I mentioned above, in order for it to be in keeping with what we are trying to help implement, it would ALL hinge on someone who would use an iron fist to gain order, then disolve their position. That concept is not in keeping with their culture, and it would require someone who would have to be a visionary on a grand scale, such as the conquerors of old.", 
        "reply": " One thing that the Taliban did do, is to (comparitively) bring stability to Afghanistan (granted, their methods left a lot to be desired, to be generous). But despite that, the tribal culture and divisions between them remained a problem even for the Taliban. But Karzai is pretty weak, and Afghani culture is corrupt at the roots (its hard to remove thousands of years of tradition). The US has had its history of supporting some pretty unsavory characters in the past, and the memories of the people are long (they tend to recall our support for these folks), which is why (in some cases) we aren't looked at favorably in the middle east (amongst other places). So I think we're better off (for the time being) supporting (and working on) Karzai, getting the Afghan army whipped into shape (such as it is), and gradually handing territory over to them. At the same time, we have to help the Afghans build social institutions, hospitals, and infrastructure, etc, so that they can see tangible government actions on their behalf. The key thing is that their lives have to improve visibly or the problems will persist. A difficult load of problems to solve...", 
        "threadID": "672198221_2310003422001", 
        "time": "2009-05-27 08:15:00", 
        "title": "Trust the Afghan Army", 
        "userID": "PolicyWonk"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by yanqui69: Let's send in some of those ivy league scholarship recipients to perform their \"community service\" assisting Pakis and Afghanis and strategically turn the tide of against the Taliban. After all, the peacenicks seem to preach that's all we need and it would work. Oh! And without the protection of the US military. Community service is one of the greatest contributions one can do for their country short of military service. I really like Obama's idea. God forbid we encourage people to give back to our nation once in a while. Oh, I agree, but they should contribute to America's national security objectives as well; like in Afghanistan, Pakistan, and Iraq. Let the troops stick to what they're trained to do and let the nation builders stick to what they're trained to. But I'm sure we would get a bunch of crybabies like the Department of State has had complaining about \"less than pleasant\" assignments time after time.", 
        "intTime": 20090527, 
        "postID": 12, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by yanqui69: Let's send in some of those ivy league scholarship recipients to perform their \"community service\" assisting Pakis and Afghanis and strategically turn the tide of against the Taliban. After all, the peacenicks seem to preach that's all we need and it would work. Oh! And without the protection of the US military. Community service is one of the greatest contributions one can do for their country short of military service. I really like Obama's idea. God forbid we encourage people to give back to our nation once in a while.", 
        "reply": " Oh, I agree, but they should contribute to America's national security objectives as well; like in Afghanistan, Pakistan, and Iraq. Let the troops stick to what they're trained to do and let the nation builders stick to what they're trained to. But I'm sure we would get a bunch of crybabies like the Department of State has had complaining about \"less than pleasant\" assignments time after time.", 
        "threadID": "672198221_2310003422001", 
        "time": "2009-05-27 13:14:00", 
        "title": "Trust the Afghan Army", 
        "userID": "yanqui69"
    }, 
    {
        "content": "Here are my thoughts on Afgan. 1. Why are we there? Because we \"THINK\" OBL pull off 9/11 correct? Then who is the guy in GITMO that claim to be the \"Master Mind\" of 9/11, its not OBL. 2. My personnal thoughts about 9/11, is look at Saudi...thats where almost all of the hijackers came from. 3. Afgan is a nothing country, they have nothing but wasteland and they can grow dope up north in the country, outside of that,,not a darn thing. 4. Afgan has a name, Empire killer...many a empire has wasted so many troops in that hell hole, it led to a lot of their demise. Look at Russia...How many troops did they lose? And as you track back through history, you will find the same...The country is a cess pool, let the Taliban have it. When they had it, it was a cess pool and after we leave it will turn back into a cess pool... Our problem is our Intell is so screw up that I don't think we really know who pull off 9/11. Old Slick Willie and Kerry and Democrat party said Iraq had WMD's and you see where that led us. Was this the same Intell that said OBL pull off 9/11? If so....whoa!!!! Someones crap is wrong. We got ourselves in situations that are very hard to get out of (outside of cut and run). And now N.K. is acting up and if they go for it! Well we flat don't have the man power to do much now do we, and if we start the draft. Canada will fill up real quick. If I was a rogue nation, now would be the time to pull it off...Sure we have the \"Bomb\" but so does N.K. and half dozen other countries that we don't even know about, i.e. China (big one there). So such is life..........", 
        "intTime": 20090527, 
        "postID": 13, 
        "quote": "", 
        "reply": "Here are my thoughts on Afgan. 1. Why are we there? Because we \"THINK\" OBL pull off 9/11 correct? Then who is the guy in GITMO that claim to be the \"Master Mind\" of 9/11, its not OBL. 2. My personnal thoughts about 9/11, is look at Saudi...thats where almost all of the hijackers came from. 3. Afgan is a nothing country, they have nothing but wasteland and they can grow dope up north in the country, outside of that,,not a darn thing. 4. Afgan has a name, Empire killer...many a empire has wasted so many troops in that hell hole, it led to a lot of their demise. Look at Russia...How many troops did they lose? And as you track back through history, you will find the same...The country is a cess pool, let the Taliban have it. When they had it, it was a cess pool and after we leave it will turn back into a cess pool... Our problem is our Intell is so screw up that I don't think we really know who pull off 9/11. Old Slick Willie and Kerry and Democrat party said Iraq had WMD's and you see where that led us. Was this the same Intell that said OBL pull off 9/11? If so....whoa!!!! Someones crap is wrong. We got ourselves in situations that are very hard to get out of (outside of cut and run). And now N.K. is acting up and if they go for it! Well we flat don't have the man power to do much now do we, and if we start the draft. Canada will fill up real quick. If I was a rogue nation, now would be the time to pull it off...Sure we have the \"Bomb\" but so does N.K. and half dozen other countries that we don't even know about, i.e. China (big one there). So such is life..........", 
        "threadID": "672198221_2310003422001", 
        "time": "2009-05-27 16:20:00", 
        "title": "Trust the Afghan Army", 
        "userID": "dman1948"
    }
]