[
    {
        "content": "Just so much BS. Who is kidding whom here? The USA is no different than any other country when it comes to techniques on obtaining intelligence information. Techniques that work will be employed. This whole thing is NOT about \"waterboarding,\" but rather about making the former administration look bad in its decision making processess. Lets get going in the right direction and forget this crap. Bringing this stuff up is only leading to future administrations doing pretty much the same thing. Can't we all just get along?", 
        "intTime": 20090421, 
        "postID": 1, 
        "quote": "", 
        "reply": "Just so much BS. Who is kidding whom here? The USA is no different than any other country when it comes to techniques on obtaining intelligence information. Techniques that work will be employed. This whole thing is NOT about \"waterboarding,\" but rather about making the former administration look bad in its decision making processess. Lets get going in the right direction and forget this crap. Bringing this stuff up is only leading to future administrations doing pretty much the same thing. Can't we all just get along?", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 05:26:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "GeorgeVaughan"
    }, 
    {
        "content": "Agreed ... sure hope the rest of American is not buying this ...", 
        "intTime": 20090421, 
        "postID": 2, 
        "quote": "", 
        "reply": "Agreed ... sure hope the rest of American is not buying this ...", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 05:39:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "alorros"
    }, 
    {
        "content": "I hope you ay-holes that voted for P-BO are happy with this \"change\" (and hope).", 
        "intTime": 20090421, 
        "postID": 3, 
        "quote": "", 
        "reply": "I hope you ay-holes that voted for P-BO are happy with this \"change\" (and hope).", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 05:54:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "ColonelLightMarineOneEach"
    }, 
    {
        "content": "He has no defence.t want to tarnish Mr. Bush.", 
        "intTime": 20090421, 
        "postID": 4, 
        "quote": "", 
        "reply": "He has no defence.t want to tarnish Mr. Bush.", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 05:55:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "Migbuster"
    }, 
    {
        "content": "How's that Obama vote working for you?", 
        "intTime": 20090421, 
        "postID": 5, 
        "quote": "", 
        "reply": "How's that Obama vote working for you?", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 06:18:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "clarkpaton"
    }, 
    {
        "content": "\"But he said upholding U.S. values and ideals in the face of such an enemy is \"what makes the United States special and what makes you special.\" \" Sounds like Barak is doing his best to impersonate Dana Carvey doing the Church Lady,well he has one aspect down pat,that would be HYPOCRISY.", 
        "intTime": 20090421, 
        "postID": 6, 
        "quote": "", 
        "reply": "\"But he said upholding U.S. values and ideals in the face of such an enemy is \"what makes the United States special and what makes you special.\" \" Sounds like Barak is doing his best to impersonate Dana Carvey doing the Church Lady,well he has one aspect down pat,that would be HYPOCRISY.", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 06:33:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "khyland"
    }, 
    {
        "content": "Well, I see four posts one after the other demanding ignorance as the criterium for a free society. We have no right to know? What can be more harmful to America then telling us what is done in our name? I for one appreciate this memo. We HAVE been told about torture before - and statments have been made that torture was barely used. That all the information was gained in thirty seconds. That was the \"Truth\" before the release of this memo. So it's not that anyone is complaining about being lied to - You're complaining that you're getting the truth. My, my, my. Maybe we should pass a Constitutional Amendment? \"If the truth hurts, it's a criminal offense to tell it.\" Dave", 
        "intTime": 20090421, 
        "postID": 7, 
        "quote": "", 
        "reply": "Well, I see four posts one after the other demanding ignorance as the criterium for a free society. We have no right to know? What can be more harmful to America then telling us what is done in our name? I for one appreciate this memo. We HAVE been told about torture before - and statments have been made that torture was barely used. That all the information was gained in thirty seconds. That was the \"Truth\" before the release of this memo. So it's not that anyone is complaining about being lied to - You're complaining that you're getting the truth. My, my, my. Maybe we should pass a Constitutional Amendment? \"If the truth hurts, it's a criminal offense to tell it.\" Dave", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 06:35:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "Grachus"
    }, 
    {
        "content": "Yeah Beerys Special alright. I'd say just like Jerrys Kids but that would be an insult to them.", 
        "intTime": 20090421, 
        "postID": 8, 
        "quote": "", 
        "reply": "Yeah Beerys Special alright. I'd say just like Jerrys Kids but that would be an insult to them.", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 06:50:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "Eddie8"
    }, 
    {
        "content": "You can know ahead of time how the obamanites play these games. Ask yourself how they'd leverage polyticks and deal with it in southside Chi-Town to gain whatever form-over-function traction it might offer. The absurdity of the non-logic of Obama's wondrous decision (the nation wasn't safe till he showed up, just ask the jackasses) is that the rationales touted the lack of efficacy of the techniques. But the leftist kommissars know that release of the results shows that, indeed, the results obtained from these techniques were quite effective. At least half of the information by which our nation of 300 million and the people of other lands, too, remained safe from further attacks by these islamic extremists after 9/11 derived from the techniques. And there is no moral equivalency, US vs. islamonazis. We waterboard murderous scumbags; they cut the heads off innocent people. But the current administration talking heads mouth idiotic comments about \"dangers\" of citizens uniting voluntarily to peacefully protest enforced collectivism, while insisting on flaccid terminology about the War on Terror that must be waged. With such absurd, control-freak, fear-of-the-people \"judgment,\" no informed American can have confidence that the narcissists are making the right decisions. Even Leon Panetta, who the leftists of this forum praised when his appointment was tendered, thinks this release was harmful.", 
        "intTime": 20090421, 
        "postID": 9, 
        "quote": "", 
        "reply": "You can know ahead of time how the obamanites play these games. Ask yourself how they'd leverage polyticks and deal with it in southside Chi-Town to gain whatever form-over-function traction it might offer. The absurdity of the non-logic of Obama's wondrous decision (the nation wasn't safe till he showed up, just ask the jackasses) is that the rationales touted the lack of efficacy of the techniques. But the leftist kommissars know that release of the results shows that, indeed, the results obtained from these techniques were quite effective. At least half of the information by which our nation of 300 million and the people of other lands, too, remained safe from further attacks by these islamic extremists after 9/11 derived from the techniques. And there is no moral equivalency, US vs. islamonazis. We waterboard murderous scumbags; they cut the heads off innocent people. But the current administration talking heads mouth idiotic comments about \"dangers\" of citizens uniting voluntarily to peacefully protest enforced collectivism, while insisting on flaccid terminology about the War on Terror that must be waged. With such absurd, control-freak, fear-of-the-people \"judgment,\" no informed American can have confidence that the narcissists are making the right decisions. Even Leon Panetta, who the leftists of this forum praised when his appointment was tendered, thinks this release was harmful.", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 06:51:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt", 
        "intTime": 20090421, 
        "postID": 10, 
        "quote": "Originally posted by clarkpaton: How's that Obama vote working for you?", 
        "reply": " Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 07:10:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by RRR52: You can know ahead of time how the obamanites play these games. Ask yourself how they'd leverage polyticks and deal with it in southside Chi-Town to gain whatever form-over-function traction it might offer. The absurdity of the non-logic of Obama's wondrous decision (the nation wasn't safe till he showed up, just ask the jackasses) is that the rationales touted the lack of efficacy of the techniques. But the leftist kommissars know that release of the results shows that, indeed, the results obtained from these techniques were quite effective. At least half of the information by which our nation of 300 million and the people of other lands, too, remained safe from further attacks by these islamic extremists after 9/11 derived from the techniques. Ahh, the anti Control Freak, once again supports more and more control. This memo claims that the waterboarding gained no new information. You say it did? Yet the only \"proof\" that it did is given to us by the same people who told us that they confessed after 30 seconds. In other words your proof is based on a proved LIAR. quote: Originally posted by RRR52: And there is no moral equivalency, US vs. islamonazis. We waterboard murderous scumbags; they cut the heads off innocent people. But the current administration talking heads mouth idiotic comments about \"dangers\" of citizens uniting voluntarily to peacefully protest enforced collectivism, while insisting on flaccid terminology about the War on Terror that must be waged. With such absurd, control-freak, fear-of-the-people \"judgment,\" ROFLMAO - Hear you are violently opposing the release of government documents that reveal that the previous administration were a bunch of control freaks who his the fact that we did use torture, and ranting that releasing documents is proof of THEM being control freaks. You have got to be kidding. quote: Originally posted by RRR52: no informed American can have confidence that the narcissists are making the right decisions. Even Leon Panetta, who the leftists of this forum praised when his appointment was tendered, thinks this release was harmful. Harmful to whom? Harmful to the control freaks who want to keep the American People in the dark? You really think that you're a Libertarian? Better check with Ron Paul, that well known \"control freak\" and see what he has to say about this. Dave", 
        "intTime": 20090421, 
        "postID": 11, 
        "quote": "Originally posted by RRR52: You can know ahead of time how the obamanites play these games. Ask yourself how they'd leverage polyticks and deal with it in southside Chi-Town to gain whatever form-over-function traction it might offer. The absurdity of the non-logic of Obama's wondrous decision (the nation wasn't safe till he showed up, just ask the jackasses) is that the rationales touted the lack of efficacy of the techniques. But the leftist kommissars know that release of the results shows that, indeed, the results obtained from these techniques were quite effective. At least half of the information by which our nation of 300 million and the people of other lands, too, remained safe from further attacks by these islamic extremists after 9/11 derived from the techniques.", 
        "reply": " Ahh, the anti Control Freak, once again supports more and more control. This memo claims that the waterboarding gained no new information. You say it did? Yet the only \"proof\" that it did is given to us by the same people who told us that they confessed after 30 seconds. In other words your proof is based on a proved LIAR. quote: Originally posted by RRR52: And there is no moral equivalency, US vs. islamonazis. We waterboard murderous scumbags; they cut the heads off innocent people. But the current administration talking heads mouth idiotic comments about \"dangers\" of citizens uniting voluntarily to peacefully protest enforced collectivism, while insisting on flaccid terminology about the War on Terror that must be waged. With such absurd, control-freak, fear-of-the-people \"judgment,\" ROFLMAO - Hear you are violently opposing the release of government documents that reveal that the previous administration were a bunch of control freaks who his the fact that we did use torture, and ranting that releasing documents is proof of THEM being control freaks. You have got to be kidding. quote: Originally posted by RRR52: no informed American can have confidence that the narcissists are making the right decisions. Even Leon Panetta, who the leftists of this forum praised when his appointment was tendered, thinks this release was harmful. Harmful to whom? Harmful to the control freaks who want to keep the American People in the dark? You really think that you're a Libertarian? Better check with Ron Paul, that well known \"control freak\" and see what he has to say about this. Dave", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 08:01:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt You know, I really think that John McCain would have released these documents. I mean that. Dave", 
        "intTime": 20090421, 
        "postID": 12, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt", 
        "reply": " You know, I really think that John McCain would have released these documents. I mean that. Dave", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 08:02:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt You know, I really think that John McCain would have released these documents. I mean that. Dave ===================================== One thing every Bush or any President knocker seems to forget is that NOTHING can happen unless congress says yes let it happen. The President can only ask, the congress is what is doing it. It is the congress that is putting our grandchildren in debt. it was the congress that sent us to war in Iraq and Afganistan. The president asked and they said yes..The president asked for more money to continue the war the congress said yes. And for that last almost 2 1/2 yrs. that has been a democrat controlled congress. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090421, 
        "postID": 13, 
        "quote": "Originally posted by Grachus: quote: Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt You know, I really think that John McCain would have released these documents. I mean that. Dave", 
        "reply": " ===================================== One thing every Bush or any President knocker seems to forget is that NOTHING can happen unless congress says yes let it happen. The President can only ask, the congress is what is doing it. It is the congress that is putting our grandchildren in debt. it was the congress that sent us to war in Iraq and Afganistan. The president asked and they said yes..The president asked for more money to continue the war the congress said yes. And for that last almost 2 1/2 yrs. that has been a democrat controlled congress. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 08:34:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "EOCRon"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt WORD!", 
        "intTime": 20090421, 
        "postID": 14, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt", 
        "reply": " WORD!", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 08:52:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "alzuk"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt You know, I really think that John McCain would have released these documents. I mean that. Dave And I think that you are right. Allowing the world to think that we torture people is dangerous to troops in the field. The enemy is less likely to surrender if they think that they are going to be tortured they will stay in the fight longer and possibly inflect more US causalities. I remember an Iraqi that we captured in the Gulf War begging us not to cut off his ears. He had seen Vietnam movies that showed the practice of ear taking and was scared to death. Now what if he had decided that the risk of having his ear removed was too high and instead of surrendering to us, continued shooting at us or blew himself up with us with him? I think that McCain would have understood that. Coming clean is the best thing that we can do. This message has been edited. Last edited by: alzuk, Tue 21 April 2009 09:30 AM", 
        "intTime": 20090421, 
        "postID": 15, 
        "quote": "Originally posted by Grachus: quote: Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt You know, I really think that John McCain would have released these documents. I mean that. Dave", 
        "reply": " And I think that you are right. Allowing the world to think that we torture people is dangerous to troops in the field. The enemy is less likely to surrender if they think that they are going to be tortured they will stay in the fight longer and possibly inflect more US causalities. I remember an Iraqi that we captured in the Gulf War begging us not to cut off his ears. He had seen Vietnam movies that showed the practice of ear taking and was scared to death. Now what if he had decided that the risk of having his ear removed was too high and instead of surrendering to us, continued shooting at us or blew himself up with us with him? I think that McCain would have understood that. Coming clean is the best thing that we can do. This message has been edited. Last edited by: alzuk, Tue 21 April 2009 09:30 AM", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 09:04:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "alzuk"
    }, 
    {
        "content": "Yea, I remember John Kerry admitting to ear taking in front of Congress, what is he know? A U.S. Senator... As far as Obama: Stupid is, Stupid Does. And you liberals and democrats are trying oh so hard to make us GOP's terrorist...and using the excuse WE don't want to lose our liberties.. Now what are you called again? What is the ACLU? If one would stop a mintue and see the linerals and Democrats are trying to use their own beliefs and flip to make the GOP look bad.. What a bunch of losers.. What is Feinstein (sp) husband doing as we speak, flip the deal his wife made for him into what 25 billion!!! Yea right liberals and Democrats keep on talking.", 
        "intTime": 20090421, 
        "postID": 16, 
        "quote": "", 
        "reply": "Yea, I remember John Kerry admitting to ear taking in front of Congress, what is he know? A U.S. Senator... As far as Obama: Stupid is, Stupid Does. And you liberals and democrats are trying oh so hard to make us GOP's terrorist...and using the excuse WE don't want to lose our liberties.. Now what are you called again? What is the ACLU? If one would stop a mintue and see the linerals and Democrats are trying to use their own beliefs and flip to make the GOP look bad.. What a bunch of losers.. What is Feinstein (sp) husband doing as we speak, flip the deal his wife made for him into what 25 billion!!! Yea right liberals and Democrats keep on talking.", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 09:24:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by dman1948: Yea, I remember John Kerry admitting to ear taking in front of Congress, what is he know? A U.S. Senator... As far as Obama: Stupid is, Stupid Does. And you liberals and democrats are trying oh so hard to make us GOP's terrorist...and using the excuse WE don't want to lose our liberties.. Now what are you called again? What is the ACLU? If one would stop a mintue and see the linerals and Democrats are trying to use their own beliefs and flip to make the GOP look bad.. What a bunch of losers.. What is Feinstein (sp) husband doing as we speak, flip the deal his wife made for him into what 25 billion!!! Yea right liberals and Democrats keep on talking. You're posts on this subject are kind of interesting. From one post to the other, and for that matter, one sentence to another, they completely contradict themselves. So do you oppose releasing this memo, or not? Dave", 
        "intTime": 20090421, 
        "postID": 17, 
        "quote": "Originally posted by dman1948: Yea, I remember John Kerry admitting to ear taking in front of Congress, what is he know? A U.S. Senator... As far as Obama: Stupid is, Stupid Does. And you liberals and democrats are trying oh so hard to make us GOP's terrorist...and using the excuse WE don't want to lose our liberties.. Now what are you called again? What is the ACLU? If one would stop a mintue and see the linerals and Democrats are trying to use their own beliefs and flip to make the GOP look bad.. What a bunch of losers.. What is Feinstein (sp) husband doing as we speak, flip the deal his wife made for him into what 25 billion!!! Yea right liberals and Democrats keep on talking.", 
        "reply": " You're posts on this subject are kind of interesting. From one post to the other, and for that matter, one sentence to another, they completely contradict themselves. So do you oppose releasing this memo, or not? Dave", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 09:37:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "Grachus"
    }, 
    {
        "content": "Barak Hussein Obama's behavior can be summed up in a few simple words--HE IS STILL A MUSLIM! He is bent on destroying non-muslims. None of the former presidents are muslims and the United States is not a muslim country. So, he works to disparage the performance of his predecessors, and he works to eventually weaken or even destroy the country by bankrupting it through his enormous expenditures and budget. He bowed to the king of Saudi Arabia! Did he bow to the Queen of England? Of course NO!! BHO is a muslim who must bow to his muslim king and not bow to a woman. Muslims do not believe that women are equal to men and that they do not deserve equal respect.", 
        "intTime": 20090421, 
        "postID": 18, 
        "quote": "", 
        "reply": "Barak Hussein Obama's behavior can be summed up in a few simple words--HE IS STILL A MUSLIM! He is bent on destroying non-muslims. None of the former presidents are muslims and the United States is not a muslim country. So, he works to disparage the performance of his predecessors, and he works to eventually weaken or even destroy the country by bankrupting it through his enormous expenditures and budget. He bowed to the king of Saudi Arabia! Did he bow to the Queen of England? Of course NO!! BHO is a muslim who must bow to his muslim king and not bow to a woman. Muslims do not believe that women are equal to men and that they do not deserve equal respect.", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 09:39:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "20865589"
    }, 
    {
        "content": "quote: Originally posted by alzuk: quote: Originally posted by Grachus: quote: Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt You know, I really think that John McCain would have released these documents. I mean that. Dave And I think that you are right. Allowing the world to think that we torture people is dangerous to troops in the field. The enemy is less likely to surrender if they think that they are going to be tortured they will stay in the fight longer and possibly inflect more US causalities. I remember an Iraqi that we captured in the Gulf War begging us not to cut off his ears. He had seen Vietnam movies that showed the practice of ear taking and was scared to death. Now what if he had decided that the risk of having his ear removed was too high and instead of surrendering to us, continued shooting at us or blew himself up with us with him? I think that McCain would have understood that. Coming clean is the best thing that we can do. Leave the triangle alone. It's taking up too much time. MD", 
        "intTime": 20090421, 
        "postID": 19, 
        "quote": "Originally posted by alzuk: quote: Originally posted by Grachus: quote: Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt You know, I really think that John McCain would have released these documents. I mean that. Dave And I think that you are right. Allowing the world to think that we torture people is dangerous to troops in the field. The enemy is less likely to surrender if they think that they are going to be tortured they will stay in the fight longer and possibly inflect more US causalities. I remember an Iraqi that we captured in the Gulf War begging us not to cut off his ears. He had seen Vietnam movies that showed the practice of ear taking and was scared to death. Now what if he had decided that the risk of having his ear removed was too high and instead of surrendering to us, continued shooting at us or blew himself up with us with him? I think that McCain would have understood that. Coming clean is the best thing that we can do.", 
        "reply": " Leave the triangle alone. It's taking up too much time. MD", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 09:40:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by 20865589: Barak Hussein Obama's behavior can be summed up in a few simple words--HE IS STILL A MUSLIM! He is bent on destroying non-muslims. None of the former presidents are muslims and the United States is not a muslim country. So, he works to disparage the performance of his predecessors, and he works to eventually weaken or even destroy the country by bankrupting it through his enormous expenditures and budget. He bowed to the king of Saudi Arabia! Did he bow to the Queen of England? Of course NO!! BHO is a muslim who must bow to his muslim king and not bow to a woman. Muslims do not believe that women are equal to men and that they do not deserve equal respect. And people complain about the DHS issuing warnings about Right Wing Fanatics targeting Vets... And this is a moderated board, I wonder what he's saying to his own buddies. Dave", 
        "intTime": 20090421, 
        "postID": 20, 
        "quote": "Originally posted by 20865589: Barak Hussein Obama's behavior can be summed up in a few simple words--HE IS STILL A MUSLIM! He is bent on destroying non-muslims. None of the former presidents are muslims and the United States is not a muslim country. So, he works to disparage the performance of his predecessors, and he works to eventually weaken or even destroy the country by bankrupting it through his enormous expenditures and budget. He bowed to the king of Saudi Arabia! Did he bow to the Queen of England? Of course NO!! BHO is a muslim who must bow to his muslim king and not bow to a woman. Muslims do not believe that women are equal to men and that they do not deserve equal respect.", 
        "reply": " And people complain about the DHS issuing warnings about Right Wing Fanatics targeting Vets... And this is a moderated board, I wonder what he's saying to his own buddies. Dave", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 09:50:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "Grachus"
    }, 
    {
        "content": "Just so much BS. Who is kidding whom here? The USA is no different than any other country when it comes to techniques on obtaining intelligence information. Techniques that work will be employed. This whole thing is NOT about \"waterboarding,\" but rather about making the former administration look bad in its decision making processess. Lets get going in the right direction and forget this crap. Bringing this stuff up is only leading to future administrations doing pretty much the same thing. Can't we all just get along?", 
        "intTime": 20090421, 
        "postID": 21, 
        "quote": "", 
        "reply": "Just so much BS. Who is kidding whom here? The USA is no different than any other country when it comes to techniques on obtaining intelligence information. Techniques that work will be employed. This whole thing is NOT about \"waterboarding,\" but rather about making the former administration look bad in its decision making processess. Lets get going in the right direction and forget this crap. Bringing this stuff up is only leading to future administrations doing pretty much the same thing. Can't we all just get along?", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 05:26:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "GeorgeVaughan"
    }, 
    {
        "content": "Agreed ... sure hope the rest of American is not buying this ...", 
        "intTime": 20090421, 
        "postID": 22, 
        "quote": "", 
        "reply": "Agreed ... sure hope the rest of American is not buying this ...", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 05:39:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "alorros"
    }, 
    {
        "content": "I hope you ay-holes that voted for P-BO are happy with this \"change\" (and hope).", 
        "intTime": 20090421, 
        "postID": 23, 
        "quote": "", 
        "reply": "I hope you ay-holes that voted for P-BO are happy with this \"change\" (and hope).", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 05:54:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "ColonelLightMarineOneEach"
    }, 
    {
        "content": "He has no defence.t want to tarnish Mr. Bush.", 
        "intTime": 20090421, 
        "postID": 24, 
        "quote": "", 
        "reply": "He has no defence.t want to tarnish Mr. Bush.", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 05:55:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "Migbuster"
    }, 
    {
        "content": "How's that Obama vote working for you?", 
        "intTime": 20090421, 
        "postID": 25, 
        "quote": "", 
        "reply": "How's that Obama vote working for you?", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 06:18:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "clarkpaton"
    }, 
    {
        "content": "\"But he said upholding U.S. values and ideals in the face of such an enemy is \"what makes the United States special and what makes you special.\" \" Sounds like Barak is doing his best to impersonate Dana Carvey doing the Church Lady,well he has one aspect down pat,that would be HYPOCRISY.", 
        "intTime": 20090421, 
        "postID": 26, 
        "quote": "", 
        "reply": "\"But he said upholding U.S. values and ideals in the face of such an enemy is \"what makes the United States special and what makes you special.\" \" Sounds like Barak is doing his best to impersonate Dana Carvey doing the Church Lady,well he has one aspect down pat,that would be HYPOCRISY.", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 06:33:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "khyland"
    }, 
    {
        "content": "Well, I see four posts one after the other demanding ignorance as the criterium for a free society. We have no right to know? What can be more harmful to America then telling us what is done in our name? I for one appreciate this memo. We HAVE been told about torture before - and statments have been made that torture was barely used. That all the information was gained in thirty seconds. That was the \"Truth\" before the release of this memo. So it's not that anyone is complaining about being lied to - You're complaining that you're getting the truth. My, my, my. Maybe we should pass a Constitutional Amendment? \"If the truth hurts, it's a criminal offense to tell it.\" Dave", 
        "intTime": 20090421, 
        "postID": 27, 
        "quote": "", 
        "reply": "Well, I see four posts one after the other demanding ignorance as the criterium for a free society. We have no right to know? What can be more harmful to America then telling us what is done in our name? I for one appreciate this memo. We HAVE been told about torture before - and statments have been made that torture was barely used. That all the information was gained in thirty seconds. That was the \"Truth\" before the release of this memo. So it's not that anyone is complaining about being lied to - You're complaining that you're getting the truth. My, my, my. Maybe we should pass a Constitutional Amendment? \"If the truth hurts, it's a criminal offense to tell it.\" Dave", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 06:35:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "Grachus"
    }, 
    {
        "content": "Yeah Beerys Special alright. I'd say just like Jerrys Kids but that would be an insult to them.", 
        "intTime": 20090421, 
        "postID": 28, 
        "quote": "", 
        "reply": "Yeah Beerys Special alright. I'd say just like Jerrys Kids but that would be an insult to them.", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 06:50:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "Eddie8"
    }, 
    {
        "content": "You can know ahead of time how the obamanites play these games. Ask yourself how they'd leverage polyticks and deal with it in southside Chi-Town to gain whatever form-over-function traction it might offer. The absurdity of the non-logic of Obama's wondrous decision (the nation wasn't safe till he showed up, just ask the jackasses) is that the rationales touted the lack of efficacy of the techniques. But the leftist kommissars know that release of the results shows that, indeed, the results obtained from these techniques were quite effective. At least half of the information by which our nation of 300 million and the people of other lands, too, remained safe from further attacks by these islamic extremists after 9/11 derived from the techniques. And there is no moral equivalency, US vs. islamonazis. We waterboard murderous scumbags; they cut the heads off innocent people. But the current administration talking heads mouth idiotic comments about \"dangers\" of citizens uniting voluntarily to peacefully protest enforced collectivism, while insisting on flaccid terminology about the War on Terror that must be waged. With such absurd, control-freak, fear-of-the-people \"judgment,\" no informed American can have confidence that the narcissists are making the right decisions. Even Leon Panetta, who the leftists of this forum praised when his appointment was tendered, thinks this release was harmful.", 
        "intTime": 20090421, 
        "postID": 29, 
        "quote": "", 
        "reply": "You can know ahead of time how the obamanites play these games. Ask yourself how they'd leverage polyticks and deal with it in southside Chi-Town to gain whatever form-over-function traction it might offer. The absurdity of the non-logic of Obama's wondrous decision (the nation wasn't safe till he showed up, just ask the jackasses) is that the rationales touted the lack of efficacy of the techniques. But the leftist kommissars know that release of the results shows that, indeed, the results obtained from these techniques were quite effective. At least half of the information by which our nation of 300 million and the people of other lands, too, remained safe from further attacks by these islamic extremists after 9/11 derived from the techniques. And there is no moral equivalency, US vs. islamonazis. We waterboard murderous scumbags; they cut the heads off innocent people. But the current administration talking heads mouth idiotic comments about \"dangers\" of citizens uniting voluntarily to peacefully protest enforced collectivism, while insisting on flaccid terminology about the War on Terror that must be waged. With such absurd, control-freak, fear-of-the-people \"judgment,\" no informed American can have confidence that the narcissists are making the right decisions. Even Leon Panetta, who the leftists of this forum praised when his appointment was tendered, thinks this release was harmful.", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 06:51:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt", 
        "intTime": 20090421, 
        "postID": 30, 
        "quote": "Originally posted by clarkpaton: How's that Obama vote working for you?", 
        "reply": " Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 07:10:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "quote: Originally posted by RRR52: You can know ahead of time how the obamanites play these games. Ask yourself how they'd leverage polyticks and deal with it in southside Chi-Town to gain whatever form-over-function traction it might offer. The absurdity of the non-logic of Obama's wondrous decision (the nation wasn't safe till he showed up, just ask the jackasses) is that the rationales touted the lack of efficacy of the techniques. But the leftist kommissars know that release of the results shows that, indeed, the results obtained from these techniques were quite effective. At least half of the information by which our nation of 300 million and the people of other lands, too, remained safe from further attacks by these islamic extremists after 9/11 derived from the techniques. Ahh, the anti Control Freak, once again supports more and more control. This memo claims that the waterboarding gained no new information. You say it did? Yet the only \"proof\" that it did is given to us by the same people who told us that they confessed after 30 seconds. In other words your proof is based on a proved LIAR. quote: Originally posted by RRR52: And there is no moral equivalency, US vs. islamonazis. We waterboard murderous scumbags; they cut the heads off innocent people. But the current administration talking heads mouth idiotic comments about \"dangers\" of citizens uniting voluntarily to peacefully protest enforced collectivism, while insisting on flaccid terminology about the War on Terror that must be waged. With such absurd, control-freak, fear-of-the-people \"judgment,\" ROFLMAO - Hear you are violently opposing the release of government documents that reveal that the previous administration were a bunch of control freaks who his the fact that we did use torture, and ranting that releasing documents is proof of THEM being control freaks. You have got to be kidding. quote: Originally posted by RRR52: no informed American can have confidence that the narcissists are making the right decisions. Even Leon Panetta, who the leftists of this forum praised when his appointment was tendered, thinks this release was harmful. Harmful to whom? Harmful to the control freaks who want to keep the American People in the dark? You really think that you're a Libertarian? Better check with Ron Paul, that well known \"control freak\" and see what he has to say about this. Dave", 
        "intTime": 20090421, 
        "postID": 31, 
        "quote": "Originally posted by RRR52: You can know ahead of time how the obamanites play these games. Ask yourself how they'd leverage polyticks and deal with it in southside Chi-Town to gain whatever form-over-function traction it might offer. The absurdity of the non-logic of Obama's wondrous decision (the nation wasn't safe till he showed up, just ask the jackasses) is that the rationales touted the lack of efficacy of the techniques. But the leftist kommissars know that release of the results shows that, indeed, the results obtained from these techniques were quite effective. At least half of the information by which our nation of 300 million and the people of other lands, too, remained safe from further attacks by these islamic extremists after 9/11 derived from the techniques.", 
        "reply": " Ahh, the anti Control Freak, once again supports more and more control. This memo claims that the waterboarding gained no new information. You say it did? Yet the only \"proof\" that it did is given to us by the same people who told us that they confessed after 30 seconds. In other words your proof is based on a proved LIAR. quote: Originally posted by RRR52: And there is no moral equivalency, US vs. islamonazis. We waterboard murderous scumbags; they cut the heads off innocent people. But the current administration talking heads mouth idiotic comments about \"dangers\" of citizens uniting voluntarily to peacefully protest enforced collectivism, while insisting on flaccid terminology about the War on Terror that must be waged. With such absurd, control-freak, fear-of-the-people \"judgment,\" ROFLMAO - Hear you are violently opposing the release of government documents that reveal that the previous administration were a bunch of control freaks who his the fact that we did use torture, and ranting that releasing documents is proof of THEM being control freaks. You have got to be kidding. quote: Originally posted by RRR52: no informed American can have confidence that the narcissists are making the right decisions. Even Leon Panetta, who the leftists of this forum praised when his appointment was tendered, thinks this release was harmful. Harmful to whom? Harmful to the control freaks who want to keep the American People in the dark? You really think that you're a Libertarian? Better check with Ron Paul, that well known \"control freak\" and see what he has to say about this. Dave", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 08:01:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt You know, I really think that John McCain would have released these documents. I mean that. Dave", 
        "intTime": 20090421, 
        "postID": 32, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt", 
        "reply": " You know, I really think that John McCain would have released these documents. I mean that. Dave", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 08:02:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt You know, I really think that John McCain would have released these documents. I mean that. Dave ===================================== One thing every Bush or any President knocker seems to forget is that NOTHING can happen unless congress says yes let it happen. The President can only ask, the congress is what is doing it. It is the congress that is putting our grandchildren in debt. it was the congress that sent us to war in Iraq and Afganistan. The president asked and they said yes..The president asked for more money to continue the war the congress said yes. And for that last almost 2 1/2 yrs. that has been a democrat controlled congress. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090421, 
        "postID": 33, 
        "quote": "Originally posted by Grachus: quote: Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt You know, I really think that John McCain would have released these documents. I mean that. Dave", 
        "reply": " ===================================== One thing every Bush or any President knocker seems to forget is that NOTHING can happen unless congress says yes let it happen. The President can only ask, the congress is what is doing it. It is the congress that is putting our grandchildren in debt. it was the congress that sent us to war in Iraq and Afganistan. The president asked and they said yes..The president asked for more money to continue the war the congress said yes. And for that last almost 2 1/2 yrs. that has been a democrat controlled congress. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 08:34:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "EOCRon"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt WORD!", 
        "intTime": 20090421, 
        "postID": 34, 
        "quote": "Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt", 
        "reply": " WORD!", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 08:52:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "alzuk"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt You know, I really think that John McCain would have released these documents. I mean that. Dave And I think that you are right. Allowing the world to think that we torture people is dangerous to troops in the field. The enemy is less likely to surrender if they think that they are going to be tortured they will stay in the fight longer and possibly inflect more US causalities. I remember an Iraqi that we captured in the Gulf War begging us not to cut off his ears. He had seen Vietnam movies that showed the practice of ear taking and was scared to death. Now what if he had decided that the risk of having his ear removed was too high and instead of surrendering to us, continued shooting at us or blew himself up with us with him? I think that McCain would have understood that. Coming clean is the best thing that we can do. This message has been edited. Last edited by: alzuk, Tue 21 April 2009 09:30 AM", 
        "intTime": 20090421, 
        "postID": 35, 
        "quote": "Originally posted by Grachus: quote: Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt You know, I really think that John McCain would have released these documents. I mean that. Dave", 
        "reply": " And I think that you are right. Allowing the world to think that we torture people is dangerous to troops in the field. The enemy is less likely to surrender if they think that they are going to be tortured they will stay in the fight longer and possibly inflect more US causalities. I remember an Iraqi that we captured in the Gulf War begging us not to cut off his ears. He had seen Vietnam movies that showed the practice of ear taking and was scared to death. Now what if he had decided that the risk of having his ear removed was too high and instead of surrendering to us, continued shooting at us or blew himself up with us with him? I think that McCain would have understood that. Coming clean is the best thing that we can do. This message has been edited. Last edited by: alzuk, Tue 21 April 2009 09:30 AM", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 09:04:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "alzuk"
    }, 
    {
        "content": "Yea, I remember John Kerry admitting to ear taking in front of Congress, what is he know? A U.S. Senator... As far as Obama: Stupid is, Stupid Does. And you liberals and democrats are trying oh so hard to make us GOP's terrorist...and using the excuse WE don't want to lose our liberties.. Now what are you called again? What is the ACLU? If one would stop a mintue and see the linerals and Democrats are trying to use their own beliefs and flip to make the GOP look bad.. What a bunch of losers.. What is Feinstein (sp) husband doing as we speak, flip the deal his wife made for him into what 25 billion!!! Yea right liberals and Democrats keep on talking.", 
        "intTime": 20090421, 
        "postID": 36, 
        "quote": "", 
        "reply": "Yea, I remember John Kerry admitting to ear taking in front of Congress, what is he know? A U.S. Senator... As far as Obama: Stupid is, Stupid Does. And you liberals and democrats are trying oh so hard to make us GOP's terrorist...and using the excuse WE don't want to lose our liberties.. Now what are you called again? What is the ACLU? If one would stop a mintue and see the linerals and Democrats are trying to use their own beliefs and flip to make the GOP look bad.. What a bunch of losers.. What is Feinstein (sp) husband doing as we speak, flip the deal his wife made for him into what 25 billion!!! Yea right liberals and Democrats keep on talking.", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 09:24:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by dman1948: Yea, I remember John Kerry admitting to ear taking in front of Congress, what is he know? A U.S. Senator... As far as Obama: Stupid is, Stupid Does. And you liberals and democrats are trying oh so hard to make us GOP's terrorist...and using the excuse WE don't want to lose our liberties.. Now what are you called again? What is the ACLU? If one would stop a mintue and see the linerals and Democrats are trying to use their own beliefs and flip to make the GOP look bad.. What a bunch of losers.. What is Feinstein (sp) husband doing as we speak, flip the deal his wife made for him into what 25 billion!!! Yea right liberals and Democrats keep on talking. You're posts on this subject are kind of interesting. From one post to the other, and for that matter, one sentence to another, they completely contradict themselves. So do you oppose releasing this memo, or not? Dave", 
        "intTime": 20090421, 
        "postID": 37, 
        "quote": "Originally posted by dman1948: Yea, I remember John Kerry admitting to ear taking in front of Congress, what is he know? A U.S. Senator... As far as Obama: Stupid is, Stupid Does. And you liberals and democrats are trying oh so hard to make us GOP's terrorist...and using the excuse WE don't want to lose our liberties.. Now what are you called again? What is the ACLU? If one would stop a mintue and see the linerals and Democrats are trying to use their own beliefs and flip to make the GOP look bad.. What a bunch of losers.. What is Feinstein (sp) husband doing as we speak, flip the deal his wife made for him into what 25 billion!!! Yea right liberals and Democrats keep on talking.", 
        "reply": " You're posts on this subject are kind of interesting. From one post to the other, and for that matter, one sentence to another, they completely contradict themselves. So do you oppose releasing this memo, or not? Dave", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 09:37:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "Grachus"
    }, 
    {
        "content": "Barak Hussein Obama's behavior can be summed up in a few simple words--HE IS STILL A MUSLIM! He is bent on destroying non-muslims. None of the former presidents are muslims and the United States is not a muslim country. So, he works to disparage the performance of his predecessors, and he works to eventually weaken or even destroy the country by bankrupting it through his enormous expenditures and budget. He bowed to the king of Saudi Arabia! Did he bow to the Queen of England? Of course NO!! BHO is a muslim who must bow to his muslim king and not bow to a woman. Muslims do not believe that women are equal to men and that they do not deserve equal respect.", 
        "intTime": 20090421, 
        "postID": 38, 
        "quote": "", 
        "reply": "Barak Hussein Obama's behavior can be summed up in a few simple words--HE IS STILL A MUSLIM! He is bent on destroying non-muslims. None of the former presidents are muslims and the United States is not a muslim country. So, he works to disparage the performance of his predecessors, and he works to eventually weaken or even destroy the country by bankrupting it through his enormous expenditures and budget. He bowed to the king of Saudi Arabia! Did he bow to the Queen of England? Of course NO!! BHO is a muslim who must bow to his muslim king and not bow to a woman. Muslims do not believe that women are equal to men and that they do not deserve equal respect.", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 09:39:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "20865589"
    }, 
    {
        "content": "quote: Originally posted by alzuk: quote: Originally posted by Grachus: quote: Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt You know, I really think that John McCain would have released these documents. I mean that. Dave And I think that you are right. Allowing the world to think that we torture people is dangerous to troops in the field. The enemy is less likely to surrender if they think that they are going to be tortured they will stay in the fight longer and possibly inflect more US causalities. I remember an Iraqi that we captured in the Gulf War begging us not to cut off his ears. He had seen Vietnam movies that showed the practice of ear taking and was scared to death. Now what if he had decided that the risk of having his ear removed was too high and instead of surrendering to us, continued shooting at us or blew himself up with us with him? I think that McCain would have understood that. Coming clean is the best thing that we can do. Leave the triangle alone. It's taking up too much time. MD", 
        "intTime": 20090421, 
        "postID": 39, 
        "quote": "Originally posted by alzuk: quote: Originally posted by Grachus: quote: Originally posted by WhiskeyPapa: quote: Originally posted by clarkpaton: How's that Obama vote working for you? Fine. I can't even imagine the disaster we'd have with McCain and Palin in charge. My God. President Obama has been active and engaged and decisive. And he has been lucky. It may be that he is playing space chess while the rest of us play checkers. Maybe he will fix it so an overwhelming majority of Americans want justice - Cheney, Bush and their traitorous minions in prison. Walt You know, I really think that John McCain would have released these documents. I mean that. Dave And I think that you are right. Allowing the world to think that we torture people is dangerous to troops in the field. The enemy is less likely to surrender if they think that they are going to be tortured they will stay in the fight longer and possibly inflect more US causalities. I remember an Iraqi that we captured in the Gulf War begging us not to cut off his ears. He had seen Vietnam movies that showed the practice of ear taking and was scared to death. Now what if he had decided that the risk of having his ear removed was too high and instead of surrendering to us, continued shooting at us or blew himself up with us with him? I think that McCain would have understood that. Coming clean is the best thing that we can do.", 
        "reply": " Leave the triangle alone. It's taking up too much time. MD", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 09:40:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "mainedawg"
    }, 
    {
        "content": "quote: Originally posted by 20865589: Barak Hussein Obama's behavior can be summed up in a few simple words--HE IS STILL A MUSLIM! He is bent on destroying non-muslims. None of the former presidents are muslims and the United States is not a muslim country. So, he works to disparage the performance of his predecessors, and he works to eventually weaken or even destroy the country by bankrupting it through his enormous expenditures and budget. He bowed to the king of Saudi Arabia! Did he bow to the Queen of England? Of course NO!! BHO is a muslim who must bow to his muslim king and not bow to a woman. Muslims do not believe that women are equal to men and that they do not deserve equal respect. And people complain about the DHS issuing warnings about Right Wing Fanatics targeting Vets... And this is a moderated board, I wonder what he's saying to his own buddies. Dave", 
        "intTime": 20090421, 
        "postID": 40, 
        "quote": "Originally posted by 20865589: Barak Hussein Obama's behavior can be summed up in a few simple words--HE IS STILL A MUSLIM! He is bent on destroying non-muslims. None of the former presidents are muslims and the United States is not a muslim country. So, he works to disparage the performance of his predecessors, and he works to eventually weaken or even destroy the country by bankrupting it through his enormous expenditures and budget. He bowed to the king of Saudi Arabia! Did he bow to the Queen of England? Of course NO!! BHO is a muslim who must bow to his muslim king and not bow to a woman. Muslims do not believe that women are equal to men and that they do not deserve equal respect.", 
        "reply": " And people complain about the DHS issuing warnings about Right Wing Fanatics targeting Vets... And this is a moderated board, I wonder what he's saying to his own buddies. Dave", 
        "threadID": "672198221_5250043122001", 
        "time": "2009-04-21 09:50:00", 
        "title": "Obama Defends Memo Release During CIA Visit", 
        "userID": "Grachus"
    }
]