[
    {
        "content": "Here's the complete list.......projects terminated, shifted and fully supported: quote: ++http://www.defenseindustrydaily.com/Gates-Lays-Out-Key-FY-2010-Budget-Recommendations-05367/ Gates Lays Out Key FY 2010 Budget Recommendations 06-Apr-2009 23:42 EDT On April 6/09, US Secretary of Defense Robert M. Gates did something unusual: he convened a press conference to announce key budget recommendations in advance. That’s a substantial departure from normal procedure, in which the Office of the President’s submitted budget is the first official public notification of key funding... (...) Note that these are just recommendations. The Office of the President may disagree, and they must submit the budget request. Congress may also disagree, and they’re the ones who will approve and fund the final FY 2010 budget. Lobbying will now begin in earnest. Terminated or Ending VH-71 Presidential Helicopter, terminated immediately. Increment 2 helicopters will cost more than Air Force One, and “Increment One helicopters do not meet requirements and are estimated to have only a five- to 10-year useful life.” New options to be developed for a FY 2011 replacement program. F-22A Raptor, ended at 187 planes (183, plus 4 funded aircraft under FY 2009 supplemental). Production to end at the end of 2010, absent lifting of Congressional export restrictions, and corresponding orders from Australia, Japan, Israel, et. al. for a less capable export version. C-17 Globemaster III heavy-lift strategic transport, ended at 205 USAF planes. Production to end at the end of 2010, absent further foreign orders. Note that earmarked Congressional appropriations have been the C-17 program’s sole source of support for several years now – and that Congress has little confidence in the Pentagon mobility studies used to justify program termination. 2018 Bomber. In effect, terminated. “We will not pursue a development program for a follow-on Air Force bomber until we have a better understanding of the need, the requirement, and the technology.” TSAT Satellite Program. Terminated, status of unspent but allocated research funds uncertain. The TSAT-SS satellite contract had been delayed to 2010, and the US military’s planned ultra-high bandwidth laser communications backbone is still a developmental program. TSAT-SS will be replaced in the near term by 2 more AEHF satellites. Its $2+ billion companion TMOS ground control system contract is already underway, and has uses beyond TSAT; fate uncertain. Multiple Kill Vehicle (MKV) program to engage multiple enemy warheads from one defensive missile. Terminated “because of its significant technical challenges.” Air Force Combat Search and Rescue X (CSAR-X) helicopter program, terminated immediately. The program had already been stopped dead by contractor challenges, anyway, so the only thing at risk is re-bid preparation. This will be the most keenly-felt blow by the Air Force. “This program has a troubled acquisition history and raises the fundamental question of whether this important mission can only be accomplished by yet another single-service solution…. We will take a fresh look at the requirement behind this program and develop a more sustainable approach.” Future Combat Systems Ground Vehicle Program. That component makes up over half of the $162 billion meta-program. Recommends canceling that $87 billion component, re-evaluating the requirements, technology, and approach – and then re-launching those buys as standard competitive bids. The NLOS-C cannon, which has strong support in Congress and has made significant progress in development, will be the key sticking point. Its fate will be an important bellwether. Gates adds criticisms of both the FCS concept, and its contracting approach: “I have concluded that there are significant unanswered questions concerning the FCS vehicle design strategy. I am also concerned that, despite some adjustments, the FCS vehicles – where lower weight, higher fuel efficiency, and greater informational awareness are expected to compensate for less armor – do not adequately reflect the lessons of counterinsurgency and close quarters combat in Iraq and Afghanistan…. does not include a role for our recent $25 billion investment in the MRAP vehicles being used to good effect… (...) Significantly Shifted KC-X Aerial Tankers. Process to be restarted, with a new RFP due in summer 2009. Can the Pentagon learn from its past mistakes, face political realities, and craft a strategy that will avoid repeating its past 2 failures? Airborne Laser. The first Boeing 747 will be kept, and the program shifted to an R&D effort. The planned 2nd aircraft is canceled. GMD ballistic missile interceptors. The planned increase in Alaskan GMD missiles will not happen. Existing missiles will be kept, and R&D will continue to improve the existing handful of missiles “to defend against long-range rogue missile threats – a threat North Korea’s missile launch this past weekend reminds us is real.” DDG-1000 Zumwalt Class “destroyer”. One of 2 possibilities. Option #1 is that the entire program of 3 ships will be built at GD Bath iron Works, under a contract to be negotiated, while DDG-51 production restarts at Northrop Grumman’s Ingalls shipyard in Mississippi. Option #2 is that it is not possible to come to agreement on contracts at Bath and Ingalls, and just 1 prototype DDG-1000 destroyer will be bought. CG (X) Cruiser. Was supposed to be a DDG-1000 follow-on, then supposed to be a nuclear-powered ship under Congressional legislation. Now, “We will delay the Navy CG-X next generation cruiser program to revisit both the requirements and acquisition strategy.” LPD 11 and the Mobile Landing Platform. Think of the MLP as a ship whose back half doubles as a pier in the ocean. Flo-Flo (float-on, float off) MLP designs have also been suggested. “We will delay amphibious ship and sea-basing programs such as the 11th Landing Platform Dock (LPD) ship and the Mobile Landing Platform (MLP) SHIP to FY11 in order to assess costs and analyze the amount of these capabilities the nation needs.” Aircraft Carriers. Moves to a 5-year build cycle for CVN-21 carriers, which will drop the total fleet number to 10 after 2040. Assuming that funds are provided for all of the carriers envisioned, despite a looming shockwave of medical and social security entitlements. The schedule change would delay CVN 79, but Gates did not formally announce any delay to CVN 78 Gerald R. Ford. Army Brigade Combat Teams. The plan to grow the Army to 48 BCTs will stop at 45 – but the number of troops will not change. This will have follow-on consequences for basing and infrastructure. Gates’ Winners Military Defense Acquisition Professionals. This has been a capability weakness since the early 1990s. Existing contractors performing services in this area will be offered a chance to become full-time government employees, with the goal of converting 11,000 of them. By 2015, the plan is to grow the force by 20,000 total, beginning with conversions and 4,100 hires in FY 2010. Military Infrastructure. Child care, spousal support, lodging, and education on American military bases will see increases of $13 billion over the FY 2009 base budget. This is in addition to almost $6 billion in military infrastructure funded in the recent economic stimulus bill. Medical Care. Wounded, ill and injured, traumatic brain injury, and psychological health programs will become part of the base budget, with long term funding. Medical research will also receive a boost of $400 million. Paying for medical benefits while controlling cost growth, is an important long-term cost issue for the DoD, and a challenge for the Pentagon as a whole. F-35 Joint Strike Fighter. American orders to increase to 30 in FY 2010 ($11.2 billion), with 513 to be bought over the 5-year defense plan. Gates reiterates the goal of 2,443 total. That assumes overall costs will hold steady, something the US GAO audit office doubts. The added American buys may improve allied confidence in the program, and may add leverage for a multinational joint buy at a lower, averaged initial production price. Meanwhile, F-35A/B/C flight testing will continue until 2014. Special Forces. “To grow our special operations capabilities, we will increase personnel by more than 2,800 or five percent and will buy more special forces-optimized lift, mobility, and refueling aircraft.” Those aircraft expenditures could be substantial. Lockheed Martin’s C-130J Hercules, which the Pentagon tried to cancel several years ago over cost issues, is the likely winner – but not a certain one. Alenia’s smaller Joint Cargo Aircraft winner, the C-27J, has been discussed as a mobility and gunship aircraft. Less obviously military options like business or regional jets are also under consideration for the mobility mix. Intelligence, Surveillance and Reconnaissance (ISR). In addition to the Predator and propeller plane winners, R&D will rise for ISR enhancements, and for experimental platforms aimed at today’s problems. SecDef Gates has been focusing on this area for some time. Light ISR Propeller Planes. The unheralded stars of Task Force ODIN, with capabilities that Gates has said will be needed all over the world for the forseeable future. The King Air 350-ISR turboprops will probably be the biggest winners. Predator and Reaper UAVs, which includes the Army’s MQ-1C SkyWarrior variant. Gates intends to sustain 50 active “orbits” by FY 2011, a 62% increase in capability over the current level. THAAD (Terminal High Altitude Area Defense) missiles. Another $700 million to field THAAD and SM-3 missiles, providing late mid-course defense option against ballistic missiles and long-range air defense. Standard Missile 3. In addition to sharing additional immediate funding with THAAD, the Navy will spend $200 million to fund ballistic missile defense capabilities for 6 additional AEGIS destroyers or cruisers. The SM-3 is the corresponding missile for that role, so more BMD-capable ships offers a sustained boost to the missile’s production prospects. Helicopter Crews. Gates will add $500 million to raise the number of helicopters fielded, in light of needs in Afghanistan. “Today, the primary limitation on helicopter capacity is not airframes but shortages of maintenance crews and pilots. So our focus will be on recruiting and training more Army helicopter crews.” Littoral Combat Ships (LCS). Despite issues with the program, and concern about the ship’s combat capabilities, Gates recommends the full 3-ship buy for 2010, and reiterates the goal of eventually buying 55 of these $500 million specialty support ships. JHSV-like fast catamaran charters. Another 2 ships will be chartered from 2009-2011, until JHSV ships begin arriving. Austal was the JHSV winner, its Westpac Express is chartered for the Marines, and recently had its similar Hawaiian Superferry catamaran sidelined while Hawaii completes environmental reviews for the service. They would compete with Incat, which has had 4 of its wave-piercing catamarans chartered by various American services. Their Swift wave-piercing catamaran is currently chartered by the Navy as HSV-2. DDG-51 Destroyers. Production will restart at Northrop Grumman’s Ingalls shipyard in Mississippi, subject to a negotiated contract. Rep. Gene Taylor [D-MS, Seapower subcommittee chair] will be pleased. AEHF communications satellites. Adds satellites 5 & 6. Hackers. The Chinese will certainly keep them busy trying to secure American systems, and perhaps P2P security awareness will improve: “To improve cyberspace capabilities, we will increase the number of cyber experts this department can train from 80 students per year to 250 per year by FY11.”", 
        "intTime": 20090408, 
        "postID": 1, 
        "quote": "++http://www.defenseindustrydaily.com/Gates-Lays-Out-Key-FY-2010-Budget-Recommendations-05367/ Gates Lays Out Key FY 2010 Budget Recommendations 06-Apr-2009 23:42 EDT On April 6/09, US Secretary of Defense Robert M. Gates did something unusual: he convened a press conference to announce key budget recommendations in advance. That’s a substantial departure from normal procedure, in which the Office of the President’s submitted budget is the first official public notification of key funding... (...) Note that these are just recommendations. The Office of the President may disagree, and they must submit the budget request. Congress may also disagree, and they’re the ones who will approve and fund the final FY 2010 budget. Lobbying will now begin in earnest. Terminated or Ending VH-71 Presidential Helicopter, terminated immediately. Increment 2 helicopters will cost more than Air Force One, and “Increment One helicopters do not meet requirements and are estimated to have only a five- to 10-year useful life.” New options to be developed for a FY 2011 replacement program. F-22A Raptor, ended at 187 planes (183, plus 4 funded aircraft under FY 2009 supplemental). Production to end at the end of 2010, absent lifting of Congressional export restrictions, and corresponding orders from Australia, Japan, Israel, et. al. for a less capable export version. C-17 Globemaster III heavy-lift strategic transport, ended at 205 USAF planes. Production to end at the end of 2010, absent further foreign orders. Note that earmarked Congressional appropriations have been the C-17 program’s sole source of support for several years now – and that Congress has little confidence in the Pentagon mobility studies used to justify program termination. 2018 Bomber. In effect, terminated. “We will not pursue a development program for a follow-on Air Force bomber until we have a better understanding of the need, the requirement, and the technology.” TSAT Satellite Program. Terminated, status of unspent but allocated research funds uncertain. The TSAT-SS satellite contract had been delayed to 2010, and the US military’s planned ultra-high bandwidth laser communications backbone is still a developmental program. TSAT-SS will be replaced in the near term by 2 more AEHF satellites. Its $2+ billion companion TMOS ground control system contract is already underway, and has uses beyond TSAT; fate uncertain. Multiple Kill Vehicle (MKV) program to engage multiple enemy warheads from one defensive missile. Terminated “because of its significant technical challenges.” Air Force Combat Search and Rescue X (CSAR-X) helicopter program, terminated immediately. The program had already been stopped dead by contractor challenges, anyway, so the only thing at risk is re-bid preparation. This will be the most keenly-felt blow by the Air Force. “This program has a troubled acquisition history and raises the fundamental question of whether this important mission can only be accomplished by yet another single-service solution…. We will take a fresh look at the requirement behind this program and develop a more sustainable approach.” Future Combat Systems Ground Vehicle Program. That component makes up over half of the $162 billion meta-program. Recommends canceling that $87 billion component, re-evaluating the requirements, technology, and approach – and then re-launching those buys as standard competitive bids. The NLOS-C cannon, which has strong support in Congress and has made significant progress in development, will be the key sticking point. Its fate will be an important bellwether. Gates adds criticisms of both the FCS concept, and its contracting approach: “I have concluded that there are significant unanswered questions concerning the FCS vehicle design strategy. I am also concerned that, despite some adjustments, the FCS vehicles – where lower weight, higher fuel efficiency, and greater informational awareness are expected to compensate for less armor – do not adequately reflect the lessons of counterinsurgency and close quarters combat in Iraq and Afghanistan…. does not include a role for our recent $25 billion investment in the MRAP vehicles being used to good effect… (...) Significantly Shifted KC-X Aerial Tankers. Process to be restarted, with a new RFP due in summer 2009. Can the Pentagon learn from its past mistakes, face political realities, and craft a strategy that will avoid repeating its past 2 failures? Airborne Laser. The first Boeing 747 will be kept, and the program shifted to an R&D effort. The planned 2nd aircraft is canceled. GMD ballistic missile interceptors. The planned increase in Alaskan GMD missiles will not happen. Existing missiles will be kept, and R&D will continue to improve the existing handful of missiles “to defend against long-range rogue missile threats – a threat North Korea’s missile launch this past weekend reminds us is real.” DDG-1000 Zumwalt Class “destroyer”. One of 2 possibilities. Option #1 is that the entire program of 3 ships will be built at GD Bath iron Works, under a contract to be negotiated, while DDG-51 production restarts at Northrop Grumman’s Ingalls shipyard in Mississippi. Option #2 is that it is not possible to come to agreement on contracts at Bath and Ingalls, and just 1 prototype DDG-1000 destroyer will be bought. CG (X) Cruiser. Was supposed to be a DDG-1000 follow-on, then supposed to be a nuclear-powered ship under Congressional legislation. Now, “We will delay the Navy CG-X next generation cruiser program to revisit both the requirements and acquisition strategy.” LPD 11 and the Mobile Landing Platform. Think of the MLP as a ship whose back half doubles as a pier in the ocean. Flo-Flo (float-on, float off) MLP designs have also been suggested. “We will delay amphibious ship and sea-basing programs such as the 11th Landing Platform Dock (LPD) ship and the Mobile Landing Platform (MLP) SHIP to FY11 in order to assess costs and analyze the amount of these capabilities the nation needs.” Aircraft Carriers. Moves to a 5-year build cycle for CVN-21 carriers, which will drop the total fleet number to 10 after 2040. Assuming that funds are provided for all of the carriers envisioned, despite a looming shockwave of medical and social security entitlements. The schedule change would delay CVN 79, but Gates did not formally announce any delay to CVN 78 Gerald R. Ford. Army Brigade Combat Teams. The plan to grow the Army to 48 BCTs will stop at 45 – but the number of troops will not change. This will have follow-on consequences for basing and infrastructure. Gates’ Winners Military Defense Acquisition Professionals. This has been a capability weakness since the early 1990s. Existing contractors performing services in this area will be offered a chance to become full-time government employees, with the goal of converting 11,000 of them. By 2015, the plan is to grow the force by 20,000 total, beginning with conversions and 4,100 hires in FY 2010. Military Infrastructure. Child care, spousal support, lodging, and education on American military bases will see increases of $13 billion over the FY 2009 base budget. This is in addition to almost $6 billion in military infrastructure funded in the recent economic stimulus bill. Medical Care. Wounded, ill and injured, traumatic brain injury, and psychological health programs will become part of the base budget, with long term funding. Medical research will also receive a boost of $400 million. Paying for medical benefits while controlling cost growth, is an important long-term cost issue for the DoD, and a challenge for the Pentagon as a whole. F-35 Joint Strike Fighter. American orders to increase to 30 in FY 2010 ($11.2 billion), with 513 to be bought over the 5-year defense plan. Gates reiterates the goal of 2,443 total. That assumes overall costs will hold steady, something the US GAO audit office doubts. The added American buys may improve allied confidence in the program, and may add leverage for a multinational joint buy at a lower, averaged initial production price. Meanwhile, F-35A/B/C flight testing will continue until 2014. Special Forces. “To grow our special operations capabilities, we will increase personnel by more than 2,800 or five percent and will buy more special forces-optimized lift, mobility, and refueling aircraft.” Those aircraft expenditures could be substantial. Lockheed Martin’s C-130J Hercules, which the Pentagon tried to cancel several years ago over cost issues, is the likely winner – but not a certain one. Alenia’s smaller Joint Cargo Aircraft winner, the C-27J, has been discussed as a mobility and gunship aircraft. Less obviously military options like business or regional jets are also under consideration for the mobility mix. Intelligence, Surveillance and Reconnaissance (ISR). In addition to the Predator and propeller plane winners, R&D will rise for ISR enhancements, and for experimental platforms aimed at today’s problems. SecDef Gates has been focusing on this area for some time. Light ISR Propeller Planes. The unheralded stars of Task Force ODIN, with capabilities that Gates has said will be needed all over the world for the forseeable future. The King Air 350-ISR turboprops will probably be the biggest winners. Predator and Reaper UAVs, which includes the Army’s MQ-1C SkyWarrior variant. Gates intends to sustain 50 active “orbits” by FY 2011, a 62% increase in capability over the current level. THAAD (Terminal High Altitude Area Defense) missiles. Another $700 million to field THAAD and SM-3 missiles, providing late mid-course defense option against ballistic missiles and long-range air defense. Standard Missile 3. In addition to sharing additional immediate funding with THAAD, the Navy will spend $200 million to fund ballistic missile defense capabilities for 6 additional AEGIS destroyers or cruisers. The SM-3 is the corresponding missile for that role, so more BMD-capable ships offers a sustained boost to the missile’s production prospects. Helicopter Crews. Gates will add $500 million to raise the number of helicopters fielded, in light of needs in Afghanistan. “Today, the primary limitation on helicopter capacity is not airframes but shortages of maintenance crews and pilots. So our focus will be on recruiting and training more Army helicopter crews.” Littoral Combat Ships (LCS). Despite issues with the program, and concern about the ship’s combat capabilities, Gates recommends the full 3-ship buy for 2010, and reiterates the goal of eventually buying 55 of these $500 million specialty support ships. JHSV-like fast catamaran charters. Another 2 ships will be chartered from 2009-2011, until JHSV ships begin arriving. Austal was the JHSV winner, its Westpac Express is chartered for the Marines, and recently had its similar Hawaiian Superferry catamaran sidelined while Hawaii completes environmental reviews for the service. They would compete with Incat, which has had 4 of its wave-piercing catamarans chartered by various American services. Their Swift wave-piercing catamaran is currently chartered by the Navy as HSV-2. DDG-51 Destroyers. Production will restart at Northrop Grumman’s Ingalls shipyard in Mississippi, subject to a negotiated contract. Rep. Gene Taylor [D-MS, Seapower subcommittee chair] will be pleased. AEHF communications satellites. Adds satellites 5 & 6. Hackers. The Chinese will certainly keep them busy trying to secure American systems, and perhaps P2P security awareness will improve: “To improve cyberspace capabilities, we will increase the number of cyber experts this department can train from 80 students per year to 250 per year by FY11.”", 
        "reply": "Here's the complete list.......projects terminated, shifted and fully supported: ", 
        "threadID": "672198221_7470051022001", 
        "time": "2009-04-08 08:15:00", 
        "title": "Gates lays out FY2010 DoD budget program cuts, recommendations", 
        "userID": "Canuck_Centaur"
    }
]