[
    {
        "content": "Federal Pension Fund Switched Much Of Its $64 Billion To Stocks From Bonds Months Before Collapse... Won't Disclose Dollars Lost, But Fund Down 6.5%... OMB Has \"Serious Concerns\"... \"WASHINGTON - Just months before the start of last year's stock market collapse, the federal agency that insures the retirement funds of 44 million Americans departed from its conservative investment strategy and decided to put much of its $64 billion insurance fund into stocks. Switching from a heavy reliance on bonds, the Pension Benefit Guaranty Corporation decided to pour billions of dollars into speculative investments such as stocks in emerging foreign markets, real estate, and private equity funds. The agency refused to say how much of the new investment strategy has been implemented or how the fund has fared during the downturn. The agency would only say that its fund was down 6.5 percent - and all of its stock-related investments were down 23 percent - as of last Sept. 30, the end of its fiscal year. But that was before most of the recent stock market decline and just before the investment switch was scheduled to begin in earnest. No statistics on the fund's subsequent performance were released. Nonetheless, analysts expressed concern that large portions of the trust fund might have been lost at a time when many private pension plans are suffering major losses. The guarantee fund would be the only way to cover the plans if their companies go into bankruptcy. \"The truth is, this could be huge,\" said Zvi Bodie, a Boston University finance professor who in 2002 advised the agency to rely almost entirely on bonds. \"This has the potential to be another several hundred billion dollars. If the auto companies go under, they have huge unfunded liabilities\" in pension plans that would be passed on to the agency. In addition, Peter Orszag, head of the White House Office of Management and Budget, has \"serious concerns\" about the agency, according to an Obama administration spokesman. Last year, as director of the Congressional Budget Office, Orszag expressed alarm that the agency was \"investing a greater share of its assets in risky securities,\" which he said would make it \"more likely to experience a decline in the value of its portfolio during an economic downturn the point at which it is most likely to have to assume responsibility for a larger number of underfunded pension plans.\"\" I would love to hear from all those Right Wingers who were going along with bush on putting Social Security monies into the stock market. Damn bunch of fools!", 
        "intTime": 20090330, 
        "postID": 1, 
        "quote": "", 
        "reply": "Federal Pension Fund Switched Much Of Its $64 Billion To Stocks From Bonds Months Before Collapse... Won't Disclose Dollars Lost, But Fund Down 6.5%... OMB Has \"Serious Concerns\"... \"WASHINGTON - Just months before the start of last year's stock market collapse, the federal agency that insures the retirement funds of 44 million Americans departed from its conservative investment strategy and decided to put much of its $64 billion insurance fund into stocks. Switching from a heavy reliance on bonds, the Pension Benefit Guaranty Corporation decided to pour billions of dollars into speculative investments such as stocks in emerging foreign markets, real estate, and private equity funds. The agency refused to say how much of the new investment strategy has been implemented or how the fund has fared during the downturn. The agency would only say that its fund was down 6.5 percent - and all of its stock-related investments were down 23 percent - as of last Sept. 30, the end of its fiscal year. But that was before most of the recent stock market decline and just before the investment switch was scheduled to begin in earnest. No statistics on the fund's subsequent performance were released. Nonetheless, analysts expressed concern that large portions of the trust fund might have been lost at a time when many private pension plans are suffering major losses. The guarantee fund would be the only way to cover the plans if their companies go into bankruptcy. \"The truth is, this could be huge,\" said Zvi Bodie, a Boston University finance professor who in 2002 advised the agency to rely almost entirely on bonds. \"This has the potential to be another several hundred billion dollars. If the auto companies go under, they have huge unfunded liabilities\" in pension plans that would be passed on to the agency. In addition, Peter Orszag, head of the White House Office of Management and Budget, has \"serious concerns\" about the agency, according to an Obama administration spokesman. Last year, as director of the Congressional Budget Office, Orszag expressed alarm that the agency was \"investing a greater share of its assets in risky securities,\" which he said would make it \"more likely to experience a decline in the value of its portfolio during an economic downturn the point at which it is most likely to have to assume responsibility for a larger number of underfunded pension plans.\"\" I would love to hear from all those Right Wingers who were going along with bush on putting Social Security monies into the stock market. Damn bunch of fools!", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 17:56:00", 
        "title": "\"This could be huge\"", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Yep, once they could not ram thru the privatizatoin of Social Security, then the Derivatives died a quick death in October 2007 when they could not be sold, so this was just another GRAB.... and they won....I would love to know who shorted or longed the stocks that they bought ,,,but the SEC will NEVER INVESTIGATE....", 
        "intTime": 20090330, 
        "postID": 2, 
        "quote": "Yep, once they could not ram thru the privatizatoin of Social Security, then the Derivatives died a quick death in October 2007 when they could not be sold, so this was just another GRAB.... and they won....I would love to know who shorted or longed the stocks that they bought ,,,but the SEC will NEVER INVESTIGATE....", 
        "reply": "", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 18:04:00", 
        "title": "\"This could be huge\"", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: Federal Pension Fund Switched Much Of Its $64 Billion To Stocks From Bonds Months Before Collapse... Won't Disclose Dollars Lost, But Fund Down 6.5%... OMB Has \"Serious Concerns\"... \"WASHINGTON - Just months before the start of last year's stock market collapse, the federal agency that insures the retirement funds of 44 million Americans departed from its conservative investment strategy and decided to put much of its $64 billion insurance fund into stocks. Switching from a heavy reliance on bonds, the Pension Benefit Guaranty Corporation decided to pour billions of dollars into speculative investments such as stocks in emerging foreign markets, real estate, and private equity funds. The agency refused to say how much of the new investment strategy has been implemented or how the fund has fared during the downturn. The agency would only say that its fund was down 6.5 percent - and all of its stock-related investments were down 23 percent - as of last Sept. 30, the end of its fiscal year. But that was before most of the recent stock market decline and just before the investment switch was scheduled to begin in earnest. No statistics on the fund's subsequent performance were released. Nonetheless, analysts expressed concern that large portions of the trust fund might have been lost at a time when many private pension plans are suffering major losses. The guarantee fund would be the only way to cover the plans if their companies go into bankruptcy. \"The truth is, this could be huge,\" said Zvi Bodie, a Boston University finance professor who in 2002 advised the agency to rely almost entirely on bonds. \"This has the potential to be another several hundred billion dollars. If the auto companies go under, they have huge unfunded liabilities\" in pension plans that would be passed on to the agency. In addition, Peter Orszag, head of the White House Office of Management and Budget, has \"serious concerns\" about the agency, according to an Obama administration spokesman. Last year, as director of the Congressional Budget Office, Orszag expressed alarm that the agency was \"investing a greater share of its assets in risky securities,\" which he said would make it \"more likely to experience a decline in the value of its portfolio during an economic downturn the point at which it is most likely to have to assume responsibility for a larger number of underfunded pension plans.\"\" I would love to hear from all those Right Wingers who were going along with bush on putting Social Security monies into the stock market. Damn bunch of fools! Right Wingers didn't want Bush to put SSN into the stock market. Most WANT to invest it themselves, not rely on the government to do it. So now that you have been told the truth, time to get off the high horse. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090330, 
        "postID": 3, 
        "quote": "Originally posted by Another4Truth: Federal Pension Fund Switched Much Of Its $64 Billion To Stocks From Bonds Months Before Collapse... Won't Disclose Dollars Lost, But Fund Down 6.5%... OMB Has \"Serious Concerns\"... \"WASHINGTON - Just months before the start of last year's stock market collapse, the federal agency that insures the retirement funds of 44 million Americans departed from its conservative investment strategy and decided to put much of its $64 billion insurance fund into stocks. Switching from a heavy reliance on bonds, the Pension Benefit Guaranty Corporation decided to pour billions of dollars into speculative investments such as stocks in emerging foreign markets, real estate, and private equity funds. The agency refused to say how much of the new investment strategy has been implemented or how the fund has fared during the downturn. The agency would only say that its fund was down 6.5 percent - and all of its stock-related investments were down 23 percent - as of last Sept. 30, the end of its fiscal year. But that was before most of the recent stock market decline and just before the investment switch was scheduled to begin in earnest. No statistics on the fund's subsequent performance were released. Nonetheless, analysts expressed concern that large portions of the trust fund might have been lost at a time when many private pension plans are suffering major losses. The guarantee fund would be the only way to cover the plans if their companies go into bankruptcy. \"The truth is, this could be huge,\" said Zvi Bodie, a Boston University finance professor who in 2002 advised the agency to rely almost entirely on bonds. \"This has the potential to be another several hundred billion dollars. If the auto companies go under, they have huge unfunded liabilities\" in pension plans that would be passed on to the agency. In addition, Peter Orszag, head of the White House Office of Management and Budget, has \"serious concerns\" about the agency, according to an Obama administration spokesman. Last year, as director of the Congressional Budget Office, Orszag expressed alarm that the agency was \"investing a greater share of its assets in risky securities,\" which he said would make it \"more likely to experience a decline in the value of its portfolio during an economic downturn the point at which it is most likely to have to assume responsibility for a larger number of underfunded pension plans.\"\" I would love to hear from all those Right Wingers who were going along with bush on putting Social Security monies into the stock market. Damn bunch of fools!", 
        "reply": " Right Wingers didn't want Bush to put SSN into the stock market. Most WANT to invest it themselves, not rely on the government to do it. So now that you have been told the truth, time to get off the high horse. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 18:06:00", 
        "title": "\"This could be huge\"", 
        "userID": "L0A1"
    }, 
    {
        "content": "Well, its not my retirement that is lost....I'll bet somewhere there is someone smiling all the way to their off shore bank account with all that Federal Retirement Money....", 
        "intTime": 20090330, 
        "postID": 4, 
        "quote": "", 
        "reply": "Well, its not my retirement that is lost....I'll bet somewhere there is someone smiling all the way to their off shore bank account with all that Federal Retirement Money....", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 18:10:00", 
        "title": "\"This could be huge\"", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: Well, its not my retirement that is lost....I'll bet somewhere there is someone smiling all the way to their off shore bank account with all that Federal Retirement Money.... I can't argue with you there. You are probably right. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090330, 
        "postID": 5, 
        "quote": "Originally posted by Another4Truth: Well, its not my retirement that is lost....I'll bet somewhere there is someone smiling all the way to their off shore bank account with all that Federal Retirement Money....", 
        "reply": " I can't argue with you there. You are probably right. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 18:13:00", 
        "title": "\"This could be huge\"", 
        "userID": "L0A1"
    }, 
    {
        "content": "I get the distinked impression that the bush administration and his cronies emptied all the coffers before leaving office.", 
        "intTime": 20090330, 
        "postID": 6, 
        "quote": "", 
        "reply": "I get the distinked impression that the bush administration and his cronies emptied all the coffers before leaving office.", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 18:23:00", 
        "title": "\"This could be huge\"", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Another4Truth: Federal Pension Fund Switched Much Of Its $64 Billion To Stocks From Bonds Months Before Collapse... Won't Disclose Dollars Lost, But Fund Down 6.5%... OMB Has \"Serious Concerns\"... \"WASHINGTON - Just months before the start of last year's stock market collapse, the federal agency that insures the retirement funds of 44 million Americans departed from its conservative investment strategy and decided to put much of its $64 billion insurance fund into stocks. Switching from a heavy reliance on bonds, the Pension Benefit Guaranty Corporation decided to pour billions of dollars into speculative investments such as stocks in emerging foreign markets, real estate, and private equity funds. The agency refused to say how much of the new investment strategy has been implemented or how the fund has fared during the downturn. The agency would only say that its fund was down 6.5 percent - and all of its stock-related investments were down 23 percent - as of last Sept. 30, the end of its fiscal year. But that was before most of the recent stock market decline and just before the investment switch was scheduled to begin in earnest. No statistics on the fund's subsequent performance were released. Nonetheless, analysts expressed concern that large portions of the trust fund might have been lost at a time when many private pension plans are suffering major losses. The guarantee fund would be the only way to cover the plans if their companies go into bankruptcy. \"The truth is, this could be huge,\" said Zvi Bodie, a Boston University finance professor who in 2002 advised the agency to rely almost entirely on bonds. \"This has the potential to be another several hundred billion dollars. If the auto companies go under, they have huge unfunded liabilities\" in pension plans that would be passed on to the agency. In addition, Peter Orszag, head of the White House Office of Management and Budget, has \"serious concerns\" about the agency, according to an Obama administration spokesman. Last year, as director of the Congressional Budget Office, Orszag expressed alarm that the agency was \"investing a greater share of its assets in risky securities,\" which he said would make it \"more likely to experience a decline in the value of its portfolio during an economic downturn the point at which it is most likely to have to assume responsibility for a larger number of underfunded pension plans.\"\" I would love to hear from all those Right Wingers who were going along with bush on putting Social Security monies into the stock market. Damn bunch of fools! Right Wingers didn't want Bush to put SSN into the stock market. Most WANT to invest it themselves, not rely on the government to do it. So now that you have been told the truth, time to get off the high horse. This isn't Social Security. If you were one of those who were covered under a pension from the company you worked for, and that company went under, the PBGC took over and ensured you received a significant percentage of what you were originally entitled to. Another fact about this program: While it was originally designed for companies that failed, Over the past eight years, many corporations that simply didn't want to honor their obligation anymore were allowed to dump their pensions over to the PBGC. By doing so, there was no longer any danger to their profit margin, and the pensioners got shafted, as they lost a portion of their pensions. Now, we hear some nonsense like this. Look at this closely: \"In the early years of the George W. Bush presidency, the agency took a conservative investment approach under director Bradley N. Belt, who favored putting only between 15 and 25 percent of the fund into stocks. Belt said in an interview that he operated under \"a more prudent risk management\" style and said he \"would have maintained the investment strategy we had in place.\" Belt left in 2006 and Millard arrived in 2007. Under Millard's strategy, the pension agency was directed to invest 55 percent of its funds in stocks and real estate. That included 20 percent in US stocks, 19 percent in foreign stocks, 6 percent in what the agency's records term \"emerging market\" stocks, 5 percent in private real estate and 5 percent in private equity firms...\" Now, considering the performance of our stock market and economy, what do you think has happened to all the funds in the PBGC? And to whom did it go? Another piece of the story: \"...Currently, the agency owes more in pension obligations than it has in funds, with an $11 billion shortfall as of last Sept. 30. Moreover, the agency might soon be responsible for many more pension plans. Most of the nation's private pension plans suffered major losses in 2008 and, all together, are underfunded by as much as $500 billion, according to Bodie and other analysts. A wave of bankruptcies could mean that the agency would be left to cover more pensions than it could afford...\" That means that you, the taxpayer, will soon assume the burden of paying for these pensions. And, the hits just keep on comin'! Read the whole story here: \"http://www.boston.com/news/nation/washington/articles/2009/03/30/pension_insurer_shifted_to_stocks/?page=1\"", 
        "intTime": 20090330, 
        "postID": 7, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Another4Truth: Federal Pension Fund Switched Much Of Its $64 Billion To Stocks From Bonds Months Before Collapse... Won't Disclose Dollars Lost, But Fund Down 6.5%... OMB Has \"Serious Concerns\"... \"WASHINGTON - Just months before the start of last year's stock market collapse, the federal agency that insures the retirement funds of 44 million Americans departed from its conservative investment strategy and decided to put much of its $64 billion insurance fund into stocks. Switching from a heavy reliance on bonds, the Pension Benefit Guaranty Corporation decided to pour billions of dollars into speculative investments such as stocks in emerging foreign markets, real estate, and private equity funds. The agency refused to say how much of the new investment strategy has been implemented or how the fund has fared during the downturn. The agency would only say that its fund was down 6.5 percent - and all of its stock-related investments were down 23 percent - as of last Sept. 30, the end of its fiscal year. But that was before most of the recent stock market decline and just before the investment switch was scheduled to begin in earnest. No statistics on the fund's subsequent performance were released. Nonetheless, analysts expressed concern that large portions of the trust fund might have been lost at a time when many private pension plans are suffering major losses. The guarantee fund would be the only way to cover the plans if their companies go into bankruptcy. \"The truth is, this could be huge,\" said Zvi Bodie, a Boston University finance professor who in 2002 advised the agency to rely almost entirely on bonds. \"This has the potential to be another several hundred billion dollars. If the auto companies go under, they have huge unfunded liabilities\" in pension plans that would be passed on to the agency. In addition, Peter Orszag, head of the White House Office of Management and Budget, has \"serious concerns\" about the agency, according to an Obama administration spokesman. Last year, as director of the Congressional Budget Office, Orszag expressed alarm that the agency was \"investing a greater share of its assets in risky securities,\" which he said would make it \"more likely to experience a decline in the value of its portfolio during an economic downturn the point at which it is most likely to have to assume responsibility for a larger number of underfunded pension plans.\"\" I would love to hear from all those Right Wingers who were going along with bush on putting Social Security monies into the stock market. Damn bunch of fools! Right Wingers didn't want Bush to put SSN into the stock market. Most WANT to invest it themselves, not rely on the government to do it. So now that you have been told the truth, time to get off the high horse.", 
        "reply": " This isn't Social Security. If you were one of those who were covered under a pension from the company you worked for, and that company went under, the PBGC took over and ensured you received a significant percentage of what you were originally entitled to. Another fact about this program: While it was originally designed for companies that failed, Over the past eight years, many corporations that simply didn't want to honor their obligation anymore were allowed to dump their pensions over to the PBGC. By doing so, there was no longer any danger to their profit margin, and the pensioners got shafted, as they lost a portion of their pensions. Now, we hear some nonsense like this. Look at this closely: \"In the early years of the George W. Bush presidency, the agency took a conservative investment approach under director Bradley N. Belt, who favored putting only between 15 and 25 percent of the fund into stocks. Belt said in an interview that he operated under \"a more prudent risk management\" style and said he \"would have maintained the investment strategy we had in place.\" Belt left in 2006 and Millard arrived in 2007. Under Millard's strategy, the pension agency was directed to invest 55 percent of its funds in stocks and real estate. That included 20 percent in US stocks, 19 percent in foreign stocks, 6 percent in what the agency's records term \"emerging market\" stocks, 5 percent in private real estate and 5 percent in private equity firms...\" Now, considering the performance of our stock market and economy, what do you think has happened to all the funds in the PBGC? And to whom did it go? Another piece of the story: \"...Currently, the agency owes more in pension obligations than it has in funds, with an $11 billion shortfall as of last Sept. 30. Moreover, the agency might soon be responsible for many more pension plans. Most of the nation's private pension plans suffered major losses in 2008 and, all together, are underfunded by as much as $500 billion, according to Bodie and other analysts. A wave of bankruptcies could mean that the agency would be left to cover more pensions than it could afford...\" That means that you, the taxpayer, will soon assume the burden of paying for these pensions. And, the hits just keep on comin'! Read the whole story here: \"http://www.boston.com/news/nation/washington/articles/2009/03/30/pension_insurer_shifted_to_stocks/?page=1\"", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 18:23:00", 
        "title": "\"This could be huge\"", 
        "userID": "mcgreer"
    }, 
    {
        "content": "How do we know military retirement funds are not included? Wouldn't suprise me. They are taking everything else of mine..have been since Bush...but it's not Bush's fault it's government period and the direction this nation has turned because of government. Now you know why I do not support any of the 2 major parties...they are all the same and continue to allow government to grow and do what it wills with the money they STEAL from us in the name of the law.", 
        "intTime": 20090330, 
        "postID": 8, 
        "quote": "", 
        "reply": "How do we know military retirement funds are not included? Wouldn't suprise me. They are taking everything else of mine..have been since Bush...but it's not Bush's fault it's government period and the direction this nation has turned because of government. Now you know why I do not support any of the 2 major parties...they are all the same and continue to allow government to grow and do what it wills with the money they STEAL from us in the name of the law.", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 18:25:00", 
        "title": "\"This could be huge\"", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: How do we know military retirement funds are not included? Wouldn't suprise me. They are taking everything else of mine..have been since Bush...but it's not Bush's fault it's government period and the direction this nation has turned because of government. Now you know why I do not support any of the 2 major parties...they are all the same and continue to allow government to grow and do what it wills with the money they STEAL from us in the name of the law. The following is taken from the Fiscal Year 2005 Military Retirement Fund Audited Financial Statements: http://www.defenselink.mil/comptroller/cfs/fy2005/12_Mi...ts%20and%20Notes.pdf \"The Fund receives income from three sources: monthly normal cost payments from the Services to pay for the current year’s service cost; annual payments from Treasury to amortize the unfunded liability and pay for the increase in the normal cost attributable to Concurrent Receipt; and investment income. The Fund receives investment income from a variety of Treasury-based instruments such as bills, notes, bonds and overnight investment certificates. Treasury bills are short-term securities with maturities of less than one year issued at a discount. Treasury notes are intermediate securities with maturities of one to ten years. Treasury bonds are long-term debt instruments with maturities of greater than ten years. Overnight certificates are interest-based market securities purchased from the Treasury that mature the next business day and accrue interest based on the Federal Reserve Bank of New York survey of Reserve repurchase agreement rates. The Fund also invests in Treasury Inflation-Protected Securities (TIPS), which are indexed for inflation. TIPS are fixed-rate instruments designed to protect against inflation and the principal amount is indexed to the consumer price index (CPI) by adjusting the CPI at issuance to the current CPI; as inflation increases, so does the principal amount and the coupon. All of these instruments are debt obligations of the U.S Government and are backed by the “full faith and credit” of the government. Debt obligations of the U.S. Government have virtually no risk of nonpayment of principal and interest at the specified due date.\" Think this one might have been shifted over to stocks, as well? I certainly hope not.", 
        "intTime": 20090330, 
        "postID": 9, 
        "quote": "Originally posted by crackerjacks61: How do we know military retirement funds are not included? Wouldn't suprise me. They are taking everything else of mine..have been since Bush...but it's not Bush's fault it's government period and the direction this nation has turned because of government. Now you know why I do not support any of the 2 major parties...they are all the same and continue to allow government to grow and do what it wills with the money they STEAL from us in the name of the law.", 
        "reply": " The following is taken from the Fiscal Year 2005 Military Retirement Fund Audited Financial Statements: http://www.defenselink.mil/comptroller/cfs/fy2005/12_Mi...ts%20and%20Notes.pdf \"The Fund receives income from three sources: monthly normal cost payments from the Services to pay for the current year’s service cost; annual payments from Treasury to amortize the unfunded liability and pay for the increase in the normal cost attributable to Concurrent Receipt; and investment income. The Fund receives investment income from a variety of Treasury-based instruments such as bills, notes, bonds and overnight investment certificates. Treasury bills are short-term securities with maturities of less than one year issued at a discount. Treasury notes are intermediate securities with maturities of one to ten years. Treasury bonds are long-term debt instruments with maturities of greater than ten years. Overnight certificates are interest-based market securities purchased from the Treasury that mature the next business day and accrue interest based on the Federal Reserve Bank of New York survey of Reserve repurchase agreement rates. The Fund also invests in Treasury Inflation-Protected Securities (TIPS), which are indexed for inflation. TIPS are fixed-rate instruments designed to protect against inflation and the principal amount is indexed to the consumer price index (CPI) by adjusting the CPI at issuance to the current CPI; as inflation increases, so does the principal amount and the coupon. All of these instruments are debt obligations of the U.S Government and are backed by the “full faith and credit” of the government. Debt obligations of the U.S. Government have virtually no risk of nonpayment of principal and interest at the specified due date.\" Think this one might have been shifted over to stocks, as well? I certainly hope not.", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 18:34:00", 
        "title": "\"This could be huge\"", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: I get the distinked impression that the bush administration and his cronies emptied all the coffers before leaving office. Funny, I get the Distinct impression your talking out your fourth point of contact.", 
        "intTime": 20090330, 
        "postID": 10, 
        "quote": "Originally posted by Another4Truth: I get the distinked impression that the bush administration and his cronies emptied all the coffers before leaving office.", 
        "reply": " Funny, I get the Distinct impression your talking out your fourth point of contact.", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 19:07:00", 
        "title": "\"This could be huge\"", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: Well, its not my retirement that is lost....I'll bet somewhere there is someone smiling all the way to their off shore bank account with all that Federal Retirement Money.... Yeah and some others are claiming that Obama has emptied the federal gold depository... The George Noory crowd has been smoking crack and posting... Respectfully, SUNLINER81", 
        "intTime": 20090330, 
        "postID": 11, 
        "quote": "Originally posted by Another4Truth: Well, its not my retirement that is lost....I'll bet somewhere there is someone smiling all the way to their off shore bank account with all that Federal Retirement Money....", 
        "reply": " Yeah and some others are claiming that Obama has emptied the federal gold depository... The George Noory crowd has been smoking crack and posting... Respectfully, SUNLINER81", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 19:31:00", 
        "title": "\"This could be huge\"", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by Another4Truth: I get the distinked impression that the bush administration and his cronies emptied all the coffers before leaving office. Funny, I get the Distinct impression your talking out your fourth point of contact. I wrote exactly like I meant it. It smells.", 
        "intTime": 20090330, 
        "postID": 12, 
        "quote": "Originally posted by LineDoggie: quote: Originally posted by Another4Truth: I get the distinked impression that the bush administration and his cronies emptied all the coffers before leaving office. Funny, I get the Distinct impression your talking out your fourth point of contact.", 
        "reply": " I wrote exactly like I meant it. It smells.", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 19:36:00", 
        "title": "\"This could be huge\"", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "How long will it take for all the right wingers to figure out that they have been 'had' and that they are not 'conservatives' but just pinheads that have been led by the nose to support an administration that raped the whole country.", 
        "intTime": 20090330, 
        "postID": 13, 
        "quote": "", 
        "reply": "How long will it take for all the right wingers to figure out that they have been 'had' and that they are not 'conservatives' but just pinheads that have been led by the nose to support an administration that raped the whole country.", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 19:43:00", 
        "title": "\"This could be huge\"", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: How long will it take for all the right wingers to figure out that they have been 'had' and that they are not 'conservatives' but just pinheads that have been led by the nose to support an administration that raped the whole country. Bout the same time you finally figure out that there is no \"little gray space aliens\", Easter Bunny, Loch Ness monster, Wolfman, Santa Claus and Tooth Fairy... LOL Respectfully, SUNLINER81", 
        "intTime": 20090330, 
        "postID": 14, 
        "quote": "Originally posted by Another4Truth: How long will it take for all the right wingers to figure out that they have been 'had' and that they are not 'conservatives' but just pinheads that have been led by the nose to support an administration that raped the whole country.", 
        "reply": " Bout the same time you finally figure out that there is no \"little gray space aliens\", Easter Bunny, Loch Ness monster, Wolfman, Santa Claus and Tooth Fairy... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 19:48:00", 
        "title": "\"This could be huge\"", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by Another4Truth: How long will it take for all the right wingers to figure out that they have been 'had' and that they are not 'conservatives' but just pinheads that have been led by the nose to support an administration that raped the whole country. Bout the same time you finally figure out that there is no \"little gray space aliens\", Easter Bunny, Loch Ness monster, Wolfman, Santa Claus and Tooth Fairy... LOL Respectfully, SUNLINER81 You forgot 'GOD' the oldest space alien ever.", 
        "intTime": 20090330, 
        "postID": 15, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by Another4Truth: How long will it take for all the right wingers to figure out that they have been 'had' and that they are not 'conservatives' but just pinheads that have been led by the nose to support an administration that raped the whole country. Bout the same time you finally figure out that there is no \"little gray space aliens\", Easter Bunny, Loch Ness monster, Wolfman, Santa Claus and Tooth Fairy... LOL Respectfully, SUNLINER81", 
        "reply": " You forgot 'GOD' the oldest space alien ever.", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 19:54:00", 
        "title": "\"This could be huge\"", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: quote: Originally posted by SUNLINER81: quote: Originally posted by Another4Truth: How long will it take for all the right wingers to figure out that they have been 'had' and that they are not 'conservatives' but just pinheads that have been led by the nose to support an administration that raped the whole country. Bout the same time you finally figure out that there is no \"little gray space aliens\", Easter Bunny, Loch Ness monster, Wolfman, Santa Claus and Tooth Fairy... LOL Respectfully, SUNLINER81 You forgot 'GOD' Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81", 
        "intTime": 20090330, 
        "postID": 16, 
        "quote": "Originally posted by Another4Truth: quote: Originally posted by SUNLINER81: quote: Originally posted by Another4Truth: How long will it take for all the right wingers to figure out that they have been 'had' and that they are not 'conservatives' but just pinheads that have been led by the nose to support an administration that raped the whole country. Bout the same time you finally figure out that there is no \"little gray space aliens\", Easter Bunny, Loch Ness monster, Wolfman, Santa Claus and Tooth Fairy... LOL Respectfully, SUNLINER81 You forgot 'GOD'", 
        "reply": " Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 19:57:00", 
        "title": "\"This could be huge\"", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81 Nice try at changing the subject but it still looks like bush and his cronies did a real job on America. Every day we find out something new that they (the bush administration) did. I wonder what we haven't found out yet??? Doesn't it make you wonder just when and how soon it will affect you yourself personally...", 
        "intTime": 20090330, 
        "postID": 17, 
        "quote": "Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81", 
        "reply": " Nice try at changing the subject but it still looks like bush and his cronies did a real job on America. Every day we find out something new that they (the bush administration) did. I wonder what we haven't found out yet??? Doesn't it make you wonder just when and how soon it will affect you yourself personally...", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 20:06:00", 
        "title": "\"This could be huge\"", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: quote: Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81 Nice try at changing the subject but it still looks like bush and his cronies did a real job on America. Every day we find out something new that they (the bush administration) did. I wonder what we haven't found out yet??? Doesn't it make you wonder just when and how soon it will affect you yourself personally... Wasn't trying to change the subject but, you are still \"baiting\" and that is illegal on this site... Respectfully, SUNLINER81", 
        "intTime": 20090330, 
        "postID": 18, 
        "quote": "Originally posted by Another4Truth: quote: Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81 Nice try at changing the subject but it still looks like bush and his cronies did a real job on America. Every day we find out something new that they (the bush administration) did. I wonder what we haven't found out yet??? Doesn't it make you wonder just when and how soon it will affect you yourself personally...", 
        "reply": " Wasn't trying to change the subject but, you are still \"baiting\" and that is illegal on this site... Respectfully, SUNLINER81", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 20:26:00", 
        "title": "\"This could be huge\"", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by Another4Truth: quote: Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81 Nice try at changing the subject but it still looks like bush and his cronies did a real job on America. Every day we find out something new that they (the bush administration) did. I wonder what we haven't found out yet??? Doesn't it make you wonder just when and how soon it will affect you yourself personally... Wasn't trying to change the subject but, you are still \"baiting\" and that is illegal on this site... Respectfully, SUNLINER81 OK, here is a little something to think about tonight! Sweet Dreams... quote: FOLLOWING MONEY TO TAX HAVENS And guess who's turned up in a new government report about tax havens? Eleven giant recipients of your bailout tax dollars - American Express, AIG, Bank of America, Citigroup, General Motors, GMAC, Goldman Sachs, JP Morgan Chase, Merrill Lynch, Morgan Stanley, and Wells Fargo. Together they've collected more than $227 billion. One favorite among the bailout companies is the Cayman Islands. There's no income tax, no corporate tax and no capital gains tax. Goldman Sachs has 15 subsidiaries there. Bank of America: 59. Citigroup: 90. But MORGAN STANLEY BEATS THEM ALL with at least 158 subsidiaries in the Cayman Islands - seven times the number of hotels. *http://www.cbsnews.com/stories/2009/02/23/eveningnews/main4822689.shtml*", 
        "intTime": 20090330, 
        "postID": 19, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by Another4Truth: quote: Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81 Nice try at changing the subject but it still looks like bush and his cronies did a real job on America. Every day we find out something new that they (the bush administration) did. I wonder what we haven't found out yet??? Doesn't it make you wonder just when and how soon it will affect you yourself personally... Wasn't trying to change the subject but, you are still \"baiting\" and that is illegal on this site... Respectfully, SUNLINER81", 
        "reply": " OK, here is a little something to think about tonight! Sweet Dreams... quote: FOLLOWING MONEY TO TAX HAVENS And guess who's turned up in a new government report about tax havens? Eleven giant recipients of your bailout tax dollars - American Express, AIG, Bank of America, Citigroup, General Motors, GMAC, Goldman Sachs, JP Morgan Chase, Merrill Lynch, Morgan Stanley, and Wells Fargo. Together they've collected more than $227 billion. One favorite among the bailout companies is the Cayman Islands. There's no income tax, no corporate tax and no capital gains tax. Goldman Sachs has 15 subsidiaries there. Bank of America: 59. Citigroup: 90. But MORGAN STANLEY BEATS THEM ALL with at least 158 subsidiaries in the Cayman Islands - seven times the number of hotels. *http://www.cbsnews.com/stories/2009/02/23/eveningnews/main4822689.shtml*", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 20:32:00", 
        "title": "\"This could be huge\"", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: quote: Originally posted by SUNLINER81: quote: Originally posted by Another4Truth: quote: Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81 Nice try at changing the subject but it still looks like bush and his cronies did a real job on America. Every day we find out something new that they (the bush administration) did. I wonder what we haven't found out yet??? Doesn't it make you wonder just when and how soon it will affect you yourself personally... Wasn't trying to change the subject but, you are still \"baiting\" and that is illegal on this site... Respectfully, SUNLINER81 OK, here is a little something to think about tonight! Sweet Dreams... quote: FOLLOWING MONEY TO TAX HAVENS And guess who's turned up in a new government report about tax havens? Eleven giant recipients of your bailout tax dollars - American Express, AIG, Bank of America, Citigroup, General Motors, GMAC, Goldman Sachs, JP Morgan Chase, Merrill Lynch, Morgan Stanley, and Wells Fargo. Together they've collected more than $227 billion. One favorite among the bailout companies is the Cayman Islands. There's no income tax, no corporate tax and no capital gains tax. Goldman Sachs has 15 subsidiaries there. Bank of America: 59. Citigroup: 90. But MORGAN STANLEY BEATS THEM ALL with at least 158 subsidiaries in the Cayman Islands - seven times the number of hotels. *http://www.cbsnews.com/stories/2009/02/23/eveningnews/main4822689.shtml* Look, you have some sort of idea that I support the bailout, I DON'T... So, don't waste your time, go talk to someone you can \"convert\"... Respectfully, SUNLINER81", 
        "intTime": 20090330, 
        "postID": 20, 
        "quote": "Originally posted by Another4Truth: quote: Originally posted by SUNLINER81: quote: Originally posted by Another4Truth: quote: Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81 Nice try at changing the subject but it still looks like bush and his cronies did a real job on America. Every day we find out something new that they (the bush administration) did. I wonder what we haven't found out yet??? Doesn't it make you wonder just when and how soon it will affect you yourself personally... Wasn't trying to change the subject but, you are still \"baiting\" and that is illegal on this site... Respectfully, SUNLINER81 OK, here is a little something to think about tonight! Sweet Dreams... quote: FOLLOWING MONEY TO TAX HAVENS And guess who's turned up in a new government report about tax havens? Eleven giant recipients of your bailout tax dollars - American Express, AIG, Bank of America, Citigroup, General Motors, GMAC, Goldman Sachs, JP Morgan Chase, Merrill Lynch, Morgan Stanley, and Wells Fargo. Together they've collected more than $227 billion. One favorite among the bailout companies is the Cayman Islands. There's no income tax, no corporate tax and no capital gains tax. Goldman Sachs has 15 subsidiaries there. Bank of America: 59. Citigroup: 90. But MORGAN STANLEY BEATS THEM ALL with at least 158 subsidiaries in the Cayman Islands - seven times the number of hotels. *http://www.cbsnews.com/stories/2009/02/23/eveningnews/main4822689.shtml*", 
        "reply": " Look, you have some sort of idea that I support the bailout, I DON'T... So, don't waste your time, go talk to someone you can \"convert\"... Respectfully, SUNLINER81", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 20:46:00", 
        "title": "\"This could be huge\"", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "Federal Pension Fund Switched Much Of Its $64 Billion To Stocks From Bonds Months Before Collapse... Won't Disclose Dollars Lost, But Fund Down 6.5%... OMB Has \"Serious Concerns\"... \"WASHINGTON - Just months before the start of last year's stock market collapse, the federal agency that insures the retirement funds of 44 million Americans departed from its conservative investment strategy and decided to put much of its $64 billion insurance fund into stocks. Switching from a heavy reliance on bonds, the Pension Benefit Guaranty Corporation decided to pour billions of dollars into speculative investments such as stocks in emerging foreign markets, real estate, and private equity funds. The agency refused to say how much of the new investment strategy has been implemented or how the fund has fared during the downturn. The agency would only say that its fund was down 6.5 percent - and all of its stock-related investments were down 23 percent - as of last Sept. 30, the end of its fiscal year. But that was before most of the recent stock market decline and just before the investment switch was scheduled to begin in earnest. No statistics on the fund's subsequent performance were released. Nonetheless, analysts expressed concern that large portions of the trust fund might have been lost at a time when many private pension plans are suffering major losses. The guarantee fund would be the only way to cover the plans if their companies go into bankruptcy. \"The truth is, this could be huge,\" said Zvi Bodie, a Boston University finance professor who in 2002 advised the agency to rely almost entirely on bonds. \"This has the potential to be another several hundred billion dollars. If the auto companies go under, they have huge unfunded liabilities\" in pension plans that would be passed on to the agency. In addition, Peter Orszag, head of the White House Office of Management and Budget, has \"serious concerns\" about the agency, according to an Obama administration spokesman. Last year, as director of the Congressional Budget Office, Orszag expressed alarm that the agency was \"investing a greater share of its assets in risky securities,\" which he said would make it \"more likely to experience a decline in the value of its portfolio during an economic downturn the point at which it is most likely to have to assume responsibility for a larger number of underfunded pension plans.\"\" I would love to hear from all those Right Wingers who were going along with bush on putting Social Security monies into the stock market. Damn bunch of fools!", 
        "intTime": 20090330, 
        "postID": 21, 
        "quote": "", 
        "reply": "Federal Pension Fund Switched Much Of Its $64 Billion To Stocks From Bonds Months Before Collapse... Won't Disclose Dollars Lost, But Fund Down 6.5%... OMB Has \"Serious Concerns\"... \"WASHINGTON - Just months before the start of last year's stock market collapse, the federal agency that insures the retirement funds of 44 million Americans departed from its conservative investment strategy and decided to put much of its $64 billion insurance fund into stocks. Switching from a heavy reliance on bonds, the Pension Benefit Guaranty Corporation decided to pour billions of dollars into speculative investments such as stocks in emerging foreign markets, real estate, and private equity funds. The agency refused to say how much of the new investment strategy has been implemented or how the fund has fared during the downturn. The agency would only say that its fund was down 6.5 percent - and all of its stock-related investments were down 23 percent - as of last Sept. 30, the end of its fiscal year. But that was before most of the recent stock market decline and just before the investment switch was scheduled to begin in earnest. No statistics on the fund's subsequent performance were released. Nonetheless, analysts expressed concern that large portions of the trust fund might have been lost at a time when many private pension plans are suffering major losses. The guarantee fund would be the only way to cover the plans if their companies go into bankruptcy. \"The truth is, this could be huge,\" said Zvi Bodie, a Boston University finance professor who in 2002 advised the agency to rely almost entirely on bonds. \"This has the potential to be another several hundred billion dollars. If the auto companies go under, they have huge unfunded liabilities\" in pension plans that would be passed on to the agency. In addition, Peter Orszag, head of the White House Office of Management and Budget, has \"serious concerns\" about the agency, according to an Obama administration spokesman. Last year, as director of the Congressional Budget Office, Orszag expressed alarm that the agency was \"investing a greater share of its assets in risky securities,\" which he said would make it \"more likely to experience a decline in the value of its portfolio during an economic downturn the point at which it is most likely to have to assume responsibility for a larger number of underfunded pension plans.\"\" I would love to hear from all those Right Wingers who were going along with bush on putting Social Security monies into the stock market. Damn bunch of fools!", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 17:56:00", 
        "title": "\"This could be huge\"", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Yep, once they could not ram thru the privatizatoin of Social Security, then the Derivatives died a quick death in October 2007 when they could not be sold, so this was just another GRAB.... and they won....I would love to know who shorted or longed the stocks that they bought ,,,but the SEC will NEVER INVESTIGATE....", 
        "intTime": 20090330, 
        "postID": 22, 
        "quote": "Yep, once they could not ram thru the privatizatoin of Social Security, then the Derivatives died a quick death in October 2007 when they could not be sold, so this was just another GRAB.... and they won....I would love to know who shorted or longed the stocks that they bought ,,,but the SEC will NEVER INVESTIGATE....", 
        "reply": "", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 18:04:00", 
        "title": "\"This could be huge\"", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: Federal Pension Fund Switched Much Of Its $64 Billion To Stocks From Bonds Months Before Collapse... Won't Disclose Dollars Lost, But Fund Down 6.5%... OMB Has \"Serious Concerns\"... \"WASHINGTON - Just months before the start of last year's stock market collapse, the federal agency that insures the retirement funds of 44 million Americans departed from its conservative investment strategy and decided to put much of its $64 billion insurance fund into stocks. Switching from a heavy reliance on bonds, the Pension Benefit Guaranty Corporation decided to pour billions of dollars into speculative investments such as stocks in emerging foreign markets, real estate, and private equity funds. The agency refused to say how much of the new investment strategy has been implemented or how the fund has fared during the downturn. The agency would only say that its fund was down 6.5 percent - and all of its stock-related investments were down 23 percent - as of last Sept. 30, the end of its fiscal year. But that was before most of the recent stock market decline and just before the investment switch was scheduled to begin in earnest. No statistics on the fund's subsequent performance were released. Nonetheless, analysts expressed concern that large portions of the trust fund might have been lost at a time when many private pension plans are suffering major losses. The guarantee fund would be the only way to cover the plans if their companies go into bankruptcy. \"The truth is, this could be huge,\" said Zvi Bodie, a Boston University finance professor who in 2002 advised the agency to rely almost entirely on bonds. \"This has the potential to be another several hundred billion dollars. If the auto companies go under, they have huge unfunded liabilities\" in pension plans that would be passed on to the agency. In addition, Peter Orszag, head of the White House Office of Management and Budget, has \"serious concerns\" about the agency, according to an Obama administration spokesman. Last year, as director of the Congressional Budget Office, Orszag expressed alarm that the agency was \"investing a greater share of its assets in risky securities,\" which he said would make it \"more likely to experience a decline in the value of its portfolio during an economic downturn the point at which it is most likely to have to assume responsibility for a larger number of underfunded pension plans.\"\" I would love to hear from all those Right Wingers who were going along with bush on putting Social Security monies into the stock market. Damn bunch of fools! Right Wingers didn't want Bush to put SSN into the stock market. Most WANT to invest it themselves, not rely on the government to do it. So now that you have been told the truth, time to get off the high horse. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090330, 
        "postID": 23, 
        "quote": "Originally posted by Another4Truth: Federal Pension Fund Switched Much Of Its $64 Billion To Stocks From Bonds Months Before Collapse... Won't Disclose Dollars Lost, But Fund Down 6.5%... OMB Has \"Serious Concerns\"... \"WASHINGTON - Just months before the start of last year's stock market collapse, the federal agency that insures the retirement funds of 44 million Americans departed from its conservative investment strategy and decided to put much of its $64 billion insurance fund into stocks. Switching from a heavy reliance on bonds, the Pension Benefit Guaranty Corporation decided to pour billions of dollars into speculative investments such as stocks in emerging foreign markets, real estate, and private equity funds. The agency refused to say how much of the new investment strategy has been implemented or how the fund has fared during the downturn. The agency would only say that its fund was down 6.5 percent - and all of its stock-related investments were down 23 percent - as of last Sept. 30, the end of its fiscal year. But that was before most of the recent stock market decline and just before the investment switch was scheduled to begin in earnest. No statistics on the fund's subsequent performance were released. Nonetheless, analysts expressed concern that large portions of the trust fund might have been lost at a time when many private pension plans are suffering major losses. The guarantee fund would be the only way to cover the plans if their companies go into bankruptcy. \"The truth is, this could be huge,\" said Zvi Bodie, a Boston University finance professor who in 2002 advised the agency to rely almost entirely on bonds. \"This has the potential to be another several hundred billion dollars. If the auto companies go under, they have huge unfunded liabilities\" in pension plans that would be passed on to the agency. In addition, Peter Orszag, head of the White House Office of Management and Budget, has \"serious concerns\" about the agency, according to an Obama administration spokesman. Last year, as director of the Congressional Budget Office, Orszag expressed alarm that the agency was \"investing a greater share of its assets in risky securities,\" which he said would make it \"more likely to experience a decline in the value of its portfolio during an economic downturn the point at which it is most likely to have to assume responsibility for a larger number of underfunded pension plans.\"\" I would love to hear from all those Right Wingers who were going along with bush on putting Social Security monies into the stock market. Damn bunch of fools!", 
        "reply": " Right Wingers didn't want Bush to put SSN into the stock market. Most WANT to invest it themselves, not rely on the government to do it. So now that you have been told the truth, time to get off the high horse. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 18:06:00", 
        "title": "\"This could be huge\"", 
        "userID": "L0A1"
    }, 
    {
        "content": "Well, its not my retirement that is lost....I'll bet somewhere there is someone smiling all the way to their off shore bank account with all that Federal Retirement Money....", 
        "intTime": 20090330, 
        "postID": 24, 
        "quote": "", 
        "reply": "Well, its not my retirement that is lost....I'll bet somewhere there is someone smiling all the way to their off shore bank account with all that Federal Retirement Money....", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 18:10:00", 
        "title": "\"This could be huge\"", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: Well, its not my retirement that is lost....I'll bet somewhere there is someone smiling all the way to their off shore bank account with all that Federal Retirement Money.... I can't argue with you there. You are probably right. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090330, 
        "postID": 25, 
        "quote": "Originally posted by Another4Truth: Well, its not my retirement that is lost....I'll bet somewhere there is someone smiling all the way to their off shore bank account with all that Federal Retirement Money....", 
        "reply": " I can't argue with you there. You are probably right. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 18:13:00", 
        "title": "\"This could be huge\"", 
        "userID": "L0A1"
    }, 
    {
        "content": "I get the distinked impression that the bush administration and his cronies emptied all the coffers before leaving office.", 
        "intTime": 20090330, 
        "postID": 26, 
        "quote": "", 
        "reply": "I get the distinked impression that the bush administration and his cronies emptied all the coffers before leaving office.", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 18:23:00", 
        "title": "\"This could be huge\"", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Another4Truth: Federal Pension Fund Switched Much Of Its $64 Billion To Stocks From Bonds Months Before Collapse... Won't Disclose Dollars Lost, But Fund Down 6.5%... OMB Has \"Serious Concerns\"... \"WASHINGTON - Just months before the start of last year's stock market collapse, the federal agency that insures the retirement funds of 44 million Americans departed from its conservative investment strategy and decided to put much of its $64 billion insurance fund into stocks. Switching from a heavy reliance on bonds, the Pension Benefit Guaranty Corporation decided to pour billions of dollars into speculative investments such as stocks in emerging foreign markets, real estate, and private equity funds. The agency refused to say how much of the new investment strategy has been implemented or how the fund has fared during the downturn. The agency would only say that its fund was down 6.5 percent - and all of its stock-related investments were down 23 percent - as of last Sept. 30, the end of its fiscal year. But that was before most of the recent stock market decline and just before the investment switch was scheduled to begin in earnest. No statistics on the fund's subsequent performance were released. Nonetheless, analysts expressed concern that large portions of the trust fund might have been lost at a time when many private pension plans are suffering major losses. The guarantee fund would be the only way to cover the plans if their companies go into bankruptcy. \"The truth is, this could be huge,\" said Zvi Bodie, a Boston University finance professor who in 2002 advised the agency to rely almost entirely on bonds. \"This has the potential to be another several hundred billion dollars. If the auto companies go under, they have huge unfunded liabilities\" in pension plans that would be passed on to the agency. In addition, Peter Orszag, head of the White House Office of Management and Budget, has \"serious concerns\" about the agency, according to an Obama administration spokesman. Last year, as director of the Congressional Budget Office, Orszag expressed alarm that the agency was \"investing a greater share of its assets in risky securities,\" which he said would make it \"more likely to experience a decline in the value of its portfolio during an economic downturn the point at which it is most likely to have to assume responsibility for a larger number of underfunded pension plans.\"\" I would love to hear from all those Right Wingers who were going along with bush on putting Social Security monies into the stock market. Damn bunch of fools! Right Wingers didn't want Bush to put SSN into the stock market. Most WANT to invest it themselves, not rely on the government to do it. So now that you have been told the truth, time to get off the high horse. This isn't Social Security. If you were one of those who were covered under a pension from the company you worked for, and that company went under, the PBGC took over and ensured you received a significant percentage of what you were originally entitled to. Another fact about this program: While it was originally designed for companies that failed, Over the past eight years, many corporations that simply didn't want to honor their obligation anymore were allowed to dump their pensions over to the PBGC. By doing so, there was no longer any danger to their profit margin, and the pensioners got shafted, as they lost a portion of their pensions. Now, we hear some nonsense like this. Look at this closely: \"In the early years of the George W. Bush presidency, the agency took a conservative investment approach under director Bradley N. Belt, who favored putting only between 15 and 25 percent of the fund into stocks. Belt said in an interview that he operated under \"a more prudent risk management\" style and said he \"would have maintained the investment strategy we had in place.\" Belt left in 2006 and Millard arrived in 2007. Under Millard's strategy, the pension agency was directed to invest 55 percent of its funds in stocks and real estate. That included 20 percent in US stocks, 19 percent in foreign stocks, 6 percent in what the agency's records term \"emerging market\" stocks, 5 percent in private real estate and 5 percent in private equity firms...\" Now, considering the performance of our stock market and economy, what do you think has happened to all the funds in the PBGC? And to whom did it go? Another piece of the story: \"...Currently, the agency owes more in pension obligations than it has in funds, with an $11 billion shortfall as of last Sept. 30. Moreover, the agency might soon be responsible for many more pension plans. Most of the nation's private pension plans suffered major losses in 2008 and, all together, are underfunded by as much as $500 billion, according to Bodie and other analysts. A wave of bankruptcies could mean that the agency would be left to cover more pensions than it could afford...\" That means that you, the taxpayer, will soon assume the burden of paying for these pensions. And, the hits just keep on comin'! Read the whole story here: \"http://www.boston.com/news/nation/washington/articles/2009/03/30/pension_insurer_shifted_to_stocks/?page=1\"", 
        "intTime": 20090330, 
        "postID": 27, 
        "quote": "Originally posted by L0A1: quote: Originally posted by Another4Truth: Federal Pension Fund Switched Much Of Its $64 Billion To Stocks From Bonds Months Before Collapse... Won't Disclose Dollars Lost, But Fund Down 6.5%... OMB Has \"Serious Concerns\"... \"WASHINGTON - Just months before the start of last year's stock market collapse, the federal agency that insures the retirement funds of 44 million Americans departed from its conservative investment strategy and decided to put much of its $64 billion insurance fund into stocks. Switching from a heavy reliance on bonds, the Pension Benefit Guaranty Corporation decided to pour billions of dollars into speculative investments such as stocks in emerging foreign markets, real estate, and private equity funds. The agency refused to say how much of the new investment strategy has been implemented or how the fund has fared during the downturn. The agency would only say that its fund was down 6.5 percent - and all of its stock-related investments were down 23 percent - as of last Sept. 30, the end of its fiscal year. But that was before most of the recent stock market decline and just before the investment switch was scheduled to begin in earnest. No statistics on the fund's subsequent performance were released. Nonetheless, analysts expressed concern that large portions of the trust fund might have been lost at a time when many private pension plans are suffering major losses. The guarantee fund would be the only way to cover the plans if their companies go into bankruptcy. \"The truth is, this could be huge,\" said Zvi Bodie, a Boston University finance professor who in 2002 advised the agency to rely almost entirely on bonds. \"This has the potential to be another several hundred billion dollars. If the auto companies go under, they have huge unfunded liabilities\" in pension plans that would be passed on to the agency. In addition, Peter Orszag, head of the White House Office of Management and Budget, has \"serious concerns\" about the agency, according to an Obama administration spokesman. Last year, as director of the Congressional Budget Office, Orszag expressed alarm that the agency was \"investing a greater share of its assets in risky securities,\" which he said would make it \"more likely to experience a decline in the value of its portfolio during an economic downturn the point at which it is most likely to have to assume responsibility for a larger number of underfunded pension plans.\"\" I would love to hear from all those Right Wingers who were going along with bush on putting Social Security monies into the stock market. Damn bunch of fools! Right Wingers didn't want Bush to put SSN into the stock market. Most WANT to invest it themselves, not rely on the government to do it. So now that you have been told the truth, time to get off the high horse.", 
        "reply": " This isn't Social Security. If you were one of those who were covered under a pension from the company you worked for, and that company went under, the PBGC took over and ensured you received a significant percentage of what you were originally entitled to. Another fact about this program: While it was originally designed for companies that failed, Over the past eight years, many corporations that simply didn't want to honor their obligation anymore were allowed to dump their pensions over to the PBGC. By doing so, there was no longer any danger to their profit margin, and the pensioners got shafted, as they lost a portion of their pensions. Now, we hear some nonsense like this. Look at this closely: \"In the early years of the George W. Bush presidency, the agency took a conservative investment approach under director Bradley N. Belt, who favored putting only between 15 and 25 percent of the fund into stocks. Belt said in an interview that he operated under \"a more prudent risk management\" style and said he \"would have maintained the investment strategy we had in place.\" Belt left in 2006 and Millard arrived in 2007. Under Millard's strategy, the pension agency was directed to invest 55 percent of its funds in stocks and real estate. That included 20 percent in US stocks, 19 percent in foreign stocks, 6 percent in what the agency's records term \"emerging market\" stocks, 5 percent in private real estate and 5 percent in private equity firms...\" Now, considering the performance of our stock market and economy, what do you think has happened to all the funds in the PBGC? And to whom did it go? Another piece of the story: \"...Currently, the agency owes more in pension obligations than it has in funds, with an $11 billion shortfall as of last Sept. 30. Moreover, the agency might soon be responsible for many more pension plans. Most of the nation's private pension plans suffered major losses in 2008 and, all together, are underfunded by as much as $500 billion, according to Bodie and other analysts. A wave of bankruptcies could mean that the agency would be left to cover more pensions than it could afford...\" That means that you, the taxpayer, will soon assume the burden of paying for these pensions. And, the hits just keep on comin'! Read the whole story here: \"http://www.boston.com/news/nation/washington/articles/2009/03/30/pension_insurer_shifted_to_stocks/?page=1\"", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 18:23:00", 
        "title": "\"This could be huge\"", 
        "userID": "mcgreer"
    }, 
    {
        "content": "How do we know military retirement funds are not included? Wouldn't suprise me. They are taking everything else of mine..have been since Bush...but it's not Bush's fault it's government period and the direction this nation has turned because of government. Now you know why I do not support any of the 2 major parties...they are all the same and continue to allow government to grow and do what it wills with the money they STEAL from us in the name of the law.", 
        "intTime": 20090330, 
        "postID": 28, 
        "quote": "", 
        "reply": "How do we know military retirement funds are not included? Wouldn't suprise me. They are taking everything else of mine..have been since Bush...but it's not Bush's fault it's government period and the direction this nation has turned because of government. Now you know why I do not support any of the 2 major parties...they are all the same and continue to allow government to grow and do what it wills with the money they STEAL from us in the name of the law.", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 18:25:00", 
        "title": "\"This could be huge\"", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: How do we know military retirement funds are not included? Wouldn't suprise me. They are taking everything else of mine..have been since Bush...but it's not Bush's fault it's government period and the direction this nation has turned because of government. Now you know why I do not support any of the 2 major parties...they are all the same and continue to allow government to grow and do what it wills with the money they STEAL from us in the name of the law. The following is taken from the Fiscal Year 2005 Military Retirement Fund Audited Financial Statements: http://www.defenselink.mil/comptroller/cfs/fy2005/12_Mi...ts%20and%20Notes.pdf \"The Fund receives income from three sources: monthly normal cost payments from the Services to pay for the current year’s service cost; annual payments from Treasury to amortize the unfunded liability and pay for the increase in the normal cost attributable to Concurrent Receipt; and investment income. The Fund receives investment income from a variety of Treasury-based instruments such as bills, notes, bonds and overnight investment certificates. Treasury bills are short-term securities with maturities of less than one year issued at a discount. Treasury notes are intermediate securities with maturities of one to ten years. Treasury bonds are long-term debt instruments with maturities of greater than ten years. Overnight certificates are interest-based market securities purchased from the Treasury that mature the next business day and accrue interest based on the Federal Reserve Bank of New York survey of Reserve repurchase agreement rates. The Fund also invests in Treasury Inflation-Protected Securities (TIPS), which are indexed for inflation. TIPS are fixed-rate instruments designed to protect against inflation and the principal amount is indexed to the consumer price index (CPI) by adjusting the CPI at issuance to the current CPI; as inflation increases, so does the principal amount and the coupon. All of these instruments are debt obligations of the U.S Government and are backed by the “full faith and credit” of the government. Debt obligations of the U.S. Government have virtually no risk of nonpayment of principal and interest at the specified due date.\" Think this one might have been shifted over to stocks, as well? I certainly hope not.", 
        "intTime": 20090330, 
        "postID": 29, 
        "quote": "Originally posted by crackerjacks61: How do we know military retirement funds are not included? Wouldn't suprise me. They are taking everything else of mine..have been since Bush...but it's not Bush's fault it's government period and the direction this nation has turned because of government. Now you know why I do not support any of the 2 major parties...they are all the same and continue to allow government to grow and do what it wills with the money they STEAL from us in the name of the law.", 
        "reply": " The following is taken from the Fiscal Year 2005 Military Retirement Fund Audited Financial Statements: http://www.defenselink.mil/comptroller/cfs/fy2005/12_Mi...ts%20and%20Notes.pdf \"The Fund receives income from three sources: monthly normal cost payments from the Services to pay for the current year’s service cost; annual payments from Treasury to amortize the unfunded liability and pay for the increase in the normal cost attributable to Concurrent Receipt; and investment income. The Fund receives investment income from a variety of Treasury-based instruments such as bills, notes, bonds and overnight investment certificates. Treasury bills are short-term securities with maturities of less than one year issued at a discount. Treasury notes are intermediate securities with maturities of one to ten years. Treasury bonds are long-term debt instruments with maturities of greater than ten years. Overnight certificates are interest-based market securities purchased from the Treasury that mature the next business day and accrue interest based on the Federal Reserve Bank of New York survey of Reserve repurchase agreement rates. The Fund also invests in Treasury Inflation-Protected Securities (TIPS), which are indexed for inflation. TIPS are fixed-rate instruments designed to protect against inflation and the principal amount is indexed to the consumer price index (CPI) by adjusting the CPI at issuance to the current CPI; as inflation increases, so does the principal amount and the coupon. All of these instruments are debt obligations of the U.S Government and are backed by the “full faith and credit” of the government. Debt obligations of the U.S. Government have virtually no risk of nonpayment of principal and interest at the specified due date.\" Think this one might have been shifted over to stocks, as well? I certainly hope not.", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 18:34:00", 
        "title": "\"This could be huge\"", 
        "userID": "mcgreer"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: I get the distinked impression that the bush administration and his cronies emptied all the coffers before leaving office. Funny, I get the Distinct impression your talking out your fourth point of contact.", 
        "intTime": 20090330, 
        "postID": 30, 
        "quote": "Originally posted by Another4Truth: I get the distinked impression that the bush administration and his cronies emptied all the coffers before leaving office.", 
        "reply": " Funny, I get the Distinct impression your talking out your fourth point of contact.", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 19:07:00", 
        "title": "\"This could be huge\"", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: Well, its not my retirement that is lost....I'll bet somewhere there is someone smiling all the way to their off shore bank account with all that Federal Retirement Money.... Yeah and some others are claiming that Obama has emptied the federal gold depository... The George Noory crowd has been smoking crack and posting... Respectfully, SUNLINER81", 
        "intTime": 20090330, 
        "postID": 31, 
        "quote": "Originally posted by Another4Truth: Well, its not my retirement that is lost....I'll bet somewhere there is someone smiling all the way to their off shore bank account with all that Federal Retirement Money....", 
        "reply": " Yeah and some others are claiming that Obama has emptied the federal gold depository... The George Noory crowd has been smoking crack and posting... Respectfully, SUNLINER81", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 19:31:00", 
        "title": "\"This could be huge\"", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by Another4Truth: I get the distinked impression that the bush administration and his cronies emptied all the coffers before leaving office. Funny, I get the Distinct impression your talking out your fourth point of contact. I wrote exactly like I meant it. It smells.", 
        "intTime": 20090330, 
        "postID": 32, 
        "quote": "Originally posted by LineDoggie: quote: Originally posted by Another4Truth: I get the distinked impression that the bush administration and his cronies emptied all the coffers before leaving office. Funny, I get the Distinct impression your talking out your fourth point of contact.", 
        "reply": " I wrote exactly like I meant it. It smells.", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 19:36:00", 
        "title": "\"This could be huge\"", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "How long will it take for all the right wingers to figure out that they have been 'had' and that they are not 'conservatives' but just pinheads that have been led by the nose to support an administration that raped the whole country.", 
        "intTime": 20090330, 
        "postID": 33, 
        "quote": "", 
        "reply": "How long will it take for all the right wingers to figure out that they have been 'had' and that they are not 'conservatives' but just pinheads that have been led by the nose to support an administration that raped the whole country.", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 19:43:00", 
        "title": "\"This could be huge\"", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: How long will it take for all the right wingers to figure out that they have been 'had' and that they are not 'conservatives' but just pinheads that have been led by the nose to support an administration that raped the whole country. Bout the same time you finally figure out that there is no \"little gray space aliens\", Easter Bunny, Loch Ness monster, Wolfman, Santa Claus and Tooth Fairy... LOL Respectfully, SUNLINER81", 
        "intTime": 20090330, 
        "postID": 34, 
        "quote": "Originally posted by Another4Truth: How long will it take for all the right wingers to figure out that they have been 'had' and that they are not 'conservatives' but just pinheads that have been led by the nose to support an administration that raped the whole country.", 
        "reply": " Bout the same time you finally figure out that there is no \"little gray space aliens\", Easter Bunny, Loch Ness monster, Wolfman, Santa Claus and Tooth Fairy... LOL Respectfully, SUNLINER81", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 19:48:00", 
        "title": "\"This could be huge\"", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by Another4Truth: How long will it take for all the right wingers to figure out that they have been 'had' and that they are not 'conservatives' but just pinheads that have been led by the nose to support an administration that raped the whole country. Bout the same time you finally figure out that there is no \"little gray space aliens\", Easter Bunny, Loch Ness monster, Wolfman, Santa Claus and Tooth Fairy... LOL Respectfully, SUNLINER81 You forgot 'GOD' the oldest space alien ever.", 
        "intTime": 20090330, 
        "postID": 35, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by Another4Truth: How long will it take for all the right wingers to figure out that they have been 'had' and that they are not 'conservatives' but just pinheads that have been led by the nose to support an administration that raped the whole country. Bout the same time you finally figure out that there is no \"little gray space aliens\", Easter Bunny, Loch Ness monster, Wolfman, Santa Claus and Tooth Fairy... LOL Respectfully, SUNLINER81", 
        "reply": " You forgot 'GOD' the oldest space alien ever.", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 19:54:00", 
        "title": "\"This could be huge\"", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: quote: Originally posted by SUNLINER81: quote: Originally posted by Another4Truth: How long will it take for all the right wingers to figure out that they have been 'had' and that they are not 'conservatives' but just pinheads that have been led by the nose to support an administration that raped the whole country. Bout the same time you finally figure out that there is no \"little gray space aliens\", Easter Bunny, Loch Ness monster, Wolfman, Santa Claus and Tooth Fairy... LOL Respectfully, SUNLINER81 You forgot 'GOD' Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81", 
        "intTime": 20090330, 
        "postID": 36, 
        "quote": "Originally posted by Another4Truth: quote: Originally posted by SUNLINER81: quote: Originally posted by Another4Truth: How long will it take for all the right wingers to figure out that they have been 'had' and that they are not 'conservatives' but just pinheads that have been led by the nose to support an administration that raped the whole country. Bout the same time you finally figure out that there is no \"little gray space aliens\", Easter Bunny, Loch Ness monster, Wolfman, Santa Claus and Tooth Fairy... LOL Respectfully, SUNLINER81 You forgot 'GOD'", 
        "reply": " Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 19:57:00", 
        "title": "\"This could be huge\"", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81 Nice try at changing the subject but it still looks like bush and his cronies did a real job on America. Every day we find out something new that they (the bush administration) did. I wonder what we haven't found out yet??? Doesn't it make you wonder just when and how soon it will affect you yourself personally...", 
        "intTime": 20090330, 
        "postID": 37, 
        "quote": "Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81", 
        "reply": " Nice try at changing the subject but it still looks like bush and his cronies did a real job on America. Every day we find out something new that they (the bush administration) did. I wonder what we haven't found out yet??? Doesn't it make you wonder just when and how soon it will affect you yourself personally...", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 20:06:00", 
        "title": "\"This could be huge\"", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: quote: Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81 Nice try at changing the subject but it still looks like bush and his cronies did a real job on America. Every day we find out something new that they (the bush administration) did. I wonder what we haven't found out yet??? Doesn't it make you wonder just when and how soon it will affect you yourself personally... Wasn't trying to change the subject but, you are still \"baiting\" and that is illegal on this site... Respectfully, SUNLINER81", 
        "intTime": 20090330, 
        "postID": 38, 
        "quote": "Originally posted by Another4Truth: quote: Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81 Nice try at changing the subject but it still looks like bush and his cronies did a real job on America. Every day we find out something new that they (the bush administration) did. I wonder what we haven't found out yet??? Doesn't it make you wonder just when and how soon it will affect you yourself personally...", 
        "reply": " Wasn't trying to change the subject but, you are still \"baiting\" and that is illegal on this site... Respectfully, SUNLINER81", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 20:26:00", 
        "title": "\"This could be huge\"", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by Another4Truth: quote: Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81 Nice try at changing the subject but it still looks like bush and his cronies did a real job on America. Every day we find out something new that they (the bush administration) did. I wonder what we haven't found out yet??? Doesn't it make you wonder just when and how soon it will affect you yourself personally... Wasn't trying to change the subject but, you are still \"baiting\" and that is illegal on this site... Respectfully, SUNLINER81 OK, here is a little something to think about tonight! Sweet Dreams... quote: FOLLOWING MONEY TO TAX HAVENS And guess who's turned up in a new government report about tax havens? Eleven giant recipients of your bailout tax dollars - American Express, AIG, Bank of America, Citigroup, General Motors, GMAC, Goldman Sachs, JP Morgan Chase, Merrill Lynch, Morgan Stanley, and Wells Fargo. Together they've collected more than $227 billion. One favorite among the bailout companies is the Cayman Islands. There's no income tax, no corporate tax and no capital gains tax. Goldman Sachs has 15 subsidiaries there. Bank of America: 59. Citigroup: 90. But MORGAN STANLEY BEATS THEM ALL with at least 158 subsidiaries in the Cayman Islands - seven times the number of hotels. *http://www.cbsnews.com/stories/2009/02/23/eveningnews/main4822689.shtml*", 
        "intTime": 20090330, 
        "postID": 39, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by Another4Truth: quote: Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81 Nice try at changing the subject but it still looks like bush and his cronies did a real job on America. Every day we find out something new that they (the bush administration) did. I wonder what we haven't found out yet??? Doesn't it make you wonder just when and how soon it will affect you yourself personally... Wasn't trying to change the subject but, you are still \"baiting\" and that is illegal on this site... Respectfully, SUNLINER81", 
        "reply": " OK, here is a little something to think about tonight! Sweet Dreams... quote: FOLLOWING MONEY TO TAX HAVENS And guess who's turned up in a new government report about tax havens? Eleven giant recipients of your bailout tax dollars - American Express, AIG, Bank of America, Citigroup, General Motors, GMAC, Goldman Sachs, JP Morgan Chase, Merrill Lynch, Morgan Stanley, and Wells Fargo. Together they've collected more than $227 billion. One favorite among the bailout companies is the Cayman Islands. There's no income tax, no corporate tax and no capital gains tax. Goldman Sachs has 15 subsidiaries there. Bank of America: 59. Citigroup: 90. But MORGAN STANLEY BEATS THEM ALL with at least 158 subsidiaries in the Cayman Islands - seven times the number of hotels. *http://www.cbsnews.com/stories/2009/02/23/eveningnews/main4822689.shtml*", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 20:32:00", 
        "title": "\"This could be huge\"", 
        "userID": "Another4Truth"
    }, 
    {
        "content": "quote: Originally posted by Another4Truth: quote: Originally posted by SUNLINER81: quote: Originally posted by Another4Truth: quote: Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81 Nice try at changing the subject but it still looks like bush and his cronies did a real job on America. Every day we find out something new that they (the bush administration) did. I wonder what we haven't found out yet??? Doesn't it make you wonder just when and how soon it will affect you yourself personally... Wasn't trying to change the subject but, you are still \"baiting\" and that is illegal on this site... Respectfully, SUNLINER81 OK, here is a little something to think about tonight! Sweet Dreams... quote: FOLLOWING MONEY TO TAX HAVENS And guess who's turned up in a new government report about tax havens? Eleven giant recipients of your bailout tax dollars - American Express, AIG, Bank of America, Citigroup, General Motors, GMAC, Goldman Sachs, JP Morgan Chase, Merrill Lynch, Morgan Stanley, and Wells Fargo. Together they've collected more than $227 billion. One favorite among the bailout companies is the Cayman Islands. There's no income tax, no corporate tax and no capital gains tax. Goldman Sachs has 15 subsidiaries there. Bank of America: 59. Citigroup: 90. But MORGAN STANLEY BEATS THEM ALL with at least 158 subsidiaries in the Cayman Islands - seven times the number of hotels. *http://www.cbsnews.com/stories/2009/02/23/eveningnews/main4822689.shtml* Look, you have some sort of idea that I support the bailout, I DON'T... So, don't waste your time, go talk to someone you can \"convert\"... Respectfully, SUNLINER81", 
        "intTime": 20090330, 
        "postID": 40, 
        "quote": "Originally posted by Another4Truth: quote: Originally posted by SUNLINER81: quote: Originally posted by Another4Truth: quote: Nice try at baiting but, no joy in Mudville, I don't care what you believe or don't... I was just pointing out the absurdity of the ideas... Respectfully, SUNLINER81 Nice try at changing the subject but it still looks like bush and his cronies did a real job on America. Every day we find out something new that they (the bush administration) did. I wonder what we haven't found out yet??? Doesn't it make you wonder just when and how soon it will affect you yourself personally... Wasn't trying to change the subject but, you are still \"baiting\" and that is illegal on this site... Respectfully, SUNLINER81 OK, here is a little something to think about tonight! Sweet Dreams... quote: FOLLOWING MONEY TO TAX HAVENS And guess who's turned up in a new government report about tax havens? Eleven giant recipients of your bailout tax dollars - American Express, AIG, Bank of America, Citigroup, General Motors, GMAC, Goldman Sachs, JP Morgan Chase, Merrill Lynch, Morgan Stanley, and Wells Fargo. Together they've collected more than $227 billion. One favorite among the bailout companies is the Cayman Islands. There's no income tax, no corporate tax and no capital gains tax. Goldman Sachs has 15 subsidiaries there. Bank of America: 59. Citigroup: 90. But MORGAN STANLEY BEATS THEM ALL with at least 158 subsidiaries in the Cayman Islands - seven times the number of hotels. *http://www.cbsnews.com/stories/2009/02/23/eveningnews/main4822689.shtml*", 
        "reply": " Look, you have some sort of idea that I support the bailout, I DON'T... So, don't waste your time, go talk to someone you can \"convert\"... Respectfully, SUNLINER81", 
        "threadID": "672198221_5980073912001", 
        "time": "2009-03-30 20:46:00", 
        "title": "\"This could be huge\"", 
        "userID": "SUNLINER81"
    }
]