[
    {
        "content": "***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone!", 
        "intTime": 20090307, 
        "postID": 1, 
        "quote": "", 
        "reply": "***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone!", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-07 18:51:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT Hmmm, a Commander in Chief who actually listens to his generals. \"\"If you talk to Gen. Petraeus, I think he would argue that part of the success in Iraq involved reaching out to people that we would consider to be Islamic fundamentalists, but who were willing to work with us,\" said Obama.\"\" Amazing. I just may sleep well at that!!!", 
        "intTime": 20090308, 
        "postID": 2, 
        "quote": "http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT", 
        "reply": " Hmmm, a Commander in Chief who actually listens to his generals. \"\"If you talk to Gen. Petraeus, I think he would argue that part of the success in Iraq involved reaching out to people that we would consider to be Islamic fundamentalists, but who were willing to work with us,\" said Obama.\"\" Amazing. I just may sleep well at that!!!", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 00:19:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: \"\"If you talk to Gen. Petraeus, I think he would argue that part of the success in Iraq involved reaching out to people that we would consider to be Islamic fundamentalists, but who were willing to work with us,\" said Obama.\"\" \"If?\" and \"I think??\" Something tells me the President has not spoken with the General. And Taliban and moderate are contradictions.", 
        "intTime": 20090308, 
        "postID": 3, 
        "quote": "\"\"If you talk to Gen. Petraeus, I think he would argue that part of the success in Iraq involved reaching out to people that we would consider to be Islamic fundamentalists, but who were willing to work with us,\" said Obama.\"\"", 
        "reply": " \"If?\" and \"I think??\" Something tells me the President has not spoken with the General. And Taliban and moderate are contradictions.", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 00:41:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: quote: http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT Hmmm, a Commander in Chief who actually listens to his generals. \"\"If you talk to Gen. Petraeus, I think he would argue that part of the success in Iraq involved reaching out to people that we would consider to be Islamic fundamentalists, but who were willing to work with us,\" said Obama.\"\" Amazing. I just may sleep well at that!!! It was bound to happen. Another naive view on terrorism. What makes you think there are 'moderate' Taliban? And on the slim possibility there are, would one really trust them? I recall (without a specific reference available) there were small indicators of a moderate Taliban view (in Pakistan as I recall), but hasn't that disappeared too? I agree scooter, too many \"IF's\" and \"I think's\" that are not worth the risk!", 
        "intTime": 20090308, 
        "postID": 4, 
        "quote": "Originally posted by jdksfcret: quote: http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT Hmmm, a Commander in Chief who actually listens to his generals. \"\"If you talk to Gen. Petraeus, I think he would argue that part of the success in Iraq involved reaching out to people that we would consider to be Islamic fundamentalists, but who were willing to work with us,\" said Obama.\"\" Amazing. I just may sleep well at that!!!", 
        "reply": " It was bound to happen. Another naive view on terrorism. What makes you think there are 'moderate' Taliban? And on the slim possibility there are, would one really trust them? I recall (without a specific reference available) there were small indicators of a moderate Taliban view (in Pakistan as I recall), but hasn't that disappeared too? I agree scooter, too many \"IF's\" and \"I think's\" that are not worth the risk!", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 04:00:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Great, this is a big part of what made the surge work. Pretty sure this is the kind of idea Petraeus worked on or at least ascribes to.", 
        "intTime": 20090308, 
        "postID": 5, 
        "quote": "", 
        "reply": "Great, this is a big part of what made the surge work. Pretty sure this is the kind of idea Petraeus worked on or at least ascribes to.", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 04:10:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "foxred03"
    }, 
    {
        "content": "That is a big gray area. It depends on who they define as Taliban. If they mean the average Pashtun tribesman that makes up mosr of the Taliban's base thay makes sense. That would be like the Sons of Iraq initiative.", 
        "intTime": 20090308, 
        "postID": 6, 
        "quote": "", 
        "reply": "That is a big gray area. It depends on who they define as Taliban. If they mean the average Pashtun tribesman that makes up mosr of the Taliban's base thay makes sense. That would be like the Sons of Iraq initiative.", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 06:57:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "I just have a quick question: what constitutes a moderate member of the Taliban?", 
        "intTime": 20090308, 
        "postID": 7, 
        "quote": "", 
        "reply": "I just have a quick question: what constitutes a moderate member of the Taliban?", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 07:20:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "klc2000us"
    }, 
    {
        "content": "Moderate Taliban? What a great oxymoron. Sorta like intelligent Democrat.", 
        "intTime": 20090308, 
        "postID": 8, 
        "quote": "", 
        "reply": "Moderate Taliban? What a great oxymoron. Sorta like intelligent Democrat.", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 07:25:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: Moderate Taliban? What a great oxymoron. Sorta like intelligent Democrat. Moderate murderers", 
        "intTime": 20090308, 
        "postID": 9, 
        "quote": "Originally posted by fishnfanatic: Moderate Taliban? What a great oxymoron. Sorta like intelligent Democrat.", 
        "reply": " Moderate murderers", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 09:08:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "EAG154"
    }, 
    {
        "content": "Obama's off in la la land again, or is it still!", 
        "intTime": 20090308, 
        "postID": 10, 
        "quote": "", 
        "reply": "Obama's off in la la land again, or is it still!", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 09:09:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone! General David Petraeus said of Afghanistan recently: “You don’t kill or capture your way out of an industrial-strength insurgency.” So what is the answer, if not to talk to those who will fight for generations against the America forces? The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. After seven years of war, President Bush had no plan for victory in Afghanistan. So what should be President Obama’s plan that does not include talking to the enemy?", 
        "intTime": 20090308, 
        "postID": 11, 
        "quote": "Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone!", 
        "reply": " General David Petraeus said of Afghanistan recently: “You don’t kill or capture your way out of an industrial-strength insurgency.” So what is the answer, if not to talk to those who will fight for generations against the America forces? The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. After seven years of war, President Bush had no plan for victory in Afghanistan. So what should be President Obama’s plan that does not include talking to the enemy?", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 09:22:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone! General David Petraeus said of Afghanistan recently: “You don’t kill or capture your way out of an industrial-strength insurgency.” So what is the answer, if not to talk to those who will fight for generations against the America forces? The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. After seven years of war, President Bush had no plan for victory in Afghanistan. So what should be President Obama’s plan that does not include talking to the enemy? I have problems with this approach. There is a difference in saying that we will be happy to amnesty those who wish to rejoin the Afghan community, and defacto recognising the Taliban. As another poster asks, \"What is a moderate Taliban?\" Sure, spread the word, that if you surrender, we wont even treat you as a prisoner. All will be forgiven. Do this on a low key, don't include the leadership, etc, etc. Taliban ideology is a version of Islam that never existed. They are defacto quite comparable to the most extreme political ideology. There is absolutely nothing that they cannot justify, and have justified. I've consistantly posted that to combat the Taliban we have to place our primary support to the secular forces of Afghanistan - i.e. those who have a greater incentive to terminate the Taliban than we do. We simply have picked and we simply support the wrong people. Dope dealers, and Fundamentalist light. The first so corrupt, that they are only interested in making money, the other, will betray us in a flash. Dave", 
        "intTime": 20090308, 
        "postID": 12, 
        "quote": "Originally posted by xerello: quote: Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone! General David Petraeus said of Afghanistan recently: “You don’t kill or capture your way out of an industrial-strength insurgency.” So what is the answer, if not to talk to those who will fight for generations against the America forces? The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. After seven years of war, President Bush had no plan for victory in Afghanistan. So what should be President Obama’s plan that does not include talking to the enemy?", 
        "reply": " I have problems with this approach. There is a difference in saying that we will be happy to amnesty those who wish to rejoin the Afghan community, and defacto recognising the Taliban. As another poster asks, \"What is a moderate Taliban?\" Sure, spread the word, that if you surrender, we wont even treat you as a prisoner. All will be forgiven. Do this on a low key, don't include the leadership, etc, etc. Taliban ideology is a version of Islam that never existed. They are defacto quite comparable to the most extreme political ideology. There is absolutely nothing that they cannot justify, and have justified. I've consistantly posted that to combat the Taliban we have to place our primary support to the secular forces of Afghanistan - i.e. those who have a greater incentive to terminate the Taliban than we do. We simply have picked and we simply support the wrong people. Dope dealers, and Fundamentalist light. The first so corrupt, that they are only interested in making money, the other, will betray us in a flash. Dave", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 09:33:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone! The moderate elements of the Taliban are quite easily identified in Afghanistan. They are the ones who won't cut your throat while you are sleeping if given the chance. Hope President Obama has some of his own people to send to put them to the test. As much as he'd like to send Republicans...and/or Rush.", 
        "intTime": 20090308, 
        "postID": 13, 
        "quote": "Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone!", 
        "reply": " The moderate elements of the Taliban are quite easily identified in Afghanistan. They are the ones who won't cut your throat while you are sleeping if given the chance. Hope President Obama has some of his own people to send to put them to the test. As much as he'd like to send Republicans...and/or Rush.", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 10:34:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "I guess he wants to make friends with the Hamus and Palistinians because he asked for over 23 million dollars to bring thousands of the palistine refugees to the U.S. and give them housing and food. Most of the Hamuas believe in killing infidels ( us )in suicide bombings and being muslims will naturally organize all Muslims and vote one way. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090308, 
        "postID": 14, 
        "quote": "", 
        "reply": "I guess he wants to make friends with the Hamus and Palistinians because he asked for over 23 million dollars to bring thousands of the palistine refugees to the U.S. and give them housing and food. Most of the Hamuas believe in killing infidels ( us )in suicide bombings and being muslims will naturally organize all Muslims and vote one way. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 11:05:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "EOCRon"
    }, 
    {
        "content": "quote: Originally posted by EOCRon: I guess he wants to make friends with the Hamus and Palistinians because he asked for over 23 million dollars to bring thousands of the palistine refugees to the U.S. and give them housing and food. Most of the Hamuas believe in killing infidels ( us )in suicide bombings and being muslims will naturally organize all Muslims and vote one way. Actually, it would be more accurate to say that he gave 23 million to bring in Martian refugee's from space. Didn't you see the movie, \"Mars Attacks?\" Your post comes from an equally truthful source. Dave", 
        "intTime": 20090308, 
        "postID": 15, 
        "quote": "Originally posted by EOCRon: I guess he wants to make friends with the Hamus and Palistinians because he asked for over 23 million dollars to bring thousands of the palistine refugees to the U.S. and give them housing and food. Most of the Hamuas believe in killing infidels ( us )in suicide bombings and being muslims will naturally organize all Muslims and vote one way.", 
        "reply": " Actually, it would be more accurate to say that he gave 23 million to bring in Martian refugee's from space. Didn't you see the movie, \"Mars Attacks?\" Your post comes from an equally truthful source. Dave", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 11:11:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "Grachus"
    }, 
    {
        "content": "Hey Dave, Maybe all we have to do is have Slim Whitman's \"Indian Love Call\" blaring out across Afganistan and their heads will blow up. Worked for the Martians. LOL", 
        "intTime": 20090308, 
        "postID": 16, 
        "quote": "", 
        "reply": "Hey Dave, Maybe all we have to do is have Slim Whitman's \"Indian Love Call\" blaring out across Afganistan and their heads will blow up. Worked for the Martians. LOL", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 11:28:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. Actually, Russia was doing quite well in A-stan until Reagan had the CIA fund, train and arm the Mujahadeen in the very same tactics now used against US and NATO troops now by the sons of these radicals in a very clear example of what goes around, comes around. And Dave, my source at the State department says these Palestinians are coming to America a couple hundred per week and getting housing and food stamps but no one is telling them how to act in the host country. The same thing happened with Somalis who came to the US now have sons return to fight against US interests and have made quite an enterprise in kidnapping and piracy with their knowledge learned in the US. Its quite useful for them to be able to make ransom demands in English.", 
        "intTime": 20090308, 
        "postID": 17, 
        "quote": "The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat.", 
        "reply": " Actually, Russia was doing quite well in A-stan until Reagan had the CIA fund, train and arm the Mujahadeen in the very same tactics now used against US and NATO troops now by the sons of these radicals in a very clear example of what goes around, comes around. And Dave, my source at the State department says these Palestinians are coming to America a couple hundred per week and getting housing and food stamps but no one is telling them how to act in the host country. The same thing happened with Somalis who came to the US now have sons return to fight against US interests and have made quite an enterprise in kidnapping and piracy with their knowledge learned in the US. Its quite useful for them to be able to make ransom demands in English.", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 11:32:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: Hey Dave, Maybe all we have to do is have Slim Whitman's \"Indian Love Call\" blaring out across Afganistan and their heads will blow up. Worked for the Martians. LOL I wish... I don't buy the concept of a \"moderate Taliban.\" Fine, all well and good to have an amnesty program for the low level soldiers. But I don't accept the idea that you can negotiate with \"moderate leaders.\" I don't believe in that idea at all. Certainly I have NO USE for the leaders we hand-picked to run Afghanistan. But that's another thread. Dave", 
        "intTime": 20090308, 
        "postID": 18, 
        "quote": "Originally posted by BAGodbehere: Hey Dave, Maybe all we have to do is have Slim Whitman's \"Indian Love Call\" blaring out across Afganistan and their heads will blow up. Worked for the Martians. LOL", 
        "reply": " I wish... I don't buy the concept of a \"moderate Taliban.\" Fine, all well and good to have an amnesty program for the low level soldiers. But I don't accept the idea that you can negotiate with \"moderate leaders.\" I don't believe in that idea at all. Certainly I have NO USE for the leaders we hand-picked to run Afghanistan. But that's another thread. Dave", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 11:32:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone! General David Petraeus said of Afghanistan recently: “You don’t kill or capture your way out of an industrial-strength insurgency.” So what is the answer, if not to talk to those who will fight for generations against the America forces? The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. After seven years of war, President Bush had no plan for victory in Afghanistan. So what should be President Obama’s plan that does not include talking to the enemy? The answer IS....GET THE FCK OUT OF AFGANISTAN!", 
        "intTime": 20090308, 
        "postID": 19, 
        "quote": "Originally posted by xerello: quote: Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone! General David Petraeus said of Afghanistan recently: “You don’t kill or capture your way out of an industrial-strength insurgency.” So what is the answer, if not to talk to those who will fight for generations against the America forces? The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. After seven years of war, President Bush had no plan for victory in Afghanistan. So what should be President Obama’s plan that does not include talking to the enemy?", 
        "reply": " The answer IS....GET THE FCK OUT OF AFGANISTAN!", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 11:51:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "EAG154"
    }, 
    {
        "content": "I guess I was wrong about him bringing the humas and palistinians here..He just gave them 20 million plus so they can rebuild so Isreal can blow them up again.. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090308, 
        "postID": 20, 
        "quote": "", 
        "reply": "I guess I was wrong about him bringing the humas and palistinians here..He just gave them 20 million plus so they can rebuild so Isreal can blow them up again.. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 12:48:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "EOCRon"
    }, 
    {
        "content": "***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone!", 
        "intTime": 20090307, 
        "postID": 21, 
        "quote": "", 
        "reply": "***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone!", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-07 18:51:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT Hmmm, a Commander in Chief who actually listens to his generals. \"\"If you talk to Gen. Petraeus, I think he would argue that part of the success in Iraq involved reaching out to people that we would consider to be Islamic fundamentalists, but who were willing to work with us,\" said Obama.\"\" Amazing. I just may sleep well at that!!!", 
        "intTime": 20090308, 
        "postID": 22, 
        "quote": "http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT", 
        "reply": " Hmmm, a Commander in Chief who actually listens to his generals. \"\"If you talk to Gen. Petraeus, I think he would argue that part of the success in Iraq involved reaching out to people that we would consider to be Islamic fundamentalists, but who were willing to work with us,\" said Obama.\"\" Amazing. I just may sleep well at that!!!", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 00:19:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: \"\"If you talk to Gen. Petraeus, I think he would argue that part of the success in Iraq involved reaching out to people that we would consider to be Islamic fundamentalists, but who were willing to work with us,\" said Obama.\"\" \"If?\" and \"I think??\" Something tells me the President has not spoken with the General. And Taliban and moderate are contradictions.", 
        "intTime": 20090308, 
        "postID": 23, 
        "quote": "\"\"If you talk to Gen. Petraeus, I think he would argue that part of the success in Iraq involved reaching out to people that we would consider to be Islamic fundamentalists, but who were willing to work with us,\" said Obama.\"\"", 
        "reply": " \"If?\" and \"I think??\" Something tells me the President has not spoken with the General. And Taliban and moderate are contradictions.", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 00:41:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: quote: http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT Hmmm, a Commander in Chief who actually listens to his generals. \"\"If you talk to Gen. Petraeus, I think he would argue that part of the success in Iraq involved reaching out to people that we would consider to be Islamic fundamentalists, but who were willing to work with us,\" said Obama.\"\" Amazing. I just may sleep well at that!!! It was bound to happen. Another naive view on terrorism. What makes you think there are 'moderate' Taliban? And on the slim possibility there are, would one really trust them? I recall (without a specific reference available) there were small indicators of a moderate Taliban view (in Pakistan as I recall), but hasn't that disappeared too? I agree scooter, too many \"IF's\" and \"I think's\" that are not worth the risk!", 
        "intTime": 20090308, 
        "postID": 24, 
        "quote": "Originally posted by jdksfcret: quote: http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT Hmmm, a Commander in Chief who actually listens to his generals. \"\"If you talk to Gen. Petraeus, I think he would argue that part of the success in Iraq involved reaching out to people that we would consider to be Islamic fundamentalists, but who were willing to work with us,\" said Obama.\"\" Amazing. I just may sleep well at that!!!", 
        "reply": " It was bound to happen. Another naive view on terrorism. What makes you think there are 'moderate' Taliban? And on the slim possibility there are, would one really trust them? I recall (without a specific reference available) there were small indicators of a moderate Taliban view (in Pakistan as I recall), but hasn't that disappeared too? I agree scooter, too many \"IF's\" and \"I think's\" that are not worth the risk!", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 04:00:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Great, this is a big part of what made the surge work. Pretty sure this is the kind of idea Petraeus worked on or at least ascribes to.", 
        "intTime": 20090308, 
        "postID": 25, 
        "quote": "", 
        "reply": "Great, this is a big part of what made the surge work. Pretty sure this is the kind of idea Petraeus worked on or at least ascribes to.", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 04:10:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "foxred03"
    }, 
    {
        "content": "That is a big gray area. It depends on who they define as Taliban. If they mean the average Pashtun tribesman that makes up mosr of the Taliban's base thay makes sense. That would be like the Sons of Iraq initiative.", 
        "intTime": 20090308, 
        "postID": 26, 
        "quote": "", 
        "reply": "That is a big gray area. It depends on who they define as Taliban. If they mean the average Pashtun tribesman that makes up mosr of the Taliban's base thay makes sense. That would be like the Sons of Iraq initiative.", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 06:57:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "I just have a quick question: what constitutes a moderate member of the Taliban?", 
        "intTime": 20090308, 
        "postID": 27, 
        "quote": "", 
        "reply": "I just have a quick question: what constitutes a moderate member of the Taliban?", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 07:20:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "klc2000us"
    }, 
    {
        "content": "Moderate Taliban? What a great oxymoron. Sorta like intelligent Democrat.", 
        "intTime": 20090308, 
        "postID": 28, 
        "quote": "", 
        "reply": "Moderate Taliban? What a great oxymoron. Sorta like intelligent Democrat.", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 07:25:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: Moderate Taliban? What a great oxymoron. Sorta like intelligent Democrat. Moderate murderers", 
        "intTime": 20090308, 
        "postID": 29, 
        "quote": "Originally posted by fishnfanatic: Moderate Taliban? What a great oxymoron. Sorta like intelligent Democrat.", 
        "reply": " Moderate murderers", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 09:08:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "EAG154"
    }, 
    {
        "content": "Obama's off in la la land again, or is it still!", 
        "intTime": 20090308, 
        "postID": 30, 
        "quote": "", 
        "reply": "Obama's off in la la land again, or is it still!", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 09:09:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone! General David Petraeus said of Afghanistan recently: “You don’t kill or capture your way out of an industrial-strength insurgency.” So what is the answer, if not to talk to those who will fight for generations against the America forces? The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. After seven years of war, President Bush had no plan for victory in Afghanistan. So what should be President Obama’s plan that does not include talking to the enemy?", 
        "intTime": 20090308, 
        "postID": 31, 
        "quote": "Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone!", 
        "reply": " General David Petraeus said of Afghanistan recently: “You don’t kill or capture your way out of an industrial-strength insurgency.” So what is the answer, if not to talk to those who will fight for generations against the America forces? The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. After seven years of war, President Bush had no plan for victory in Afghanistan. So what should be President Obama’s plan that does not include talking to the enemy?", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 09:22:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone! General David Petraeus said of Afghanistan recently: “You don’t kill or capture your way out of an industrial-strength insurgency.” So what is the answer, if not to talk to those who will fight for generations against the America forces? The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. After seven years of war, President Bush had no plan for victory in Afghanistan. So what should be President Obama’s plan that does not include talking to the enemy? I have problems with this approach. There is a difference in saying that we will be happy to amnesty those who wish to rejoin the Afghan community, and defacto recognising the Taliban. As another poster asks, \"What is a moderate Taliban?\" Sure, spread the word, that if you surrender, we wont even treat you as a prisoner. All will be forgiven. Do this on a low key, don't include the leadership, etc, etc. Taliban ideology is a version of Islam that never existed. They are defacto quite comparable to the most extreme political ideology. There is absolutely nothing that they cannot justify, and have justified. I've consistantly posted that to combat the Taliban we have to place our primary support to the secular forces of Afghanistan - i.e. those who have a greater incentive to terminate the Taliban than we do. We simply have picked and we simply support the wrong people. Dope dealers, and Fundamentalist light. The first so corrupt, that they are only interested in making money, the other, will betray us in a flash. Dave", 
        "intTime": 20090308, 
        "postID": 32, 
        "quote": "Originally posted by xerello: quote: Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone! General David Petraeus said of Afghanistan recently: “You don’t kill or capture your way out of an industrial-strength insurgency.” So what is the answer, if not to talk to those who will fight for generations against the America forces? The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. After seven years of war, President Bush had no plan for victory in Afghanistan. So what should be President Obama’s plan that does not include talking to the enemy?", 
        "reply": " I have problems with this approach. There is a difference in saying that we will be happy to amnesty those who wish to rejoin the Afghan community, and defacto recognising the Taliban. As another poster asks, \"What is a moderate Taliban?\" Sure, spread the word, that if you surrender, we wont even treat you as a prisoner. All will be forgiven. Do this on a low key, don't include the leadership, etc, etc. Taliban ideology is a version of Islam that never existed. They are defacto quite comparable to the most extreme political ideology. There is absolutely nothing that they cannot justify, and have justified. I've consistantly posted that to combat the Taliban we have to place our primary support to the secular forces of Afghanistan - i.e. those who have a greater incentive to terminate the Taliban than we do. We simply have picked and we simply support the wrong people. Dope dealers, and Fundamentalist light. The first so corrupt, that they are only interested in making money, the other, will betray us in a flash. Dave", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 09:33:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone! The moderate elements of the Taliban are quite easily identified in Afghanistan. They are the ones who won't cut your throat while you are sleeping if given the chance. Hope President Obama has some of his own people to send to put them to the test. As much as he'd like to send Republicans...and/or Rush.", 
        "intTime": 20090308, 
        "postID": 33, 
        "quote": "Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone!", 
        "reply": " The moderate elements of the Taliban are quite easily identified in Afghanistan. They are the ones who won't cut your throat while you are sleeping if given the chance. Hope President Obama has some of his own people to send to put them to the test. As much as he'd like to send Republicans...and/or Rush.", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 10:34:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "I guess he wants to make friends with the Hamus and Palistinians because he asked for over 23 million dollars to bring thousands of the palistine refugees to the U.S. and give them housing and food. Most of the Hamuas believe in killing infidels ( us )in suicide bombings and being muslims will naturally organize all Muslims and vote one way. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090308, 
        "postID": 34, 
        "quote": "", 
        "reply": "I guess he wants to make friends with the Hamus and Palistinians because he asked for over 23 million dollars to bring thousands of the palistine refugees to the U.S. and give them housing and food. Most of the Hamuas believe in killing infidels ( us )in suicide bombings and being muslims will naturally organize all Muslims and vote one way. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 11:05:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "EOCRon"
    }, 
    {
        "content": "quote: Originally posted by EOCRon: I guess he wants to make friends with the Hamus and Palistinians because he asked for over 23 million dollars to bring thousands of the palistine refugees to the U.S. and give them housing and food. Most of the Hamuas believe in killing infidels ( us )in suicide bombings and being muslims will naturally organize all Muslims and vote one way. Actually, it would be more accurate to say that he gave 23 million to bring in Martian refugee's from space. Didn't you see the movie, \"Mars Attacks?\" Your post comes from an equally truthful source. Dave", 
        "intTime": 20090308, 
        "postID": 35, 
        "quote": "Originally posted by EOCRon: I guess he wants to make friends with the Hamus and Palistinians because he asked for over 23 million dollars to bring thousands of the palistine refugees to the U.S. and give them housing and food. Most of the Hamuas believe in killing infidels ( us )in suicide bombings and being muslims will naturally organize all Muslims and vote one way.", 
        "reply": " Actually, it would be more accurate to say that he gave 23 million to bring in Martian refugee's from space. Didn't you see the movie, \"Mars Attacks?\" Your post comes from an equally truthful source. Dave", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 11:11:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "Grachus"
    }, 
    {
        "content": "Hey Dave, Maybe all we have to do is have Slim Whitman's \"Indian Love Call\" blaring out across Afganistan and their heads will blow up. Worked for the Martians. LOL", 
        "intTime": 20090308, 
        "postID": 36, 
        "quote": "", 
        "reply": "Hey Dave, Maybe all we have to do is have Slim Whitman's \"Indian Love Call\" blaring out across Afganistan and their heads will blow up. Worked for the Martians. LOL", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 11:28:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. Actually, Russia was doing quite well in A-stan until Reagan had the CIA fund, train and arm the Mujahadeen in the very same tactics now used against US and NATO troops now by the sons of these radicals in a very clear example of what goes around, comes around. And Dave, my source at the State department says these Palestinians are coming to America a couple hundred per week and getting housing and food stamps but no one is telling them how to act in the host country. The same thing happened with Somalis who came to the US now have sons return to fight against US interests and have made quite an enterprise in kidnapping and piracy with their knowledge learned in the US. Its quite useful for them to be able to make ransom demands in English.", 
        "intTime": 20090308, 
        "postID": 37, 
        "quote": "The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat.", 
        "reply": " Actually, Russia was doing quite well in A-stan until Reagan had the CIA fund, train and arm the Mujahadeen in the very same tactics now used against US and NATO troops now by the sons of these radicals in a very clear example of what goes around, comes around. And Dave, my source at the State department says these Palestinians are coming to America a couple hundred per week and getting housing and food stamps but no one is telling them how to act in the host country. The same thing happened with Somalis who came to the US now have sons return to fight against US interests and have made quite an enterprise in kidnapping and piracy with their knowledge learned in the US. Its quite useful for them to be able to make ransom demands in English.", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 11:32:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: Hey Dave, Maybe all we have to do is have Slim Whitman's \"Indian Love Call\" blaring out across Afganistan and their heads will blow up. Worked for the Martians. LOL I wish... I don't buy the concept of a \"moderate Taliban.\" Fine, all well and good to have an amnesty program for the low level soldiers. But I don't accept the idea that you can negotiate with \"moderate leaders.\" I don't believe in that idea at all. Certainly I have NO USE for the leaders we hand-picked to run Afghanistan. But that's another thread. Dave", 
        "intTime": 20090308, 
        "postID": 38, 
        "quote": "Originally posted by BAGodbehere: Hey Dave, Maybe all we have to do is have Slim Whitman's \"Indian Love Call\" blaring out across Afganistan and their heads will blow up. Worked for the Martians. LOL", 
        "reply": " I wish... I don't buy the concept of a \"moderate Taliban.\" Fine, all well and good to have an amnesty program for the low level soldiers. But I don't accept the idea that you can negotiate with \"moderate leaders.\" I don't believe in that idea at all. Certainly I have NO USE for the leaders we hand-picked to run Afghanistan. But that's another thread. Dave", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 11:32:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone! General David Petraeus said of Afghanistan recently: “You don’t kill or capture your way out of an industrial-strength insurgency.” So what is the answer, if not to talk to those who will fight for generations against the America forces? The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. After seven years of war, President Bush had no plan for victory in Afghanistan. So what should be President Obama’s plan that does not include talking to the enemy? The answer IS....GET THE FCK OUT OF AFGANISTAN!", 
        "intTime": 20090308, 
        "postID": 39, 
        "quote": "Originally posted by xerello: quote: Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone! General David Petraeus said of Afghanistan recently: “You don’t kill or capture your way out of an industrial-strength insurgency.” So what is the answer, if not to talk to those who will fight for generations against the America forces? The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. After seven years of war, President Bush had no plan for victory in Afghanistan. So what should be President Obama’s plan that does not include talking to the enemy?", 
        "reply": " The answer IS....GET THE FCK OUT OF AFGANISTAN!", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 11:51:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "EAG154"
    }, 
    {
        "content": "I guess I was wrong about him bringing the humas and palistinians here..He just gave them 20 million plus so they can rebuild so Isreal can blow them up again.. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090308, 
        "postID": 40, 
        "quote": "", 
        "reply": "I guess I was wrong about him bringing the humas and palistinians here..He just gave them 20 million plus so they can rebuild so Isreal can blow them up again.. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 12:48:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "EOCRon"
    }, 
    {
        "content": "***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone!", 
        "intTime": 20090307, 
        "postID": 41, 
        "quote": "", 
        "reply": "***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone!", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-07 18:51:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "Navy_Grunt"
    }, 
    {
        "content": "quote: http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT Hmmm, a Commander in Chief who actually listens to his generals. \"\"If you talk to Gen. Petraeus, I think he would argue that part of the success in Iraq involved reaching out to people that we would consider to be Islamic fundamentalists, but who were willing to work with us,\" said Obama.\"\" Amazing. I just may sleep well at that!!!", 
        "intTime": 20090308, 
        "postID": 42, 
        "quote": "http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT", 
        "reply": " Hmmm, a Commander in Chief who actually listens to his generals. \"\"If you talk to Gen. Petraeus, I think he would argue that part of the success in Iraq involved reaching out to people that we would consider to be Islamic fundamentalists, but who were willing to work with us,\" said Obama.\"\" Amazing. I just may sleep well at that!!!", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 00:19:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: \"\"If you talk to Gen. Petraeus, I think he would argue that part of the success in Iraq involved reaching out to people that we would consider to be Islamic fundamentalists, but who were willing to work with us,\" said Obama.\"\" \"If?\" and \"I think??\" Something tells me the President has not spoken with the General. And Taliban and moderate are contradictions.", 
        "intTime": 20090308, 
        "postID": 43, 
        "quote": "\"\"If you talk to Gen. Petraeus, I think he would argue that part of the success in Iraq involved reaching out to people that we would consider to be Islamic fundamentalists, but who were willing to work with us,\" said Obama.\"\"", 
        "reply": " \"If?\" and \"I think??\" Something tells me the President has not spoken with the General. And Taliban and moderate are contradictions.", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 00:41:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: Originally posted by jdksfcret: quote: http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT Hmmm, a Commander in Chief who actually listens to his generals. \"\"If you talk to Gen. Petraeus, I think he would argue that part of the success in Iraq involved reaching out to people that we would consider to be Islamic fundamentalists, but who were willing to work with us,\" said Obama.\"\" Amazing. I just may sleep well at that!!! It was bound to happen. Another naive view on terrorism. What makes you think there are 'moderate' Taliban? And on the slim possibility there are, would one really trust them? I recall (without a specific reference available) there were small indicators of a moderate Taliban view (in Pakistan as I recall), but hasn't that disappeared too? I agree scooter, too many \"IF's\" and \"I think's\" that are not worth the risk!", 
        "intTime": 20090308, 
        "postID": 44, 
        "quote": "Originally posted by jdksfcret: quote: http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT Hmmm, a Commander in Chief who actually listens to his generals. \"\"If you talk to Gen. Petraeus, I think he would argue that part of the success in Iraq involved reaching out to people that we would consider to be Islamic fundamentalists, but who were willing to work with us,\" said Obama.\"\" Amazing. I just may sleep well at that!!!", 
        "reply": " It was bound to happen. Another naive view on terrorism. What makes you think there are 'moderate' Taliban? And on the slim possibility there are, would one really trust them? I recall (without a specific reference available) there were small indicators of a moderate Taliban view (in Pakistan as I recall), but hasn't that disappeared too? I agree scooter, too many \"IF's\" and \"I think's\" that are not worth the risk!", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 04:00:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Great, this is a big part of what made the surge work. Pretty sure this is the kind of idea Petraeus worked on or at least ascribes to.", 
        "intTime": 20090308, 
        "postID": 45, 
        "quote": "", 
        "reply": "Great, this is a big part of what made the surge work. Pretty sure this is the kind of idea Petraeus worked on or at least ascribes to.", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 04:10:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "foxred03"
    }, 
    {
        "content": "That is a big gray area. It depends on who they define as Taliban. If they mean the average Pashtun tribesman that makes up mosr of the Taliban's base thay makes sense. That would be like the Sons of Iraq initiative.", 
        "intTime": 20090308, 
        "postID": 46, 
        "quote": "", 
        "reply": "That is a big gray area. It depends on who they define as Taliban. If they mean the average Pashtun tribesman that makes up mosr of the Taliban's base thay makes sense. That would be like the Sons of Iraq initiative.", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 06:57:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "nspreitler"
    }, 
    {
        "content": "I just have a quick question: what constitutes a moderate member of the Taliban?", 
        "intTime": 20090308, 
        "postID": 47, 
        "quote": "", 
        "reply": "I just have a quick question: what constitutes a moderate member of the Taliban?", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 07:20:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "klc2000us"
    }, 
    {
        "content": "Moderate Taliban? What a great oxymoron. Sorta like intelligent Democrat.", 
        "intTime": 20090308, 
        "postID": 48, 
        "quote": "", 
        "reply": "Moderate Taliban? What a great oxymoron. Sorta like intelligent Democrat.", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 07:25:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "quote: Originally posted by fishnfanatic: Moderate Taliban? What a great oxymoron. Sorta like intelligent Democrat. Moderate murderers", 
        "intTime": 20090308, 
        "postID": 49, 
        "quote": "Originally posted by fishnfanatic: Moderate Taliban? What a great oxymoron. Sorta like intelligent Democrat.", 
        "reply": " Moderate murderers", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 09:08:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "EAG154"
    }, 
    {
        "content": "Obama's off in la la land again, or is it still!", 
        "intTime": 20090308, 
        "postID": 50, 
        "quote": "", 
        "reply": "Obama's off in la la land again, or is it still!", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 09:09:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone! General David Petraeus said of Afghanistan recently: “You don’t kill or capture your way out of an industrial-strength insurgency.” So what is the answer, if not to talk to those who will fight for generations against the America forces? The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. After seven years of war, President Bush had no plan for victory in Afghanistan. So what should be President Obama’s plan that does not include talking to the enemy?", 
        "intTime": 20090308, 
        "postID": 51, 
        "quote": "Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone!", 
        "reply": " General David Petraeus said of Afghanistan recently: “You don’t kill or capture your way out of an industrial-strength insurgency.” So what is the answer, if not to talk to those who will fight for generations against the America forces? The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. After seven years of war, President Bush had no plan for victory in Afghanistan. So what should be President Obama’s plan that does not include talking to the enemy?", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 09:22:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "xerello"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone! General David Petraeus said of Afghanistan recently: “You don’t kill or capture your way out of an industrial-strength insurgency.” So what is the answer, if not to talk to those who will fight for generations against the America forces? The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. After seven years of war, President Bush had no plan for victory in Afghanistan. So what should be President Obama’s plan that does not include talking to the enemy? I have problems with this approach. There is a difference in saying that we will be happy to amnesty those who wish to rejoin the Afghan community, and defacto recognising the Taliban. As another poster asks, \"What is a moderate Taliban?\" Sure, spread the word, that if you surrender, we wont even treat you as a prisoner. All will be forgiven. Do this on a low key, don't include the leadership, etc, etc. Taliban ideology is a version of Islam that never existed. They are defacto quite comparable to the most extreme political ideology. There is absolutely nothing that they cannot justify, and have justified. I've consistantly posted that to combat the Taliban we have to place our primary support to the secular forces of Afghanistan - i.e. those who have a greater incentive to terminate the Taliban than we do. We simply have picked and we simply support the wrong people. Dope dealers, and Fundamentalist light. The first so corrupt, that they are only interested in making money, the other, will betray us in a flash. Dave", 
        "intTime": 20090308, 
        "postID": 52, 
        "quote": "Originally posted by xerello: quote: Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone! General David Petraeus said of Afghanistan recently: “You don’t kill or capture your way out of an industrial-strength insurgency.” So what is the answer, if not to talk to those who will fight for generations against the America forces? The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. After seven years of war, President Bush had no plan for victory in Afghanistan. So what should be President Obama’s plan that does not include talking to the enemy?", 
        "reply": " I have problems with this approach. There is a difference in saying that we will be happy to amnesty those who wish to rejoin the Afghan community, and defacto recognising the Taliban. As another poster asks, \"What is a moderate Taliban?\" Sure, spread the word, that if you surrender, we wont even treat you as a prisoner. All will be forgiven. Do this on a low key, don't include the leadership, etc, etc. Taliban ideology is a version of Islam that never existed. They are defacto quite comparable to the most extreme political ideology. There is absolutely nothing that they cannot justify, and have justified. I've consistantly posted that to combat the Taliban we have to place our primary support to the secular forces of Afghanistan - i.e. those who have a greater incentive to terminate the Taliban than we do. We simply have picked and we simply support the wrong people. Dope dealers, and Fundamentalist light. The first so corrupt, that they are only interested in making money, the other, will betray us in a flash. Dave", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 09:33:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone! The moderate elements of the Taliban are quite easily identified in Afghanistan. They are the ones who won't cut your throat while you are sleeping if given the chance. Hope President Obama has some of his own people to send to put them to the test. As much as he'd like to send Republicans...and/or Rush.", 
        "intTime": 20090308, 
        "postID": 53, 
        "quote": "Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone!", 
        "reply": " The moderate elements of the Taliban are quite easily identified in Afghanistan. They are the ones who won't cut your throat while you are sleeping if given the chance. Hope President Obama has some of his own people to send to put them to the test. As much as he'd like to send Republicans...and/or Rush.", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 10:34:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "catahoulagill"
    }, 
    {
        "content": "I guess he wants to make friends with the Hamus and Palistinians because he asked for over 23 million dollars to bring thousands of the palistine refugees to the U.S. and give them housing and food. Most of the Hamuas believe in killing infidels ( us )in suicide bombings and being muslims will naturally organize all Muslims and vote one way. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090308, 
        "postID": 54, 
        "quote": "", 
        "reply": "I guess he wants to make friends with the Hamus and Palistinians because he asked for over 23 million dollars to bring thousands of the palistine refugees to the U.S. and give them housing and food. Most of the Hamuas believe in killing infidels ( us )in suicide bombings and being muslims will naturally organize all Muslims and vote one way. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 11:05:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "EOCRon"
    }, 
    {
        "content": "quote: Originally posted by EOCRon: I guess he wants to make friends with the Hamus and Palistinians because he asked for over 23 million dollars to bring thousands of the palistine refugees to the U.S. and give them housing and food. Most of the Hamuas believe in killing infidels ( us )in suicide bombings and being muslims will naturally organize all Muslims and vote one way. Actually, it would be more accurate to say that he gave 23 million to bring in Martian refugee's from space. Didn't you see the movie, \"Mars Attacks?\" Your post comes from an equally truthful source. Dave", 
        "intTime": 20090308, 
        "postID": 55, 
        "quote": "Originally posted by EOCRon: I guess he wants to make friends with the Hamus and Palistinians because he asked for over 23 million dollars to bring thousands of the palistine refugees to the U.S. and give them housing and food. Most of the Hamuas believe in killing infidels ( us )in suicide bombings and being muslims will naturally organize all Muslims and vote one way.", 
        "reply": " Actually, it would be more accurate to say that he gave 23 million to bring in Martian refugee's from space. Didn't you see the movie, \"Mars Attacks?\" Your post comes from an equally truthful source. Dave", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 11:11:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "Grachus"
    }, 
    {
        "content": "Hey Dave, Maybe all we have to do is have Slim Whitman's \"Indian Love Call\" blaring out across Afganistan and their heads will blow up. Worked for the Martians. LOL", 
        "intTime": 20090308, 
        "postID": 56, 
        "quote": "", 
        "reply": "Hey Dave, Maybe all we have to do is have Slim Whitman's \"Indian Love Call\" blaring out across Afganistan and their heads will blow up. Worked for the Martians. LOL", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 11:28:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "BAGodbehere"
    }, 
    {
        "content": "quote: The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. Actually, Russia was doing quite well in A-stan until Reagan had the CIA fund, train and arm the Mujahadeen in the very same tactics now used against US and NATO troops now by the sons of these radicals in a very clear example of what goes around, comes around. And Dave, my source at the State department says these Palestinians are coming to America a couple hundred per week and getting housing and food stamps but no one is telling them how to act in the host country. The same thing happened with Somalis who came to the US now have sons return to fight against US interests and have made quite an enterprise in kidnapping and piracy with their knowledge learned in the US. Its quite useful for them to be able to make ransom demands in English.", 
        "intTime": 20090308, 
        "postID": 57, 
        "quote": "The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat.", 
        "reply": " Actually, Russia was doing quite well in A-stan until Reagan had the CIA fund, train and arm the Mujahadeen in the very same tactics now used against US and NATO troops now by the sons of these radicals in a very clear example of what goes around, comes around. And Dave, my source at the State department says these Palestinians are coming to America a couple hundred per week and getting housing and food stamps but no one is telling them how to act in the host country. The same thing happened with Somalis who came to the US now have sons return to fight against US interests and have made quite an enterprise in kidnapping and piracy with their knowledge learned in the US. Its quite useful for them to be able to make ransom demands in English.", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 11:32:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by BAGodbehere: Hey Dave, Maybe all we have to do is have Slim Whitman's \"Indian Love Call\" blaring out across Afganistan and their heads will blow up. Worked for the Martians. LOL I wish... I don't buy the concept of a \"moderate Taliban.\" Fine, all well and good to have an amnesty program for the low level soldiers. But I don't accept the idea that you can negotiate with \"moderate leaders.\" I don't believe in that idea at all. Certainly I have NO USE for the leaders we hand-picked to run Afghanistan. But that's another thread. Dave", 
        "intTime": 20090308, 
        "postID": 58, 
        "quote": "Originally posted by BAGodbehere: Hey Dave, Maybe all we have to do is have Slim Whitman's \"Indian Love Call\" blaring out across Afganistan and their heads will blow up. Worked for the Martians. LOL", 
        "reply": " I wish... I don't buy the concept of a \"moderate Taliban.\" Fine, all well and good to have an amnesty program for the low level soldiers. But I don't accept the idea that you can negotiate with \"moderate leaders.\" I don't believe in that idea at all. Certainly I have NO USE for the leaders we hand-picked to run Afghanistan. But that's another thread. Dave", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 11:32:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone! General David Petraeus said of Afghanistan recently: “You don’t kill or capture your way out of an industrial-strength insurgency.” So what is the answer, if not to talk to those who will fight for generations against the America forces? The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. After seven years of war, President Bush had no plan for victory in Afghanistan. So what should be President Obama’s plan that does not include talking to the enemy? The answer IS....GET THE FCK OUT OF AFGANISTAN!", 
        "intTime": 20090308, 
        "postID": 59, 
        "quote": "Originally posted by xerello: quote: Originally posted by Navy_Grunt: ***{http://hosted.ap.org/dynamic/stories/O/OBAMA_TALIBAN?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT}*** \"President Barack Obama says he hopes U.S. troops can identify moderate elements of the Taliban and move them toward reconciliation\" Sleep well everyone! General David Petraeus said of Afghanistan recently: “You don’t kill or capture your way out of an industrial-strength insurgency.” So what is the answer, if not to talk to those who will fight for generations against the America forces? The Russians had 100,000 plus troops in Afghanistan and used anti-insurgent tactics that American commanders would refuse to carry out, in the name of “do what has to be done.” They left in defeat. After seven years of war, President Bush had no plan for victory in Afghanistan. So what should be President Obama’s plan that does not include talking to the enemy?", 
        "reply": " The answer IS....GET THE FCK OUT OF AFGANISTAN!", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 11:51:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "EAG154"
    }, 
    {
        "content": "I guess I was wrong about him bringing the humas and palistinians here..He just gave them 20 million plus so they can rebuild so Isreal can blow them up again.. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "intTime": 20090308, 
        "postID": 60, 
        "quote": "", 
        "reply": "I guess I was wrong about him bringing the humas and palistinians here..He just gave them 20 million plus so they can rebuild so Isreal can blow them up again.. SEABEE'S \"CAN DO\", \"HAVE DONE\", AND WILL DO SO FOREVER. GOD BLESS AMERICA", 
        "threadID": "672198221_3060022712001", 
        "time": "2009-03-08 12:48:00", 
        "title": "Obama: US should reach out to Taliban moderates", 
        "userID": "EOCRon"
    }
]