[
    {
        "content": "\" President Obama's authorization of Saturday's hostage rescue of Captain Richard Phillips, and the justified killing of three Somali pirates by Navy SEAL sharpshooters, took real courage and was certainly the right decision. Anything less, and his administration would have been second-guessed and the military high command would have been left to wonder what kind of man was leading our nation and our military. A brave American hero's life was at stake, and the president and the Navy made the right decisions. There are, and will be, many things our new president and I will disagree on. But so far, I applaud what he has done regarding our armed services.\" More at: ***http://www.cnn.com/2009/POLITICS/04/14/rollins.rescue/index.html***", 
        "intTime": 20090414, 
        "postID": 1, 
        "quote": "", 
        "reply": "\" President Obama's authorization of Saturday's hostage rescue of Captain Richard Phillips, and the justified killing of three Somali pirates by Navy SEAL sharpshooters, took real courage and was certainly the right decision. Anything less, and his administration would have been second-guessed and the military high command would have been left to wonder what kind of man was leading our nation and our military. A brave American hero's life was at stake, and the president and the Navy made the right decisions. There are, and will be, many things our new president and I will disagree on. But so far, I applaud what he has done regarding our armed services.\" More at: ***http://www.cnn.com/2009/POLITICS/04/14/rollins.rescue/index.html***", 
        "threadID": "672198221_6010096022001", 
        "time": "2009-04-14 08:28:00", 
        "title": "Ed Rollins: Obama Made Right Call On Rescue", 
        "userID": "Motive25"
    }, 
    {
        "content": "You and the other threads on here have stated that several times. Many have agreed. Shall we see more threads this week stating the same thing over and over again? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090414, 
        "postID": 2, 
        "quote": "", 
        "reply": "You and the other threads on here have stated that several times. Many have agreed. Shall we see more threads this week stating the same thing over and over again? \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6010096022001", 
        "time": "2009-04-14 08:31:00", 
        "title": "Ed Rollins: Obama Made Right Call On Rescue", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Anything less, and his administration would have been second-guessed and the military high command would have been left to wonder what kind of man was leading our nation and our military Cliff Notes: No Brainer.", 
        "intTime": 20090414, 
        "postID": 3, 
        "quote": "Anything less, and his administration would have been second-guessed and the military high command would have been left to wonder what kind of man was leading our nation and our military", 
        "reply": " Cliff Notes: No Brainer.", 
        "threadID": "672198221_6010096022001", 
        "time": "2009-04-14 08:40:00", 
        "title": "Ed Rollins: Obama Made Right Call On Rescue", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "While I agree with the majority of this article and most of the articles like it I'd probably stop short of saying that this decision \"took real courage\". It was the logical thing to do; I guess I just expect these kinds of decisions from our leadership/", 
        "intTime": 20090414, 
        "postID": 4, 
        "quote": "", 
        "reply": "While I agree with the majority of this article and most of the articles like it I'd probably stop short of saying that this decision \"took real courage\". It was the logical thing to do; I guess I just expect these kinds of decisions from our leadership/", 
        "threadID": "672198221_6010096022001", 
        "time": "2009-04-14 08:49:00", 
        "title": "Ed Rollins: Obama Made Right Call On Rescue", 
        "userID": "foxred03"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: You and the other threads on here have stated that several times. Many have agreed. Shall we see more threads this week stating the same thing over and over again? IMO, what was said is not nearly as important as who said it.", 
        "intTime": 20090414, 
        "postID": 5, 
        "quote": "Originally posted by Anbar7: You and the other threads on here have stated that several times. Many have agreed. Shall we see more threads this week stating the same thing over and over again?", 
        "reply": " IMO, what was said is not nearly as important as who said it.", 
        "threadID": "672198221_6010096022001", 
        "time": "2009-04-14 09:08:00", 
        "title": "Ed Rollins: Obama Made Right Call On Rescue", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Motive25: quote: Originally posted by Anbar7: You and the other threads on here have stated that several times. Many have agreed. Shall we see more threads this week stating the same thing over and over again? IMO, what was said is not nearly as important as who said it. IMO, maybe everyone is making a big deal of it because he is an empty suit no experience guy. So him just tying his shoes everyday is news to them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090414, 
        "postID": 6, 
        "quote": "Originally posted by Motive25: quote: Originally posted by Anbar7: You and the other threads on here have stated that several times. Many have agreed. Shall we see more threads this week stating the same thing over and over again? IMO, what was said is not nearly as important as who said it.", 
        "reply": " IMO, maybe everyone is making a big deal of it because he is an empty suit no experience guy. So him just tying his shoes everyday is news to them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6010096022001", 
        "time": "2009-04-14 09:09:00", 
        "title": "Ed Rollins: Obama Made Right Call On Rescue", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: So him just tying his shoes everyday is news to them. Wait! When did this discussion switch to Bush II? \"There are no fair winds for a rudderless ship.\" Hopley Yeaton, Revenue Cutter Service", 
        "intTime": 20090414, 
        "postID": 7, 
        "quote": "So him just tying his shoes everyday is news to them.", 
        "reply": " Wait! When did this discussion switch to Bush II? \"There are no fair winds for a rudderless ship.\" Hopley Yeaton, Revenue Cutter Service", 
        "threadID": "672198221_6010096022001", 
        "time": "2009-04-14 10:11:00", 
        "title": "Ed Rollins: Obama Made Right Call On Rescue", 
        "userID": "downeastah"
    }, 
    {
        "content": "I wonder if it will be news everytime the POTUS signs a bill, authorizes a military operation, or in any other way does his J. O. B. Every President before President Obama had to make these type of decisions all of the time and they were not reported on. Based off of the news reporting on this event, you would think the POTUS pulled the trigger himself. I thought \"transperancy\" meant that we would be able to read bills before they were voted on, not something that is bordering on a \"reality show\" of the Obama Presidency.", 
        "intTime": 20090414, 
        "postID": 8, 
        "quote": "", 
        "reply": "I wonder if it will be news everytime the POTUS signs a bill, authorizes a military operation, or in any other way does his J. O. B. Every President before President Obama had to make these type of decisions all of the time and they were not reported on. Based off of the news reporting on this event, you would think the POTUS pulled the trigger himself. I thought \"transperancy\" meant that we would be able to read bills before they were voted on, not something that is bordering on a \"reality show\" of the Obama Presidency.", 
        "threadID": "672198221_6010096022001", 
        "time": "2009-04-14 10:11:00", 
        "title": "Ed Rollins: Obama Made Right Call On Rescue", 
        "userID": "stec74"
    }, 
    {
        "content": "Obama did ZIP!!! He gave the only order he could under the circumstances!", 
        "intTime": 20090414, 
        "postID": 9, 
        "quote": "", 
        "reply": "Obama did ZIP!!! He gave the only order he could under the circumstances!", 
        "threadID": "672198221_6010096022001", 
        "time": "2009-04-14 10:32:00", 
        "title": "Ed Rollins: Obama Made Right Call On Rescue", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by stec74: I wonder if it will be news everytime the POTUS signs a bill, authorizes a military operation, or in any other way does his J. O. B. Every President before President Obama had to make these type of decisions all of the time and they were not reported on. Based off of the news reporting on this event, you would think the POTUS pulled the trigger himself. I thought \"transperancy\" meant that we would be able to read bills before they were voted on, not something that is bordering on a \"reality show\" of the Obama Presidency. News Flash Stec - Everytime a President is involved in such a \"Public Story,\" it's going to be covered down to what color shoes he was wearing. Remember Carter and the Hostage crisis in Iran? The press (rightfully in my opinion) wasn't kind to Carter. The Conservative Media is more concerned about \"Spectacle\" then politics. And this story is the stuff of future movies. Dave", 
        "intTime": 20090414, 
        "postID": 10, 
        "quote": "Originally posted by stec74: I wonder if it will be news everytime the POTUS signs a bill, authorizes a military operation, or in any other way does his J. O. B. Every President before President Obama had to make these type of decisions all of the time and they were not reported on. Based off of the news reporting on this event, you would think the POTUS pulled the trigger himself. I thought \"transperancy\" meant that we would be able to read bills before they were voted on, not something that is bordering on a \"reality show\" of the Obama Presidency.", 
        "reply": " News Flash Stec - Everytime a President is involved in such a \"Public Story,\" it's going to be covered down to what color shoes he was wearing. Remember Carter and the Hostage crisis in Iran? The press (rightfully in my opinion) wasn't kind to Carter. The Conservative Media is more concerned about \"Spectacle\" then politics. And this story is the stuff of future movies. Dave", 
        "threadID": "672198221_6010096022001", 
        "time": "2009-04-14 11:57:00", 
        "title": "Ed Rollins: Obama Made Right Call On Rescue", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: The Conservative Media is more concerned about \"Spectacle\" then politics. And this story is the stuff of future movies. Dave I vote for Sean Penn playing the role of President Obama. With a cameo by Phil Donahue as VP Biden.", 
        "intTime": 20090414, 
        "postID": 11, 
        "quote": "Originally posted by Grachus: The Conservative Media is more concerned about \"Spectacle\" then politics. And this story is the stuff of future movies. Dave", 
        "reply": " I vote for Sean Penn playing the role of President Obama. With a cameo by Phil Donahue as VP Biden.", 
        "threadID": "672198221_6010096022001", 
        "time": "2009-04-14 12:41:00", 
        "title": "Ed Rollins: Obama Made Right Call On Rescue", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Grachus: The Conservative Media is more concerned about \"Spectacle\" then politics. And this story is the stuff of future movies. Dave I vote for Sean Penn playing the role of President Obama. With a cameo by Phil Donahue as VP Biden. I think Rush Limbaugh would make a perfect Pirate Chief. No man has the fine art of a rant down more than him. And considering his belief that these pirates are allied to Al Qaeda, I think he could do a great job of \"connecting the dots.\" Heck, he can write the script. Maybe it can start off in some dank cave in Pakistan, with a myopic bin Laden telling Al Zwaheri to \"lighten up on the Islam thing, I'm running low on cash. Set up the boys in Somali to raise us some funds.\" It's be great! Obama can be played by Pat Boone, looking confused, and constantly asking, \"Where is Somalia anyway? Didn't Bush handle this five years ago? Why me? I just got a new dog!\" Dave", 
        "intTime": 20090414, 
        "postID": 12, 
        "quote": "Originally posted by stec74: quote: Originally posted by Grachus: The Conservative Media is more concerned about \"Spectacle\" then politics. And this story is the stuff of future movies. Dave I vote for Sean Penn playing the role of President Obama. With a cameo by Phil Donahue as VP Biden.", 
        "reply": " I think Rush Limbaugh would make a perfect Pirate Chief. No man has the fine art of a rant down more than him. And considering his belief that these pirates are allied to Al Qaeda, I think he could do a great job of \"connecting the dots.\" Heck, he can write the script. Maybe it can start off in some dank cave in Pakistan, with a myopic bin Laden telling Al Zwaheri to \"lighten up on the Islam thing, I'm running low on cash. Set up the boys in Somali to raise us some funds.\" It's be great! Obama can be played by Pat Boone, looking confused, and constantly asking, \"Where is Somalia anyway? Didn't Bush handle this five years ago? Why me? I just got a new dog!\" Dave", 
        "threadID": "672198221_6010096022001", 
        "time": "2009-04-14 13:00:00", 
        "title": "Ed Rollins: Obama Made Right Call On Rescue", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by stec74: I wonder if it will be news everytime the POTUS signs a bill, authorizes a military operation, or in any other way does his J. O. B. Every President before President Obama had to make these type of decisions all of the time and they were not reported on. Based off of the news reporting on this event, you would think the POTUS pulled the trigger himself. I thought \"transperancy\" meant that we would be able to read bills before they were voted on, not something that is bordering on a \"reality show\" of the Obama Presidency. News Flash Stec - Everytime a President is involved in such a \"Public Story,\" it's going to be covered down to what color shoes he was wearing. Remember Carter and the Hostage crisis in Iran? The press (rightfully in my opinion) wasn't kind to Carter. The Conservative Media is more concerned about \"Spectacle\" then politics. And this story is the stuff of future movies. Dave there is no conservative media!", 
        "intTime": 20090414, 
        "postID": 13, 
        "quote": "Originally posted by Grachus: quote: Originally posted by stec74: I wonder if it will be news everytime the POTUS signs a bill, authorizes a military operation, or in any other way does his J. O. B. Every President before President Obama had to make these type of decisions all of the time and they were not reported on. Based off of the news reporting on this event, you would think the POTUS pulled the trigger himself. I thought \"transperancy\" meant that we would be able to read bills before they were voted on, not something that is bordering on a \"reality show\" of the Obama Presidency. News Flash Stec - Everytime a President is involved in such a \"Public Story,\" it's going to be covered down to what color shoes he was wearing. Remember Carter and the Hostage crisis in Iran? The press (rightfully in my opinion) wasn't kind to Carter. The Conservative Media is more concerned about \"Spectacle\" then politics. And this story is the stuff of future movies. Dave", 
        "reply": " there is no conservative media!", 
        "threadID": "672198221_6010096022001", 
        "time": "2009-04-14 13:05:00", 
        "title": "Ed Rollins: Obama Made Right Call On Rescue", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: The Conservative Media is more concerned about \"Spectacle\" then politics. And this story is the stuff of future movies. Dave I vote for Sean Penn playing the role of President Obama. With a cameo by Phil Donahue as VP Biden. I think Rush Limbaugh would make a perfect Pirate Chief. No man has the fine art of a rant down more than him. And considering his belief that these pirates are allied to Al Qaeda, I think he could do a great job of \"connecting the dots.\" Heck, he can write the script. Maybe it can start off in some dank cave in Pakistan, with a myopic bin Laden telling Al Zwaheri to \"lighten up on the Islam thing, I'm running low on cash. Set up the boys in Somali to raise us some funds.\" It's be great! Obama can be played by Pat Boone, looking confused, and constantly asking, \"Where is Somalia anyway? Didn't Bush handle this five years ago? Why me? I just got a new dog!\" Dave Unfortunatly, Rush doesn't have the box office draw potential that the POTUS would obviously be looking for. In order to keep his core demographic happy, President Obama would probably hire the entire cast from \"Pirates of the Caribbean\" to play the pirates. Especially since that is what most of his younger demographic probably figure the \"pirates\" look like anyway.", 
        "intTime": 20090414, 
        "postID": 14, 
        "quote": "Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: The Conservative Media is more concerned about \"Spectacle\" then politics. And this story is the stuff of future movies. Dave I vote for Sean Penn playing the role of President Obama. With a cameo by Phil Donahue as VP Biden. I think Rush Limbaugh would make a perfect Pirate Chief. No man has the fine art of a rant down more than him. And considering his belief that these pirates are allied to Al Qaeda, I think he could do a great job of \"connecting the dots.\" Heck, he can write the script. Maybe it can start off in some dank cave in Pakistan, with a myopic bin Laden telling Al Zwaheri to \"lighten up on the Islam thing, I'm running low on cash. Set up the boys in Somali to raise us some funds.\" It's be great! Obama can be played by Pat Boone, looking confused, and constantly asking, \"Where is Somalia anyway? Didn't Bush handle this five years ago? Why me? I just got a new dog!\" Dave", 
        "reply": " Unfortunatly, Rush doesn't have the box office draw potential that the POTUS would obviously be looking for. In order to keep his core demographic happy, President Obama would probably hire the entire cast from \"Pirates of the Caribbean\" to play the pirates. Especially since that is what most of his younger demographic probably figure the \"pirates\" look like anyway.", 
        "threadID": "672198221_6010096022001", 
        "time": "2009-04-14 13:18:00", 
        "title": "Ed Rollins: Obama Made Right Call On Rescue", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: The Conservative Media is more concerned about \"Spectacle\" then politics. And this story is the stuff of future movies. Dave I vote for Sean Penn playing the role of President Obama. With a cameo by Phil Donahue as VP Biden. I think Rush Limbaugh would make a perfect Pirate Chief. No man has the fine art of a rant down more than him. And considering his belief that these pirates are allied to Al Qaeda, I think he could do a great job of \"connecting the dots.\" Heck, he can write the script. Maybe it can start off in some dank cave in Pakistan, with a myopic bin Laden telling Al Zwaheri to \"lighten up on the Islam thing, I'm running low on cash. Set up the boys in Somali to raise us some funds.\" It's be great! Obama can be played by Pat Boone, looking confused, and constantly asking, \"Where is Somalia anyway? Didn't Bush handle this five years ago? Why me? I just got a new dog!\" Dave Unfortunatly, Rush doesn't have the box office draw potential that the POTUS would obviously be looking for. In order to keep his core demographic happy, President Obama would probably hire the entire cast from \"Pirates of the Caribbean\" to play the pirates. Especially since that is what most of his younger demographic probably figure the \"pirates\" look like anyway. You have a point, and besides, Rush would have to go on a diet. Cheney however would make a convincing Al Zwaheri. Dave", 
        "intTime": 20090414, 
        "postID": 15, 
        "quote": "Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by stec74: quote: Originally posted by Grachus: The Conservative Media is more concerned about \"Spectacle\" then politics. And this story is the stuff of future movies. Dave I vote for Sean Penn playing the role of President Obama. With a cameo by Phil Donahue as VP Biden. I think Rush Limbaugh would make a perfect Pirate Chief. No man has the fine art of a rant down more than him. And considering his belief that these pirates are allied to Al Qaeda, I think he could do a great job of \"connecting the dots.\" Heck, he can write the script. Maybe it can start off in some dank cave in Pakistan, with a myopic bin Laden telling Al Zwaheri to \"lighten up on the Islam thing, I'm running low on cash. Set up the boys in Somali to raise us some funds.\" It's be great! Obama can be played by Pat Boone, looking confused, and constantly asking, \"Where is Somalia anyway? Didn't Bush handle this five years ago? Why me? I just got a new dog!\" Dave Unfortunatly, Rush doesn't have the box office draw potential that the POTUS would obviously be looking for. In order to keep his core demographic happy, President Obama would probably hire the entire cast from \"Pirates of the Caribbean\" to play the pirates. Especially since that is what most of his younger demographic probably figure the \"pirates\" look like anyway.", 
        "reply": " You have a point, and besides, Rush would have to go on a diet. Cheney however would make a convincing Al Zwaheri. Dave", 
        "threadID": "672198221_6010096022001", 
        "time": "2009-04-14 14:06:00", 
        "title": "Ed Rollins: Obama Made Right Call On Rescue", 
        "userID": "Grachus"
    }, 
    {
        "content": "And yet Obama is still a jerkoff! C.R.", 
        "intTime": 20090414, 
        "postID": 16, 
        "quote": "", 
        "reply": "And yet Obama is still a jerkoff! C.R.", 
        "threadID": "672198221_6010096022001", 
        "time": "2009-04-14 14:11:00", 
        "title": "Ed Rollins: Obama Made Right Call On Rescue", 
        "userID": "CYCLIC_RUNAWAY"
    }
]