[
    {
        "content": "RE: http://www.military.com/forums/0,15240,187671,00.html The article does mention that the ground opration was spearheaded by British soldiers. A nd very succesfully I might add, including avoiding a possible conflict with Russia when Wes Clark was told that Gen Jackson (British) would not start the third '****ing' war for him.", 
        "intTime": 20090503, 
        "postID": 1, 
        "quote": "", 
        "reply": "RE: http://www.military.com/forums/0,15240,187671,00.html The article does mention that the ground opration was spearheaded by British soldiers. A nd very succesfully I might add, including avoiding a possible conflict with Russia when Wes Clark was told that Gen Jackson (British) would not start the third '****ing' war for him.", 
        "threadID": "672198221_3490093222001", 
        "time": "2009-05-03 13:36:00", 
        "title": "Kosovo Revisited", 
        "userID": "redcoat72"
    }, 
    {
        "content": "quote: Originally posted by redcoat72: RE: http://www.military.com/forums/0,15240,187671,00.html The article does mention that the ground opration was spearheaded by British soldiers. A nd very succesfully I might add, including avoiding a possible conflict with Russia when Wes Clark was told that Gen Jackson (British) would not start the third '****ing' war for him. \"Thank you for our Freedom\" That meeting must have been a cinematographic moment. The general should be careful with the personal contact. Somebody might just be biding their time. Memories are long in the Balkans; 'forgiveness' and 'understanding' aren't big on the national traits list. Or maybe somebody just didn't get a close look at his dead sister.", 
        "intTime": 20090503, 
        "postID": 2, 
        "quote": "Originally posted by redcoat72: RE: http://www.military.com/forums/0,15240,187671,00.html The article does mention that the ground opration was spearheaded by British soldiers. A nd very succesfully I might add, including avoiding a possible conflict with Russia when Wes Clark was told that Gen Jackson (British) would not start the third '****ing' war for him.", 
        "reply": " \"Thank you for our Freedom\" That meeting must have been a cinematographic moment. The general should be careful with the personal contact. Somebody might just be biding their time. Memories are long in the Balkans; 'forgiveness' and 'understanding' aren't big on the national traits list. Or maybe somebody just didn't get a close look at his dead sister.", 
        "threadID": "672198221_3490093222001", 
        "time": "2009-05-03 14:08:00", 
        "title": "Kosovo Revisited", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by redcoat72: RE: http://www.military.com/forums/0,15240,187671,00.html The article does mention that the ground opration was spearheaded by British soldiers. A nd very succesfully I might add, including avoiding a possible conflict with Russia when Wes Clark was told that Gen Jackson (British) would not start the third '****ing' war for him. A shameful episode in our history. Clinton should have been impeached over this matter. Dave", 
        "intTime": 20090503, 
        "postID": 3, 
        "quote": "Originally posted by redcoat72: RE: http://www.military.com/forums/0,15240,187671,00.html The article does mention that the ground opration was spearheaded by British soldiers. A nd very succesfully I might add, including avoiding a possible conflict with Russia when Wes Clark was told that Gen Jackson (British) would not start the third '****ing' war for him.", 
        "reply": " A shameful episode in our history. Clinton should have been impeached over this matter. Dave", 
        "threadID": "672198221_3490093222001", 
        "time": "2009-05-03 14:12:00", 
        "title": "Kosovo Revisited", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by redcoat72: RE: http://www.military.com/forums/0,15240,187671,00.html The article does mention that the ground opration was spearheaded by British soldiers. A nd very succesfully I might add, including avoiding a possible conflict with Russia when Wes Clark was told that Gen Jackson (British) would not start the third '****ing' war for him. A shameful episode in our history. Clinton should have been impeached over this matter. Dave At the very least! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090503, 
        "postID": 4, 
        "quote": "Originally posted by Grachus: quote: Originally posted by redcoat72: RE: http://www.military.com/forums/0,15240,187671,00.html The article does mention that the ground opration was spearheaded by British soldiers. A nd very succesfully I might add, including avoiding a possible conflict with Russia when Wes Clark was told that Gen Jackson (British) would not start the third '****ing' war for him. A shameful episode in our history. Clinton should have been impeached over this matter. Dave", 
        "reply": " At the very least! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3490093222001", 
        "time": "2009-05-03 14:33:00", 
        "title": "Kosovo Revisited", 
        "userID": "NSNN"
    }, 
    {
        "content": "Oh yes? And what do you two propose should have been done?", 
        "intTime": 20090503, 
        "postID": 5, 
        "quote": "", 
        "reply": "Oh yes? And what do you two propose should have been done?", 
        "threadID": "672198221_3490093222001", 
        "time": "2009-05-03 15:18:00", 
        "title": "Kosovo Revisited", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: Oh yes? And what do you two propose should have been done? The organised and well financed operatation to destroy Yugoslavia was completely successful. History began, according to Clinton apologists, when the Yugoslavs suspended the autonomous government of Kossovo. Not bothering to mention that the local Serb population was the victim of systamatic ethnic cleansing, reducing their population from over 300,000 to 125 thousand. Then of course there was the \"heroic\" Bosnians who only wanted self determination, which is why 40 percent of the population decided that they were the only part of the population that counted. And congratulations the scheme worked like a charm. The Fascists of Kossovo, murdering and burning Serbs out of their homes became \"victims of cruel oppresion,\" and the Bosnians were granted their right of self determination over the 60 percent of the population that opposed them. And Yugoslavia with it's rich mineral resources, powerful army, became a bunch of tiny little States that can be safely exploited without a worry. Milosovic of course, as we know, a \"Hitler in embryo,\" and of course had to be stopped before he conquered the world. Heck, Milosovic was perfect for the job, and Clinton and the Germans would have had to invent him, if he wasn't conveniently at hand. Dave", 
        "intTime": 20090503, 
        "postID": 6, 
        "quote": "Originally posted by Bladensburg: Oh yes? And what do you two propose should have been done?", 
        "reply": " The organised and well financed operatation to destroy Yugoslavia was completely successful. History began, according to Clinton apologists, when the Yugoslavs suspended the autonomous government of Kossovo. Not bothering to mention that the local Serb population was the victim of systamatic ethnic cleansing, reducing their population from over 300,000 to 125 thousand. Then of course there was the \"heroic\" Bosnians who only wanted self determination, which is why 40 percent of the population decided that they were the only part of the population that counted. And congratulations the scheme worked like a charm. The Fascists of Kossovo, murdering and burning Serbs out of their homes became \"victims of cruel oppresion,\" and the Bosnians were granted their right of self determination over the 60 percent of the population that opposed them. And Yugoslavia with it's rich mineral resources, powerful army, became a bunch of tiny little States that can be safely exploited without a worry. Milosovic of course, as we know, a \"Hitler in embryo,\" and of course had to be stopped before he conquered the world. Heck, Milosovic was perfect for the job, and Clinton and the Germans would have had to invent him, if he wasn't conveniently at hand. Dave", 
        "threadID": "672198221_3490093222001", 
        "time": "2009-05-03 15:39:00", 
        "title": "Kosovo Revisited", 
        "userID": "Grachus"
    }, 
    {
        "content": "That wasn't what I asked. As of 1999 what do you propose should have been done?", 
        "intTime": 20090503, 
        "postID": 7, 
        "quote": "", 
        "reply": "That wasn't what I asked. As of 1999 what do you propose should have been done?", 
        "threadID": "672198221_3490093222001", 
        "time": "2009-05-03 17:33:00", 
        "title": "Kosovo Revisited", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: That wasn't what I asked. As of 1999 what do you propose should have been done? Come again? You mean we misunderstood your perfectly clear question? Maybe we should have rectified all the injustices that we did in Yugoslavia? Let's take the Dayton Accords, an official treaty ratified by the Senate and signed by the President. Well, that treaty states that Kossovo is an integral part of Yugoslavia. Seems to me we just violated that treaty. And the Serb population is now down to around 50,000 - Should we allow them to be finished off? FOr thier own good of course? Just what do you mean by what we should do, \"since 1999?\" Is that some sort of special date? Some sort of symbolism that I've missed? Is it the sign of Satan plus one, if turned upside down? Dave", 
        "intTime": 20090503, 
        "postID": 8, 
        "quote": "Originally posted by Bladensburg: That wasn't what I asked. As of 1999 what do you propose should have been done?", 
        "reply": " Come again? You mean we misunderstood your perfectly clear question? Maybe we should have rectified all the injustices that we did in Yugoslavia? Let's take the Dayton Accords, an official treaty ratified by the Senate and signed by the President. Well, that treaty states that Kossovo is an integral part of Yugoslavia. Seems to me we just violated that treaty. And the Serb population is now down to around 50,000 - Should we allow them to be finished off? FOr thier own good of course? Just what do you mean by what we should do, \"since 1999?\" Is that some sort of special date? Some sort of symbolism that I've missed? Is it the sign of Satan plus one, if turned upside down? Dave", 
        "threadID": "672198221_3490093222001", 
        "time": "2009-05-03 17:48:00", 
        "title": "Kosovo Revisited", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: That wasn't what I asked. As of 1999 what do you propose should have been done? Done about what? What exactly do you think was going on in Serbia/Kosovo in 1999? Also, have you read the Rambouillet agreement? That’s what we demanded that the Serbs agree to prior to bombing in 99! It literally mirrors the Austro-Hungarian July Ultimatum, and we already knew how Serbs responded to that one! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090503, 
        "postID": 9, 
        "quote": "Originally posted by Bladensburg: That wasn't what I asked. As of 1999 what do you propose should have been done?", 
        "reply": " Done about what? What exactly do you think was going on in Serbia/Kosovo in 1999? Also, have you read the Rambouillet agreement? That’s what we demanded that the Serbs agree to prior to bombing in 99! It literally mirrors the Austro-Hungarian July Ultimatum, and we already knew how Serbs responded to that one! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3490093222001", 
        "time": "2009-05-03 18:27:00", 
        "title": "Kosovo Revisited", 
        "userID": "NSNN"
    }, 
    {
        "content": "Lets face it no-one (politically speaking) came out of these nasty little wars covered in glory. One lesson that should have been learned is for the International community not to recognise the Independance of 'breakaway republics' at the drop of a hat, and without International mediation. Memories are long in the Balkans.", 
        "intTime": 20090503, 
        "postID": 10, 
        "quote": "", 
        "reply": "Lets face it no-one (politically speaking) came out of these nasty little wars covered in glory. One lesson that should have been learned is for the International community not to recognise the Independance of 'breakaway republics' at the drop of a hat, and without International mediation. Memories are long in the Balkans.", 
        "threadID": "672198221_3490093222001", 
        "time": "2009-05-03 23:28:00", 
        "title": "Kosovo Revisited", 
        "userID": "redcoat72"
    }, 
    {
        "content": "quote: AI: Who will judge NATO's crimes? BELGRADE -- An Amnesty International representative says this organization is \"seeking mechanisms\" so that NATO is tried for the crimes committed in Serbia and Afghanistan. Sian Jones told Belgrade daily Politika that AI “is looking go mechanisms for NATO to answer for their crimes, because no world organization currently has jurisdiction over the most powerful military alliance on the planet.” “We will continue to put pressure on NATO, because over the last ten years there has been clear proof that in 1999, during the bombing of Yugoslavia, there was a violation of human rights,” Jones said. AI stated in its 2002 report that the NATO bombing of Radio Television Serbia, RTS, in which 16 people were killed, should be seen as a war crime and a serious violation of international humanitarian law. (....) +http://www.b92.net/eng/news/crimes-article.php?yyyy=2009&mm=05&dd=04&nav_id=58919 +http://www.amnesty.org/en/for-media/press-releases/serbia-impunity-nato-%E2%80%93-ten-years-after-operation-allied-force-20090423 +http://www.lasvegassun.com/news/2009/apr/23/amnesty-nato-bombing-of-serbian-tv-war-crime/ \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090504, 
        "postID": 11, 
        "quote": "AI: Who will judge NATO's crimes? BELGRADE -- An Amnesty International representative says this organization is \"seeking mechanisms\" so that NATO is tried for the crimes committed in Serbia and Afghanistan. Sian Jones told Belgrade daily Politika that AI “is looking go mechanisms for NATO to answer for their crimes, because no world organization currently has jurisdiction over the most powerful military alliance on the planet.” “We will continue to put pressure on NATO, because over the last ten years there has been clear proof that in 1999, during the bombing of Yugoslavia, there was a violation of human rights,” Jones said. AI stated in its 2002 report that the NATO bombing of Radio Television Serbia, RTS, in which 16 people were killed, should be seen as a war crime and a serious violation of international humanitarian law. (....)", 
        "reply": " +http://www.b92.net/eng/news/crimes-article.php?yyyy=2009&mm=05&dd=04&nav_id=58919 +http://www.amnesty.org/en/for-media/press-releases/serbia-impunity-nato-%E2%80%93-ten-years-after-operation-allied-force-20090423 +http://www.lasvegassun.com/news/2009/apr/23/amnesty-nato-bombing-of-serbian-tv-war-crime/ \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3490093222001", 
        "time": "2009-05-04 03:43:00", 
        "title": "Kosovo Revisited", 
        "userID": "NSNN"
    }, 
    {
        "content": "What I mean is do you think the West and NATO should have let Arkan's mates(and I suspect that whatever the Serb police alleged to be were doing it was pretty tame compared to the militias) and the KLA (an equally nasty bunch of lads) just crack on as they were and end up with another (smaller but more vicious) Bosnia, only this time with the potential to openly draw a third party, Albania, in. Or do you have another alternative. For my part I always thought the thing was a bit engineered, not least because the ceasefire that the Serbs eventually signed was very much watered down from that pre-war ultimatum. Very odd, particularly because the whole cock-up further fed that idiotic Slavic pride and meant that any sort of rapprochement between Belgrade and Kosovo was impossible, even when Milosevic was gone and they could have started with a clean sheet. Instead Europe is lumbered with another ridiculously small and poor statelet. What makes it even stranger is that there was a rush to recognise Kosovo when are actually reasonably viable breakaway states like Somaliland that the international community fails to recognise.", 
        "intTime": 20090504, 
        "postID": 12, 
        "quote": "", 
        "reply": "What I mean is do you think the West and NATO should have let Arkan's mates(and I suspect that whatever the Serb police alleged to be were doing it was pretty tame compared to the militias) and the KLA (an equally nasty bunch of lads) just crack on as they were and end up with another (smaller but more vicious) Bosnia, only this time with the potential to openly draw a third party, Albania, in. Or do you have another alternative. For my part I always thought the thing was a bit engineered, not least because the ceasefire that the Serbs eventually signed was very much watered down from that pre-war ultimatum. Very odd, particularly because the whole cock-up further fed that idiotic Slavic pride and meant that any sort of rapprochement between Belgrade and Kosovo was impossible, even when Milosevic was gone and they could have started with a clean sheet. Instead Europe is lumbered with another ridiculously small and poor statelet. What makes it even stranger is that there was a rush to recognise Kosovo when are actually reasonably viable breakaway states like Somaliland that the international community fails to recognise.", 
        "threadID": "672198221_3490093222001", 
        "time": "2009-05-04 11:21:00", 
        "title": "Kosovo Revisited", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by Bladensburg: What I mean is do you think the West and NATO should have let Arkan's mates(and I suspect that whatever the Serb police alleged to be were doing it was pretty tame compared to the militias) and the KLA (an equally nasty bunch of lads) just crack on as they were and end up with another (smaller but more vicious) Bosnia, only this time with the potential to openly draw a third party, Albania, in. Or do you have another alternative. For my part I always thought the thing was a bit engineered, not least because the ceasefire that the Serbs eventually signed was very much watered down from that pre-war ultimatum. Very odd, particularly because the whole cock-up further fed that idiotic Slavic pride and meant that any sort of rapprochement between Belgrade and Kosovo was impossible, even when Milosevic was gone and they could have started with a clean sheet. Instead Europe is lumbered with another ridiculously small and poor statelet. What makes it even stranger is that there was a rush to recognise Kosovo when are actually reasonably viable breakaway states like Somaliland that the international community fails to recognise. Serbia was fighting separatists & terrorists (domestic & foreign)! Were their actions somewhat heavy handed, sure, but not unreasonable or unexpected. Milosevic actually agreed on international presence in Kosovo, apparently he was sure he had nothing to worry about and ethnic cleansing was a myth at this point....we on the other hand demanded full military access to the entire area of Yugoslavia (including Serbia & Montenegro)although those areas had nothing to do with the supposed crimes! As far as a fresh start after Milosevic……it was never going to happen…….Ethnic cleansing of non-Albanians and destruction of Serbian property (including centuries old monasteries) continued unabated for years after the bombing & NATO supposed peacekeeping mission. Also, add the fact that newly “elected” Kosovo officials were nearly all former members of KLA! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090504, 
        "postID": 13, 
        "quote": "Originally posted by Bladensburg: What I mean is do you think the West and NATO should have let Arkan's mates(and I suspect that whatever the Serb police alleged to be were doing it was pretty tame compared to the militias) and the KLA (an equally nasty bunch of lads) just crack on as they were and end up with another (smaller but more vicious) Bosnia, only this time with the potential to openly draw a third party, Albania, in. Or do you have another alternative. For my part I always thought the thing was a bit engineered, not least because the ceasefire that the Serbs eventually signed was very much watered down from that pre-war ultimatum. Very odd, particularly because the whole cock-up further fed that idiotic Slavic pride and meant that any sort of rapprochement between Belgrade and Kosovo was impossible, even when Milosevic was gone and they could have started with a clean sheet. Instead Europe is lumbered with another ridiculously small and poor statelet. What makes it even stranger is that there was a rush to recognise Kosovo when are actually reasonably viable breakaway states like Somaliland that the international community fails to recognise.", 
        "reply": " Serbia was fighting separatists & terrorists (domestic & foreign)! Were their actions somewhat heavy handed, sure, but not unreasonable or unexpected. Milosevic actually agreed on international presence in Kosovo, apparently he was sure he had nothing to worry about and ethnic cleansing was a myth at this point....we on the other hand demanded full military access to the entire area of Yugoslavia (including Serbia & Montenegro)although those areas had nothing to do with the supposed crimes! As far as a fresh start after Milosevic……it was never going to happen…….Ethnic cleansing of non-Albanians and destruction of Serbian property (including centuries old monasteries) continued unabated for years after the bombing & NATO supposed peacekeeping mission. Also, add the fact that newly “elected” Kosovo officials were nearly all former members of KLA! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3490093222001", 
        "time": "2009-05-04 12:08:00", 
        "title": "Kosovo Revisited", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Bladensburg: What I mean is do you think the West and NATO should have let Arkan's mates(and I suspect that whatever the Serb police alleged to be were doing it was pretty tame compared to the militias) and the KLA (an equally nasty bunch of lads) just crack on as they were and end up with another (smaller but more vicious) Bosnia, only this time with the potential to openly draw a third party, Albania, in. Or do you have another alternative. For my part I always thought the thing was a bit engineered, not least because the ceasefire that the Serbs eventually signed was very much watered down from that pre-war ultimatum. Very odd, particularly because the whole cock-up further fed that idiotic Slavic pride and meant that any sort of rapprochement between Belgrade and Kosovo was impossible, even when Milosevic was gone and they could have started with a clean sheet. Instead Europe is lumbered with another ridiculously small and poor statelet. What makes it even stranger is that there was a rush to recognise Kosovo when are actually reasonably viable breakaway states like Somaliland that the international community fails to recognise. Serbia was fighting separatists & terrorists (domestic & foreign)! Were their actions somewhat heavy handed, sure, but not unreasonable or unexpected. Milosevic actually agreed on international presence in Kosovo, apparently he was sure he had nothing to worry about and ethnic cleansing was a myth at this point....we on the other hand demanded full military access to the entire area of Yugoslavia (including Serbia & Montenegro)although those areas had nothing to do with the supposed crimes! As far as a fresh start after Milosevic……it was never going to happen…….Ethnic cleansing of non-Albanians and destruction of Serbian property (including centuries old monasteries) continued unabated for years after the bombing & NATO supposed peacekeeping mission. Also, add the fact that newly “elected” Kosovo officials were nearly all former members of KLA! Nine out of ten Americans, to THIS day, know nothing about the ethnic cleansing of Serbs from Kossovo. Nine out of ten Americans to THIS day don't know that the Bosnians Muslims are a minority group, and had no right to set up their own Republic. And almost no Americans realise the extent of the conspiracy to break up Yugoslavia. Heck, they don't even know that over 800 Bosnian \"fighters\" were members of Al Qaeda. Who cared at that time? And who cares now? Dave", 
        "intTime": 20090504, 
        "postID": 14, 
        "quote": "Originally posted by NSNN: quote: Originally posted by Bladensburg: What I mean is do you think the West and NATO should have let Arkan's mates(and I suspect that whatever the Serb police alleged to be were doing it was pretty tame compared to the militias) and the KLA (an equally nasty bunch of lads) just crack on as they were and end up with another (smaller but more vicious) Bosnia, only this time with the potential to openly draw a third party, Albania, in. Or do you have another alternative. For my part I always thought the thing was a bit engineered, not least because the ceasefire that the Serbs eventually signed was very much watered down from that pre-war ultimatum. Very odd, particularly because the whole cock-up further fed that idiotic Slavic pride and meant that any sort of rapprochement between Belgrade and Kosovo was impossible, even when Milosevic was gone and they could have started with a clean sheet. Instead Europe is lumbered with another ridiculously small and poor statelet. What makes it even stranger is that there was a rush to recognise Kosovo when are actually reasonably viable breakaway states like Somaliland that the international community fails to recognise. Serbia was fighting separatists & terrorists (domestic & foreign)! Were their actions somewhat heavy handed, sure, but not unreasonable or unexpected. Milosevic actually agreed on international presence in Kosovo, apparently he was sure he had nothing to worry about and ethnic cleansing was a myth at this point....we on the other hand demanded full military access to the entire area of Yugoslavia (including Serbia & Montenegro)although those areas had nothing to do with the supposed crimes! As far as a fresh start after Milosevic……it was never going to happen…….Ethnic cleansing of non-Albanians and destruction of Serbian property (including centuries old monasteries) continued unabated for years after the bombing & NATO supposed peacekeeping mission. Also, add the fact that newly “elected” Kosovo officials were nearly all former members of KLA!", 
        "reply": " Nine out of ten Americans, to THIS day, know nothing about the ethnic cleansing of Serbs from Kossovo. Nine out of ten Americans to THIS day don't know that the Bosnians Muslims are a minority group, and had no right to set up their own Republic. And almost no Americans realise the extent of the conspiracy to break up Yugoslavia. Heck, they don't even know that over 800 Bosnian \"fighters\" were members of Al Qaeda. Who cared at that time? And who cares now? Dave", 
        "threadID": "672198221_3490093222001", 
        "time": "2009-05-04 12:22:00", 
        "title": "Kosovo Revisited", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by redcoat72: RE: [ including avoiding a possible conflict with Russia when Wes Clark was told that Gen Jackson (British) would not start the third '****ing' war for him. To think that some folks thought this idiot would've made a good president!", 
        "intTime": 20090504, 
        "postID": 15, 
        "quote": "Originally posted by redcoat72: RE: [ including avoiding a possible conflict with Russia when Wes Clark was told that Gen Jackson (British) would not start the third '****ing' war for him.", 
        "reply": " To think that some folks thought this idiot would've made a good president!", 
        "threadID": "672198221_3490093222001", 
        "time": "2009-05-04 12:46:00", 
        "title": "Kosovo Revisited", 
        "userID": "67NOV"
    }, 
    {
        "content": "Scary thing happened to a freind's parents. Thye had left Yugoslavia when it went communist. When communism fell they thought, \"great we can retire in the'old country'!\" Thye(who happen to be Croatian) got there & a couyple months later the fighting started. They left with only a suitcase. Fortunately for them, the house did not get destroyed or ransacked. Somehow, seems to fit into the old saying of not wishing too hard for what you want!", 
        "intTime": 20090504, 
        "postID": 16, 
        "quote": "", 
        "reply": "Scary thing happened to a freind's parents. Thye had left Yugoslavia when it went communist. When communism fell they thought, \"great we can retire in the'old country'!\" Thye(who happen to be Croatian) got there & a couyple months later the fighting started. They left with only a suitcase. Fortunately for them, the house did not get destroyed or ransacked. Somehow, seems to fit into the old saying of not wishing too hard for what you want!", 
        "threadID": "672198221_3490093222001", 
        "time": "2009-05-04 12:55:00", 
        "title": "Kosovo Revisited", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Nine out of ten Americans, to THIS day, know nothing about the ethnic cleansing of Serbs from Kossovo. Nine out of ten Americans to THIS day don't know that the Bosnians Muslims are a minority group, and had no right to set up their own Republic. And almost no Americans realise the extent of the conspiracy to break up Yugoslavia. Heck, they don't even know that over 800 Bosnian \"fighters\" were members of Al Qaeda. Who cared at that time? And who cares now? Dave one of those very few moments of agreement", 
        "intTime": 20090504, 
        "postID": 17, 
        "quote": "Nine out of ten Americans, to THIS day, know nothing about the ethnic cleansing of Serbs from Kossovo. Nine out of ten Americans to THIS day don't know that the Bosnians Muslims are a minority group, and had no right to set up their own Republic. And almost no Americans realise the extent of the conspiracy to break up Yugoslavia. Heck, they don't even know that over 800 Bosnian \"fighters\" were members of Al Qaeda. Who cared at that time? And who cares now? Dave", 
        "reply": " one of those very few moments of agreement", 
        "threadID": "672198221_3490093222001", 
        "time": "2009-05-04 18:14:00", 
        "title": "Kosovo Revisited", 
        "userID": "FlankerFlyer"
    }
]