[
    {
        "content": "quote: TITLE: Y-Bridge will be fenced Stimulus funds to be used to try to curtail suicide attempts. Some call plan wasteful One man jumped to his death off the All-America Bridge this year. Two more used the Akron bridge — more commonly known as the Y-Bridge — to commit suicide in 2008. Akron hopes to curtail future deaths on what has been dubbed ''Suicide Bridge'' by installing a fence. The controversial fencing — some have been pushing for it, while others think it's a waste of money — was among the local projects the state approved Thursday for federal stimulus funds. <more> \"http://www.ohio.com/news/top_stories/41958387.html\"", 
        "intTime": 20090327, 
        "postID": 1, 
        "quote": "TITLE: Y-Bridge will be fenced Stimulus funds to be used to try to curtail suicide attempts. Some call plan wasteful One man jumped to his death off the All-America Bridge this year. Two more used the Akron bridge — more commonly known as the Y-Bridge — to commit suicide in 2008. Akron hopes to curtail future deaths on what has been dubbed ''Suicide Bridge'' by installing a fence. The controversial fencing — some have been pushing for it, while others think it's a waste of money — was among the local projects the state approved Thursday for federal stimulus funds. <more> \"http://www.ohio.com/news/top_stories/41958387.html\"", 
        "reply": "", 
        "threadID": "672198221_4790001912001", 
        "time": "2009-03-27 13:38:00", 
        "title": "Your Infrastructure Improvement Dollars at Work ...", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Waste of money. Charge admission fees to watch them pop off the bridge. They Don't care, who else should?", 
        "intTime": 20090327, 
        "postID": 2, 
        "quote": "", 
        "reply": "Waste of money. Charge admission fees to watch them pop off the bridge. They Don't care, who else should?", 
        "threadID": "672198221_4790001912001", 
        "time": "2009-03-27 15:09:00", 
        "title": "Your Infrastructure Improvement Dollars at Work ...", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Maybe their family and friends. Building the fence will give a few folks a job for a while. And prevent needless deaths, possibly.", 
        "intTime": 20090327, 
        "postID": 3, 
        "quote": "", 
        "reply": "Maybe their family and friends. Building the fence will give a few folks a job for a while. And prevent needless deaths, possibly.", 
        "threadID": "672198221_4790001912001", 
        "time": "2009-03-27 16:36:00", 
        "title": "Your Infrastructure Improvement Dollars at Work ...", 
        "userID": "Ruanne"
    }, 
    {
        "content": "Might be cheaper to buy a couple a sharks!", 
        "intTime": 20090327, 
        "postID": 4, 
        "quote": "", 
        "reply": "Might be cheaper to buy a couple a sharks!", 
        "threadID": "672198221_4790001912001", 
        "time": "2009-03-27 17:10:00", 
        "title": "Your Infrastructure Improvement Dollars at Work ...", 
        "userID": "EAG154"
    }, 
    {
        "content": "This is how Obama and Biden ensure that the stimulus dollars are well spent? Yes sir! This is going to advance our infrastructure to meet the needs of the future ... right!", 
        "intTime": 20090328, 
        "postID": 5, 
        "quote": "", 
        "reply": "This is how Obama and Biden ensure that the stimulus dollars are well spent? Yes sir! This is going to advance our infrastructure to meet the needs of the future ... right!", 
        "threadID": "672198221_4790001912001", 
        "time": "2009-03-28 06:34:00", 
        "title": "Your Infrastructure Improvement Dollars at Work ...", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: This is how Obama and Biden ensure that the stimulus dollars are well spent? Yes sir! This is going to advance our infrastructure to meet the needs of the future ... right! Just what do you think the reaction would be to a Federal Plan which cut the States out of the loop? I believe the screams of Federal Tyranny would be deafening - Would they not? Dave", 
        "intTime": 20090328, 
        "postID": 6, 
        "quote": "Originally posted by I_M_Qwerty: This is how Obama and Biden ensure that the stimulus dollars are well spent? Yes sir! This is going to advance our infrastructure to meet the needs of the future ... right!", 
        "reply": " Just what do you think the reaction would be to a Federal Plan which cut the States out of the loop? I believe the screams of Federal Tyranny would be deafening - Would they not? Dave", 
        "threadID": "672198221_4790001912001", 
        "time": "2009-03-28 09:54:00", 
        "title": "Your Infrastructure Improvement Dollars at Work ...", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by I_M_Qwerty: This is how Obama and Biden ensure that the stimulus dollars are well spent? Yes sir! This is going to advance our infrastructure to meet the needs of the future ... right! Without much caring about the reasoning behind the fence building... will that fence create a few jobs? And is creating jobs a part of the stimulus package??? I would have to ask you what is your point? It is the state that decided to build that was it not? While I agree that this most certainly could not be called \"infrastructure work\" it is up to the state of Ohio to use the money effectively. And was it part of the infrastructure portion of the bill to begin with? Frankly... I do not have a problem with it. for one, its not either of my states. Two, it creates at least two dozen jobs for a year or more. Could be as high as a hundred direct people with a new job... and increased secondary spending in the area that could create a few more. All-in-all appears to be a good idea... and you have the secondary benefit of slowing down or stopping Suicides there.", 
        "intTime": 20090328, 
        "postID": 7, 
        "quote": "Originally posted by I_M_Qwerty: This is how Obama and Biden ensure that the stimulus dollars are well spent? Yes sir! This is going to advance our infrastructure to meet the needs of the future ... right!", 
        "reply": " Without much caring about the reasoning behind the fence building... will that fence create a few jobs? And is creating jobs a part of the stimulus package??? I would have to ask you what is your point? It is the state that decided to build that was it not? While I agree that this most certainly could not be called \"infrastructure work\" it is up to the state of Ohio to use the money effectively. And was it part of the infrastructure portion of the bill to begin with? Frankly... I do not have a problem with it. for one, its not either of my states. Two, it creates at least two dozen jobs for a year or more. Could be as high as a hundred direct people with a new job... and increased secondary spending in the area that could create a few more. All-in-all appears to be a good idea... and you have the secondary benefit of slowing down or stopping Suicides there.", 
        "threadID": "672198221_4790001912001", 
        "time": "2009-03-28 11:01:00", 
        "title": "Your Infrastructure Improvement Dollars at Work ...", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: All-in-all appears to be a good idea... and you have the secondary benefit of slowing down or stopping Suicides there. Ahhh ... two in a year's period of time ... and there are lots of bridges to choose from. In fact, another was mentioned in the article but only had 50% as many suicides. Yeah ... it's a state decision but I vaguely recall POTUS 44 promising that the states would be well-policed ... and no, the project wasn't part of the stimulus bill. The way this infrastructure funding works, simplisticly put, is that the states are allocated a pot of money by the government ... and they turn around and allocate it to projects. There are some other conditions ... such as a time frame for putting the funds to use ... but they aren't relevant to the thread. Waste of money IMHO.", 
        "intTime": 20090328, 
        "postID": 8, 
        "quote": "All-in-all appears to be a good idea... and you have the secondary benefit of slowing down or stopping Suicides there.", 
        "reply": " Ahhh ... two in a year's period of time ... and there are lots of bridges to choose from. In fact, another was mentioned in the article but only had 50% as many suicides. Yeah ... it's a state decision but I vaguely recall POTUS 44 promising that the states would be well-policed ... and no, the project wasn't part of the stimulus bill. The way this infrastructure funding works, simplisticly put, is that the states are allocated a pot of money by the government ... and they turn around and allocate it to projects. There are some other conditions ... such as a time frame for putting the funds to use ... but they aren't relevant to the thread. Waste of money IMHO.", 
        "threadID": "672198221_4790001912001", 
        "time": "2009-03-28 12:41:00", 
        "title": "Your Infrastructure Improvement Dollars at Work ...", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: Without much caring about the reasoning behind the fence building... will that fence create a few jobs? No, it falls under ODOT. So, it won't create any more jobs, it will create about 2 weeks more work. The road workers at ODOT in that region come from Laborers Local 894. They aren't taking in any apprentices for the most part and they are usually gainfully employed already. That is why many Cleveland companies who do business in Akron can use Laborers Local 310 workers (from Cleveland) in that region without 894 getting angry. So, it isn't going to create a single job. And, when it come to heavy highway, the local 860 guys from Cleveland also do a lot of work in Akron ODOT. But, they are overextended as it is. They cannot get enough people to do all of the work that they have to do. And, as far as suicides, the fence on the I-480 bridge didn't do anything to lessen suicides. The simple fact is that if somebody wants to off themselves by jumping off of a bridge, they will just climb the fence and jump off the top of it.", 
        "intTime": 20090328, 
        "postID": 9, 
        "quote": "Originally posted by ArtMarsh: Without much caring about the reasoning behind the fence building... will that fence create a few jobs?", 
        "reply": " No, it falls under ODOT. So, it won't create any more jobs, it will create about 2 weeks more work. The road workers at ODOT in that region come from Laborers Local 894. They aren't taking in any apprentices for the most part and they are usually gainfully employed already. That is why many Cleveland companies who do business in Akron can use Laborers Local 310 workers (from Cleveland) in that region without 894 getting angry. So, it isn't going to create a single job. And, when it come to heavy highway, the local 860 guys from Cleveland also do a lot of work in Akron ODOT. But, they are overextended as it is. They cannot get enough people to do all of the work that they have to do. And, as far as suicides, the fence on the I-480 bridge didn't do anything to lessen suicides. The simple fact is that if somebody wants to off themselves by jumping off of a bridge, they will just climb the fence and jump off the top of it.", 
        "threadID": "672198221_4790001912001", 
        "time": "2009-03-28 13:18:00", 
        "title": "Your Infrastructure Improvement Dollars at Work ...", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by I_M_Qwerty: This is how Obama and Biden ensure that the stimulus dollars are well spent? Yes sir! This is going to advance our infrastructure to meet the needs of the future ... right! Just what do you think the reaction would be to a Federal Plan which cut the States out of the loop? I believe the screams of Federal Tyranny would be deafening - Would they not? Dave Undoubtedly so ... but that is a far cry from vetting the projects that the states nominate against their share of the stimulus pie ... and I don't think anyone has suggested your proposition.", 
        "intTime": 20090328, 
        "postID": 10, 
        "quote": "Originally posted by Grachus: quote: Originally posted by I_M_Qwerty: This is how Obama and Biden ensure that the stimulus dollars are well spent? Yes sir! This is going to advance our infrastructure to meet the needs of the future ... right! Just what do you think the reaction would be to a Federal Plan which cut the States out of the loop? I believe the screams of Federal Tyranny would be deafening - Would they not? Dave", 
        "reply": " Undoubtedly so ... but that is a far cry from vetting the projects that the states nominate against their share of the stimulus pie ... and I don't think anyone has suggested your proposition.", 
        "threadID": "672198221_4790001912001", 
        "time": "2009-03-28 15:22:00", 
        "title": "Your Infrastructure Improvement Dollars at Work ...", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by 10tenths: quote: Originally posted by ArtMarsh: Without much caring about the reasoning behind the fence building... will that fence create a few jobs? No, it falls under ODOT. So, it won't create any more jobs, it will create about 2 weeks more work. The road workers at ODOT in that region come from Laborers Local 894. They aren't taking in any apprentices for the most part and they are usually gainfully employed already. That is why many Cleveland companies who do business in Akron can use Laborers Local 310 workers (from Cleveland) in that region without 894 getting angry. So, it isn't going to create a single job. And, when it come to heavy highway, the local 860 guys from Cleveland also do a lot of work in Akron ODOT. But, they are overextended as it is. They cannot get enough people to do all of the work that they have to do. And, as far as suicides, the fence on the I-480 bridge didn't do anything to lessen suicides. The simple fact is that if somebody wants to off themselves by jumping off of a bridge, they will just climb the fence and jump off the top of it. Your timeline is impossible... and it really doesn't matter if the labor is Union or not.", 
        "intTime": 20090328, 
        "postID": 11, 
        "quote": "Originally posted by 10tenths: quote: Originally posted by ArtMarsh: Without much caring about the reasoning behind the fence building... will that fence create a few jobs? No, it falls under ODOT. So, it won't create any more jobs, it will create about 2 weeks more work. The road workers at ODOT in that region come from Laborers Local 894. They aren't taking in any apprentices for the most part and they are usually gainfully employed already. That is why many Cleveland companies who do business in Akron can use Laborers Local 310 workers (from Cleveland) in that region without 894 getting angry. So, it isn't going to create a single job. And, when it come to heavy highway, the local 860 guys from Cleveland also do a lot of work in Akron ODOT. But, they are overextended as it is. They cannot get enough people to do all of the work that they have to do. And, as far as suicides, the fence on the I-480 bridge didn't do anything to lessen suicides. The simple fact is that if somebody wants to off themselves by jumping off of a bridge, they will just climb the fence and jump off the top of it.", 
        "reply": " Your timeline is impossible... and it really doesn't matter if the labor is Union or not.", 
        "threadID": "672198221_4790001912001", 
        "time": "2009-03-28 17:55:00", 
        "title": "Your Infrastructure Improvement Dollars at Work ...", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Jump or don't jump... hmm...nope don't care. Does it tie up traffic when these people are debating before or after the jump? Then I might care.", 
        "intTime": 20090328, 
        "postID": 12, 
        "quote": "", 
        "reply": "Jump or don't jump... hmm...nope don't care. Does it tie up traffic when these people are debating before or after the jump? Then I might care.", 
        "threadID": "672198221_4790001912001", 
        "time": "2009-03-28 20:51:00", 
        "title": "Your Infrastructure Improvement Dollars at Work ...", 
        "userID": "CombatNAC"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by 10tenths: quote: Originally posted by ArtMarsh: Without much caring about the reasoning behind the fence building... will that fence create a few jobs? No, it falls under ODOT. So, it won't create any more jobs, it will create about 2 weeks more work. The road workers at ODOT in that region come from Laborers Local 894. They aren't taking in any apprentices for the most part and they are usually gainfully employed already. That is why many Cleveland companies who do business in Akron can use Laborers Local 310 workers (from Cleveland) in that region without 894 getting angry. So, it isn't going to create a single job. And, when it come to heavy highway, the local 860 guys from Cleveland also do a lot of work in Akron ODOT. But, they are overextended as it is. They cannot get enough people to do all of the work that they have to do. And, as far as suicides, the fence on the I-480 bridge didn't do anything to lessen suicides. The simple fact is that if somebody wants to off themselves by jumping off of a bridge, they will just climb the fence and jump off the top of it. Your timeline is impossible... and it really doesn't matter if the labor is Union or not. My timeline is completely realistic. It will take roughly 1600-2400 manhours depending on the crew to fence the Y-bridge. If I were the estimator I would put 25 guys for two weeks on 3rd shift with a 2 day trailer for each week. It is only a fence, man. It would more than likely be tied into the existing structure. So, that means drilling into the concrete barriers, setting posts and stretching the fence. You could get almost all posts up within 3 days. The rest is stretching the fence. And, with a two day trailer for each week, you have plenty of manhours to burn if you get a little behind in your primary. I know it doesn't generally matter whether it is Union or not. But, I am just telling you who EXACTLY WILL be doing the work (Laborers Local 894) and what the current hiring status is for each local. In the end, just as I said, it will not create new jobs, it will just create more work.", 
        "intTime": 20090404, 
        "postID": 13, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by 10tenths: quote: Originally posted by ArtMarsh: Without much caring about the reasoning behind the fence building... will that fence create a few jobs? No, it falls under ODOT. So, it won't create any more jobs, it will create about 2 weeks more work. The road workers at ODOT in that region come from Laborers Local 894. They aren't taking in any apprentices for the most part and they are usually gainfully employed already. That is why many Cleveland companies who do business in Akron can use Laborers Local 310 workers (from Cleveland) in that region without 894 getting angry. So, it isn't going to create a single job. And, when it come to heavy highway, the local 860 guys from Cleveland also do a lot of work in Akron ODOT. But, they are overextended as it is. They cannot get enough people to do all of the work that they have to do. And, as far as suicides, the fence on the I-480 bridge didn't do anything to lessen suicides. The simple fact is that if somebody wants to off themselves by jumping off of a bridge, they will just climb the fence and jump off the top of it. Your timeline is impossible... and it really doesn't matter if the labor is Union or not.", 
        "reply": " My timeline is completely realistic. It will take roughly 1600-2400 manhours depending on the crew to fence the Y-bridge. If I were the estimator I would put 25 guys for two weeks on 3rd shift with a 2 day trailer for each week. It is only a fence, man. It would more than likely be tied into the existing structure. So, that means drilling into the concrete barriers, setting posts and stretching the fence. You could get almost all posts up within 3 days. The rest is stretching the fence. And, with a two day trailer for each week, you have plenty of manhours to burn if you get a little behind in your primary. I know it doesn't generally matter whether it is Union or not. But, I am just telling you who EXACTLY WILL be doing the work (Laborers Local 894) and what the current hiring status is for each local. In the end, just as I said, it will not create new jobs, it will just create more work.", 
        "threadID": "672198221_4790001912001", 
        "time": "2009-04-04 12:28:00", 
        "title": "Your Infrastructure Improvement Dollars at Work ...", 
        "userID": "10Tenths"
    }
]