[
    {
        "content": "They changed a camera in Hubble. The old camera came out after they finally got a bolt loose. The camera has been in there for 16 years and will be on display at the SI. Awesome! Can't wait to see the pics from the new camera. \"http://apnews.myway.com/article/20090514/D98657580.html\"",
        "intTime": 20090514,
        "postID": 1,
        "quote": "",
        "reply": "They changed a camera in Hubble. The old camera came out after they finally got a bolt loose. The camera has been in there for 16 years and will be on display at the SI. Awesome! Can't wait to see the pics from the new camera. \"http://apnews.myway.com/article/20090514/D98657580.html\"",
        "threadID": "672198221_9020023322001",
        "time": "2009-05-14 15:36:00",
        "title": "Another NASA Success On Hubble!",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: They changed a camera in Hubble. The old camera came out after they finally got a bolt loose. The camera has been in there for 16 years and will be on display at the SI. Awesome! Can't wait to see the pics from the new camera. \"http://apnews.myway.com/article/20090514/D98657580.html\" Good on NASA, the Hubble telescope is a good use of funds, unlike the rat hole for funds of the international space station... If we could but shed ourselves of that monstrosity and put the money into going back to the moon and establishing manned scientific sites there and use the moon as a \"springboard\" to Mars and beyond... We also need to put more money into \"propulsion systems research\" for space vehicles... IMHO... Respectfully, SUNLINER81",
        "intTime": 20090514,
        "postID": 2,
        "quote": "Originally posted by crackerjacks61: They changed a camera in Hubble. The old camera came out after they finally got a bolt loose. The camera has been in there for 16 years and will be on display at the SI. Awesome! Can't wait to see the pics from the new camera. \"http://apnews.myway.com/article/20090514/D98657580.html\"",
        "reply": " Good on NASA, the Hubble telescope is a good use of funds, unlike the rat hole for funds of the international space station... If we could but shed ourselves of that monstrosity and put the money into going back to the moon and establishing manned scientific sites there and use the moon as a \"springboard\" to Mars and beyond... We also need to put more money into \"propulsion systems research\" for space vehicles... IMHO... Respectfully, SUNLINER81",
        "threadID": "672198221_9020023322001",
        "time": "2009-05-14 15:43:00",
        "title": "Another NASA Success On Hubble!",
        "userID": "SUNLINER81"
    },
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: They changed a camera in Hubble. The old camera came out after they finally got a bolt loose. The camera has been in there for 16 years and will be on display at the SI. Awesome! Can't wait to see the pics from the new camera. \"http://apnews.myway.com/article/20090514/D98657580.html\" Good on NASA, the Hubble telescope is a good use of funds, unlike the rat hole for funds of the international space station... If we could but shed ourselves of that monstrosity and put the money into going back to the moon and establishing manned scientific sites there and use the moon as a \"springboard\" to Mars and beyond... We also need to put more money into \"propulsion systems research\" for space vehicles... IMHO... Respectfully, SUNLINER81 All the space station is is a \"be good to our neighbors\" political adventure. Basically we built and paid for it so they could say they \"achieved\" something. I agree. We need to fetch the lead again and get back to the moon and beyond before china lands on it and stakes claim to the entire rock. Which would not surprise me a bit.",
        "intTime": 20090514,
        "postID": 3,
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: They changed a camera in Hubble. The old camera came out after they finally got a bolt loose. The camera has been in there for 16 years and will be on display at the SI. Awesome! Can't wait to see the pics from the new camera. \"http://apnews.myway.com/article/20090514/D98657580.html\" Good on NASA, the Hubble telescope is a good use of funds, unlike the rat hole for funds of the international space station... If we could but shed ourselves of that monstrosity and put the money into going back to the moon and establishing manned scientific sites there and use the moon as a \"springboard\" to Mars and beyond... We also need to put more money into \"propulsion systems research\" for space vehicles... IMHO... Respectfully, SUNLINER81",
        "reply": " All the space station is is a \"be good to our neighbors\" political adventure. Basically we built and paid for it so they could say they \"achieved\" something. I agree. We need to fetch the lead again and get back to the moon and beyond before china lands on it and stakes claim to the entire rock. Which would not surprise me a bit.",
        "threadID": "672198221_9020023322001",
        "time": "2009-05-14 15:57:00",
        "title": "Another NASA Success On Hubble!",
        "userID": "crackerjacks61"
    },
    {
        "content": "Today was a good day all around. Although the Agency was low-key about it, replacing the Science Instrument Command & Data Handling (SI C&DH) Unit was even more important than installing WFC3. Had Drew been unable to remove the on-orbit unit (launched with the Telescope 19 years ago), or had the replacement unit not functioned after installation and the original unit had to be put back in, then the Telescope would have been left with a single point of failure for all data collected from the instruments. If the remaining side on the SI C&DH unit failed later, then HST would effectively \"die\" from a scientific perspective. Successful installation of the replacement SI C&DH unit was a huge milestone for the Hubble Team.",
        "intTime": 20090514,
        "postID": 4,
        "quote": "",
        "reply": "Today was a good day all around. Although the Agency was low-key about it, replacing the Science Instrument Command & Data Handling (SI C&DH) Unit was even more important than installing WFC3. Had Drew been unable to remove the on-orbit unit (launched with the Telescope 19 years ago), or had the replacement unit not functioned after installation and the original unit had to be put back in, then the Telescope would have been left with a single point of failure for all data collected from the instruments. If the remaining side on the SI C&DH unit failed later, then HST would effectively \"die\" from a scientific perspective. Successful installation of the replacement SI C&DH unit was a huge milestone for the Hubble Team.",
        "threadID": "672198221_9020023322001",
        "time": "2009-05-14 18:31:00",
        "title": "Another NASA Success On Hubble!",
        "userID": "Motive25"
    },
    {
        "content": "BTW, both WFC3 and the SI C&DH unit successfully passed their aliveness and functional tests after installation, so now we know for sure they survived the launch. \"First light\" images from WFC3 are supposed to be released to the public around early September. Hubble's \"eyes\" into the universe just got sharper!",
        "intTime": 20090514,
        "postID": 5,
        "quote": "",
        "reply": "BTW, both WFC3 and the SI C&DH unit successfully passed their aliveness and functional tests after installation, so now we know for sure they survived the launch. \"First light\" images from WFC3 are supposed to be released to the public around early September. Hubble's \"eyes\" into the universe just got sharper!",
        "threadID": "672198221_9020023322001",
        "time": "2009-05-14 18:37:00",
        "title": "Another NASA Success On Hubble!",
        "userID": "Motive25"
    },
    {
        "content": "",
        "intTime": 20090514,
        "postID": 6,
        "quote": "",
        "reply": "",
        "threadID": "672198221_9020023322001",
        "time": "2009-05-14 20:24:00",
        "title": "Another NASA Success On Hubble!",
        "userID": "Tower_Flower"
    },
    {
        "content": "wouldn't it be something to be where these men are? I too cannot wait till the latest pictures come in... Great job NASA.... One Flag......One Heart......One Nation............EVERMORE",
        "intTime": 20090514,
        "postID": 7,
        "quote": "",
        "reply": "wouldn't it be something to be where these men are? I too cannot wait till the latest pictures come in... Great job NASA.... One Flag......One Heart......One Nation............EVERMORE",
        "threadID": "672198221_9020023322001",
        "time": "2009-05-14 20:40:00",
        "title": "Another NASA Success On Hubble!",
        "userID": "m551sheridan"
    },
    {
        "content": "quote: Originally posted by m551sheridan: wouldn't it be something to be where these men are? I too cannot wait till the latest pictures come in... Great job NASA.... And woman- don't forget Megan McArthur. She's the robotic arm operator and Flight Engineer for the Mission.",
        "intTime": 20090515,
        "postID": 8,
        "quote": "Originally posted by m551sheridan: wouldn't it be something to be where these men are? I too cannot wait till the latest pictures come in... Great job NASA....",
        "reply": " And woman- don't forget Megan McArthur. She's the robotic arm operator and Flight Engineer for the Mission.",
        "threadID": "672198221_9020023322001",
        "time": "2009-05-15 05:48:00",
        "title": "Another NASA Success On Hubble!",
        "userID": "Motive25"
    },
    {
        "content": "BUMP!",
        "intTime": 20090515,
        "postID": 9,
        "quote": "",
        "reply": "BUMP!",
        "threadID": "672198221_9020023322001",
        "time": "2009-05-15 06:45:00",
        "title": "Another NASA Success On Hubble!",
        "userID": "sw614"
    },
    {
        "content": "Another long, but successful day for the crew of Atlantis and the Hubble Space Telescope. Mike \"Mass\" Massimino and Mike \"Bueno\" Good installed three new Rate Sensor Units (RSUs), each containing two gyroscopes used for controlling the orientation of HST, and one of the two new battery modules planned for the mission. (The second module will be installed during the fifth EVA (space walk) on Monday). This was the eighth longest EVA in Shuttle history, at 7 hours, 56 minutes and almost 90 minutes over the planned duration. The extended length of the EVA was due to problems Mike & Mike had with getting one of the RSUs to seat properly. Eventually the problem was solved by pulling out the spare fourth RSU carried on the Shuttle for just such a contingency. They also had problems getting the doors to the bay where the RSUs are located on Hubble to close properly, but after gradually alternating engaging the four latches that secure the doors, they were eventually able to get the proper seal on the doors. Installation of the battery went smoothly and it, as well as all RSUs, passed their aliveness and functional tests. Tomorrow's EVA is going to be extremely challenging. Drew Feustal will install the new Cosmic Origins Spectrometer. John Grunsfeld will then attempt something that has never been done before in space: opening up and repairing an instrument, the Advanced Camera for Surveys (ACS), in space. Be sure to catch the spacewalk live on NASA TV streaming video at http://www.nasa.gov/ starting sometime after 9AM Eastern. Grunsfeld's repair attempt of ACS will start sometime in the early afternoon. If John is successful, he will make history. This is a great time to be in NASA and to be a member of the best team in the Agency, bar none!",
        "intTime": 20090515,
        "postID": 10,
        "quote": "",
        "reply": "Another long, but successful day for the crew of Atlantis and the Hubble Space Telescope. Mike \"Mass\" Massimino and Mike \"Bueno\" Good installed three new Rate Sensor Units (RSUs), each containing two gyroscopes used for controlling the orientation of HST, and one of the two new battery modules planned for the mission. (The second module will be installed during the fifth EVA (space walk) on Monday). This was the eighth longest EVA in Shuttle history, at 7 hours, 56 minutes and almost 90 minutes over the planned duration. The extended length of the EVA was due to problems Mike & Mike had with getting one of the RSUs to seat properly. Eventually the problem was solved by pulling out the spare fourth RSU carried on the Shuttle for just such a contingency. They also had problems getting the doors to the bay where the RSUs are located on Hubble to close properly, but after gradually alternating engaging the four latches that secure the doors, they were eventually able to get the proper seal on the doors. Installation of the battery went smoothly and it, as well as all RSUs, passed their aliveness and functional tests. Tomorrow's EVA is going to be extremely challenging. Drew Feustal will install the new Cosmic Origins Spectrometer. John Grunsfeld will then attempt something that has never been done before in space: opening up and repairing an instrument, the Advanced Camera for Surveys (ACS), in space. Be sure to catch the spacewalk live on NASA TV streaming video at http://www.nasa.gov/ starting sometime after 9AM Eastern. Grunsfeld's repair attempt of ACS will start sometime in the early afternoon. If John is successful, he will make history. This is a great time to be in NASA and to be a member of the best team in the Agency, bar none!",
        "threadID": "672198221_9020023322001",
        "time": "2009-05-15 18:18:00",
        "title": "Another NASA Success On Hubble!",
        "userID": "Motive25"
    }
]