[
    {
        "content": ">http://rawstory.com/08/news/2009/05/14/senator-says-cia-made-up-dates-of-torture-briefings-then-admitted-it/ In an interview in New York, retired Senator and former chairman of the Intelligence Committee, Bob Graham, stated that the CIA obfuscated dates on which they claimed he had been briefed about enhanced interrogation techniques. When confronted with indications proving otherwise, they admitted error. If they're making errors with some briefings that 'supposedly' occurred, why not those Pelosi claims she never got? This is one wrong agency to be engaged in creative record-keeping.", 
        "intTime": 20090515, 
        "postID": 1, 
        "quote": "", 
        "reply": ">http://rawstory.com/08/news/2009/05/14/senator-says-cia-made-up-dates-of-torture-briefings-then-admitted-it/ In an interview in New York, retired Senator and former chairman of the Intelligence Committee, Bob Graham, stated that the CIA obfuscated dates on which they claimed he had been briefed about enhanced interrogation techniques. When confronted with indications proving otherwise, they admitted error. If they're making errors with some briefings that 'supposedly' occurred, why not those Pelosi claims she never got? This is one wrong agency to be engaged in creative record-keeping.", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-15 17:49:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: >http://rawstory.com/08/news/2009/05/14/senator-says-cia-made-up-dates-of-torture-briefings-then-admitted-it/ In an interview in New York, retired Senator and former chairman of the Intelligence Committee stated that the CIA obfuscated dates on which they claimed he had been briefed about enhanced interrogation techniques. When confronted with indications proving otherwise, they admitted error. If they're making errors with some briefings that 'supposedly' occurred, why not those Pelosi claims she never got? This is one wrong agency to be engaged in creative record-keeping. Exactly ... Panetta had better make sure he knows what he's talking about before making such statements. He's only being told about things that supposedly happened while under the Bush Administration. Fact is, the CIA fell under the \"Intelligence Consolidation\" led by Rumsfeld that totally politicized each and ever intel organization under George Bush. Why should any American believe Bush people? I don't. The CIA were also the agency that provided Colin Powell his faulty intel and aerial photos he used to justify the Iraq war to the UN during the run up to the Iraq invasion. We all found out that was completely bogus. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090515, 
        "postID": 2, 
        "quote": "Originally posted by popsiq: >http://rawstory.com/08/news/2009/05/14/senator-says-cia-made-up-dates-of-torture-briefings-then-admitted-it/ In an interview in New York, retired Senator and former chairman of the Intelligence Committee stated that the CIA obfuscated dates on which they claimed he had been briefed about enhanced interrogation techniques. When confronted with indications proving otherwise, they admitted error. If they're making errors with some briefings that 'supposedly' occurred, why not those Pelosi claims she never got? This is one wrong agency to be engaged in creative record-keeping.", 
        "reply": " Exactly ... Panetta had better make sure he knows what he's talking about before making such statements. He's only being told about things that supposedly happened while under the Bush Administration. Fact is, the CIA fell under the \"Intelligence Consolidation\" led by Rumsfeld that totally politicized each and ever intel organization under George Bush. Why should any American believe Bush people? I don't. The CIA were also the agency that provided Colin Powell his faulty intel and aerial photos he used to justify the Iraq war to the UN during the run up to the Iraq invasion. We all found out that was completely bogus. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-15 17:57:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer!", 
        "intTime": 20090515, 
        "postID": 3, 
        "quote": "", 
        "reply": "Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer!", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-15 18:39:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Where oh where is brother Obama? I wonder why he has not made any statements on this matter yet? Is his TelePrompTer down?", 
        "intTime": 20090515, 
        "postID": 4, 
        "quote": "", 
        "reply": "Where oh where is brother Obama? I wonder why he has not made any statements on this matter yet? Is his TelePrompTer down?", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-15 19:20:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Where oh where is brother Obama? I wonder why he has not made any statements on this matter yet? Is his TelePrompTer down? Obama is going to steer clear, see how the wind blows, and then throw Patooie under the bus. Unfortunately she won't go without a fight and that will take till the next election...... stock up on . One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090515, 
        "postID": 5, 
        "quote": "Originally posted by Duster6: Where oh where is brother Obama? I wonder why he has not made any statements on this matter yet? Is his TelePrompTer down?", 
        "reply": " Obama is going to steer clear, see how the wind blows, and then throw Patooie under the bus. Unfortunately she won't go without a fight and that will take till the next election...... stock up on . One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-15 19:28:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "So which neo-Marxist do you believe: Pelosi? Graham? Panetta? Either she's an incompetent fool who didn't understand the briefing in front of her or she's lying to make political points with her far left voting base. Regardless, both answers mean she is unfit to hold the number 3 slot in the US Government. She should be removed from her post as Speaker.", 
        "intTime": 20090515, 
        "postID": 6, 
        "quote": "", 
        "reply": "So which neo-Marxist do you believe: Pelosi? Graham? Panetta? Either she's an incompetent fool who didn't understand the briefing in front of her or she's lying to make political points with her far left voting base. Regardless, both answers mean she is unfit to hold the number 3 slot in the US Government. She should be removed from her post as Speaker.", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-15 19:39:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer! \"He has a quirky habit of keeping a detailed log of his daily activities on color-coded notebooks, which some say may have cost him a spot on past vice-presidential tickets. He keeps all of these notes in a file cabinet arranged by month and year. A great champion for his home state, Graham always kept Florida orange juice on hand in his Senate office and was rarely seen without his trademark Florida tie.\"] \"Graham said that when he asked the CIA when he had been briefed on the program, the CIA gave him the dates of four briefings, two in April 2002 and two in September 2002, when they claimed they had briefed him about the program. But after Graham consulted his own records, he pointed out that on two of those dates, he had not attended any briefing. After Graham pointed this out to the CIA, they conceded their own dates were incorrect.\" \"As Chairman of the Senate Intelligence Committee, Senator Graham opposed the War in Iraq for fear it would divert U.S. attention from the fight in Afghanistan. After carefully reviewing information and meeting with military leaders in February 2002, he decided the war would be a \"distraction\" that would end poorly. He continues to oppose the Iraq War today.\" So lets get this straight he is smart enough to get re-elected,called the Iraq war a mistake from the start and with his notes prove the CIA was lying about having 2 meetings with him yet you call him a fool? --Savage", 
        "intTime": 20090515, 
        "postID": 7, 
        "quote": "Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer!", 
        "reply": " \"He has a quirky habit of keeping a detailed log of his daily activities on color-coded notebooks, which some say may have cost him a spot on past vice-presidential tickets. He keeps all of these notes in a file cabinet arranged by month and year. A great champion for his home state, Graham always kept Florida orange juice on hand in his Senate office and was rarely seen without his trademark Florida tie.\"] \"Graham said that when he asked the CIA when he had been briefed on the program, the CIA gave him the dates of four briefings, two in April 2002 and two in September 2002, when they claimed they had briefed him about the program. But after Graham consulted his own records, he pointed out that on two of those dates, he had not attended any briefing. After Graham pointed this out to the CIA, they conceded their own dates were incorrect.\" \"As Chairman of the Senate Intelligence Committee, Senator Graham opposed the War in Iraq for fear it would divert U.S. attention from the fight in Afghanistan. After carefully reviewing information and meeting with military leaders in February 2002, he decided the war would be a \"distraction\" that would end poorly. He continues to oppose the Iraq War today.\" So lets get this straight he is smart enough to get re-elected,called the Iraq war a mistake from the start and with his notes prove the CIA was lying about having 2 meetings with him yet you call him a fool? --Savage", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-15 20:45:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Where oh where is brother Obama? I wonder why he has not made any statements on this matter yet? Is his TelePrompTer down? Why should he? Nothing he could ever say would be right in this instance, and he has better and more important issues on his plate. This is a \"Separation of Powers\" issue. He is of the Executive branch, and Speaker Pelosi, the Legislative. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090515, 
        "postID": 8, 
        "quote": "Originally posted by Duster6: Where oh where is brother Obama? I wonder why he has not made any statements on this matter yet? Is his TelePrompTer down?", 
        "reply": " Why should he? Nothing he could ever say would be right in this instance, and he has better and more important issues on his plate. This is a \"Separation of Powers\" issue. He is of the Executive branch, and Speaker Pelosi, the Legislative. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-15 20:56:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer! From what is being reported, Graham was a very dedicated note taker. He has notebooks that he used to keep track of just about everything he did on a daily basis. Other wise why did the CIA back off on the dates they said he was briefed? Apparently his records of the specific dates WERE better than theirs. quote: Excerpts from a Times article in 2000. 8Quote: \"12:50: Cissy thinks she's going into labor 1:15: Cissy preparing to leave for Baptist Hospital 1:20-1:30: MLTH. Bedroom, bathroom. Dress in blue slacks 1:30-1:45: Rewind Ace Ventura 2:00: Adele ready to go. Drive to Baptist Hospital 2:15: Stop at [video store] to return Ace Ventura 6:00-7:05: Cissy in examining room, delivery room, watch ABC News. Cissy commences preparation for labor 7:05-8:40: Drive to Bennigan's Restaurant with Adele. Listen to New England Patriots-Miami Dolphins (39-35) 7:20-8:25: Bennigan's. Eat supper (ham and cheese sandwich). Return to hospital 9:05-9:10: Waiting room. Read NYT, mingle 11:00-12:45: Waiting room. Watch CNN, CBS News 12:44: It's a boy!\" (Graham notebook entry from September 1994, as quoted in Time, July 17, 2000.) quote: Quote: \"8:25 Awake at MLTH, dress in red golf shirt, khaki pants 8:50-9:15 kitchen—brew coffee—eat breakfast (Raisin Bran cereal) … 9:45-10 sign mail collect materials Adele gives President Clinton Coke can … 10:45-10:55 Carriage cleaners—pick up Adele's dry cleaning Food Spot to buy Herald, NYT … 11:15-11:20: MLTH kitchen—give Adele dry cleaning—newspapers— collect Coca Cola … 12:30-1:15: grill—eat lunch (cheeseburger) 1:15-1:20: walk, cart to 1st tee 1:20-6:10: play golf with President Clinton, Hugh Rodham, Aaron Podhurst (1:22—4:47:07:69) Start of the round and duration, to hundredth of a second … 11:20-11:50 MLTH bedroom, bathroom dress for sleep watch XFL Chicago at LA (Graham notebook entry from Feb. 10, 2001, as quoted in the New York Times, June 4, 2003.) Graham said in July 2003: \"It's mainly a list of [things] to do that day. It is a recording of the names of people that I meet, and what their concerns are, so that I can follow up. … It's been a valuable part of my effort to be disciplined and to be responsive to the people by assuring that I have it written down, what they expect, and that I can check off that that request was responded to.\" As to the odd minutiae, Graham said, \"All those things are intended to help my ability to recall what the environment was in which something occurred, and that helps me remember the details.\" http://www.slate.com/id/2089115/ It would seem that keeping a daily log enabled him to show that he, and not the CIA was right, at least about the dates. Graham talking about the notebooks and other things in 2005. http://www.thecrimson.com/article.aspx?ref=509202 Graham: CIA was 'loose with the facts' about interrogation briefings By Nathan Crabbe Sun staff writer Published: Friday, May 15, 2009 at 4:42 p.m. Last Modified: Friday, May 15, 2009 at 4:42 p.m. Former U.S. Sen. Bob Graham said Friday that his detailed diaries show Democrats were told less about the interrogation of terrorists than the CIA claims. Graham said the CIA claimed he was briefed four times about extreme interrogation techniques as chairman of the Senate Intelligence Committee. He said he called the head of archives at the University of Florida, where his notebooks are stored, to check if he had listed the briefings. \"We established that three out of four of these alleged briefings never took place,\" he said. House Speaker Nancy Pelosi has been under fire this week about her knowledge of so-called enhanced interrogation techniques, which some have deemed torture. While the CIA has said she was fully briefed about the methods, Pelosi said she was briefed once and misled about the use of waterboarding. For his part, Graham said he doesn't recall being told about waterboarding or other extreme techniques in his briefing. He believes that \"misinformation is out there\" based on his experience. \"I think the Republican-led CIA of that era, among other things, was loose with the facts and loose with the record,\" he said. Graham, Florida governor from 1989 1979 to 1987 and U.S. senator from 1987 to 2005, is the namesake of UF's Graham Center for Public Service. He donated his notebooks to the university, but they are currently unavailable to the public. Carl Van Ness, UF historian and curator of archives and manuscripts, said the notebooks contain incredibly detailed, almost minute-by-minute, logs of Graham's activities. He said they also include nearly everything Graham put into his pockets that day. \"I've never seen anything like it as an archivist,\" he said. Van Ness said an issue with tax laws, involving whether the records are available to the public, has kept the notebooks under seal. He said he only accesses the notebooks at Graham's instruction. \"At his request, we'll break the seal,\" he said. He said one of the notebooks that Graham sought had been loaned to the former senator, but the others were in the archives. He said he couldn't comment about what they said. Graham said the CIA reported he was briefed twice in April 2002 and twice in September 2002. But he said the notebooks show he was briefed just once, on Sept. 27 of that year. http://www.gainesville.com/article/20090515/ARTICLES/905159954/1002 You say he has a bad memory, but his keeping track of his daily schedule for years would add a completely different perspective to that. Wouldn’t you say? If you write everything down, where’s the need to remember it? By the way, got any links to your assertion that he has a memory problem?", 
        "intTime": 20090515, 
        "postID": 9, 
        "quote": "Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer!", 
        "reply": " From what is being reported, Graham was a very dedicated note taker. He has notebooks that he used to keep track of just about everything he did on a daily basis. Other wise why did the CIA back off on the dates they said he was briefed? Apparently his records of the specific dates WERE better than theirs. quote: Excerpts from a Times article in 2000. 8Quote: \"12:50: Cissy thinks she's going into labor 1:15: Cissy preparing to leave for Baptist Hospital 1:20-1:30: MLTH. Bedroom, bathroom. Dress in blue slacks 1:30-1:45: Rewind Ace Ventura 2:00: Adele ready to go. Drive to Baptist Hospital 2:15: Stop at [video store] to return Ace Ventura 6:00-7:05: Cissy in examining room, delivery room, watch ABC News. Cissy commences preparation for labor 7:05-8:40: Drive to Bennigan's Restaurant with Adele. Listen to New England Patriots-Miami Dolphins (39-35) 7:20-8:25: Bennigan's. Eat supper (ham and cheese sandwich). Return to hospital 9:05-9:10: Waiting room. Read NYT, mingle 11:00-12:45: Waiting room. Watch CNN, CBS News 12:44: It's a boy!\" (Graham notebook entry from September 1994, as quoted in Time, July 17, 2000.) quote: Quote: \"8:25 Awake at MLTH, dress in red golf shirt, khaki pants 8:50-9:15 kitchen—brew coffee—eat breakfast (Raisin Bran cereal) … 9:45-10 sign mail collect materials Adele gives President Clinton Coke can … 10:45-10:55 Carriage cleaners—pick up Adele's dry cleaning Food Spot to buy Herald, NYT … 11:15-11:20: MLTH kitchen—give Adele dry cleaning—newspapers— collect Coca Cola … 12:30-1:15: grill—eat lunch (cheeseburger) 1:15-1:20: walk, cart to 1st tee 1:20-6:10: play golf with President Clinton, Hugh Rodham, Aaron Podhurst (1:22—4:47:07:69) Start of the round and duration, to hundredth of a second … 11:20-11:50 MLTH bedroom, bathroom dress for sleep watch XFL Chicago at LA (Graham notebook entry from Feb. 10, 2001, as quoted in the New York Times, June 4, 2003.) Graham said in July 2003: \"It's mainly a list of [things] to do that day. It is a recording of the names of people that I meet, and what their concerns are, so that I can follow up. … It's been a valuable part of my effort to be disciplined and to be responsive to the people by assuring that I have it written down, what they expect, and that I can check off that that request was responded to.\" As to the odd minutiae, Graham said, \"All those things are intended to help my ability to recall what the environment was in which something occurred, and that helps me remember the details.\" http://www.slate.com/id/2089115/ It would seem that keeping a daily log enabled him to show that he, and not the CIA was right, at least about the dates. Graham talking about the notebooks and other things in 2005. http://www.thecrimson.com/article.aspx?ref=509202 Graham: CIA was 'loose with the facts' about interrogation briefings By Nathan Crabbe Sun staff writer Published: Friday, May 15, 2009 at 4:42 p.m. Last Modified: Friday, May 15, 2009 at 4:42 p.m. Former U.S. Sen. Bob Graham said Friday that his detailed diaries show Democrats were told less about the interrogation of terrorists than the CIA claims. Graham said the CIA claimed he was briefed four times about extreme interrogation techniques as chairman of the Senate Intelligence Committee. He said he called the head of archives at the University of Florida, where his notebooks are stored, to check if he had listed the briefings. \"We established that three out of four of these alleged briefings never took place,\" he said. House Speaker Nancy Pelosi has been under fire this week about her knowledge of so-called enhanced interrogation techniques, which some have deemed torture. While the CIA has said she was fully briefed about the methods, Pelosi said she was briefed once and misled about the use of waterboarding. For his part, Graham said he doesn't recall being told about waterboarding or other extreme techniques in his briefing. He believes that \"misinformation is out there\" based on his experience. \"I think the Republican-led CIA of that era, among other things, was loose with the facts and loose with the record,\" he said. Graham, Florida governor from 1989 1979 to 1987 and U.S. senator from 1987 to 2005, is the namesake of UF's Graham Center for Public Service. He donated his notebooks to the university, but they are currently unavailable to the public. Carl Van Ness, UF historian and curator of archives and manuscripts, said the notebooks contain incredibly detailed, almost minute-by-minute, logs of Graham's activities. He said they also include nearly everything Graham put into his pockets that day. \"I've never seen anything like it as an archivist,\" he said. Van Ness said an issue with tax laws, involving whether the records are available to the public, has kept the notebooks under seal. He said he only accesses the notebooks at Graham's instruction. \"At his request, we'll break the seal,\" he said. He said one of the notebooks that Graham sought had been loaned to the former senator, but the others were in the archives. He said he couldn't comment about what they said. Graham said the CIA reported he was briefed twice in April 2002 and twice in September 2002. But he said the notebooks show he was briefed just once, on Sept. 27 of that year. http://www.gainesville.com/article/20090515/ARTICLES/905159954/1002 You say he has a bad memory, but his keeping track of his daily schedule for years would add a completely different perspective to that. Wouldn’t you say? If you write everything down, where’s the need to remember it? By the way, got any links to your assertion that he has a memory problem?", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-15 21:04:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Originally posted by A_Savage: quote: Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer! \"He has a quirky habit of keeping a detailed log of his daily activities on color-coded notebooks, which some say may have cost him a spot on past vice-presidential tickets. He keeps all of these notes in a file cabinet arranged by month and year. A great champion for his home state, Graham always kept Florida orange juice on hand in his Senate office and was rarely seen without his trademark Florida tie.\"] \"Graham said that when he asked the CIA when he had been briefed on the program, the CIA gave him the dates of four briefings, two in April 2002 and two in September 2002, when they claimed they had briefed him about the program. But after Graham consulted his own records, he pointed out that on two of those dates, he had not attended any briefing. After Graham pointed this out to the CIA, they conceded their own dates were incorrect.\" \"As Chairman of the Senate Intelligence Committee, Senator Graham opposed the War in Iraq for fear it would divert U.S. attention from the fight in Afghanistan. After carefully reviewing information and meeting with military leaders in February 2002, he decided the war would be a \"distraction\" that would end poorly. He continues to oppose the Iraq War today.\" So lets get this straight he is smart enough to get re-elected,called the Iraq war a mistake from the start and with his notes prove the CIA was lying about having 2 meetings with him yet you call him a fool? --Savage Sounds like Graham would make a great CIA chief, or head of NatSec. Coping with that senility stuff has given him little Heinie's monk-like attention to detail that seems sorely lacking in the incumbents.", 
        "intTime": 20090516, 
        "postID": 10, 
        "quote": "Originally posted by A_Savage: quote: Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer! \"He has a quirky habit of keeping a detailed log of his daily activities on color-coded notebooks, which some say may have cost him a spot on past vice-presidential tickets. He keeps all of these notes in a file cabinet arranged by month and year. A great champion for his home state, Graham always kept Florida orange juice on hand in his Senate office and was rarely seen without his trademark Florida tie.\"] \"Graham said that when he asked the CIA when he had been briefed on the program, the CIA gave him the dates of four briefings, two in April 2002 and two in September 2002, when they claimed they had briefed him about the program. But after Graham consulted his own records, he pointed out that on two of those dates, he had not attended any briefing. After Graham pointed this out to the CIA, they conceded their own dates were incorrect.\" \"As Chairman of the Senate Intelligence Committee, Senator Graham opposed the War in Iraq for fear it would divert U.S. attention from the fight in Afghanistan. After carefully reviewing information and meeting with military leaders in February 2002, he decided the war would be a \"distraction\" that would end poorly. He continues to oppose the Iraq War today.\" So lets get this straight he is smart enough to get re-elected,called the Iraq war a mistake from the start and with his notes prove the CIA was lying about having 2 meetings with him yet you call him a fool? --Savage", 
        "reply": " Sounds like Graham would make a great CIA chief, or head of NatSec. Coping with that senility stuff has given him little Heinie's monk-like attention to detail that seems sorely lacking in the incumbents.", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 02:48:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer! Looks like you'll need that mouth-rinse after this one Busnrete. There seems to be something about Graham with which you're not familiar, his record-keeping. These are donkey-sized droppings and plenty of 'em.", 
        "intTime": 20090516, 
        "postID": 11, 
        "quote": "Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer!", 
        "reply": " Looks like you'll need that mouth-rinse after this one Busnrete. There seems to be something about Graham with which you're not familiar, his record-keeping. These are donkey-sized droppings and plenty of 'em.", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 02:51:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by A_Savage: quote: Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer! \"He has a quirky habit of keeping a detailed log of his daily activities on color-coded notebooks, which some say may have cost him a spot on past vice-presidential tickets. He keeps all of these notes in a file cabinet arranged by month and year. A great champion for his home state, Graham always kept Florida orange juice on hand in his Senate office and was rarely seen without his trademark Florida tie.\"] Quirky, yes and a champion for Florida, yes. But the discussion is NOT whether the meetings took place, it's what was contained in the meetings--which cannot be recorded. \"Graham said that when he asked the CIA when he had been briefed on the program, the CIA gave him the dates of four briefings, two in April 2002 and two in September 2002, when they claimed they had briefed him about the program. But after Graham consulted his own records, he pointed out that on two of those dates, he had not attended any briefing. After Graham pointed this out to the CIA, they conceded their own dates were incorrect.\" (quote)For his part, Graham said he doesn't recall being told about waterboarding or other extreme techniques in his briefing.(quote) \"As Chairman of the Senate Intelligence Committee, Senator Graham opposed the War in Iraq for fear it would divert U.S. attention from the fight in Afghanistan. After carefully reviewing information and meeting with military leaders in February 2002, he decided the war would be a \"distraction\" that would end poorly. He continues to oppose the Iraq War today.\" Many were re-elected after opposing the war! So lets get this straight he is smart enough to get re-elected,called the Iraq war a mistake from the start and with his notes prove the CIA was lying about having 2 meetings with him yet you call him a fool? --Savage I never called him a fool! Yes, he did loose some confidence votes nationally! Too his credit, he didn't appear as confused as pelosi did. Even with her notes, she was confused! Bottom line here is that it's a memory game!", 
        "intTime": 20090516, 
        "postID": 12, 
        "quote": "Originally posted by A_Savage: quote: Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer! \"He has a quirky habit of keeping a detailed log of his daily activities on color-coded notebooks, which some say may have cost him a spot on past vice-presidential tickets. He keeps all of these notes in a file cabinet arranged by month and year. A great champion for his home state, Graham always kept Florida orange juice on hand in his Senate office and was rarely seen without his trademark Florida tie.\"] Quirky, yes and a champion for Florida, yes. But the discussion is NOT whether the meetings took place, it's what was contained in the meetings--which cannot be recorded. \"Graham said that when he asked the CIA when he had been briefed on the program, the CIA gave him the dates of four briefings, two in April 2002 and two in September 2002, when they claimed they had briefed him about the program. But after Graham consulted his own records, he pointed out that on two of those dates, he had not attended any briefing. After Graham pointed this out to the CIA, they conceded their own dates were incorrect.\" (quote)For his part, Graham said he doesn't recall being told about waterboarding or other extreme techniques in his briefing.(quote) \"As Chairman of the Senate Intelligence Committee, Senator Graham opposed the War in Iraq for fear it would divert U.S. attention from the fight in Afghanistan. After carefully reviewing information and meeting with military leaders in February 2002, he decided the war would be a \"distraction\" that would end poorly. He continues to oppose the Iraq War today.\" Many were re-elected after opposing the war! So lets get this straight he is smart enough to get re-elected,called the Iraq war a mistake from the start and with his notes prove the CIA was lying about having 2 meetings with him yet you call him a fool? --Savage", 
        "reply": " I never called him a fool! Yes, he did loose some confidence votes nationally! Too his credit, he didn't appear as confused as pelosi did. Even with her notes, she was confused! Bottom line here is that it's a memory game!", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 04:59:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks?", 
        "intTime": 20090516, 
        "postID": 13, 
        "quote": "", 
        "reply": "Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks?", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 05:31:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "stec74"
    }, 
    {
        "content": "Her Highness was just on the news back-peddling. Seems she now \"recalls\" the briefing. What a POS.", 
        "intTime": 20090516, 
        "postID": 14, 
        "quote": "", 
        "reply": "Her Highness was just on the news back-peddling. Seems she now \"recalls\" the briefing. What a POS.", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 08:59:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "shuman14"
    }, 
    {
        "content": "I wonder if his notes contain mention the rise of personal taxes of 300% in the eight years he was governor of the Sunshine State. Or, the ISI memo given him by one of our spooks in August 2001 that an attack was imminent. September 11, 2001 his meeting a delegation from Pakistan was interupted by the distruction of the WTC, the Pentagon and crash in Pa. Where was Bob when the 2000 recount, recount, recount, recount was going on? A friend went to U of Miami with Senator Graham. Both were recruited by the CIA. As the story goes the Senator goes into selling real estate and my friend became a millionaire buying real estate. Graham find the CIA too appetizing then either. In reviewing Mr. Graham Intelligence committee after his retirement, much of the interrogation techniques that has been argued to death were known well in advance Abu Zayudah. Poor old Dave wouldn't have a thing to do without 95 torture threads to keep up with.", 
        "intTime": 20090516, 
        "postID": 15, 
        "quote": "", 
        "reply": "I wonder if his notes contain mention the rise of personal taxes of 300% in the eight years he was governor of the Sunshine State. Or, the ISI memo given him by one of our spooks in August 2001 that an attack was imminent. September 11, 2001 his meeting a delegation from Pakistan was interupted by the distruction of the WTC, the Pentagon and crash in Pa. Where was Bob when the 2000 recount, recount, recount, recount was going on? A friend went to U of Miami with Senator Graham. Both were recruited by the CIA. As the story goes the Senator goes into selling real estate and my friend became a millionaire buying real estate. Graham find the CIA too appetizing then either. In reviewing Mr. Graham Intelligence committee after his retirement, much of the interrogation techniques that has been argued to death were known well in advance Abu Zayudah. Poor old Dave wouldn't have a thing to do without 95 torture threads to keep up with.", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 09:56:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by stec74: Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks? Uh, no. Actually Panetta IS questioning the accuracy of those documents in a letter here: This letter presents the most thorough information we have on dates, locations, and names of all Members of Congress who were briefed by the CIA on enhanced interrogation techniques. This information, however, is drawn from the past files of the CIA and represents MFRs completed at the time and notes that summarized the best recollections of those individuals. In the end, you and the Committee will have to determine whether this information is an accurate summary of what actually happened. We can make the MFRs available at CIA for staff review. \"http://theplumline.whorunsgov.com/wp-content/uploads/2009/05/2009-05-06-reyes-eit-letter0001.pdf\"", 
        "intTime": 20090516, 
        "postID": 16, 
        "quote": "Originally posted by stec74: Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks?", 
        "reply": " Uh, no. Actually Panetta IS questioning the accuracy of those documents in a letter here: This letter presents the most thorough information we have on dates, locations, and names of all Members of Congress who were briefed by the CIA on enhanced interrogation techniques. This information, however, is drawn from the past files of the CIA and represents MFRs completed at the time and notes that summarized the best recollections of those individuals. In the end, you and the Committee will have to determine whether this information is an accurate summary of what actually happened. We can make the MFRs available at CIA for staff review. \"http://theplumline.whorunsgov.com/wp-content/uploads/2009/05/2009-05-06-reyes-eit-letter0001.pdf\"", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 10:37:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by stec74: Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks? Uh, no. Actually Panetta IS questioning the accuracy of those documents in a letter here: This letter presents the most thorough information we have on dates, locations, and names of all Members of Congress who were briefed by the CIA on enhanced interrogation techniques. This information, however, is drawn from the past files of the CIA and represents MFRs completed at the time and notes that summarized the best recollections of those individuals. In the end, you and the Committee will have to determine whether this information is an accurate summary of what actually happened. We can make the MFRs available at CIA for staff review. \"http://theplumline.whorunsgov.com/wp-content/uploads/2009/05/2009-05-06-reyes-eit-letter0001.pdf\" From the other letter you linked to: quote: Since the Central Intelligence Agency provided the Committee an interim list of Members briefed on April 22, Director Panetta and his staff have conducted a painstaking and thorough review of over seven years' of records The result of this effort is enclosed. It provides a straightforward account of the extent of interaction with the Congress on this issue. Think I will take the word of the man who looked through seven years of records, has nothing to gain from saying his agency didn't lie, and is a career Democrat over \"flip flopper\" Pelosi.", 
        "intTime": 20090516, 
        "postID": 17, 
        "quote": "Originally posted by esample1: quote: Originally posted by stec74: Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks? Uh, no. Actually Panetta IS questioning the accuracy of those documents in a letter here: This letter presents the most thorough information we have on dates, locations, and names of all Members of Congress who were briefed by the CIA on enhanced interrogation techniques. This information, however, is drawn from the past files of the CIA and represents MFRs completed at the time and notes that summarized the best recollections of those individuals. In the end, you and the Committee will have to determine whether this information is an accurate summary of what actually happened. We can make the MFRs available at CIA for staff review. \"http://theplumline.whorunsgov.com/wp-content/uploads/2009/05/2009-05-06-reyes-eit-letter0001.pdf\"", 
        "reply": " From the other letter you linked to: quote: Since the Central Intelligence Agency provided the Committee an interim list of Members briefed on April 22, Director Panetta and his staff have conducted a painstaking and thorough review of over seven years' of records The result of this effort is enclosed. It provides a straightforward account of the extent of interaction with the Congress on this issue. Think I will take the word of the man who looked through seven years of records, has nothing to gain from saying his agency didn't lie, and is a career Democrat over \"flip flopper\" Pelosi.", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 11:11:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by esample1: quote: Originally posted by stec74: Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks? Uh, no. Actually Panetta IS questioning the accuracy of those documents in a letter here: This letter presents the most thorough information we have on dates, locations, and names of all Members of Congress who were briefed by the CIA on enhanced interrogation techniques. This information, however, is drawn from the past files of the CIA and represents MFRs completed at the time and notes that summarized the best recollections of those individuals. In the end, you and the Committee will have to determine whether this information is an accurate summary of what actually happened. We can make the MFRs available at CIA for staff review. \"http://theplumline.whorunsgov.com/wp-content/uploads/2009/05/2009-05-06-reyes-eit-letter0001.pdf\" From the other letter you linked to: quote: Since the Central Intelligence Agency provided the Committee an interim list of Members briefed on April 22, Director Panetta and his staff have conducted a painstaking and thorough review of over seven years' of records The result of this effort is enclosed. It provides a straightforward account of the extent of interaction with the Congress on this issue. Think I will take the word of the man who looked through seven years of records, has nothing to gain from saying his agency didn't lie, and is a career Democrat over \"flip flopper\" Pelosi. Why are you posting the first part of the letter, when Panetta is questioning the ACCURACY of those records in the second part of the letter? He clearly states that the information is based on \"Memorandums of Records and notes that summarized the best recollections of those individuals.\" That means the records were recorded later, not during the actual meetings.", 
        "intTime": 20090516, 
        "postID": 18, 
        "quote": "Originally posted by stec74: quote: Originally posted by esample1: quote: Originally posted by stec74: Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks? Uh, no. Actually Panetta IS questioning the accuracy of those documents in a letter here: This letter presents the most thorough information we have on dates, locations, and names of all Members of Congress who were briefed by the CIA on enhanced interrogation techniques. This information, however, is drawn from the past files of the CIA and represents MFRs completed at the time and notes that summarized the best recollections of those individuals. In the end, you and the Committee will have to determine whether this information is an accurate summary of what actually happened. We can make the MFRs available at CIA for staff review. \"http://theplumline.whorunsgov.com/wp-content/uploads/2009/05/2009-05-06-reyes-eit-letter0001.pdf\" From the other letter you linked to: quote: Since the Central Intelligence Agency provided the Committee an interim list of Members briefed on April 22, Director Panetta and his staff have conducted a painstaking and thorough review of over seven years' of records The result of this effort is enclosed. It provides a straightforward account of the extent of interaction with the Congress on this issue. Think I will take the word of the man who looked through seven years of records, has nothing to gain from saying his agency didn't lie, and is a career Democrat over \"flip flopper\" Pelosi.", 
        "reply": " Why are you posting the first part of the letter, when Panetta is questioning the ACCURACY of those records in the second part of the letter? He clearly states that the information is based on \"Memorandums of Records and notes that summarized the best recollections of those individuals.\" That means the records were recorded later, not during the actual meetings.", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 14:38:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by stec74: quote: Originally posted by esample1: quote: Originally posted by stec74: Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks? Uh, no. Actually Panetta IS questioning the accuracy of those documents in a letter here: This letter presents the most thorough information we have on dates, locations, and names of all Members of Congress who were briefed by the CIA on enhanced interrogation techniques. This information, however, is drawn from the past files of the CIA and represents MFRs completed at the time and notes that summarized the best recollections of those individuals. In the end, you and the Committee will have to determine whether this information is an accurate summary of what actually happened. We can make the MFRs available at CIA for staff review. \"http://theplumline.whorunsgov.com/wp-content/uploads/2009/05/2009-05-06-reyes-eit-letter0001.pdf\" From the other letter you linked to: quote: Since the Central Intelligence Agency provided the Committee an interim list of Members briefed on April 22, Director Panetta and his staff have conducted a painstaking and thorough review of over seven years' of records The result of this effort is enclosed. It provides a straightforward account of the extent of interaction with the Congress on this issue. Think I will take the word of the man who looked through seven years of records, has nothing to gain from saying his agency didn't lie, and is a career Democrat over \"flip flopper\" Pelosi. Why are you posting the first part of the letter, when Panetta is questioning the ACCURACY of those records in the second part of the letter? He clearly states that the information is based on \"Memorandums of Records and notes that summarized the best recollections of those individuals.\" That means the records were recorded later, not during the actual meetings. Did you see the enclosures included with Panetta's letter? No? Well neither did I because they are classified. Nowhere in his cover letter does he \"question\" the accuracy of the letter he only states that they come from MFRs and that the committee will have to decide if it is accurate or not. If Panetta didn't know for a fact that Pelosi was there why did he release his letter to his employees and the press yesterday? Even more important is why did Pelosi then change her stance that the CIA lied once he did release his letter? She is lying, you know she is lying, but unlike Panetta, you are letting your partisanship blind you.", 
        "intTime": 20090516, 
        "postID": 19, 
        "quote": "Originally posted by esample1: quote: Originally posted by stec74: quote: Originally posted by esample1: quote: Originally posted by stec74: Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks? Uh, no. Actually Panetta IS questioning the accuracy of those documents in a letter here: This letter presents the most thorough information we have on dates, locations, and names of all Members of Congress who were briefed by the CIA on enhanced interrogation techniques. This information, however, is drawn from the past files of the CIA and represents MFRs completed at the time and notes that summarized the best recollections of those individuals. In the end, you and the Committee will have to determine whether this information is an accurate summary of what actually happened. We can make the MFRs available at CIA for staff review. \"http://theplumline.whorunsgov.com/wp-content/uploads/2009/05/2009-05-06-reyes-eit-letter0001.pdf\" From the other letter you linked to: quote: Since the Central Intelligence Agency provided the Committee an interim list of Members briefed on April 22, Director Panetta and his staff have conducted a painstaking and thorough review of over seven years' of records The result of this effort is enclosed. It provides a straightforward account of the extent of interaction with the Congress on this issue. Think I will take the word of the man who looked through seven years of records, has nothing to gain from saying his agency didn't lie, and is a career Democrat over \"flip flopper\" Pelosi. Why are you posting the first part of the letter, when Panetta is questioning the ACCURACY of those records in the second part of the letter? He clearly states that the information is based on \"Memorandums of Records and notes that summarized the best recollections of those individuals.\" That means the records were recorded later, not during the actual meetings.", 
        "reply": " Did you see the enclosures included with Panetta's letter? No? Well neither did I because they are classified. Nowhere in his cover letter does he \"question\" the accuracy of the letter he only states that they come from MFRs and that the committee will have to decide if it is accurate or not. If Panetta didn't know for a fact that Pelosi was there why did he release his letter to his employees and the press yesterday? Even more important is why did Pelosi then change her stance that the CIA lied once he did release his letter? She is lying, you know she is lying, but unlike Panetta, you are letting your partisanship blind you.", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 17:01:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "stec74"
    }, 
    {
        "content": ">http://rawstory.com/08/news/2009/05/14/senator-says-cia-made-up-dates-of-torture-briefings-then-admitted-it/ In an interview in New York, retired Senator and former chairman of the Intelligence Committee, Bob Graham, stated that the CIA obfuscated dates on which they claimed he had been briefed about enhanced interrogation techniques. When confronted with indications proving otherwise, they admitted error. If they're making errors with some briefings that 'supposedly' occurred, why not those Pelosi claims she never got? This is one wrong agency to be engaged in creative record-keeping.", 
        "intTime": 20090515, 
        "postID": 20, 
        "quote": "", 
        "reply": ">http://rawstory.com/08/news/2009/05/14/senator-says-cia-made-up-dates-of-torture-briefings-then-admitted-it/ In an interview in New York, retired Senator and former chairman of the Intelligence Committee, Bob Graham, stated that the CIA obfuscated dates on which they claimed he had been briefed about enhanced interrogation techniques. When confronted with indications proving otherwise, they admitted error. If they're making errors with some briefings that 'supposedly' occurred, why not those Pelosi claims she never got? This is one wrong agency to be engaged in creative record-keeping.", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-15 17:49:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by popsiq: >http://rawstory.com/08/news/2009/05/14/senator-says-cia-made-up-dates-of-torture-briefings-then-admitted-it/ In an interview in New York, retired Senator and former chairman of the Intelligence Committee stated that the CIA obfuscated dates on which they claimed he had been briefed about enhanced interrogation techniques. When confronted with indications proving otherwise, they admitted error. If they're making errors with some briefings that 'supposedly' occurred, why not those Pelosi claims she never got? This is one wrong agency to be engaged in creative record-keeping. Exactly ... Panetta had better make sure he knows what he's talking about before making such statements. He's only being told about things that supposedly happened while under the Bush Administration. Fact is, the CIA fell under the \"Intelligence Consolidation\" led by Rumsfeld that totally politicized each and ever intel organization under George Bush. Why should any American believe Bush people? I don't. The CIA were also the agency that provided Colin Powell his faulty intel and aerial photos he used to justify the Iraq war to the UN during the run up to the Iraq invasion. We all found out that was completely bogus. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090515, 
        "postID": 21, 
        "quote": "Originally posted by popsiq: >http://rawstory.com/08/news/2009/05/14/senator-says-cia-made-up-dates-of-torture-briefings-then-admitted-it/ In an interview in New York, retired Senator and former chairman of the Intelligence Committee stated that the CIA obfuscated dates on which they claimed he had been briefed about enhanced interrogation techniques. When confronted with indications proving otherwise, they admitted error. If they're making errors with some briefings that 'supposedly' occurred, why not those Pelosi claims she never got? This is one wrong agency to be engaged in creative record-keeping.", 
        "reply": " Exactly ... Panetta had better make sure he knows what he's talking about before making such statements. He's only being told about things that supposedly happened while under the Bush Administration. Fact is, the CIA fell under the \"Intelligence Consolidation\" led by Rumsfeld that totally politicized each and ever intel organization under George Bush. Why should any American believe Bush people? I don't. The CIA were also the agency that provided Colin Powell his faulty intel and aerial photos he used to justify the Iraq war to the UN during the run up to the Iraq invasion. We all found out that was completely bogus. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-15 17:57:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "jack_flats"
    }, 
    {
        "content": "Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer!", 
        "intTime": 20090515, 
        "postID": 22, 
        "quote": "", 
        "reply": "Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer!", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-15 18:39:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Where oh where is brother Obama? I wonder why he has not made any statements on this matter yet? Is his TelePrompTer down?", 
        "intTime": 20090515, 
        "postID": 23, 
        "quote": "", 
        "reply": "Where oh where is brother Obama? I wonder why he has not made any statements on this matter yet? Is his TelePrompTer down?", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-15 19:20:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Where oh where is brother Obama? I wonder why he has not made any statements on this matter yet? Is his TelePrompTer down? Obama is going to steer clear, see how the wind blows, and then throw Patooie under the bus. Unfortunately she won't go without a fight and that will take till the next election...... stock up on . One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090515, 
        "postID": 24, 
        "quote": "Originally posted by Duster6: Where oh where is brother Obama? I wonder why he has not made any statements on this matter yet? Is his TelePrompTer down?", 
        "reply": " Obama is going to steer clear, see how the wind blows, and then throw Patooie under the bus. Unfortunately she won't go without a fight and that will take till the next election...... stock up on . One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-15 19:28:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "So which neo-Marxist do you believe: Pelosi? Graham? Panetta? Either she's an incompetent fool who didn't understand the briefing in front of her or she's lying to make political points with her far left voting base. Regardless, both answers mean she is unfit to hold the number 3 slot in the US Government. She should be removed from her post as Speaker.", 
        "intTime": 20090515, 
        "postID": 25, 
        "quote": "", 
        "reply": "So which neo-Marxist do you believe: Pelosi? Graham? Panetta? Either she's an incompetent fool who didn't understand the briefing in front of her or she's lying to make political points with her far left voting base. Regardless, both answers mean she is unfit to hold the number 3 slot in the US Government. She should be removed from her post as Speaker.", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-15 19:39:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer! \"He has a quirky habit of keeping a detailed log of his daily activities on color-coded notebooks, which some say may have cost him a spot on past vice-presidential tickets. He keeps all of these notes in a file cabinet arranged by month and year. A great champion for his home state, Graham always kept Florida orange juice on hand in his Senate office and was rarely seen without his trademark Florida tie.\"] \"Graham said that when he asked the CIA when he had been briefed on the program, the CIA gave him the dates of four briefings, two in April 2002 and two in September 2002, when they claimed they had briefed him about the program. But after Graham consulted his own records, he pointed out that on two of those dates, he had not attended any briefing. After Graham pointed this out to the CIA, they conceded their own dates were incorrect.\" \"As Chairman of the Senate Intelligence Committee, Senator Graham opposed the War in Iraq for fear it would divert U.S. attention from the fight in Afghanistan. After carefully reviewing information and meeting with military leaders in February 2002, he decided the war would be a \"distraction\" that would end poorly. He continues to oppose the Iraq War today.\" So lets get this straight he is smart enough to get re-elected,called the Iraq war a mistake from the start and with his notes prove the CIA was lying about having 2 meetings with him yet you call him a fool? --Savage", 
        "intTime": 20090515, 
        "postID": 26, 
        "quote": "Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer!", 
        "reply": " \"He has a quirky habit of keeping a detailed log of his daily activities on color-coded notebooks, which some say may have cost him a spot on past vice-presidential tickets. He keeps all of these notes in a file cabinet arranged by month and year. A great champion for his home state, Graham always kept Florida orange juice on hand in his Senate office and was rarely seen without his trademark Florida tie.\"] \"Graham said that when he asked the CIA when he had been briefed on the program, the CIA gave him the dates of four briefings, two in April 2002 and two in September 2002, when they claimed they had briefed him about the program. But after Graham consulted his own records, he pointed out that on two of those dates, he had not attended any briefing. After Graham pointed this out to the CIA, they conceded their own dates were incorrect.\" \"As Chairman of the Senate Intelligence Committee, Senator Graham opposed the War in Iraq for fear it would divert U.S. attention from the fight in Afghanistan. After carefully reviewing information and meeting with military leaders in February 2002, he decided the war would be a \"distraction\" that would end poorly. He continues to oppose the Iraq War today.\" So lets get this straight he is smart enough to get re-elected,called the Iraq war a mistake from the start and with his notes prove the CIA was lying about having 2 meetings with him yet you call him a fool? --Savage", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-15 20:45:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "A_Savage"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Where oh where is brother Obama? I wonder why he has not made any statements on this matter yet? Is his TelePrompTer down? Why should he? Nothing he could ever say would be right in this instance, and he has better and more important issues on his plate. This is a \"Separation of Powers\" issue. He is of the Executive branch, and Speaker Pelosi, the Legislative. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090515, 
        "postID": 27, 
        "quote": "Originally posted by Duster6: Where oh where is brother Obama? I wonder why he has not made any statements on this matter yet? Is his TelePrompTer down?", 
        "reply": " Why should he? Nothing he could ever say would be right in this instance, and he has better and more important issues on his plate. This is a \"Separation of Powers\" issue. He is of the Executive branch, and Speaker Pelosi, the Legislative. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-15 20:56:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer! From what is being reported, Graham was a very dedicated note taker. He has notebooks that he used to keep track of just about everything he did on a daily basis. Other wise why did the CIA back off on the dates they said he was briefed? Apparently his records of the specific dates WERE better than theirs. quote: Excerpts from a Times article in 2000. 8Quote: \"12:50: Cissy thinks she's going into labor 1:15: Cissy preparing to leave for Baptist Hospital 1:20-1:30: MLTH. Bedroom, bathroom. Dress in blue slacks 1:30-1:45: Rewind Ace Ventura 2:00: Adele ready to go. Drive to Baptist Hospital 2:15: Stop at [video store] to return Ace Ventura 6:00-7:05: Cissy in examining room, delivery room, watch ABC News. Cissy commences preparation for labor 7:05-8:40: Drive to Bennigan's Restaurant with Adele. Listen to New England Patriots-Miami Dolphins (39-35) 7:20-8:25: Bennigan's. Eat supper (ham and cheese sandwich). Return to hospital 9:05-9:10: Waiting room. Read NYT, mingle 11:00-12:45: Waiting room. Watch CNN, CBS News 12:44: It's a boy!\" (Graham notebook entry from September 1994, as quoted in Time, July 17, 2000.) quote: Quote: \"8:25 Awake at MLTH, dress in red golf shirt, khaki pants 8:50-9:15 kitchen—brew coffee—eat breakfast (Raisin Bran cereal) … 9:45-10 sign mail collect materials Adele gives President Clinton Coke can … 10:45-10:55 Carriage cleaners—pick up Adele's dry cleaning Food Spot to buy Herald, NYT … 11:15-11:20: MLTH kitchen—give Adele dry cleaning—newspapers— collect Coca Cola … 12:30-1:15: grill—eat lunch (cheeseburger) 1:15-1:20: walk, cart to 1st tee 1:20-6:10: play golf with President Clinton, Hugh Rodham, Aaron Podhurst (1:22—4:47:07:69) Start of the round and duration, to hundredth of a second … 11:20-11:50 MLTH bedroom, bathroom dress for sleep watch XFL Chicago at LA (Graham notebook entry from Feb. 10, 2001, as quoted in the New York Times, June 4, 2003.) Graham said in July 2003: \"It's mainly a list of [things] to do that day. It is a recording of the names of people that I meet, and what their concerns are, so that I can follow up. … It's been a valuable part of my effort to be disciplined and to be responsive to the people by assuring that I have it written down, what they expect, and that I can check off that that request was responded to.\" As to the odd minutiae, Graham said, \"All those things are intended to help my ability to recall what the environment was in which something occurred, and that helps me remember the details.\" http://www.slate.com/id/2089115/ It would seem that keeping a daily log enabled him to show that he, and not the CIA was right, at least about the dates. Graham talking about the notebooks and other things in 2005. http://www.thecrimson.com/article.aspx?ref=509202 Graham: CIA was 'loose with the facts' about interrogation briefings By Nathan Crabbe Sun staff writer Published: Friday, May 15, 2009 at 4:42 p.m. Last Modified: Friday, May 15, 2009 at 4:42 p.m. Former U.S. Sen. Bob Graham said Friday that his detailed diaries show Democrats were told less about the interrogation of terrorists than the CIA claims. Graham said the CIA claimed he was briefed four times about extreme interrogation techniques as chairman of the Senate Intelligence Committee. He said he called the head of archives at the University of Florida, where his notebooks are stored, to check if he had listed the briefings. \"We established that three out of four of these alleged briefings never took place,\" he said. House Speaker Nancy Pelosi has been under fire this week about her knowledge of so-called enhanced interrogation techniques, which some have deemed torture. While the CIA has said she was fully briefed about the methods, Pelosi said she was briefed once and misled about the use of waterboarding. For his part, Graham said he doesn't recall being told about waterboarding or other extreme techniques in his briefing. He believes that \"misinformation is out there\" based on his experience. \"I think the Republican-led CIA of that era, among other things, was loose with the facts and loose with the record,\" he said. Graham, Florida governor from 1989 1979 to 1987 and U.S. senator from 1987 to 2005, is the namesake of UF's Graham Center for Public Service. He donated his notebooks to the university, but they are currently unavailable to the public. Carl Van Ness, UF historian and curator of archives and manuscripts, said the notebooks contain incredibly detailed, almost minute-by-minute, logs of Graham's activities. He said they also include nearly everything Graham put into his pockets that day. \"I've never seen anything like it as an archivist,\" he said. Van Ness said an issue with tax laws, involving whether the records are available to the public, has kept the notebooks under seal. He said he only accesses the notebooks at Graham's instruction. \"At his request, we'll break the seal,\" he said. He said one of the notebooks that Graham sought had been loaned to the former senator, but the others were in the archives. He said he couldn't comment about what they said. Graham said the CIA reported he was briefed twice in April 2002 and twice in September 2002. But he said the notebooks show he was briefed just once, on Sept. 27 of that year. http://www.gainesville.com/article/20090515/ARTICLES/905159954/1002 You say he has a bad memory, but his keeping track of his daily schedule for years would add a completely different perspective to that. Wouldn’t you say? If you write everything down, where’s the need to remember it? By the way, got any links to your assertion that he has a memory problem?", 
        "intTime": 20090515, 
        "postID": 28, 
        "quote": "Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer!", 
        "reply": " From what is being reported, Graham was a very dedicated note taker. He has notebooks that he used to keep track of just about everything he did on a daily basis. Other wise why did the CIA back off on the dates they said he was briefed? Apparently his records of the specific dates WERE better than theirs. quote: Excerpts from a Times article in 2000. 8Quote: \"12:50: Cissy thinks she's going into labor 1:15: Cissy preparing to leave for Baptist Hospital 1:20-1:30: MLTH. Bedroom, bathroom. Dress in blue slacks 1:30-1:45: Rewind Ace Ventura 2:00: Adele ready to go. Drive to Baptist Hospital 2:15: Stop at [video store] to return Ace Ventura 6:00-7:05: Cissy in examining room, delivery room, watch ABC News. Cissy commences preparation for labor 7:05-8:40: Drive to Bennigan's Restaurant with Adele. Listen to New England Patriots-Miami Dolphins (39-35) 7:20-8:25: Bennigan's. Eat supper (ham and cheese sandwich). Return to hospital 9:05-9:10: Waiting room. Read NYT, mingle 11:00-12:45: Waiting room. Watch CNN, CBS News 12:44: It's a boy!\" (Graham notebook entry from September 1994, as quoted in Time, July 17, 2000.) quote: Quote: \"8:25 Awake at MLTH, dress in red golf shirt, khaki pants 8:50-9:15 kitchen—brew coffee—eat breakfast (Raisin Bran cereal) … 9:45-10 sign mail collect materials Adele gives President Clinton Coke can … 10:45-10:55 Carriage cleaners—pick up Adele's dry cleaning Food Spot to buy Herald, NYT … 11:15-11:20: MLTH kitchen—give Adele dry cleaning—newspapers— collect Coca Cola … 12:30-1:15: grill—eat lunch (cheeseburger) 1:15-1:20: walk, cart to 1st tee 1:20-6:10: play golf with President Clinton, Hugh Rodham, Aaron Podhurst (1:22—4:47:07:69) Start of the round and duration, to hundredth of a second … 11:20-11:50 MLTH bedroom, bathroom dress for sleep watch XFL Chicago at LA (Graham notebook entry from Feb. 10, 2001, as quoted in the New York Times, June 4, 2003.) Graham said in July 2003: \"It's mainly a list of [things] to do that day. It is a recording of the names of people that I meet, and what their concerns are, so that I can follow up. … It's been a valuable part of my effort to be disciplined and to be responsive to the people by assuring that I have it written down, what they expect, and that I can check off that that request was responded to.\" As to the odd minutiae, Graham said, \"All those things are intended to help my ability to recall what the environment was in which something occurred, and that helps me remember the details.\" http://www.slate.com/id/2089115/ It would seem that keeping a daily log enabled him to show that he, and not the CIA was right, at least about the dates. Graham talking about the notebooks and other things in 2005. http://www.thecrimson.com/article.aspx?ref=509202 Graham: CIA was 'loose with the facts' about interrogation briefings By Nathan Crabbe Sun staff writer Published: Friday, May 15, 2009 at 4:42 p.m. Last Modified: Friday, May 15, 2009 at 4:42 p.m. Former U.S. Sen. Bob Graham said Friday that his detailed diaries show Democrats were told less about the interrogation of terrorists than the CIA claims. Graham said the CIA claimed he was briefed four times about extreme interrogation techniques as chairman of the Senate Intelligence Committee. He said he called the head of archives at the University of Florida, where his notebooks are stored, to check if he had listed the briefings. \"We established that three out of four of these alleged briefings never took place,\" he said. House Speaker Nancy Pelosi has been under fire this week about her knowledge of so-called enhanced interrogation techniques, which some have deemed torture. While the CIA has said she was fully briefed about the methods, Pelosi said she was briefed once and misled about the use of waterboarding. For his part, Graham said he doesn't recall being told about waterboarding or other extreme techniques in his briefing. He believes that \"misinformation is out there\" based on his experience. \"I think the Republican-led CIA of that era, among other things, was loose with the facts and loose with the record,\" he said. Graham, Florida governor from 1989 1979 to 1987 and U.S. senator from 1987 to 2005, is the namesake of UF's Graham Center for Public Service. He donated his notebooks to the university, but they are currently unavailable to the public. Carl Van Ness, UF historian and curator of archives and manuscripts, said the notebooks contain incredibly detailed, almost minute-by-minute, logs of Graham's activities. He said they also include nearly everything Graham put into his pockets that day. \"I've never seen anything like it as an archivist,\" he said. Van Ness said an issue with tax laws, involving whether the records are available to the public, has kept the notebooks under seal. He said he only accesses the notebooks at Graham's instruction. \"At his request, we'll break the seal,\" he said. He said one of the notebooks that Graham sought had been loaned to the former senator, but the others were in the archives. He said he couldn't comment about what they said. Graham said the CIA reported he was briefed twice in April 2002 and twice in September 2002. But he said the notebooks show he was briefed just once, on Sept. 27 of that year. http://www.gainesville.com/article/20090515/ARTICLES/905159954/1002 You say he has a bad memory, but his keeping track of his daily schedule for years would add a completely different perspective to that. Wouldn’t you say? If you write everything down, where’s the need to remember it? By the way, got any links to your assertion that he has a memory problem?", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-15 21:04:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "jdksfcret"
    }, 
    {
        "content": "quote: Originally posted by A_Savage: quote: Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer! \"He has a quirky habit of keeping a detailed log of his daily activities on color-coded notebooks, which some say may have cost him a spot on past vice-presidential tickets. He keeps all of these notes in a file cabinet arranged by month and year. A great champion for his home state, Graham always kept Florida orange juice on hand in his Senate office and was rarely seen without his trademark Florida tie.\"] \"Graham said that when he asked the CIA when he had been briefed on the program, the CIA gave him the dates of four briefings, two in April 2002 and two in September 2002, when they claimed they had briefed him about the program. But after Graham consulted his own records, he pointed out that on two of those dates, he had not attended any briefing. After Graham pointed this out to the CIA, they conceded their own dates were incorrect.\" \"As Chairman of the Senate Intelligence Committee, Senator Graham opposed the War in Iraq for fear it would divert U.S. attention from the fight in Afghanistan. After carefully reviewing information and meeting with military leaders in February 2002, he decided the war would be a \"distraction\" that would end poorly. He continues to oppose the Iraq War today.\" So lets get this straight he is smart enough to get re-elected,called the Iraq war a mistake from the start and with his notes prove the CIA was lying about having 2 meetings with him yet you call him a fool? --Savage Sounds like Graham would make a great CIA chief, or head of NatSec. Coping with that senility stuff has given him little Heinie's monk-like attention to detail that seems sorely lacking in the incumbents.", 
        "intTime": 20090516, 
        "postID": 29, 
        "quote": "Originally posted by A_Savage: quote: Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer! \"He has a quirky habit of keeping a detailed log of his daily activities on color-coded notebooks, which some say may have cost him a spot on past vice-presidential tickets. He keeps all of these notes in a file cabinet arranged by month and year. A great champion for his home state, Graham always kept Florida orange juice on hand in his Senate office and was rarely seen without his trademark Florida tie.\"] \"Graham said that when he asked the CIA when he had been briefed on the program, the CIA gave him the dates of four briefings, two in April 2002 and two in September 2002, when they claimed they had briefed him about the program. But after Graham consulted his own records, he pointed out that on two of those dates, he had not attended any briefing. After Graham pointed this out to the CIA, they conceded their own dates were incorrect.\" \"As Chairman of the Senate Intelligence Committee, Senator Graham opposed the War in Iraq for fear it would divert U.S. attention from the fight in Afghanistan. After carefully reviewing information and meeting with military leaders in February 2002, he decided the war would be a \"distraction\" that would end poorly. He continues to oppose the Iraq War today.\" So lets get this straight he is smart enough to get re-elected,called the Iraq war a mistake from the start and with his notes prove the CIA was lying about having 2 meetings with him yet you call him a fool? --Savage", 
        "reply": " Sounds like Graham would make a great CIA chief, or head of NatSec. Coping with that senility stuff has given him little Heinie's monk-like attention to detail that seems sorely lacking in the incumbents.", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 02:48:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer! Looks like you'll need that mouth-rinse after this one Busnrete. There seems to be something about Graham with which you're not familiar, his record-keeping. These are donkey-sized droppings and plenty of 'em.", 
        "intTime": 20090516, 
        "postID": 30, 
        "quote": "Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer!", 
        "reply": " Looks like you'll need that mouth-rinse after this one Busnrete. There seems to be something about Graham with which you're not familiar, his record-keeping. These are donkey-sized droppings and plenty of 'em.", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 02:51:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by A_Savage: quote: Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer! \"He has a quirky habit of keeping a detailed log of his daily activities on color-coded notebooks, which some say may have cost him a spot on past vice-presidential tickets. He keeps all of these notes in a file cabinet arranged by month and year. A great champion for his home state, Graham always kept Florida orange juice on hand in his Senate office and was rarely seen without his trademark Florida tie.\"] Quirky, yes and a champion for Florida, yes. But the discussion is NOT whether the meetings took place, it's what was contained in the meetings--which cannot be recorded. \"Graham said that when he asked the CIA when he had been briefed on the program, the CIA gave him the dates of four briefings, two in April 2002 and two in September 2002, when they claimed they had briefed him about the program. But after Graham consulted his own records, he pointed out that on two of those dates, he had not attended any briefing. After Graham pointed this out to the CIA, they conceded their own dates were incorrect.\" (quote)For his part, Graham said he doesn't recall being told about waterboarding or other extreme techniques in his briefing.(quote) \"As Chairman of the Senate Intelligence Committee, Senator Graham opposed the War in Iraq for fear it would divert U.S. attention from the fight in Afghanistan. After carefully reviewing information and meeting with military leaders in February 2002, he decided the war would be a \"distraction\" that would end poorly. He continues to oppose the Iraq War today.\" Many were re-elected after opposing the war! So lets get this straight he is smart enough to get re-elected,called the Iraq war a mistake from the start and with his notes prove the CIA was lying about having 2 meetings with him yet you call him a fool? --Savage I never called him a fool! Yes, he did loose some confidence votes nationally! Too his credit, he didn't appear as confused as pelosi did. Even with her notes, she was confused! Bottom line here is that it's a memory game!", 
        "intTime": 20090516, 
        "postID": 31, 
        "quote": "Originally posted by A_Savage: quote: Originally posted by busnrete8: Bull! Anyone (from Florida as I am) familiar with Bob Graham knows he had major memory problems (became almost senile) during his last few years in office and decided to retire! NOW, seven years later, his memory suddenly improves? Then, he couldn't keep anything straight from one week to the next! Graham is now a character reference for pelosi! Pass the pretzels and beer! \"He has a quirky habit of keeping a detailed log of his daily activities on color-coded notebooks, which some say may have cost him a spot on past vice-presidential tickets. He keeps all of these notes in a file cabinet arranged by month and year. A great champion for his home state, Graham always kept Florida orange juice on hand in his Senate office and was rarely seen without his trademark Florida tie.\"] Quirky, yes and a champion for Florida, yes. But the discussion is NOT whether the meetings took place, it's what was contained in the meetings--which cannot be recorded. \"Graham said that when he asked the CIA when he had been briefed on the program, the CIA gave him the dates of four briefings, two in April 2002 and two in September 2002, when they claimed they had briefed him about the program. But after Graham consulted his own records, he pointed out that on two of those dates, he had not attended any briefing. After Graham pointed this out to the CIA, they conceded their own dates were incorrect.\" (quote)For his part, Graham said he doesn't recall being told about waterboarding or other extreme techniques in his briefing.(quote) \"As Chairman of the Senate Intelligence Committee, Senator Graham opposed the War in Iraq for fear it would divert U.S. attention from the fight in Afghanistan. After carefully reviewing information and meeting with military leaders in February 2002, he decided the war would be a \"distraction\" that would end poorly. He continues to oppose the Iraq War today.\" Many were re-elected after opposing the war! So lets get this straight he is smart enough to get re-elected,called the Iraq war a mistake from the start and with his notes prove the CIA was lying about having 2 meetings with him yet you call him a fool? --Savage", 
        "reply": " I never called him a fool! Yes, he did loose some confidence votes nationally! Too his credit, he didn't appear as confused as pelosi did. Even with her notes, she was confused! Bottom line here is that it's a memory game!", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 04:59:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks?", 
        "intTime": 20090516, 
        "postID": 32, 
        "quote": "", 
        "reply": "Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks?", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 05:31:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "stec74"
    }, 
    {
        "content": "Her Highness was just on the news back-peddling. Seems she now \"recalls\" the briefing. What a POS.", 
        "intTime": 20090516, 
        "postID": 33, 
        "quote": "", 
        "reply": "Her Highness was just on the news back-peddling. Seems she now \"recalls\" the briefing. What a POS.", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 08:59:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "shuman14"
    }, 
    {
        "content": "I wonder if his notes contain mention the rise of personal taxes of 300% in the eight years he was governor of the Sunshine State. Or, the ISI memo given him by one of our spooks in August 2001 that an attack was imminent. September 11, 2001 his meeting a delegation from Pakistan was interupted by the distruction of the WTC, the Pentagon and crash in Pa. Where was Bob when the 2000 recount, recount, recount, recount was going on? A friend went to U of Miami with Senator Graham. Both were recruited by the CIA. As the story goes the Senator goes into selling real estate and my friend became a millionaire buying real estate. Graham find the CIA too appetizing then either. In reviewing Mr. Graham Intelligence committee after his retirement, much of the interrogation techniques that has been argued to death were known well in advance Abu Zayudah. Poor old Dave wouldn't have a thing to do without 95 torture threads to keep up with.", 
        "intTime": 20090516, 
        "postID": 34, 
        "quote": "", 
        "reply": "I wonder if his notes contain mention the rise of personal taxes of 300% in the eight years he was governor of the Sunshine State. Or, the ISI memo given him by one of our spooks in August 2001 that an attack was imminent. September 11, 2001 his meeting a delegation from Pakistan was interupted by the distruction of the WTC, the Pentagon and crash in Pa. Where was Bob when the 2000 recount, recount, recount, recount was going on? A friend went to U of Miami with Senator Graham. Both were recruited by the CIA. As the story goes the Senator goes into selling real estate and my friend became a millionaire buying real estate. Graham find the CIA too appetizing then either. In reviewing Mr. Graham Intelligence committee after his retirement, much of the interrogation techniques that has been argued to death were known well in advance Abu Zayudah. Poor old Dave wouldn't have a thing to do without 95 torture threads to keep up with.", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 09:56:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by stec74: Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks? Uh, no. Actually Panetta IS questioning the accuracy of those documents in a letter here: This letter presents the most thorough information we have on dates, locations, and names of all Members of Congress who were briefed by the CIA on enhanced interrogation techniques. This information, however, is drawn from the past files of the CIA and represents MFRs completed at the time and notes that summarized the best recollections of those individuals. In the end, you and the Committee will have to determine whether this information is an accurate summary of what actually happened. We can make the MFRs available at CIA for staff review. \"http://theplumline.whorunsgov.com/wp-content/uploads/2009/05/2009-05-06-reyes-eit-letter0001.pdf\"", 
        "intTime": 20090516, 
        "postID": 35, 
        "quote": "Originally posted by stec74: Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks?", 
        "reply": " Uh, no. Actually Panetta IS questioning the accuracy of those documents in a letter here: This letter presents the most thorough information we have on dates, locations, and names of all Members of Congress who were briefed by the CIA on enhanced interrogation techniques. This information, however, is drawn from the past files of the CIA and represents MFRs completed at the time and notes that summarized the best recollections of those individuals. In the end, you and the Committee will have to determine whether this information is an accurate summary of what actually happened. We can make the MFRs available at CIA for staff review. \"http://theplumline.whorunsgov.com/wp-content/uploads/2009/05/2009-05-06-reyes-eit-letter0001.pdf\"", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 10:37:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by stec74: Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks? Uh, no. Actually Panetta IS questioning the accuracy of those documents in a letter here: This letter presents the most thorough information we have on dates, locations, and names of all Members of Congress who were briefed by the CIA on enhanced interrogation techniques. This information, however, is drawn from the past files of the CIA and represents MFRs completed at the time and notes that summarized the best recollections of those individuals. In the end, you and the Committee will have to determine whether this information is an accurate summary of what actually happened. We can make the MFRs available at CIA for staff review. \"http://theplumline.whorunsgov.com/wp-content/uploads/2009/05/2009-05-06-reyes-eit-letter0001.pdf\" From the other letter you linked to: quote: Since the Central Intelligence Agency provided the Committee an interim list of Members briefed on April 22, Director Panetta and his staff have conducted a painstaking and thorough review of over seven years' of records The result of this effort is enclosed. It provides a straightforward account of the extent of interaction with the Congress on this issue. Think I will take the word of the man who looked through seven years of records, has nothing to gain from saying his agency didn't lie, and is a career Democrat over \"flip flopper\" Pelosi.", 
        "intTime": 20090516, 
        "postID": 36, 
        "quote": "Originally posted by esample1: quote: Originally posted by stec74: Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks? Uh, no. Actually Panetta IS questioning the accuracy of those documents in a letter here: This letter presents the most thorough information we have on dates, locations, and names of all Members of Congress who were briefed by the CIA on enhanced interrogation techniques. This information, however, is drawn from the past files of the CIA and represents MFRs completed at the time and notes that summarized the best recollections of those individuals. In the end, you and the Committee will have to determine whether this information is an accurate summary of what actually happened. We can make the MFRs available at CIA for staff review. \"http://theplumline.whorunsgov.com/wp-content/uploads/2009/05/2009-05-06-reyes-eit-letter0001.pdf\"", 
        "reply": " From the other letter you linked to: quote: Since the Central Intelligence Agency provided the Committee an interim list of Members briefed on April 22, Director Panetta and his staff have conducted a painstaking and thorough review of over seven years' of records The result of this effort is enclosed. It provides a straightforward account of the extent of interaction with the Congress on this issue. Think I will take the word of the man who looked through seven years of records, has nothing to gain from saying his agency didn't lie, and is a career Democrat over \"flip flopper\" Pelosi.", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 11:11:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by esample1: quote: Originally posted by stec74: Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks? Uh, no. Actually Panetta IS questioning the accuracy of those documents in a letter here: This letter presents the most thorough information we have on dates, locations, and names of all Members of Congress who were briefed by the CIA on enhanced interrogation techniques. This information, however, is drawn from the past files of the CIA and represents MFRs completed at the time and notes that summarized the best recollections of those individuals. In the end, you and the Committee will have to determine whether this information is an accurate summary of what actually happened. We can make the MFRs available at CIA for staff review. \"http://theplumline.whorunsgov.com/wp-content/uploads/2009/05/2009-05-06-reyes-eit-letter0001.pdf\" From the other letter you linked to: quote: Since the Central Intelligence Agency provided the Committee an interim list of Members briefed on April 22, Director Panetta and his staff have conducted a painstaking and thorough review of over seven years' of records The result of this effort is enclosed. It provides a straightforward account of the extent of interaction with the Congress on this issue. Think I will take the word of the man who looked through seven years of records, has nothing to gain from saying his agency didn't lie, and is a career Democrat over \"flip flopper\" Pelosi. Why are you posting the first part of the letter, when Panetta is questioning the ACCURACY of those records in the second part of the letter? He clearly states that the information is based on \"Memorandums of Records and notes that summarized the best recollections of those individuals.\" That means the records were recorded later, not during the actual meetings.", 
        "intTime": 20090516, 
        "postID": 37, 
        "quote": "Originally posted by stec74: quote: Originally posted by esample1: quote: Originally posted by stec74: Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks? Uh, no. Actually Panetta IS questioning the accuracy of those documents in a letter here: This letter presents the most thorough information we have on dates, locations, and names of all Members of Congress who were briefed by the CIA on enhanced interrogation techniques. This information, however, is drawn from the past files of the CIA and represents MFRs completed at the time and notes that summarized the best recollections of those individuals. In the end, you and the Committee will have to determine whether this information is an accurate summary of what actually happened. We can make the MFRs available at CIA for staff review. \"http://theplumline.whorunsgov.com/wp-content/uploads/2009/05/2009-05-06-reyes-eit-letter0001.pdf\" From the other letter you linked to: quote: Since the Central Intelligence Agency provided the Committee an interim list of Members briefed on April 22, Director Panetta and his staff have conducted a painstaking and thorough review of over seven years' of records The result of this effort is enclosed. It provides a straightforward account of the extent of interaction with the Congress on this issue. Think I will take the word of the man who looked through seven years of records, has nothing to gain from saying his agency didn't lie, and is a career Democrat over \"flip flopper\" Pelosi.", 
        "reply": " Why are you posting the first part of the letter, when Panetta is questioning the ACCURACY of those records in the second part of the letter? He clearly states that the information is based on \"Memorandums of Records and notes that summarized the best recollections of those individuals.\" That means the records were recorded later, not during the actual meetings.", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 14:38:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by esample1: quote: Originally posted by stec74: quote: Originally posted by esample1: quote: Originally posted by stec74: Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks? Uh, no. Actually Panetta IS questioning the accuracy of those documents in a letter here: This letter presents the most thorough information we have on dates, locations, and names of all Members of Congress who were briefed by the CIA on enhanced interrogation techniques. This information, however, is drawn from the past files of the CIA and represents MFRs completed at the time and notes that summarized the best recollections of those individuals. In the end, you and the Committee will have to determine whether this information is an accurate summary of what actually happened. We can make the MFRs available at CIA for staff review. \"http://theplumline.whorunsgov.com/wp-content/uploads/2009/05/2009-05-06-reyes-eit-letter0001.pdf\" From the other letter you linked to: quote: Since the Central Intelligence Agency provided the Committee an interim list of Members briefed on April 22, Director Panetta and his staff have conducted a painstaking and thorough review of over seven years' of records The result of this effort is enclosed. It provides a straightforward account of the extent of interaction with the Congress on this issue. Think I will take the word of the man who looked through seven years of records, has nothing to gain from saying his agency didn't lie, and is a career Democrat over \"flip flopper\" Pelosi. Why are you posting the first part of the letter, when Panetta is questioning the ACCURACY of those records in the second part of the letter? He clearly states that the information is based on \"Memorandums of Records and notes that summarized the best recollections of those individuals.\" That means the records were recorded later, not during the actual meetings. Did you see the enclosures included with Panetta's letter? No? Well neither did I because they are classified. Nowhere in his cover letter does he \"question\" the accuracy of the letter he only states that they come from MFRs and that the committee will have to decide if it is accurate or not. If Panetta didn't know for a fact that Pelosi was there why did he release his letter to his employees and the press yesterday? Even more important is why did Pelosi then change her stance that the CIA lied once he did release his letter? She is lying, you know she is lying, but unlike Panetta, you are letting your partisanship blind you.", 
        "intTime": 20090516, 
        "postID": 38, 
        "quote": "Originally posted by esample1: quote: Originally posted by stec74: quote: Originally posted by esample1: quote: Originally posted by stec74: Wow. Bob Graham was able to prove that the dates given in the CIA's Unclassified memos were inaccurate. Something that the CIA said was a possibility in the letter that accompanied the memos. Panetta has access to ALL OF THE DOCUMENTS from those briefings and he says his agency, THAT HE JUST TOOK OVER, is telling the truth about the briefings that happened under a Republican administration. What possible reason would the CIA Director have for lying? If his agency was wrong all he has to do is point to the previous administration. If he needs to learn how to look backwards and lay blame, I am sure there are plenty of other Dems in D.C. that are willing to teach him how to do just that. And if Pelosi isn't lying, why has her story changed five times over the past couple of weeks? Uh, no. Actually Panetta IS questioning the accuracy of those documents in a letter here: This letter presents the most thorough information we have on dates, locations, and names of all Members of Congress who were briefed by the CIA on enhanced interrogation techniques. This information, however, is drawn from the past files of the CIA and represents MFRs completed at the time and notes that summarized the best recollections of those individuals. In the end, you and the Committee will have to determine whether this information is an accurate summary of what actually happened. We can make the MFRs available at CIA for staff review. \"http://theplumline.whorunsgov.com/wp-content/uploads/2009/05/2009-05-06-reyes-eit-letter0001.pdf\" From the other letter you linked to: quote: Since the Central Intelligence Agency provided the Committee an interim list of Members briefed on April 22, Director Panetta and his staff have conducted a painstaking and thorough review of over seven years' of records The result of this effort is enclosed. It provides a straightforward account of the extent of interaction with the Congress on this issue. Think I will take the word of the man who looked through seven years of records, has nothing to gain from saying his agency didn't lie, and is a career Democrat over \"flip flopper\" Pelosi. Why are you posting the first part of the letter, when Panetta is questioning the ACCURACY of those records in the second part of the letter? He clearly states that the information is based on \"Memorandums of Records and notes that summarized the best recollections of those individuals.\" That means the records were recorded later, not during the actual meetings.", 
        "reply": " Did you see the enclosures included with Panetta's letter? No? Well neither did I because they are classified. Nowhere in his cover letter does he \"question\" the accuracy of the letter he only states that they come from MFRs and that the committee will have to decide if it is accurate or not. If Panetta didn't know for a fact that Pelosi was there why did he release his letter to his employees and the press yesterday? Even more important is why did Pelosi then change her stance that the CIA lied once he did release his letter? She is lying, you know she is lying, but unlike Panetta, you are letting your partisanship blind you.", 
        "threadID": "672198221_4190004322001", 
        "time": "2009-05-16 17:01:00", 
        "title": "Bob Graham Backs Pelosi", 
        "userID": "stec74"
    }
]