[
    {
        "content": "quote: European Muslims have much more loyalty to the countries they live in than is generally believed, a survey says. The report by Gallup and the Coexist Foundation says 77% of British Muslims identified with the UK, compared with 50% of the general public. There was a similar finding in Germany, the survey says. The authors say their report counters a commonly-held view that measures to combat Islamic militancy may have alienated many European Muslims. \"This research shows that many of the assumptions about Muslims and integration are wide of the mark,\" said Dalia Mogahed of the Gallup Center for Muslim Studies and co-author of the report. \"European Muslims want to be part of the wider community and contribute even more to society,\" she said. The findings of the report are surprising, because since the 11 September attacks in the US commentators have repeatedly questioned the loyalties of European Muslims to the countries they live in, the BBC's Rob Broomby says. (.....) +http://news.bbc.co.uk/2/hi/uk_news/8038398.stm \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090508, 
        "postID": 1, 
        "quote": "European Muslims have much more loyalty to the countries they live in than is generally believed, a survey says. The report by Gallup and the Coexist Foundation says 77% of British Muslims identified with the UK, compared with 50% of the general public. There was a similar finding in Germany, the survey says. The authors say their report counters a commonly-held view that measures to combat Islamic militancy may have alienated many European Muslims. \"This research shows that many of the assumptions about Muslims and integration are wide of the mark,\" said Dalia Mogahed of the Gallup Center for Muslim Studies and co-author of the report. \"European Muslims want to be part of the wider community and contribute even more to society,\" she said. The findings of the report are surprising, because since the 11 September attacks in the US commentators have repeatedly questioned the loyalties of European Muslims to the countries they live in, the BBC's Rob Broomby says. (.....)", 
        "reply": " +http://news.bbc.co.uk/2/hi/uk_news/8038398.stm \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6350018222001", 
        "time": "2009-05-08 08:10:00", 
        "title": "Muslims 'loyal to Europe'", 
        "userID": "NSNN"
    }
]