[
    {
        "content": "RE: http://www.military.com/features/0,15240,190875,00.html There is a definite need for greater airlift capacity so I am glad to see some in Congress attempting to provide the funding.",
        "intTime": 20090514,
        "postID": 1,
        "quote": "",
        "reply": "RE: http://www.military.com/features/0,15240,190875,00.html There is a definite need for greater airlift capacity so I am glad to see some in Congress attempting to provide the funding.",
        "threadID": "672198221_9190062322001",
        "time": "2009-05-14 05:33:00",
        "title": "Senators Push Panel For 15 More C-17s",
        "userID": "M123Driver"
    },
    {
        "content": "Wow. At the behest of Boxer? What's got her mind suddenly changed towards the needs of the military? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "intTime": 20090514,
        "postID": 2,
        "quote": "",
        "reply": "Wow. At the behest of Boxer? What's got her mind suddenly changed towards the needs of the military? It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "threadID": "672198221_9190062322001",
        "time": "2009-05-14 05:50:00",
        "title": "Senators Push Panel For 15 More C-17s",
        "userID": "FollowMeInfantry"
    },
    {
        "content": "quote: Originally posted by M123Driver: RE: http://www.military.com/features/0,15240,190875,00.html There is a definite need for greater airlift capacity so I am glad to see some in Congress attempting to provide the funding. I agree it should be more like 180 C 17s, not 15",
        "intTime": 20090514,
        "postID": 3,
        "quote": "Originally posted by M123Driver: RE: http://www.military.com/features/0,15240,190875,00.html There is a definite need for greater airlift capacity so I am glad to see some in Congress attempting to provide the funding.",
        "reply": " I agree it should be more like 180 C 17s, not 15",
        "threadID": "672198221_9190062322001",
        "time": "2009-05-14 06:04:00",
        "title": "Senators Push Panel For 15 More C-17s",
        "userID": "6837602"
    },
    {
        "content": "Given ongoing operations and the fact we do not have as large a forward deployed presence as we used to, more airlift would seem to be a good idea.",
        "intTime": 20090514,
        "postID": 4,
        "quote": "",
        "reply": "Given ongoing operations and the fact we do not have as large a forward deployed presence as we used to, more airlift would seem to be a good idea.",
        "threadID": "672198221_9190062322001",
        "time": "2009-05-14 07:03:00",
        "title": "Senators Push Panel For 15 More C-17s",
        "userID": "sw614"
    },
    {
        "content": "Last time i checked C-17's are built in California. Does that explain anything? If the Air Force needs them or not I have no way to say, but WAY too often congress wants the DOD to buy things that they don't need just because it is going to create or keep jobs \"back at home\" Good example from the past. The Navy only wanted 7 LHD's just enough to replace the 7 LPH's But when he was Senate majority leader Trent Lott pushed through LHD-8, The Navy had no choice but to take it and ended up having to De-comm a perfectley good LHA years early to \"make room for it\" But hey, it was made in his home town and did \"save\" lots of jobs. If there is need for whatever fine but IMO it is NOT and never has been and never should be the mission of the DOD and the defense budget to provide employment for civilains, so lets not build C-17's that end up being \"extra\" and sit on some ramp not flying all that much just because they are built in California. Lets replace every government vehicle every other month so that we have a reason to buy, I don't know, 100 million vehicles a year from GM. I am sure Carl Levin would be all for that!",
        "intTime": 20090514,
        "postID": 5,
        "quote": "",
        "reply": "Last time i checked C-17's are built in California. Does that explain anything? If the Air Force needs them or not I have no way to say, but WAY too often congress wants the DOD to buy things that they don't need just because it is going to create or keep jobs \"back at home\" Good example from the past. The Navy only wanted 7 LHD's just enough to replace the 7 LPH's But when he was Senate majority leader Trent Lott pushed through LHD-8, The Navy had no choice but to take it and ended up having to De-comm a perfectley good LHA years early to \"make room for it\" But hey, it was made in his home town and did \"save\" lots of jobs. If there is need for whatever fine but IMO it is NOT and never has been and never should be the mission of the DOD and the defense budget to provide employment for civilains, so lets not build C-17's that end up being \"extra\" and sit on some ramp not flying all that much just because they are built in California. Lets replace every government vehicle every other month so that we have a reason to buy, I don't know, 100 million vehicles a year from GM. I am sure Carl Levin would be all for that!",
        "threadID": "672198221_9190062322001",
        "time": "2009-05-14 09:09:00",
        "title": "Senators Push Panel For 15 More C-17s",
        "userID": "ETCPJ"
    },
    {
        "content": "C-17 was supposed to be capped years ago. But it's a mainstay of Boeing operations, creating jobs in almost every state. So, even when it wasn't being manufactured money was there to keep the program alive. At it's age it's akin to building B17's 30 years after WW2. But what else ya gonna do? The Euro copy is overweight and the Russians stopped producing. Interesting to not the customer list: Qatar? UAE? They need a heavylift capability?",
        "intTime": 20090515,
        "postID": 6,
        "quote": "",
        "reply": "C-17 was supposed to be capped years ago. But it's a mainstay of Boeing operations, creating jobs in almost every state. So, even when it wasn't being manufactured money was there to keep the program alive. At it's age it's akin to building B17's 30 years after WW2. But what else ya gonna do? The Euro copy is overweight and the Russians stopped producing. Interesting to not the customer list: Qatar? UAE? They need a heavylift capability?",
        "threadID": "672198221_9190062322001",
        "time": "2009-05-15 10:24:00",
        "title": "Senators Push Panel For 15 More C-17s",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by popsiq: C-17 was supposed to be capped years ago. But it's a mainstay of Boeing operations, creating jobs in almost every state. So, even when it wasn't being manufactured money was there to keep the program alive. At it's age it's akin to building B17's 30 years after WW2. But what else ya gonna do? The Euro copy is overweight and the Russians stopped producing. Interesting to not the customer list: Qatar? UAE? They need a heavylift capability? The GM III's weren't introduced until 1993, a very scant dent in history for usefulness of an upgraded airframe. Sixteen years of service is NOTHING on the scale of mission-ready longevity. The buyers ARE interesting, though. From Wikipedia: The Royal Danish Air Force signed a letter of intent to purchase C-17s on 19 July 2006 at the 2006 Farnborough Airshow to participate in the joint purchase and operation of C-17s within NATO, a program called the NATO Strategic Airlift Capability.[62] A further letter of intent was announced on 12 September 2006 that includes Bulgaria, the Czech Republic, Denmark, Estonia, Italy, Latvia, Lithuania, the Netherlands, Poland, Romania, the Slovak Republic, Slovenia and the United States to be part of a larger NATO joint purchase.[63] This purchase would probably be similar to NATO's purchase of the E-3A Sentry. Later on, NATO countries Hungary and Norway, as well as Partner country Sweden also signed the Letter of Intent.[62] Finland has also decided to join the program. My opinion? The C17 GM III has a long time to go before we even consider it a budget-outdated airframe that requires R&D to be replaced. That, of course, is just MHO. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "intTime": 20090515,
        "postID": 7,
        "quote": "Originally posted by popsiq: C-17 was supposed to be capped years ago. But it's a mainstay of Boeing operations, creating jobs in almost every state. So, even when it wasn't being manufactured money was there to keep the program alive. At it's age it's akin to building B17's 30 years after WW2. But what else ya gonna do? The Euro copy is overweight and the Russians stopped producing. Interesting to not the customer list: Qatar? UAE? They need a heavylift capability?",
        "reply": " The GM III's weren't introduced until 1993, a very scant dent in history for usefulness of an upgraded airframe. Sixteen years of service is NOTHING on the scale of mission-ready longevity. The buyers ARE interesting, though. From Wikipedia: The Royal Danish Air Force signed a letter of intent to purchase C-17s on 19 July 2006 at the 2006 Farnborough Airshow to participate in the joint purchase and operation of C-17s within NATO, a program called the NATO Strategic Airlift Capability.[62] A further letter of intent was announced on 12 September 2006 that includes Bulgaria, the Czech Republic, Denmark, Estonia, Italy, Latvia, Lithuania, the Netherlands, Poland, Romania, the Slovak Republic, Slovenia and the United States to be part of a larger NATO joint purchase.[63] This purchase would probably be similar to NATO's purchase of the E-3A Sentry. Later on, NATO countries Hungary and Norway, as well as Partner country Sweden also signed the Letter of Intent.[62] Finland has also decided to join the program. My opinion? The C17 GM III has a long time to go before we even consider it a budget-outdated airframe that requires R&D to be replaced. That, of course, is just MHO. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "threadID": "672198221_9190062322001",
        "time": "2009-05-15 10:41:00",
        "title": "Senators Push Panel For 15 More C-17s",
        "userID": "FollowMeInfantry"
    },
    {
        "content": "quote: Originally posted by popsiq: C-17 was supposed to be capped years ago. But it's a mainstay of Boeing operations, creating jobs in almost every state. So, even when it wasn't being manufactured money was there to keep the program alive. At it's age it's akin to building B17's 30 years after WW2. But what else ya gonna do? The Euro copy is overweight and the Russians stopped producing. Interesting to not the customer list: Qatar? UAE? They need a heavylift capability? Do not understand your age statement. The C-17 is not obsolete. And you did not go back far enough. original C-17 purchase was slated for 210 airframes to replace approximately 270 C-141s. It has been fluctuating ever since. The additional aorframes may not be a bad idea since ops tempo has been higher than expected and flight hours are accumilating faster than expected on the fleet. Another issue should be what is the requirement we are trying to meet. At one time, airlift goal was 66 million ton/miles per day (66 MTM). I have no ides what it is now.",
        "intTime": 20090515,
        "postID": 8,
        "quote": "Originally posted by popsiq: C-17 was supposed to be capped years ago. But it's a mainstay of Boeing operations, creating jobs in almost every state. So, even when it wasn't being manufactured money was there to keep the program alive. At it's age it's akin to building B17's 30 years after WW2. But what else ya gonna do? The Euro copy is overweight and the Russians stopped producing. Interesting to not the customer list: Qatar? UAE? They need a heavylift capability?",
        "reply": " Do not understand your age statement. The C-17 is not obsolete. And you did not go back far enough. original C-17 purchase was slated for 210 airframes to replace approximately 270 C-141s. It has been fluctuating ever since. The additional aorframes may not be a bad idea since ops tempo has been higher than expected and flight hours are accumilating faster than expected on the fleet. Another issue should be what is the requirement we are trying to meet. At one time, airlift goal was 66 million ton/miles per day (66 MTM). I have no ides what it is now.",
        "threadID": "672198221_9190062322001",
        "time": "2009-05-15 12:46:00",
        "title": "Senators Push Panel For 15 More C-17s",
        "userID": "sw614"
    },
    {
        "content": "Ah C-17's....Jumped out of those many times I'm not that crazy about aviation stuff, but this plane is pretty useful, fast, maneuverable...etc...etc Maybe one day we'll see 40+ of them taking off from FT.Bragg on a one way trip",
        "intTime": 20090515,
        "postID": 9,
        "quote": "",
        "reply": "Ah C-17's....Jumped out of those many times I'm not that crazy about aviation stuff, but this plane is pretty useful, fast, maneuverable...etc...etc Maybe one day we'll see 40+ of them taking off from FT.Bragg on a one way trip",
        "threadID": "672198221_9190062322001",
        "time": "2009-05-15 13:03:00",
        "title": "Senators Push Panel For 15 More C-17s",
        "userID": "Irwin_R_Schyster"
    }
]