[
    {
        "content": "Oh well. quote: North and South Korea talks last only 22 minutes (CNN) -- Details emerged Wednesday from the first government-to-government talks between the two Koreas in more than a year. Tuesday's talks ended quickly -- after 22 minutes -- South Korea's Unification Ministry said. The two sides were to discuss business deals tied to the Kaesung Industrial Complex in North Korea, which is run by both nations. The talks broke off after the North Korean delegation refused to discuss the release of a detained South Korean worker, saying he was not on the agenda, according to South Korean officials. The South Korean delegation was not able to meet the worker, or learn whether he would be formally charged with a crime, the Unification Ministry said. The employee of Hyundai Asan Corp. has been accused of criticizing North Korea's political system and trying to persuade a local worker to defect, according to the Yonhap news agency. Pyongyang has held him at the industrial complex since March 30, the news agency said. The South Korea delegation said it would take \"stern action that could lead to serious consequences,\" if the matter were not resolved. The brief meeting between North and South follows the recent test launch of a long-range rocket by North Korea. (...)",
        "intTime": 20090422,
        "postID": 1,
        "quote": "North and South Korea talks last only 22 minutes (CNN) -- Details emerged Wednesday from the first government-to-government talks between the two Koreas in more than a year. Tuesday's talks ended quickly -- after 22 minutes -- South Korea's Unification Ministry said. The two sides were to discuss business deals tied to the Kaesung Industrial Complex in North Korea, which is run by both nations. The talks broke off after the North Korean delegation refused to discuss the release of a detained South Korean worker, saying he was not on the agenda, according to South Korean officials. The South Korean delegation was not able to meet the worker, or learn whether he would be formally charged with a crime, the Unification Ministry said. The employee of Hyundai Asan Corp. has been accused of criticizing North Korea's political system and trying to persuade a local worker to defect, according to the Yonhap news agency. Pyongyang has held him at the industrial complex since March 30, the news agency said. The South Korea delegation said it would take \"stern action that could lead to serious consequences,\" if the matter were not resolved. The brief meeting between North and South follows the recent test launch of a long-range rocket by North Korea. (...)",
        "reply": "Oh well. ",
        "threadID": "672198221_9780094122001",
        "time": "2009-04-22 17:31:00",
        "title": "Talks between North and South Korea only last 22 minutes",
        "userID": "Canuck_Centaur"
    },
    {
        "content": "What an amazing situation. How does this company survive? What must the work environment be like? I was in Korea for 7 months and did the border tour. Holy crapola",
        "intTime": 20090422,
        "postID": 2,
        "quote": "",
        "reply": "What an amazing situation. How does this company survive? What must the work environment be like? I was in Korea for 7 months and did the border tour. Holy crapola",
        "threadID": "672198221_9780094122001",
        "time": "2009-04-22 18:13:00",
        "title": "Talks between North and South Korea only last 22 minutes",
        "userID": "ACR26"
    },
    {
        "content": "If the industrial complex is IN North Korea, I'd guess southerners would have to be careful about what they were saying, and doing. If there's one thing South Koreans should know it's what their northern cousins are about because it is definitely different. 22 minutes is about 7 minutes longer than normal.",
        "intTime": 20090422,
        "postID": 3,
        "quote": "",
        "reply": "If the industrial complex is IN North Korea, I'd guess southerners would have to be careful about what they were saying, and doing. If there's one thing South Koreans should know it's what their northern cousins are about because it is definitely different. 22 minutes is about 7 minutes longer than normal.",
        "threadID": "672198221_9780094122001",
        "time": "2009-04-22 19:35:00",
        "title": "Talks between North and South Korea only last 22 minutes",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by ACR26: What an amazing situation. How does this company survive? What must the work environment be like? I was in Korea for 7 months and did the border tour. Holy crapola I bet you felt the static just like I did.... We partied up there for one weekend and it was a fairly intense feeling for me.... Can't remember if it was Casey or Red Cloud, Soju will do that to you.....",
        "intTime": 20090423,
        "postID": 4,
        "quote": "Originally posted by ACR26: What an amazing situation. How does this company survive? What must the work environment be like? I was in Korea for 7 months and did the border tour. Holy crapola",
        "reply": " I bet you felt the static just like I did.... We partied up there for one weekend and it was a fairly intense feeling for me.... Can't remember if it was Casey or Red Cloud, Soju will do that to you.....",
        "threadID": "672198221_9780094122001",
        "time": "2009-04-23 06:15:00",
        "title": "Talks between North and South Korea only last 22 minutes",
        "userID": "Woody_in_La"
    },
    {
        "content": "quote: Originally posted by Woody_in_La: quote: Originally posted by ACR26: What an amazing situation. How does this company survive? What must the work environment be like? I was in Korea for 7 months and did the border tour. Holy crapola I bet you felt the static just like I did.... We partied up there for one weekend and it was a fairly intense feeling for me.... Can't remember if it was Casey or Red Cloud, Soju will do that to you..... You had to bring up Soju......my damn head still hurts... Well, the DPRK wants something else again. This is their usual tactic.",
        "intTime": 20090423,
        "postID": 5,
        "quote": "Originally posted by Woody_in_La: quote: Originally posted by ACR26: What an amazing situation. How does this company survive? What must the work environment be like? I was in Korea for 7 months and did the border tour. Holy crapola I bet you felt the static just like I did.... We partied up there for one weekend and it was a fairly intense feeling for me.... Can't remember if it was Casey or Red Cloud, Soju will do that to you.....",
        "reply": " You had to bring up Soju......my damn head still hurts... Well, the DPRK wants something else again. This is their usual tactic.",
        "threadID": "672198221_9780094122001",
        "time": "2009-04-23 06:32:00",
        "title": "Talks between North and South Korea only last 22 minutes",
        "userID": "sw614"
    },
    {
        "content": "well duh did anyone think it would work?? they have been at war for what 50-60 years now....",
        "intTime": 20090423,
        "postID": 6,
        "quote": "",
        "reply": "well duh did anyone think it would work?? they have been at war for what 50-60 years now....",
        "threadID": "672198221_9780094122001",
        "time": "2009-04-23 06:41:00",
        "title": "Talks between North and South Korea only last 22 minutes",
        "userID": "outlaws93"
    },
    {
        "content": "quote: I bet you felt the static just like I did.... We partied up there for one weekend and it was a fairly intense feeling for me.... Can't remember if it was Casey or Red Cloud, Soju will do that to you..... Soju was distributed on our over the hump party...stayed up drinking for 23 hours. Stupid. I know I lost a few years of my life. One thing that impressed me the most were the ROK's and our guys. Never saw units that motivated by the battalion. I swear I saw lightning bolts shoot out of some those dudes eyes. Then you look at the North and they are smoking, weapons slung picking their noses. Amazing and potentially volatile",
        "intTime": 20090423,
        "postID": 7,
        "quote": "I bet you felt the static just like I did.... We partied up there for one weekend and it was a fairly intense feeling for me.... Can't remember if it was Casey or Red Cloud, Soju will do that to you.....",
        "reply": " Soju was distributed on our over the hump party...stayed up drinking for 23 hours. Stupid. I know I lost a few years of my life. One thing that impressed me the most were the ROK's and our guys. Never saw units that motivated by the battalion. I swear I saw lightning bolts shoot out of some those dudes eyes. Then you look at the North and they are smoking, weapons slung picking their noses. Amazing and potentially volatile",
        "threadID": "672198221_9780094122001",
        "time": "2009-04-23 07:39:00",
        "title": "Talks between North and South Korea only last 22 minutes",
        "userID": "ACR26"
    }
]