[
    {
        "content": "This evening Colbert had John McCains daughter on speaking on behalf of her new role within the Republican party as she signed up when she supported her father running for President. That I guess was the ultimate bonding moment for father and daughter. She is only 24 and said that she is pro life, pro sex and pro gay marraige. I have to say, Colbert was pretty tame with her and she was a little flush at times but did manage to stay on topic and get her point across. She was well thought out, not bitter, had ideas for the party going forward and enjoyed her sense of humor. Her response to pro sex is just that she does not think that is going to work for the old party. She took on that term prosex to oppose Bristol Palins stand on sex and abortion. McCains daughter thinks they should talk about the reality of sex at any age and the consquences of those actions. She wants it talked about in shcool, church, family home etc she feels you must have safe sex and more optioins like adoption if the condom is faulty. she said that no twittering, blogging etc was going to make anyone think the party has changed and are hip but she said the gop is a great party and there is a place for gay people within the party, and ways to work together to support education on sexual issues she thinks there are some really good old boys from the party but it is time for the next generation to step in and make a case for change. She would not talk about Palin or call anyone out. She just was sweet spoken with a message she wanted to get across. I think I am going to keep a watch on her. She seems to be coming off very well so I put her as one to watch. I think Obama has this for two terms and unless Michelle runs it will then go back to the right if they are ready to run with someone. We tackled the racial issue, now lets cross the female issue. It is time. It is time to start looking at a young Condi Rice, only she wont run..why?... but we need someone just like her. smart, well spoken, highly educated, was in the inner group,knows the players and looks the part. they are already trying to build up the GOP with the governors. They need to change this next election around to get the new breed of smart, fun, good looking people in there of the next generation. they need to spend the time in office doing great things for their states and wait for the opportunity to take the house back and a few governors could slip into senate seats What do you think,,is it possible to get a fresh intellegent female ready to run for President? Who is the list? Not Hillary, she will be too old. It would have Gop still has some female people to look at that might shine. I would love to hear your thoughts on this.", 
        "intTime": 20090519, 
        "postID": 1, 
        "quote": "", 
        "reply": "This evening Colbert had John McCains daughter on speaking on behalf of her new role within the Republican party as she signed up when she supported her father running for President. That I guess was the ultimate bonding moment for father and daughter. She is only 24 and said that she is pro life, pro sex and pro gay marraige. I have to say, Colbert was pretty tame with her and she was a little flush at times but did manage to stay on topic and get her point across. She was well thought out, not bitter, had ideas for the party going forward and enjoyed her sense of humor. Her response to pro sex is just that she does not think that is going to work for the old party. She took on that term prosex to oppose Bristol Palins stand on sex and abortion. McCains daughter thinks they should talk about the reality of sex at any age and the consquences of those actions. She wants it talked about in shcool, church, family home etc she feels you must have safe sex and more optioins like adoption if the condom is faulty. she said that no twittering, blogging etc was going to make anyone think the party has changed and are hip but she said the gop is a great party and there is a place for gay people within the party, and ways to work together to support education on sexual issues she thinks there are some really good old boys from the party but it is time for the next generation to step in and make a case for change. She would not talk about Palin or call anyone out. She just was sweet spoken with a message she wanted to get across. I think I am going to keep a watch on her. She seems to be coming off very well so I put her as one to watch. I think Obama has this for two terms and unless Michelle runs it will then go back to the right if they are ready to run with someone. We tackled the racial issue, now lets cross the female issue. It is time. It is time to start looking at a young Condi Rice, only she wont run..why?... but we need someone just like her. smart, well spoken, highly educated, was in the inner group,knows the players and looks the part. they are already trying to build up the GOP with the governors. They need to change this next election around to get the new breed of smart, fun, good looking people in there of the next generation. they need to spend the time in office doing great things for their states and wait for the opportunity to take the house back and a few governors could slip into senate seats What do you think,,is it possible to get a fresh intellegent female ready to run for President? Who is the list? Not Hillary, she will be too old. It would have Gop still has some female people to look at that might shine. I would love to hear your thoughts on this.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 00:27:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance", 
        "intTime": 20090519, 
        "postID": 2, 
        "quote": "", 
        "reply": "It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 01:54:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "ronald45"
    }, 
    {
        "content": "quote: If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance that won't happen as long as the Republicans stay with their anti-science/anti-education policies.", 
        "intTime": 20090519, 
        "postID": 3, 
        "quote": "If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance", 
        "reply": " that won't happen as long as the Republicans stay with their anti-science/anti-education policies.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 02:14:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Although my voting days are over, McCains daughter has two big things that I will keep my eyes on.", 
        "intTime": 20090519, 
        "postID": 4, 
        "quote": "", 
        "reply": "Although my voting days are over, McCains daughter has two big things that I will keep my eyes on.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 04:29:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: McCains daughter has two big things that I will keep my eyes on. agreed.", 
        "intTime": 20090519, 
        "postID": 5, 
        "quote": "McCains daughter has two big things that I will keep my eyes on.", 
        "reply": " agreed.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 04:35:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "lol@ Duster.", 
        "intTime": 20090519, 
        "postID": 6, 
        "quote": "", 
        "reply": "lol@ Duster.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 07:29:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe", 
        "intTime": 20090519, 
        "postID": 7, 
        "quote": "", 
        "reply": "I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 07:35:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance that won't happen as long as the Republicans stay with their anti-science/anti-education policies. Whic party bows to the teachers unions every election cycle? Which party believes in education vouchers allowing parents to send their children to the school of their choice, creating competition and higher standards for schools across the nation?", 
        "intTime": 20090519, 
        "postID": 8, 
        "quote": "Originally posted by karlhungusjr: quote: If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance that won't happen as long as the Republicans stay with their anti-science/anti-education policies.", 
        "reply": " Whic party bows to the teachers unions every election cycle? Which party believes in education vouchers allowing parents to send their children to the school of their choice, creating competition and higher standards for schools across the nation?", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 07:39:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe A \"fresh new look\" does not mean leaving behind all of the values that the Republican Party has stood for. Which is what Meghan McCain keeps preaching. She wants the party to be \"democrat light\" which is not what the American people will be looking for in the next eight years. Meghan McCain is doing nothing but promoting her \"celebrity\" riding on her fathers coat tails. She is not a leader of the Republican Party. She is simply the \"flavor of the month\" for the main stream media to use to attack the GOP.", 
        "intTime": 20090519, 
        "postID": 9, 
        "quote": "Originally posted by usa_girl: I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe", 
        "reply": " A \"fresh new look\" does not mean leaving behind all of the values that the Republican Party has stood for. Which is what Meghan McCain keeps preaching. She wants the party to be \"democrat light\" which is not what the American people will be looking for in the next eight years. Meghan McCain is doing nothing but promoting her \"celebrity\" riding on her fathers coat tails. She is not a leader of the Republican Party. She is simply the \"flavor of the month\" for the main stream media to use to attack the GOP.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 07:44:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "stec74"
    }, 
    {
        "content": "stec, I hear what you are saying, but don't you think the Republican party needs some fresh air? Do you have to give up values in order to meet the people half way? I don't think bitterness is going to cut it next time around. The fact is, the Bush people gave the liberal radicals so much to use and run on they will still be feeding off of it in the next election. They have already turned the Obama spending around to be the fault of Bush. Obama can spend whatever he wants and just keep repeating he inheirated this debt, never that he is adding to it or creating it. He can go to war in Afganistan and many Americans will pay for that war too and it will still be the liberals saying they did not start the war Bush did. Why do you think the liberals are working so hard to keep the war crimes against Bush admin going? If they can drag that out until the next election how good will that be for the Reps? Republicans need to regroup if they are going to turn this around. If Obama fails, then they will have a better chance at slipping in. If he does not fail and everything he is doing ends up helping America, then good for us.", 
        "intTime": 20090519, 
        "postID": 10, 
        "quote": "", 
        "reply": "stec, I hear what you are saying, but don't you think the Republican party needs some fresh air? Do you have to give up values in order to meet the people half way? I don't think bitterness is going to cut it next time around. The fact is, the Bush people gave the liberal radicals so much to use and run on they will still be feeding off of it in the next election. They have already turned the Obama spending around to be the fault of Bush. Obama can spend whatever he wants and just keep repeating he inheirated this debt, never that he is adding to it or creating it. He can go to war in Afganistan and many Americans will pay for that war too and it will still be the liberals saying they did not start the war Bush did. Why do you think the liberals are working so hard to keep the war crimes against Bush admin going? If they can drag that out until the next election how good will that be for the Reps? Republicans need to regroup if they are going to turn this around. If Obama fails, then they will have a better chance at slipping in. If he does not fail and everything he is doing ends up helping America, then good for us.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:02:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance I agree ronald. But that will not happen until the teacher's unions change! My daughter is an RN and is currently enrolled at Florida State for her BSN. One of her current classes is Nursing in the Health Care System. The text book (not sure whether the college picked it or the Professor) is newly copy righted and professes government run health care! BTW. If you have a student in college and they feel that they are being singled out or chastised by a professor with a liberal point of view, they can complain (annomously) through a web site called \"http://noindoctrination.org/\"! The lady who runs it lives in California and has done some great things! Check it out.", 
        "intTime": 20090519, 
        "postID": 11, 
        "quote": "Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance", 
        "reply": " I agree ronald. But that will not happen until the teacher's unions change! My daughter is an RN and is currently enrolled at Florida State for her BSN. One of her current classes is Nursing in the Health Care System. The text book (not sure whether the college picked it or the Professor) is newly copy righted and professes government run health care! BTW. If you have a student in college and they feel that they are being singled out or chastised by a professor with a liberal point of view, they can complain (annomously) through a web site called \"http://noindoctrination.org/\"! The lady who runs it lives in California and has done some great things! Check it out.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:03:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by usa_girl: I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe A \"fresh new look\" does not mean leaving behind all of the values that the Republican Party has stood for. Which is what Meghan McCain keeps preaching. She wants the party to be \"democrat light\" which is not what the American people will be looking for in the next eight years. Meghan McCain is doing nothing but promoting her \"celebrity\" riding on her fathers coat tails. She is not a leader of the Republican Party. She is simply the \"flavor of the month\" for the main stream media to use to attack the GOP. You just hang on to that idea and we will have 16 years not 8.", 
        "intTime": 20090519, 
        "postID": 12, 
        "quote": "Originally posted by stec74: quote: Originally posted by usa_girl: I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe A \"fresh new look\" does not mean leaving behind all of the values that the Republican Party has stood for. Which is what Meghan McCain keeps preaching. She wants the party to be \"democrat light\" which is not what the American people will be looking for in the next eight years. Meghan McCain is doing nothing but promoting her \"celebrity\" riding on her fathers coat tails. She is not a leader of the Republican Party. She is simply the \"flavor of the month\" for the main stream media to use to attack the GOP.", 
        "reply": " You just hang on to that idea and we will have 16 years not 8.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:14:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "6837602"
    }, 
    {
        "content": "Just curious, has it dawned on anyone the problem might not be the messenger, it might be the message? Resurrect Teddy Roosevelt.", 
        "intTime": 20090519, 
        "postID": 13, 
        "quote": "", 
        "reply": "Just curious, has it dawned on anyone the problem might not be the messenger, it might be the message? Resurrect Teddy Roosevelt.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:17:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: stec, I hear what you are saying, but don't you think the Republican party needs some fresh air? Do you have to give up values in order to meet the people half way? I don't think bitterness is going to cut it next time around. The fact is, the Bush people gave the liberal radicals so much to use and run on they will still be feeding off of it in the next election. They have already turned the Obama spending around to be the fault of Bush. Obama can spend whatever he wants and just keep repeating he inheirated this debt, never that he is adding to it or creating it. He can go to war in Afganistan and many Americans will pay for that war too and it will still be the liberals saying they did not start the war Bush did. Why do you think the liberals are working so hard to keep the war crimes against Bush admin going? If they can drag that out until the next election how good will that be for the Reps? Republicans need to regroup if they are going to turn this around. If Obama fails, then they will have a better chance at slipping in. If he does not fail and everything he is doing ends up helping America, then good for us. You are absolutly correct. If Republicans hadn't practiced out of control spending, the party wouldn't be as bad off as it is. The GOP used to be known as the party of fiscal responsibility. That has gone out the window over the last couple of decades. If anything, the GOP has strayed so far away from it's fiscally responsible and small government values that it is hard to tell the party apart from the democratic party. In fact, if it wasn't for the \"bat crap\" crazy liberals in the Democratic party you wouldn't see much difference at all. The only place where the GOP and the Dem Parties differ right now are in ethical values. The Dems call them \"wedge issues\", I call them fundamental beliefs that come from the Judaio Christian foundation of our country. The Dems like to use these issues as \"wedge issues\" to say the GOP is outdated and out of touch. I say that fundamental beliefs should not be changed to go along with the times. The GOP's values have been around for thousands of years while many of the \"wedge issues\" have only been issues for a few decades. That is not to say that the issues don't have merit, because they do. I feel that there are solutions to these issues that can make the majority happy, not just the small minorities of people who want to change our laws and values to benefit them. All of this is IMHO of course.", 
        "intTime": 20090519, 
        "postID": 14, 
        "quote": "Originally posted by usa_girl: stec, I hear what you are saying, but don't you think the Republican party needs some fresh air? Do you have to give up values in order to meet the people half way? I don't think bitterness is going to cut it next time around. The fact is, the Bush people gave the liberal radicals so much to use and run on they will still be feeding off of it in the next election. They have already turned the Obama spending around to be the fault of Bush. Obama can spend whatever he wants and just keep repeating he inheirated this debt, never that he is adding to it or creating it. He can go to war in Afganistan and many Americans will pay for that war too and it will still be the liberals saying they did not start the war Bush did. Why do you think the liberals are working so hard to keep the war crimes against Bush admin going? If they can drag that out until the next election how good will that be for the Reps? Republicans need to regroup if they are going to turn this around. If Obama fails, then they will have a better chance at slipping in. If he does not fail and everything he is doing ends up helping America, then good for us.", 
        "reply": " You are absolutly correct. If Republicans hadn't practiced out of control spending, the party wouldn't be as bad off as it is. The GOP used to be known as the party of fiscal responsibility. That has gone out the window over the last couple of decades. If anything, the GOP has strayed so far away from it's fiscally responsible and small government values that it is hard to tell the party apart from the democratic party. In fact, if it wasn't for the \"bat crap\" crazy liberals in the Democratic party you wouldn't see much difference at all. The only place where the GOP and the Dem Parties differ right now are in ethical values. The Dems call them \"wedge issues\", I call them fundamental beliefs that come from the Judaio Christian foundation of our country. The Dems like to use these issues as \"wedge issues\" to say the GOP is outdated and out of touch. I say that fundamental beliefs should not be changed to go along with the times. The GOP's values have been around for thousands of years while many of the \"wedge issues\" have only been issues for a few decades. That is not to say that the issues don't have merit, because they do. I feel that there are solutions to these issues that can make the majority happy, not just the small minorities of people who want to change our laws and values to benefit them. All of this is IMHO of course.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:20:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "stec74"
    }, 
    {
        "content": "busnrete, That site is great information. Thanks for sharing. It is good to know someone is watching out for the student.", 
        "intTime": 20090519, 
        "postID": 15, 
        "quote": "", 
        "reply": "busnrete, That site is great information. Thanks for sharing. It is good to know someone is watching out for the student.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:21:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Although my voting days are over, McCains daughter has two big things that I will keep my eyes on. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090519, 
        "postID": 16, 
        "quote": "Originally posted by Duster6: Although my voting days are over, McCains daughter has two big things that I will keep my eyes on.", 
        "reply": " \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:24:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance “liberal teachers and professors” That is because enlightened intelligent people tend to become liberal So unless you would like your children to be taught by morons who have no allegiance to the truth or finding out truth you are going to have to tolerate good people of honor and truth. You could send your children to Bob Jones U for a total brain washing in to the right wing extremist philosophy of hate but I will never employ one of those imbeciles from BJU.", 
        "intTime": 20090519, 
        "postID": 17, 
        "quote": "Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance", 
        "reply": " “liberal teachers and professors” That is because enlightened intelligent people tend to become liberal So unless you would like your children to be taught by morons who have no allegiance to the truth or finding out truth you are going to have to tolerate good people of honor and truth. You could send your children to Bob Jones U for a total brain washing in to the right wing extremist philosophy of hate but I will never employ one of those imbeciles from BJU.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:25:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by 6837602: quote: Originally posted by stec74: quote: Originally posted by usa_girl: I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe A \"fresh new look\" does not mean leaving behind all of the values that the Republican Party has stood for. Which is what Meghan McCain keeps preaching. She wants the party to be \"democrat light\" which is not what the American people will be looking for in the next eight years. Meghan McCain is doing nothing but promoting her \"celebrity\" riding on her fathers coat tails. She is not a leader of the Republican Party. She is simply the \"flavor of the month\" for the main stream media to use to attack the GOP. You just hang on to that idea and we will have 16 years not 8. funny you mention life after Obama. When I think about who could run against Obama next time around, I really can't come up with anyone strong enough at this point. So, in my mind I think OK, 8 years with Obama and maybe the Reps can at least get the house back to keep it even with checks and balance. Then I think of life after Obama and if the Reps play the game right and Obama does not live up to the expectations, the Replican party has a chance again, but who would run? Now that the race card is off the table it is time for a women to be seated as President, only fair right? heheh", 
        "intTime": 20090519, 
        "postID": 18, 
        "quote": "Originally posted by 6837602: quote: Originally posted by stec74: quote: Originally posted by usa_girl: I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe A \"fresh new look\" does not mean leaving behind all of the values that the Republican Party has stood for. Which is what Meghan McCain keeps preaching. She wants the party to be \"democrat light\" which is not what the American people will be looking for in the next eight years. Meghan McCain is doing nothing but promoting her \"celebrity\" riding on her fathers coat tails. She is not a leader of the Republican Party. She is simply the \"flavor of the month\" for the main stream media to use to attack the GOP. You just hang on to that idea and we will have 16 years not 8.", 
        "reply": " funny you mention life after Obama. When I think about who could run against Obama next time around, I really can't come up with anyone strong enough at this point. So, in my mind I think OK, 8 years with Obama and maybe the Reps can at least get the house back to keep it even with checks and balance. Then I think of life after Obama and if the Reps play the game right and Obama does not live up to the expectations, the Replican party has a chance again, but who would run? Now that the race card is off the table it is time for a women to be seated as President, only fair right? heheh", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:25:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by 6837602: quote: Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance “liberal teachers and professors” That is because enlightened intelligent people tend to become liberal So unless you would like your children to be taught by morons who have no allegiance to the truth or finding out truth you are going to have to tolerate good people of honor and truth. You could send your children to Bob Jones U for a total brain washing in to the right wing extremist philosophy of hate but I will never employ one of those imbeciles from BJU. That is funny. Seem to remember a few weeks back about a liberal teacher who yelled a student for looking at fox news. But you say the conservative teachers brain wash....haven't heard any stories of teachers doing that to students who look at CNN? I think the best teachers are ones who don't bring politics or religion into the school and just teach. I don't want to hear how you have your nose up O's arse or if you have a woody for Palin. Just teach the damn class. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090519, 
        "postID": 19, 
        "quote": "Originally posted by 6837602: quote: Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance “liberal teachers and professors” That is because enlightened intelligent people tend to become liberal So unless you would like your children to be taught by morons who have no allegiance to the truth or finding out truth you are going to have to tolerate good people of honor and truth. You could send your children to Bob Jones U for a total brain washing in to the right wing extremist philosophy of hate but I will never employ one of those imbeciles from BJU.", 
        "reply": " That is funny. Seem to remember a few weeks back about a liberal teacher who yelled a student for looking at fox news. But you say the conservative teachers brain wash....haven't heard any stories of teachers doing that to students who look at CNN? I think the best teachers are ones who don't bring politics or religion into the school and just teach. I don't want to hear how you have your nose up O's arse or if you have a woody for Palin. Just teach the damn class. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:29:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by 6837602: quote: Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance “liberal teachers and professors” That is because enlightened intelligent people tend to become liberal So unless you would like your children to be taught by morons who have no allegiance to the truth or finding out truth you are going to have to tolerate good people of honor and truth. You could send your children to Bob Jones U for a total brain washing in to the right wing extremist philosophy of hate but I will never employ one of those imbeciles from BJU. brainwashing???? hate???? you say only liberals can be smart and teach? that would be like me saying those who can do and those who can't do, teach! shame on you. then on top of that, you say you would not hire a person based on where they went to school or if they were liberal? no offense, but you sound radical and that is very one sided.", 
        "intTime": 20090519, 
        "postID": 20, 
        "quote": "Originally posted by 6837602: quote: Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance “liberal teachers and professors” That is because enlightened intelligent people tend to become liberal So unless you would like your children to be taught by morons who have no allegiance to the truth or finding out truth you are going to have to tolerate good people of honor and truth. You could send your children to Bob Jones U for a total brain washing in to the right wing extremist philosophy of hate but I will never employ one of those imbeciles from BJU.", 
        "reply": " brainwashing???? hate???? you say only liberals can be smart and teach? that would be like me saying those who can do and those who can't do, teach! shame on you. then on top of that, you say you would not hire a person based on where they went to school or if they were liberal? no offense, but you sound radical and that is very one sided.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:30:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "This evening Colbert had John McCains daughter on speaking on behalf of her new role within the Republican party as she signed up when she supported her father running for President. That I guess was the ultimate bonding moment for father and daughter. She is only 24 and said that she is pro life, pro sex and pro gay marraige. I have to say, Colbert was pretty tame with her and she was a little flush at times but did manage to stay on topic and get her point across. She was well thought out, not bitter, had ideas for the party going forward and enjoyed her sense of humor. Her response to pro sex is just that she does not think that is going to work for the old party. She took on that term prosex to oppose Bristol Palins stand on sex and abortion. McCains daughter thinks they should talk about the reality of sex at any age and the consquences of those actions. She wants it talked about in shcool, church, family home etc she feels you must have safe sex and more optioins like adoption if the condom is faulty. she said that no twittering, blogging etc was going to make anyone think the party has changed and are hip but she said the gop is a great party and there is a place for gay people within the party, and ways to work together to support education on sexual issues she thinks there are some really good old boys from the party but it is time for the next generation to step in and make a case for change. She would not talk about Palin or call anyone out. She just was sweet spoken with a message she wanted to get across. I think I am going to keep a watch on her. She seems to be coming off very well so I put her as one to watch. I think Obama has this for two terms and unless Michelle runs it will then go back to the right if they are ready to run with someone. We tackled the racial issue, now lets cross the female issue. It is time. It is time to start looking at a young Condi Rice, only she wont run..why?... but we need someone just like her. smart, well spoken, highly educated, was in the inner group,knows the players and looks the part. they are already trying to build up the GOP with the governors. They need to change this next election around to get the new breed of smart, fun, good looking people in there of the next generation. they need to spend the time in office doing great things for their states and wait for the opportunity to take the house back and a few governors could slip into senate seats What do you think,,is it possible to get a fresh intellegent female ready to run for President? Who is the list? Not Hillary, she will be too old. It would have Gop still has some female people to look at that might shine. I would love to hear your thoughts on this.", 
        "intTime": 20090519, 
        "postID": 21, 
        "quote": "", 
        "reply": "This evening Colbert had John McCains daughter on speaking on behalf of her new role within the Republican party as she signed up when she supported her father running for President. That I guess was the ultimate bonding moment for father and daughter. She is only 24 and said that she is pro life, pro sex and pro gay marraige. I have to say, Colbert was pretty tame with her and she was a little flush at times but did manage to stay on topic and get her point across. She was well thought out, not bitter, had ideas for the party going forward and enjoyed her sense of humor. Her response to pro sex is just that she does not think that is going to work for the old party. She took on that term prosex to oppose Bristol Palins stand on sex and abortion. McCains daughter thinks they should talk about the reality of sex at any age and the consquences of those actions. She wants it talked about in shcool, church, family home etc she feels you must have safe sex and more optioins like adoption if the condom is faulty. she said that no twittering, blogging etc was going to make anyone think the party has changed and are hip but she said the gop is a great party and there is a place for gay people within the party, and ways to work together to support education on sexual issues she thinks there are some really good old boys from the party but it is time for the next generation to step in and make a case for change. She would not talk about Palin or call anyone out. She just was sweet spoken with a message she wanted to get across. I think I am going to keep a watch on her. She seems to be coming off very well so I put her as one to watch. I think Obama has this for two terms and unless Michelle runs it will then go back to the right if they are ready to run with someone. We tackled the racial issue, now lets cross the female issue. It is time. It is time to start looking at a young Condi Rice, only she wont run..why?... but we need someone just like her. smart, well spoken, highly educated, was in the inner group,knows the players and looks the part. they are already trying to build up the GOP with the governors. They need to change this next election around to get the new breed of smart, fun, good looking people in there of the next generation. they need to spend the time in office doing great things for their states and wait for the opportunity to take the house back and a few governors could slip into senate seats What do you think,,is it possible to get a fresh intellegent female ready to run for President? Who is the list? Not Hillary, she will be too old. It would have Gop still has some female people to look at that might shine. I would love to hear your thoughts on this.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 00:27:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance", 
        "intTime": 20090519, 
        "postID": 22, 
        "quote": "", 
        "reply": "It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 01:54:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "ronald45"
    }, 
    {
        "content": "quote: If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance that won't happen as long as the Republicans stay with their anti-science/anti-education policies.", 
        "intTime": 20090519, 
        "postID": 23, 
        "quote": "If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance", 
        "reply": " that won't happen as long as the Republicans stay with their anti-science/anti-education policies.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 02:14:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Although my voting days are over, McCains daughter has two big things that I will keep my eyes on.", 
        "intTime": 20090519, 
        "postID": 24, 
        "quote": "", 
        "reply": "Although my voting days are over, McCains daughter has two big things that I will keep my eyes on.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 04:29:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: McCains daughter has two big things that I will keep my eyes on. agreed.", 
        "intTime": 20090519, 
        "postID": 25, 
        "quote": "McCains daughter has two big things that I will keep my eyes on.", 
        "reply": " agreed.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 04:35:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "lol@ Duster.", 
        "intTime": 20090519, 
        "postID": 26, 
        "quote": "", 
        "reply": "lol@ Duster.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 07:29:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe", 
        "intTime": 20090519, 
        "postID": 27, 
        "quote": "", 
        "reply": "I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 07:35:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance that won't happen as long as the Republicans stay with their anti-science/anti-education policies. Whic party bows to the teachers unions every election cycle? Which party believes in education vouchers allowing parents to send their children to the school of their choice, creating competition and higher standards for schools across the nation?", 
        "intTime": 20090519, 
        "postID": 28, 
        "quote": "Originally posted by karlhungusjr: quote: If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance that won't happen as long as the Republicans stay with their anti-science/anti-education policies.", 
        "reply": " Whic party bows to the teachers unions every election cycle? Which party believes in education vouchers allowing parents to send their children to the school of their choice, creating competition and higher standards for schools across the nation?", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 07:39:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe A \"fresh new look\" does not mean leaving behind all of the values that the Republican Party has stood for. Which is what Meghan McCain keeps preaching. She wants the party to be \"democrat light\" which is not what the American people will be looking for in the next eight years. Meghan McCain is doing nothing but promoting her \"celebrity\" riding on her fathers coat tails. She is not a leader of the Republican Party. She is simply the \"flavor of the month\" for the main stream media to use to attack the GOP.", 
        "intTime": 20090519, 
        "postID": 29, 
        "quote": "Originally posted by usa_girl: I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe", 
        "reply": " A \"fresh new look\" does not mean leaving behind all of the values that the Republican Party has stood for. Which is what Meghan McCain keeps preaching. She wants the party to be \"democrat light\" which is not what the American people will be looking for in the next eight years. Meghan McCain is doing nothing but promoting her \"celebrity\" riding on her fathers coat tails. She is not a leader of the Republican Party. She is simply the \"flavor of the month\" for the main stream media to use to attack the GOP.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 07:44:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "stec74"
    }, 
    {
        "content": "stec, I hear what you are saying, but don't you think the Republican party needs some fresh air? Do you have to give up values in order to meet the people half way? I don't think bitterness is going to cut it next time around. The fact is, the Bush people gave the liberal radicals so much to use and run on they will still be feeding off of it in the next election. They have already turned the Obama spending around to be the fault of Bush. Obama can spend whatever he wants and just keep repeating he inheirated this debt, never that he is adding to it or creating it. He can go to war in Afganistan and many Americans will pay for that war too and it will still be the liberals saying they did not start the war Bush did. Why do you think the liberals are working so hard to keep the war crimes against Bush admin going? If they can drag that out until the next election how good will that be for the Reps? Republicans need to regroup if they are going to turn this around. If Obama fails, then they will have a better chance at slipping in. If he does not fail and everything he is doing ends up helping America, then good for us.", 
        "intTime": 20090519, 
        "postID": 30, 
        "quote": "", 
        "reply": "stec, I hear what you are saying, but don't you think the Republican party needs some fresh air? Do you have to give up values in order to meet the people half way? I don't think bitterness is going to cut it next time around. The fact is, the Bush people gave the liberal radicals so much to use and run on they will still be feeding off of it in the next election. They have already turned the Obama spending around to be the fault of Bush. Obama can spend whatever he wants and just keep repeating he inheirated this debt, never that he is adding to it or creating it. He can go to war in Afganistan and many Americans will pay for that war too and it will still be the liberals saying they did not start the war Bush did. Why do you think the liberals are working so hard to keep the war crimes against Bush admin going? If they can drag that out until the next election how good will that be for the Reps? Republicans need to regroup if they are going to turn this around. If Obama fails, then they will have a better chance at slipping in. If he does not fail and everything he is doing ends up helping America, then good for us.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:02:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance I agree ronald. But that will not happen until the teacher's unions change! My daughter is an RN and is currently enrolled at Florida State for her BSN. One of her current classes is Nursing in the Health Care System. The text book (not sure whether the college picked it or the Professor) is newly copy righted and professes government run health care! BTW. If you have a student in college and they feel that they are being singled out or chastised by a professor with a liberal point of view, they can complain (annomously) through a web site called \"http://noindoctrination.org/\"! The lady who runs it lives in California and has done some great things! Check it out.", 
        "intTime": 20090519, 
        "postID": 31, 
        "quote": "Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance", 
        "reply": " I agree ronald. But that will not happen until the teacher's unions change! My daughter is an RN and is currently enrolled at Florida State for her BSN. One of her current classes is Nursing in the Health Care System. The text book (not sure whether the college picked it or the Professor) is newly copy righted and professes government run health care! BTW. If you have a student in college and they feel that they are being singled out or chastised by a professor with a liberal point of view, they can complain (annomously) through a web site called \"http://noindoctrination.org/\"! The lady who runs it lives in California and has done some great things! Check it out.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:03:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by usa_girl: I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe A \"fresh new look\" does not mean leaving behind all of the values that the Republican Party has stood for. Which is what Meghan McCain keeps preaching. She wants the party to be \"democrat light\" which is not what the American people will be looking for in the next eight years. Meghan McCain is doing nothing but promoting her \"celebrity\" riding on her fathers coat tails. She is not a leader of the Republican Party. She is simply the \"flavor of the month\" for the main stream media to use to attack the GOP. You just hang on to that idea and we will have 16 years not 8.", 
        "intTime": 20090519, 
        "postID": 32, 
        "quote": "Originally posted by stec74: quote: Originally posted by usa_girl: I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe A \"fresh new look\" does not mean leaving behind all of the values that the Republican Party has stood for. Which is what Meghan McCain keeps preaching. She wants the party to be \"democrat light\" which is not what the American people will be looking for in the next eight years. Meghan McCain is doing nothing but promoting her \"celebrity\" riding on her fathers coat tails. She is not a leader of the Republican Party. She is simply the \"flavor of the month\" for the main stream media to use to attack the GOP.", 
        "reply": " You just hang on to that idea and we will have 16 years not 8.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:14:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "6837602"
    }, 
    {
        "content": "Just curious, has it dawned on anyone the problem might not be the messenger, it might be the message? Resurrect Teddy Roosevelt.", 
        "intTime": 20090519, 
        "postID": 33, 
        "quote": "", 
        "reply": "Just curious, has it dawned on anyone the problem might not be the messenger, it might be the message? Resurrect Teddy Roosevelt.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:17:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: stec, I hear what you are saying, but don't you think the Republican party needs some fresh air? Do you have to give up values in order to meet the people half way? I don't think bitterness is going to cut it next time around. The fact is, the Bush people gave the liberal radicals so much to use and run on they will still be feeding off of it in the next election. They have already turned the Obama spending around to be the fault of Bush. Obama can spend whatever he wants and just keep repeating he inheirated this debt, never that he is adding to it or creating it. He can go to war in Afganistan and many Americans will pay for that war too and it will still be the liberals saying they did not start the war Bush did. Why do you think the liberals are working so hard to keep the war crimes against Bush admin going? If they can drag that out until the next election how good will that be for the Reps? Republicans need to regroup if they are going to turn this around. If Obama fails, then they will have a better chance at slipping in. If he does not fail and everything he is doing ends up helping America, then good for us. You are absolutly correct. If Republicans hadn't practiced out of control spending, the party wouldn't be as bad off as it is. The GOP used to be known as the party of fiscal responsibility. That has gone out the window over the last couple of decades. If anything, the GOP has strayed so far away from it's fiscally responsible and small government values that it is hard to tell the party apart from the democratic party. In fact, if it wasn't for the \"bat crap\" crazy liberals in the Democratic party you wouldn't see much difference at all. The only place where the GOP and the Dem Parties differ right now are in ethical values. The Dems call them \"wedge issues\", I call them fundamental beliefs that come from the Judaio Christian foundation of our country. The Dems like to use these issues as \"wedge issues\" to say the GOP is outdated and out of touch. I say that fundamental beliefs should not be changed to go along with the times. The GOP's values have been around for thousands of years while many of the \"wedge issues\" have only been issues for a few decades. That is not to say that the issues don't have merit, because they do. I feel that there are solutions to these issues that can make the majority happy, not just the small minorities of people who want to change our laws and values to benefit them. All of this is IMHO of course.", 
        "intTime": 20090519, 
        "postID": 34, 
        "quote": "Originally posted by usa_girl: stec, I hear what you are saying, but don't you think the Republican party needs some fresh air? Do you have to give up values in order to meet the people half way? I don't think bitterness is going to cut it next time around. The fact is, the Bush people gave the liberal radicals so much to use and run on they will still be feeding off of it in the next election. They have already turned the Obama spending around to be the fault of Bush. Obama can spend whatever he wants and just keep repeating he inheirated this debt, never that he is adding to it or creating it. He can go to war in Afganistan and many Americans will pay for that war too and it will still be the liberals saying they did not start the war Bush did. Why do you think the liberals are working so hard to keep the war crimes against Bush admin going? If they can drag that out until the next election how good will that be for the Reps? Republicans need to regroup if they are going to turn this around. If Obama fails, then they will have a better chance at slipping in. If he does not fail and everything he is doing ends up helping America, then good for us.", 
        "reply": " You are absolutly correct. If Republicans hadn't practiced out of control spending, the party wouldn't be as bad off as it is. The GOP used to be known as the party of fiscal responsibility. That has gone out the window over the last couple of decades. If anything, the GOP has strayed so far away from it's fiscally responsible and small government values that it is hard to tell the party apart from the democratic party. In fact, if it wasn't for the \"bat crap\" crazy liberals in the Democratic party you wouldn't see much difference at all. The only place where the GOP and the Dem Parties differ right now are in ethical values. The Dems call them \"wedge issues\", I call them fundamental beliefs that come from the Judaio Christian foundation of our country. The Dems like to use these issues as \"wedge issues\" to say the GOP is outdated and out of touch. I say that fundamental beliefs should not be changed to go along with the times. The GOP's values have been around for thousands of years while many of the \"wedge issues\" have only been issues for a few decades. That is not to say that the issues don't have merit, because they do. I feel that there are solutions to these issues that can make the majority happy, not just the small minorities of people who want to change our laws and values to benefit them. All of this is IMHO of course.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:20:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "stec74"
    }, 
    {
        "content": "busnrete, That site is great information. Thanks for sharing. It is good to know someone is watching out for the student.", 
        "intTime": 20090519, 
        "postID": 35, 
        "quote": "", 
        "reply": "busnrete, That site is great information. Thanks for sharing. It is good to know someone is watching out for the student.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:21:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Although my voting days are over, McCains daughter has two big things that I will keep my eyes on. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090519, 
        "postID": 36, 
        "quote": "Originally posted by Duster6: Although my voting days are over, McCains daughter has two big things that I will keep my eyes on.", 
        "reply": " \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:24:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance “liberal teachers and professors” That is because enlightened intelligent people tend to become liberal So unless you would like your children to be taught by morons who have no allegiance to the truth or finding out truth you are going to have to tolerate good people of honor and truth. You could send your children to Bob Jones U for a total brain washing in to the right wing extremist philosophy of hate but I will never employ one of those imbeciles from BJU.", 
        "intTime": 20090519, 
        "postID": 37, 
        "quote": "Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance", 
        "reply": " “liberal teachers and professors” That is because enlightened intelligent people tend to become liberal So unless you would like your children to be taught by morons who have no allegiance to the truth or finding out truth you are going to have to tolerate good people of honor and truth. You could send your children to Bob Jones U for a total brain washing in to the right wing extremist philosophy of hate but I will never employ one of those imbeciles from BJU.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:25:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by 6837602: quote: Originally posted by stec74: quote: Originally posted by usa_girl: I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe A \"fresh new look\" does not mean leaving behind all of the values that the Republican Party has stood for. Which is what Meghan McCain keeps preaching. She wants the party to be \"democrat light\" which is not what the American people will be looking for in the next eight years. Meghan McCain is doing nothing but promoting her \"celebrity\" riding on her fathers coat tails. She is not a leader of the Republican Party. She is simply the \"flavor of the month\" for the main stream media to use to attack the GOP. You just hang on to that idea and we will have 16 years not 8. funny you mention life after Obama. When I think about who could run against Obama next time around, I really can't come up with anyone strong enough at this point. So, in my mind I think OK, 8 years with Obama and maybe the Reps can at least get the house back to keep it even with checks and balance. Then I think of life after Obama and if the Reps play the game right and Obama does not live up to the expectations, the Replican party has a chance again, but who would run? Now that the race card is off the table it is time for a women to be seated as President, only fair right? heheh", 
        "intTime": 20090519, 
        "postID": 38, 
        "quote": "Originally posted by 6837602: quote: Originally posted by stec74: quote: Originally posted by usa_girl: I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe A \"fresh new look\" does not mean leaving behind all of the values that the Republican Party has stood for. Which is what Meghan McCain keeps preaching. She wants the party to be \"democrat light\" which is not what the American people will be looking for in the next eight years. Meghan McCain is doing nothing but promoting her \"celebrity\" riding on her fathers coat tails. She is not a leader of the Republican Party. She is simply the \"flavor of the month\" for the main stream media to use to attack the GOP. You just hang on to that idea and we will have 16 years not 8.", 
        "reply": " funny you mention life after Obama. When I think about who could run against Obama next time around, I really can't come up with anyone strong enough at this point. So, in my mind I think OK, 8 years with Obama and maybe the Reps can at least get the house back to keep it even with checks and balance. Then I think of life after Obama and if the Reps play the game right and Obama does not live up to the expectations, the Replican party has a chance again, but who would run? Now that the race card is off the table it is time for a women to be seated as President, only fair right? heheh", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:25:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by 6837602: quote: Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance “liberal teachers and professors” That is because enlightened intelligent people tend to become liberal So unless you would like your children to be taught by morons who have no allegiance to the truth or finding out truth you are going to have to tolerate good people of honor and truth. You could send your children to Bob Jones U for a total brain washing in to the right wing extremist philosophy of hate but I will never employ one of those imbeciles from BJU. That is funny. Seem to remember a few weeks back about a liberal teacher who yelled a student for looking at fox news. But you say the conservative teachers brain wash....haven't heard any stories of teachers doing that to students who look at CNN? I think the best teachers are ones who don't bring politics or religion into the school and just teach. I don't want to hear how you have your nose up O's arse or if you have a woody for Palin. Just teach the damn class. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090519, 
        "postID": 39, 
        "quote": "Originally posted by 6837602: quote: Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance “liberal teachers and professors” That is because enlightened intelligent people tend to become liberal So unless you would like your children to be taught by morons who have no allegiance to the truth or finding out truth you are going to have to tolerate good people of honor and truth. You could send your children to Bob Jones U for a total brain washing in to the right wing extremist philosophy of hate but I will never employ one of those imbeciles from BJU.", 
        "reply": " That is funny. Seem to remember a few weeks back about a liberal teacher who yelled a student for looking at fox news. But you say the conservative teachers brain wash....haven't heard any stories of teachers doing that to students who look at CNN? I think the best teachers are ones who don't bring politics or religion into the school and just teach. I don't want to hear how you have your nose up O's arse or if you have a woody for Palin. Just teach the damn class. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:29:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by 6837602: quote: Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance “liberal teachers and professors” That is because enlightened intelligent people tend to become liberal So unless you would like your children to be taught by morons who have no allegiance to the truth or finding out truth you are going to have to tolerate good people of honor and truth. You could send your children to Bob Jones U for a total brain washing in to the right wing extremist philosophy of hate but I will never employ one of those imbeciles from BJU. brainwashing???? hate???? you say only liberals can be smart and teach? that would be like me saying those who can do and those who can't do, teach! shame on you. then on top of that, you say you would not hire a person based on where they went to school or if they were liberal? no offense, but you sound radical and that is very one sided.", 
        "intTime": 20090519, 
        "postID": 40, 
        "quote": "Originally posted by 6837602: quote: Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance “liberal teachers and professors” That is because enlightened intelligent people tend to become liberal So unless you would like your children to be taught by morons who have no allegiance to the truth or finding out truth you are going to have to tolerate good people of honor and truth. You could send your children to Bob Jones U for a total brain washing in to the right wing extremist philosophy of hate but I will never employ one of those imbeciles from BJU.", 
        "reply": " brainwashing???? hate???? you say only liberals can be smart and teach? that would be like me saying those who can do and those who can't do, teach! shame on you. then on top of that, you say you would not hire a person based on where they went to school or if they were liberal? no offense, but you sound radical and that is very one sided.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:30:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "This evening Colbert had John McCains daughter on speaking on behalf of her new role within the Republican party as she signed up when she supported her father running for President. That I guess was the ultimate bonding moment for father and daughter. She is only 24 and said that she is pro life, pro sex and pro gay marraige. I have to say, Colbert was pretty tame with her and she was a little flush at times but did manage to stay on topic and get her point across. She was well thought out, not bitter, had ideas for the party going forward and enjoyed her sense of humor. Her response to pro sex is just that she does not think that is going to work for the old party. She took on that term prosex to oppose Bristol Palins stand on sex and abortion. McCains daughter thinks they should talk about the reality of sex at any age and the consquences of those actions. She wants it talked about in shcool, church, family home etc she feels you must have safe sex and more optioins like adoption if the condom is faulty. she said that no twittering, blogging etc was going to make anyone think the party has changed and are hip but she said the gop is a great party and there is a place for gay people within the party, and ways to work together to support education on sexual issues she thinks there are some really good old boys from the party but it is time for the next generation to step in and make a case for change. She would not talk about Palin or call anyone out. She just was sweet spoken with a message she wanted to get across. I think I am going to keep a watch on her. She seems to be coming off very well so I put her as one to watch. I think Obama has this for two terms and unless Michelle runs it will then go back to the right if they are ready to run with someone. We tackled the racial issue, now lets cross the female issue. It is time. It is time to start looking at a young Condi Rice, only she wont run..why?... but we need someone just like her. smart, well spoken, highly educated, was in the inner group,knows the players and looks the part. they are already trying to build up the GOP with the governors. They need to change this next election around to get the new breed of smart, fun, good looking people in there of the next generation. they need to spend the time in office doing great things for their states and wait for the opportunity to take the house back and a few governors could slip into senate seats What do you think,,is it possible to get a fresh intellegent female ready to run for President? Who is the list? Not Hillary, she will be too old. It would have Gop still has some female people to look at that might shine. I would love to hear your thoughts on this.", 
        "intTime": 20090519, 
        "postID": 41, 
        "quote": "", 
        "reply": "This evening Colbert had John McCains daughter on speaking on behalf of her new role within the Republican party as she signed up when she supported her father running for President. That I guess was the ultimate bonding moment for father and daughter. She is only 24 and said that she is pro life, pro sex and pro gay marraige. I have to say, Colbert was pretty tame with her and she was a little flush at times but did manage to stay on topic and get her point across. She was well thought out, not bitter, had ideas for the party going forward and enjoyed her sense of humor. Her response to pro sex is just that she does not think that is going to work for the old party. She took on that term prosex to oppose Bristol Palins stand on sex and abortion. McCains daughter thinks they should talk about the reality of sex at any age and the consquences of those actions. She wants it talked about in shcool, church, family home etc she feels you must have safe sex and more optioins like adoption if the condom is faulty. she said that no twittering, blogging etc was going to make anyone think the party has changed and are hip but she said the gop is a great party and there is a place for gay people within the party, and ways to work together to support education on sexual issues she thinks there are some really good old boys from the party but it is time for the next generation to step in and make a case for change. She would not talk about Palin or call anyone out. She just was sweet spoken with a message she wanted to get across. I think I am going to keep a watch on her. She seems to be coming off very well so I put her as one to watch. I think Obama has this for two terms and unless Michelle runs it will then go back to the right if they are ready to run with someone. We tackled the racial issue, now lets cross the female issue. It is time. It is time to start looking at a young Condi Rice, only she wont run..why?... but we need someone just like her. smart, well spoken, highly educated, was in the inner group,knows the players and looks the part. they are already trying to build up the GOP with the governors. They need to change this next election around to get the new breed of smart, fun, good looking people in there of the next generation. they need to spend the time in office doing great things for their states and wait for the opportunity to take the house back and a few governors could slip into senate seats What do you think,,is it possible to get a fresh intellegent female ready to run for President? Who is the list? Not Hillary, she will be too old. It would have Gop still has some female people to look at that might shine. I would love to hear your thoughts on this.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 00:27:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance", 
        "intTime": 20090519, 
        "postID": 42, 
        "quote": "", 
        "reply": "It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 01:54:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "ronald45"
    }, 
    {
        "content": "quote: If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance that won't happen as long as the Republicans stay with their anti-science/anti-education policies.", 
        "intTime": 20090519, 
        "postID": 43, 
        "quote": "If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance", 
        "reply": " that won't happen as long as the Republicans stay with their anti-science/anti-education policies.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 02:14:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "Although my voting days are over, McCains daughter has two big things that I will keep my eyes on.", 
        "intTime": 20090519, 
        "postID": 44, 
        "quote": "", 
        "reply": "Although my voting days are over, McCains daughter has two big things that I will keep my eyes on.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 04:29:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: McCains daughter has two big things that I will keep my eyes on. agreed.", 
        "intTime": 20090519, 
        "postID": 45, 
        "quote": "McCains daughter has two big things that I will keep my eyes on.", 
        "reply": " agreed.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 04:35:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "lol@ Duster.", 
        "intTime": 20090519, 
        "postID": 46, 
        "quote": "", 
        "reply": "lol@ Duster.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 07:29:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe", 
        "intTime": 20090519, 
        "postID": 47, 
        "quote": "", 
        "reply": "I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 07:35:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance that won't happen as long as the Republicans stay with their anti-science/anti-education policies. Whic party bows to the teachers unions every election cycle? Which party believes in education vouchers allowing parents to send their children to the school of their choice, creating competition and higher standards for schools across the nation?", 
        "intTime": 20090519, 
        "postID": 48, 
        "quote": "Originally posted by karlhungusjr: quote: If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance that won't happen as long as the Republicans stay with their anti-science/anti-education policies.", 
        "reply": " Whic party bows to the teachers unions every election cycle? Which party believes in education vouchers allowing parents to send their children to the school of their choice, creating competition and higher standards for schools across the nation?", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 07:39:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe A \"fresh new look\" does not mean leaving behind all of the values that the Republican Party has stood for. Which is what Meghan McCain keeps preaching. She wants the party to be \"democrat light\" which is not what the American people will be looking for in the next eight years. Meghan McCain is doing nothing but promoting her \"celebrity\" riding on her fathers coat tails. She is not a leader of the Republican Party. She is simply the \"flavor of the month\" for the main stream media to use to attack the GOP.", 
        "intTime": 20090519, 
        "postID": 49, 
        "quote": "Originally posted by usa_girl: I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe", 
        "reply": " A \"fresh new look\" does not mean leaving behind all of the values that the Republican Party has stood for. Which is what Meghan McCain keeps preaching. She wants the party to be \"democrat light\" which is not what the American people will be looking for in the next eight years. Meghan McCain is doing nothing but promoting her \"celebrity\" riding on her fathers coat tails. She is not a leader of the Republican Party. She is simply the \"flavor of the month\" for the main stream media to use to attack the GOP.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 07:44:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "stec74"
    }, 
    {
        "content": "stec, I hear what you are saying, but don't you think the Republican party needs some fresh air? Do you have to give up values in order to meet the people half way? I don't think bitterness is going to cut it next time around. The fact is, the Bush people gave the liberal radicals so much to use and run on they will still be feeding off of it in the next election. They have already turned the Obama spending around to be the fault of Bush. Obama can spend whatever he wants and just keep repeating he inheirated this debt, never that he is adding to it or creating it. He can go to war in Afganistan and many Americans will pay for that war too and it will still be the liberals saying they did not start the war Bush did. Why do you think the liberals are working so hard to keep the war crimes against Bush admin going? If they can drag that out until the next election how good will that be for the Reps? Republicans need to regroup if they are going to turn this around. If Obama fails, then they will have a better chance at slipping in. If he does not fail and everything he is doing ends up helping America, then good for us.", 
        "intTime": 20090519, 
        "postID": 50, 
        "quote": "", 
        "reply": "stec, I hear what you are saying, but don't you think the Republican party needs some fresh air? Do you have to give up values in order to meet the people half way? I don't think bitterness is going to cut it next time around. The fact is, the Bush people gave the liberal radicals so much to use and run on they will still be feeding off of it in the next election. They have already turned the Obama spending around to be the fault of Bush. Obama can spend whatever he wants and just keep repeating he inheirated this debt, never that he is adding to it or creating it. He can go to war in Afganistan and many Americans will pay for that war too and it will still be the liberals saying they did not start the war Bush did. Why do you think the liberals are working so hard to keep the war crimes against Bush admin going? If they can drag that out until the next election how good will that be for the Reps? Republicans need to regroup if they are going to turn this around. If Obama fails, then they will have a better chance at slipping in. If he does not fail and everything he is doing ends up helping America, then good for us.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:02:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance I agree ronald. But that will not happen until the teacher's unions change! My daughter is an RN and is currently enrolled at Florida State for her BSN. One of her current classes is Nursing in the Health Care System. The text book (not sure whether the college picked it or the Professor) is newly copy righted and professes government run health care! BTW. If you have a student in college and they feel that they are being singled out or chastised by a professor with a liberal point of view, they can complain (annomously) through a web site called \"http://noindoctrination.org/\"! The lady who runs it lives in California and has done some great things! Check it out.", 
        "intTime": 20090519, 
        "postID": 51, 
        "quote": "Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance", 
        "reply": " I agree ronald. But that will not happen until the teacher's unions change! My daughter is an RN and is currently enrolled at Florida State for her BSN. One of her current classes is Nursing in the Health Care System. The text book (not sure whether the college picked it or the Professor) is newly copy righted and professes government run health care! BTW. If you have a student in college and they feel that they are being singled out or chastised by a professor with a liberal point of view, they can complain (annomously) through a web site called \"http://noindoctrination.org/\"! The lady who runs it lives in California and has done some great things! Check it out.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:03:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by usa_girl: I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe A \"fresh new look\" does not mean leaving behind all of the values that the Republican Party has stood for. Which is what Meghan McCain keeps preaching. She wants the party to be \"democrat light\" which is not what the American people will be looking for in the next eight years. Meghan McCain is doing nothing but promoting her \"celebrity\" riding on her fathers coat tails. She is not a leader of the Republican Party. She is simply the \"flavor of the month\" for the main stream media to use to attack the GOP. You just hang on to that idea and we will have 16 years not 8.", 
        "intTime": 20090519, 
        "postID": 52, 
        "quote": "Originally posted by stec74: quote: Originally posted by usa_girl: I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe A \"fresh new look\" does not mean leaving behind all of the values that the Republican Party has stood for. Which is what Meghan McCain keeps preaching. She wants the party to be \"democrat light\" which is not what the American people will be looking for in the next eight years. Meghan McCain is doing nothing but promoting her \"celebrity\" riding on her fathers coat tails. She is not a leader of the Republican Party. She is simply the \"flavor of the month\" for the main stream media to use to attack the GOP.", 
        "reply": " You just hang on to that idea and we will have 16 years not 8.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:14:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "6837602"
    }, 
    {
        "content": "Just curious, has it dawned on anyone the problem might not be the messenger, it might be the message? Resurrect Teddy Roosevelt.", 
        "intTime": 20090519, 
        "postID": 53, 
        "quote": "", 
        "reply": "Just curious, has it dawned on anyone the problem might not be the messenger, it might be the message? Resurrect Teddy Roosevelt.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:17:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: stec, I hear what you are saying, but don't you think the Republican party needs some fresh air? Do you have to give up values in order to meet the people half way? I don't think bitterness is going to cut it next time around. The fact is, the Bush people gave the liberal radicals so much to use and run on they will still be feeding off of it in the next election. They have already turned the Obama spending around to be the fault of Bush. Obama can spend whatever he wants and just keep repeating he inheirated this debt, never that he is adding to it or creating it. He can go to war in Afganistan and many Americans will pay for that war too and it will still be the liberals saying they did not start the war Bush did. Why do you think the liberals are working so hard to keep the war crimes against Bush admin going? If they can drag that out until the next election how good will that be for the Reps? Republicans need to regroup if they are going to turn this around. If Obama fails, then they will have a better chance at slipping in. If he does not fail and everything he is doing ends up helping America, then good for us. You are absolutly correct. If Republicans hadn't practiced out of control spending, the party wouldn't be as bad off as it is. The GOP used to be known as the party of fiscal responsibility. That has gone out the window over the last couple of decades. If anything, the GOP has strayed so far away from it's fiscally responsible and small government values that it is hard to tell the party apart from the democratic party. In fact, if it wasn't for the \"bat crap\" crazy liberals in the Democratic party you wouldn't see much difference at all. The only place where the GOP and the Dem Parties differ right now are in ethical values. The Dems call them \"wedge issues\", I call them fundamental beliefs that come from the Judaio Christian foundation of our country. The Dems like to use these issues as \"wedge issues\" to say the GOP is outdated and out of touch. I say that fundamental beliefs should not be changed to go along with the times. The GOP's values have been around for thousands of years while many of the \"wedge issues\" have only been issues for a few decades. That is not to say that the issues don't have merit, because they do. I feel that there are solutions to these issues that can make the majority happy, not just the small minorities of people who want to change our laws and values to benefit them. All of this is IMHO of course.", 
        "intTime": 20090519, 
        "postID": 54, 
        "quote": "Originally posted by usa_girl: stec, I hear what you are saying, but don't you think the Republican party needs some fresh air? Do you have to give up values in order to meet the people half way? I don't think bitterness is going to cut it next time around. The fact is, the Bush people gave the liberal radicals so much to use and run on they will still be feeding off of it in the next election. They have already turned the Obama spending around to be the fault of Bush. Obama can spend whatever he wants and just keep repeating he inheirated this debt, never that he is adding to it or creating it. He can go to war in Afganistan and many Americans will pay for that war too and it will still be the liberals saying they did not start the war Bush did. Why do you think the liberals are working so hard to keep the war crimes against Bush admin going? If they can drag that out until the next election how good will that be for the Reps? Republicans need to regroup if they are going to turn this around. If Obama fails, then they will have a better chance at slipping in. If he does not fail and everything he is doing ends up helping America, then good for us.", 
        "reply": " You are absolutly correct. If Republicans hadn't practiced out of control spending, the party wouldn't be as bad off as it is. The GOP used to be known as the party of fiscal responsibility. That has gone out the window over the last couple of decades. If anything, the GOP has strayed so far away from it's fiscally responsible and small government values that it is hard to tell the party apart from the democratic party. In fact, if it wasn't for the \"bat crap\" crazy liberals in the Democratic party you wouldn't see much difference at all. The only place where the GOP and the Dem Parties differ right now are in ethical values. The Dems call them \"wedge issues\", I call them fundamental beliefs that come from the Judaio Christian foundation of our country. The Dems like to use these issues as \"wedge issues\" to say the GOP is outdated and out of touch. I say that fundamental beliefs should not be changed to go along with the times. The GOP's values have been around for thousands of years while many of the \"wedge issues\" have only been issues for a few decades. That is not to say that the issues don't have merit, because they do. I feel that there are solutions to these issues that can make the majority happy, not just the small minorities of people who want to change our laws and values to benefit them. All of this is IMHO of course.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:20:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "stec74"
    }, 
    {
        "content": "busnrete, That site is great information. Thanks for sharing. It is good to know someone is watching out for the student.", 
        "intTime": 20090519, 
        "postID": 55, 
        "quote": "", 
        "reply": "busnrete, That site is great information. Thanks for sharing. It is good to know someone is watching out for the student.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:21:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Although my voting days are over, McCains daughter has two big things that I will keep my eyes on. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090519, 
        "postID": 56, 
        "quote": "Originally posted by Duster6: Although my voting days are over, McCains daughter has two big things that I will keep my eyes on.", 
        "reply": " \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:24:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance “liberal teachers and professors” That is because enlightened intelligent people tend to become liberal So unless you would like your children to be taught by morons who have no allegiance to the truth or finding out truth you are going to have to tolerate good people of honor and truth. You could send your children to Bob Jones U for a total brain washing in to the right wing extremist philosophy of hate but I will never employ one of those imbeciles from BJU.", 
        "intTime": 20090519, 
        "postID": 57, 
        "quote": "Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance", 
        "reply": " “liberal teachers and professors” That is because enlightened intelligent people tend to become liberal So unless you would like your children to be taught by morons who have no allegiance to the truth or finding out truth you are going to have to tolerate good people of honor and truth. You could send your children to Bob Jones U for a total brain washing in to the right wing extremist philosophy of hate but I will never employ one of those imbeciles from BJU.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:25:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "6837602"
    }, 
    {
        "content": "quote: Originally posted by 6837602: quote: Originally posted by stec74: quote: Originally posted by usa_girl: I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe A \"fresh new look\" does not mean leaving behind all of the values that the Republican Party has stood for. Which is what Meghan McCain keeps preaching. She wants the party to be \"democrat light\" which is not what the American people will be looking for in the next eight years. Meghan McCain is doing nothing but promoting her \"celebrity\" riding on her fathers coat tails. She is not a leader of the Republican Party. She is simply the \"flavor of the month\" for the main stream media to use to attack the GOP. You just hang on to that idea and we will have 16 years not 8. funny you mention life after Obama. When I think about who could run against Obama next time around, I really can't come up with anyone strong enough at this point. So, in my mind I think OK, 8 years with Obama and maybe the Reps can at least get the house back to keep it even with checks and balance. Then I think of life after Obama and if the Reps play the game right and Obama does not live up to the expectations, the Replican party has a chance again, but who would run? Now that the race card is off the table it is time for a women to be seated as President, only fair right? heheh", 
        "intTime": 20090519, 
        "postID": 58, 
        "quote": "Originally posted by 6837602: quote: Originally posted by stec74: quote: Originally posted by usa_girl: I agree with you ronald, there should be a more balanced view point within the educational system. It does not help that all of the sudden being Democratic is like being a rock star and hollywood seems to be feeding off of it. The Republican party much get a fresh new look and attitude. Then there is my party, the Independent party. Who knows, you might see both parties moving a little to the middle with me in the next few years. hehe A \"fresh new look\" does not mean leaving behind all of the values that the Republican Party has stood for. Which is what Meghan McCain keeps preaching. She wants the party to be \"democrat light\" which is not what the American people will be looking for in the next eight years. Meghan McCain is doing nothing but promoting her \"celebrity\" riding on her fathers coat tails. She is not a leader of the Republican Party. She is simply the \"flavor of the month\" for the main stream media to use to attack the GOP. You just hang on to that idea and we will have 16 years not 8.", 
        "reply": " funny you mention life after Obama. When I think about who could run against Obama next time around, I really can't come up with anyone strong enough at this point. So, in my mind I think OK, 8 years with Obama and maybe the Reps can at least get the house back to keep it even with checks and balance. Then I think of life after Obama and if the Reps play the game right and Obama does not live up to the expectations, the Replican party has a chance again, but who would run? Now that the race card is off the table it is time for a women to be seated as President, only fair right? heheh", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:25:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by 6837602: quote: Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance “liberal teachers and professors” That is because enlightened intelligent people tend to become liberal So unless you would like your children to be taught by morons who have no allegiance to the truth or finding out truth you are going to have to tolerate good people of honor and truth. You could send your children to Bob Jones U for a total brain washing in to the right wing extremist philosophy of hate but I will never employ one of those imbeciles from BJU. That is funny. Seem to remember a few weeks back about a liberal teacher who yelled a student for looking at fox news. But you say the conservative teachers brain wash....haven't heard any stories of teachers doing that to students who look at CNN? I think the best teachers are ones who don't bring politics or religion into the school and just teach. I don't want to hear how you have your nose up O's arse or if you have a woody for Palin. Just teach the damn class. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090519, 
        "postID": 59, 
        "quote": "Originally posted by 6837602: quote: Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance “liberal teachers and professors” That is because enlightened intelligent people tend to become liberal So unless you would like your children to be taught by morons who have no allegiance to the truth or finding out truth you are going to have to tolerate good people of honor and truth. You could send your children to Bob Jones U for a total brain washing in to the right wing extremist philosophy of hate but I will never employ one of those imbeciles from BJU.", 
        "reply": " That is funny. Seem to remember a few weeks back about a liberal teacher who yelled a student for looking at fox news. But you say the conservative teachers brain wash....haven't heard any stories of teachers doing that to students who look at CNN? I think the best teachers are ones who don't bring politics or religion into the school and just teach. I don't want to hear how you have your nose up O's arse or if you have a woody for Palin. Just teach the damn class. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:29:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by 6837602: quote: Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance “liberal teachers and professors” That is because enlightened intelligent people tend to become liberal So unless you would like your children to be taught by morons who have no allegiance to the truth or finding out truth you are going to have to tolerate good people of honor and truth. You could send your children to Bob Jones U for a total brain washing in to the right wing extremist philosophy of hate but I will never employ one of those imbeciles from BJU. brainwashing???? hate???? you say only liberals can be smart and teach? that would be like me saying those who can do and those who can't do, teach! shame on you. then on top of that, you say you would not hire a person based on where they went to school or if they were liberal? no offense, but you sound radical and that is very one sided.", 
        "intTime": 20090519, 
        "postID": 60, 
        "quote": "Originally posted by 6837602: quote: Originally posted by ronald45: It will be hard for the GOP to attract new members until they get on the college/high school campuses. Today Democrats are seen as the part of the young because let's face it they are indoctrinated at a young age by liberal teachers and professors. Doesn't matter who runs for senator, the governors etc. If you want the GOP to be the party of choice get Republican teachers/professors and they might have a chance “liberal teachers and professors” That is because enlightened intelligent people tend to become liberal So unless you would like your children to be taught by morons who have no allegiance to the truth or finding out truth you are going to have to tolerate good people of honor and truth. You could send your children to Bob Jones U for a total brain washing in to the right wing extremist philosophy of hate but I will never employ one of those imbeciles from BJU.", 
        "reply": " brainwashing???? hate???? you say only liberals can be smart and teach? that would be like me saying those who can do and those who can't do, teach! shame on you. then on top of that, you say you would not hire a person based on where they went to school or if they were liberal? no offense, but you sound radical and that is very one sided.", 
        "threadID": "672198221_5540026322001", 
        "time": "2009-05-19 08:30:00", 
        "title": "Who watched Colbert this evening?", 
        "userID": "usa_girl"
    }
]