[
    {
        "content": "I must say, that while Obama has been a big disappointment to me in many respects, his public speeches are inspirational. One of the Great speakers of our time. Here are some of my favorite excerpts from his Commencement Address at Annapolis. I recoment reading the whole speech. He truly clarifies, what American Values are, and how the military upholds them. quote: But most of all, I’ve admired the spirit of your service. Because it’s not the strength of our arms or the power of our technology that gives the United States our military dominance. It’s our people. It’s our Sailors and Marines, Soldiers and Airmen and Coast Guardsmen who perform brilliantly in every mission we give them. ************** This class is about to become the latest link in a long, unbroken chain of heroism and victory. A chain forged in battles whose names are etched in the stone of this stadium. From Coral Sea to Midway to Guadalcanal. From Iwo Jima to Inchon. From the Mekong Delta to Desert Storm. For some among us, these are not just places on a map. They are the stories of their lives. And we honor all our veterans here today. This chain of service calls to mind words that were spoken here in Annapolis on another spring day a century ago. The crowds assembled, the bands played, and the cannons roared. And as John Paul Jones’ body was carried to the Yard, President Teddy Roosevelt spoke to the Midshipmen gathered there that day. \"Remember,\" he said, \"our words of admiration are but as sounding brass and tinkling symbols if we do not…prepare to emulate their deeds.\" Emulate their deeds. That is what you are called upon to do. And in doing so these past four years, you have not only given meaning to your own lives, you serve as a reminder—a challenge—to your fellow Americans to fulfill the true meaning of citizenship. America, look at these young men and women. Look at these Sailors and Marines. Here are the values we cherish. Here are the ideals that endure. In an era when too few citizens answer the call to service—to community or country—these Americans chose to serve. And they did so in a time of war, knowing they might be called upon to make the ultimate sacrifice. ************* In a culture where so many chase the outward markers of success that can so often lead us astray—titles and status, materialism and money, fame and popularity—these Americans have embraced the virtues that we need most right now. Self-discipline over self-interest. Work over comfort. Character over celebrity. After an era when so many institutions and individuals acted with such greed and recklessness, it is no wonder that our military remains the most trusted institution in the nation. And in a world when so many forces and voices seek to divide us, it is inspiring that this class came together and succeeded together, from every state and every corner of the world. By building an institution that is more diverse than ever—more women, more Hispanics, more African Americans—the Naval Academy has reaffirmed a fundamental American truth: that out of many, we are one. We see these values in every one of these Sailors and Marines, including those who have already served their country—the dozens among you with prior enlisted service. ************ Honor. Courage. Commitment. These are the values that have defined your years in the Yard and that you’ll need in the years ahead. As you join the fleet. As you lead Marines. As you confront the ever-changing threats of an ever-changing world. For history teaches us that the nations that grow comfortable with the old ways and complacent in the face of new threats—those nations do not long endure. And in the 21st century, we do not have the luxury of deciding which challenges to prepare for and which to ignore. We must overcome the full spectrum of threats. The conventional and the unconventional. The nation-state and the terrorist network. The spread of deadly technologies and of hateful ideologies. Eighteenth century-style piracy and 21st century cyberthreats. ***************** Marines—we need you to defeat the insurgent and the extremist. But we also need you to work with the tribal sheik and local leaders from Anbar to Kandahar who want to build a better future for their people. Naval aviators and flight officers—we need you to dominate the airspace in times of conflict, but also to deliver food and medicine in times of humanitarian crisis. And surface warfare officers and submariners—we need you to project American power across the vast oceans, but also to project American principles and values when you pull into that foreign port—because for so many people around the world, you are the face of America. ************** Yesterday I visited the National Archives and the hall that holds our Constitution, Declaration of Independence and the Bill of Rights. I went there because as our nation debates how to deal with the security challenges that we face, we must remember this enduring truth: the values and ideals in those documents are not simply words written into aging parchment, they are the bedrock of our liberty and our security. We uphold our fundamental principles and values not just because we choose to, but because we swear to. Not because they feel good, but because they help keep us safe. Because when America strays from our values, it not only undermines the rule of law, it alienates us from our allies, it energizes our adversaries and it endangers our national security and the lives of our troops. So as Americans, we reject the false chose between our security and our ideals. We can and we must and we will protect both. And that is just what you will pledge to do in a few moments when you raise your right hand and take your oath. By that simple act you will accept a life of great sacrifice. Long deployments. Separation for loved ones. Tests and trials that most Americans cannot imagine. But that is the oath you take, the life you choose, the promise you make to America. And, today, this is the promise I make to you. It’s a promise that as long as I am your Commander in Chief, I will only send you into harm’s way when it is absolutely necessary, and with the strategy, the well-defined goals, the equipment and the support you need to get the job done. This includes the job of bringing the Iraq war to a responsible end and pursuing a new comprehensive strategy to disrupt, dismantle and defeat al Qaeda and its allies in Afghanistan and Pakistan. And to get you the support you need, we’re enlisting all elements of our national power—our diplomacy and development and our economic might and our moral suasion—so that you and the rest of our military do not bear the burden of our security alone. We will also ensure you can meet the missions of today, which is why we’ve halted reductions in Navy personnel and increased the size of the Marine Corps. And we will ensure you can meet the missions of tomorrow, which is why we’re investing in the capabilities and technologies—the littoral combat ships, the most advanced submarines and fighter aircraft—so that you have what you need to succeed. In short, we will maintain America’s military dominance and keep you the finest fighting force the world has ever seen. http://www.usna.edu/PAO/", 
        "intTime": 20090522, 
        "postID": 1, 
        "quote": "But most of all, I’ve admired the spirit of your service. Because it’s not the strength of our arms or the power of our technology that gives the United States our military dominance. It’s our people. It’s our Sailors and Marines, Soldiers and Airmen and Coast Guardsmen who perform brilliantly in every mission we give them. ************** This class is about to become the latest link in a long, unbroken chain of heroism and victory. A chain forged in battles whose names are etched in the stone of this stadium. From Coral Sea to Midway to Guadalcanal. From Iwo Jima to Inchon. From the Mekong Delta to Desert Storm. For some among us, these are not just places on a map. They are the stories of their lives. And we honor all our veterans here today. This chain of service calls to mind words that were spoken here in Annapolis on another spring day a century ago. The crowds assembled, the bands played, and the cannons roared. And as John Paul Jones’ body was carried to the Yard, President Teddy Roosevelt spoke to the Midshipmen gathered there that day. \"Remember,\" he said, \"our words of admiration are but as sounding brass and tinkling symbols if we do not…prepare to emulate their deeds.\" Emulate their deeds. That is what you are called upon to do. And in doing so these past four years, you have not only given meaning to your own lives, you serve as a reminder—a challenge—to your fellow Americans to fulfill the true meaning of citizenship. America, look at these young men and women. Look at these Sailors and Marines. Here are the values we cherish. Here are the ideals that endure. In an era when too few citizens answer the call to service—to community or country—these Americans chose to serve. And they did so in a time of war, knowing they might be called upon to make the ultimate sacrifice. ************* In a culture where so many chase the outward markers of success that can so often lead us astray—titles and status, materialism and money, fame and popularity—these Americans have embraced the virtues that we need most right now. Self-discipline over self-interest. Work over comfort. Character over celebrity. After an era when so many institutions and individuals acted with such greed and recklessness, it is no wonder that our military remains the most trusted institution in the nation. And in a world when so many forces and voices seek to divide us, it is inspiring that this class came together and succeeded together, from every state and every corner of the world. By building an institution that is more diverse than ever—more women, more Hispanics, more African Americans—the Naval Academy has reaffirmed a fundamental American truth: that out of many, we are one. We see these values in every one of these Sailors and Marines, including those who have already served their country—the dozens among you with prior enlisted service. ************ Honor. Courage. Commitment. These are the values that have defined your years in the Yard and that you’ll need in the years ahead. As you join the fleet. As you lead Marines. As you confront the ever-changing threats of an ever-changing world. For history teaches us that the nations that grow comfortable with the old ways and complacent in the face of new threats—those nations do not long endure. And in the 21st century, we do not have the luxury of deciding which challenges to prepare for and which to ignore. We must overcome the full spectrum of threats. The conventional and the unconventional. The nation-state and the terrorist network. The spread of deadly technologies and of hateful ideologies. Eighteenth century-style piracy and 21st century cyberthreats. ***************** Marines—we need you to defeat the insurgent and the extremist. But we also need you to work with the tribal sheik and local leaders from Anbar to Kandahar who want to build a better future for their people. Naval aviators and flight officers—we need you to dominate the airspace in times of conflict, but also to deliver food and medicine in times of humanitarian crisis. And surface warfare officers and submariners—we need you to project American power across the vast oceans, but also to project American principles and values when you pull into that foreign port—because for so many people around the world, you are the face of America. ************** Yesterday I visited the National Archives and the hall that holds our Constitution, Declaration of Independence and the Bill of Rights. I went there because as our nation debates how to deal with the security challenges that we face, we must remember this enduring truth: the values and ideals in those documents are not simply words written into aging parchment, they are the bedrock of our liberty and our security. We uphold our fundamental principles and values not just because we choose to, but because we swear to. Not because they feel good, but because they help keep us safe. Because when America strays from our values, it not only undermines the rule of law, it alienates us from our allies, it energizes our adversaries and it endangers our national security and the lives of our troops. So as Americans, we reject the false chose between our security and our ideals. We can and we must and we will protect both. And that is just what you will pledge to do in a few moments when you raise your right hand and take your oath. By that simple act you will accept a life of great sacrifice. Long deployments. Separation for loved ones. Tests and trials that most Americans cannot imagine. But that is the oath you take, the life you choose, the promise you make to America. And, today, this is the promise I make to you. It’s a promise that as long as I am your Commander in Chief, I will only send you into harm’s way when it is absolutely necessary, and with the strategy, the well-defined goals, the equipment and the support you need to get the job done. This includes the job of bringing the Iraq war to a responsible end and pursuing a new comprehensive strategy to disrupt, dismantle and defeat al Qaeda and its allies in Afghanistan and Pakistan. And to get you the support you need, we’re enlisting all elements of our national power—our diplomacy and development and our economic might and our moral suasion—so that you and the rest of our military do not bear the burden of our security alone. We will also ensure you can meet the missions of today, which is why we’ve halted reductions in Navy personnel and increased the size of the Marine Corps. And we will ensure you can meet the missions of tomorrow, which is why we’re investing in the capabilities and technologies—the littoral combat ships, the most advanced submarines and fighter aircraft—so that you have what you need to succeed. In short, we will maintain America’s military dominance and keep you the finest fighting force the world has ever seen. http://www.usna.edu/PAO/", 
        "reply": "I must say, that while Obama has been a big disappointment to me in many respects, his public speeches are inspirational. One of the Great speakers of our time. Here are some of my favorite excerpts from his Commencement Address at Annapolis. I recoment reading the whole speech. He truly clarifies, what American Values are, and how the military upholds them. ", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-22 17:31:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "Grachus"
    }, 
    {
        "content": "- hey man, i was just about to post a link to the speech. it's amazing. yeah, will link to it in my 'fist bump' topic. nice. -", 
        "intTime": 20090522, 
        "postID": 2, 
        "quote": "", 
        "reply": "- hey man, i was just about to post a link to the speech. it's amazing. yeah, will link to it in my 'fist bump' topic. nice. -", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-22 19:38:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "Hunky, dory until I heard somewhere that he thought vets should help their country by paying their own medical bills to reduce US debt....as if we didn't do enough by standing in the gap for the rest of the country who didn't have to fight!?", 
        "intTime": 20090522, 
        "postID": 3, 
        "quote": "", 
        "reply": "Hunky, dory until I heard somewhere that he thought vets should help their country by paying their own medical bills to reduce US debt....as if we didn't do enough by standing in the gap for the rest of the country who didn't have to fight!?", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-22 19:48:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "Tower_Flower"
    }, 
    {
        "content": "quote: Originally posted by Tower_Flower: Hunky, dory until I heard somewhere that he thought vets should help their country by paying their own medical bills to reduce US debt....as if we didn't do enough by standing in the gap for the rest of the country who didn't have to fight!? You heard somewhere? Care to find a link? -", 
        "intTime": 20090522, 
        "postID": 4, 
        "quote": "Originally posted by Tower_Flower: Hunky, dory until I heard somewhere that he thought vets should help their country by paying their own medical bills to reduce US debt....as if we didn't do enough by standing in the gap for the rest of the country who didn't have to fight!?", 
        "reply": " You heard somewhere? Care to find a link? -", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-22 21:32:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "No....go easy on me, I'm sleepy", 
        "intTime": 20090522, 
        "postID": 5, 
        "quote": "", 
        "reply": "No....go easy on me, I'm sleepy", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-22 21:35:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "Tower_Flower"
    }, 
    {
        "content": "\"that while Obama has been a big disappointment to me in many respects, his public speeches are inspirational. One of the Great speakers of our time. \" That's what got him elected - his speaking abilities. Certainly not his past accomplishments. Question is, does he write his own speeches or does he pay someone to do it for him?", 
        "intTime": 20090523, 
        "postID": 6, 
        "quote": "", 
        "reply": "\"that while Obama has been a big disappointment to me in many respects, his public speeches are inspirational. One of the Great speakers of our time. \" That's what got him elected - his speaking abilities. Certainly not his past accomplishments. Question is, does he write his own speeches or does he pay someone to do it for him?", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 02:10:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "mj101inf"
    }, 
    {
        "content": "quote: Originally posted by mj101inf: \"that while Obama has been a big disappointment to me in many respects, his public speeches are inspirational. One of the Great speakers of our time. \" That's what got him elected - his speaking abilities. Certainly not his past accomplishments. Question is, does he write his own speeches or does he pay someone to do it for him? no one truly writes their own speeches these days. the key is how to deliver them. and he is an extremely accomplished orator. oh, and as for past accomplishments, he beats the pants off the previous encumbent. - -", 
        "intTime": 20090523, 
        "postID": 7, 
        "quote": "Originally posted by mj101inf: \"that while Obama has been a big disappointment to me in many respects, his public speeches are inspirational. One of the Great speakers of our time. \" That's what got him elected - his speaking abilities. Certainly not his past accomplishments. Question is, does he write his own speeches or does he pay someone to do it for him?", 
        "reply": " no one truly writes their own speeches these days. the key is how to deliver them. and he is an extremely accomplished orator. oh, and as for past accomplishments, he beats the pants off the previous encumbent. - -", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 03:44:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "It was just your average every day politician speech. When one joins the military and puts on a uniform prior to that they take an oath. That oath states they will protect the US from all enemies foreign and domestic. Nothing about going to war only when absolutely necessary.", 
        "intTime": 20090523, 
        "postID": 8, 
        "quote": "", 
        "reply": "It was just your average every day politician speech. When one joins the military and puts on a uniform prior to that they take an oath. That oath states they will protect the US from all enemies foreign and domestic. Nothing about going to war only when absolutely necessary.", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 04:47:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "Duster6"
    }, 
    {
        "content": "The entire speech is up on You Tube. He did a fine job and personally congratulated the distinguished graduates.", 
        "intTime": 20090523, 
        "postID": 9, 
        "quote": "", 
        "reply": "The entire speech is up on You Tube. He did a fine job and personally congratulated the distinguished graduates.", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 05:08:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "vsibaby"
    }, 
    {
        "content": "There is another thread on this board about this speech, in which the OP takes his remarks about abiding by the law, as the only definition of \"American Values.\" Here is an excerpt (which is the only substantial quote) from the newspaper article cited in that thread... quote: Obama used the backdrop of the US Naval Academy graduation ceremony to argue that founding US ideals must guide the future battle against terrorism, a day after trying to quell raging debate over Guantanamo Bay in a major speech. \"We uphold our fundamental principles and values not just because we choose to, but because we swear to -- not because they feel good, but because they help keep us safe,\" Obama told 30,000 graduating navy cadets and family members. \"When America strays from our values, it not only undermines the rule of law, it alienates us from our allies, it energizes our adversaries and it endangers our national security and the lives of our troops.\" The OP on that thread, and far more importantly, all the right wing blogs, have seized on this to claim that Obamas only solution to Al Qaeda is no torture - They imply, that he's ready to negotiate with the Taliban and Osama. They neither needed to, or bothered to, actually read the whole speech. Dave", 
        "intTime": 20090523, 
        "postID": 10, 
        "quote": "Obama used the backdrop of the US Naval Academy graduation ceremony to argue that founding US ideals must guide the future battle against terrorism, a day after trying to quell raging debate over Guantanamo Bay in a major speech. \"We uphold our fundamental principles and values not just because we choose to, but because we swear to -- not because they feel good, but because they help keep us safe,\" Obama told 30,000 graduating navy cadets and family members. \"When America strays from our values, it not only undermines the rule of law, it alienates us from our allies, it energizes our adversaries and it endangers our national security and the lives of our troops.\"", 
        "reply": "There is another thread on this board about this speech, in which the OP takes his remarks about abiding by the law, as the only definition of \"American Values.\" Here is an excerpt (which is the only substantial quote) from the newspaper article cited in that thread...  The OP on that thread, and far more importantly, all the right wing blogs, have seized on this to claim that Obamas only solution to Al Qaeda is no torture - They imply, that he's ready to negotiate with the Taliban and Osama. They neither needed to, or bothered to, actually read the whole speech. Dave", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 08:39:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "Grachus"
    }, 
    {
        "content": "Not to take away the speech or him honoring the military, but where was all this love from him and the congress when Bush needed more money for our troops? He acts like only his war is a just war. It is the same darn war with the same darn people and started before him and will go on long after him. To take it out on our military for a political stand is wrong and to then turn around and acknowledge them for a political stand is insulting. Keep the military out of politics and let them do their job and give them the means to do the job. He talks about people that have not always acknowledged what our military has done for this country and treated them wrong and I would have to say that the majority of that behaior has always come from his party of radical liberals. Not that the Reps don't have radical people, but typically they don't take it out on the military. Oh well, I guess now that Obama is in office and had access to what is really going on he can see just home important or military is and how much he needs them. If nothing else, he can bring light to that. You know, the more and more Obama is in office he sounds and acts like Bush. heheh", 
        "intTime": 20090523, 
        "postID": 11, 
        "quote": "", 
        "reply": "Not to take away the speech or him honoring the military, but where was all this love from him and the congress when Bush needed more money for our troops? He acts like only his war is a just war. It is the same darn war with the same darn people and started before him and will go on long after him. To take it out on our military for a political stand is wrong and to then turn around and acknowledge them for a political stand is insulting. Keep the military out of politics and let them do their job and give them the means to do the job. He talks about people that have not always acknowledged what our military has done for this country and treated them wrong and I would have to say that the majority of that behaior has always come from his party of radical liberals. Not that the Reps don't have radical people, but typically they don't take it out on the military. Oh well, I guess now that Obama is in office and had access to what is really going on he can see just home important or military is and how much he needs them. If nothing else, he can bring light to that. You know, the more and more Obama is in office he sounds and acts like Bush. heheh", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 09:03:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "usa_girl"
    }, 
    {
        "content": "Good job, White House. You didn't load his teleprompter incompetently. (It's not what he says that counts; it's what he doesn't say.)", 
        "intTime": 20090523, 
        "postID": 12, 
        "quote": "", 
        "reply": "Good job, White House. You didn't load his teleprompter incompetently. (It's not what he says that counts; it's what he doesn't say.)", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 09:06:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Not to take away the speech or him honoring the military, but where was all this love from him and the congress when Bush needed more money for our troops? He acts like only his war is a just war. It is the same darn war with the same darn people and started before him and will go on long after him. To take it out on our military for a political stand is wrong and to then turn around and acknowledge them for a political stand is insulting. Keep the military out of politics and let them do their job and give them the means to do the job. He talks about people that have not always acknowledged what our military has done for this country and treated them wrong and I would have to say that the majority of that behaior has always come from his party of radical liberals. Not that the Reps don't have radical people, but typically they don't take it out on the military. Oh well, I guess now that Obama is in office and had access to what is really going on he can see just home important or military is and how much he needs them. If nothing else, he can bring light to that. You know, the more and more Obama is in office he sounds and acts like Bush. heheh Congress granted Mr. Bush every military budget, and \"extra\" appropriation that he asked for. Congress raised military and VA benefits over the objections of the Republicans (as a group). Such being the case, what are you talking about? And no offense, but if you have actually read the speeches of President Bush to military audiences, Obamas speech is almost non-political in comparison. Dave", 
        "intTime": 20090523, 
        "postID": 13, 
        "quote": "Originally posted by usa_girl: Not to take away the speech or him honoring the military, but where was all this love from him and the congress when Bush needed more money for our troops? He acts like only his war is a just war. It is the same darn war with the same darn people and started before him and will go on long after him. To take it out on our military for a political stand is wrong and to then turn around and acknowledge them for a political stand is insulting. Keep the military out of politics and let them do their job and give them the means to do the job. He talks about people that have not always acknowledged what our military has done for this country and treated them wrong and I would have to say that the majority of that behaior has always come from his party of radical liberals. Not that the Reps don't have radical people, but typically they don't take it out on the military. Oh well, I guess now that Obama is in office and had access to what is really going on he can see just home important or military is and how much he needs them. If nothing else, he can bring light to that. You know, the more and more Obama is in office he sounds and acts like Bush. heheh", 
        "reply": " Congress granted Mr. Bush every military budget, and \"extra\" appropriation that he asked for. Congress raised military and VA benefits over the objections of the Republicans (as a group). Such being the case, what are you talking about? And no offense, but if you have actually read the speeches of President Bush to military audiences, Obamas speech is almost non-political in comparison. Dave", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 09:15:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "Grachus"
    }, 
    {
        "content": "No offense taken, I am allowed to have my opinion even if it is not to your liking. I did not know congress actually came through with \"every\" amount asked for from Bush, but I am happy to know you say they ended up giving it to him and then some. I actually do remember seeing the floor meetings with the two parties going at it over Iraq and wanting to bring our men and women home. I am sure you will correct me if I get it wrong..but it was more the Democratic party that had decided we never should have been at war with Iraq, then went on to call war crimes, to suggest Bush be removed from office, and finally to cut off his money as a way to get him to end that war, yes? And it was more the Republican party that said, we went into Iraq based on intel from our country and others after being attacked on 9/11, we did not find what we were looking for but took Saddam out anyway who was an evil man, used Iraq as a base thinking Iran would be the big issue and we would have our people both in Afganistan and Irag to cover both sides of Iran, tried to bring freedom to the Iraq people, that ended up being harder than thought but because we did not cut and run when the liberals applied pressure at leeast the vote was a success, but at great cost to America, yes or no? When they were trying to force Bush in to ending the war on their time table wasn't it that that it was suggested that they would cut off his funds as a way to making him end the war? You don't remember seeing any of that? You never heard about that plan? I do. It would have been about the same time the media kept doing all the reports on how our men did not have the proper items needed to keep them safe. I think the tanks were a big issue, yes? Was that called a hummer or humd? I don't remember exactly but I do remember watching that covered over and over because I was so upset that the military did not have what they needed to keep them safe. Oh yes, and something about a net you keep in the room while sleeping to protect against a bomb? I am sure I don't have it all exactly right, but that is why I am here to learn.", 
        "intTime": 20090523, 
        "postID": 14, 
        "quote": "", 
        "reply": "No offense taken, I am allowed to have my opinion even if it is not to your liking. I did not know congress actually came through with \"every\" amount asked for from Bush, but I am happy to know you say they ended up giving it to him and then some. I actually do remember seeing the floor meetings with the two parties going at it over Iraq and wanting to bring our men and women home. I am sure you will correct me if I get it wrong..but it was more the Democratic party that had decided we never should have been at war with Iraq, then went on to call war crimes, to suggest Bush be removed from office, and finally to cut off his money as a way to get him to end that war, yes? And it was more the Republican party that said, we went into Iraq based on intel from our country and others after being attacked on 9/11, we did not find what we were looking for but took Saddam out anyway who was an evil man, used Iraq as a base thinking Iran would be the big issue and we would have our people both in Afganistan and Irag to cover both sides of Iran, tried to bring freedom to the Iraq people, that ended up being harder than thought but because we did not cut and run when the liberals applied pressure at leeast the vote was a success, but at great cost to America, yes or no? When they were trying to force Bush in to ending the war on their time table wasn't it that that it was suggested that they would cut off his funds as a way to making him end the war? You don't remember seeing any of that? You never heard about that plan? I do. It would have been about the same time the media kept doing all the reports on how our men did not have the proper items needed to keep them safe. I think the tanks were a big issue, yes? Was that called a hummer or humd? I don't remember exactly but I do remember watching that covered over and over because I was so upset that the military did not have what they needed to keep them safe. Oh yes, and something about a net you keep in the room while sleeping to protect against a bomb? I am sure I don't have it all exactly right, but that is why I am here to learn.", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 09:38:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: No offense taken, I am allowed to have my opinion even if it is not to your liking. I did not know congress actually came through with \"every\" amount asked for from Bush, but I am happy to know you say they ended up giving it to him and then some. I actually do remember seeing the floor meetings with the two parties going at it over Iraq and wanting to bring our men and women home. Your memory IMO is so far correct. quote: Originally posted by usa_girl: I am sure you will correct me if I get it wrong..but it was more the Democratic party that had decided we never should have been at war with Iraq, then went on to call war crimes, to suggest Bush be removed from office, and finally to cut off his money as a way to get him to end that war, yes? Some Democrats suggested all of the above. Most Democrats suggested one or another of these acts. No one ever cut off any money. Impeachment (And I regret this) was never seriously on the table - Cutting off funds, even less so. Keep in mind that I can probably find a Republican advocating eating Muslims as a way to solve the World food problems (Perhaps I exagerate here... ) doesn't mean that this represents Republican thinking as a Party. quote: Originally posted by usa_girl: And it was more the Republican party that said, we went into Iraq based on intel from our country and others after being attacked on 9/11, we did not find what we were looking for but took Saddam out anyway who was an evil man, used Iraq as a base thinking Iran would be the big issue and we would have our people both in Afganistan and Irag to cover both sides of Iran, tried to bring freedom to the Iraq people, that ended up being harder than thought but because we did not cut and run when the liberals applied pressure at leeast the vote was a success, but at great cost to America, yes or no? President Bush wanted to invade Iraq long before he was even elected. 9/11 was the excuse. Did he believe Sadaam was an evil man? Sure he did. But there are a lot of evil men in this world. Did he believe that Iraq was an immenent threat to the United States? I doubt that. In fact, HE doubts that. Do I believe that Iraq was part of the WOT? Not a chance. Do I think that taking over Iraq lessened the power of Al Qaeda? I believed it prolonged Al Qaedas life. I believe it strenthed them in every possible way. And I also believe that we have created a new ally for Iran, and although Iran is not a part of the WOT, it does represent a long term threat to us, and we have helped them immensely without it costing them a dime. quote: Originally posted by usa_girl: When they were trying to force Bush in to ending the war on their time table wasn't it that that it was suggested that they would cut off his funds as a way to making him end the war? Some Democrats suggested that. Unfortunately they never came close to having enough votes to do this. quote: Originally posted by usa_girl: You don't remember seeing any of that? You never heard about that plan? I do. It would have been about the same time the media kept doing all the reports on how our men did not have the proper items needed to keep them safe. I think the tanks were a big issue, yes? \"You go to war with the army you have, not the army you want.\" Donald Rumsfeld quote: Originally posted by usa_girl: Was that called a hummer or humd? I don't remember exactly but I do remember watching that covered over and over because I was so upset that the military did not have what they needed to keep them safe. Oh yes, and something about a net you keep in the room while sleeping to protect against a bomb? I am sure I don't have it all exactly right, but that is why I am here to learn. When the US went to war in 1941, factories worked around the clock. I mean this literally. In THIS war, factories worked nine to five. No additional companies were hired. No overtime was suggested. It took more than four years for our troops to get the equipment that the military said we needed. Looked at objectively, this is unbelievable. The military in the form of the head of the Joint Chiefs, said point blank that we needed at least 200,000, better, 500,000 men to safely pacify the country and prevent an insurgency. For his trouble he was forced into retirement. I was against the war from the beginning, but if you're GOING to actually fight a war, don't do it on the cheap. Penny wise and dollar foolish is why we are still there. To my mind it's all academic. Here's a short Editorial from the US Army's own \"Strategic Studies Institute.\" Mind you, not something I grabbed from Moveon dot org... quote: IN DEFENSE OF RATIONAL RISK ASSESSMENT Lieutenant Colonel Nathan Freier Strategic Studies Institute Risk in Webster’s is “the possibility of suffering harm or loss.”1 Risk accompanies both action and inaction. To strategists, it is accounted for and mitigated, but not always or even commonly avoided. To the national security strategist, risk—to paraphrase the current defense strategy—is the likelihood of failure or prohibitive cost in pursuit of key objectives. In this view, some goals are beyond reach. Others are within reach, but the cost of achieving them puts more important ambitions in some jeopardy.2 Unfortunately, those familiar with contemporary strategic-level military decisionmaking know that rational consideration of even the prospect of failure is absent. In high-level policy discussions, success is assumed. From the beginning, Iraq was an experiment in risk taking. To be sure, the war’s advocates saw it as risk mitigation as well—remember ‘smoking guns’ and ‘mushroom clouds,’ for example. However, at its core, toppling Saddam was about balancing the certainty of violent dislocation that accompanies overthrow of an unfavorable but stable status quo against the hope for a more favorable, future post-war political order. It was extension of “the democratic peace” by force—whether or not the forcible export of representative governance was ever a formal casus belli. In this context, Iraq engendered enormous risk from the beginning. There was the ever-present ‘likelihood of failure or prohibitive cost’ that needed to be accounted for in deliberate planning. For example, there were obvious dormant sectarian divisions. Given Saddam’s violent separation of ruler from ruled, this indicated the distinct possibility of uncontrolled civil conflict in the aftermath of the government’s collapse. There was the extant Iraqi overdependence on primary resource exports for government revenues. This, in the developing world (which Iraq rejoined from below in 2003), commonly signals persistent danger to political order. There was a certainty that at least two of Iraq’s neighbors would actively resist through politics, influence, and at times, violence—American success. Still others would be very sympathetic to Iraq’s minority Sunni; if not quite hostile to Shi’a or Kurdish triumph. Others still—likely most—would remain reticent on the issue of Iraq’s democratic success or failure. Finally, there was the precedent of the Soviet Afghan War. In Afghanistan (circa 1979-89), external intervention was a magnet for Muslim anti-colonial resistance. Tribalism, nationalism, and Muslim extremism combined to militate against Soviet success. These same forces join today with internecine sectarianism to similarly check American progress in Iraq. Rational risk assessment in advance of the Iraq intervention would have identified and accounted for all of these. Each, after all—individually or in combination, could be enough to seriously delay favorable outcomes, prevent success, or drive strategic costs to prohibitive levels. Evaluating each seriously, thoughtfully considering their implications, and accounting for them deliberately in strategy development is a sign of wisdom, not fear. Instead, those engineering the Iraq War framed strategic risk incorrectly. They assumed ultimate success—a stable, representative, multifaith polity—would rapidly and naturally occur as a result of the necessary but decidedly intermediate step of overthrowing the existing regime. Thus, in their view, the likelihood for some near-term “harm or loss” was insignificant compared to the anticipated return on the nation’s strategic investment. Their risk calculations simply never went beyond D-Day. It is now well-documented that Iraq policy was made in a strategic vacuum. It appears no vizier-like or mandarin-like class on the inside carefully weighed specific grand strategic options vis-à-vis the United States, Iraq, and the world in detail, calculating different choices and their inherent risks and benefits. There were prescient warnings. It is now clear few were heeded. In short, the risk problem, as it was likely presented to the President, was a strawman. It failed to account comprehensively for the real hazards engendered in deliberate regime destruction, stabilization, and reconstruction in a large, consequential state. Iraq proceeded from risk assessment that in its sophistication went little beyond “nothing ventured nothing gained.” This is a caution for the future. Risk-informed strategy does not indicate risk aversion. Identifying risks and hazards and accounting for their mitigation does not prevent action. Rather, it underwrites success. The bold too often mistake thoughtful consideration of real hazard for weakness. Quite the contrary, deliberate consideration of risk-adjusted choices increases the prospect for bold action’s ultimate success. Riskinformed strategy provides decisionmakers with a realistic accounting of strategic conditions as they are, versus as some would prefer them to be. It proceeds from the conclusion that raw capacity and desire alone do not determine success. It recognizes that our perceptions of our motives and intentions are likely quite different from the perceptions of others. Finally, it demands that strategists account for both the prospect of failure and the progressive accumulation of excessive cost that—without mitigation—might jeopardize long-term success and the security of interests of equal or greater importance. ENDNOTES 1. Riverside, Webster’s II: New College Dictionary, Boston-New York: Houghton Mifflin Company, p. 957. 2. Department of Defense, The National Defense Strategy of the United States, March 18, 2005, p. 11, available at \"www.defenselink.mil/news/Mar2005/d20050318nds1.pdf\" ***** Dave", 
        "intTime": 20090523, 
        "postID": 15, 
        "quote": "Originally posted by usa_girl: No offense taken, I am allowed to have my opinion even if it is not to your liking. I did not know congress actually came through with \"every\" amount asked for from Bush, but I am happy to know you say they ended up giving it to him and then some. I actually do remember seeing the floor meetings with the two parties going at it over Iraq and wanting to bring our men and women home.", 
        "reply": " Your memory IMO is so far correct. quote: Originally posted by usa_girl: I am sure you will correct me if I get it wrong..but it was more the Democratic party that had decided we never should have been at war with Iraq, then went on to call war crimes, to suggest Bush be removed from office, and finally to cut off his money as a way to get him to end that war, yes? Some Democrats suggested all of the above. Most Democrats suggested one or another of these acts. No one ever cut off any money. Impeachment (And I regret this) was never seriously on the table - Cutting off funds, even less so. Keep in mind that I can probably find a Republican advocating eating Muslims as a way to solve the World food problems (Perhaps I exagerate here... ) doesn't mean that this represents Republican thinking as a Party. quote: Originally posted by usa_girl: And it was more the Republican party that said, we went into Iraq based on intel from our country and others after being attacked on 9/11, we did not find what we were looking for but took Saddam out anyway who was an evil man, used Iraq as a base thinking Iran would be the big issue and we would have our people both in Afganistan and Irag to cover both sides of Iran, tried to bring freedom to the Iraq people, that ended up being harder than thought but because we did not cut and run when the liberals applied pressure at leeast the vote was a success, but at great cost to America, yes or no? President Bush wanted to invade Iraq long before he was even elected. 9/11 was the excuse. Did he believe Sadaam was an evil man? Sure he did. But there are a lot of evil men in this world. Did he believe that Iraq was an immenent threat to the United States? I doubt that. In fact, HE doubts that. Do I believe that Iraq was part of the WOT? Not a chance. Do I think that taking over Iraq lessened the power of Al Qaeda? I believed it prolonged Al Qaedas life. I believe it strenthed them in every possible way. And I also believe that we have created a new ally for Iran, and although Iran is not a part of the WOT, it does represent a long term threat to us, and we have helped them immensely without it costing them a dime. quote: Originally posted by usa_girl: When they were trying to force Bush in to ending the war on their time table wasn't it that that it was suggested that they would cut off his funds as a way to making him end the war? Some Democrats suggested that. Unfortunately they never came close to having enough votes to do this. quote: Originally posted by usa_girl: You don't remember seeing any of that? You never heard about that plan? I do. It would have been about the same time the media kept doing all the reports on how our men did not have the proper items needed to keep them safe. I think the tanks were a big issue, yes? \"You go to war with the army you have, not the army you want.\" Donald Rumsfeld quote: Originally posted by usa_girl: Was that called a hummer or humd? I don't remember exactly but I do remember watching that covered over and over because I was so upset that the military did not have what they needed to keep them safe. Oh yes, and something about a net you keep in the room while sleeping to protect against a bomb? I am sure I don't have it all exactly right, but that is why I am here to learn. When the US went to war in 1941, factories worked around the clock. I mean this literally. In THIS war, factories worked nine to five. No additional companies were hired. No overtime was suggested. It took more than four years for our troops to get the equipment that the military said we needed. Looked at objectively, this is unbelievable. The military in the form of the head of the Joint Chiefs, said point blank that we needed at least 200,000, better, 500,000 men to safely pacify the country and prevent an insurgency. For his trouble he was forced into retirement. I was against the war from the beginning, but if you're GOING to actually fight a war, don't do it on the cheap. Penny wise and dollar foolish is why we are still there. To my mind it's all academic. Here's a short Editorial from the US Army's own \"Strategic Studies Institute.\" Mind you, not something I grabbed from Moveon dot org... quote: IN DEFENSE OF RATIONAL RISK ASSESSMENT Lieutenant Colonel Nathan Freier Strategic Studies Institute Risk in Webster’s is “the possibility of suffering harm or loss.”1 Risk accompanies both action and inaction. To strategists, it is accounted for and mitigated, but not always or even commonly avoided. To the national security strategist, risk—to paraphrase the current defense strategy—is the likelihood of failure or prohibitive cost in pursuit of key objectives. In this view, some goals are beyond reach. Others are within reach, but the cost of achieving them puts more important ambitions in some jeopardy.2 Unfortunately, those familiar with contemporary strategic-level military decisionmaking know that rational consideration of even the prospect of failure is absent. In high-level policy discussions, success is assumed. From the beginning, Iraq was an experiment in risk taking. To be sure, the war’s advocates saw it as risk mitigation as well—remember ‘smoking guns’ and ‘mushroom clouds,’ for example. However, at its core, toppling Saddam was about balancing the certainty of violent dislocation that accompanies overthrow of an unfavorable but stable status quo against the hope for a more favorable, future post-war political order. It was extension of “the democratic peace” by force—whether or not the forcible export of representative governance was ever a formal casus belli. In this context, Iraq engendered enormous risk from the beginning. There was the ever-present ‘likelihood of failure or prohibitive cost’ that needed to be accounted for in deliberate planning. For example, there were obvious dormant sectarian divisions. Given Saddam’s violent separation of ruler from ruled, this indicated the distinct possibility of uncontrolled civil conflict in the aftermath of the government’s collapse. There was the extant Iraqi overdependence on primary resource exports for government revenues. This, in the developing world (which Iraq rejoined from below in 2003), commonly signals persistent danger to political order. There was a certainty that at least two of Iraq’s neighbors would actively resist through politics, influence, and at times, violence—American success. Still others would be very sympathetic to Iraq’s minority Sunni; if not quite hostile to Shi’a or Kurdish triumph. Others still—likely most—would remain reticent on the issue of Iraq’s democratic success or failure. Finally, there was the precedent of the Soviet Afghan War. In Afghanistan (circa 1979-89), external intervention was a magnet for Muslim anti-colonial resistance. Tribalism, nationalism, and Muslim extremism combined to militate against Soviet success. These same forces join today with internecine sectarianism to similarly check American progress in Iraq. Rational risk assessment in advance of the Iraq intervention would have identified and accounted for all of these. Each, after all—individually or in combination, could be enough to seriously delay favorable outcomes, prevent success, or drive strategic costs to prohibitive levels. Evaluating each seriously, thoughtfully considering their implications, and accounting for them deliberately in strategy development is a sign of wisdom, not fear. Instead, those engineering the Iraq War framed strategic risk incorrectly. They assumed ultimate success—a stable, representative, multifaith polity—would rapidly and naturally occur as a result of the necessary but decidedly intermediate step of overthrowing the existing regime. Thus, in their view, the likelihood for some near-term “harm or loss” was insignificant compared to the anticipated return on the nation’s strategic investment. Their risk calculations simply never went beyond D-Day. It is now well-documented that Iraq policy was made in a strategic vacuum. It appears no vizier-like or mandarin-like class on the inside carefully weighed specific grand strategic options vis-à-vis the United States, Iraq, and the world in detail, calculating different choices and their inherent risks and benefits. There were prescient warnings. It is now clear few were heeded. In short, the risk problem, as it was likely presented to the President, was a strawman. It failed to account comprehensively for the real hazards engendered in deliberate regime destruction, stabilization, and reconstruction in a large, consequential state. Iraq proceeded from risk assessment that in its sophistication went little beyond “nothing ventured nothing gained.” This is a caution for the future. Risk-informed strategy does not indicate risk aversion. Identifying risks and hazards and accounting for their mitigation does not prevent action. Rather, it underwrites success. The bold too often mistake thoughtful consideration of real hazard for weakness. Quite the contrary, deliberate consideration of risk-adjusted choices increases the prospect for bold action’s ultimate success. Riskinformed strategy provides decisionmakers with a realistic accounting of strategic conditions as they are, versus as some would prefer them to be. It proceeds from the conclusion that raw capacity and desire alone do not determine success. It recognizes that our perceptions of our motives and intentions are likely quite different from the perceptions of others. Finally, it demands that strategists account for both the prospect of failure and the progressive accumulation of excessive cost that—without mitigation—might jeopardize long-term success and the security of interests of equal or greater importance. ENDNOTES 1. Riverside, Webster’s II: New College Dictionary, Boston-New York: Houghton Mifflin Company, p. 957. 2. Department of Defense, The National Defense Strategy of the United States, March 18, 2005, p. 11, available at \"www.defenselink.mil/news/Mar2005/d20050318nds1.pdf\" ***** Dave", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 10:07:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by usa_girl: No offense taken, I am allowed to have my opinion even if it is not to your liking. I did not know congress actually came through with \"every\" amount asked for from Bush, but I am happy to know you say they ended up giving it to him and then some. I actually do remember seeing the floor meetings with the two parties going at it over Iraq and wanting to bring our men and women home. Your memory IMO is so far correct. quote: Originally posted by usa_girl: I am sure you will correct me if I get it wrong..but it was more the Democratic party that had decided we never should have been at war with Iraq, then went on to call war crimes, to suggest Bush be removed from office, and finally to cut off his money as a way to get him to end that war, yes? Some Democrats suggested all of the above. Most Democrats suggested one or another of these acts. No one ever cut off any money. Impeachment (And I regret this) was never seriously on the table - Cutting off funds, even less so. Keep in mind that I can probably find a Republican advocating eating Muslims as a way to solve the World food problems (Perhaps I exagerate here... ) doesn't mean that this represents Republican thinking as a Party. quote: Originally posted by usa_girl: And it was more the Republican party that said, we went into Iraq based on intel from our country and others after being attacked on 9/11, we did not find what we were looking for but took Saddam out anyway who was an evil man, used Iraq as a base thinking Iran would be the big issue and we would have our people both in Afganistan and Irag to cover both sides of Iran, tried to bring freedom to the Iraq people, that ended up being harder than thought but because we did not cut and run when the liberals applied pressure at leeast the vote was a success, but at great cost to America, yes or no? President Bush wanted to invade Iraq long before he was even elected. 9/11 was the excuse. Did he believe Sadaam was an evil man? Sure he did. But there are a lot of evil men in this world. Did he believe that Iraq was an immenent threat to the United States? I doubt that. In fact, HE doubts that. Do I believe that Iraq was part of the WOT? Not a chance. Do I think that taking over Iraq lessened the power of Al Qaeda? I believed it prolonged Al Qaedas life. I believe it strenthed them in every possible way. And I also believe that we have created a new ally for Iran, and although Iran is not a part of the WOT, it does represent a long term threat to us, and we have helped them immensely without it costing them a dime. quote: Originally posted by usa_girl: When they were trying to force Bush in to ending the war on their time table wasn't it that that it was suggested that they would cut off his funds as a way to making him end the war? Some Democrats suggested that. Unfortunately they never came close to having enough votes to do this. quote: Originally posted by usa_girl: You don't remember seeing any of that? You never heard about that plan? I do. It would have been about the same time the media kept doing all the reports on how our men did not have the proper items needed to keep them safe. I think the tanks were a big issue, yes? \"You go to war with the army you have, not the army you want.\" Donald Rumsfeld quote: Originally posted by usa_girl: Was that called a hummer or humd? I don't remember exactly but I do remember watching that covered over and over because I was so upset that the military did not have what they needed to keep them safe. Oh yes, and something about a net you keep in the room while sleeping to protect against a bomb? I am sure I don't have it all exactly right, but that is why I am here to learn. When the US went to war in 1941, factories worked around the clock. I mean this literally. In THIS war, factories worked nine to five. No additional companies were hired. No overtime was suggested. It took more than four years for our troops to get the equipment that the military said we needed. Looked at objectively, this is unbelievable. The military in the form of the head of the Joint Chiefs, said point blank that we needed at least 200,000, better, 500,000 men to safely pacify the country and prevent an insurgency. For his trouble he was forced into retirement. I was against the war from the beginning, but if you're GOING to actually fight a war, don't do it on the cheap. Penny wise and dollar foolish is why we are still there. To my mind it's all academic. Here's a short Editorial from the US Army's own \"Strategic Studies Institute.\" Mind you, not something I grabbed from Moveon dot org... quote: IN DEFENSE OF RATIONAL RISK ASSESSMENT Lieutenant Colonel Nathan Freier Strategic Studies Institute Risk in Webster’s is “the possibility of suffering harm or loss.”1 Risk accompanies both action and inaction. To strategists, it is accounted for and mitigated, but not always or even commonly avoided. To the national security strategist, risk—to paraphrase the current defense strategy—is the likelihood of failure or prohibitive cost in pursuit of key objectives. In this view, some goals are beyond reach. Others are within reach, but the cost of achieving them puts more important ambitions in some jeopardy.2 Unfortunately, those familiar with contemporary strategic-level military decisionmaking know that rational consideration of even the prospect of failure is absent. In high-level policy discussions, success is assumed. From the beginning, Iraq was an experiment in risk taking. To be sure, the war’s advocates saw it as risk mitigation as well—remember ‘smoking guns’ and ‘mushroom clouds,’ for example. However, at its core, toppling Saddam was about balancing the certainty of violent dislocation that accompanies overthrow of an unfavorable but stable status quo against the hope for a more favorable, future post-war political order. It was extension of “the democratic peace” by force—whether or not the forcible export of representative governance was ever a formal casus belli. In this context, Iraq engendered enormous risk from the beginning. There was the ever-present ‘likelihood of failure or prohibitive cost’ that needed to be accounted for in deliberate planning. For example, there were obvious dormant sectarian divisions. Given Saddam’s violent separation of ruler from ruled, this indicated the distinct possibility of uncontrolled civil conflict in the aftermath of the government’s collapse. There was the extant Iraqi overdependence on primary resource exports for government revenues. This, in the developing world (which Iraq rejoined from below in 2003), commonly signals persistent danger to political order. There was a certainty that at least two of Iraq’s neighbors would actively resist through politics, influence, and at times, violence—American success. Still others would be very sympathetic to Iraq’s minority Sunni; if not quite hostile to Shi’a or Kurdish triumph. Others still—likely most—would remain reticent on the issue of Iraq’s democratic success or failure. Finally, there was the precedent of the Soviet Afghan War. In Afghanistan (circa 1979-89), external intervention was a magnet for Muslim anti-colonial resistance. Tribalism, nationalism, and Muslim extremism combined to militate against Soviet success. These same forces join today with internecine sectarianism to similarly check American progress in Iraq. Rational risk assessment in advance of the Iraq intervention would have identified and accounted for all of these. Each, after all—individually or in combination, could be enough to seriously delay favorable outcomes, prevent success, or drive strategic costs to prohibitive levels. Evaluating each seriously, thoughtfully considering their implications, and accounting for them deliberately in strategy development is a sign of wisdom, not fear. Instead, those engineering the Iraq War framed strategic risk incorrectly. They assumed ultimate success—a stable, representative, multifaith polity—would rapidly and naturally occur as a result of the necessary but decidedly intermediate step of overthrowing the existing regime. Thus, in their view, the likelihood for some near-term “harm or loss” was insignificant compared to the anticipated return on the nation’s strategic investment. Their risk calculations simply never went beyond D-Day. It is now well-documented that Iraq policy was made in a strategic vacuum. It appears no vizier-like or mandarin-like class on the inside carefully weighed specific grand strategic options vis-à-vis the United States, Iraq, and the world in detail, calculating different choices and their inherent risks and benefits. There were prescient warnings. It is now clear few were heeded. In short, the risk problem, as it was likely presented to the President, was a strawman. It failed to account comprehensively for the real hazards engendered in deliberate regime destruction, stabilization, and reconstruction in a large, consequential state. Iraq proceeded from risk assessment that in its sophistication went little beyond “nothing ventured nothing gained.” This is a caution for the future. Risk-informed strategy does not indicate risk aversion. Identifying risks and hazards and accounting for their mitigation does not prevent action. Rather, it underwrites success. The bold too often mistake thoughtful consideration of real hazard for weakness. Quite the contrary, deliberate consideration of risk-adjusted choices increases the prospect for bold action’s ultimate success. Riskinformed strategy provides decisionmakers with a realistic accounting of strategic conditions as they are, versus as some would prefer them to be. It proceeds from the conclusion that raw capacity and desire alone do not determine success. It recognizes that our perceptions of our motives and intentions are likely quite different from the perceptions of others. Finally, it demands that strategists account for both the prospect of failure and the progressive accumulation of excessive cost that—without mitigation—might jeopardize long-term success and the security of interests of equal or greater importance. ENDNOTES 1. Riverside, Webster’s II: New College Dictionary, Boston-New York: Houghton Mifflin Company, p. 957. 2. Department of Defense, The National Defense Strategy of the United States, March 18, 2005, p. 11, available at \"www.defenselink.mil/news/Mar2005/d20050318nds1.pdf\" ***** Dave LOL@moveon.org so, you do have a sense of humor? Seriously, that Strategic Studies Institue assessment was pretty intense. I think it was a combination of legal jargon and highly analytical theory, yes? Anyway, thanks for sharing, it is always good to have as much information as possible to help form an opinion, right? PS..I never did care for Rumsfeld, I put him right up there with Polsi. I could do without them.", 
        "intTime": 20090523, 
        "postID": 16, 
        "quote": "Originally posted by Grachus: quote: Originally posted by usa_girl: No offense taken, I am allowed to have my opinion even if it is not to your liking. I did not know congress actually came through with \"every\" amount asked for from Bush, but I am happy to know you say they ended up giving it to him and then some. I actually do remember seeing the floor meetings with the two parties going at it over Iraq and wanting to bring our men and women home. Your memory IMO is so far correct. quote: Originally posted by usa_girl: I am sure you will correct me if I get it wrong..but it was more the Democratic party that had decided we never should have been at war with Iraq, then went on to call war crimes, to suggest Bush be removed from office, and finally to cut off his money as a way to get him to end that war, yes? Some Democrats suggested all of the above. Most Democrats suggested one or another of these acts. No one ever cut off any money. Impeachment (And I regret this) was never seriously on the table - Cutting off funds, even less so. Keep in mind that I can probably find a Republican advocating eating Muslims as a way to solve the World food problems (Perhaps I exagerate here... ) doesn't mean that this represents Republican thinking as a Party. quote: Originally posted by usa_girl: And it was more the Republican party that said, we went into Iraq based on intel from our country and others after being attacked on 9/11, we did not find what we were looking for but took Saddam out anyway who was an evil man, used Iraq as a base thinking Iran would be the big issue and we would have our people both in Afganistan and Irag to cover both sides of Iran, tried to bring freedom to the Iraq people, that ended up being harder than thought but because we did not cut and run when the liberals applied pressure at leeast the vote was a success, but at great cost to America, yes or no? President Bush wanted to invade Iraq long before he was even elected. 9/11 was the excuse. Did he believe Sadaam was an evil man? Sure he did. But there are a lot of evil men in this world. Did he believe that Iraq was an immenent threat to the United States? I doubt that. In fact, HE doubts that. Do I believe that Iraq was part of the WOT? Not a chance. Do I think that taking over Iraq lessened the power of Al Qaeda? I believed it prolonged Al Qaedas life. I believe it strenthed them in every possible way. And I also believe that we have created a new ally for Iran, and although Iran is not a part of the WOT, it does represent a long term threat to us, and we have helped them immensely without it costing them a dime. quote: Originally posted by usa_girl: When they were trying to force Bush in to ending the war on their time table wasn't it that that it was suggested that they would cut off his funds as a way to making him end the war? Some Democrats suggested that. Unfortunately they never came close to having enough votes to do this. quote: Originally posted by usa_girl: You don't remember seeing any of that? You never heard about that plan? I do. It would have been about the same time the media kept doing all the reports on how our men did not have the proper items needed to keep them safe. I think the tanks were a big issue, yes? \"You go to war with the army you have, not the army you want.\" Donald Rumsfeld quote: Originally posted by usa_girl: Was that called a hummer or humd? I don't remember exactly but I do remember watching that covered over and over because I was so upset that the military did not have what they needed to keep them safe. Oh yes, and something about a net you keep in the room while sleeping to protect against a bomb? I am sure I don't have it all exactly right, but that is why I am here to learn. When the US went to war in 1941, factories worked around the clock. I mean this literally. In THIS war, factories worked nine to five. No additional companies were hired. No overtime was suggested. It took more than four years for our troops to get the equipment that the military said we needed. Looked at objectively, this is unbelievable. The military in the form of the head of the Joint Chiefs, said point blank that we needed at least 200,000, better, 500,000 men to safely pacify the country and prevent an insurgency. For his trouble he was forced into retirement. I was against the war from the beginning, but if you're GOING to actually fight a war, don't do it on the cheap. Penny wise and dollar foolish is why we are still there. To my mind it's all academic. Here's a short Editorial from the US Army's own \"Strategic Studies Institute.\" Mind you, not something I grabbed from Moveon dot org... quote: IN DEFENSE OF RATIONAL RISK ASSESSMENT Lieutenant Colonel Nathan Freier Strategic Studies Institute Risk in Webster’s is “the possibility of suffering harm or loss.”1 Risk accompanies both action and inaction. To strategists, it is accounted for and mitigated, but not always or even commonly avoided. To the national security strategist, risk—to paraphrase the current defense strategy—is the likelihood of failure or prohibitive cost in pursuit of key objectives. In this view, some goals are beyond reach. Others are within reach, but the cost of achieving them puts more important ambitions in some jeopardy.2 Unfortunately, those familiar with contemporary strategic-level military decisionmaking know that rational consideration of even the prospect of failure is absent. In high-level policy discussions, success is assumed. From the beginning, Iraq was an experiment in risk taking. To be sure, the war’s advocates saw it as risk mitigation as well—remember ‘smoking guns’ and ‘mushroom clouds,’ for example. However, at its core, toppling Saddam was about balancing the certainty of violent dislocation that accompanies overthrow of an unfavorable but stable status quo against the hope for a more favorable, future post-war political order. It was extension of “the democratic peace” by force—whether or not the forcible export of representative governance was ever a formal casus belli. In this context, Iraq engendered enormous risk from the beginning. There was the ever-present ‘likelihood of failure or prohibitive cost’ that needed to be accounted for in deliberate planning. For example, there were obvious dormant sectarian divisions. Given Saddam’s violent separation of ruler from ruled, this indicated the distinct possibility of uncontrolled civil conflict in the aftermath of the government’s collapse. There was the extant Iraqi overdependence on primary resource exports for government revenues. This, in the developing world (which Iraq rejoined from below in 2003), commonly signals persistent danger to political order. There was a certainty that at least two of Iraq’s neighbors would actively resist through politics, influence, and at times, violence—American success. Still others would be very sympathetic to Iraq’s minority Sunni; if not quite hostile to Shi’a or Kurdish triumph. Others still—likely most—would remain reticent on the issue of Iraq’s democratic success or failure. Finally, there was the precedent of the Soviet Afghan War. In Afghanistan (circa 1979-89), external intervention was a magnet for Muslim anti-colonial resistance. Tribalism, nationalism, and Muslim extremism combined to militate against Soviet success. These same forces join today with internecine sectarianism to similarly check American progress in Iraq. Rational risk assessment in advance of the Iraq intervention would have identified and accounted for all of these. Each, after all—individually or in combination, could be enough to seriously delay favorable outcomes, prevent success, or drive strategic costs to prohibitive levels. Evaluating each seriously, thoughtfully considering their implications, and accounting for them deliberately in strategy development is a sign of wisdom, not fear. Instead, those engineering the Iraq War framed strategic risk incorrectly. They assumed ultimate success—a stable, representative, multifaith polity—would rapidly and naturally occur as a result of the necessary but decidedly intermediate step of overthrowing the existing regime. Thus, in their view, the likelihood for some near-term “harm or loss” was insignificant compared to the anticipated return on the nation’s strategic investment. Their risk calculations simply never went beyond D-Day. It is now well-documented that Iraq policy was made in a strategic vacuum. It appears no vizier-like or mandarin-like class on the inside carefully weighed specific grand strategic options vis-à-vis the United States, Iraq, and the world in detail, calculating different choices and their inherent risks and benefits. There were prescient warnings. It is now clear few were heeded. In short, the risk problem, as it was likely presented to the President, was a strawman. It failed to account comprehensively for the real hazards engendered in deliberate regime destruction, stabilization, and reconstruction in a large, consequential state. Iraq proceeded from risk assessment that in its sophistication went little beyond “nothing ventured nothing gained.” This is a caution for the future. Risk-informed strategy does not indicate risk aversion. Identifying risks and hazards and accounting for their mitigation does not prevent action. Rather, it underwrites success. The bold too often mistake thoughtful consideration of real hazard for weakness. Quite the contrary, deliberate consideration of risk-adjusted choices increases the prospect for bold action’s ultimate success. Riskinformed strategy provides decisionmakers with a realistic accounting of strategic conditions as they are, versus as some would prefer them to be. It proceeds from the conclusion that raw capacity and desire alone do not determine success. It recognizes that our perceptions of our motives and intentions are likely quite different from the perceptions of others. Finally, it demands that strategists account for both the prospect of failure and the progressive accumulation of excessive cost that—without mitigation—might jeopardize long-term success and the security of interests of equal or greater importance. ENDNOTES 1. Riverside, Webster’s II: New College Dictionary, Boston-New York: Houghton Mifflin Company, p. 957. 2. Department of Defense, The National Defense Strategy of the United States, March 18, 2005, p. 11, available at \"www.defenselink.mil/news/Mar2005/d20050318nds1.pdf\" ***** Dave", 
        "reply": " LOL@moveon.org so, you do have a sense of humor? Seriously, that Strategic Studies Institue assessment was pretty intense. I think it was a combination of legal jargon and highly analytical theory, yes? Anyway, thanks for sharing, it is always good to have as much information as possible to help form an opinion, right? PS..I never did care for Rumsfeld, I put him right up there with Polsi. I could do without them.", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 11:35:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: \"You go to war with the army you have, not the army you want.\" Donald Rumsfeld Absolutely the dumbest thing ever said by anyone in the Bush administration. I love the fact that up-armored HUMVEEs showed up just weeks afterwards and MRAPs went into full scale production shortly afterwards as well. Firing him right after the 2006 elections was the coup-de-grais. One of the reasons I will always despise the Bush administration was because of the way they protected a crony like Rumsfeld. He may not have been the worst SecDef ever, but he's certainly in the top 3.", 
        "intTime": 20090523, 
        "postID": 17, 
        "quote": "Originally posted by usa_girl: \"You go to war with the army you have, not the army you want.\" Donald Rumsfeld", 
        "reply": " Absolutely the dumbest thing ever said by anyone in the Bush administration. I love the fact that up-armored HUMVEEs showed up just weeks afterwards and MRAPs went into full scale production shortly afterwards as well. Firing him right after the 2006 elections was the coup-de-grais. One of the reasons I will always despise the Bush administration was because of the way they protected a crony like Rumsfeld. He may not have been the worst SecDef ever, but he's certainly in the top 3.", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 11:43:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: LOL@moveon.org so, you do have a sense of humor? Seriously, that Strategic Studies Institue assessment was pretty intense. I think it was a combination of legal jargon and highly analytical theory, yes? Anyway, thanks for sharing, it is always good to have as much information as possible to help form an opinion, right? PS..I never did care for Rumsfeld, I put him right up there with Polsi. I could do without them. The US Army cannot afford to be a flunky for whomever is in power. They maintain the institute to provide our military leaders with objective facts so that at least military decsions are objective. Here's a link to their site. \"http://www.strategicstudiesinstitute.army.mil/\" Another interesting source of objective information is The Counter Terrorism School at West Point... \"http://www.ctc.usma.edu/default.asp\" You can find translations of actual terrorist doctrines and plans. As for me having a sense of humour? Not a chance. Any post that contains humor has been sneaked in by my so called dog. I was told you can't trust this breed, and those who told me this was right... Dave", 
        "intTime": 20090523, 
        "postID": 18, 
        "quote": "Originally posted by usa_girl: LOL@moveon.org so, you do have a sense of humor? Seriously, that Strategic Studies Institue assessment was pretty intense. I think it was a combination of legal jargon and highly analytical theory, yes? Anyway, thanks for sharing, it is always good to have as much information as possible to help form an opinion, right? PS..I never did care for Rumsfeld, I put him right up there with Polsi. I could do without them.", 
        "reply": " The US Army cannot afford to be a flunky for whomever is in power. They maintain the institute to provide our military leaders with objective facts so that at least military decsions are objective. Here's a link to their site. \"http://www.strategicstudiesinstitute.army.mil/\" Another interesting source of objective information is The Counter Terrorism School at West Point... \"http://www.ctc.usma.edu/default.asp\" You can find translations of actual terrorist doctrines and plans. As for me having a sense of humour? Not a chance. Any post that contains humor has been sneaked in by my so called dog. I was told you can't trust this breed, and those who told me this was right... Dave", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 11:53:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "Grachus"
    }, 
    {
        "content": "one more thing... with regard to evil men in the world... true saddam was not the only evil man in the world, but shouldn't the guy in charge of the country at that time get to pick his battles and evil men to weed out? Kennedy took on Fidel Castro with the Bay of Pigs Invsion. Lyndon Johnson tried to finishe what Kennedy had started in Vietnam and took on Ho Chi Minh of North Vietnam. Not sure what Carter did if anything. Reagon takes on the evil empire of russia. Bush Sr went after Saddam with the Gulf War Clinton took on Milosevic and Yugoslavia and Saddam in Iraq in Bush Jr goes after terrorist Bin Laden, Saddam and Al Queda in Afganistan and Iraq Obama is taking on the Taliban in Afganistan and has put Pakistan on warning. Bono and gang wants us to get in Africa Clooney and gang wants us in Darfur and last night I see the girl mia on Bill Maher wanting usa to get in the middle of what is going on in Sri Lanka What next????", 
        "intTime": 20090523, 
        "postID": 19, 
        "quote": "", 
        "reply": "one more thing... with regard to evil men in the world... true saddam was not the only evil man in the world, but shouldn't the guy in charge of the country at that time get to pick his battles and evil men to weed out? Kennedy took on Fidel Castro with the Bay of Pigs Invsion. Lyndon Johnson tried to finishe what Kennedy had started in Vietnam and took on Ho Chi Minh of North Vietnam. Not sure what Carter did if anything. Reagon takes on the evil empire of russia. Bush Sr went after Saddam with the Gulf War Clinton took on Milosevic and Yugoslavia and Saddam in Iraq in Bush Jr goes after terrorist Bin Laden, Saddam and Al Queda in Afganistan and Iraq Obama is taking on the Taliban in Afganistan and has put Pakistan on warning. Bono and gang wants us to get in Africa Clooney and gang wants us in Darfur and last night I see the girl mia on Bill Maher wanting usa to get in the middle of what is going on in Sri Lanka What next????", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 12:19:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: one more thing... with regard to evil men in the world... true saddam was not the only evil man in the world, but shouldn't the guy in charge of the country at that time get to pick his battles and evil men to weed out? Kennedy took on Fidel Castro with the Bay of Pigs Invsion. Lyndon Johnson tried to finishe what Kennedy had started in Vietnam and took on Ho Chi Minh of North Vietnam. Not sure what Carter did if anything. Reagon takes on the evil empire of russia. Bush Sr went after Saddam with the Gulf War Clinton took on Milosevic and Yugoslavia and Saddam in Iraq in Bush Jr goes after terrorist Bin Laden, Saddam and Al Queda in Afganistan and Iraq Obama is taking on the Taliban in Afganistan and has put Pakistan on warning. Bono and gang wants us to get in Africa Clooney and gang wants us in Darfur and last night I see the girl mia on Bill Maher wanting usa to get in the middle of what is going on in Sri Lanka What next???? In answer to your first question...NO! Our military is not here to be used as some kind of moral tool an administration can send into harms way at the whim of a CinC based on this ideology of choice! Unfortunately you are correct for the most part with your summation of recent history but that doesn't make it right. The criteria for executing military action should IMHO always be \"clear and present danger\".", 
        "intTime": 20090523, 
        "postID": 20, 
        "quote": "Originally posted by usa_girl: one more thing... with regard to evil men in the world... true saddam was not the only evil man in the world, but shouldn't the guy in charge of the country at that time get to pick his battles and evil men to weed out? Kennedy took on Fidel Castro with the Bay of Pigs Invsion. Lyndon Johnson tried to finishe what Kennedy had started in Vietnam and took on Ho Chi Minh of North Vietnam. Not sure what Carter did if anything. Reagon takes on the evil empire of russia. Bush Sr went after Saddam with the Gulf War Clinton took on Milosevic and Yugoslavia and Saddam in Iraq in Bush Jr goes after terrorist Bin Laden, Saddam and Al Queda in Afganistan and Iraq Obama is taking on the Taliban in Afganistan and has put Pakistan on warning. Bono and gang wants us to get in Africa Clooney and gang wants us in Darfur and last night I see the girl mia on Bill Maher wanting usa to get in the middle of what is going on in Sri Lanka What next????", 
        "reply": " In answer to your first question...NO! Our military is not here to be used as some kind of moral tool an administration can send into harms way at the whim of a CinC based on this ideology of choice! Unfortunately you are correct for the most part with your summation of recent history but that doesn't make it right. The criteria for executing military action should IMHO always be \"clear and present danger\".", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 12:24:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I must say, that while Obama has been a big disappointment to me in many respects, his public speeches are inspirational. One of the Great speakers of our time. Here are some of my favorite excerpts from his Commencement Address at Annapolis. I recoment reading the whole speech. He truly clarifies, what American Values are, and how the military upholds them. quote: But most of all, I’ve admired the spirit of your service. Because it’s not the strength of our arms or the power of our technology that gives the United States our military dominance. It’s our people. It’s our Sailors and Marines, Soldiers and Airmen and Coast Guardsmen who perform brilliantly in every mission we give them. ************** This class is about to become the latest link in a long, unbroken chain of heroism and victory. A chain forged in battles whose names are etched in the stone of this stadium. From Coral Sea to Midway to Guadalcanal. From Iwo Jima to Inchon. From the Mekong Delta to Desert Storm. For some among us, these are not just places on a map. They are the stories of their lives. And we honor all our veterans here today. This chain of service calls to mind words that were spoken here in Annapolis on another spring day a century ago. The crowds assembled, the bands played, and the cannons roared. And as John Paul Jones’ body was carried to the Yard, President Teddy Roosevelt spoke to the Midshipmen gathered there that day. \"Remember,\" he said, \"our words of admiration are but as sounding brass and tinkling symbols if we do not…prepare to emulate their deeds.\" Emulate their deeds. That is what you are called upon to do. And in doing so these past four years, you have not only given meaning to your own lives, you serve as a reminder—a challenge—to your fellow Americans to fulfill the true meaning of citizenship. America, look at these young men and women. Look at these Sailors and Marines. Here are the values we cherish. Here are the ideals that endure. In an era when too few citizens answer the call to service—to community or country—these Americans chose to serve. And they did so in a time of war, knowing they might be called upon to make the ultimate sacrifice. ************* In a culture where so many chase the outward markers of success that can so often lead us astray—titles and status, materialism and money, fame and popularity—these Americans have embraced the virtues that we need most right now. Self-discipline over self-interest. Work over comfort. Character over celebrity. After an era when so many institutions and individuals acted with such greed and recklessness, it is no wonder that our military remains the most trusted institution in the nation. And in a world when so many forces and voices seek to divide us, it is inspiring that this class came together and succeeded together, from every state and every corner of the world. By building an institution that is more diverse than ever—more women, more Hispanics, more African Americans—the Naval Academy has reaffirmed a fundamental American truth: that out of many, we are one. We see these values in every one of these Sailors and Marines, including those who have already served their country—the dozens among you with prior enlisted service. ************ Honor. Courage. Commitment. These are the values that have defined your years in the Yard and that you’ll need in the years ahead. As you join the fleet. As you lead Marines. As you confront the ever-changing threats of an ever-changing world. For history teaches us that the nations that grow comfortable with the old ways and complacent in the face of new threats—those nations do not long endure. And in the 21st century, we do not have the luxury of deciding which challenges to prepare for and which to ignore. We must overcome the full spectrum of threats. The conventional and the unconventional. The nation-state and the terrorist network. The spread of deadly technologies and of hateful ideologies. Eighteenth century-style piracy and 21st century cyberthreats. ***************** Marines—we need you to defeat the insurgent and the extremist. But we also need you to work with the tribal sheik and local leaders from Anbar to Kandahar who want to build a better future for their people. Naval aviators and flight officers—we need you to dominate the airspace in times of conflict, but also to deliver food and medicine in times of humanitarian crisis. And surface warfare officers and submariners—we need you to project American power across the vast oceans, but also to project American principles and values when you pull into that foreign port—because for so many people around the world, you are the face of America. ************** Yesterday I visited the National Archives and the hall that holds our Constitution, Declaration of Independence and the Bill of Rights. I went there because as our nation debates how to deal with the security challenges that we face, we must remember this enduring truth: the values and ideals in those documents are not simply words written into aging parchment, they are the bedrock of our liberty and our security. We uphold our fundamental principles and values not just because we choose to, but because we swear to. Not because they feel good, but because they help keep us safe. Because when America strays from our values, it not only undermines the rule of law, it alienates us from our allies, it energizes our adversaries and it endangers our national security and the lives of our troops. So as Americans, we reject the false chose between our security and our ideals. We can and we must and we will protect both. And that is just what you will pledge to do in a few moments when you raise your right hand and take your oath. By that simple act you will accept a life of great sacrifice. Long deployments. Separation for loved ones. Tests and trials that most Americans cannot imagine. But that is the oath you take, the life you choose, the promise you make to America. And, today, this is the promise I make to you. It’s a promise that as long as I am your Commander in Chief, I will only send you into harm’s way when it is absolutely necessary, and with the strategy, the well-defined goals, the equipment and the support you need to get the job done. This includes the job of bringing the Iraq war to a responsible end and pursuing a new comprehensive strategy to disrupt, dismantle and defeat al Qaeda and its allies in Afghanistan and Pakistan. And to get you the support you need, we’re enlisting all elements of our national power—our diplomacy and development and our economic might and our moral suasion—so that you and the rest of our military do not bear the burden of our security alone. We will also ensure you can meet the missions of today, which is why we’ve halted reductions in Navy personnel and increased the size of the Marine Corps. And we will ensure you can meet the missions of tomorrow, which is why we’re investing in the capabilities and technologies—the littoral combat ships, the most advanced submarines and fighter aircraft—so that you have what you need to succeed. In short, we will maintain America’s military dominance and keep you the finest fighting force the world has ever seen. http://www.usna.edu/PAO/", 
        "intTime": 20090522, 
        "postID": 21, 
        "quote": "But most of all, I’ve admired the spirit of your service. Because it’s not the strength of our arms or the power of our technology that gives the United States our military dominance. It’s our people. It’s our Sailors and Marines, Soldiers and Airmen and Coast Guardsmen who perform brilliantly in every mission we give them. ************** This class is about to become the latest link in a long, unbroken chain of heroism and victory. A chain forged in battles whose names are etched in the stone of this stadium. From Coral Sea to Midway to Guadalcanal. From Iwo Jima to Inchon. From the Mekong Delta to Desert Storm. For some among us, these are not just places on a map. They are the stories of their lives. And we honor all our veterans here today. This chain of service calls to mind words that were spoken here in Annapolis on another spring day a century ago. The crowds assembled, the bands played, and the cannons roared. And as John Paul Jones’ body was carried to the Yard, President Teddy Roosevelt spoke to the Midshipmen gathered there that day. \"Remember,\" he said, \"our words of admiration are but as sounding brass and tinkling symbols if we do not…prepare to emulate their deeds.\" Emulate their deeds. That is what you are called upon to do. And in doing so these past four years, you have not only given meaning to your own lives, you serve as a reminder—a challenge—to your fellow Americans to fulfill the true meaning of citizenship. America, look at these young men and women. Look at these Sailors and Marines. Here are the values we cherish. Here are the ideals that endure. In an era when too few citizens answer the call to service—to community or country—these Americans chose to serve. And they did so in a time of war, knowing they might be called upon to make the ultimate sacrifice. ************* In a culture where so many chase the outward markers of success that can so often lead us astray—titles and status, materialism and money, fame and popularity—these Americans have embraced the virtues that we need most right now. Self-discipline over self-interest. Work over comfort. Character over celebrity. After an era when so many institutions and individuals acted with such greed and recklessness, it is no wonder that our military remains the most trusted institution in the nation. And in a world when so many forces and voices seek to divide us, it is inspiring that this class came together and succeeded together, from every state and every corner of the world. By building an institution that is more diverse than ever—more women, more Hispanics, more African Americans—the Naval Academy has reaffirmed a fundamental American truth: that out of many, we are one. We see these values in every one of these Sailors and Marines, including those who have already served their country—the dozens among you with prior enlisted service. ************ Honor. Courage. Commitment. These are the values that have defined your years in the Yard and that you’ll need in the years ahead. As you join the fleet. As you lead Marines. As you confront the ever-changing threats of an ever-changing world. For history teaches us that the nations that grow comfortable with the old ways and complacent in the face of new threats—those nations do not long endure. And in the 21st century, we do not have the luxury of deciding which challenges to prepare for and which to ignore. We must overcome the full spectrum of threats. The conventional and the unconventional. The nation-state and the terrorist network. The spread of deadly technologies and of hateful ideologies. Eighteenth century-style piracy and 21st century cyberthreats. ***************** Marines—we need you to defeat the insurgent and the extremist. But we also need you to work with the tribal sheik and local leaders from Anbar to Kandahar who want to build a better future for their people. Naval aviators and flight officers—we need you to dominate the airspace in times of conflict, but also to deliver food and medicine in times of humanitarian crisis. And surface warfare officers and submariners—we need you to project American power across the vast oceans, but also to project American principles and values when you pull into that foreign port—because for so many people around the world, you are the face of America. ************** Yesterday I visited the National Archives and the hall that holds our Constitution, Declaration of Independence and the Bill of Rights. I went there because as our nation debates how to deal with the security challenges that we face, we must remember this enduring truth: the values and ideals in those documents are not simply words written into aging parchment, they are the bedrock of our liberty and our security. We uphold our fundamental principles and values not just because we choose to, but because we swear to. Not because they feel good, but because they help keep us safe. Because when America strays from our values, it not only undermines the rule of law, it alienates us from our allies, it energizes our adversaries and it endangers our national security and the lives of our troops. So as Americans, we reject the false chose between our security and our ideals. We can and we must and we will protect both. And that is just what you will pledge to do in a few moments when you raise your right hand and take your oath. By that simple act you will accept a life of great sacrifice. Long deployments. Separation for loved ones. Tests and trials that most Americans cannot imagine. But that is the oath you take, the life you choose, the promise you make to America. And, today, this is the promise I make to you. It’s a promise that as long as I am your Commander in Chief, I will only send you into harm’s way when it is absolutely necessary, and with the strategy, the well-defined goals, the equipment and the support you need to get the job done. This includes the job of bringing the Iraq war to a responsible end and pursuing a new comprehensive strategy to disrupt, dismantle and defeat al Qaeda and its allies in Afghanistan and Pakistan. And to get you the support you need, we’re enlisting all elements of our national power—our diplomacy and development and our economic might and our moral suasion—so that you and the rest of our military do not bear the burden of our security alone. We will also ensure you can meet the missions of today, which is why we’ve halted reductions in Navy personnel and increased the size of the Marine Corps. And we will ensure you can meet the missions of tomorrow, which is why we’re investing in the capabilities and technologies—the littoral combat ships, the most advanced submarines and fighter aircraft—so that you have what you need to succeed. In short, we will maintain America’s military dominance and keep you the finest fighting force the world has ever seen. http://www.usna.edu/PAO/", 
        "reply": "I must say, that while Obama has been a big disappointment to me in many respects, his public speeches are inspirational. One of the Great speakers of our time. Here are some of my favorite excerpts from his Commencement Address at Annapolis. I recoment reading the whole speech. He truly clarifies, what American Values are, and how the military upholds them. ", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-22 17:31:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "Grachus"
    }, 
    {
        "content": "- hey man, i was just about to post a link to the speech. it's amazing. yeah, will link to it in my 'fist bump' topic. nice. -", 
        "intTime": 20090522, 
        "postID": 22, 
        "quote": "", 
        "reply": "- hey man, i was just about to post a link to the speech. it's amazing. yeah, will link to it in my 'fist bump' topic. nice. -", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-22 19:38:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "Hunky, dory until I heard somewhere that he thought vets should help their country by paying their own medical bills to reduce US debt....as if we didn't do enough by standing in the gap for the rest of the country who didn't have to fight!?", 
        "intTime": 20090522, 
        "postID": 23, 
        "quote": "", 
        "reply": "Hunky, dory until I heard somewhere that he thought vets should help their country by paying their own medical bills to reduce US debt....as if we didn't do enough by standing in the gap for the rest of the country who didn't have to fight!?", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-22 19:48:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "Tower_Flower"
    }, 
    {
        "content": "quote: Originally posted by Tower_Flower: Hunky, dory until I heard somewhere that he thought vets should help their country by paying their own medical bills to reduce US debt....as if we didn't do enough by standing in the gap for the rest of the country who didn't have to fight!? You heard somewhere? Care to find a link? -", 
        "intTime": 20090522, 
        "postID": 24, 
        "quote": "Originally posted by Tower_Flower: Hunky, dory until I heard somewhere that he thought vets should help their country by paying their own medical bills to reduce US debt....as if we didn't do enough by standing in the gap for the rest of the country who didn't have to fight!?", 
        "reply": " You heard somewhere? Care to find a link? -", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-22 21:32:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "No....go easy on me, I'm sleepy", 
        "intTime": 20090522, 
        "postID": 25, 
        "quote": "", 
        "reply": "No....go easy on me, I'm sleepy", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-22 21:35:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "Tower_Flower"
    }, 
    {
        "content": "\"that while Obama has been a big disappointment to me in many respects, his public speeches are inspirational. One of the Great speakers of our time. \" That's what got him elected - his speaking abilities. Certainly not his past accomplishments. Question is, does he write his own speeches or does he pay someone to do it for him?", 
        "intTime": 20090523, 
        "postID": 26, 
        "quote": "", 
        "reply": "\"that while Obama has been a big disappointment to me in many respects, his public speeches are inspirational. One of the Great speakers of our time. \" That's what got him elected - his speaking abilities. Certainly not his past accomplishments. Question is, does he write his own speeches or does he pay someone to do it for him?", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 02:10:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "mj101inf"
    }, 
    {
        "content": "quote: Originally posted by mj101inf: \"that while Obama has been a big disappointment to me in many respects, his public speeches are inspirational. One of the Great speakers of our time. \" That's what got him elected - his speaking abilities. Certainly not his past accomplishments. Question is, does he write his own speeches or does he pay someone to do it for him? no one truly writes their own speeches these days. the key is how to deliver them. and he is an extremely accomplished orator. oh, and as for past accomplishments, he beats the pants off the previous encumbent. - -", 
        "intTime": 20090523, 
        "postID": 27, 
        "quote": "Originally posted by mj101inf: \"that while Obama has been a big disappointment to me in many respects, his public speeches are inspirational. One of the Great speakers of our time. \" That's what got him elected - his speaking abilities. Certainly not his past accomplishments. Question is, does he write his own speeches or does he pay someone to do it for him?", 
        "reply": " no one truly writes their own speeches these days. the key is how to deliver them. and he is an extremely accomplished orator. oh, and as for past accomplishments, he beats the pants off the previous encumbent. - -", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 03:44:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "It was just your average every day politician speech. When one joins the military and puts on a uniform prior to that they take an oath. That oath states they will protect the US from all enemies foreign and domestic. Nothing about going to war only when absolutely necessary.", 
        "intTime": 20090523, 
        "postID": 28, 
        "quote": "", 
        "reply": "It was just your average every day politician speech. When one joins the military and puts on a uniform prior to that they take an oath. That oath states they will protect the US from all enemies foreign and domestic. Nothing about going to war only when absolutely necessary.", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 04:47:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "Duster6"
    }, 
    {
        "content": "The entire speech is up on You Tube. He did a fine job and personally congratulated the distinguished graduates.", 
        "intTime": 20090523, 
        "postID": 29, 
        "quote": "", 
        "reply": "The entire speech is up on You Tube. He did a fine job and personally congratulated the distinguished graduates.", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 05:08:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "vsibaby"
    }, 
    {
        "content": "There is another thread on this board about this speech, in which the OP takes his remarks about abiding by the law, as the only definition of \"American Values.\" Here is an excerpt (which is the only substantial quote) from the newspaper article cited in that thread... quote: Obama used the backdrop of the US Naval Academy graduation ceremony to argue that founding US ideals must guide the future battle against terrorism, a day after trying to quell raging debate over Guantanamo Bay in a major speech. \"We uphold our fundamental principles and values not just because we choose to, but because we swear to -- not because they feel good, but because they help keep us safe,\" Obama told 30,000 graduating navy cadets and family members. \"When America strays from our values, it not only undermines the rule of law, it alienates us from our allies, it energizes our adversaries and it endangers our national security and the lives of our troops.\" The OP on that thread, and far more importantly, all the right wing blogs, have seized on this to claim that Obamas only solution to Al Qaeda is no torture - They imply, that he's ready to negotiate with the Taliban and Osama. They neither needed to, or bothered to, actually read the whole speech. Dave", 
        "intTime": 20090523, 
        "postID": 30, 
        "quote": "Obama used the backdrop of the US Naval Academy graduation ceremony to argue that founding US ideals must guide the future battle against terrorism, a day after trying to quell raging debate over Guantanamo Bay in a major speech. \"We uphold our fundamental principles and values not just because we choose to, but because we swear to -- not because they feel good, but because they help keep us safe,\" Obama told 30,000 graduating navy cadets and family members. \"When America strays from our values, it not only undermines the rule of law, it alienates us from our allies, it energizes our adversaries and it endangers our national security and the lives of our troops.\"", 
        "reply": "There is another thread on this board about this speech, in which the OP takes his remarks about abiding by the law, as the only definition of \"American Values.\" Here is an excerpt (which is the only substantial quote) from the newspaper article cited in that thread...  The OP on that thread, and far more importantly, all the right wing blogs, have seized on this to claim that Obamas only solution to Al Qaeda is no torture - They imply, that he's ready to negotiate with the Taliban and Osama. They neither needed to, or bothered to, actually read the whole speech. Dave", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 08:39:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "Grachus"
    }, 
    {
        "content": "Not to take away the speech or him honoring the military, but where was all this love from him and the congress when Bush needed more money for our troops? He acts like only his war is a just war. It is the same darn war with the same darn people and started before him and will go on long after him. To take it out on our military for a political stand is wrong and to then turn around and acknowledge them for a political stand is insulting. Keep the military out of politics and let them do their job and give them the means to do the job. He talks about people that have not always acknowledged what our military has done for this country and treated them wrong and I would have to say that the majority of that behaior has always come from his party of radical liberals. Not that the Reps don't have radical people, but typically they don't take it out on the military. Oh well, I guess now that Obama is in office and had access to what is really going on he can see just home important or military is and how much he needs them. If nothing else, he can bring light to that. You know, the more and more Obama is in office he sounds and acts like Bush. heheh", 
        "intTime": 20090523, 
        "postID": 31, 
        "quote": "", 
        "reply": "Not to take away the speech or him honoring the military, but where was all this love from him and the congress when Bush needed more money for our troops? He acts like only his war is a just war. It is the same darn war with the same darn people and started before him and will go on long after him. To take it out on our military for a political stand is wrong and to then turn around and acknowledge them for a political stand is insulting. Keep the military out of politics and let them do their job and give them the means to do the job. He talks about people that have not always acknowledged what our military has done for this country and treated them wrong and I would have to say that the majority of that behaior has always come from his party of radical liberals. Not that the Reps don't have radical people, but typically they don't take it out on the military. Oh well, I guess now that Obama is in office and had access to what is really going on he can see just home important or military is and how much he needs them. If nothing else, he can bring light to that. You know, the more and more Obama is in office he sounds and acts like Bush. heheh", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 09:03:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "usa_girl"
    }, 
    {
        "content": "Good job, White House. You didn't load his teleprompter incompetently. (It's not what he says that counts; it's what he doesn't say.)", 
        "intTime": 20090523, 
        "postID": 32, 
        "quote": "", 
        "reply": "Good job, White House. You didn't load his teleprompter incompetently. (It's not what he says that counts; it's what he doesn't say.)", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 09:06:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: Not to take away the speech or him honoring the military, but where was all this love from him and the congress when Bush needed more money for our troops? He acts like only his war is a just war. It is the same darn war with the same darn people and started before him and will go on long after him. To take it out on our military for a political stand is wrong and to then turn around and acknowledge them for a political stand is insulting. Keep the military out of politics and let them do their job and give them the means to do the job. He talks about people that have not always acknowledged what our military has done for this country and treated them wrong and I would have to say that the majority of that behaior has always come from his party of radical liberals. Not that the Reps don't have radical people, but typically they don't take it out on the military. Oh well, I guess now that Obama is in office and had access to what is really going on he can see just home important or military is and how much he needs them. If nothing else, he can bring light to that. You know, the more and more Obama is in office he sounds and acts like Bush. heheh Congress granted Mr. Bush every military budget, and \"extra\" appropriation that he asked for. Congress raised military and VA benefits over the objections of the Republicans (as a group). Such being the case, what are you talking about? And no offense, but if you have actually read the speeches of President Bush to military audiences, Obamas speech is almost non-political in comparison. Dave", 
        "intTime": 20090523, 
        "postID": 33, 
        "quote": "Originally posted by usa_girl: Not to take away the speech or him honoring the military, but where was all this love from him and the congress when Bush needed more money for our troops? He acts like only his war is a just war. It is the same darn war with the same darn people and started before him and will go on long after him. To take it out on our military for a political stand is wrong and to then turn around and acknowledge them for a political stand is insulting. Keep the military out of politics and let them do their job and give them the means to do the job. He talks about people that have not always acknowledged what our military has done for this country and treated them wrong and I would have to say that the majority of that behaior has always come from his party of radical liberals. Not that the Reps don't have radical people, but typically they don't take it out on the military. Oh well, I guess now that Obama is in office and had access to what is really going on he can see just home important or military is and how much he needs them. If nothing else, he can bring light to that. You know, the more and more Obama is in office he sounds and acts like Bush. heheh", 
        "reply": " Congress granted Mr. Bush every military budget, and \"extra\" appropriation that he asked for. Congress raised military and VA benefits over the objections of the Republicans (as a group). Such being the case, what are you talking about? And no offense, but if you have actually read the speeches of President Bush to military audiences, Obamas speech is almost non-political in comparison. Dave", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 09:15:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "Grachus"
    }, 
    {
        "content": "No offense taken, I am allowed to have my opinion even if it is not to your liking. I did not know congress actually came through with \"every\" amount asked for from Bush, but I am happy to know you say they ended up giving it to him and then some. I actually do remember seeing the floor meetings with the two parties going at it over Iraq and wanting to bring our men and women home. I am sure you will correct me if I get it wrong..but it was more the Democratic party that had decided we never should have been at war with Iraq, then went on to call war crimes, to suggest Bush be removed from office, and finally to cut off his money as a way to get him to end that war, yes? And it was more the Republican party that said, we went into Iraq based on intel from our country and others after being attacked on 9/11, we did not find what we were looking for but took Saddam out anyway who was an evil man, used Iraq as a base thinking Iran would be the big issue and we would have our people both in Afganistan and Irag to cover both sides of Iran, tried to bring freedom to the Iraq people, that ended up being harder than thought but because we did not cut and run when the liberals applied pressure at leeast the vote was a success, but at great cost to America, yes or no? When they were trying to force Bush in to ending the war on their time table wasn't it that that it was suggested that they would cut off his funds as a way to making him end the war? You don't remember seeing any of that? You never heard about that plan? I do. It would have been about the same time the media kept doing all the reports on how our men did not have the proper items needed to keep them safe. I think the tanks were a big issue, yes? Was that called a hummer or humd? I don't remember exactly but I do remember watching that covered over and over because I was so upset that the military did not have what they needed to keep them safe. Oh yes, and something about a net you keep in the room while sleeping to protect against a bomb? I am sure I don't have it all exactly right, but that is why I am here to learn.", 
        "intTime": 20090523, 
        "postID": 34, 
        "quote": "", 
        "reply": "No offense taken, I am allowed to have my opinion even if it is not to your liking. I did not know congress actually came through with \"every\" amount asked for from Bush, but I am happy to know you say they ended up giving it to him and then some. I actually do remember seeing the floor meetings with the two parties going at it over Iraq and wanting to bring our men and women home. I am sure you will correct me if I get it wrong..but it was more the Democratic party that had decided we never should have been at war with Iraq, then went on to call war crimes, to suggest Bush be removed from office, and finally to cut off his money as a way to get him to end that war, yes? And it was more the Republican party that said, we went into Iraq based on intel from our country and others after being attacked on 9/11, we did not find what we were looking for but took Saddam out anyway who was an evil man, used Iraq as a base thinking Iran would be the big issue and we would have our people both in Afganistan and Irag to cover both sides of Iran, tried to bring freedom to the Iraq people, that ended up being harder than thought but because we did not cut and run when the liberals applied pressure at leeast the vote was a success, but at great cost to America, yes or no? When they were trying to force Bush in to ending the war on their time table wasn't it that that it was suggested that they would cut off his funds as a way to making him end the war? You don't remember seeing any of that? You never heard about that plan? I do. It would have been about the same time the media kept doing all the reports on how our men did not have the proper items needed to keep them safe. I think the tanks were a big issue, yes? Was that called a hummer or humd? I don't remember exactly but I do remember watching that covered over and over because I was so upset that the military did not have what they needed to keep them safe. Oh yes, and something about a net you keep in the room while sleeping to protect against a bomb? I am sure I don't have it all exactly right, but that is why I am here to learn.", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 09:38:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: No offense taken, I am allowed to have my opinion even if it is not to your liking. I did not know congress actually came through with \"every\" amount asked for from Bush, but I am happy to know you say they ended up giving it to him and then some. I actually do remember seeing the floor meetings with the two parties going at it over Iraq and wanting to bring our men and women home. Your memory IMO is so far correct. quote: Originally posted by usa_girl: I am sure you will correct me if I get it wrong..but it was more the Democratic party that had decided we never should have been at war with Iraq, then went on to call war crimes, to suggest Bush be removed from office, and finally to cut off his money as a way to get him to end that war, yes? Some Democrats suggested all of the above. Most Democrats suggested one or another of these acts. No one ever cut off any money. Impeachment (And I regret this) was never seriously on the table - Cutting off funds, even less so. Keep in mind that I can probably find a Republican advocating eating Muslims as a way to solve the World food problems (Perhaps I exagerate here... ) doesn't mean that this represents Republican thinking as a Party. quote: Originally posted by usa_girl: And it was more the Republican party that said, we went into Iraq based on intel from our country and others after being attacked on 9/11, we did not find what we were looking for but took Saddam out anyway who was an evil man, used Iraq as a base thinking Iran would be the big issue and we would have our people both in Afganistan and Irag to cover both sides of Iran, tried to bring freedom to the Iraq people, that ended up being harder than thought but because we did not cut and run when the liberals applied pressure at leeast the vote was a success, but at great cost to America, yes or no? President Bush wanted to invade Iraq long before he was even elected. 9/11 was the excuse. Did he believe Sadaam was an evil man? Sure he did. But there are a lot of evil men in this world. Did he believe that Iraq was an immenent threat to the United States? I doubt that. In fact, HE doubts that. Do I believe that Iraq was part of the WOT? Not a chance. Do I think that taking over Iraq lessened the power of Al Qaeda? I believed it prolonged Al Qaedas life. I believe it strenthed them in every possible way. And I also believe that we have created a new ally for Iran, and although Iran is not a part of the WOT, it does represent a long term threat to us, and we have helped them immensely without it costing them a dime. quote: Originally posted by usa_girl: When they were trying to force Bush in to ending the war on their time table wasn't it that that it was suggested that they would cut off his funds as a way to making him end the war? Some Democrats suggested that. Unfortunately they never came close to having enough votes to do this. quote: Originally posted by usa_girl: You don't remember seeing any of that? You never heard about that plan? I do. It would have been about the same time the media kept doing all the reports on how our men did not have the proper items needed to keep them safe. I think the tanks were a big issue, yes? \"You go to war with the army you have, not the army you want.\" Donald Rumsfeld quote: Originally posted by usa_girl: Was that called a hummer or humd? I don't remember exactly but I do remember watching that covered over and over because I was so upset that the military did not have what they needed to keep them safe. Oh yes, and something about a net you keep in the room while sleeping to protect against a bomb? I am sure I don't have it all exactly right, but that is why I am here to learn. When the US went to war in 1941, factories worked around the clock. I mean this literally. In THIS war, factories worked nine to five. No additional companies were hired. No overtime was suggested. It took more than four years for our troops to get the equipment that the military said we needed. Looked at objectively, this is unbelievable. The military in the form of the head of the Joint Chiefs, said point blank that we needed at least 200,000, better, 500,000 men to safely pacify the country and prevent an insurgency. For his trouble he was forced into retirement. I was against the war from the beginning, but if you're GOING to actually fight a war, don't do it on the cheap. Penny wise and dollar foolish is why we are still there. To my mind it's all academic. Here's a short Editorial from the US Army's own \"Strategic Studies Institute.\" Mind you, not something I grabbed from Moveon dot org... quote: IN DEFENSE OF RATIONAL RISK ASSESSMENT Lieutenant Colonel Nathan Freier Strategic Studies Institute Risk in Webster’s is “the possibility of suffering harm or loss.”1 Risk accompanies both action and inaction. To strategists, it is accounted for and mitigated, but not always or even commonly avoided. To the national security strategist, risk—to paraphrase the current defense strategy—is the likelihood of failure or prohibitive cost in pursuit of key objectives. In this view, some goals are beyond reach. Others are within reach, but the cost of achieving them puts more important ambitions in some jeopardy.2 Unfortunately, those familiar with contemporary strategic-level military decisionmaking know that rational consideration of even the prospect of failure is absent. In high-level policy discussions, success is assumed. From the beginning, Iraq was an experiment in risk taking. To be sure, the war’s advocates saw it as risk mitigation as well—remember ‘smoking guns’ and ‘mushroom clouds,’ for example. However, at its core, toppling Saddam was about balancing the certainty of violent dislocation that accompanies overthrow of an unfavorable but stable status quo against the hope for a more favorable, future post-war political order. It was extension of “the democratic peace” by force—whether or not the forcible export of representative governance was ever a formal casus belli. In this context, Iraq engendered enormous risk from the beginning. There was the ever-present ‘likelihood of failure or prohibitive cost’ that needed to be accounted for in deliberate planning. For example, there were obvious dormant sectarian divisions. Given Saddam’s violent separation of ruler from ruled, this indicated the distinct possibility of uncontrolled civil conflict in the aftermath of the government’s collapse. There was the extant Iraqi overdependence on primary resource exports for government revenues. This, in the developing world (which Iraq rejoined from below in 2003), commonly signals persistent danger to political order. There was a certainty that at least two of Iraq’s neighbors would actively resist through politics, influence, and at times, violence—American success. Still others would be very sympathetic to Iraq’s minority Sunni; if not quite hostile to Shi’a or Kurdish triumph. Others still—likely most—would remain reticent on the issue of Iraq’s democratic success or failure. Finally, there was the precedent of the Soviet Afghan War. In Afghanistan (circa 1979-89), external intervention was a magnet for Muslim anti-colonial resistance. Tribalism, nationalism, and Muslim extremism combined to militate against Soviet success. These same forces join today with internecine sectarianism to similarly check American progress in Iraq. Rational risk assessment in advance of the Iraq intervention would have identified and accounted for all of these. Each, after all—individually or in combination, could be enough to seriously delay favorable outcomes, prevent success, or drive strategic costs to prohibitive levels. Evaluating each seriously, thoughtfully considering their implications, and accounting for them deliberately in strategy development is a sign of wisdom, not fear. Instead, those engineering the Iraq War framed strategic risk incorrectly. They assumed ultimate success—a stable, representative, multifaith polity—would rapidly and naturally occur as a result of the necessary but decidedly intermediate step of overthrowing the existing regime. Thus, in their view, the likelihood for some near-term “harm or loss” was insignificant compared to the anticipated return on the nation’s strategic investment. Their risk calculations simply never went beyond D-Day. It is now well-documented that Iraq policy was made in a strategic vacuum. It appears no vizier-like or mandarin-like class on the inside carefully weighed specific grand strategic options vis-à-vis the United States, Iraq, and the world in detail, calculating different choices and their inherent risks and benefits. There were prescient warnings. It is now clear few were heeded. In short, the risk problem, as it was likely presented to the President, was a strawman. It failed to account comprehensively for the real hazards engendered in deliberate regime destruction, stabilization, and reconstruction in a large, consequential state. Iraq proceeded from risk assessment that in its sophistication went little beyond “nothing ventured nothing gained.” This is a caution for the future. Risk-informed strategy does not indicate risk aversion. Identifying risks and hazards and accounting for their mitigation does not prevent action. Rather, it underwrites success. The bold too often mistake thoughtful consideration of real hazard for weakness. Quite the contrary, deliberate consideration of risk-adjusted choices increases the prospect for bold action’s ultimate success. Riskinformed strategy provides decisionmakers with a realistic accounting of strategic conditions as they are, versus as some would prefer them to be. It proceeds from the conclusion that raw capacity and desire alone do not determine success. It recognizes that our perceptions of our motives and intentions are likely quite different from the perceptions of others. Finally, it demands that strategists account for both the prospect of failure and the progressive accumulation of excessive cost that—without mitigation—might jeopardize long-term success and the security of interests of equal or greater importance. ENDNOTES 1. Riverside, Webster’s II: New College Dictionary, Boston-New York: Houghton Mifflin Company, p. 957. 2. Department of Defense, The National Defense Strategy of the United States, March 18, 2005, p. 11, available at \"www.defenselink.mil/news/Mar2005/d20050318nds1.pdf\" ***** Dave", 
        "intTime": 20090523, 
        "postID": 35, 
        "quote": "Originally posted by usa_girl: No offense taken, I am allowed to have my opinion even if it is not to your liking. I did not know congress actually came through with \"every\" amount asked for from Bush, but I am happy to know you say they ended up giving it to him and then some. I actually do remember seeing the floor meetings with the two parties going at it over Iraq and wanting to bring our men and women home.", 
        "reply": " Your memory IMO is so far correct. quote: Originally posted by usa_girl: I am sure you will correct me if I get it wrong..but it was more the Democratic party that had decided we never should have been at war with Iraq, then went on to call war crimes, to suggest Bush be removed from office, and finally to cut off his money as a way to get him to end that war, yes? Some Democrats suggested all of the above. Most Democrats suggested one or another of these acts. No one ever cut off any money. Impeachment (And I regret this) was never seriously on the table - Cutting off funds, even less so. Keep in mind that I can probably find a Republican advocating eating Muslims as a way to solve the World food problems (Perhaps I exagerate here... ) doesn't mean that this represents Republican thinking as a Party. quote: Originally posted by usa_girl: And it was more the Republican party that said, we went into Iraq based on intel from our country and others after being attacked on 9/11, we did not find what we were looking for but took Saddam out anyway who was an evil man, used Iraq as a base thinking Iran would be the big issue and we would have our people both in Afganistan and Irag to cover both sides of Iran, tried to bring freedom to the Iraq people, that ended up being harder than thought but because we did not cut and run when the liberals applied pressure at leeast the vote was a success, but at great cost to America, yes or no? President Bush wanted to invade Iraq long before he was even elected. 9/11 was the excuse. Did he believe Sadaam was an evil man? Sure he did. But there are a lot of evil men in this world. Did he believe that Iraq was an immenent threat to the United States? I doubt that. In fact, HE doubts that. Do I believe that Iraq was part of the WOT? Not a chance. Do I think that taking over Iraq lessened the power of Al Qaeda? I believed it prolonged Al Qaedas life. I believe it strenthed them in every possible way. And I also believe that we have created a new ally for Iran, and although Iran is not a part of the WOT, it does represent a long term threat to us, and we have helped them immensely without it costing them a dime. quote: Originally posted by usa_girl: When they were trying to force Bush in to ending the war on their time table wasn't it that that it was suggested that they would cut off his funds as a way to making him end the war? Some Democrats suggested that. Unfortunately they never came close to having enough votes to do this. quote: Originally posted by usa_girl: You don't remember seeing any of that? You never heard about that plan? I do. It would have been about the same time the media kept doing all the reports on how our men did not have the proper items needed to keep them safe. I think the tanks were a big issue, yes? \"You go to war with the army you have, not the army you want.\" Donald Rumsfeld quote: Originally posted by usa_girl: Was that called a hummer or humd? I don't remember exactly but I do remember watching that covered over and over because I was so upset that the military did not have what they needed to keep them safe. Oh yes, and something about a net you keep in the room while sleeping to protect against a bomb? I am sure I don't have it all exactly right, but that is why I am here to learn. When the US went to war in 1941, factories worked around the clock. I mean this literally. In THIS war, factories worked nine to five. No additional companies were hired. No overtime was suggested. It took more than four years for our troops to get the equipment that the military said we needed. Looked at objectively, this is unbelievable. The military in the form of the head of the Joint Chiefs, said point blank that we needed at least 200,000, better, 500,000 men to safely pacify the country and prevent an insurgency. For his trouble he was forced into retirement. I was against the war from the beginning, but if you're GOING to actually fight a war, don't do it on the cheap. Penny wise and dollar foolish is why we are still there. To my mind it's all academic. Here's a short Editorial from the US Army's own \"Strategic Studies Institute.\" Mind you, not something I grabbed from Moveon dot org... quote: IN DEFENSE OF RATIONAL RISK ASSESSMENT Lieutenant Colonel Nathan Freier Strategic Studies Institute Risk in Webster’s is “the possibility of suffering harm or loss.”1 Risk accompanies both action and inaction. To strategists, it is accounted for and mitigated, but not always or even commonly avoided. To the national security strategist, risk—to paraphrase the current defense strategy—is the likelihood of failure or prohibitive cost in pursuit of key objectives. In this view, some goals are beyond reach. Others are within reach, but the cost of achieving them puts more important ambitions in some jeopardy.2 Unfortunately, those familiar with contemporary strategic-level military decisionmaking know that rational consideration of even the prospect of failure is absent. In high-level policy discussions, success is assumed. From the beginning, Iraq was an experiment in risk taking. To be sure, the war’s advocates saw it as risk mitigation as well—remember ‘smoking guns’ and ‘mushroom clouds,’ for example. However, at its core, toppling Saddam was about balancing the certainty of violent dislocation that accompanies overthrow of an unfavorable but stable status quo against the hope for a more favorable, future post-war political order. It was extension of “the democratic peace” by force—whether or not the forcible export of representative governance was ever a formal casus belli. In this context, Iraq engendered enormous risk from the beginning. There was the ever-present ‘likelihood of failure or prohibitive cost’ that needed to be accounted for in deliberate planning. For example, there were obvious dormant sectarian divisions. Given Saddam’s violent separation of ruler from ruled, this indicated the distinct possibility of uncontrolled civil conflict in the aftermath of the government’s collapse. There was the extant Iraqi overdependence on primary resource exports for government revenues. This, in the developing world (which Iraq rejoined from below in 2003), commonly signals persistent danger to political order. There was a certainty that at least two of Iraq’s neighbors would actively resist through politics, influence, and at times, violence—American success. Still others would be very sympathetic to Iraq’s minority Sunni; if not quite hostile to Shi’a or Kurdish triumph. Others still—likely most—would remain reticent on the issue of Iraq’s democratic success or failure. Finally, there was the precedent of the Soviet Afghan War. In Afghanistan (circa 1979-89), external intervention was a magnet for Muslim anti-colonial resistance. Tribalism, nationalism, and Muslim extremism combined to militate against Soviet success. These same forces join today with internecine sectarianism to similarly check American progress in Iraq. Rational risk assessment in advance of the Iraq intervention would have identified and accounted for all of these. Each, after all—individually or in combination, could be enough to seriously delay favorable outcomes, prevent success, or drive strategic costs to prohibitive levels. Evaluating each seriously, thoughtfully considering their implications, and accounting for them deliberately in strategy development is a sign of wisdom, not fear. Instead, those engineering the Iraq War framed strategic risk incorrectly. They assumed ultimate success—a stable, representative, multifaith polity—would rapidly and naturally occur as a result of the necessary but decidedly intermediate step of overthrowing the existing regime. Thus, in their view, the likelihood for some near-term “harm or loss” was insignificant compared to the anticipated return on the nation’s strategic investment. Their risk calculations simply never went beyond D-Day. It is now well-documented that Iraq policy was made in a strategic vacuum. It appears no vizier-like or mandarin-like class on the inside carefully weighed specific grand strategic options vis-à-vis the United States, Iraq, and the world in detail, calculating different choices and their inherent risks and benefits. There were prescient warnings. It is now clear few were heeded. In short, the risk problem, as it was likely presented to the President, was a strawman. It failed to account comprehensively for the real hazards engendered in deliberate regime destruction, stabilization, and reconstruction in a large, consequential state. Iraq proceeded from risk assessment that in its sophistication went little beyond “nothing ventured nothing gained.” This is a caution for the future. Risk-informed strategy does not indicate risk aversion. Identifying risks and hazards and accounting for their mitigation does not prevent action. Rather, it underwrites success. The bold too often mistake thoughtful consideration of real hazard for weakness. Quite the contrary, deliberate consideration of risk-adjusted choices increases the prospect for bold action’s ultimate success. Riskinformed strategy provides decisionmakers with a realistic accounting of strategic conditions as they are, versus as some would prefer them to be. It proceeds from the conclusion that raw capacity and desire alone do not determine success. It recognizes that our perceptions of our motives and intentions are likely quite different from the perceptions of others. Finally, it demands that strategists account for both the prospect of failure and the progressive accumulation of excessive cost that—without mitigation—might jeopardize long-term success and the security of interests of equal or greater importance. ENDNOTES 1. Riverside, Webster’s II: New College Dictionary, Boston-New York: Houghton Mifflin Company, p. 957. 2. Department of Defense, The National Defense Strategy of the United States, March 18, 2005, p. 11, available at \"www.defenselink.mil/news/Mar2005/d20050318nds1.pdf\" ***** Dave", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 10:07:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by usa_girl: No offense taken, I am allowed to have my opinion even if it is not to your liking. I did not know congress actually came through with \"every\" amount asked for from Bush, but I am happy to know you say they ended up giving it to him and then some. I actually do remember seeing the floor meetings with the two parties going at it over Iraq and wanting to bring our men and women home. Your memory IMO is so far correct. quote: Originally posted by usa_girl: I am sure you will correct me if I get it wrong..but it was more the Democratic party that had decided we never should have been at war with Iraq, then went on to call war crimes, to suggest Bush be removed from office, and finally to cut off his money as a way to get him to end that war, yes? Some Democrats suggested all of the above. Most Democrats suggested one or another of these acts. No one ever cut off any money. Impeachment (And I regret this) was never seriously on the table - Cutting off funds, even less so. Keep in mind that I can probably find a Republican advocating eating Muslims as a way to solve the World food problems (Perhaps I exagerate here... ) doesn't mean that this represents Republican thinking as a Party. quote: Originally posted by usa_girl: And it was more the Republican party that said, we went into Iraq based on intel from our country and others after being attacked on 9/11, we did not find what we were looking for but took Saddam out anyway who was an evil man, used Iraq as a base thinking Iran would be the big issue and we would have our people both in Afganistan and Irag to cover both sides of Iran, tried to bring freedom to the Iraq people, that ended up being harder than thought but because we did not cut and run when the liberals applied pressure at leeast the vote was a success, but at great cost to America, yes or no? President Bush wanted to invade Iraq long before he was even elected. 9/11 was the excuse. Did he believe Sadaam was an evil man? Sure he did. But there are a lot of evil men in this world. Did he believe that Iraq was an immenent threat to the United States? I doubt that. In fact, HE doubts that. Do I believe that Iraq was part of the WOT? Not a chance. Do I think that taking over Iraq lessened the power of Al Qaeda? I believed it prolonged Al Qaedas life. I believe it strenthed them in every possible way. And I also believe that we have created a new ally for Iran, and although Iran is not a part of the WOT, it does represent a long term threat to us, and we have helped them immensely without it costing them a dime. quote: Originally posted by usa_girl: When they were trying to force Bush in to ending the war on their time table wasn't it that that it was suggested that they would cut off his funds as a way to making him end the war? Some Democrats suggested that. Unfortunately they never came close to having enough votes to do this. quote: Originally posted by usa_girl: You don't remember seeing any of that? You never heard about that plan? I do. It would have been about the same time the media kept doing all the reports on how our men did not have the proper items needed to keep them safe. I think the tanks were a big issue, yes? \"You go to war with the army you have, not the army you want.\" Donald Rumsfeld quote: Originally posted by usa_girl: Was that called a hummer or humd? I don't remember exactly but I do remember watching that covered over and over because I was so upset that the military did not have what they needed to keep them safe. Oh yes, and something about a net you keep in the room while sleeping to protect against a bomb? I am sure I don't have it all exactly right, but that is why I am here to learn. When the US went to war in 1941, factories worked around the clock. I mean this literally. In THIS war, factories worked nine to five. No additional companies were hired. No overtime was suggested. It took more than four years for our troops to get the equipment that the military said we needed. Looked at objectively, this is unbelievable. The military in the form of the head of the Joint Chiefs, said point blank that we needed at least 200,000, better, 500,000 men to safely pacify the country and prevent an insurgency. For his trouble he was forced into retirement. I was against the war from the beginning, but if you're GOING to actually fight a war, don't do it on the cheap. Penny wise and dollar foolish is why we are still there. To my mind it's all academic. Here's a short Editorial from the US Army's own \"Strategic Studies Institute.\" Mind you, not something I grabbed from Moveon dot org... quote: IN DEFENSE OF RATIONAL RISK ASSESSMENT Lieutenant Colonel Nathan Freier Strategic Studies Institute Risk in Webster’s is “the possibility of suffering harm or loss.”1 Risk accompanies both action and inaction. To strategists, it is accounted for and mitigated, but not always or even commonly avoided. To the national security strategist, risk—to paraphrase the current defense strategy—is the likelihood of failure or prohibitive cost in pursuit of key objectives. In this view, some goals are beyond reach. Others are within reach, but the cost of achieving them puts more important ambitions in some jeopardy.2 Unfortunately, those familiar with contemporary strategic-level military decisionmaking know that rational consideration of even the prospect of failure is absent. In high-level policy discussions, success is assumed. From the beginning, Iraq was an experiment in risk taking. To be sure, the war’s advocates saw it as risk mitigation as well—remember ‘smoking guns’ and ‘mushroom clouds,’ for example. However, at its core, toppling Saddam was about balancing the certainty of violent dislocation that accompanies overthrow of an unfavorable but stable status quo against the hope for a more favorable, future post-war political order. It was extension of “the democratic peace” by force—whether or not the forcible export of representative governance was ever a formal casus belli. In this context, Iraq engendered enormous risk from the beginning. There was the ever-present ‘likelihood of failure or prohibitive cost’ that needed to be accounted for in deliberate planning. For example, there were obvious dormant sectarian divisions. Given Saddam’s violent separation of ruler from ruled, this indicated the distinct possibility of uncontrolled civil conflict in the aftermath of the government’s collapse. There was the extant Iraqi overdependence on primary resource exports for government revenues. This, in the developing world (which Iraq rejoined from below in 2003), commonly signals persistent danger to political order. There was a certainty that at least two of Iraq’s neighbors would actively resist through politics, influence, and at times, violence—American success. Still others would be very sympathetic to Iraq’s minority Sunni; if not quite hostile to Shi’a or Kurdish triumph. Others still—likely most—would remain reticent on the issue of Iraq’s democratic success or failure. Finally, there was the precedent of the Soviet Afghan War. In Afghanistan (circa 1979-89), external intervention was a magnet for Muslim anti-colonial resistance. Tribalism, nationalism, and Muslim extremism combined to militate against Soviet success. These same forces join today with internecine sectarianism to similarly check American progress in Iraq. Rational risk assessment in advance of the Iraq intervention would have identified and accounted for all of these. Each, after all—individually or in combination, could be enough to seriously delay favorable outcomes, prevent success, or drive strategic costs to prohibitive levels. Evaluating each seriously, thoughtfully considering their implications, and accounting for them deliberately in strategy development is a sign of wisdom, not fear. Instead, those engineering the Iraq War framed strategic risk incorrectly. They assumed ultimate success—a stable, representative, multifaith polity—would rapidly and naturally occur as a result of the necessary but decidedly intermediate step of overthrowing the existing regime. Thus, in their view, the likelihood for some near-term “harm or loss” was insignificant compared to the anticipated return on the nation’s strategic investment. Their risk calculations simply never went beyond D-Day. It is now well-documented that Iraq policy was made in a strategic vacuum. It appears no vizier-like or mandarin-like class on the inside carefully weighed specific grand strategic options vis-à-vis the United States, Iraq, and the world in detail, calculating different choices and their inherent risks and benefits. There were prescient warnings. It is now clear few were heeded. In short, the risk problem, as it was likely presented to the President, was a strawman. It failed to account comprehensively for the real hazards engendered in deliberate regime destruction, stabilization, and reconstruction in a large, consequential state. Iraq proceeded from risk assessment that in its sophistication went little beyond “nothing ventured nothing gained.” This is a caution for the future. Risk-informed strategy does not indicate risk aversion. Identifying risks and hazards and accounting for their mitigation does not prevent action. Rather, it underwrites success. The bold too often mistake thoughtful consideration of real hazard for weakness. Quite the contrary, deliberate consideration of risk-adjusted choices increases the prospect for bold action’s ultimate success. Riskinformed strategy provides decisionmakers with a realistic accounting of strategic conditions as they are, versus as some would prefer them to be. It proceeds from the conclusion that raw capacity and desire alone do not determine success. It recognizes that our perceptions of our motives and intentions are likely quite different from the perceptions of others. Finally, it demands that strategists account for both the prospect of failure and the progressive accumulation of excessive cost that—without mitigation—might jeopardize long-term success and the security of interests of equal or greater importance. ENDNOTES 1. Riverside, Webster’s II: New College Dictionary, Boston-New York: Houghton Mifflin Company, p. 957. 2. Department of Defense, The National Defense Strategy of the United States, March 18, 2005, p. 11, available at \"www.defenselink.mil/news/Mar2005/d20050318nds1.pdf\" ***** Dave LOL@moveon.org so, you do have a sense of humor? Seriously, that Strategic Studies Institue assessment was pretty intense. I think it was a combination of legal jargon and highly analytical theory, yes? Anyway, thanks for sharing, it is always good to have as much information as possible to help form an opinion, right? PS..I never did care for Rumsfeld, I put him right up there with Polsi. I could do without them.", 
        "intTime": 20090523, 
        "postID": 36, 
        "quote": "Originally posted by Grachus: quote: Originally posted by usa_girl: No offense taken, I am allowed to have my opinion even if it is not to your liking. I did not know congress actually came through with \"every\" amount asked for from Bush, but I am happy to know you say they ended up giving it to him and then some. I actually do remember seeing the floor meetings with the two parties going at it over Iraq and wanting to bring our men and women home. Your memory IMO is so far correct. quote: Originally posted by usa_girl: I am sure you will correct me if I get it wrong..but it was more the Democratic party that had decided we never should have been at war with Iraq, then went on to call war crimes, to suggest Bush be removed from office, and finally to cut off his money as a way to get him to end that war, yes? Some Democrats suggested all of the above. Most Democrats suggested one or another of these acts. No one ever cut off any money. Impeachment (And I regret this) was never seriously on the table - Cutting off funds, even less so. Keep in mind that I can probably find a Republican advocating eating Muslims as a way to solve the World food problems (Perhaps I exagerate here... ) doesn't mean that this represents Republican thinking as a Party. quote: Originally posted by usa_girl: And it was more the Republican party that said, we went into Iraq based on intel from our country and others after being attacked on 9/11, we did not find what we were looking for but took Saddam out anyway who was an evil man, used Iraq as a base thinking Iran would be the big issue and we would have our people both in Afganistan and Irag to cover both sides of Iran, tried to bring freedom to the Iraq people, that ended up being harder than thought but because we did not cut and run when the liberals applied pressure at leeast the vote was a success, but at great cost to America, yes or no? President Bush wanted to invade Iraq long before he was even elected. 9/11 was the excuse. Did he believe Sadaam was an evil man? Sure he did. But there are a lot of evil men in this world. Did he believe that Iraq was an immenent threat to the United States? I doubt that. In fact, HE doubts that. Do I believe that Iraq was part of the WOT? Not a chance. Do I think that taking over Iraq lessened the power of Al Qaeda? I believed it prolonged Al Qaedas life. I believe it strenthed them in every possible way. And I also believe that we have created a new ally for Iran, and although Iran is not a part of the WOT, it does represent a long term threat to us, and we have helped them immensely without it costing them a dime. quote: Originally posted by usa_girl: When they were trying to force Bush in to ending the war on their time table wasn't it that that it was suggested that they would cut off his funds as a way to making him end the war? Some Democrats suggested that. Unfortunately they never came close to having enough votes to do this. quote: Originally posted by usa_girl: You don't remember seeing any of that? You never heard about that plan? I do. It would have been about the same time the media kept doing all the reports on how our men did not have the proper items needed to keep them safe. I think the tanks were a big issue, yes? \"You go to war with the army you have, not the army you want.\" Donald Rumsfeld quote: Originally posted by usa_girl: Was that called a hummer or humd? I don't remember exactly but I do remember watching that covered over and over because I was so upset that the military did not have what they needed to keep them safe. Oh yes, and something about a net you keep in the room while sleeping to protect against a bomb? I am sure I don't have it all exactly right, but that is why I am here to learn. When the US went to war in 1941, factories worked around the clock. I mean this literally. In THIS war, factories worked nine to five. No additional companies were hired. No overtime was suggested. It took more than four years for our troops to get the equipment that the military said we needed. Looked at objectively, this is unbelievable. The military in the form of the head of the Joint Chiefs, said point blank that we needed at least 200,000, better, 500,000 men to safely pacify the country and prevent an insurgency. For his trouble he was forced into retirement. I was against the war from the beginning, but if you're GOING to actually fight a war, don't do it on the cheap. Penny wise and dollar foolish is why we are still there. To my mind it's all academic. Here's a short Editorial from the US Army's own \"Strategic Studies Institute.\" Mind you, not something I grabbed from Moveon dot org... quote: IN DEFENSE OF RATIONAL RISK ASSESSMENT Lieutenant Colonel Nathan Freier Strategic Studies Institute Risk in Webster’s is “the possibility of suffering harm or loss.”1 Risk accompanies both action and inaction. To strategists, it is accounted for and mitigated, but not always or even commonly avoided. To the national security strategist, risk—to paraphrase the current defense strategy—is the likelihood of failure or prohibitive cost in pursuit of key objectives. In this view, some goals are beyond reach. Others are within reach, but the cost of achieving them puts more important ambitions in some jeopardy.2 Unfortunately, those familiar with contemporary strategic-level military decisionmaking know that rational consideration of even the prospect of failure is absent. In high-level policy discussions, success is assumed. From the beginning, Iraq was an experiment in risk taking. To be sure, the war’s advocates saw it as risk mitigation as well—remember ‘smoking guns’ and ‘mushroom clouds,’ for example. However, at its core, toppling Saddam was about balancing the certainty of violent dislocation that accompanies overthrow of an unfavorable but stable status quo against the hope for a more favorable, future post-war political order. It was extension of “the democratic peace” by force—whether or not the forcible export of representative governance was ever a formal casus belli. In this context, Iraq engendered enormous risk from the beginning. There was the ever-present ‘likelihood of failure or prohibitive cost’ that needed to be accounted for in deliberate planning. For example, there were obvious dormant sectarian divisions. Given Saddam’s violent separation of ruler from ruled, this indicated the distinct possibility of uncontrolled civil conflict in the aftermath of the government’s collapse. There was the extant Iraqi overdependence on primary resource exports for government revenues. This, in the developing world (which Iraq rejoined from below in 2003), commonly signals persistent danger to political order. There was a certainty that at least two of Iraq’s neighbors would actively resist through politics, influence, and at times, violence—American success. Still others would be very sympathetic to Iraq’s minority Sunni; if not quite hostile to Shi’a or Kurdish triumph. Others still—likely most—would remain reticent on the issue of Iraq’s democratic success or failure. Finally, there was the precedent of the Soviet Afghan War. In Afghanistan (circa 1979-89), external intervention was a magnet for Muslim anti-colonial resistance. Tribalism, nationalism, and Muslim extremism combined to militate against Soviet success. These same forces join today with internecine sectarianism to similarly check American progress in Iraq. Rational risk assessment in advance of the Iraq intervention would have identified and accounted for all of these. Each, after all—individually or in combination, could be enough to seriously delay favorable outcomes, prevent success, or drive strategic costs to prohibitive levels. Evaluating each seriously, thoughtfully considering their implications, and accounting for them deliberately in strategy development is a sign of wisdom, not fear. Instead, those engineering the Iraq War framed strategic risk incorrectly. They assumed ultimate success—a stable, representative, multifaith polity—would rapidly and naturally occur as a result of the necessary but decidedly intermediate step of overthrowing the existing regime. Thus, in their view, the likelihood for some near-term “harm or loss” was insignificant compared to the anticipated return on the nation’s strategic investment. Their risk calculations simply never went beyond D-Day. It is now well-documented that Iraq policy was made in a strategic vacuum. It appears no vizier-like or mandarin-like class on the inside carefully weighed specific grand strategic options vis-à-vis the United States, Iraq, and the world in detail, calculating different choices and their inherent risks and benefits. There were prescient warnings. It is now clear few were heeded. In short, the risk problem, as it was likely presented to the President, was a strawman. It failed to account comprehensively for the real hazards engendered in deliberate regime destruction, stabilization, and reconstruction in a large, consequential state. Iraq proceeded from risk assessment that in its sophistication went little beyond “nothing ventured nothing gained.” This is a caution for the future. Risk-informed strategy does not indicate risk aversion. Identifying risks and hazards and accounting for their mitigation does not prevent action. Rather, it underwrites success. The bold too often mistake thoughtful consideration of real hazard for weakness. Quite the contrary, deliberate consideration of risk-adjusted choices increases the prospect for bold action’s ultimate success. Riskinformed strategy provides decisionmakers with a realistic accounting of strategic conditions as they are, versus as some would prefer them to be. It proceeds from the conclusion that raw capacity and desire alone do not determine success. It recognizes that our perceptions of our motives and intentions are likely quite different from the perceptions of others. Finally, it demands that strategists account for both the prospect of failure and the progressive accumulation of excessive cost that—without mitigation—might jeopardize long-term success and the security of interests of equal or greater importance. ENDNOTES 1. Riverside, Webster’s II: New College Dictionary, Boston-New York: Houghton Mifflin Company, p. 957. 2. Department of Defense, The National Defense Strategy of the United States, March 18, 2005, p. 11, available at \"www.defenselink.mil/news/Mar2005/d20050318nds1.pdf\" ***** Dave", 
        "reply": " LOL@moveon.org so, you do have a sense of humor? Seriously, that Strategic Studies Institue assessment was pretty intense. I think it was a combination of legal jargon and highly analytical theory, yes? Anyway, thanks for sharing, it is always good to have as much information as possible to help form an opinion, right? PS..I never did care for Rumsfeld, I put him right up there with Polsi. I could do without them.", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 11:35:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: \"You go to war with the army you have, not the army you want.\" Donald Rumsfeld Absolutely the dumbest thing ever said by anyone in the Bush administration. I love the fact that up-armored HUMVEEs showed up just weeks afterwards and MRAPs went into full scale production shortly afterwards as well. Firing him right after the 2006 elections was the coup-de-grais. One of the reasons I will always despise the Bush administration was because of the way they protected a crony like Rumsfeld. He may not have been the worst SecDef ever, but he's certainly in the top 3.", 
        "intTime": 20090523, 
        "postID": 37, 
        "quote": "Originally posted by usa_girl: \"You go to war with the army you have, not the army you want.\" Donald Rumsfeld", 
        "reply": " Absolutely the dumbest thing ever said by anyone in the Bush administration. I love the fact that up-armored HUMVEEs showed up just weeks afterwards and MRAPs went into full scale production shortly afterwards as well. Firing him right after the 2006 elections was the coup-de-grais. One of the reasons I will always despise the Bush administration was because of the way they protected a crony like Rumsfeld. He may not have been the worst SecDef ever, but he's certainly in the top 3.", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 11:43:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: LOL@moveon.org so, you do have a sense of humor? Seriously, that Strategic Studies Institue assessment was pretty intense. I think it was a combination of legal jargon and highly analytical theory, yes? Anyway, thanks for sharing, it is always good to have as much information as possible to help form an opinion, right? PS..I never did care for Rumsfeld, I put him right up there with Polsi. I could do without them. The US Army cannot afford to be a flunky for whomever is in power. They maintain the institute to provide our military leaders with objective facts so that at least military decsions are objective. Here's a link to their site. \"http://www.strategicstudiesinstitute.army.mil/\" Another interesting source of objective information is The Counter Terrorism School at West Point... \"http://www.ctc.usma.edu/default.asp\" You can find translations of actual terrorist doctrines and plans. As for me having a sense of humour? Not a chance. Any post that contains humor has been sneaked in by my so called dog. I was told you can't trust this breed, and those who told me this was right... Dave", 
        "intTime": 20090523, 
        "postID": 38, 
        "quote": "Originally posted by usa_girl: LOL@moveon.org so, you do have a sense of humor? Seriously, that Strategic Studies Institue assessment was pretty intense. I think it was a combination of legal jargon and highly analytical theory, yes? Anyway, thanks for sharing, it is always good to have as much information as possible to help form an opinion, right? PS..I never did care for Rumsfeld, I put him right up there with Polsi. I could do without them.", 
        "reply": " The US Army cannot afford to be a flunky for whomever is in power. They maintain the institute to provide our military leaders with objective facts so that at least military decsions are objective. Here's a link to their site. \"http://www.strategicstudiesinstitute.army.mil/\" Another interesting source of objective information is The Counter Terrorism School at West Point... \"http://www.ctc.usma.edu/default.asp\" You can find translations of actual terrorist doctrines and plans. As for me having a sense of humour? Not a chance. Any post that contains humor has been sneaked in by my so called dog. I was told you can't trust this breed, and those who told me this was right... Dave", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 11:53:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "Grachus"
    }, 
    {
        "content": "one more thing... with regard to evil men in the world... true saddam was not the only evil man in the world, but shouldn't the guy in charge of the country at that time get to pick his battles and evil men to weed out? Kennedy took on Fidel Castro with the Bay of Pigs Invsion. Lyndon Johnson tried to finishe what Kennedy had started in Vietnam and took on Ho Chi Minh of North Vietnam. Not sure what Carter did if anything. Reagon takes on the evil empire of russia. Bush Sr went after Saddam with the Gulf War Clinton took on Milosevic and Yugoslavia and Saddam in Iraq in Bush Jr goes after terrorist Bin Laden, Saddam and Al Queda in Afganistan and Iraq Obama is taking on the Taliban in Afganistan and has put Pakistan on warning. Bono and gang wants us to get in Africa Clooney and gang wants us in Darfur and last night I see the girl mia on Bill Maher wanting usa to get in the middle of what is going on in Sri Lanka What next????", 
        "intTime": 20090523, 
        "postID": 39, 
        "quote": "", 
        "reply": "one more thing... with regard to evil men in the world... true saddam was not the only evil man in the world, but shouldn't the guy in charge of the country at that time get to pick his battles and evil men to weed out? Kennedy took on Fidel Castro with the Bay of Pigs Invsion. Lyndon Johnson tried to finishe what Kennedy had started in Vietnam and took on Ho Chi Minh of North Vietnam. Not sure what Carter did if anything. Reagon takes on the evil empire of russia. Bush Sr went after Saddam with the Gulf War Clinton took on Milosevic and Yugoslavia and Saddam in Iraq in Bush Jr goes after terrorist Bin Laden, Saddam and Al Queda in Afganistan and Iraq Obama is taking on the Taliban in Afganistan and has put Pakistan on warning. Bono and gang wants us to get in Africa Clooney and gang wants us in Darfur and last night I see the girl mia on Bill Maher wanting usa to get in the middle of what is going on in Sri Lanka What next????", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 12:19:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "usa_girl"
    }, 
    {
        "content": "quote: Originally posted by usa_girl: one more thing... with regard to evil men in the world... true saddam was not the only evil man in the world, but shouldn't the guy in charge of the country at that time get to pick his battles and evil men to weed out? Kennedy took on Fidel Castro with the Bay of Pigs Invsion. Lyndon Johnson tried to finishe what Kennedy had started in Vietnam and took on Ho Chi Minh of North Vietnam. Not sure what Carter did if anything. Reagon takes on the evil empire of russia. Bush Sr went after Saddam with the Gulf War Clinton took on Milosevic and Yugoslavia and Saddam in Iraq in Bush Jr goes after terrorist Bin Laden, Saddam and Al Queda in Afganistan and Iraq Obama is taking on the Taliban in Afganistan and has put Pakistan on warning. Bono and gang wants us to get in Africa Clooney and gang wants us in Darfur and last night I see the girl mia on Bill Maher wanting usa to get in the middle of what is going on in Sri Lanka What next???? In answer to your first question...NO! Our military is not here to be used as some kind of moral tool an administration can send into harms way at the whim of a CinC based on this ideology of choice! Unfortunately you are correct for the most part with your summation of recent history but that doesn't make it right. The criteria for executing military action should IMHO always be \"clear and present danger\".", 
        "intTime": 20090523, 
        "postID": 40, 
        "quote": "Originally posted by usa_girl: one more thing... with regard to evil men in the world... true saddam was not the only evil man in the world, but shouldn't the guy in charge of the country at that time get to pick his battles and evil men to weed out? Kennedy took on Fidel Castro with the Bay of Pigs Invsion. Lyndon Johnson tried to finishe what Kennedy had started in Vietnam and took on Ho Chi Minh of North Vietnam. Not sure what Carter did if anything. Reagon takes on the evil empire of russia. Bush Sr went after Saddam with the Gulf War Clinton took on Milosevic and Yugoslavia and Saddam in Iraq in Bush Jr goes after terrorist Bin Laden, Saddam and Al Queda in Afganistan and Iraq Obama is taking on the Taliban in Afganistan and has put Pakistan on warning. Bono and gang wants us to get in Africa Clooney and gang wants us in Darfur and last night I see the girl mia on Bill Maher wanting usa to get in the middle of what is going on in Sri Lanka What next????", 
        "reply": " In answer to your first question...NO! Our military is not here to be used as some kind of moral tool an administration can send into harms way at the whim of a CinC based on this ideology of choice! Unfortunately you are correct for the most part with your summation of recent history but that doesn't make it right. The criteria for executing military action should IMHO always be \"clear and present danger\".", 
        "threadID": "672198221_1140020422001", 
        "time": "2009-05-23 12:24:00", 
        "title": "Obamas Commencement Address to the Military - One of the Great speeches!", 
        "userID": "Ol_Doc"
    }
]