[
    {
        "content": "\"http://thehill.com/leading-the-news/obama-calls-for-pay-go-rule-2009-04-25.html\" quote: President Obama used his Saturday radio address to call for a renewed commitment to fiscal discipline, arguing the economic crisis was not an excuse for wasteful spending. Obama urged Congress to pass so-called \"pay-go\" spending rules and announced the creation of new incentives for cost savings. “It’s time to fundamentally change the way that we do business in Washington,” Obama said in his weekly address. “To help build a new foundation for the 21st century, we need to reform our government so that it is more efficient, more transparent, and more creative.” Pay-go rules require all new spending to be accompanied by either equivalent cuts or revenue enhancements. For those of you who were hoping for tax code reform, pay-go rules will block reform for years to come. The argument will be that changing the tax code to a \"flat tax\" or \"fair tax\" will effect the revenue stream in unknown ways. Besides, all pay-go rules do is say it is ok to spend what you have been spending, just cut back in other areas so you can increase spending in the areas that you want. That is not the way to run a household, let alone a country.", 
        "intTime": 20090426, 
        "postID": 1, 
        "quote": "President Obama used his Saturday radio address to call for a renewed commitment to fiscal discipline, arguing the economic crisis was not an excuse for wasteful spending. Obama urged Congress to pass so-called \"pay-go\" spending rules and announced the creation of new incentives for cost savings. “It’s time to fundamentally change the way that we do business in Washington,” Obama said in his weekly address. “To help build a new foundation for the 21st century, we need to reform our government so that it is more efficient, more transparent, and more creative.” Pay-go rules require all new spending to be accompanied by either equivalent cuts or revenue enhancements.", 
        "reply": "\"http://thehill.com/leading-the-news/obama-calls-for-pay-go-rule-2009-04-25.html\"  For those of you who were hoping for tax code reform, pay-go rules will block reform for years to come. The argument will be that changing the tax code to a \"flat tax\" or \"fair tax\" will effect the revenue stream in unknown ways. Besides, all pay-go rules do is say it is ok to spend what you have been spending, just cut back in other areas so you can increase spending in the areas that you want. That is not the way to run a household, let alone a country.", 
        "threadID": "672198221_2700028122001", 
        "time": "2009-04-26 08:48:00", 
        "title": "Obama calls for pay-go rule", 
        "userID": "stec74"
    }, 
    {
        "content": "Thanks stec! Question is what programs will be \"cut\"? The billions for ACORN? Nope! The US Military in order to fund his \"National Civilian Security Force\" that is \"\"Bigger and better and well-funded more than the US Military\" For those words use YouTube...then type \"Obama's National Civilian Security Force\" OR simply on YouTube type \"Obamas Civilian Force\" Oh yes, read the comments beneath that 20 second YouTube Video. Thanks! Signed...Agent 99!", 
        "intTime": 20090426, 
        "postID": 2, 
        "quote": "", 
        "reply": "Thanks stec! Question is what programs will be \"cut\"? The billions for ACORN? Nope! The US Military in order to fund his \"National Civilian Security Force\" that is \"\"Bigger and better and well-funded more than the US Military\" For those words use YouTube...then type \"Obama's National Civilian Security Force\" OR simply on YouTube type \"Obamas Civilian Force\" Oh yes, read the comments beneath that 20 second YouTube Video. Thanks! Signed...Agent 99!", 
        "threadID": "672198221_2700028122001", 
        "time": "2009-04-26 09:49:00", 
        "title": "Obama calls for pay-go rule", 
        "userID": "Agent991"
    }, 
    {
        "content": "\"http://www.youtube.com/watch?v=Tt2yGzHfy7s\" Here ya go. The actual quote is \"We cannot continue to rely on our military in order to achieve the national security objectives we've set. We've got to have a civilian national security force that's just as powerful, just as strong, just as well-funded.\"", 
        "intTime": 20090426, 
        "postID": 3, 
        "quote": "", 
        "reply": "\"http://www.youtube.com/watch?v=Tt2yGzHfy7s\" Here ya go. The actual quote is \"We cannot continue to rely on our military in order to achieve the national security objectives we've set. We've got to have a civilian national security force that's just as powerful, just as strong, just as well-funded.\"", 
        "threadID": "672198221_2700028122001", 
        "time": "2009-04-26 09:52:00", 
        "title": "Obama calls for pay-go rule", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by Agent991: \"http://www.youtube.com/watch?v=Tt2yGzHfy7s\" Here ya go. The actual quote is \"We cannot continue to rely on our military in order to achieve the national security objectives we've set. We've got to have a civilian national security force that's just as powerful, just as strong, just as well-funded.\" All Of Obamas calls for civilians, is to particpate in volunteer organisations like Americal, VISTA, etc, etc. Only in the paranoid world of far right politics is this some sort of State Security apparatus. Can anyone point to a concrete Bill in Congress for such an aparatus? Well, here is your fantasy in reality - Co-sponsonered by Orrin Hatch... quote: Obama Inks National Service Act By Carolyn Shanahan | Apr 23 2009 Flanked by members of Congress, President Obama signed a $5.7 billion national service bill into law on Tuesday. The Edward M. Kennedy Serve America Act, a collaboration effort of Sen. Edward Kennedy (D-Mass.) and Sen. Orrin Hatch (R-Utah), will increase government support for service, allocating $5.7 billion to service organizations from fiscal year 2010 to fiscal year 2014. It will expand AmeriCorps opportunities from 75,000 to 250,000 slots nationwide and further establish four new service groups: a Clean Energy Service Corps, an Education Corps, a Healthy Futures Corps and a Veteran Service Corps. Before signing the bill, Obama delivered remarks to an audience that included first lady Michelle Obama, former Secretary of State Colin Powell, former President Bill Clinton, Vice President Joe Biden, former first lady Rosalynn Carter and various congressional representatives. In his address, Obama emphasized the importance of groups like AmeriCorps, a national program that organizes volunteers to support a variety of non-profits working in the areas of health services, park cleanup and the tutoring of underprivileged children, in effecting critical social change. “Programs like [AmeriCorps] are a force multiplier; they leverage small numbers of members into thousands of volunteers. And we will focus their service into solving today’s most pressing challenges: clean energy, energy efficiency, health care, education, economic opportunity, veterans and military families,” Obama said. \"http://www.thehoya.com/node/18900\" Not a chance - It's just a paranoid talking point. Dave", 
        "intTime": 20090426, 
        "postID": 4, 
        "quote": "Originally posted by Agent991: \"http://www.youtube.com/watch?v=Tt2yGzHfy7s\" Here ya go. The actual quote is \"We cannot continue to rely on our military in order to achieve the national security objectives we've set. We've got to have a civilian national security force that's just as powerful, just as strong, just as well-funded.\"", 
        "reply": " All Of Obamas calls for civilians, is to particpate in volunteer organisations like Americal, VISTA, etc, etc. Only in the paranoid world of far right politics is this some sort of State Security apparatus. Can anyone point to a concrete Bill in Congress for such an aparatus? Well, here is your fantasy in reality - Co-sponsonered by Orrin Hatch... quote: Obama Inks National Service Act By Carolyn Shanahan | Apr 23 2009 Flanked by members of Congress, President Obama signed a $5.7 billion national service bill into law on Tuesday. The Edward M. Kennedy Serve America Act, a collaboration effort of Sen. Edward Kennedy (D-Mass.) and Sen. Orrin Hatch (R-Utah), will increase government support for service, allocating $5.7 billion to service organizations from fiscal year 2010 to fiscal year 2014. It will expand AmeriCorps opportunities from 75,000 to 250,000 slots nationwide and further establish four new service groups: a Clean Energy Service Corps, an Education Corps, a Healthy Futures Corps and a Veteran Service Corps. Before signing the bill, Obama delivered remarks to an audience that included first lady Michelle Obama, former Secretary of State Colin Powell, former President Bill Clinton, Vice President Joe Biden, former first lady Rosalynn Carter and various congressional representatives. In his address, Obama emphasized the importance of groups like AmeriCorps, a national program that organizes volunteers to support a variety of non-profits working in the areas of health services, park cleanup and the tutoring of underprivileged children, in effecting critical social change. “Programs like [AmeriCorps] are a force multiplier; they leverage small numbers of members into thousands of volunteers. And we will focus their service into solving today’s most pressing challenges: clean energy, energy efficiency, health care, education, economic opportunity, veterans and military families,” Obama said. \"http://www.thehoya.com/node/18900\" Not a chance - It's just a paranoid talking point. Dave", 
        "threadID": "672198221_2700028122001", 
        "time": "2009-04-26 11:12:00", 
        "title": "Obama calls for pay-go rule", 
        "userID": "Grachus"
    }, 
    {
        "content": "Do I get to keep my same pay grade in the civil security force as I did in the active military? BTW, good job taking the entire speech out of context. There are Civil Police Forces and so on...all the agencies that are not military etc etc etc", 
        "intTime": 20090426, 
        "postID": 5, 
        "quote": "", 
        "reply": "Do I get to keep my same pay grade in the civil security force as I did in the active military? BTW, good job taking the entire speech out of context. There are Civil Police Forces and so on...all the agencies that are not military etc etc etc", 
        "threadID": "672198221_2700028122001", 
        "time": "2009-04-26 11:13:00", 
        "title": "Obama calls for pay-go rule", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "howdy", 
        "intTime": 20090426, 
        "postID": 6, 
        "quote": "", 
        "reply": "howdy", 
        "threadID": "672198221_2700028122001", 
        "time": "2009-04-26 11:28:00", 
        "title": "Obama calls for pay-go rule", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Besides, all pay-go rules do is say it is ok to spend what you have been spending, just cut back in other areas so you can increase spending in the areas that you want. That is not the way to run a household, let alone a country. Why do you make that sound like such a terrible concept? Obviously things have to be reviewed. Get rid of the watse, put things in that work. Sounds good to me. Lets start with over - inflated wages and perks for ALL G employees including Senators and Congressmen (leave the mil and vets alone) and put all the money saved from there back in jobs and health care reform for the entire nation. That would pay for practically everything But of course, Being the inventor of and starting a Corporate Bank Bailout fund was the right direction uh? As for the tax \"The argument will be that changing the tax code to a \"flat tax\" or \"fair tax\" will effect the revenue stream in unknown ways.\" Are you saying the current system effects the revenue stream in known ways? Are you saying our current system is such a great way to save money and is streamlined??? FairTax = Jobs Jobs Jobs Anything else is meager to this fact. Without jobs, the only thing future Americans will be doing to each other is begging borrowing and stealing off their neighbor to just eat and live.", 
        "intTime": 20090426, 
        "postID": 7, 
        "quote": "Besides, all pay-go rules do is say it is ok to spend what you have been spending, just cut back in other areas so you can increase spending in the areas that you want. That is not the way to run a household, let alone a country.", 
        "reply": " Why do you make that sound like such a terrible concept? Obviously things have to be reviewed. Get rid of the watse, put things in that work. Sounds good to me. Lets start with over - inflated wages and perks for ALL G employees including Senators and Congressmen (leave the mil and vets alone) and put all the money saved from there back in jobs and health care reform for the entire nation. That would pay for practically everything But of course, Being the inventor of and starting a Corporate Bank Bailout fund was the right direction uh? As for the tax \"The argument will be that changing the tax code to a \"flat tax\" or \"fair tax\" will effect the revenue stream in unknown ways.\" Are you saying the current system effects the revenue stream in known ways? Are you saying our current system is such a great way to save money and is streamlined??? FairTax = Jobs Jobs Jobs Anything else is meager to this fact. Without jobs, the only thing future Americans will be doing to each other is begging borrowing and stealing off their neighbor to just eat and live.", 
        "threadID": "672198221_2700028122001", 
        "time": "2009-04-26 11:31:00", 
        "title": "Obama calls for pay-go rule", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Besides, all pay-go rules do is say it is ok to spend what you have been spending, just cut back in other areas so you can increase spending in the areas that you want. That is not the way to run a household, let alone a country. Why do you make that sound like such a terrible concept? Obviously things have to be reviewed. Get rid of the watse, put things in that work. Sounds good to me. Lets start with over - inflated wages and perks for ALL G employees including Senators and Congressmen (leave the mil and vets alone) and put all the money saved from there back in jobs and health care reform for the entire nation. That would pay for practically everything But of course, Being the inventor of and starting a Corporate Bank Bailout fund was the right direction uh? As for the tax \"The argument will be that changing the tax code to a \"flat tax\" or \"fair tax\" will effect the revenue stream in unknown ways.\" Are you saying the current system effects the revenue stream in known ways? Are you saying our current system is such a great way to save money and is streamlined??? FairTax = Jobs Jobs Jobs Anything else is meager to this fact. Without jobs, the only thing future Americans will be doing to each other is begging borrowing and stealing off their neighbor to just eat and live. I agree with cutting waste. But implementing pay-go doesn't mean that is what is going to happen and if it does happen it is to fund a new expenditure. Why not cut wasteful spending because it is wasteful, not because you want to spend the money elsewhere? Plus, if Congress doesn't want to take the time to find government waste, raising taxes is an acceptable solution under pay-go rules. I think a fair tax or flat tax are much better alternatives to what we have right now. But, you know that Congress as it is currently populated will never even think about either alternative. All pay-go does is give them one more excuse to keep these tax proposals on the shelf collecting dust.", 
        "intTime": 20090426, 
        "postID": 8, 
        "quote": "Originally posted by crackerjacks61: quote: Besides, all pay-go rules do is say it is ok to spend what you have been spending, just cut back in other areas so you can increase spending in the areas that you want. That is not the way to run a household, let alone a country. Why do you make that sound like such a terrible concept? Obviously things have to be reviewed. Get rid of the watse, put things in that work. Sounds good to me. Lets start with over - inflated wages and perks for ALL G employees including Senators and Congressmen (leave the mil and vets alone) and put all the money saved from there back in jobs and health care reform for the entire nation. That would pay for practically everything But of course, Being the inventor of and starting a Corporate Bank Bailout fund was the right direction uh? As for the tax \"The argument will be that changing the tax code to a \"flat tax\" or \"fair tax\" will effect the revenue stream in unknown ways.\" Are you saying the current system effects the revenue stream in known ways? Are you saying our current system is such a great way to save money and is streamlined??? FairTax = Jobs Jobs Jobs Anything else is meager to this fact. Without jobs, the only thing future Americans will be doing to each other is begging borrowing and stealing off their neighbor to just eat and live.", 
        "reply": " I agree with cutting waste. But implementing pay-go doesn't mean that is what is going to happen and if it does happen it is to fund a new expenditure. Why not cut wasteful spending because it is wasteful, not because you want to spend the money elsewhere? Plus, if Congress doesn't want to take the time to find government waste, raising taxes is an acceptable solution under pay-go rules. I think a fair tax or flat tax are much better alternatives to what we have right now. But, you know that Congress as it is currently populated will never even think about either alternative. All pay-go does is give them one more excuse to keep these tax proposals on the shelf collecting dust.", 
        "threadID": "672198221_2700028122001", 
        "time": "2009-04-26 12:20:00", 
        "title": "Obama calls for pay-go rule", 
        "userID": "stec74"
    }
]