[
    {
        "content": "The comparison of the violence in Chicago to the violence in Iraq by bushies who think that “we won” in Iraq is ridicules. For the month of April. 2009: Number of bombings in Chicago – 0 Number of bombings in Iraq – too many to count. Number of people killed by bombs – too many to count Number of suicide bombings in Chicago – 0 Number of suicide in Iraq – eight. Number of people killed by suicide bombs – more than 200 Number of people killed by mortar attacks in Chicago – 0 Number of people killed by mortar attacks in Baghdad – 4. Number of police officers murdered in Chicago – 0 Number of police officers murdered in Iraq – too many to count. Number of violent attacks on government officials in Chicago – 0 Number of violent attacks on government officials in Chicago – too many to count Number of power stations sabotaged in Chicago – 0 Number of power stations sabotaged in Iraq – 1 The violence in Iraq is increasing, because the mission of the “surge” strategy was to decrease the violence, not to do anything about the causes of the violence. The insurgency and al Qaeda are still very active in Iraq. Here is the security report of just the last six days in Iraq. Yusufiya: #1: Gunmen opened fire on a government-backed Sunni Arab militia checkpoint in Yusufiya, 20 km (12 miles) south of Baghdad, wounding one fighter, early on Saturday, police said. Kut: #1: The decomposed body of a young man was found inside his house in central al-Kut city on Friday, a security source said. “The body showed signs of having been shot. It decayed after remaining for a long time on the roof,” he added. Kirkuk: #1: Iraqi police say a roadside bomb has killed at least three people near the northern city of Kirkuk. The victims are civilians who were traveling about 20 miles (32 kilometers) south of the ethnically mixed city. Police Brig. Gen. Sarhad Qadir says the blast hit a car and cement mixer. Three construction workers were killed and two injured in a bomb blast in Iraq's northern province of Kirkuk Saturday, police said. 'A bomb struck a car carrying builders on a road in Taz-Touz Khormato district,' senior police officer Fekrat Rachid told the German Press Agency dpa. Sulaimaniyah: #1: Iranian helicopters attacked three Iraqi Kurdish villages in a pre-dawn raid on Saturday, a senior border guard official said, the first time Iran has used aircraft against Kurdish rebels. There were no immediate reports of casualties.\"At 4 am (0100 GMT) they attacked with artillery the villages of Kani Saif, Jomarasi and Kara Sozi, that belong to the Panjwin district,\" a senior Iraqi border guard official told AFP on condition of anonymity. \"After the attacks at 9 am three Iranian helicopters attacked these areas again,\" he said. \"This is the first time they have used helicopters.\" Mosul: #1: Five civilians were killed and six others wounded in a suicide blast inside a casino in northern Mosul city on Friday, police said. “A suicide bomber with an explosive belt attacked the al-Shiraa casino in the tourist area of Sadd al-Mosul, (40 km) northern Mosul, killing five civilians and wounding six others,” a security source from Ninewa police told Aswat al-Iraq news agency. Baghdad: #1: Around 7:30 p.m. a roadside bomb detonated in Binouk neighborhood in eastern Baghdad on Thursday. Three people were injured. #2: Around 8:30 p.m. a roadside bomb detonated in New Baghdad neighborhood in eastern Baghdad on Thursday. Four people were wounded. Wasit Prv: #1: Unidentified gunmen have destroyed a power station feeding the Ahdab oil field which a Chinese firm is developing. A provincial official, refusing to be named said: “Installations belonging to an important oil field have been subjected to a terrorist attack from unidentified gunmen. Amarra: #1: Two U.S. soldiers were killed by sniper bullets in the city of al-Amara on Thursday, said a security source from the Missan province police. “The two U.S. soldiers were killed when their patrol came under sniper fire in central Amara,” the source told Aswat al-Iraq news agency. Basra: #1: Five security personnel were wounded when an improvised explosive device (IED) went off in central Basra on Friday, an official security source from the city’s police said. “The five bomb squad personnel were wounded while trying to defuse a charge planted near a fuel station in al-Muftiya, central Basra,” the source told Aswat al-Iraq news agency. Tikrit: #1: Joint U.S.-Iraqi forces Friday killed a policeman and one of his relatives in central Tikrit, a police source said. “A joint force of Iraqi and U.S. personnel raided a house in al-Zuhour neighborhood in central Tikrit on the wee small hours of Friday (May 1) and killed Emad Soliman, a policeman, and his cousin who is working with the Sahwa forces,” the source told Aswat al-Iraq news agency. Mosul: #1: Unknown gunmen killed an Iraqi soldier in eastern Mosul, according to a security source on Friday. “Unknown armed men on Thursday night (April 30) killed a soldier near his house in al-Zahraa neighborhood in eastern Mosul,” the source told Aswat al-Iraq news agency. #2: A roadside bomb targeted an American patrol in Mosul AlJadida (New Mosul) neighborhood in western Mosul on Wednesday night. No casualties reported. #3: Gunmen killed an Iraqi soldier in front of his house in Zahraa neighborhood in east Mosul on Thursday afternoon. #4: Gunmen killed a guard of the KDP (Kurdstan Democratic Party) near one of the party’s headquarters in Faisaliyah neighborhood in eastern Mosul in the evening. Tal Afar: #1: Policemen found the bodies of three brothers west of the city of Mosul on Thursday, a security source in Ninewa said. “The bodies were found shot inside their vehicle in Tal Abta area, Talafar district, (60 km) west of Mosul,” the source told Aswat al-Iraq news agency. Al Anbar Prv: The two U.S. Marines and one sailor were killed Thursday while conducting combat operations in Anbar province, said a military statement. Anbar is a former insurgent stronghold that has been relatively calm since Sunni tribal leaders turned against al-Qaida in Iraq. Ramadi: #1: Four unidentified decomposed bodies were found near al-Ramadi Hospital west of the city, according to a security source in al-Anbar province on Thursday. “The bodies were found buried near al-Ramadi Public Hospital, west of the city. They were found after a terrorist was arrested and confessed to the place where these bodies were buried,” the source told Aswat al-Iraq news agency. Baghdad: #1: Five people were killed and five were wounded by a roadside bomb in Hor Rijab, a village on the southwestern outskirts of Baghdad. #2: A roadside bomb wounded five civilians in the Shurta district of southwestern Baghdad, police said. #3: Two bombs placed in parked cars killed two people and wounded eight others near a Shi'ite mosque in the Hurriya district of northwestern Baghdad, police said. #4: Around 7 p.m. a roadside bomb targeted an American patrol in Khadraa neighborhood in western Baghdad on Wednesday. No casualties reported. #5: A roadside bomb wounded three civilians in the Karrada district of central Baghdad, police said. Diyala Prv: #1: Three Iraqi soldiers were killed on patrol and two others wounded when two roadside bombs went off in Himreen area of northeastern Diyala province, police said. Kut: #1: Two policemen on Wednesday were killed and five men, including an Iranian, were wounded in a road accident in Kut city, according to a local security source. “A police vehicle collided with a bus carrying Iranian visitors at the northern entrance to Kut city,” the source told Aswat al-Iraq new agency. Abu Ghraib: #1: A roadside bomb wounded three civilians in Abu Ghraib, on the western outskirts of Baghdad, police said. Mosul: #1: Two separate roadside bombs in southern Mosul, 390 km (240 miles) north of Baghdad, killed one policeman and wounded five civilians, police said. #2: Two civilians were wounded by a roadside bomb in eastern Mosul, police said. #3: A roadside bomb in the south of Mosul, 390 km (240 miles) north of Baghdad, targeted a police patrol, wounding two policemen, police said. Northern Iraq: #1: Turkey's military said it had launched air strikes against suspected Kurdistan Workers Party (PKK) bases in northern Iraq overnight and on Thursday. No further details were immediately available. Fallujah: #1: Four bodyguards of the Islamic party in Falluja were wounded on Thursday in a bomb explosion in the south of the city, a source from the party said. “An improvised explosive device went off on Thursday (April 30) targeting the motorcade of a senior official of the Islamic party in Nezal neighborhood in the south of Falluja, injuring four of his bodyguards,” the source told Aswat al-Iraq news agency. “The explosion also damaged his vehicle,” he added. Baghdad: #1: Clashes erupted today between an Iraqi army force and guards of a building belongs to the Trade Ministry, eyewitnesses said on Wednesday, with no word on casualties. “The clashes broke out on Wednesday morning (April 29) when the Iraqi army force attempted to arrest one of the Ministry’s employees in the building,” eyewitnesses told Aswat al-Iraq news agency by phone. “Clashes stooped shortly after that, a matter that allowed evacuating other employees from the building,” another eyewitness said. #2: In three separate incidents the Iraqi Security Forces detonated under control three parked car bombs in Abu Disheer and Hay al Mualimeen in southern Baghdad, and in Amil neighbourhood in southwestern Baghdad Wednesday morning. #3: A roadside bomb targeted a U.S. military convoy in Shaab neighbourhood, northern Baghdad at 3 p.m. Tuesday. No casualties were reported. #4: Iraqi police say two car bombs have killed at least 17 people in Baghdad's Shiite district of Sadr City. The blasts went off in quick succession Wednesday from parked cars filled with explosives. A police official says at least 17 people were killed and nearly 50 wounded. The toll from twin car bomb blasts on Wednesday in a busy market in Baghdad jumped to 41 killed and 68 wounded, Iraqi police said. Diyala Prv: Baquba: #1: A roadside bomb on Tuesday went off targeting a U.S. patrol in Baaquba suburb, said a security source from Diala, while the province’s police commander said that a wanted woman was arrested south of Baaquba. “The roadside bomb went off in central Baaquba while a U.S. patrol was passing by,” the source told Aswat al-Iraq news agency. “One of the patrol’s vehicles was heavily damaged,” he said. The source did not mention anything about casualties, while U.S. forces have not yet commented on the incident. Kirkuk: #1: A US-Iraqi patrol has been ambushed while distributing grants to Iraqi businesses near the northern city of Kirkuk, the American military said Wednesday. Iraqi officials said two civilians were killed when the Americans returned fire, but the US military said those killed were enemy fighters. US spokesman Maj. Derrick Cheng said several people launched grenades and began shooting Wednesday as the patrol was handing out micro-grant money to stimulate small businesses in the town of Riyadh. He said reports indicate \"two enemy killed and one wounded,\" and one American was also wounded. Mosul: #1: Gunmen, on foot, attacked and killed a civilian while he was shopping in al Zinjeeli commercial centre in western Mosul, Tuesday morning. Early investigations showed that he was the father of two policemen. #2: A roadside bomb targeted a police patrol in Qahira neighbourhood, downtown Mosul Tuesday injuring three policemen. #3: A roadside bomb targeted a police patrol in New Mosul at 8 a.m. Wednesday injuring two policemen. Baghdad: #1: Sunday A roadside bomb targeted a national police patrol in Dora neighborhood in southern Baghdad around 9:30 p.m. One policeman was killed and another one was wounded. #2: The director general of Basra’s police department on Monday survived an assassination attempt when an explosive device targeted his vehicle in Baghdad, according to a media chief. “Today, an improvised explosive device (IED) targeted Basra’s police chief, Staff Maj. Gen. Adel Kamel Raham, in Jaraf al-Nadaf area, southeastern Baghdad,” Col. Abdulkareem al-Zaydi told Aswat al-Iraq news agency.The explosion caused damage to the official’s vehicle, but no casualties were reported, Zaydi added. #3: Gunmen threw a grenade on a police patrol beneath the Jadiriyah Bridge in downtown Baghdad around 9 p.m. Two policemen were wounded with their car damaged. Dhuluiya: #1: Seven suspected al Qaeda insurgents were killed in clashes with U.S. forces in a largely Sunni Arab province of Iraq, the U.S. military said Monday. Iraqi police in the area said Iraqi forces allied with the Americans were involved and that clashes continued throughout Sunday in the town of Dhuluiya, 70 km (45 miles) north of Baghdad. They put the death toll of the gunmen at nine. Lieutenant Colonel Mohammed Jassim, a police official in Dhuluiya, said the fighting began early Sunday and resulted in the arrest of 17 suspected militants, four of them non-Iraqi Arabs. Four suspected insurgents were wounded. Salman Pek: #1: Major General Adel Dahaam, police chief of the southern city of Basra, was unharmed in a roadside bomb attack in Salman Pak, 30 km (20 miles) southeast of Baghdad. Police said Dahaam was off-duty at the time. Irbil: #1: A shepherd was wounded on Monday when an explosive charge went off south of Arbil, said a police source from the province. “The incident took place at Bashtappa village of Qosh-tappa district, 45 km south of Arbil city,” the source told Aswat al-Iraq news agency. Kirkuk: #1: Unknown gunmen stormed a house on Sunday night and shot dead two Christian women in the Domiz neighborhood in southern Kirkuk, some 250 km north of Baghdad, Brigadier Burhan Tayib, the city police chief told Xinhua. #2: Separately, unidentified armed men stormed another house also on Sunday night in the June 1st neighborhood of southern Kirkuk, killing a man and wounding his father and brother, Tayib said. Mosul: #1: Sunday A policeman was killed after insurgents broke in his house in alKhadraa area in east Mosul on Sunday morning. #2: A roadside bomb wounded two Iraqi soldiers and one civilian in nothern Mosul, 390 km (240 miles) north of Baghdad, police said. #3: Police said they found the body of a man who had been shot in the head and chest in western Mosul. #4: U.S. forces on Monday injured a woman in eastern Mosul, a security source said, adding that police found a civilian body in the western section of the city. “A woman was wounded on Monday in a random shootout by U.S. forces in al-Faisaliya region in eastern Mosul,” the source told Aswat al-Iraq news agency.",
        "intTime": 20090502,
        "postID": 1,
        "quote": "",
        "reply": "The comparison of the violence in Chicago to the violence in Iraq by bushies who think that “we won” in Iraq is ridicules. For the month of April. 2009: Number of bombings in Chicago – 0 Number of bombings in Iraq – too many to count. Number of people killed by bombs – too many to count Number of suicide bombings in Chicago – 0 Number of suicide in Iraq – eight. Number of people killed by suicide bombs – more than 200 Number of people killed by mortar attacks in Chicago – 0 Number of people killed by mortar attacks in Baghdad – 4. Number of police officers murdered in Chicago – 0 Number of police officers murdered in Iraq – too many to count. Number of violent attacks on government officials in Chicago – 0 Number of violent attacks on government officials in Chicago – too many to count Number of power stations sabotaged in Chicago – 0 Number of power stations sabotaged in Iraq – 1 The violence in Iraq is increasing, because the mission of the “surge” strategy was to decrease the violence, not to do anything about the causes of the violence. The insurgency and al Qaeda are still very active in Iraq. Here is the security report of just the last six days in Iraq. Yusufiya: #1: Gunmen opened fire on a government-backed Sunni Arab militia checkpoint in Yusufiya, 20 km (12 miles) south of Baghdad, wounding one fighter, early on Saturday, police said. Kut: #1: The decomposed body of a young man was found inside his house in central al-Kut city on Friday, a security source said. “The body showed signs of having been shot. It decayed after remaining for a long time on the roof,” he added. Kirkuk: #1: Iraqi police say a roadside bomb has killed at least three people near the northern city of Kirkuk. The victims are civilians who were traveling about 20 miles (32 kilometers) south of the ethnically mixed city. Police Brig. Gen. Sarhad Qadir says the blast hit a car and cement mixer. Three construction workers were killed and two injured in a bomb blast in Iraq's northern province of Kirkuk Saturday, police said. 'A bomb struck a car carrying builders on a road in Taz-Touz Khormato district,' senior police officer Fekrat Rachid told the German Press Agency dpa. Sulaimaniyah: #1: Iranian helicopters attacked three Iraqi Kurdish villages in a pre-dawn raid on Saturday, a senior border guard official said, the first time Iran has used aircraft against Kurdish rebels. There were no immediate reports of casualties.\"At 4 am (0100 GMT) they attacked with artillery the villages of Kani Saif, Jomarasi and Kara Sozi, that belong to the Panjwin district,\" a senior Iraqi border guard official told AFP on condition of anonymity. \"After the attacks at 9 am three Iranian helicopters attacked these areas again,\" he said. \"This is the first time they have used helicopters.\" Mosul: #1: Five civilians were killed and six others wounded in a suicide blast inside a casino in northern Mosul city on Friday, police said. “A suicide bomber with an explosive belt attacked the al-Shiraa casino in the tourist area of Sadd al-Mosul, (40 km) northern Mosul, killing five civilians and wounding six others,” a security source from Ninewa police told Aswat al-Iraq news agency. Baghdad: #1: Around 7:30 p.m. a roadside bomb detonated in Binouk neighborhood in eastern Baghdad on Thursday. Three people were injured. #2: Around 8:30 p.m. a roadside bomb detonated in New Baghdad neighborhood in eastern Baghdad on Thursday. Four people were wounded. Wasit Prv: #1: Unidentified gunmen have destroyed a power station feeding the Ahdab oil field which a Chinese firm is developing. A provincial official, refusing to be named said: “Installations belonging to an important oil field have been subjected to a terrorist attack from unidentified gunmen. Amarra: #1: Two U.S. soldiers were killed by sniper bullets in the city of al-Amara on Thursday, said a security source from the Missan province police. “The two U.S. soldiers were killed when their patrol came under sniper fire in central Amara,” the source told Aswat al-Iraq news agency. Basra: #1: Five security personnel were wounded when an improvised explosive device (IED) went off in central Basra on Friday, an official security source from the city’s police said. “The five bomb squad personnel were wounded while trying to defuse a charge planted near a fuel station in al-Muftiya, central Basra,” the source told Aswat al-Iraq news agency. Tikrit: #1: Joint U.S.-Iraqi forces Friday killed a policeman and one of his relatives in central Tikrit, a police source said. “A joint force of Iraqi and U.S. personnel raided a house in al-Zuhour neighborhood in central Tikrit on the wee small hours of Friday (May 1) and killed Emad Soliman, a policeman, and his cousin who is working with the Sahwa forces,” the source told Aswat al-Iraq news agency. Mosul: #1: Unknown gunmen killed an Iraqi soldier in eastern Mosul, according to a security source on Friday. “Unknown armed men on Thursday night (April 30) killed a soldier near his house in al-Zahraa neighborhood in eastern Mosul,” the source told Aswat al-Iraq news agency. #2: A roadside bomb targeted an American patrol in Mosul AlJadida (New Mosul) neighborhood in western Mosul on Wednesday night. No casualties reported. #3: Gunmen killed an Iraqi soldier in front of his house in Zahraa neighborhood in east Mosul on Thursday afternoon. #4: Gunmen killed a guard of the KDP (Kurdstan Democratic Party) near one of the party’s headquarters in Faisaliyah neighborhood in eastern Mosul in the evening. Tal Afar: #1: Policemen found the bodies of three brothers west of the city of Mosul on Thursday, a security source in Ninewa said. “The bodies were found shot inside their vehicle in Tal Abta area, Talafar district, (60 km) west of Mosul,” the source told Aswat al-Iraq news agency. Al Anbar Prv: The two U.S. Marines and one sailor were killed Thursday while conducting combat operations in Anbar province, said a military statement. Anbar is a former insurgent stronghold that has been relatively calm since Sunni tribal leaders turned against al-Qaida in Iraq. Ramadi: #1: Four unidentified decomposed bodies were found near al-Ramadi Hospital west of the city, according to a security source in al-Anbar province on Thursday. “The bodies were found buried near al-Ramadi Public Hospital, west of the city. They were found after a terrorist was arrested and confessed to the place where these bodies were buried,” the source told Aswat al-Iraq news agency. Baghdad: #1: Five people were killed and five were wounded by a roadside bomb in Hor Rijab, a village on the southwestern outskirts of Baghdad. #2: A roadside bomb wounded five civilians in the Shurta district of southwestern Baghdad, police said. #3: Two bombs placed in parked cars killed two people and wounded eight others near a Shi'ite mosque in the Hurriya district of northwestern Baghdad, police said. #4: Around 7 p.m. a roadside bomb targeted an American patrol in Khadraa neighborhood in western Baghdad on Wednesday. No casualties reported. #5: A roadside bomb wounded three civilians in the Karrada district of central Baghdad, police said. Diyala Prv: #1: Three Iraqi soldiers were killed on patrol and two others wounded when two roadside bombs went off in Himreen area of northeastern Diyala province, police said. Kut: #1: Two policemen on Wednesday were killed and five men, including an Iranian, were wounded in a road accident in Kut city, according to a local security source. “A police vehicle collided with a bus carrying Iranian visitors at the northern entrance to Kut city,” the source told Aswat al-Iraq new agency. Abu Ghraib: #1: A roadside bomb wounded three civilians in Abu Ghraib, on the western outskirts of Baghdad, police said. Mosul: #1: Two separate roadside bombs in southern Mosul, 390 km (240 miles) north of Baghdad, killed one policeman and wounded five civilians, police said. #2: Two civilians were wounded by a roadside bomb in eastern Mosul, police said. #3: A roadside bomb in the south of Mosul, 390 km (240 miles) north of Baghdad, targeted a police patrol, wounding two policemen, police said. Northern Iraq: #1: Turkey's military said it had launched air strikes against suspected Kurdistan Workers Party (PKK) bases in northern Iraq overnight and on Thursday. No further details were immediately available. Fallujah: #1: Four bodyguards of the Islamic party in Falluja were wounded on Thursday in a bomb explosion in the south of the city, a source from the party said. “An improvised explosive device went off on Thursday (April 30) targeting the motorcade of a senior official of the Islamic party in Nezal neighborhood in the south of Falluja, injuring four of his bodyguards,” the source told Aswat al-Iraq news agency. “The explosion also damaged his vehicle,” he added. Baghdad: #1: Clashes erupted today between an Iraqi army force and guards of a building belongs to the Trade Ministry, eyewitnesses said on Wednesday, with no word on casualties. “The clashes broke out on Wednesday morning (April 29) when the Iraqi army force attempted to arrest one of the Ministry’s employees in the building,” eyewitnesses told Aswat al-Iraq news agency by phone. “Clashes stooped shortly after that, a matter that allowed evacuating other employees from the building,” another eyewitness said. #2: In three separate incidents the Iraqi Security Forces detonated under control three parked car bombs in Abu Disheer and Hay al Mualimeen in southern Baghdad, and in Amil neighbourhood in southwestern Baghdad Wednesday morning. #3: A roadside bomb targeted a U.S. military convoy in Shaab neighbourhood, northern Baghdad at 3 p.m. Tuesday. No casualties were reported. #4: Iraqi police say two car bombs have killed at least 17 people in Baghdad's Shiite district of Sadr City. The blasts went off in quick succession Wednesday from parked cars filled with explosives. A police official says at least 17 people were killed and nearly 50 wounded. The toll from twin car bomb blasts on Wednesday in a busy market in Baghdad jumped to 41 killed and 68 wounded, Iraqi police said. Diyala Prv: Baquba: #1: A roadside bomb on Tuesday went off targeting a U.S. patrol in Baaquba suburb, said a security source from Diala, while the province’s police commander said that a wanted woman was arrested south of Baaquba. “The roadside bomb went off in central Baaquba while a U.S. patrol was passing by,” the source told Aswat al-Iraq news agency. “One of the patrol’s vehicles was heavily damaged,” he said. The source did not mention anything about casualties, while U.S. forces have not yet commented on the incident. Kirkuk: #1: A US-Iraqi patrol has been ambushed while distributing grants to Iraqi businesses near the northern city of Kirkuk, the American military said Wednesday. Iraqi officials said two civilians were killed when the Americans returned fire, but the US military said those killed were enemy fighters. US spokesman Maj. Derrick Cheng said several people launched grenades and began shooting Wednesday as the patrol was handing out micro-grant money to stimulate small businesses in the town of Riyadh. He said reports indicate \"two enemy killed and one wounded,\" and one American was also wounded. Mosul: #1: Gunmen, on foot, attacked and killed a civilian while he was shopping in al Zinjeeli commercial centre in western Mosul, Tuesday morning. Early investigations showed that he was the father of two policemen. #2: A roadside bomb targeted a police patrol in Qahira neighbourhood, downtown Mosul Tuesday injuring three policemen. #3: A roadside bomb targeted a police patrol in New Mosul at 8 a.m. Wednesday injuring two policemen. Baghdad: #1: Sunday A roadside bomb targeted a national police patrol in Dora neighborhood in southern Baghdad around 9:30 p.m. One policeman was killed and another one was wounded. #2: The director general of Basra’s police department on Monday survived an assassination attempt when an explosive device targeted his vehicle in Baghdad, according to a media chief. “Today, an improvised explosive device (IED) targeted Basra’s police chief, Staff Maj. Gen. Adel Kamel Raham, in Jaraf al-Nadaf area, southeastern Baghdad,” Col. Abdulkareem al-Zaydi told Aswat al-Iraq news agency.The explosion caused damage to the official’s vehicle, but no casualties were reported, Zaydi added. #3: Gunmen threw a grenade on a police patrol beneath the Jadiriyah Bridge in downtown Baghdad around 9 p.m. Two policemen were wounded with their car damaged. Dhuluiya: #1: Seven suspected al Qaeda insurgents were killed in clashes with U.S. forces in a largely Sunni Arab province of Iraq, the U.S. military said Monday. Iraqi police in the area said Iraqi forces allied with the Americans were involved and that clashes continued throughout Sunday in the town of Dhuluiya, 70 km (45 miles) north of Baghdad. They put the death toll of the gunmen at nine. Lieutenant Colonel Mohammed Jassim, a police official in Dhuluiya, said the fighting began early Sunday and resulted in the arrest of 17 suspected militants, four of them non-Iraqi Arabs. Four suspected insurgents were wounded. Salman Pek: #1: Major General Adel Dahaam, police chief of the southern city of Basra, was unharmed in a roadside bomb attack in Salman Pak, 30 km (20 miles) southeast of Baghdad. Police said Dahaam was off-duty at the time. Irbil: #1: A shepherd was wounded on Monday when an explosive charge went off south of Arbil, said a police source from the province. “The incident took place at Bashtappa village of Qosh-tappa district, 45 km south of Arbil city,” the source told Aswat al-Iraq news agency. Kirkuk: #1: Unknown gunmen stormed a house on Sunday night and shot dead two Christian women in the Domiz neighborhood in southern Kirkuk, some 250 km north of Baghdad, Brigadier Burhan Tayib, the city police chief told Xinhua. #2: Separately, unidentified armed men stormed another house also on Sunday night in the June 1st neighborhood of southern Kirkuk, killing a man and wounding his father and brother, Tayib said. Mosul: #1: Sunday A policeman was killed after insurgents broke in his house in alKhadraa area in east Mosul on Sunday morning. #2: A roadside bomb wounded two Iraqi soldiers and one civilian in nothern Mosul, 390 km (240 miles) north of Baghdad, police said. #3: Police said they found the body of a man who had been shot in the head and chest in western Mosul. #4: U.S. forces on Monday injured a woman in eastern Mosul, a security source said, adding that police found a civilian body in the western section of the city. “A woman was wounded on Monday in a random shootout by U.S. forces in al-Faisaliya region in eastern Mosul,” the source told Aswat al-Iraq news agency.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 09:26:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "xerello"
    },
    {
        "content": "Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story?",
        "intTime": 20090502,
        "postID": 2,
        "quote": "",
        "reply": "Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story?",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 09:40:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "mrmixitup"
    },
    {
        "content": "quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months.",
        "intTime": 20090502,
        "postID": 3,
        "quote": "Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story?",
        "reply": " It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 12:05:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "xerello"
    },
    {
        "content": "quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then... Already past the future",
        "intTime": 20090502,
        "postID": 4,
        "quote": "April Deadliest Month in Iraq.",
        "reply": " ....lets see...by the past standards applied here....it is Oboma's fault then... Already past the future",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 12:28:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "6486143"
    },
    {
        "content": "Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out.",
        "intTime": 20090502,
        "postID": 5,
        "quote": "",
        "reply": "Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 14:42:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by 6486143: quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then... Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989",
        "intTime": 20090502,
        "postID": 6,
        "quote": "Originally posted by 6486143: quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then...",
        "reply": " Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 15:20:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "Proudformermarine"
    },
    {
        "content": "If Obama doesn't start putting his strong face people will keep pooping on it! This message has been edited. Last edited by: EAG154, Sat 02 May 2009 05:06 PM",
        "intTime": 20090502,
        "postID": 7,
        "quote": "",
        "reply": "If Obama doesn't start putting his strong face people will keep pooping on it! This message has been edited. Last edited by: EAG154, Sat 02 May 2009 05:06 PM",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 16:32:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out. So, you are saying that we went in and got Saddam and instead of staying so we could try to stop all of the murdering terrorists that were running around Iraq, we should have just left them to slaughter and brutalize the innocent citizens of Iraq? Is that what you are saying?",
        "intTime": 20090502,
        "postID": 8,
        "quote": "Originally posted by crackerjacks61: Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out.",
        "reply": " So, you are saying that we went in and got Saddam and instead of staying so we could try to stop all of the murdering terrorists that were running around Iraq, we should have just left them to slaughter and brutalize the innocent citizens of Iraq? Is that what you are saying?",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 16:34:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090502,
        "postID": 9,
        "quote": "Originally posted by xerello: quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months.",
        "reply": " \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 16:36:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by Proudformermarine: quote: Originally posted by 6486143: quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then... Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 quote: \"We have had some increase in the number of these high-profile attacks, but nowhere near what we were seeing a year or a year and half ago,\" he said Friday in a briefing for reporters. The attack raised to at least 18 the number of American troops deaths in April, double the nine killed in March, which was the lowest since the war began in March 2003. That made April the deadliest month for U.S. forces since September, when 25 American troops died. Millions of Shiites make the annual pilgrimage to Karbala in April every year. Bombings always spike in April as AQ tries to inflame sectarian violence during these pilgrimages. I swear you people will shamelessly try to spin anything.",
        "intTime": 20090502,
        "postID": 10,
        "quote": "Originally posted by Proudformermarine: quote: Originally posted by 6486143: quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then... Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989",
        "reply": " quote: \"We have had some increase in the number of these high-profile attacks, but nowhere near what we were seeing a year or a year and half ago,\" he said Friday in a briefing for reporters. The attack raised to at least 18 the number of American troops deaths in April, double the nine killed in March, which was the lowest since the war began in March 2003. That made April the deadliest month for U.S. forces since September, when 25 American troops died. Millions of Shiites make the annual pilgrimage to Karbala in April every year. Bombings always spike in April as AQ tries to inflame sectarian violence during these pilgrimages. I swear you people will shamelessly try to spin anything.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 21:27:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "Esample1"
    },
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months. Didn't some idiot mayor of some city already do the same thing and was torn apart in the news because of it? If I remember correctly, he immediately began backtracking when interviewed afterwards.",
        "intTime": 20090503,
        "postID": 11,
        "quote": "Originally posted by xerello: quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months.",
        "reply": " Didn't some idiot mayor of some city already do the same thing and was torn apart in the news because of it? If I remember correctly, he immediately began backtracking when interviewed afterwards.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-03 03:44:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "mrmixitup"
    },
    {
        "content": "Sad thing is, a lot of those guys were on their way home. \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin",
        "intTime": 20090503,
        "postID": 12,
        "quote": "",
        "reply": "Sad thing is, a lot of those guys were on their way home. \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-03 17:55:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "boughtwaprice"
    },
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by crackerjacks61: Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out. So, you are saying that we went in and got Saddam and instead of staying so we could try to stop all of the murdering terrorists that were running around Iraq, we should have just left them to slaughter and brutalize the innocent citizens of Iraq? Is that what you are saying? Yep Thats what hes saying.We Went there to disarm him, assure he was not a threat to our national security, Removed a dictator in the process, Then it was time to leave not take sides in thier civil war.",
        "intTime": 20090503,
        "postID": 13,
        "quote": "Originally posted by AngelHeart: quote: Originally posted by crackerjacks61: Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out. So, you are saying that we went in and got Saddam and instead of staying so we could try to stop all of the murdering terrorists that were running around Iraq, we should have just left them to slaughter and brutalize the innocent citizens of Iraq? Is that what you are saying?",
        "reply": " Yep Thats what hes saying.We Went there to disarm him, assure he was not a threat to our national security, Removed a dictator in the process, Then it was time to leave not take sides in thier civil war.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-03 21:08:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "john2x"
    },
    {
        "content": "quote: Originally posted by boughtwaprice: Sad thing is, a lot of those guys were on their way home. ...hey girl! love the new avatar....and yes ....sad day when short timers die.....or anyone for that matter... Already past the future",
        "intTime": 20090504,
        "postID": 14,
        "quote": "Originally posted by boughtwaprice: Sad thing is, a lot of those guys were on their way home.",
        "reply": " ...hey girl! love the new avatar....and yes ....sad day when short timers die.....or anyone for that matter... Already past the future",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-04 04:53:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "6486143"
    },
    {
        "content": "October, 2004: WEBB: You know, the sad thing is, there‘s not a thing that has occurred in Iraq that was not only predictable but predicted. And predicted with good military advice to this administration. WEBB: My view of it, when Vice President Cheney repeatedly says that the people who have questioned the war against Iraq don‘t understand the post-9/11 world, my view is the complete reverse. The people who did this, this was on their to-do list when they got into the administration, and they did not... MATTHEWS: Cheney? WEBB: Cheney and the whole group that really put this together. They wanted this as a part of what was going to happen in the Bush administration. One way or the other, they were waiting for... (CROSSTALK) MATTHEWS: That‘s why they joined, you could argue. WEBB: And in my view, these people don‘t understand the realities post-9/11. Post-9/11, this was a bad idea. Pre-9/11, I still would have opposed it, but at least it was an arguable idea. MATTHEWS: Because—why is it more of a bad idea now since 9/11? WEBB: Because international terrorism really moved in a dramatic way from a regional problem to a global problem. We saw that we had to step to the forefront. We had all the nations of the world with us after 9/11. And we systematically alienated a huge percentage of the world at a time we needed their cooperation. We tied down our military in static positions when we had developed, for 10 or 15 years, we had worked on a maneuverable military. And now we dumped them into static positions. So it is a bad idea in terms of international politics, a bad idea in terms of grand strategy, and a bad idea in how to use the military. MATTHEWS: Did we dare the Arab world to take us on in Iraq? The young men of the Arab world? Did we say, go ahead, make our day, go ahead, step up to the plate, you got it? WEBB: Clearly, it was the inevitable consequences of anyone who thought this through. MATTHEWS: Like bring it on. That‘s what the president said. And they did. WEBB: And well, I think that by putting our people in Iraq, we certainly made them targets in a way that they wouldn‘t have been if we were fighting the war against international terrorism from a position to maneuver.\" ------------- Our guys are still dying in Iraq because of criminal negligence by the Bush Administration. Walt",
        "intTime": 20090504,
        "postID": 15,
        "quote": "",
        "reply": "October, 2004: WEBB: You know, the sad thing is, there‘s not a thing that has occurred in Iraq that was not only predictable but predicted. And predicted with good military advice to this administration. WEBB: My view of it, when Vice President Cheney repeatedly says that the people who have questioned the war against Iraq don‘t understand the post-9/11 world, my view is the complete reverse. The people who did this, this was on their to-do list when they got into the administration, and they did not... MATTHEWS: Cheney? WEBB: Cheney and the whole group that really put this together. They wanted this as a part of what was going to happen in the Bush administration. One way or the other, they were waiting for... (CROSSTALK) MATTHEWS: That‘s why they joined, you could argue. WEBB: And in my view, these people don‘t understand the realities post-9/11. Post-9/11, this was a bad idea. Pre-9/11, I still would have opposed it, but at least it was an arguable idea. MATTHEWS: Because—why is it more of a bad idea now since 9/11? WEBB: Because international terrorism really moved in a dramatic way from a regional problem to a global problem. We saw that we had to step to the forefront. We had all the nations of the world with us after 9/11. And we systematically alienated a huge percentage of the world at a time we needed their cooperation. We tied down our military in static positions when we had developed, for 10 or 15 years, we had worked on a maneuverable military. And now we dumped them into static positions. So it is a bad idea in terms of international politics, a bad idea in terms of grand strategy, and a bad idea in how to use the military. MATTHEWS: Did we dare the Arab world to take us on in Iraq? The young men of the Arab world? Did we say, go ahead, make our day, go ahead, step up to the plate, you got it? WEBB: Clearly, it was the inevitable consequences of anyone who thought this through. MATTHEWS: Like bring it on. That‘s what the president said. And they did. WEBB: And well, I think that by putting our people in Iraq, we certainly made them targets in a way that they wouldn‘t have been if we were fighting the war against international terrorism from a position to maneuver.\" ------------- Our guys are still dying in Iraq because of criminal negligence by the Bush Administration. Walt",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-04 06:20:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "WhiskeyPapa"
    },
    {
        "content": "quote: Originally posted by Proudformermarine: Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 The fact that we have 60% of our available combat forces unavailable for combat due to current obligations and repeated deployments in simultaneous wars is likely making our enemies pretty bold. If we had to go to war with Iran tomorrow, we'd be in SERIOUS trouble.",
        "intTime": 20090504,
        "postID": 16,
        "quote": "Originally posted by Proudformermarine: Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989",
        "reply": " The fact that we have 60% of our available combat forces unavailable for combat due to current obligations and repeated deployments in simultaneous wars is likely making our enemies pretty bold. If we had to go to war with Iran tomorrow, we'd be in SERIOUS trouble.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-04 07:54:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "mrmixitup"
    },
    {
        "content": "The comparison of the violence in Chicago to the violence in Iraq by bushies who think that “we won” in Iraq is ridicules. For the month of April. 2009: Number of bombings in Chicago – 0 Number of bombings in Iraq – too many to count. Number of people killed by bombs – too many to count Number of suicide bombings in Chicago – 0 Number of suicide in Iraq – eight. Number of people killed by suicide bombs – more than 200 Number of people killed by mortar attacks in Chicago – 0 Number of people killed by mortar attacks in Baghdad – 4. Number of police officers murdered in Chicago – 0 Number of police officers murdered in Iraq – too many to count. Number of violent attacks on government officials in Chicago – 0 Number of violent attacks on government officials in Chicago – too many to count Number of power stations sabotaged in Chicago – 0 Number of power stations sabotaged in Iraq – 1 The violence in Iraq is increasing, because the mission of the “surge” strategy was to decrease the violence, not to do anything about the causes of the violence. The insurgency and al Qaeda are still very active in Iraq. Here is the security report of just the last six days in Iraq. Yusufiya: #1: Gunmen opened fire on a government-backed Sunni Arab militia checkpoint in Yusufiya, 20 km (12 miles) south of Baghdad, wounding one fighter, early on Saturday, police said. Kut: #1: The decomposed body of a young man was found inside his house in central al-Kut city on Friday, a security source said. “The body showed signs of having been shot. It decayed after remaining for a long time on the roof,” he added. Kirkuk: #1: Iraqi police say a roadside bomb has killed at least three people near the northern city of Kirkuk. The victims are civilians who were traveling about 20 miles (32 kilometers) south of the ethnically mixed city. Police Brig. Gen. Sarhad Qadir says the blast hit a car and cement mixer. Three construction workers were killed and two injured in a bomb blast in Iraq's northern province of Kirkuk Saturday, police said. 'A bomb struck a car carrying builders on a road in Taz-Touz Khormato district,' senior police officer Fekrat Rachid told the German Press Agency dpa. Sulaimaniyah: #1: Iranian helicopters attacked three Iraqi Kurdish villages in a pre-dawn raid on Saturday, a senior border guard official said, the first time Iran has used aircraft against Kurdish rebels. There were no immediate reports of casualties.\"At 4 am (0100 GMT) they attacked with artillery the villages of Kani Saif, Jomarasi and Kara Sozi, that belong to the Panjwin district,\" a senior Iraqi border guard official told AFP on condition of anonymity. \"After the attacks at 9 am three Iranian helicopters attacked these areas again,\" he said. \"This is the first time they have used helicopters.\" Mosul: #1: Five civilians were killed and six others wounded in a suicide blast inside a casino in northern Mosul city on Friday, police said. “A suicide bomber with an explosive belt attacked the al-Shiraa casino in the tourist area of Sadd al-Mosul, (40 km) northern Mosul, killing five civilians and wounding six others,” a security source from Ninewa police told Aswat al-Iraq news agency. Baghdad: #1: Around 7:30 p.m. a roadside bomb detonated in Binouk neighborhood in eastern Baghdad on Thursday. Three people were injured. #2: Around 8:30 p.m. a roadside bomb detonated in New Baghdad neighborhood in eastern Baghdad on Thursday. Four people were wounded. Wasit Prv: #1: Unidentified gunmen have destroyed a power station feeding the Ahdab oil field which a Chinese firm is developing. A provincial official, refusing to be named said: “Installations belonging to an important oil field have been subjected to a terrorist attack from unidentified gunmen. Amarra: #1: Two U.S. soldiers were killed by sniper bullets in the city of al-Amara on Thursday, said a security source from the Missan province police. “The two U.S. soldiers were killed when their patrol came under sniper fire in central Amara,” the source told Aswat al-Iraq news agency. Basra: #1: Five security personnel were wounded when an improvised explosive device (IED) went off in central Basra on Friday, an official security source from the city’s police said. “The five bomb squad personnel were wounded while trying to defuse a charge planted near a fuel station in al-Muftiya, central Basra,” the source told Aswat al-Iraq news agency. Tikrit: #1: Joint U.S.-Iraqi forces Friday killed a policeman and one of his relatives in central Tikrit, a police source said. “A joint force of Iraqi and U.S. personnel raided a house in al-Zuhour neighborhood in central Tikrit on the wee small hours of Friday (May 1) and killed Emad Soliman, a policeman, and his cousin who is working with the Sahwa forces,” the source told Aswat al-Iraq news agency. Mosul: #1: Unknown gunmen killed an Iraqi soldier in eastern Mosul, according to a security source on Friday. “Unknown armed men on Thursday night (April 30) killed a soldier near his house in al-Zahraa neighborhood in eastern Mosul,” the source told Aswat al-Iraq news agency. #2: A roadside bomb targeted an American patrol in Mosul AlJadida (New Mosul) neighborhood in western Mosul on Wednesday night. No casualties reported. #3: Gunmen killed an Iraqi soldier in front of his house in Zahraa neighborhood in east Mosul on Thursday afternoon. #4: Gunmen killed a guard of the KDP (Kurdstan Democratic Party) near one of the party’s headquarters in Faisaliyah neighborhood in eastern Mosul in the evening. Tal Afar: #1: Policemen found the bodies of three brothers west of the city of Mosul on Thursday, a security source in Ninewa said. “The bodies were found shot inside their vehicle in Tal Abta area, Talafar district, (60 km) west of Mosul,” the source told Aswat al-Iraq news agency. Al Anbar Prv: The two U.S. Marines and one sailor were killed Thursday while conducting combat operations in Anbar province, said a military statement. Anbar is a former insurgent stronghold that has been relatively calm since Sunni tribal leaders turned against al-Qaida in Iraq. Ramadi: #1: Four unidentified decomposed bodies were found near al-Ramadi Hospital west of the city, according to a security source in al-Anbar province on Thursday. “The bodies were found buried near al-Ramadi Public Hospital, west of the city. They were found after a terrorist was arrested and confessed to the place where these bodies were buried,” the source told Aswat al-Iraq news agency. Baghdad: #1: Five people were killed and five were wounded by a roadside bomb in Hor Rijab, a village on the southwestern outskirts of Baghdad. #2: A roadside bomb wounded five civilians in the Shurta district of southwestern Baghdad, police said. #3: Two bombs placed in parked cars killed two people and wounded eight others near a Shi'ite mosque in the Hurriya district of northwestern Baghdad, police said. #4: Around 7 p.m. a roadside bomb targeted an American patrol in Khadraa neighborhood in western Baghdad on Wednesday. No casualties reported. #5: A roadside bomb wounded three civilians in the Karrada district of central Baghdad, police said. Diyala Prv: #1: Three Iraqi soldiers were killed on patrol and two others wounded when two roadside bombs went off in Himreen area of northeastern Diyala province, police said. Kut: #1: Two policemen on Wednesday were killed and five men, including an Iranian, were wounded in a road accident in Kut city, according to a local security source. “A police vehicle collided with a bus carrying Iranian visitors at the northern entrance to Kut city,” the source told Aswat al-Iraq new agency. Abu Ghraib: #1: A roadside bomb wounded three civilians in Abu Ghraib, on the western outskirts of Baghdad, police said. Mosul: #1: Two separate roadside bombs in southern Mosul, 390 km (240 miles) north of Baghdad, killed one policeman and wounded five civilians, police said. #2: Two civilians were wounded by a roadside bomb in eastern Mosul, police said. #3: A roadside bomb in the south of Mosul, 390 km (240 miles) north of Baghdad, targeted a police patrol, wounding two policemen, police said. Northern Iraq: #1: Turkey's military said it had launched air strikes against suspected Kurdistan Workers Party (PKK) bases in northern Iraq overnight and on Thursday. No further details were immediately available. Fallujah: #1: Four bodyguards of the Islamic party in Falluja were wounded on Thursday in a bomb explosion in the south of the city, a source from the party said. “An improvised explosive device went off on Thursday (April 30) targeting the motorcade of a senior official of the Islamic party in Nezal neighborhood in the south of Falluja, injuring four of his bodyguards,” the source told Aswat al-Iraq news agency. “The explosion also damaged his vehicle,” he added. Baghdad: #1: Clashes erupted today between an Iraqi army force and guards of a building belongs to the Trade Ministry, eyewitnesses said on Wednesday, with no word on casualties. “The clashes broke out on Wednesday morning (April 29) when the Iraqi army force attempted to arrest one of the Ministry’s employees in the building,” eyewitnesses told Aswat al-Iraq news agency by phone. “Clashes stooped shortly after that, a matter that allowed evacuating other employees from the building,” another eyewitness said. #2: In three separate incidents the Iraqi Security Forces detonated under control three parked car bombs in Abu Disheer and Hay al Mualimeen in southern Baghdad, and in Amil neighbourhood in southwestern Baghdad Wednesday morning. #3: A roadside bomb targeted a U.S. military convoy in Shaab neighbourhood, northern Baghdad at 3 p.m. Tuesday. No casualties were reported. #4: Iraqi police say two car bombs have killed at least 17 people in Baghdad's Shiite district of Sadr City. The blasts went off in quick succession Wednesday from parked cars filled with explosives. A police official says at least 17 people were killed and nearly 50 wounded. The toll from twin car bomb blasts on Wednesday in a busy market in Baghdad jumped to 41 killed and 68 wounded, Iraqi police said. Diyala Prv: Baquba: #1: A roadside bomb on Tuesday went off targeting a U.S. patrol in Baaquba suburb, said a security source from Diala, while the province’s police commander said that a wanted woman was arrested south of Baaquba. “The roadside bomb went off in central Baaquba while a U.S. patrol was passing by,” the source told Aswat al-Iraq news agency. “One of the patrol’s vehicles was heavily damaged,” he said. The source did not mention anything about casualties, while U.S. forces have not yet commented on the incident. Kirkuk: #1: A US-Iraqi patrol has been ambushed while distributing grants to Iraqi businesses near the northern city of Kirkuk, the American military said Wednesday. Iraqi officials said two civilians were killed when the Americans returned fire, but the US military said those killed were enemy fighters. US spokesman Maj. Derrick Cheng said several people launched grenades and began shooting Wednesday as the patrol was handing out micro-grant money to stimulate small businesses in the town of Riyadh. He said reports indicate \"two enemy killed and one wounded,\" and one American was also wounded. Mosul: #1: Gunmen, on foot, attacked and killed a civilian while he was shopping in al Zinjeeli commercial centre in western Mosul, Tuesday morning. Early investigations showed that he was the father of two policemen. #2: A roadside bomb targeted a police patrol in Qahira neighbourhood, downtown Mosul Tuesday injuring three policemen. #3: A roadside bomb targeted a police patrol in New Mosul at 8 a.m. Wednesday injuring two policemen. Baghdad: #1: Sunday A roadside bomb targeted a national police patrol in Dora neighborhood in southern Baghdad around 9:30 p.m. One policeman was killed and another one was wounded. #2: The director general of Basra’s police department on Monday survived an assassination attempt when an explosive device targeted his vehicle in Baghdad, according to a media chief. “Today, an improvised explosive device (IED) targeted Basra’s police chief, Staff Maj. Gen. Adel Kamel Raham, in Jaraf al-Nadaf area, southeastern Baghdad,” Col. Abdulkareem al-Zaydi told Aswat al-Iraq news agency.The explosion caused damage to the official’s vehicle, but no casualties were reported, Zaydi added. #3: Gunmen threw a grenade on a police patrol beneath the Jadiriyah Bridge in downtown Baghdad around 9 p.m. Two policemen were wounded with their car damaged. Dhuluiya: #1: Seven suspected al Qaeda insurgents were killed in clashes with U.S. forces in a largely Sunni Arab province of Iraq, the U.S. military said Monday. Iraqi police in the area said Iraqi forces allied with the Americans were involved and that clashes continued throughout Sunday in the town of Dhuluiya, 70 km (45 miles) north of Baghdad. They put the death toll of the gunmen at nine. Lieutenant Colonel Mohammed Jassim, a police official in Dhuluiya, said the fighting began early Sunday and resulted in the arrest of 17 suspected militants, four of them non-Iraqi Arabs. Four suspected insurgents were wounded. Salman Pek: #1: Major General Adel Dahaam, police chief of the southern city of Basra, was unharmed in a roadside bomb attack in Salman Pak, 30 km (20 miles) southeast of Baghdad. Police said Dahaam was off-duty at the time. Irbil: #1: A shepherd was wounded on Monday when an explosive charge went off south of Arbil, said a police source from the province. “The incident took place at Bashtappa village of Qosh-tappa district, 45 km south of Arbil city,” the source told Aswat al-Iraq news agency. Kirkuk: #1: Unknown gunmen stormed a house on Sunday night and shot dead two Christian women in the Domiz neighborhood in southern Kirkuk, some 250 km north of Baghdad, Brigadier Burhan Tayib, the city police chief told Xinhua. #2: Separately, unidentified armed men stormed another house also on Sunday night in the June 1st neighborhood of southern Kirkuk, killing a man and wounding his father and brother, Tayib said. Mosul: #1: Sunday A policeman was killed after insurgents broke in his house in alKhadraa area in east Mosul on Sunday morning. #2: A roadside bomb wounded two Iraqi soldiers and one civilian in nothern Mosul, 390 km (240 miles) north of Baghdad, police said. #3: Police said they found the body of a man who had been shot in the head and chest in western Mosul. #4: U.S. forces on Monday injured a woman in eastern Mosul, a security source said, adding that police found a civilian body in the western section of the city. “A woman was wounded on Monday in a random shootout by U.S. forces in al-Faisaliya region in eastern Mosul,” the source told Aswat al-Iraq news agency.",
        "intTime": 20090502,
        "postID": 17,
        "quote": "",
        "reply": "The comparison of the violence in Chicago to the violence in Iraq by bushies who think that “we won” in Iraq is ridicules. For the month of April. 2009: Number of bombings in Chicago – 0 Number of bombings in Iraq – too many to count. Number of people killed by bombs – too many to count Number of suicide bombings in Chicago – 0 Number of suicide in Iraq – eight. Number of people killed by suicide bombs – more than 200 Number of people killed by mortar attacks in Chicago – 0 Number of people killed by mortar attacks in Baghdad – 4. Number of police officers murdered in Chicago – 0 Number of police officers murdered in Iraq – too many to count. Number of violent attacks on government officials in Chicago – 0 Number of violent attacks on government officials in Chicago – too many to count Number of power stations sabotaged in Chicago – 0 Number of power stations sabotaged in Iraq – 1 The violence in Iraq is increasing, because the mission of the “surge” strategy was to decrease the violence, not to do anything about the causes of the violence. The insurgency and al Qaeda are still very active in Iraq. Here is the security report of just the last six days in Iraq. Yusufiya: #1: Gunmen opened fire on a government-backed Sunni Arab militia checkpoint in Yusufiya, 20 km (12 miles) south of Baghdad, wounding one fighter, early on Saturday, police said. Kut: #1: The decomposed body of a young man was found inside his house in central al-Kut city on Friday, a security source said. “The body showed signs of having been shot. It decayed after remaining for a long time on the roof,” he added. Kirkuk: #1: Iraqi police say a roadside bomb has killed at least three people near the northern city of Kirkuk. The victims are civilians who were traveling about 20 miles (32 kilometers) south of the ethnically mixed city. Police Brig. Gen. Sarhad Qadir says the blast hit a car and cement mixer. Three construction workers were killed and two injured in a bomb blast in Iraq's northern province of Kirkuk Saturday, police said. 'A bomb struck a car carrying builders on a road in Taz-Touz Khormato district,' senior police officer Fekrat Rachid told the German Press Agency dpa. Sulaimaniyah: #1: Iranian helicopters attacked three Iraqi Kurdish villages in a pre-dawn raid on Saturday, a senior border guard official said, the first time Iran has used aircraft against Kurdish rebels. There were no immediate reports of casualties.\"At 4 am (0100 GMT) they attacked with artillery the villages of Kani Saif, Jomarasi and Kara Sozi, that belong to the Panjwin district,\" a senior Iraqi border guard official told AFP on condition of anonymity. \"After the attacks at 9 am three Iranian helicopters attacked these areas again,\" he said. \"This is the first time they have used helicopters.\" Mosul: #1: Five civilians were killed and six others wounded in a suicide blast inside a casino in northern Mosul city on Friday, police said. “A suicide bomber with an explosive belt attacked the al-Shiraa casino in the tourist area of Sadd al-Mosul, (40 km) northern Mosul, killing five civilians and wounding six others,” a security source from Ninewa police told Aswat al-Iraq news agency. Baghdad: #1: Around 7:30 p.m. a roadside bomb detonated in Binouk neighborhood in eastern Baghdad on Thursday. Three people were injured. #2: Around 8:30 p.m. a roadside bomb detonated in New Baghdad neighborhood in eastern Baghdad on Thursday. Four people were wounded. Wasit Prv: #1: Unidentified gunmen have destroyed a power station feeding the Ahdab oil field which a Chinese firm is developing. A provincial official, refusing to be named said: “Installations belonging to an important oil field have been subjected to a terrorist attack from unidentified gunmen. Amarra: #1: Two U.S. soldiers were killed by sniper bullets in the city of al-Amara on Thursday, said a security source from the Missan province police. “The two U.S. soldiers were killed when their patrol came under sniper fire in central Amara,” the source told Aswat al-Iraq news agency. Basra: #1: Five security personnel were wounded when an improvised explosive device (IED) went off in central Basra on Friday, an official security source from the city’s police said. “The five bomb squad personnel were wounded while trying to defuse a charge planted near a fuel station in al-Muftiya, central Basra,” the source told Aswat al-Iraq news agency. Tikrit: #1: Joint U.S.-Iraqi forces Friday killed a policeman and one of his relatives in central Tikrit, a police source said. “A joint force of Iraqi and U.S. personnel raided a house in al-Zuhour neighborhood in central Tikrit on the wee small hours of Friday (May 1) and killed Emad Soliman, a policeman, and his cousin who is working with the Sahwa forces,” the source told Aswat al-Iraq news agency. Mosul: #1: Unknown gunmen killed an Iraqi soldier in eastern Mosul, according to a security source on Friday. “Unknown armed men on Thursday night (April 30) killed a soldier near his house in al-Zahraa neighborhood in eastern Mosul,” the source told Aswat al-Iraq news agency. #2: A roadside bomb targeted an American patrol in Mosul AlJadida (New Mosul) neighborhood in western Mosul on Wednesday night. No casualties reported. #3: Gunmen killed an Iraqi soldier in front of his house in Zahraa neighborhood in east Mosul on Thursday afternoon. #4: Gunmen killed a guard of the KDP (Kurdstan Democratic Party) near one of the party’s headquarters in Faisaliyah neighborhood in eastern Mosul in the evening. Tal Afar: #1: Policemen found the bodies of three brothers west of the city of Mosul on Thursday, a security source in Ninewa said. “The bodies were found shot inside their vehicle in Tal Abta area, Talafar district, (60 km) west of Mosul,” the source told Aswat al-Iraq news agency. Al Anbar Prv: The two U.S. Marines and one sailor were killed Thursday while conducting combat operations in Anbar province, said a military statement. Anbar is a former insurgent stronghold that has been relatively calm since Sunni tribal leaders turned against al-Qaida in Iraq. Ramadi: #1: Four unidentified decomposed bodies were found near al-Ramadi Hospital west of the city, according to a security source in al-Anbar province on Thursday. “The bodies were found buried near al-Ramadi Public Hospital, west of the city. They were found after a terrorist was arrested and confessed to the place where these bodies were buried,” the source told Aswat al-Iraq news agency. Baghdad: #1: Five people were killed and five were wounded by a roadside bomb in Hor Rijab, a village on the southwestern outskirts of Baghdad. #2: A roadside bomb wounded five civilians in the Shurta district of southwestern Baghdad, police said. #3: Two bombs placed in parked cars killed two people and wounded eight others near a Shi'ite mosque in the Hurriya district of northwestern Baghdad, police said. #4: Around 7 p.m. a roadside bomb targeted an American patrol in Khadraa neighborhood in western Baghdad on Wednesday. No casualties reported. #5: A roadside bomb wounded three civilians in the Karrada district of central Baghdad, police said. Diyala Prv: #1: Three Iraqi soldiers were killed on patrol and two others wounded when two roadside bombs went off in Himreen area of northeastern Diyala province, police said. Kut: #1: Two policemen on Wednesday were killed and five men, including an Iranian, were wounded in a road accident in Kut city, according to a local security source. “A police vehicle collided with a bus carrying Iranian visitors at the northern entrance to Kut city,” the source told Aswat al-Iraq new agency. Abu Ghraib: #1: A roadside bomb wounded three civilians in Abu Ghraib, on the western outskirts of Baghdad, police said. Mosul: #1: Two separate roadside bombs in southern Mosul, 390 km (240 miles) north of Baghdad, killed one policeman and wounded five civilians, police said. #2: Two civilians were wounded by a roadside bomb in eastern Mosul, police said. #3: A roadside bomb in the south of Mosul, 390 km (240 miles) north of Baghdad, targeted a police patrol, wounding two policemen, police said. Northern Iraq: #1: Turkey's military said it had launched air strikes against suspected Kurdistan Workers Party (PKK) bases in northern Iraq overnight and on Thursday. No further details were immediately available. Fallujah: #1: Four bodyguards of the Islamic party in Falluja were wounded on Thursday in a bomb explosion in the south of the city, a source from the party said. “An improvised explosive device went off on Thursday (April 30) targeting the motorcade of a senior official of the Islamic party in Nezal neighborhood in the south of Falluja, injuring four of his bodyguards,” the source told Aswat al-Iraq news agency. “The explosion also damaged his vehicle,” he added. Baghdad: #1: Clashes erupted today between an Iraqi army force and guards of a building belongs to the Trade Ministry, eyewitnesses said on Wednesday, with no word on casualties. “The clashes broke out on Wednesday morning (April 29) when the Iraqi army force attempted to arrest one of the Ministry’s employees in the building,” eyewitnesses told Aswat al-Iraq news agency by phone. “Clashes stooped shortly after that, a matter that allowed evacuating other employees from the building,” another eyewitness said. #2: In three separate incidents the Iraqi Security Forces detonated under control three parked car bombs in Abu Disheer and Hay al Mualimeen in southern Baghdad, and in Amil neighbourhood in southwestern Baghdad Wednesday morning. #3: A roadside bomb targeted a U.S. military convoy in Shaab neighbourhood, northern Baghdad at 3 p.m. Tuesday. No casualties were reported. #4: Iraqi police say two car bombs have killed at least 17 people in Baghdad's Shiite district of Sadr City. The blasts went off in quick succession Wednesday from parked cars filled with explosives. A police official says at least 17 people were killed and nearly 50 wounded. The toll from twin car bomb blasts on Wednesday in a busy market in Baghdad jumped to 41 killed and 68 wounded, Iraqi police said. Diyala Prv: Baquba: #1: A roadside bomb on Tuesday went off targeting a U.S. patrol in Baaquba suburb, said a security source from Diala, while the province’s police commander said that a wanted woman was arrested south of Baaquba. “The roadside bomb went off in central Baaquba while a U.S. patrol was passing by,” the source told Aswat al-Iraq news agency. “One of the patrol’s vehicles was heavily damaged,” he said. The source did not mention anything about casualties, while U.S. forces have not yet commented on the incident. Kirkuk: #1: A US-Iraqi patrol has been ambushed while distributing grants to Iraqi businesses near the northern city of Kirkuk, the American military said Wednesday. Iraqi officials said two civilians were killed when the Americans returned fire, but the US military said those killed were enemy fighters. US spokesman Maj. Derrick Cheng said several people launched grenades and began shooting Wednesday as the patrol was handing out micro-grant money to stimulate small businesses in the town of Riyadh. He said reports indicate \"two enemy killed and one wounded,\" and one American was also wounded. Mosul: #1: Gunmen, on foot, attacked and killed a civilian while he was shopping in al Zinjeeli commercial centre in western Mosul, Tuesday morning. Early investigations showed that he was the father of two policemen. #2: A roadside bomb targeted a police patrol in Qahira neighbourhood, downtown Mosul Tuesday injuring three policemen. #3: A roadside bomb targeted a police patrol in New Mosul at 8 a.m. Wednesday injuring two policemen. Baghdad: #1: Sunday A roadside bomb targeted a national police patrol in Dora neighborhood in southern Baghdad around 9:30 p.m. One policeman was killed and another one was wounded. #2: The director general of Basra’s police department on Monday survived an assassination attempt when an explosive device targeted his vehicle in Baghdad, according to a media chief. “Today, an improvised explosive device (IED) targeted Basra’s police chief, Staff Maj. Gen. Adel Kamel Raham, in Jaraf al-Nadaf area, southeastern Baghdad,” Col. Abdulkareem al-Zaydi told Aswat al-Iraq news agency.The explosion caused damage to the official’s vehicle, but no casualties were reported, Zaydi added. #3: Gunmen threw a grenade on a police patrol beneath the Jadiriyah Bridge in downtown Baghdad around 9 p.m. Two policemen were wounded with their car damaged. Dhuluiya: #1: Seven suspected al Qaeda insurgents were killed in clashes with U.S. forces in a largely Sunni Arab province of Iraq, the U.S. military said Monday. Iraqi police in the area said Iraqi forces allied with the Americans were involved and that clashes continued throughout Sunday in the town of Dhuluiya, 70 km (45 miles) north of Baghdad. They put the death toll of the gunmen at nine. Lieutenant Colonel Mohammed Jassim, a police official in Dhuluiya, said the fighting began early Sunday and resulted in the arrest of 17 suspected militants, four of them non-Iraqi Arabs. Four suspected insurgents were wounded. Salman Pek: #1: Major General Adel Dahaam, police chief of the southern city of Basra, was unharmed in a roadside bomb attack in Salman Pak, 30 km (20 miles) southeast of Baghdad. Police said Dahaam was off-duty at the time. Irbil: #1: A shepherd was wounded on Monday when an explosive charge went off south of Arbil, said a police source from the province. “The incident took place at Bashtappa village of Qosh-tappa district, 45 km south of Arbil city,” the source told Aswat al-Iraq news agency. Kirkuk: #1: Unknown gunmen stormed a house on Sunday night and shot dead two Christian women in the Domiz neighborhood in southern Kirkuk, some 250 km north of Baghdad, Brigadier Burhan Tayib, the city police chief told Xinhua. #2: Separately, unidentified armed men stormed another house also on Sunday night in the June 1st neighborhood of southern Kirkuk, killing a man and wounding his father and brother, Tayib said. Mosul: #1: Sunday A policeman was killed after insurgents broke in his house in alKhadraa area in east Mosul on Sunday morning. #2: A roadside bomb wounded two Iraqi soldiers and one civilian in nothern Mosul, 390 km (240 miles) north of Baghdad, police said. #3: Police said they found the body of a man who had been shot in the head and chest in western Mosul. #4: U.S. forces on Monday injured a woman in eastern Mosul, a security source said, adding that police found a civilian body in the western section of the city. “A woman was wounded on Monday in a random shootout by U.S. forces in al-Faisaliya region in eastern Mosul,” the source told Aswat al-Iraq news agency.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 09:26:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "xerello"
    },
    {
        "content": "Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story?",
        "intTime": 20090502,
        "postID": 18,
        "quote": "",
        "reply": "Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story?",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 09:40:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "mrmixitup"
    },
    {
        "content": "quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months.",
        "intTime": 20090502,
        "postID": 19,
        "quote": "Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story?",
        "reply": " It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 12:05:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "xerello"
    },
    {
        "content": "quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then... Already past the future",
        "intTime": 20090502,
        "postID": 20,
        "quote": "April Deadliest Month in Iraq.",
        "reply": " ....lets see...by the past standards applied here....it is Oboma's fault then... Already past the future",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 12:28:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "6486143"
    },
    {
        "content": "Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out.",
        "intTime": 20090502,
        "postID": 21,
        "quote": "",
        "reply": "Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 14:42:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by 6486143: quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then... Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989",
        "intTime": 20090502,
        "postID": 22,
        "quote": "Originally posted by 6486143: quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then...",
        "reply": " Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 15:20:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "Proudformermarine"
    },
    {
        "content": "If Obama doesn't start putting his strong face people will keep pooping on it! This message has been edited. Last edited by: EAG154, Sat 02 May 2009 05:06 PM",
        "intTime": 20090502,
        "postID": 23,
        "quote": "",
        "reply": "If Obama doesn't start putting his strong face people will keep pooping on it! This message has been edited. Last edited by: EAG154, Sat 02 May 2009 05:06 PM",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 16:32:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out. So, you are saying that we went in and got Saddam and instead of staying so we could try to stop all of the murdering terrorists that were running around Iraq, we should have just left them to slaughter and brutalize the innocent citizens of Iraq? Is that what you are saying?",
        "intTime": 20090502,
        "postID": 24,
        "quote": "Originally posted by crackerjacks61: Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out.",
        "reply": " So, you are saying that we went in and got Saddam and instead of staying so we could try to stop all of the murdering terrorists that were running around Iraq, we should have just left them to slaughter and brutalize the innocent citizens of Iraq? Is that what you are saying?",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 16:34:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090502,
        "postID": 25,
        "quote": "Originally posted by xerello: quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months.",
        "reply": " \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 16:36:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by Proudformermarine: quote: Originally posted by 6486143: quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then... Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 quote: \"We have had some increase in the number of these high-profile attacks, but nowhere near what we were seeing a year or a year and half ago,\" he said Friday in a briefing for reporters. The attack raised to at least 18 the number of American troops deaths in April, double the nine killed in March, which was the lowest since the war began in March 2003. That made April the deadliest month for U.S. forces since September, when 25 American troops died. Millions of Shiites make the annual pilgrimage to Karbala in April every year. Bombings always spike in April as AQ tries to inflame sectarian violence during these pilgrimages. I swear you people will shamelessly try to spin anything.",
        "intTime": 20090502,
        "postID": 26,
        "quote": "Originally posted by Proudformermarine: quote: Originally posted by 6486143: quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then... Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989",
        "reply": " quote: \"We have had some increase in the number of these high-profile attacks, but nowhere near what we were seeing a year or a year and half ago,\" he said Friday in a briefing for reporters. The attack raised to at least 18 the number of American troops deaths in April, double the nine killed in March, which was the lowest since the war began in March 2003. That made April the deadliest month for U.S. forces since September, when 25 American troops died. Millions of Shiites make the annual pilgrimage to Karbala in April every year. Bombings always spike in April as AQ tries to inflame sectarian violence during these pilgrimages. I swear you people will shamelessly try to spin anything.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 21:27:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "Esample1"
    },
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months. Didn't some idiot mayor of some city already do the same thing and was torn apart in the news because of it? If I remember correctly, he immediately began backtracking when interviewed afterwards.",
        "intTime": 20090503,
        "postID": 27,
        "quote": "Originally posted by xerello: quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months.",
        "reply": " Didn't some idiot mayor of some city already do the same thing and was torn apart in the news because of it? If I remember correctly, he immediately began backtracking when interviewed afterwards.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-03 03:44:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "mrmixitup"
    },
    {
        "content": "Sad thing is, a lot of those guys were on their way home. \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin",
        "intTime": 20090503,
        "postID": 28,
        "quote": "",
        "reply": "Sad thing is, a lot of those guys were on their way home. \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-03 17:55:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "boughtwaprice"
    },
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by crackerjacks61: Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out. So, you are saying that we went in and got Saddam and instead of staying so we could try to stop all of the murdering terrorists that were running around Iraq, we should have just left them to slaughter and brutalize the innocent citizens of Iraq? Is that what you are saying? Yep Thats what hes saying.We Went there to disarm him, assure he was not a threat to our national security, Removed a dictator in the process, Then it was time to leave not take sides in thier civil war.",
        "intTime": 20090503,
        "postID": 29,
        "quote": "Originally posted by AngelHeart: quote: Originally posted by crackerjacks61: Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out. So, you are saying that we went in and got Saddam and instead of staying so we could try to stop all of the murdering terrorists that were running around Iraq, we should have just left them to slaughter and brutalize the innocent citizens of Iraq? Is that what you are saying?",
        "reply": " Yep Thats what hes saying.We Went there to disarm him, assure he was not a threat to our national security, Removed a dictator in the process, Then it was time to leave not take sides in thier civil war.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-03 21:08:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "john2x"
    },
    {
        "content": "quote: Originally posted by boughtwaprice: Sad thing is, a lot of those guys were on their way home. ...hey girl! love the new avatar....and yes ....sad day when short timers die.....or anyone for that matter... Already past the future",
        "intTime": 20090504,
        "postID": 30,
        "quote": "Originally posted by boughtwaprice: Sad thing is, a lot of those guys were on their way home.",
        "reply": " ...hey girl! love the new avatar....and yes ....sad day when short timers die.....or anyone for that matter... Already past the future",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-04 04:53:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "6486143"
    },
    {
        "content": "October, 2004: WEBB: You know, the sad thing is, there‘s not a thing that has occurred in Iraq that was not only predictable but predicted. And predicted with good military advice to this administration. WEBB: My view of it, when Vice President Cheney repeatedly says that the people who have questioned the war against Iraq don‘t understand the post-9/11 world, my view is the complete reverse. The people who did this, this was on their to-do list when they got into the administration, and they did not... MATTHEWS: Cheney? WEBB: Cheney and the whole group that really put this together. They wanted this as a part of what was going to happen in the Bush administration. One way or the other, they were waiting for... (CROSSTALK) MATTHEWS: That‘s why they joined, you could argue. WEBB: And in my view, these people don‘t understand the realities post-9/11. Post-9/11, this was a bad idea. Pre-9/11, I still would have opposed it, but at least it was an arguable idea. MATTHEWS: Because—why is it more of a bad idea now since 9/11? WEBB: Because international terrorism really moved in a dramatic way from a regional problem to a global problem. We saw that we had to step to the forefront. We had all the nations of the world with us after 9/11. And we systematically alienated a huge percentage of the world at a time we needed their cooperation. We tied down our military in static positions when we had developed, for 10 or 15 years, we had worked on a maneuverable military. And now we dumped them into static positions. So it is a bad idea in terms of international politics, a bad idea in terms of grand strategy, and a bad idea in how to use the military. MATTHEWS: Did we dare the Arab world to take us on in Iraq? The young men of the Arab world? Did we say, go ahead, make our day, go ahead, step up to the plate, you got it? WEBB: Clearly, it was the inevitable consequences of anyone who thought this through. MATTHEWS: Like bring it on. That‘s what the president said. And they did. WEBB: And well, I think that by putting our people in Iraq, we certainly made them targets in a way that they wouldn‘t have been if we were fighting the war against international terrorism from a position to maneuver.\" ------------- Our guys are still dying in Iraq because of criminal negligence by the Bush Administration. Walt",
        "intTime": 20090504,
        "postID": 31,
        "quote": "",
        "reply": "October, 2004: WEBB: You know, the sad thing is, there‘s not a thing that has occurred in Iraq that was not only predictable but predicted. And predicted with good military advice to this administration. WEBB: My view of it, when Vice President Cheney repeatedly says that the people who have questioned the war against Iraq don‘t understand the post-9/11 world, my view is the complete reverse. The people who did this, this was on their to-do list when they got into the administration, and they did not... MATTHEWS: Cheney? WEBB: Cheney and the whole group that really put this together. They wanted this as a part of what was going to happen in the Bush administration. One way or the other, they were waiting for... (CROSSTALK) MATTHEWS: That‘s why they joined, you could argue. WEBB: And in my view, these people don‘t understand the realities post-9/11. Post-9/11, this was a bad idea. Pre-9/11, I still would have opposed it, but at least it was an arguable idea. MATTHEWS: Because—why is it more of a bad idea now since 9/11? WEBB: Because international terrorism really moved in a dramatic way from a regional problem to a global problem. We saw that we had to step to the forefront. We had all the nations of the world with us after 9/11. And we systematically alienated a huge percentage of the world at a time we needed their cooperation. We tied down our military in static positions when we had developed, for 10 or 15 years, we had worked on a maneuverable military. And now we dumped them into static positions. So it is a bad idea in terms of international politics, a bad idea in terms of grand strategy, and a bad idea in how to use the military. MATTHEWS: Did we dare the Arab world to take us on in Iraq? The young men of the Arab world? Did we say, go ahead, make our day, go ahead, step up to the plate, you got it? WEBB: Clearly, it was the inevitable consequences of anyone who thought this through. MATTHEWS: Like bring it on. That‘s what the president said. And they did. WEBB: And well, I think that by putting our people in Iraq, we certainly made them targets in a way that they wouldn‘t have been if we were fighting the war against international terrorism from a position to maneuver.\" ------------- Our guys are still dying in Iraq because of criminal negligence by the Bush Administration. Walt",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-04 06:20:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "WhiskeyPapa"
    },
    {
        "content": "quote: Originally posted by Proudformermarine: Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 The fact that we have 60% of our available combat forces unavailable for combat due to current obligations and repeated deployments in simultaneous wars is likely making our enemies pretty bold. If we had to go to war with Iran tomorrow, we'd be in SERIOUS trouble.",
        "intTime": 20090504,
        "postID": 32,
        "quote": "Originally posted by Proudformermarine: Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989",
        "reply": " The fact that we have 60% of our available combat forces unavailable for combat due to current obligations and repeated deployments in simultaneous wars is likely making our enemies pretty bold. If we had to go to war with Iran tomorrow, we'd be in SERIOUS trouble.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-04 07:54:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "mrmixitup"
    },
    {
        "content": "The comparison of the violence in Chicago to the violence in Iraq by bushies who think that “we won” in Iraq is ridicules. For the month of April. 2009: Number of bombings in Chicago – 0 Number of bombings in Iraq – too many to count. Number of people killed by bombs – too many to count Number of suicide bombings in Chicago – 0 Number of suicide in Iraq – eight. Number of people killed by suicide bombs – more than 200 Number of people killed by mortar attacks in Chicago – 0 Number of people killed by mortar attacks in Baghdad – 4. Number of police officers murdered in Chicago – 0 Number of police officers murdered in Iraq – too many to count. Number of violent attacks on government officials in Chicago – 0 Number of violent attacks on government officials in Chicago – too many to count Number of power stations sabotaged in Chicago – 0 Number of power stations sabotaged in Iraq – 1 The violence in Iraq is increasing, because the mission of the “surge” strategy was to decrease the violence, not to do anything about the causes of the violence. The insurgency and al Qaeda are still very active in Iraq. Here is the security report of just the last six days in Iraq. Yusufiya: #1: Gunmen opened fire on a government-backed Sunni Arab militia checkpoint in Yusufiya, 20 km (12 miles) south of Baghdad, wounding one fighter, early on Saturday, police said. Kut: #1: The decomposed body of a young man was found inside his house in central al-Kut city on Friday, a security source said. “The body showed signs of having been shot. It decayed after remaining for a long time on the roof,” he added. Kirkuk: #1: Iraqi police say a roadside bomb has killed at least three people near the northern city of Kirkuk. The victims are civilians who were traveling about 20 miles (32 kilometers) south of the ethnically mixed city. Police Brig. Gen. Sarhad Qadir says the blast hit a car and cement mixer. Three construction workers were killed and two injured in a bomb blast in Iraq's northern province of Kirkuk Saturday, police said. 'A bomb struck a car carrying builders on a road in Taz-Touz Khormato district,' senior police officer Fekrat Rachid told the German Press Agency dpa. Sulaimaniyah: #1: Iranian helicopters attacked three Iraqi Kurdish villages in a pre-dawn raid on Saturday, a senior border guard official said, the first time Iran has used aircraft against Kurdish rebels. There were no immediate reports of casualties.\"At 4 am (0100 GMT) they attacked with artillery the villages of Kani Saif, Jomarasi and Kara Sozi, that belong to the Panjwin district,\" a senior Iraqi border guard official told AFP on condition of anonymity. \"After the attacks at 9 am three Iranian helicopters attacked these areas again,\" he said. \"This is the first time they have used helicopters.\" Mosul: #1: Five civilians were killed and six others wounded in a suicide blast inside a casino in northern Mosul city on Friday, police said. “A suicide bomber with an explosive belt attacked the al-Shiraa casino in the tourist area of Sadd al-Mosul, (40 km) northern Mosul, killing five civilians and wounding six others,” a security source from Ninewa police told Aswat al-Iraq news agency. Baghdad: #1: Around 7:30 p.m. a roadside bomb detonated in Binouk neighborhood in eastern Baghdad on Thursday. Three people were injured. #2: Around 8:30 p.m. a roadside bomb detonated in New Baghdad neighborhood in eastern Baghdad on Thursday. Four people were wounded. Wasit Prv: #1: Unidentified gunmen have destroyed a power station feeding the Ahdab oil field which a Chinese firm is developing. A provincial official, refusing to be named said: “Installations belonging to an important oil field have been subjected to a terrorist attack from unidentified gunmen. Amarra: #1: Two U.S. soldiers were killed by sniper bullets in the city of al-Amara on Thursday, said a security source from the Missan province police. “The two U.S. soldiers were killed when their patrol came under sniper fire in central Amara,” the source told Aswat al-Iraq news agency. Basra: #1: Five security personnel were wounded when an improvised explosive device (IED) went off in central Basra on Friday, an official security source from the city’s police said. “The five bomb squad personnel were wounded while trying to defuse a charge planted near a fuel station in al-Muftiya, central Basra,” the source told Aswat al-Iraq news agency. Tikrit: #1: Joint U.S.-Iraqi forces Friday killed a policeman and one of his relatives in central Tikrit, a police source said. “A joint force of Iraqi and U.S. personnel raided a house in al-Zuhour neighborhood in central Tikrit on the wee small hours of Friday (May 1) and killed Emad Soliman, a policeman, and his cousin who is working with the Sahwa forces,” the source told Aswat al-Iraq news agency. Mosul: #1: Unknown gunmen killed an Iraqi soldier in eastern Mosul, according to a security source on Friday. “Unknown armed men on Thursday night (April 30) killed a soldier near his house in al-Zahraa neighborhood in eastern Mosul,” the source told Aswat al-Iraq news agency. #2: A roadside bomb targeted an American patrol in Mosul AlJadida (New Mosul) neighborhood in western Mosul on Wednesday night. No casualties reported. #3: Gunmen killed an Iraqi soldier in front of his house in Zahraa neighborhood in east Mosul on Thursday afternoon. #4: Gunmen killed a guard of the KDP (Kurdstan Democratic Party) near one of the party’s headquarters in Faisaliyah neighborhood in eastern Mosul in the evening. Tal Afar: #1: Policemen found the bodies of three brothers west of the city of Mosul on Thursday, a security source in Ninewa said. “The bodies were found shot inside their vehicle in Tal Abta area, Talafar district, (60 km) west of Mosul,” the source told Aswat al-Iraq news agency. Al Anbar Prv: The two U.S. Marines and one sailor were killed Thursday while conducting combat operations in Anbar province, said a military statement. Anbar is a former insurgent stronghold that has been relatively calm since Sunni tribal leaders turned against al-Qaida in Iraq. Ramadi: #1: Four unidentified decomposed bodies were found near al-Ramadi Hospital west of the city, according to a security source in al-Anbar province on Thursday. “The bodies were found buried near al-Ramadi Public Hospital, west of the city. They were found after a terrorist was arrested and confessed to the place where these bodies were buried,” the source told Aswat al-Iraq news agency. Baghdad: #1: Five people were killed and five were wounded by a roadside bomb in Hor Rijab, a village on the southwestern outskirts of Baghdad. #2: A roadside bomb wounded five civilians in the Shurta district of southwestern Baghdad, police said. #3: Two bombs placed in parked cars killed two people and wounded eight others near a Shi'ite mosque in the Hurriya district of northwestern Baghdad, police said. #4: Around 7 p.m. a roadside bomb targeted an American patrol in Khadraa neighborhood in western Baghdad on Wednesday. No casualties reported. #5: A roadside bomb wounded three civilians in the Karrada district of central Baghdad, police said. Diyala Prv: #1: Three Iraqi soldiers were killed on patrol and two others wounded when two roadside bombs went off in Himreen area of northeastern Diyala province, police said. Kut: #1: Two policemen on Wednesday were killed and five men, including an Iranian, were wounded in a road accident in Kut city, according to a local security source. “A police vehicle collided with a bus carrying Iranian visitors at the northern entrance to Kut city,” the source told Aswat al-Iraq new agency. Abu Ghraib: #1: A roadside bomb wounded three civilians in Abu Ghraib, on the western outskirts of Baghdad, police said. Mosul: #1: Two separate roadside bombs in southern Mosul, 390 km (240 miles) north of Baghdad, killed one policeman and wounded five civilians, police said. #2: Two civilians were wounded by a roadside bomb in eastern Mosul, police said. #3: A roadside bomb in the south of Mosul, 390 km (240 miles) north of Baghdad, targeted a police patrol, wounding two policemen, police said. Northern Iraq: #1: Turkey's military said it had launched air strikes against suspected Kurdistan Workers Party (PKK) bases in northern Iraq overnight and on Thursday. No further details were immediately available. Fallujah: #1: Four bodyguards of the Islamic party in Falluja were wounded on Thursday in a bomb explosion in the south of the city, a source from the party said. “An improvised explosive device went off on Thursday (April 30) targeting the motorcade of a senior official of the Islamic party in Nezal neighborhood in the south of Falluja, injuring four of his bodyguards,” the source told Aswat al-Iraq news agency. “The explosion also damaged his vehicle,” he added. Baghdad: #1: Clashes erupted today between an Iraqi army force and guards of a building belongs to the Trade Ministry, eyewitnesses said on Wednesday, with no word on casualties. “The clashes broke out on Wednesday morning (April 29) when the Iraqi army force attempted to arrest one of the Ministry’s employees in the building,” eyewitnesses told Aswat al-Iraq news agency by phone. “Clashes stooped shortly after that, a matter that allowed evacuating other employees from the building,” another eyewitness said. #2: In three separate incidents the Iraqi Security Forces detonated under control three parked car bombs in Abu Disheer and Hay al Mualimeen in southern Baghdad, and in Amil neighbourhood in southwestern Baghdad Wednesday morning. #3: A roadside bomb targeted a U.S. military convoy in Shaab neighbourhood, northern Baghdad at 3 p.m. Tuesday. No casualties were reported. #4: Iraqi police say two car bombs have killed at least 17 people in Baghdad's Shiite district of Sadr City. The blasts went off in quick succession Wednesday from parked cars filled with explosives. A police official says at least 17 people were killed and nearly 50 wounded. The toll from twin car bomb blasts on Wednesday in a busy market in Baghdad jumped to 41 killed and 68 wounded, Iraqi police said. Diyala Prv: Baquba: #1: A roadside bomb on Tuesday went off targeting a U.S. patrol in Baaquba suburb, said a security source from Diala, while the province’s police commander said that a wanted woman was arrested south of Baaquba. “The roadside bomb went off in central Baaquba while a U.S. patrol was passing by,” the source told Aswat al-Iraq news agency. “One of the patrol’s vehicles was heavily damaged,” he said. The source did not mention anything about casualties, while U.S. forces have not yet commented on the incident. Kirkuk: #1: A US-Iraqi patrol has been ambushed while distributing grants to Iraqi businesses near the northern city of Kirkuk, the American military said Wednesday. Iraqi officials said two civilians were killed when the Americans returned fire, but the US military said those killed were enemy fighters. US spokesman Maj. Derrick Cheng said several people launched grenades and began shooting Wednesday as the patrol was handing out micro-grant money to stimulate small businesses in the town of Riyadh. He said reports indicate \"two enemy killed and one wounded,\" and one American was also wounded. Mosul: #1: Gunmen, on foot, attacked and killed a civilian while he was shopping in al Zinjeeli commercial centre in western Mosul, Tuesday morning. Early investigations showed that he was the father of two policemen. #2: A roadside bomb targeted a police patrol in Qahira neighbourhood, downtown Mosul Tuesday injuring three policemen. #3: A roadside bomb targeted a police patrol in New Mosul at 8 a.m. Wednesday injuring two policemen. Baghdad: #1: Sunday A roadside bomb targeted a national police patrol in Dora neighborhood in southern Baghdad around 9:30 p.m. One policeman was killed and another one was wounded. #2: The director general of Basra’s police department on Monday survived an assassination attempt when an explosive device targeted his vehicle in Baghdad, according to a media chief. “Today, an improvised explosive device (IED) targeted Basra’s police chief, Staff Maj. Gen. Adel Kamel Raham, in Jaraf al-Nadaf area, southeastern Baghdad,” Col. Abdulkareem al-Zaydi told Aswat al-Iraq news agency.The explosion caused damage to the official’s vehicle, but no casualties were reported, Zaydi added. #3: Gunmen threw a grenade on a police patrol beneath the Jadiriyah Bridge in downtown Baghdad around 9 p.m. Two policemen were wounded with their car damaged. Dhuluiya: #1: Seven suspected al Qaeda insurgents were killed in clashes with U.S. forces in a largely Sunni Arab province of Iraq, the U.S. military said Monday. Iraqi police in the area said Iraqi forces allied with the Americans were involved and that clashes continued throughout Sunday in the town of Dhuluiya, 70 km (45 miles) north of Baghdad. They put the death toll of the gunmen at nine. Lieutenant Colonel Mohammed Jassim, a police official in Dhuluiya, said the fighting began early Sunday and resulted in the arrest of 17 suspected militants, four of them non-Iraqi Arabs. Four suspected insurgents were wounded. Salman Pek: #1: Major General Adel Dahaam, police chief of the southern city of Basra, was unharmed in a roadside bomb attack in Salman Pak, 30 km (20 miles) southeast of Baghdad. Police said Dahaam was off-duty at the time. Irbil: #1: A shepherd was wounded on Monday when an explosive charge went off south of Arbil, said a police source from the province. “The incident took place at Bashtappa village of Qosh-tappa district, 45 km south of Arbil city,” the source told Aswat al-Iraq news agency. Kirkuk: #1: Unknown gunmen stormed a house on Sunday night and shot dead two Christian women in the Domiz neighborhood in southern Kirkuk, some 250 km north of Baghdad, Brigadier Burhan Tayib, the city police chief told Xinhua. #2: Separately, unidentified armed men stormed another house also on Sunday night in the June 1st neighborhood of southern Kirkuk, killing a man and wounding his father and brother, Tayib said. Mosul: #1: Sunday A policeman was killed after insurgents broke in his house in alKhadraa area in east Mosul on Sunday morning. #2: A roadside bomb wounded two Iraqi soldiers and one civilian in nothern Mosul, 390 km (240 miles) north of Baghdad, police said. #3: Police said they found the body of a man who had been shot in the head and chest in western Mosul. #4: U.S. forces on Monday injured a woman in eastern Mosul, a security source said, adding that police found a civilian body in the western section of the city. “A woman was wounded on Monday in a random shootout by U.S. forces in al-Faisaliya region in eastern Mosul,” the source told Aswat al-Iraq news agency.",
        "intTime": 20090502,
        "postID": 33,
        "quote": "",
        "reply": "The comparison of the violence in Chicago to the violence in Iraq by bushies who think that “we won” in Iraq is ridicules. For the month of April. 2009: Number of bombings in Chicago – 0 Number of bombings in Iraq – too many to count. Number of people killed by bombs – too many to count Number of suicide bombings in Chicago – 0 Number of suicide in Iraq – eight. Number of people killed by suicide bombs – more than 200 Number of people killed by mortar attacks in Chicago – 0 Number of people killed by mortar attacks in Baghdad – 4. Number of police officers murdered in Chicago – 0 Number of police officers murdered in Iraq – too many to count. Number of violent attacks on government officials in Chicago – 0 Number of violent attacks on government officials in Chicago – too many to count Number of power stations sabotaged in Chicago – 0 Number of power stations sabotaged in Iraq – 1 The violence in Iraq is increasing, because the mission of the “surge” strategy was to decrease the violence, not to do anything about the causes of the violence. The insurgency and al Qaeda are still very active in Iraq. Here is the security report of just the last six days in Iraq. Yusufiya: #1: Gunmen opened fire on a government-backed Sunni Arab militia checkpoint in Yusufiya, 20 km (12 miles) south of Baghdad, wounding one fighter, early on Saturday, police said. Kut: #1: The decomposed body of a young man was found inside his house in central al-Kut city on Friday, a security source said. “The body showed signs of having been shot. It decayed after remaining for a long time on the roof,” he added. Kirkuk: #1: Iraqi police say a roadside bomb has killed at least three people near the northern city of Kirkuk. The victims are civilians who were traveling about 20 miles (32 kilometers) south of the ethnically mixed city. Police Brig. Gen. Sarhad Qadir says the blast hit a car and cement mixer. Three construction workers were killed and two injured in a bomb blast in Iraq's northern province of Kirkuk Saturday, police said. 'A bomb struck a car carrying builders on a road in Taz-Touz Khormato district,' senior police officer Fekrat Rachid told the German Press Agency dpa. Sulaimaniyah: #1: Iranian helicopters attacked three Iraqi Kurdish villages in a pre-dawn raid on Saturday, a senior border guard official said, the first time Iran has used aircraft against Kurdish rebels. There were no immediate reports of casualties.\"At 4 am (0100 GMT) they attacked with artillery the villages of Kani Saif, Jomarasi and Kara Sozi, that belong to the Panjwin district,\" a senior Iraqi border guard official told AFP on condition of anonymity. \"After the attacks at 9 am three Iranian helicopters attacked these areas again,\" he said. \"This is the first time they have used helicopters.\" Mosul: #1: Five civilians were killed and six others wounded in a suicide blast inside a casino in northern Mosul city on Friday, police said. “A suicide bomber with an explosive belt attacked the al-Shiraa casino in the tourist area of Sadd al-Mosul, (40 km) northern Mosul, killing five civilians and wounding six others,” a security source from Ninewa police told Aswat al-Iraq news agency. Baghdad: #1: Around 7:30 p.m. a roadside bomb detonated in Binouk neighborhood in eastern Baghdad on Thursday. Three people were injured. #2: Around 8:30 p.m. a roadside bomb detonated in New Baghdad neighborhood in eastern Baghdad on Thursday. Four people were wounded. Wasit Prv: #1: Unidentified gunmen have destroyed a power station feeding the Ahdab oil field which a Chinese firm is developing. A provincial official, refusing to be named said: “Installations belonging to an important oil field have been subjected to a terrorist attack from unidentified gunmen. Amarra: #1: Two U.S. soldiers were killed by sniper bullets in the city of al-Amara on Thursday, said a security source from the Missan province police. “The two U.S. soldiers were killed when their patrol came under sniper fire in central Amara,” the source told Aswat al-Iraq news agency. Basra: #1: Five security personnel were wounded when an improvised explosive device (IED) went off in central Basra on Friday, an official security source from the city’s police said. “The five bomb squad personnel were wounded while trying to defuse a charge planted near a fuel station in al-Muftiya, central Basra,” the source told Aswat al-Iraq news agency. Tikrit: #1: Joint U.S.-Iraqi forces Friday killed a policeman and one of his relatives in central Tikrit, a police source said. “A joint force of Iraqi and U.S. personnel raided a house in al-Zuhour neighborhood in central Tikrit on the wee small hours of Friday (May 1) and killed Emad Soliman, a policeman, and his cousin who is working with the Sahwa forces,” the source told Aswat al-Iraq news agency. Mosul: #1: Unknown gunmen killed an Iraqi soldier in eastern Mosul, according to a security source on Friday. “Unknown armed men on Thursday night (April 30) killed a soldier near his house in al-Zahraa neighborhood in eastern Mosul,” the source told Aswat al-Iraq news agency. #2: A roadside bomb targeted an American patrol in Mosul AlJadida (New Mosul) neighborhood in western Mosul on Wednesday night. No casualties reported. #3: Gunmen killed an Iraqi soldier in front of his house in Zahraa neighborhood in east Mosul on Thursday afternoon. #4: Gunmen killed a guard of the KDP (Kurdstan Democratic Party) near one of the party’s headquarters in Faisaliyah neighborhood in eastern Mosul in the evening. Tal Afar: #1: Policemen found the bodies of three brothers west of the city of Mosul on Thursday, a security source in Ninewa said. “The bodies were found shot inside their vehicle in Tal Abta area, Talafar district, (60 km) west of Mosul,” the source told Aswat al-Iraq news agency. Al Anbar Prv: The two U.S. Marines and one sailor were killed Thursday while conducting combat operations in Anbar province, said a military statement. Anbar is a former insurgent stronghold that has been relatively calm since Sunni tribal leaders turned against al-Qaida in Iraq. Ramadi: #1: Four unidentified decomposed bodies were found near al-Ramadi Hospital west of the city, according to a security source in al-Anbar province on Thursday. “The bodies were found buried near al-Ramadi Public Hospital, west of the city. They were found after a terrorist was arrested and confessed to the place where these bodies were buried,” the source told Aswat al-Iraq news agency. Baghdad: #1: Five people were killed and five were wounded by a roadside bomb in Hor Rijab, a village on the southwestern outskirts of Baghdad. #2: A roadside bomb wounded five civilians in the Shurta district of southwestern Baghdad, police said. #3: Two bombs placed in parked cars killed two people and wounded eight others near a Shi'ite mosque in the Hurriya district of northwestern Baghdad, police said. #4: Around 7 p.m. a roadside bomb targeted an American patrol in Khadraa neighborhood in western Baghdad on Wednesday. No casualties reported. #5: A roadside bomb wounded three civilians in the Karrada district of central Baghdad, police said. Diyala Prv: #1: Three Iraqi soldiers were killed on patrol and two others wounded when two roadside bombs went off in Himreen area of northeastern Diyala province, police said. Kut: #1: Two policemen on Wednesday were killed and five men, including an Iranian, were wounded in a road accident in Kut city, according to a local security source. “A police vehicle collided with a bus carrying Iranian visitors at the northern entrance to Kut city,” the source told Aswat al-Iraq new agency. Abu Ghraib: #1: A roadside bomb wounded three civilians in Abu Ghraib, on the western outskirts of Baghdad, police said. Mosul: #1: Two separate roadside bombs in southern Mosul, 390 km (240 miles) north of Baghdad, killed one policeman and wounded five civilians, police said. #2: Two civilians were wounded by a roadside bomb in eastern Mosul, police said. #3: A roadside bomb in the south of Mosul, 390 km (240 miles) north of Baghdad, targeted a police patrol, wounding two policemen, police said. Northern Iraq: #1: Turkey's military said it had launched air strikes against suspected Kurdistan Workers Party (PKK) bases in northern Iraq overnight and on Thursday. No further details were immediately available. Fallujah: #1: Four bodyguards of the Islamic party in Falluja were wounded on Thursday in a bomb explosion in the south of the city, a source from the party said. “An improvised explosive device went off on Thursday (April 30) targeting the motorcade of a senior official of the Islamic party in Nezal neighborhood in the south of Falluja, injuring four of his bodyguards,” the source told Aswat al-Iraq news agency. “The explosion also damaged his vehicle,” he added. Baghdad: #1: Clashes erupted today between an Iraqi army force and guards of a building belongs to the Trade Ministry, eyewitnesses said on Wednesday, with no word on casualties. “The clashes broke out on Wednesday morning (April 29) when the Iraqi army force attempted to arrest one of the Ministry’s employees in the building,” eyewitnesses told Aswat al-Iraq news agency by phone. “Clashes stooped shortly after that, a matter that allowed evacuating other employees from the building,” another eyewitness said. #2: In three separate incidents the Iraqi Security Forces detonated under control three parked car bombs in Abu Disheer and Hay al Mualimeen in southern Baghdad, and in Amil neighbourhood in southwestern Baghdad Wednesday morning. #3: A roadside bomb targeted a U.S. military convoy in Shaab neighbourhood, northern Baghdad at 3 p.m. Tuesday. No casualties were reported. #4: Iraqi police say two car bombs have killed at least 17 people in Baghdad's Shiite district of Sadr City. The blasts went off in quick succession Wednesday from parked cars filled with explosives. A police official says at least 17 people were killed and nearly 50 wounded. The toll from twin car bomb blasts on Wednesday in a busy market in Baghdad jumped to 41 killed and 68 wounded, Iraqi police said. Diyala Prv: Baquba: #1: A roadside bomb on Tuesday went off targeting a U.S. patrol in Baaquba suburb, said a security source from Diala, while the province’s police commander said that a wanted woman was arrested south of Baaquba. “The roadside bomb went off in central Baaquba while a U.S. patrol was passing by,” the source told Aswat al-Iraq news agency. “One of the patrol’s vehicles was heavily damaged,” he said. The source did not mention anything about casualties, while U.S. forces have not yet commented on the incident. Kirkuk: #1: A US-Iraqi patrol has been ambushed while distributing grants to Iraqi businesses near the northern city of Kirkuk, the American military said Wednesday. Iraqi officials said two civilians were killed when the Americans returned fire, but the US military said those killed were enemy fighters. US spokesman Maj. Derrick Cheng said several people launched grenades and began shooting Wednesday as the patrol was handing out micro-grant money to stimulate small businesses in the town of Riyadh. He said reports indicate \"two enemy killed and one wounded,\" and one American was also wounded. Mosul: #1: Gunmen, on foot, attacked and killed a civilian while he was shopping in al Zinjeeli commercial centre in western Mosul, Tuesday morning. Early investigations showed that he was the father of two policemen. #2: A roadside bomb targeted a police patrol in Qahira neighbourhood, downtown Mosul Tuesday injuring three policemen. #3: A roadside bomb targeted a police patrol in New Mosul at 8 a.m. Wednesday injuring two policemen. Baghdad: #1: Sunday A roadside bomb targeted a national police patrol in Dora neighborhood in southern Baghdad around 9:30 p.m. One policeman was killed and another one was wounded. #2: The director general of Basra’s police department on Monday survived an assassination attempt when an explosive device targeted his vehicle in Baghdad, according to a media chief. “Today, an improvised explosive device (IED) targeted Basra’s police chief, Staff Maj. Gen. Adel Kamel Raham, in Jaraf al-Nadaf area, southeastern Baghdad,” Col. Abdulkareem al-Zaydi told Aswat al-Iraq news agency.The explosion caused damage to the official’s vehicle, but no casualties were reported, Zaydi added. #3: Gunmen threw a grenade on a police patrol beneath the Jadiriyah Bridge in downtown Baghdad around 9 p.m. Two policemen were wounded with their car damaged. Dhuluiya: #1: Seven suspected al Qaeda insurgents were killed in clashes with U.S. forces in a largely Sunni Arab province of Iraq, the U.S. military said Monday. Iraqi police in the area said Iraqi forces allied with the Americans were involved and that clashes continued throughout Sunday in the town of Dhuluiya, 70 km (45 miles) north of Baghdad. They put the death toll of the gunmen at nine. Lieutenant Colonel Mohammed Jassim, a police official in Dhuluiya, said the fighting began early Sunday and resulted in the arrest of 17 suspected militants, four of them non-Iraqi Arabs. Four suspected insurgents were wounded. Salman Pek: #1: Major General Adel Dahaam, police chief of the southern city of Basra, was unharmed in a roadside bomb attack in Salman Pak, 30 km (20 miles) southeast of Baghdad. Police said Dahaam was off-duty at the time. Irbil: #1: A shepherd was wounded on Monday when an explosive charge went off south of Arbil, said a police source from the province. “The incident took place at Bashtappa village of Qosh-tappa district, 45 km south of Arbil city,” the source told Aswat al-Iraq news agency. Kirkuk: #1: Unknown gunmen stormed a house on Sunday night and shot dead two Christian women in the Domiz neighborhood in southern Kirkuk, some 250 km north of Baghdad, Brigadier Burhan Tayib, the city police chief told Xinhua. #2: Separately, unidentified armed men stormed another house also on Sunday night in the June 1st neighborhood of southern Kirkuk, killing a man and wounding his father and brother, Tayib said. Mosul: #1: Sunday A policeman was killed after insurgents broke in his house in alKhadraa area in east Mosul on Sunday morning. #2: A roadside bomb wounded two Iraqi soldiers and one civilian in nothern Mosul, 390 km (240 miles) north of Baghdad, police said. #3: Police said they found the body of a man who had been shot in the head and chest in western Mosul. #4: U.S. forces on Monday injured a woman in eastern Mosul, a security source said, adding that police found a civilian body in the western section of the city. “A woman was wounded on Monday in a random shootout by U.S. forces in al-Faisaliya region in eastern Mosul,” the source told Aswat al-Iraq news agency.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 09:26:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "xerello"
    },
    {
        "content": "Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story?",
        "intTime": 20090502,
        "postID": 34,
        "quote": "",
        "reply": "Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story?",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 09:40:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "mrmixitup"
    },
    {
        "content": "quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months.",
        "intTime": 20090502,
        "postID": 35,
        "quote": "Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story?",
        "reply": " It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 12:05:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "xerello"
    },
    {
        "content": "quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then... Already past the future",
        "intTime": 20090502,
        "postID": 36,
        "quote": "April Deadliest Month in Iraq.",
        "reply": " ....lets see...by the past standards applied here....it is Oboma's fault then... Already past the future",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 12:28:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "6486143"
    },
    {
        "content": "Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out.",
        "intTime": 20090502,
        "postID": 37,
        "quote": "",
        "reply": "Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 14:42:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by 6486143: quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then... Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989",
        "intTime": 20090502,
        "postID": 38,
        "quote": "Originally posted by 6486143: quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then...",
        "reply": " Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 15:20:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "Proudformermarine"
    },
    {
        "content": "If Obama doesn't start putting his strong face people will keep pooping on it! This message has been edited. Last edited by: EAG154, Sat 02 May 2009 05:06 PM",
        "intTime": 20090502,
        "postID": 39,
        "quote": "",
        "reply": "If Obama doesn't start putting his strong face people will keep pooping on it! This message has been edited. Last edited by: EAG154, Sat 02 May 2009 05:06 PM",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 16:32:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out. So, you are saying that we went in and got Saddam and instead of staying so we could try to stop all of the murdering terrorists that were running around Iraq, we should have just left them to slaughter and brutalize the innocent citizens of Iraq? Is that what you are saying?",
        "intTime": 20090502,
        "postID": 40,
        "quote": "Originally posted by crackerjacks61: Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out.",
        "reply": " So, you are saying that we went in and got Saddam and instead of staying so we could try to stop all of the murdering terrorists that were running around Iraq, we should have just left them to slaughter and brutalize the innocent citizens of Iraq? Is that what you are saying?",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 16:34:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090502,
        "postID": 41,
        "quote": "Originally posted by xerello: quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months.",
        "reply": " \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 16:36:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by Proudformermarine: quote: Originally posted by 6486143: quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then... Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 quote: \"We have had some increase in the number of these high-profile attacks, but nowhere near what we were seeing a year or a year and half ago,\" he said Friday in a briefing for reporters. The attack raised to at least 18 the number of American troops deaths in April, double the nine killed in March, which was the lowest since the war began in March 2003. That made April the deadliest month for U.S. forces since September, when 25 American troops died. Millions of Shiites make the annual pilgrimage to Karbala in April every year. Bombings always spike in April as AQ tries to inflame sectarian violence during these pilgrimages. I swear you people will shamelessly try to spin anything.",
        "intTime": 20090502,
        "postID": 42,
        "quote": "Originally posted by Proudformermarine: quote: Originally posted by 6486143: quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then... Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989",
        "reply": " quote: \"We have had some increase in the number of these high-profile attacks, but nowhere near what we were seeing a year or a year and half ago,\" he said Friday in a briefing for reporters. The attack raised to at least 18 the number of American troops deaths in April, double the nine killed in March, which was the lowest since the war began in March 2003. That made April the deadliest month for U.S. forces since September, when 25 American troops died. Millions of Shiites make the annual pilgrimage to Karbala in April every year. Bombings always spike in April as AQ tries to inflame sectarian violence during these pilgrimages. I swear you people will shamelessly try to spin anything.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 21:27:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "Esample1"
    },
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months. Didn't some idiot mayor of some city already do the same thing and was torn apart in the news because of it? If I remember correctly, he immediately began backtracking when interviewed afterwards.",
        "intTime": 20090503,
        "postID": 43,
        "quote": "Originally posted by xerello: quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months.",
        "reply": " Didn't some idiot mayor of some city already do the same thing and was torn apart in the news because of it? If I remember correctly, he immediately began backtracking when interviewed afterwards.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-03 03:44:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "mrmixitup"
    },
    {
        "content": "Sad thing is, a lot of those guys were on their way home. \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin",
        "intTime": 20090503,
        "postID": 44,
        "quote": "",
        "reply": "Sad thing is, a lot of those guys were on their way home. \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-03 17:55:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "boughtwaprice"
    },
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by crackerjacks61: Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out. So, you are saying that we went in and got Saddam and instead of staying so we could try to stop all of the murdering terrorists that were running around Iraq, we should have just left them to slaughter and brutalize the innocent citizens of Iraq? Is that what you are saying? Yep Thats what hes saying.We Went there to disarm him, assure he was not a threat to our national security, Removed a dictator in the process, Then it was time to leave not take sides in thier civil war.",
        "intTime": 20090503,
        "postID": 45,
        "quote": "Originally posted by AngelHeart: quote: Originally posted by crackerjacks61: Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out. So, you are saying that we went in and got Saddam and instead of staying so we could try to stop all of the murdering terrorists that were running around Iraq, we should have just left them to slaughter and brutalize the innocent citizens of Iraq? Is that what you are saying?",
        "reply": " Yep Thats what hes saying.We Went there to disarm him, assure he was not a threat to our national security, Removed a dictator in the process, Then it was time to leave not take sides in thier civil war.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-03 21:08:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "john2x"
    },
    {
        "content": "quote: Originally posted by boughtwaprice: Sad thing is, a lot of those guys were on their way home. ...hey girl! love the new avatar....and yes ....sad day when short timers die.....or anyone for that matter... Already past the future",
        "intTime": 20090504,
        "postID": 46,
        "quote": "Originally posted by boughtwaprice: Sad thing is, a lot of those guys were on their way home.",
        "reply": " ...hey girl! love the new avatar....and yes ....sad day when short timers die.....or anyone for that matter... Already past the future",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-04 04:53:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "6486143"
    },
    {
        "content": "October, 2004: WEBB: You know, the sad thing is, there‘s not a thing that has occurred in Iraq that was not only predictable but predicted. And predicted with good military advice to this administration. WEBB: My view of it, when Vice President Cheney repeatedly says that the people who have questioned the war against Iraq don‘t understand the post-9/11 world, my view is the complete reverse. The people who did this, this was on their to-do list when they got into the administration, and they did not... MATTHEWS: Cheney? WEBB: Cheney and the whole group that really put this together. They wanted this as a part of what was going to happen in the Bush administration. One way or the other, they were waiting for... (CROSSTALK) MATTHEWS: That‘s why they joined, you could argue. WEBB: And in my view, these people don‘t understand the realities post-9/11. Post-9/11, this was a bad idea. Pre-9/11, I still would have opposed it, but at least it was an arguable idea. MATTHEWS: Because—why is it more of a bad idea now since 9/11? WEBB: Because international terrorism really moved in a dramatic way from a regional problem to a global problem. We saw that we had to step to the forefront. We had all the nations of the world with us after 9/11. And we systematically alienated a huge percentage of the world at a time we needed their cooperation. We tied down our military in static positions when we had developed, for 10 or 15 years, we had worked on a maneuverable military. And now we dumped them into static positions. So it is a bad idea in terms of international politics, a bad idea in terms of grand strategy, and a bad idea in how to use the military. MATTHEWS: Did we dare the Arab world to take us on in Iraq? The young men of the Arab world? Did we say, go ahead, make our day, go ahead, step up to the plate, you got it? WEBB: Clearly, it was the inevitable consequences of anyone who thought this through. MATTHEWS: Like bring it on. That‘s what the president said. And they did. WEBB: And well, I think that by putting our people in Iraq, we certainly made them targets in a way that they wouldn‘t have been if we were fighting the war against international terrorism from a position to maneuver.\" ------------- Our guys are still dying in Iraq because of criminal negligence by the Bush Administration. Walt",
        "intTime": 20090504,
        "postID": 47,
        "quote": "",
        "reply": "October, 2004: WEBB: You know, the sad thing is, there‘s not a thing that has occurred in Iraq that was not only predictable but predicted. And predicted with good military advice to this administration. WEBB: My view of it, when Vice President Cheney repeatedly says that the people who have questioned the war against Iraq don‘t understand the post-9/11 world, my view is the complete reverse. The people who did this, this was on their to-do list when they got into the administration, and they did not... MATTHEWS: Cheney? WEBB: Cheney and the whole group that really put this together. They wanted this as a part of what was going to happen in the Bush administration. One way or the other, they were waiting for... (CROSSTALK) MATTHEWS: That‘s why they joined, you could argue. WEBB: And in my view, these people don‘t understand the realities post-9/11. Post-9/11, this was a bad idea. Pre-9/11, I still would have opposed it, but at least it was an arguable idea. MATTHEWS: Because—why is it more of a bad idea now since 9/11? WEBB: Because international terrorism really moved in a dramatic way from a regional problem to a global problem. We saw that we had to step to the forefront. We had all the nations of the world with us after 9/11. And we systematically alienated a huge percentage of the world at a time we needed their cooperation. We tied down our military in static positions when we had developed, for 10 or 15 years, we had worked on a maneuverable military. And now we dumped them into static positions. So it is a bad idea in terms of international politics, a bad idea in terms of grand strategy, and a bad idea in how to use the military. MATTHEWS: Did we dare the Arab world to take us on in Iraq? The young men of the Arab world? Did we say, go ahead, make our day, go ahead, step up to the plate, you got it? WEBB: Clearly, it was the inevitable consequences of anyone who thought this through. MATTHEWS: Like bring it on. That‘s what the president said. And they did. WEBB: And well, I think that by putting our people in Iraq, we certainly made them targets in a way that they wouldn‘t have been if we were fighting the war against international terrorism from a position to maneuver.\" ------------- Our guys are still dying in Iraq because of criminal negligence by the Bush Administration. Walt",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-04 06:20:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "WhiskeyPapa"
    },
    {
        "content": "quote: Originally posted by Proudformermarine: Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 The fact that we have 60% of our available combat forces unavailable for combat due to current obligations and repeated deployments in simultaneous wars is likely making our enemies pretty bold. If we had to go to war with Iran tomorrow, we'd be in SERIOUS trouble.",
        "intTime": 20090504,
        "postID": 48,
        "quote": "Originally posted by Proudformermarine: Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989",
        "reply": " The fact that we have 60% of our available combat forces unavailable for combat due to current obligations and repeated deployments in simultaneous wars is likely making our enemies pretty bold. If we had to go to war with Iran tomorrow, we'd be in SERIOUS trouble.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-04 07:54:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "mrmixitup"
    },
    {
        "content": "The comparison of the violence in Chicago to the violence in Iraq by bushies who think that “we won” in Iraq is ridicules. For the month of April. 2009: Number of bombings in Chicago – 0 Number of bombings in Iraq – too many to count. Number of people killed by bombs – too many to count Number of suicide bombings in Chicago – 0 Number of suicide in Iraq – eight. Number of people killed by suicide bombs – more than 200 Number of people killed by mortar attacks in Chicago – 0 Number of people killed by mortar attacks in Baghdad – 4. Number of police officers murdered in Chicago – 0 Number of police officers murdered in Iraq – too many to count. Number of violent attacks on government officials in Chicago – 0 Number of violent attacks on government officials in Chicago – too many to count Number of power stations sabotaged in Chicago – 0 Number of power stations sabotaged in Iraq – 1 The violence in Iraq is increasing, because the mission of the “surge” strategy was to decrease the violence, not to do anything about the causes of the violence. The insurgency and al Qaeda are still very active in Iraq. Here is the security report of just the last six days in Iraq. Yusufiya: #1: Gunmen opened fire on a government-backed Sunni Arab militia checkpoint in Yusufiya, 20 km (12 miles) south of Baghdad, wounding one fighter, early on Saturday, police said. Kut: #1: The decomposed body of a young man was found inside his house in central al-Kut city on Friday, a security source said. “The body showed signs of having been shot. It decayed after remaining for a long time on the roof,” he added. Kirkuk: #1: Iraqi police say a roadside bomb has killed at least three people near the northern city of Kirkuk. The victims are civilians who were traveling about 20 miles (32 kilometers) south of the ethnically mixed city. Police Brig. Gen. Sarhad Qadir says the blast hit a car and cement mixer. Three construction workers were killed and two injured in a bomb blast in Iraq's northern province of Kirkuk Saturday, police said. 'A bomb struck a car carrying builders on a road in Taz-Touz Khormato district,' senior police officer Fekrat Rachid told the German Press Agency dpa. Sulaimaniyah: #1: Iranian helicopters attacked three Iraqi Kurdish villages in a pre-dawn raid on Saturday, a senior border guard official said, the first time Iran has used aircraft against Kurdish rebels. There were no immediate reports of casualties.\"At 4 am (0100 GMT) they attacked with artillery the villages of Kani Saif, Jomarasi and Kara Sozi, that belong to the Panjwin district,\" a senior Iraqi border guard official told AFP on condition of anonymity. \"After the attacks at 9 am three Iranian helicopters attacked these areas again,\" he said. \"This is the first time they have used helicopters.\" Mosul: #1: Five civilians were killed and six others wounded in a suicide blast inside a casino in northern Mosul city on Friday, police said. “A suicide bomber with an explosive belt attacked the al-Shiraa casino in the tourist area of Sadd al-Mosul, (40 km) northern Mosul, killing five civilians and wounding six others,” a security source from Ninewa police told Aswat al-Iraq news agency. Baghdad: #1: Around 7:30 p.m. a roadside bomb detonated in Binouk neighborhood in eastern Baghdad on Thursday. Three people were injured. #2: Around 8:30 p.m. a roadside bomb detonated in New Baghdad neighborhood in eastern Baghdad on Thursday. Four people were wounded. Wasit Prv: #1: Unidentified gunmen have destroyed a power station feeding the Ahdab oil field which a Chinese firm is developing. A provincial official, refusing to be named said: “Installations belonging to an important oil field have been subjected to a terrorist attack from unidentified gunmen. Amarra: #1: Two U.S. soldiers were killed by sniper bullets in the city of al-Amara on Thursday, said a security source from the Missan province police. “The two U.S. soldiers were killed when their patrol came under sniper fire in central Amara,” the source told Aswat al-Iraq news agency. Basra: #1: Five security personnel were wounded when an improvised explosive device (IED) went off in central Basra on Friday, an official security source from the city’s police said. “The five bomb squad personnel were wounded while trying to defuse a charge planted near a fuel station in al-Muftiya, central Basra,” the source told Aswat al-Iraq news agency. Tikrit: #1: Joint U.S.-Iraqi forces Friday killed a policeman and one of his relatives in central Tikrit, a police source said. “A joint force of Iraqi and U.S. personnel raided a house in al-Zuhour neighborhood in central Tikrit on the wee small hours of Friday (May 1) and killed Emad Soliman, a policeman, and his cousin who is working with the Sahwa forces,” the source told Aswat al-Iraq news agency. Mosul: #1: Unknown gunmen killed an Iraqi soldier in eastern Mosul, according to a security source on Friday. “Unknown armed men on Thursday night (April 30) killed a soldier near his house in al-Zahraa neighborhood in eastern Mosul,” the source told Aswat al-Iraq news agency. #2: A roadside bomb targeted an American patrol in Mosul AlJadida (New Mosul) neighborhood in western Mosul on Wednesday night. No casualties reported. #3: Gunmen killed an Iraqi soldier in front of his house in Zahraa neighborhood in east Mosul on Thursday afternoon. #4: Gunmen killed a guard of the KDP (Kurdstan Democratic Party) near one of the party’s headquarters in Faisaliyah neighborhood in eastern Mosul in the evening. Tal Afar: #1: Policemen found the bodies of three brothers west of the city of Mosul on Thursday, a security source in Ninewa said. “The bodies were found shot inside their vehicle in Tal Abta area, Talafar district, (60 km) west of Mosul,” the source told Aswat al-Iraq news agency. Al Anbar Prv: The two U.S. Marines and one sailor were killed Thursday while conducting combat operations in Anbar province, said a military statement. Anbar is a former insurgent stronghold that has been relatively calm since Sunni tribal leaders turned against al-Qaida in Iraq. Ramadi: #1: Four unidentified decomposed bodies were found near al-Ramadi Hospital west of the city, according to a security source in al-Anbar province on Thursday. “The bodies were found buried near al-Ramadi Public Hospital, west of the city. They were found after a terrorist was arrested and confessed to the place where these bodies were buried,” the source told Aswat al-Iraq news agency. Baghdad: #1: Five people were killed and five were wounded by a roadside bomb in Hor Rijab, a village on the southwestern outskirts of Baghdad. #2: A roadside bomb wounded five civilians in the Shurta district of southwestern Baghdad, police said. #3: Two bombs placed in parked cars killed two people and wounded eight others near a Shi'ite mosque in the Hurriya district of northwestern Baghdad, police said. #4: Around 7 p.m. a roadside bomb targeted an American patrol in Khadraa neighborhood in western Baghdad on Wednesday. No casualties reported. #5: A roadside bomb wounded three civilians in the Karrada district of central Baghdad, police said. Diyala Prv: #1: Three Iraqi soldiers were killed on patrol and two others wounded when two roadside bombs went off in Himreen area of northeastern Diyala province, police said. Kut: #1: Two policemen on Wednesday were killed and five men, including an Iranian, were wounded in a road accident in Kut city, according to a local security source. “A police vehicle collided with a bus carrying Iranian visitors at the northern entrance to Kut city,” the source told Aswat al-Iraq new agency. Abu Ghraib: #1: A roadside bomb wounded three civilians in Abu Ghraib, on the western outskirts of Baghdad, police said. Mosul: #1: Two separate roadside bombs in southern Mosul, 390 km (240 miles) north of Baghdad, killed one policeman and wounded five civilians, police said. #2: Two civilians were wounded by a roadside bomb in eastern Mosul, police said. #3: A roadside bomb in the south of Mosul, 390 km (240 miles) north of Baghdad, targeted a police patrol, wounding two policemen, police said. Northern Iraq: #1: Turkey's military said it had launched air strikes against suspected Kurdistan Workers Party (PKK) bases in northern Iraq overnight and on Thursday. No further details were immediately available. Fallujah: #1: Four bodyguards of the Islamic party in Falluja were wounded on Thursday in a bomb explosion in the south of the city, a source from the party said. “An improvised explosive device went off on Thursday (April 30) targeting the motorcade of a senior official of the Islamic party in Nezal neighborhood in the south of Falluja, injuring four of his bodyguards,” the source told Aswat al-Iraq news agency. “The explosion also damaged his vehicle,” he added. Baghdad: #1: Clashes erupted today between an Iraqi army force and guards of a building belongs to the Trade Ministry, eyewitnesses said on Wednesday, with no word on casualties. “The clashes broke out on Wednesday morning (April 29) when the Iraqi army force attempted to arrest one of the Ministry’s employees in the building,” eyewitnesses told Aswat al-Iraq news agency by phone. “Clashes stooped shortly after that, a matter that allowed evacuating other employees from the building,” another eyewitness said. #2: In three separate incidents the Iraqi Security Forces detonated under control three parked car bombs in Abu Disheer and Hay al Mualimeen in southern Baghdad, and in Amil neighbourhood in southwestern Baghdad Wednesday morning. #3: A roadside bomb targeted a U.S. military convoy in Shaab neighbourhood, northern Baghdad at 3 p.m. Tuesday. No casualties were reported. #4: Iraqi police say two car bombs have killed at least 17 people in Baghdad's Shiite district of Sadr City. The blasts went off in quick succession Wednesday from parked cars filled with explosives. A police official says at least 17 people were killed and nearly 50 wounded. The toll from twin car bomb blasts on Wednesday in a busy market in Baghdad jumped to 41 killed and 68 wounded, Iraqi police said. Diyala Prv: Baquba: #1: A roadside bomb on Tuesday went off targeting a U.S. patrol in Baaquba suburb, said a security source from Diala, while the province’s police commander said that a wanted woman was arrested south of Baaquba. “The roadside bomb went off in central Baaquba while a U.S. patrol was passing by,” the source told Aswat al-Iraq news agency. “One of the patrol’s vehicles was heavily damaged,” he said. The source did not mention anything about casualties, while U.S. forces have not yet commented on the incident. Kirkuk: #1: A US-Iraqi patrol has been ambushed while distributing grants to Iraqi businesses near the northern city of Kirkuk, the American military said Wednesday. Iraqi officials said two civilians were killed when the Americans returned fire, but the US military said those killed were enemy fighters. US spokesman Maj. Derrick Cheng said several people launched grenades and began shooting Wednesday as the patrol was handing out micro-grant money to stimulate small businesses in the town of Riyadh. He said reports indicate \"two enemy killed and one wounded,\" and one American was also wounded. Mosul: #1: Gunmen, on foot, attacked and killed a civilian while he was shopping in al Zinjeeli commercial centre in western Mosul, Tuesday morning. Early investigations showed that he was the father of two policemen. #2: A roadside bomb targeted a police patrol in Qahira neighbourhood, downtown Mosul Tuesday injuring three policemen. #3: A roadside bomb targeted a police patrol in New Mosul at 8 a.m. Wednesday injuring two policemen. Baghdad: #1: Sunday A roadside bomb targeted a national police patrol in Dora neighborhood in southern Baghdad around 9:30 p.m. One policeman was killed and another one was wounded. #2: The director general of Basra’s police department on Monday survived an assassination attempt when an explosive device targeted his vehicle in Baghdad, according to a media chief. “Today, an improvised explosive device (IED) targeted Basra’s police chief, Staff Maj. Gen. Adel Kamel Raham, in Jaraf al-Nadaf area, southeastern Baghdad,” Col. Abdulkareem al-Zaydi told Aswat al-Iraq news agency.The explosion caused damage to the official’s vehicle, but no casualties were reported, Zaydi added. #3: Gunmen threw a grenade on a police patrol beneath the Jadiriyah Bridge in downtown Baghdad around 9 p.m. Two policemen were wounded with their car damaged. Dhuluiya: #1: Seven suspected al Qaeda insurgents were killed in clashes with U.S. forces in a largely Sunni Arab province of Iraq, the U.S. military said Monday. Iraqi police in the area said Iraqi forces allied with the Americans were involved and that clashes continued throughout Sunday in the town of Dhuluiya, 70 km (45 miles) north of Baghdad. They put the death toll of the gunmen at nine. Lieutenant Colonel Mohammed Jassim, a police official in Dhuluiya, said the fighting began early Sunday and resulted in the arrest of 17 suspected militants, four of them non-Iraqi Arabs. Four suspected insurgents were wounded. Salman Pek: #1: Major General Adel Dahaam, police chief of the southern city of Basra, was unharmed in a roadside bomb attack in Salman Pak, 30 km (20 miles) southeast of Baghdad. Police said Dahaam was off-duty at the time. Irbil: #1: A shepherd was wounded on Monday when an explosive charge went off south of Arbil, said a police source from the province. “The incident took place at Bashtappa village of Qosh-tappa district, 45 km south of Arbil city,” the source told Aswat al-Iraq news agency. Kirkuk: #1: Unknown gunmen stormed a house on Sunday night and shot dead two Christian women in the Domiz neighborhood in southern Kirkuk, some 250 km north of Baghdad, Brigadier Burhan Tayib, the city police chief told Xinhua. #2: Separately, unidentified armed men stormed another house also on Sunday night in the June 1st neighborhood of southern Kirkuk, killing a man and wounding his father and brother, Tayib said. Mosul: #1: Sunday A policeman was killed after insurgents broke in his house in alKhadraa area in east Mosul on Sunday morning. #2: A roadside bomb wounded two Iraqi soldiers and one civilian in nothern Mosul, 390 km (240 miles) north of Baghdad, police said. #3: Police said they found the body of a man who had been shot in the head and chest in western Mosul. #4: U.S. forces on Monday injured a woman in eastern Mosul, a security source said, adding that police found a civilian body in the western section of the city. “A woman was wounded on Monday in a random shootout by U.S. forces in al-Faisaliya region in eastern Mosul,” the source told Aswat al-Iraq news agency.",
        "intTime": 20090502,
        "postID": 49,
        "quote": "",
        "reply": "The comparison of the violence in Chicago to the violence in Iraq by bushies who think that “we won” in Iraq is ridicules. For the month of April. 2009: Number of bombings in Chicago – 0 Number of bombings in Iraq – too many to count. Number of people killed by bombs – too many to count Number of suicide bombings in Chicago – 0 Number of suicide in Iraq – eight. Number of people killed by suicide bombs – more than 200 Number of people killed by mortar attacks in Chicago – 0 Number of people killed by mortar attacks in Baghdad – 4. Number of police officers murdered in Chicago – 0 Number of police officers murdered in Iraq – too many to count. Number of violent attacks on government officials in Chicago – 0 Number of violent attacks on government officials in Chicago – too many to count Number of power stations sabotaged in Chicago – 0 Number of power stations sabotaged in Iraq – 1 The violence in Iraq is increasing, because the mission of the “surge” strategy was to decrease the violence, not to do anything about the causes of the violence. The insurgency and al Qaeda are still very active in Iraq. Here is the security report of just the last six days in Iraq. Yusufiya: #1: Gunmen opened fire on a government-backed Sunni Arab militia checkpoint in Yusufiya, 20 km (12 miles) south of Baghdad, wounding one fighter, early on Saturday, police said. Kut: #1: The decomposed body of a young man was found inside his house in central al-Kut city on Friday, a security source said. “The body showed signs of having been shot. It decayed after remaining for a long time on the roof,” he added. Kirkuk: #1: Iraqi police say a roadside bomb has killed at least three people near the northern city of Kirkuk. The victims are civilians who were traveling about 20 miles (32 kilometers) south of the ethnically mixed city. Police Brig. Gen. Sarhad Qadir says the blast hit a car and cement mixer. Three construction workers were killed and two injured in a bomb blast in Iraq's northern province of Kirkuk Saturday, police said. 'A bomb struck a car carrying builders on a road in Taz-Touz Khormato district,' senior police officer Fekrat Rachid told the German Press Agency dpa. Sulaimaniyah: #1: Iranian helicopters attacked three Iraqi Kurdish villages in a pre-dawn raid on Saturday, a senior border guard official said, the first time Iran has used aircraft against Kurdish rebels. There were no immediate reports of casualties.\"At 4 am (0100 GMT) they attacked with artillery the villages of Kani Saif, Jomarasi and Kara Sozi, that belong to the Panjwin district,\" a senior Iraqi border guard official told AFP on condition of anonymity. \"After the attacks at 9 am three Iranian helicopters attacked these areas again,\" he said. \"This is the first time they have used helicopters.\" Mosul: #1: Five civilians were killed and six others wounded in a suicide blast inside a casino in northern Mosul city on Friday, police said. “A suicide bomber with an explosive belt attacked the al-Shiraa casino in the tourist area of Sadd al-Mosul, (40 km) northern Mosul, killing five civilians and wounding six others,” a security source from Ninewa police told Aswat al-Iraq news agency. Baghdad: #1: Around 7:30 p.m. a roadside bomb detonated in Binouk neighborhood in eastern Baghdad on Thursday. Three people were injured. #2: Around 8:30 p.m. a roadside bomb detonated in New Baghdad neighborhood in eastern Baghdad on Thursday. Four people were wounded. Wasit Prv: #1: Unidentified gunmen have destroyed a power station feeding the Ahdab oil field which a Chinese firm is developing. A provincial official, refusing to be named said: “Installations belonging to an important oil field have been subjected to a terrorist attack from unidentified gunmen. Amarra: #1: Two U.S. soldiers were killed by sniper bullets in the city of al-Amara on Thursday, said a security source from the Missan province police. “The two U.S. soldiers were killed when their patrol came under sniper fire in central Amara,” the source told Aswat al-Iraq news agency. Basra: #1: Five security personnel were wounded when an improvised explosive device (IED) went off in central Basra on Friday, an official security source from the city’s police said. “The five bomb squad personnel were wounded while trying to defuse a charge planted near a fuel station in al-Muftiya, central Basra,” the source told Aswat al-Iraq news agency. Tikrit: #1: Joint U.S.-Iraqi forces Friday killed a policeman and one of his relatives in central Tikrit, a police source said. “A joint force of Iraqi and U.S. personnel raided a house in al-Zuhour neighborhood in central Tikrit on the wee small hours of Friday (May 1) and killed Emad Soliman, a policeman, and his cousin who is working with the Sahwa forces,” the source told Aswat al-Iraq news agency. Mosul: #1: Unknown gunmen killed an Iraqi soldier in eastern Mosul, according to a security source on Friday. “Unknown armed men on Thursday night (April 30) killed a soldier near his house in al-Zahraa neighborhood in eastern Mosul,” the source told Aswat al-Iraq news agency. #2: A roadside bomb targeted an American patrol in Mosul AlJadida (New Mosul) neighborhood in western Mosul on Wednesday night. No casualties reported. #3: Gunmen killed an Iraqi soldier in front of his house in Zahraa neighborhood in east Mosul on Thursday afternoon. #4: Gunmen killed a guard of the KDP (Kurdstan Democratic Party) near one of the party’s headquarters in Faisaliyah neighborhood in eastern Mosul in the evening. Tal Afar: #1: Policemen found the bodies of three brothers west of the city of Mosul on Thursday, a security source in Ninewa said. “The bodies were found shot inside their vehicle in Tal Abta area, Talafar district, (60 km) west of Mosul,” the source told Aswat al-Iraq news agency. Al Anbar Prv: The two U.S. Marines and one sailor were killed Thursday while conducting combat operations in Anbar province, said a military statement. Anbar is a former insurgent stronghold that has been relatively calm since Sunni tribal leaders turned against al-Qaida in Iraq. Ramadi: #1: Four unidentified decomposed bodies were found near al-Ramadi Hospital west of the city, according to a security source in al-Anbar province on Thursday. “The bodies were found buried near al-Ramadi Public Hospital, west of the city. They were found after a terrorist was arrested and confessed to the place where these bodies were buried,” the source told Aswat al-Iraq news agency. Baghdad: #1: Five people were killed and five were wounded by a roadside bomb in Hor Rijab, a village on the southwestern outskirts of Baghdad. #2: A roadside bomb wounded five civilians in the Shurta district of southwestern Baghdad, police said. #3: Two bombs placed in parked cars killed two people and wounded eight others near a Shi'ite mosque in the Hurriya district of northwestern Baghdad, police said. #4: Around 7 p.m. a roadside bomb targeted an American patrol in Khadraa neighborhood in western Baghdad on Wednesday. No casualties reported. #5: A roadside bomb wounded three civilians in the Karrada district of central Baghdad, police said. Diyala Prv: #1: Three Iraqi soldiers were killed on patrol and two others wounded when two roadside bombs went off in Himreen area of northeastern Diyala province, police said. Kut: #1: Two policemen on Wednesday were killed and five men, including an Iranian, were wounded in a road accident in Kut city, according to a local security source. “A police vehicle collided with a bus carrying Iranian visitors at the northern entrance to Kut city,” the source told Aswat al-Iraq new agency. Abu Ghraib: #1: A roadside bomb wounded three civilians in Abu Ghraib, on the western outskirts of Baghdad, police said. Mosul: #1: Two separate roadside bombs in southern Mosul, 390 km (240 miles) north of Baghdad, killed one policeman and wounded five civilians, police said. #2: Two civilians were wounded by a roadside bomb in eastern Mosul, police said. #3: A roadside bomb in the south of Mosul, 390 km (240 miles) north of Baghdad, targeted a police patrol, wounding two policemen, police said. Northern Iraq: #1: Turkey's military said it had launched air strikes against suspected Kurdistan Workers Party (PKK) bases in northern Iraq overnight and on Thursday. No further details were immediately available. Fallujah: #1: Four bodyguards of the Islamic party in Falluja were wounded on Thursday in a bomb explosion in the south of the city, a source from the party said. “An improvised explosive device went off on Thursday (April 30) targeting the motorcade of a senior official of the Islamic party in Nezal neighborhood in the south of Falluja, injuring four of his bodyguards,” the source told Aswat al-Iraq news agency. “The explosion also damaged his vehicle,” he added. Baghdad: #1: Clashes erupted today between an Iraqi army force and guards of a building belongs to the Trade Ministry, eyewitnesses said on Wednesday, with no word on casualties. “The clashes broke out on Wednesday morning (April 29) when the Iraqi army force attempted to arrest one of the Ministry’s employees in the building,” eyewitnesses told Aswat al-Iraq news agency by phone. “Clashes stooped shortly after that, a matter that allowed evacuating other employees from the building,” another eyewitness said. #2: In three separate incidents the Iraqi Security Forces detonated under control three parked car bombs in Abu Disheer and Hay al Mualimeen in southern Baghdad, and in Amil neighbourhood in southwestern Baghdad Wednesday morning. #3: A roadside bomb targeted a U.S. military convoy in Shaab neighbourhood, northern Baghdad at 3 p.m. Tuesday. No casualties were reported. #4: Iraqi police say two car bombs have killed at least 17 people in Baghdad's Shiite district of Sadr City. The blasts went off in quick succession Wednesday from parked cars filled with explosives. A police official says at least 17 people were killed and nearly 50 wounded. The toll from twin car bomb blasts on Wednesday in a busy market in Baghdad jumped to 41 killed and 68 wounded, Iraqi police said. Diyala Prv: Baquba: #1: A roadside bomb on Tuesday went off targeting a U.S. patrol in Baaquba suburb, said a security source from Diala, while the province’s police commander said that a wanted woman was arrested south of Baaquba. “The roadside bomb went off in central Baaquba while a U.S. patrol was passing by,” the source told Aswat al-Iraq news agency. “One of the patrol’s vehicles was heavily damaged,” he said. The source did not mention anything about casualties, while U.S. forces have not yet commented on the incident. Kirkuk: #1: A US-Iraqi patrol has been ambushed while distributing grants to Iraqi businesses near the northern city of Kirkuk, the American military said Wednesday. Iraqi officials said two civilians were killed when the Americans returned fire, but the US military said those killed were enemy fighters. US spokesman Maj. Derrick Cheng said several people launched grenades and began shooting Wednesday as the patrol was handing out micro-grant money to stimulate small businesses in the town of Riyadh. He said reports indicate \"two enemy killed and one wounded,\" and one American was also wounded. Mosul: #1: Gunmen, on foot, attacked and killed a civilian while he was shopping in al Zinjeeli commercial centre in western Mosul, Tuesday morning. Early investigations showed that he was the father of two policemen. #2: A roadside bomb targeted a police patrol in Qahira neighbourhood, downtown Mosul Tuesday injuring three policemen. #3: A roadside bomb targeted a police patrol in New Mosul at 8 a.m. Wednesday injuring two policemen. Baghdad: #1: Sunday A roadside bomb targeted a national police patrol in Dora neighborhood in southern Baghdad around 9:30 p.m. One policeman was killed and another one was wounded. #2: The director general of Basra’s police department on Monday survived an assassination attempt when an explosive device targeted his vehicle in Baghdad, according to a media chief. “Today, an improvised explosive device (IED) targeted Basra’s police chief, Staff Maj. Gen. Adel Kamel Raham, in Jaraf al-Nadaf area, southeastern Baghdad,” Col. Abdulkareem al-Zaydi told Aswat al-Iraq news agency.The explosion caused damage to the official’s vehicle, but no casualties were reported, Zaydi added. #3: Gunmen threw a grenade on a police patrol beneath the Jadiriyah Bridge in downtown Baghdad around 9 p.m. Two policemen were wounded with their car damaged. Dhuluiya: #1: Seven suspected al Qaeda insurgents were killed in clashes with U.S. forces in a largely Sunni Arab province of Iraq, the U.S. military said Monday. Iraqi police in the area said Iraqi forces allied with the Americans were involved and that clashes continued throughout Sunday in the town of Dhuluiya, 70 km (45 miles) north of Baghdad. They put the death toll of the gunmen at nine. Lieutenant Colonel Mohammed Jassim, a police official in Dhuluiya, said the fighting began early Sunday and resulted in the arrest of 17 suspected militants, four of them non-Iraqi Arabs. Four suspected insurgents were wounded. Salman Pek: #1: Major General Adel Dahaam, police chief of the southern city of Basra, was unharmed in a roadside bomb attack in Salman Pak, 30 km (20 miles) southeast of Baghdad. Police said Dahaam was off-duty at the time. Irbil: #1: A shepherd was wounded on Monday when an explosive charge went off south of Arbil, said a police source from the province. “The incident took place at Bashtappa village of Qosh-tappa district, 45 km south of Arbil city,” the source told Aswat al-Iraq news agency. Kirkuk: #1: Unknown gunmen stormed a house on Sunday night and shot dead two Christian women in the Domiz neighborhood in southern Kirkuk, some 250 km north of Baghdad, Brigadier Burhan Tayib, the city police chief told Xinhua. #2: Separately, unidentified armed men stormed another house also on Sunday night in the June 1st neighborhood of southern Kirkuk, killing a man and wounding his father and brother, Tayib said. Mosul: #1: Sunday A policeman was killed after insurgents broke in his house in alKhadraa area in east Mosul on Sunday morning. #2: A roadside bomb wounded two Iraqi soldiers and one civilian in nothern Mosul, 390 km (240 miles) north of Baghdad, police said. #3: Police said they found the body of a man who had been shot in the head and chest in western Mosul. #4: U.S. forces on Monday injured a woman in eastern Mosul, a security source said, adding that police found a civilian body in the western section of the city. “A woman was wounded on Monday in a random shootout by U.S. forces in al-Faisaliya region in eastern Mosul,” the source told Aswat al-Iraq news agency.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 09:26:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "xerello"
    },
    {
        "content": "Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story?",
        "intTime": 20090502,
        "postID": 50,
        "quote": "",
        "reply": "Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story?",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 09:40:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "mrmixitup"
    },
    {
        "content": "quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months.",
        "intTime": 20090502,
        "postID": 51,
        "quote": "Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story?",
        "reply": " It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 12:05:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "xerello"
    },
    {
        "content": "quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then... Already past the future",
        "intTime": 20090502,
        "postID": 52,
        "quote": "April Deadliest Month in Iraq.",
        "reply": " ....lets see...by the past standards applied here....it is Oboma's fault then... Already past the future",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 12:28:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "6486143"
    },
    {
        "content": "Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out.",
        "intTime": 20090502,
        "postID": 53,
        "quote": "",
        "reply": "Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 14:42:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by 6486143: quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then... Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989",
        "intTime": 20090502,
        "postID": 54,
        "quote": "Originally posted by 6486143: quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then...",
        "reply": " Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 15:20:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "Proudformermarine"
    },
    {
        "content": "If Obama doesn't start putting his strong face people will keep pooping on it! This message has been edited. Last edited by: EAG154, Sat 02 May 2009 05:06 PM",
        "intTime": 20090502,
        "postID": 55,
        "quote": "",
        "reply": "If Obama doesn't start putting his strong face people will keep pooping on it! This message has been edited. Last edited by: EAG154, Sat 02 May 2009 05:06 PM",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 16:32:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "EAG154"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out. So, you are saying that we went in and got Saddam and instead of staying so we could try to stop all of the murdering terrorists that were running around Iraq, we should have just left them to slaughter and brutalize the innocent citizens of Iraq? Is that what you are saying?",
        "intTime": 20090502,
        "postID": 56,
        "quote": "Originally posted by crackerjacks61: Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out.",
        "reply": " So, you are saying that we went in and got Saddam and instead of staying so we could try to stop all of the murdering terrorists that were running around Iraq, we should have just left them to slaughter and brutalize the innocent citizens of Iraq? Is that what you are saying?",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 16:34:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090502,
        "postID": 57,
        "quote": "Originally posted by xerello: quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months.",
        "reply": " \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 16:36:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by Proudformermarine: quote: Originally posted by 6486143: quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then... Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 quote: \"We have had some increase in the number of these high-profile attacks, but nowhere near what we were seeing a year or a year and half ago,\" he said Friday in a briefing for reporters. The attack raised to at least 18 the number of American troops deaths in April, double the nine killed in March, which was the lowest since the war began in March 2003. That made April the deadliest month for U.S. forces since September, when 25 American troops died. Millions of Shiites make the annual pilgrimage to Karbala in April every year. Bombings always spike in April as AQ tries to inflame sectarian violence during these pilgrimages. I swear you people will shamelessly try to spin anything.",
        "intTime": 20090502,
        "postID": 58,
        "quote": "Originally posted by Proudformermarine: quote: Originally posted by 6486143: quote: April Deadliest Month in Iraq. ....lets see...by the past standards applied here....it is Oboma's fault then... Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989",
        "reply": " quote: \"We have had some increase in the number of these high-profile attacks, but nowhere near what we were seeing a year or a year and half ago,\" he said Friday in a briefing for reporters. The attack raised to at least 18 the number of American troops deaths in April, double the nine killed in March, which was the lowest since the war began in March 2003. That made April the deadliest month for U.S. forces since September, when 25 American troops died. Millions of Shiites make the annual pilgrimage to Karbala in April every year. Bombings always spike in April as AQ tries to inflame sectarian violence during these pilgrimages. I swear you people will shamelessly try to spin anything.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-02 21:27:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "Esample1"
    },
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months. Didn't some idiot mayor of some city already do the same thing and was torn apart in the news because of it? If I remember correctly, he immediately began backtracking when interviewed afterwards.",
        "intTime": 20090503,
        "postID": 59,
        "quote": "Originally posted by xerello: quote: Originally posted by mrmixitup: Did you intend on comparing deaths in Iraq to Chicago? Did you post the right link but copy the wrong story? It is confusing because bushies use the straw argument that “in the United States there are more deaths in the month of April” than in Iraq. It is not true, but it makes them feel better about the disaster of the Iraq war and ignore the increase in violence that has been going on for the last couple of months.",
        "reply": " Didn't some idiot mayor of some city already do the same thing and was torn apart in the news because of it? If I remember correctly, he immediately began backtracking when interviewed afterwards.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-03 03:44:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "mrmixitup"
    },
    {
        "content": "Sad thing is, a lot of those guys were on their way home. \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin",
        "intTime": 20090503,
        "postID": 60,
        "quote": "",
        "reply": "Sad thing is, a lot of those guys were on their way home. \"It is the weak who are cruel. Gentleness can only be expected from the strong\" -- Leo Roskin",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-03 17:55:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "boughtwaprice"
    },
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by crackerjacks61: Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out. So, you are saying that we went in and got Saddam and instead of staying so we could try to stop all of the murdering terrorists that were running around Iraq, we should have just left them to slaughter and brutalize the innocent citizens of Iraq? Is that what you are saying? Yep Thats what hes saying.We Went there to disarm him, assure he was not a threat to our national security, Removed a dictator in the process, Then it was time to leave not take sides in thier civil war.",
        "intTime": 20090503,
        "postID": 61,
        "quote": "Originally posted by AngelHeart: quote: Originally posted by crackerjacks61: Th War was won once we \"defeated\" and captured SH (for whatever reason). We fixed what we broke, mission over, lets get out. So, you are saying that we went in and got Saddam and instead of staying so we could try to stop all of the murdering terrorists that were running around Iraq, we should have just left them to slaughter and brutalize the innocent citizens of Iraq? Is that what you are saying?",
        "reply": " Yep Thats what hes saying.We Went there to disarm him, assure he was not a threat to our national security, Removed a dictator in the process, Then it was time to leave not take sides in thier civil war.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-03 21:08:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "john2x"
    },
    {
        "content": "quote: Originally posted by boughtwaprice: Sad thing is, a lot of those guys were on their way home. ...hey girl! love the new avatar....and yes ....sad day when short timers die.....or anyone for that matter... Already past the future",
        "intTime": 20090504,
        "postID": 62,
        "quote": "Originally posted by boughtwaprice: Sad thing is, a lot of those guys were on their way home.",
        "reply": " ...hey girl! love the new avatar....and yes ....sad day when short timers die.....or anyone for that matter... Already past the future",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-04 04:53:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "6486143"
    },
    {
        "content": "October, 2004: WEBB: You know, the sad thing is, there‘s not a thing that has occurred in Iraq that was not only predictable but predicted. And predicted with good military advice to this administration. WEBB: My view of it, when Vice President Cheney repeatedly says that the people who have questioned the war against Iraq don‘t understand the post-9/11 world, my view is the complete reverse. The people who did this, this was on their to-do list when they got into the administration, and they did not... MATTHEWS: Cheney? WEBB: Cheney and the whole group that really put this together. They wanted this as a part of what was going to happen in the Bush administration. One way or the other, they were waiting for... (CROSSTALK) MATTHEWS: That‘s why they joined, you could argue. WEBB: And in my view, these people don‘t understand the realities post-9/11. Post-9/11, this was a bad idea. Pre-9/11, I still would have opposed it, but at least it was an arguable idea. MATTHEWS: Because—why is it more of a bad idea now since 9/11? WEBB: Because international terrorism really moved in a dramatic way from a regional problem to a global problem. We saw that we had to step to the forefront. We had all the nations of the world with us after 9/11. And we systematically alienated a huge percentage of the world at a time we needed their cooperation. We tied down our military in static positions when we had developed, for 10 or 15 years, we had worked on a maneuverable military. And now we dumped them into static positions. So it is a bad idea in terms of international politics, a bad idea in terms of grand strategy, and a bad idea in how to use the military. MATTHEWS: Did we dare the Arab world to take us on in Iraq? The young men of the Arab world? Did we say, go ahead, make our day, go ahead, step up to the plate, you got it? WEBB: Clearly, it was the inevitable consequences of anyone who thought this through. MATTHEWS: Like bring it on. That‘s what the president said. And they did. WEBB: And well, I think that by putting our people in Iraq, we certainly made them targets in a way that they wouldn‘t have been if we were fighting the war against international terrorism from a position to maneuver.\" ------------- Our guys are still dying in Iraq because of criminal negligence by the Bush Administration. Walt",
        "intTime": 20090504,
        "postID": 63,
        "quote": "",
        "reply": "October, 2004: WEBB: You know, the sad thing is, there‘s not a thing that has occurred in Iraq that was not only predictable but predicted. And predicted with good military advice to this administration. WEBB: My view of it, when Vice President Cheney repeatedly says that the people who have questioned the war against Iraq don‘t understand the post-9/11 world, my view is the complete reverse. The people who did this, this was on their to-do list when they got into the administration, and they did not... MATTHEWS: Cheney? WEBB: Cheney and the whole group that really put this together. They wanted this as a part of what was going to happen in the Bush administration. One way or the other, they were waiting for... (CROSSTALK) MATTHEWS: That‘s why they joined, you could argue. WEBB: And in my view, these people don‘t understand the realities post-9/11. Post-9/11, this was a bad idea. Pre-9/11, I still would have opposed it, but at least it was an arguable idea. MATTHEWS: Because—why is it more of a bad idea now since 9/11? WEBB: Because international terrorism really moved in a dramatic way from a regional problem to a global problem. We saw that we had to step to the forefront. We had all the nations of the world with us after 9/11. And we systematically alienated a huge percentage of the world at a time we needed their cooperation. We tied down our military in static positions when we had developed, for 10 or 15 years, we had worked on a maneuverable military. And now we dumped them into static positions. So it is a bad idea in terms of international politics, a bad idea in terms of grand strategy, and a bad idea in how to use the military. MATTHEWS: Did we dare the Arab world to take us on in Iraq? The young men of the Arab world? Did we say, go ahead, make our day, go ahead, step up to the plate, you got it? WEBB: Clearly, it was the inevitable consequences of anyone who thought this through. MATTHEWS: Like bring it on. That‘s what the president said. And they did. WEBB: And well, I think that by putting our people in Iraq, we certainly made them targets in a way that they wouldn‘t have been if we were fighting the war against international terrorism from a position to maneuver.\" ------------- Our guys are still dying in Iraq because of criminal negligence by the Bush Administration. Walt",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-04 06:20:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "WhiskeyPapa"
    },
    {
        "content": "quote: Originally posted by Proudformermarine: Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989 The fact that we have 60% of our available combat forces unavailable for combat due to current obligations and repeated deployments in simultaneous wars is likely making our enemies pretty bold. If we had to go to war with Iran tomorrow, we'd be in SERIOUS trouble.",
        "intTime": 20090504,
        "postID": 64,
        "quote": "Originally posted by Proudformermarine: Yup. His presence in the White House seems to have made our enemies a little bolder. Duane A. Brinson Lahaina, Hi. U.S.M.C. 1985-1989",
        "reply": " The fact that we have 60% of our available combat forces unavailable for combat due to current obligations and repeated deployments in simultaneous wars is likely making our enemies pretty bold. If we had to go to war with Iran tomorrow, we'd be in SERIOUS trouble.",
        "threadID": "672198221_9210023222001",
        "time": "2009-05-04 07:54:00",
        "title": "April Deadliest Month in Iraq.",
        "userID": "mrmixitup"
    }
]