[
    {
        "content": "Pause in silence a few seconds in rememberance of those that have given the ultimati sacrifice for all of us. \"...gather around their sacred remains and garland the passionless mounds above them with choicest flowers of springtime....let us in this solemn presence renew our pledges to aid and assist those whom they have left among us as sacred charges upon the Nation's gratitude,--the soldier's and sailor's widow and orphan.\" --General John Logan, General Order No. 11, 5 May 1868",
        "intTime": 20090524,
        "postID": 1,
        "quote": "",
        "reply": "Pause in silence a few seconds in rememberance of those that have given the ultimati sacrifice for all of us. \"...gather around their sacred remains and garland the passionless mounds above them with choicest flowers of springtime....let us in this solemn presence renew our pledges to aid and assist those whom they have left among us as sacred charges upon the Nation's gratitude,--the soldier's and sailor's widow and orphan.\" --General John Logan, General Order No. 11, 5 May 1868",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-24 11:08:00",
        "title": "Memorial Day",
        "userID": "ss_287"
    },
    {
        "content": "If you are able, save for them a place inside of you and save one backward glance when you are leaving for the places they can no longer go. Be not ashamed to say you loved them, though you may or may not have always. Take what they have taught you with their dying and keep it with your own. And in that time when men decide and feel safe to call the war insane, take one moment to embrace those gentle heroes you left behind. Major Michael Davis O'Donnell 1 January 1970 Dak To, Vietnam It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "intTime": 20090524,
        "postID": 2,
        "quote": "",
        "reply": "If you are able, save for them a place inside of you and save one backward glance when you are leaving for the places they can no longer go. Be not ashamed to say you loved them, though you may or may not have always. Take what they have taught you with their dying and keep it with your own. And in that time when men decide and feel safe to call the war insane, take one moment to embrace those gentle heroes you left behind. Major Michael Davis O'Donnell 1 January 1970 Dak To, Vietnam It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-24 11:24:00",
        "title": "Memorial Day",
        "userID": "FollowMeInfantry"
    },
    {
        "content": "It seems to me that on Memorial Day, we recognise that all of us who are normally strangers in the same land, for this day, can share in the long chain that goes back in time, and stretches endlessly into the future. That for one day we should pause and reflect; we are all bound together by those who sacrificed everything so that we can be here in a free country, a free land. That the benefits that we take for granted, had and have a price. The only true memorial, stronger than any memorial raised up in stone, is to pause and honor them. Stone weathers, but strong beliefs are passed down forever from generation to generation.",
        "intTime": 20090524,
        "postID": 3,
        "quote": "",
        "reply": "It seems to me that on Memorial Day, we recognise that all of us who are normally strangers in the same land, for this day, can share in the long chain that goes back in time, and stretches endlessly into the future. That for one day we should pause and reflect; we are all bound together by those who sacrificed everything so that we can be here in a free country, a free land. That the benefits that we take for granted, had and have a price. The only true memorial, stronger than any memorial raised up in stone, is to pause and honor them. Stone weathers, but strong beliefs are passed down forever from generation to generation.",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-24 11:56:00",
        "title": "Memorial Day",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: It seems to me that on Memorial Day, we recognise that all of us who are normally strangers in the same land, for this day, can share in the long chain that goes back in time, and stretches endlessly into the future. That for one day we should pause and reflect; we are all bound together by those who sacrificed everything so that we can be here in a free country, a free land. That the benefits that we take for granted, had and have a price. The only true memorial, stronger than any memorial raised up in stone, is to pause and honor them. Stone weathers, but strong beliefs are passed down forever from generation to generation. Amen, brother. Here's to all my heroes out there. I walked among you, but I never was you. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "intTime": 20090524,
        "postID": 4,
        "quote": "Originally posted by Grachus: It seems to me that on Memorial Day, we recognise that all of us who are normally strangers in the same land, for this day, can share in the long chain that goes back in time, and stretches endlessly into the future. That for one day we should pause and reflect; we are all bound together by those who sacrificed everything so that we can be here in a free country, a free land. That the benefits that we take for granted, had and have a price. The only true memorial, stronger than any memorial raised up in stone, is to pause and honor them. Stone weathers, but strong beliefs are passed down forever from generation to generation.",
        "reply": " Amen, brother. Here's to all my heroes out there. I walked among you, but I never was you. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-24 12:01:00",
        "title": "Memorial Day",
        "userID": "FollowMeInfantry"
    },
    {
        "content": "(bump)",
        "intTime": 20090524,
        "postID": 5,
        "quote": "",
        "reply": "(bump)",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-24 20:00:00",
        "title": "Memorial Day",
        "userID": "Grachus"
    },
    {
        "content": "Thank you Happy Memorial Day.",
        "intTime": 20090524,
        "postID": 6,
        "quote": "",
        "reply": "Thank you Happy Memorial Day.",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-24 20:11:00",
        "title": "Memorial Day",
        "userID": "usa_girl"
    },
    {
        "content": "+2",
        "intTime": 20090524,
        "postID": 7,
        "quote": "",
        "reply": "+2",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-24 20:16:00",
        "title": "Memorial Day",
        "userID": "SemperSignsdotcom"
    },
    {
        "content": "I thought I would put this thread back at the top for today- where it belongs- above Nancy Pelosi, gay senators, beer taxes, Dick Cheney and the WND. Could everyone else help??? In memory of our fallen...",
        "intTime": 20090525,
        "postID": 8,
        "quote": "",
        "reply": "I thought I would put this thread back at the top for today- where it belongs- above Nancy Pelosi, gay senators, beer taxes, Dick Cheney and the WND. Could everyone else help??? In memory of our fallen...",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 06:18:00",
        "title": "Memorial Day",
        "userID": "Motive25"
    },
    {
        "content": "quote: Originally posted by Motive25: I thought I would put this thread back at the top for today- where it belongs- above Nancy Pelosi, gay senators, beer taxes, Dick Cheney and the WND. Could everyone else help??? In memory of our fallen... Have been watching this to see how many actually take time to honor those that have fallen that others may enjoy their freedoms",
        "intTime": 20090525,
        "postID": 9,
        "quote": "Originally posted by Motive25: I thought I would put this thread back at the top for today- where it belongs- above Nancy Pelosi, gay senators, beer taxes, Dick Cheney and the WND. Could everyone else help??? In memory of our fallen...",
        "reply": " Have been watching this to see how many actually take time to honor those that have fallen that others may enjoy their freedoms",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 06:27:00",
        "title": "Memorial Day",
        "userID": "ss_287"
    },
    {
        "content": "From the first breaths of this Nation, many have sworn an oath to make good the checks this Nation writes. They have done so with courage, dignity and honor...These are our heros. Rest in peace my brothers and sisters. I will not forget.",
        "intTime": 20090525,
        "postID": 10,
        "quote": "",
        "reply": "From the first breaths of this Nation, many have sworn an oath to make good the checks this Nation writes. They have done so with courage, dignity and honor...These are our heros. Rest in peace my brothers and sisters. I will not forget.",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 07:21:00",
        "title": "Memorial Day",
        "userID": "Ol_Doc"
    },
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by Motive25: I thought I would put this thread back at the top for today- where it belongs- above Nancy Pelosi, gay senators, beer taxes, Dick Cheney and the WND. Could everyone else help??? In memory of our fallen... Have been watching this to see how many actually take time to honor those that have fallen that others may enjoy their freedoms There are more threads than this one for Memorial Day, there has been for two days now. Quite a few have posted on one thread or another. I think it started this year with a thread asking everyone's opinion about combining Memorial Day with Veteran's day. Other threads followed. I'm about to shower and change and walk up the street to Memorial Day services...in the pouring rain. Sorta fits the somber occasion for which the day represents.",
        "intTime": 20090525,
        "postID": 11,
        "quote": "Originally posted by ss_287: quote: Originally posted by Motive25: I thought I would put this thread back at the top for today- where it belongs- above Nancy Pelosi, gay senators, beer taxes, Dick Cheney and the WND. Could everyone else help??? In memory of our fallen... Have been watching this to see how many actually take time to honor those that have fallen that others may enjoy their freedoms",
        "reply": " There are more threads than this one for Memorial Day, there has been for two days now. Quite a few have posted on one thread or another. I think it started this year with a thread asking everyone's opinion about combining Memorial Day with Veteran's day. Other threads followed. I'm about to shower and change and walk up the street to Memorial Day services...in the pouring rain. Sorta fits the somber occasion for which the day represents.",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 08:01:00",
        "title": "Memorial Day",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "RIP to our brothers and sisters in arms. Especially for SSG Russell L. Gray, FSSF, 21 May 1944 Anzio SGT Lisa Andrews, USAR, 16 Oct 2003 GRAYMAN",
        "intTime": 20090525,
        "postID": 12,
        "quote": "",
        "reply": "RIP to our brothers and sisters in arms. Especially for SSG Russell L. Gray, FSSF, 21 May 1944 Anzio SGT Lisa Andrews, USAR, 16 Oct 2003 GRAYMAN",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 08:11:00",
        "title": "Memorial Day",
        "userID": "GRAYMAN"
    },
    {
        "content": "Just think of all we would not have, had they not been there for us over the centuries. Such tremendous opportunity bought with their blood. Greater love hath no man. . . .",
        "intTime": 20090525,
        "postID": 13,
        "quote": "",
        "reply": "Just think of all we would not have, had they not been there for us over the centuries. Such tremendous opportunity bought with their blood. Greater love hath no man. . . .",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 09:36:00",
        "title": "Memorial Day",
        "userID": "RRR52"
    },
    {
        "content": "quote: Originally posted by Motive25: I thought I would put this thread back at the top for today- where it belongs- above Nancy Pelosi, gay senators, beer taxes, Dick Cheney and the WND. Could everyone else help??? In memory of our fallen... Hooah. No such thing as too many threads memorializing the fallen. Thank you, heroes. You are missed, but you are never forgotten. In loving memory of SFC Bill XXXX You were my friend. I regret that I never knew you as more than that. You deserved more from me than that. RIP, Sergeant. I will care for your family as my own. Always and forever. I talked to your wife just this morning. Iraq took your life, but your wife still holds your soul. Rest deep. As long as I live, they are protected and cared for. Not as you protected and loved, but I was always second to you. In this, I am proud. You are free from our burdens. And your loved ones are loved in return. Go rest high on that mountain. <tears> Goodbye for now, Bill. I love you. You were always my brother. You were never my brother. </tears> Enjoy your rest, Bill. We'll all soon be reunited. Thank you for all you did and all you taught me and all you've yet to teach me. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "intTime": 20090525,
        "postID": 14,
        "quote": "Originally posted by Motive25: I thought I would put this thread back at the top for today- where it belongs- above Nancy Pelosi, gay senators, beer taxes, Dick Cheney and the WND. Could everyone else help??? In memory of our fallen...",
        "reply": " Hooah. No such thing as too many threads memorializing the fallen. Thank you, heroes. You are missed, but you are never forgotten. In loving memory of SFC Bill XXXX You were my friend. I regret that I never knew you as more than that. You deserved more from me than that. RIP, Sergeant. I will care for your family as my own. Always and forever. I talked to your wife just this morning. Iraq took your life, but your wife still holds your soul. Rest deep. As long as I live, they are protected and cared for. Not as you protected and loved, but I was always second to you. In this, I am proud. You are free from our burdens. And your loved ones are loved in return. Go rest high on that mountain. <tears> Goodbye for now, Bill. I love you. You were always my brother. You were never my brother. </tears> Enjoy your rest, Bill. We'll all soon be reunited. Thank you for all you did and all you taught me and all you've yet to teach me. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 09:43:00",
        "title": "Memorial Day",
        "userID": "FollowMeInfantry"
    },
    {
        "content": "Thanks Veterans D.J.",
        "intTime": 20090525,
        "postID": 15,
        "quote": "",
        "reply": "Thanks Veterans D.J.",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 10:56:00",
        "title": "Memorial Day",
        "userID": "donniejanuarysr"
    },
    {
        "content": "May all our brothers and sisters whom have gave the utmost sacrifice rest in peace. May all of us carry them with us in both our hearts, and souls. Never shall we forget their sacrifice and their service.",
        "intTime": 20090525,
        "postID": 16,
        "quote": "",
        "reply": "May all our brothers and sisters whom have gave the utmost sacrifice rest in peace. May all of us carry them with us in both our hearts, and souls. Never shall we forget their sacrifice and their service.",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 14:03:00",
        "title": "Memorial Day",
        "userID": "Boilerman_01"
    },
    {
        "content": "He was just a 21 year old kid who love and missed his family. Now most of them have joined his in Heaven. provided by the the kind and loving heart of a special friend. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans",
        "intTime": 20090525,
        "postID": 17,
        "quote": "",
        "reply": "He was just a 21 year old kid who love and missed his family. Now most of them have joined his in Heaven. provided by the the kind and loving heart of a special friend. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 14:14:00",
        "title": "Memorial Day",
        "userID": "OldArmyLove"
    },
    {
        "content": "I will never forget my brothers and sisters who gave it all for our freedom....I pledge my life to honor their memory till my last breath.. Semper Fi Fair Winds Already past the future",
        "intTime": 20090525,
        "postID": 18,
        "quote": "",
        "reply": "I will never forget my brothers and sisters who gave it all for our freedom....I pledge my life to honor their memory till my last breath.. Semper Fi Fair Winds Already past the future",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 14:21:00",
        "title": "Memorial Day",
        "userID": "6486143"
    },
    {
        "content": "\"Readily will I display the intestinal fortitude required to fight on to the[...] objective and complete the mission, though I be the lone survivor.\"----Ranger Creed Soldiers and Marines only ask for support back at home, right or wrong..",
        "intTime": 20090525,
        "postID": 19,
        "quote": "",
        "reply": "\"Readily will I display the intestinal fortitude required to fight on to the[...] objective and complete the mission, though I be the lone survivor.\"----Ranger Creed Soldiers and Marines only ask for support back at home, right or wrong..",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 14:30:00",
        "title": "Memorial Day",
        "userID": "Irwin_R_Schyster"
    },
    {
        "content": "To all who now wear the uniform of the United States of America and those who have worn the uniform and sworn the oath, THANK YOU!... To Sergeant Sherman R. Shaw 158th RCT and your blood that flowed on the ground in the Philippines, Private Woodrow H. Shaw and for your blood that flowed on the ground in the Aleutians, to John L. Shaw an officer in the U.S. Merchant Marine who became a sworn officer of the law and for your blood that flowed on the streets of our nation, Dennis Keith Spc.4 who gave his life in a muddy field in 'Nam in '68, LtCmdr. Culler from VA-81 who gave his life in a field across from 103rd St. at Cecil Field, to keep his A-7E from crashing into cars on 103rd St., Lt. Michael A. Talcott VA-195 who answered the call on a night launch from the U.S.S. America CV-66 and never came home, Lt. Michael Speicher VA-81, who is still missing... To all of my shipmates, to all who serve now and who will serve, THANK YOU... May we live worthy of your sacrifice... Most Respectfully, SUNLINER81",
        "intTime": 20090525,
        "postID": 20,
        "quote": "",
        "reply": "To all who now wear the uniform of the United States of America and those who have worn the uniform and sworn the oath, THANK YOU!... To Sergeant Sherman R. Shaw 158th RCT and your blood that flowed on the ground in the Philippines, Private Woodrow H. Shaw and for your blood that flowed on the ground in the Aleutians, to John L. Shaw an officer in the U.S. Merchant Marine who became a sworn officer of the law and for your blood that flowed on the streets of our nation, Dennis Keith Spc.4 who gave his life in a muddy field in 'Nam in '68, LtCmdr. Culler from VA-81 who gave his life in a field across from 103rd St. at Cecil Field, to keep his A-7E from crashing into cars on 103rd St., Lt. Michael A. Talcott VA-195 who answered the call on a night launch from the U.S.S. America CV-66 and never came home, Lt. Michael Speicher VA-81, who is still missing... To all of my shipmates, to all who serve now and who will serve, THANK YOU... May we live worthy of your sacrifice... Most Respectfully, SUNLINER81",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 14:35:00",
        "title": "Memorial Day",
        "userID": "SUNLINER81"
    },
    {
        "content": "Pause in silence a few seconds in rememberance of those that have given the ultimati sacrifice for all of us. \"...gather around their sacred remains and garland the passionless mounds above them with choicest flowers of springtime....let us in this solemn presence renew our pledges to aid and assist those whom they have left among us as sacred charges upon the Nation's gratitude,--the soldier's and sailor's widow and orphan.\" --General John Logan, General Order No. 11, 5 May 1868",
        "intTime": 20090524,
        "postID": 21,
        "quote": "",
        "reply": "Pause in silence a few seconds in rememberance of those that have given the ultimati sacrifice for all of us. \"...gather around their sacred remains and garland the passionless mounds above them with choicest flowers of springtime....let us in this solemn presence renew our pledges to aid and assist those whom they have left among us as sacred charges upon the Nation's gratitude,--the soldier's and sailor's widow and orphan.\" --General John Logan, General Order No. 11, 5 May 1868",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-24 11:08:00",
        "title": "Memorial Day",
        "userID": "ss_287"
    },
    {
        "content": "If you are able, save for them a place inside of you and save one backward glance when you are leaving for the places they can no longer go. Be not ashamed to say you loved them, though you may or may not have always. Take what they have taught you with their dying and keep it with your own. And in that time when men decide and feel safe to call the war insane, take one moment to embrace those gentle heroes you left behind. Major Michael Davis O'Donnell 1 January 1970 Dak To, Vietnam It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "intTime": 20090524,
        "postID": 22,
        "quote": "",
        "reply": "If you are able, save for them a place inside of you and save one backward glance when you are leaving for the places they can no longer go. Be not ashamed to say you loved them, though you may or may not have always. Take what they have taught you with their dying and keep it with your own. And in that time when men decide and feel safe to call the war insane, take one moment to embrace those gentle heroes you left behind. Major Michael Davis O'Donnell 1 January 1970 Dak To, Vietnam It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-24 11:24:00",
        "title": "Memorial Day",
        "userID": "FollowMeInfantry"
    },
    {
        "content": "It seems to me that on Memorial Day, we recognise that all of us who are normally strangers in the same land, for this day, can share in the long chain that goes back in time, and stretches endlessly into the future. That for one day we should pause and reflect; we are all bound together by those who sacrificed everything so that we can be here in a free country, a free land. That the benefits that we take for granted, had and have a price. The only true memorial, stronger than any memorial raised up in stone, is to pause and honor them. Stone weathers, but strong beliefs are passed down forever from generation to generation.",
        "intTime": 20090524,
        "postID": 23,
        "quote": "",
        "reply": "It seems to me that on Memorial Day, we recognise that all of us who are normally strangers in the same land, for this day, can share in the long chain that goes back in time, and stretches endlessly into the future. That for one day we should pause and reflect; we are all bound together by those who sacrificed everything so that we can be here in a free country, a free land. That the benefits that we take for granted, had and have a price. The only true memorial, stronger than any memorial raised up in stone, is to pause and honor them. Stone weathers, but strong beliefs are passed down forever from generation to generation.",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-24 11:56:00",
        "title": "Memorial Day",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: It seems to me that on Memorial Day, we recognise that all of us who are normally strangers in the same land, for this day, can share in the long chain that goes back in time, and stretches endlessly into the future. That for one day we should pause and reflect; we are all bound together by those who sacrificed everything so that we can be here in a free country, a free land. That the benefits that we take for granted, had and have a price. The only true memorial, stronger than any memorial raised up in stone, is to pause and honor them. Stone weathers, but strong beliefs are passed down forever from generation to generation. Amen, brother. Here's to all my heroes out there. I walked among you, but I never was you. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "intTime": 20090524,
        "postID": 24,
        "quote": "Originally posted by Grachus: It seems to me that on Memorial Day, we recognise that all of us who are normally strangers in the same land, for this day, can share in the long chain that goes back in time, and stretches endlessly into the future. That for one day we should pause and reflect; we are all bound together by those who sacrificed everything so that we can be here in a free country, a free land. That the benefits that we take for granted, had and have a price. The only true memorial, stronger than any memorial raised up in stone, is to pause and honor them. Stone weathers, but strong beliefs are passed down forever from generation to generation.",
        "reply": " Amen, brother. Here's to all my heroes out there. I walked among you, but I never was you. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-24 12:01:00",
        "title": "Memorial Day",
        "userID": "FollowMeInfantry"
    },
    {
        "content": "(bump)",
        "intTime": 20090524,
        "postID": 25,
        "quote": "",
        "reply": "(bump)",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-24 20:00:00",
        "title": "Memorial Day",
        "userID": "Grachus"
    },
    {
        "content": "Thank you Happy Memorial Day.",
        "intTime": 20090524,
        "postID": 26,
        "quote": "",
        "reply": "Thank you Happy Memorial Day.",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-24 20:11:00",
        "title": "Memorial Day",
        "userID": "usa_girl"
    },
    {
        "content": "+2",
        "intTime": 20090524,
        "postID": 27,
        "quote": "",
        "reply": "+2",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-24 20:16:00",
        "title": "Memorial Day",
        "userID": "SemperSignsdotcom"
    },
    {
        "content": "I thought I would put this thread back at the top for today- where it belongs- above Nancy Pelosi, gay senators, beer taxes, Dick Cheney and the WND. Could everyone else help??? In memory of our fallen...",
        "intTime": 20090525,
        "postID": 28,
        "quote": "",
        "reply": "I thought I would put this thread back at the top for today- where it belongs- above Nancy Pelosi, gay senators, beer taxes, Dick Cheney and the WND. Could everyone else help??? In memory of our fallen...",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 06:18:00",
        "title": "Memorial Day",
        "userID": "Motive25"
    },
    {
        "content": "quote: Originally posted by Motive25: I thought I would put this thread back at the top for today- where it belongs- above Nancy Pelosi, gay senators, beer taxes, Dick Cheney and the WND. Could everyone else help??? In memory of our fallen... Have been watching this to see how many actually take time to honor those that have fallen that others may enjoy their freedoms",
        "intTime": 20090525,
        "postID": 29,
        "quote": "Originally posted by Motive25: I thought I would put this thread back at the top for today- where it belongs- above Nancy Pelosi, gay senators, beer taxes, Dick Cheney and the WND. Could everyone else help??? In memory of our fallen...",
        "reply": " Have been watching this to see how many actually take time to honor those that have fallen that others may enjoy their freedoms",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 06:27:00",
        "title": "Memorial Day",
        "userID": "ss_287"
    },
    {
        "content": "From the first breaths of this Nation, many have sworn an oath to make good the checks this Nation writes. They have done so with courage, dignity and honor...These are our heros. Rest in peace my brothers and sisters. I will not forget.",
        "intTime": 20090525,
        "postID": 30,
        "quote": "",
        "reply": "From the first breaths of this Nation, many have sworn an oath to make good the checks this Nation writes. They have done so with courage, dignity and honor...These are our heros. Rest in peace my brothers and sisters. I will not forget.",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 07:21:00",
        "title": "Memorial Day",
        "userID": "Ol_Doc"
    },
    {
        "content": "quote: Originally posted by ss_287: quote: Originally posted by Motive25: I thought I would put this thread back at the top for today- where it belongs- above Nancy Pelosi, gay senators, beer taxes, Dick Cheney and the WND. Could everyone else help??? In memory of our fallen... Have been watching this to see how many actually take time to honor those that have fallen that others may enjoy their freedoms There are more threads than this one for Memorial Day, there has been for two days now. Quite a few have posted on one thread or another. I think it started this year with a thread asking everyone's opinion about combining Memorial Day with Veteran's day. Other threads followed. I'm about to shower and change and walk up the street to Memorial Day services...in the pouring rain. Sorta fits the somber occasion for which the day represents.",
        "intTime": 20090525,
        "postID": 31,
        "quote": "Originally posted by ss_287: quote: Originally posted by Motive25: I thought I would put this thread back at the top for today- where it belongs- above Nancy Pelosi, gay senators, beer taxes, Dick Cheney and the WND. Could everyone else help??? In memory of our fallen... Have been watching this to see how many actually take time to honor those that have fallen that others may enjoy their freedoms",
        "reply": " There are more threads than this one for Memorial Day, there has been for two days now. Quite a few have posted on one thread or another. I think it started this year with a thread asking everyone's opinion about combining Memorial Day with Veteran's day. Other threads followed. I'm about to shower and change and walk up the street to Memorial Day services...in the pouring rain. Sorta fits the somber occasion for which the day represents.",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 08:01:00",
        "title": "Memorial Day",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "RIP to our brothers and sisters in arms. Especially for SSG Russell L. Gray, FSSF, 21 May 1944 Anzio SGT Lisa Andrews, USAR, 16 Oct 2003 GRAYMAN",
        "intTime": 20090525,
        "postID": 32,
        "quote": "",
        "reply": "RIP to our brothers and sisters in arms. Especially for SSG Russell L. Gray, FSSF, 21 May 1944 Anzio SGT Lisa Andrews, USAR, 16 Oct 2003 GRAYMAN",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 08:11:00",
        "title": "Memorial Day",
        "userID": "GRAYMAN"
    },
    {
        "content": "Just think of all we would not have, had they not been there for us over the centuries. Such tremendous opportunity bought with their blood. Greater love hath no man. . . .",
        "intTime": 20090525,
        "postID": 33,
        "quote": "",
        "reply": "Just think of all we would not have, had they not been there for us over the centuries. Such tremendous opportunity bought with their blood. Greater love hath no man. . . .",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 09:36:00",
        "title": "Memorial Day",
        "userID": "RRR52"
    },
    {
        "content": "quote: Originally posted by Motive25: I thought I would put this thread back at the top for today- where it belongs- above Nancy Pelosi, gay senators, beer taxes, Dick Cheney and the WND. Could everyone else help??? In memory of our fallen... Hooah. No such thing as too many threads memorializing the fallen. Thank you, heroes. You are missed, but you are never forgotten. In loving memory of SFC Bill XXXX You were my friend. I regret that I never knew you as more than that. You deserved more from me than that. RIP, Sergeant. I will care for your family as my own. Always and forever. I talked to your wife just this morning. Iraq took your life, but your wife still holds your soul. Rest deep. As long as I live, they are protected and cared for. Not as you protected and loved, but I was always second to you. In this, I am proud. You are free from our burdens. And your loved ones are loved in return. Go rest high on that mountain. <tears> Goodbye for now, Bill. I love you. You were always my brother. You were never my brother. </tears> Enjoy your rest, Bill. We'll all soon be reunited. Thank you for all you did and all you taught me and all you've yet to teach me. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "intTime": 20090525,
        "postID": 34,
        "quote": "Originally posted by Motive25: I thought I would put this thread back at the top for today- where it belongs- above Nancy Pelosi, gay senators, beer taxes, Dick Cheney and the WND. Could everyone else help??? In memory of our fallen...",
        "reply": " Hooah. No such thing as too many threads memorializing the fallen. Thank you, heroes. You are missed, but you are never forgotten. In loving memory of SFC Bill XXXX You were my friend. I regret that I never knew you as more than that. You deserved more from me than that. RIP, Sergeant. I will care for your family as my own. Always and forever. I talked to your wife just this morning. Iraq took your life, but your wife still holds your soul. Rest deep. As long as I live, they are protected and cared for. Not as you protected and loved, but I was always second to you. In this, I am proud. You are free from our burdens. And your loved ones are loved in return. Go rest high on that mountain. <tears> Goodbye for now, Bill. I love you. You were always my brother. You were never my brother. </tears> Enjoy your rest, Bill. We'll all soon be reunited. Thank you for all you did and all you taught me and all you've yet to teach me. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 09:43:00",
        "title": "Memorial Day",
        "userID": "FollowMeInfantry"
    },
    {
        "content": "Thanks Veterans D.J.",
        "intTime": 20090525,
        "postID": 35,
        "quote": "",
        "reply": "Thanks Veterans D.J.",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 10:56:00",
        "title": "Memorial Day",
        "userID": "donniejanuarysr"
    },
    {
        "content": "May all our brothers and sisters whom have gave the utmost sacrifice rest in peace. May all of us carry them with us in both our hearts, and souls. Never shall we forget their sacrifice and their service.",
        "intTime": 20090525,
        "postID": 36,
        "quote": "",
        "reply": "May all our brothers and sisters whom have gave the utmost sacrifice rest in peace. May all of us carry them with us in both our hearts, and souls. Never shall we forget their sacrifice and their service.",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 14:03:00",
        "title": "Memorial Day",
        "userID": "Boilerman_01"
    },
    {
        "content": "He was just a 21 year old kid who love and missed his family. Now most of them have joined his in Heaven. provided by the the kind and loving heart of a special friend. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans",
        "intTime": 20090525,
        "postID": 37,
        "quote": "",
        "reply": "He was just a 21 year old kid who love and missed his family. Now most of them have joined his in Heaven. provided by the the kind and loving heart of a special friend. God and the soldier, All men adore, In time of trouble, And no more; For when war is over, And all things righted, God is neglected - The old soldier slighted. Founding Member Original DVG & Proud Member, Rupterd Duck/Derelict Veterans",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 14:14:00",
        "title": "Memorial Day",
        "userID": "OldArmyLove"
    },
    {
        "content": "I will never forget my brothers and sisters who gave it all for our freedom....I pledge my life to honor their memory till my last breath.. Semper Fi Fair Winds Already past the future",
        "intTime": 20090525,
        "postID": 38,
        "quote": "",
        "reply": "I will never forget my brothers and sisters who gave it all for our freedom....I pledge my life to honor their memory till my last breath.. Semper Fi Fair Winds Already past the future",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 14:21:00",
        "title": "Memorial Day",
        "userID": "6486143"
    },
    {
        "content": "\"Readily will I display the intestinal fortitude required to fight on to the[...] objective and complete the mission, though I be the lone survivor.\"----Ranger Creed Soldiers and Marines only ask for support back at home, right or wrong..",
        "intTime": 20090525,
        "postID": 39,
        "quote": "",
        "reply": "\"Readily will I display the intestinal fortitude required to fight on to the[...] objective and complete the mission, though I be the lone survivor.\"----Ranger Creed Soldiers and Marines only ask for support back at home, right or wrong..",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 14:30:00",
        "title": "Memorial Day",
        "userID": "Irwin_R_Schyster"
    },
    {
        "content": "To all who now wear the uniform of the United States of America and those who have worn the uniform and sworn the oath, THANK YOU!... To Sergeant Sherman R. Shaw 158th RCT and your blood that flowed on the ground in the Philippines, Private Woodrow H. Shaw and for your blood that flowed on the ground in the Aleutians, to John L. Shaw an officer in the U.S. Merchant Marine who became a sworn officer of the law and for your blood that flowed on the streets of our nation, Dennis Keith Spc.4 who gave his life in a muddy field in 'Nam in '68, LtCmdr. Culler from VA-81 who gave his life in a field across from 103rd St. at Cecil Field, to keep his A-7E from crashing into cars on 103rd St., Lt. Michael A. Talcott VA-195 who answered the call on a night launch from the U.S.S. America CV-66 and never came home, Lt. Michael Speicher VA-81, who is still missing... To all of my shipmates, to all who serve now and who will serve, THANK YOU... May we live worthy of your sacrifice... Most Respectfully, SUNLINER81",
        "intTime": 20090525,
        "postID": 40,
        "quote": "",
        "reply": "To all who now wear the uniform of the United States of America and those who have worn the uniform and sworn the oath, THANK YOU!... To Sergeant Sherman R. Shaw 158th RCT and your blood that flowed on the ground in the Philippines, Private Woodrow H. Shaw and for your blood that flowed on the ground in the Aleutians, to John L. Shaw an officer in the U.S. Merchant Marine who became a sworn officer of the law and for your blood that flowed on the streets of our nation, Dennis Keith Spc.4 who gave his life in a muddy field in 'Nam in '68, LtCmdr. Culler from VA-81 who gave his life in a field across from 103rd St. at Cecil Field, to keep his A-7E from crashing into cars on 103rd St., Lt. Michael A. Talcott VA-195 who answered the call on a night launch from the U.S.S. America CV-66 and never came home, Lt. Michael Speicher VA-81, who is still missing... To all of my shipmates, to all who serve now and who will serve, THANK YOU... May we live worthy of your sacrifice... Most Respectfully, SUNLINER81",
        "threadID": "672198221_9760051422001",
        "time": "2009-05-25 14:35:00",
        "title": "Memorial Day",
        "userID": "SUNLINER81"
    }
]