[
    {
        "content": "You're not alone, governor. Obama is bringing economic suicide to the rest of America as well. quote: Gov. Jim Gibbons said today that President Obama has denied his request to meet with him in Las Vegas later this month. \"I am disappointed at the hypocrisy shown by this administration,\" Gibbons said in a prepared statement. \"President Obama is coming to Las Vegas later this month for a political fundraiser, but he will not help the struggling families in Las Vegas and Nevada who are out of work because of his reckless comments.\" The Las Vegas Convention and Visitors Authority reports over 400 conventions and business meetings scheduled to take place in Las Vegas recently have cancelled. These cancelled events translate into 111,800 guests in Las Vegas and over 250,000 “room-nights”. The cancelled conventions and meetings have cost the Las Vegas economy over $100-million, not including gaming revenue. \"This is politics, pure and simple, President Obama stood for change, but all he has done is brought negative economic change to Nevada,\" Gibbons said. \"http://www.ktnv.com/Global/story.asp?S=10383051\" \"The World's Finest\"", 
        "intTime": 20090519, 
        "postID": 1, 
        "quote": "Gov. Jim Gibbons said today that President Obama has denied his request to meet with him in Las Vegas later this month. \"I am disappointed at the hypocrisy shown by this administration,\" Gibbons said in a prepared statement. \"President Obama is coming to Las Vegas later this month for a political fundraiser, but he will not help the struggling families in Las Vegas and Nevada who are out of work because of his reckless comments.\" The Las Vegas Convention and Visitors Authority reports over 400 conventions and business meetings scheduled to take place in Las Vegas recently have cancelled. These cancelled events translate into 111,800 guests in Las Vegas and over 250,000 “room-nights”. The cancelled conventions and meetings have cost the Las Vegas economy over $100-million, not including gaming revenue. \"This is politics, pure and simple, President Obama stood for change, but all he has done is brought negative economic change to Nevada,\" Gibbons said. \"http://www.ktnv.com/Global/story.asp?S=10383051\"", 
        "reply": "You're not alone, governor. Obama is bringing economic suicide to the rest of America as well.  \"The World's Finest\"", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 03:12:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "Kegler300"
    }, 
    {
        "content": "And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR!", 
        "intTime": 20090519, 
        "postID": 2, 
        "quote": "", 
        "reply": "And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR!", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 03:22:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR! But he will be flying into Las Vegas on \"Air Force One\" for a political fundraiser. Who pays for the operation, maintanence, and fuel for that jet again?", 
        "intTime": 20090519, 
        "postID": 3, 
        "quote": "Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR!", 
        "reply": " But he will be flying into Las Vegas on \"Air Force One\" for a political fundraiser. Who pays for the operation, maintanence, and fuel for that jet again?", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 07:36:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR! His statements are said to have cost Las Vegas over 100 million dollars, over 400 conventions have been cancelled since he made his statements. That can not be good for their economy. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 4, 
        "quote": "Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR!", 
        "reply": " His statements are said to have cost Las Vegas over 100 million dollars, over 400 conventions have been cancelled since he made his statements. That can not be good for their economy. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 07:38:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "L0A1"
    }, 
    {
        "content": "Why isn't harry marching right up Pennsylvania Ave and complaining? After, wasn't there some 'stimulus money' set for a useless high speed rail line from Los Angeles to Las Vegas---FOR WHAT? A political fundraiser is just more lip service! C'mon jack_flats--NO COMMENT!", 
        "intTime": 20090519, 
        "postID": 5, 
        "quote": "", 
        "reply": "Why isn't harry marching right up Pennsylvania Ave and complaining? After, wasn't there some 'stimulus money' set for a useless high speed rail line from Los Angeles to Las Vegas---FOR WHAT? A political fundraiser is just more lip service! C'mon jack_flats--NO COMMENT!", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 07:47:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Maybe those wealthy voters in Nevada who make their living off gamblers and conventions will boycott this fundraiser?? We can \"hope\" huh??", 
        "intTime": 20090519, 
        "postID": 6, 
        "quote": "", 
        "reply": "Maybe those wealthy voters in Nevada who make their living off gamblers and conventions will boycott this fundraiser?? We can \"hope\" huh??", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 10:52:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR! But he will be flying into Las Vegas on \"Air Force One\" for a political fundraiser. Who pays for the operation, maintanence, and fuel for that jet again? The same People he had running in the streets of Lower Manhattan in fear of their lives while his plane got a Photo Op. Those Americans who actually pay taxes, which leaves out large numbers of his Cabinet.............", 
        "intTime": 20090519, 
        "postID": 7, 
        "quote": "Originally posted by stec74: quote: Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR! But he will be flying into Las Vegas on \"Air Force One\" for a political fundraiser. Who pays for the operation, maintanence, and fuel for that jet again?", 
        "reply": " The same People he had running in the streets of Lower Manhattan in fear of their lives while his plane got a Photo Op. Those Americans who actually pay taxes, which leaves out large numbers of his Cabinet.............", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 11:17:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Even the \"stimulus\" package is designed to fail to stimulate, and almost NONE of it has been distributed. So, even if it COULD, it CAN'T because the Bureauracy is not spending it. But, it is all George Bush's fault, right? For some reason, either Mr. Obama wants America to fail, or he's far less bright than we've all been told that he is. BTW, what, as Imus asked, is his IQ?", 
        "intTime": 20090519, 
        "postID": 8, 
        "quote": "", 
        "reply": "Even the \"stimulus\" package is designed to fail to stimulate, and almost NONE of it has been distributed. So, even if it COULD, it CAN'T because the Bureauracy is not spending it. But, it is all George Bush's fault, right? For some reason, either Mr. Obama wants America to fail, or he's far less bright than we've all been told that he is. BTW, what, as Imus asked, is his IQ?", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 11:34:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Obama Stood For Change, But All He's Brought Is Negative Economic Change Obviously you failed to notice 90% of the negative economic effects occured before Obama even became President. That's okay. Blaming it on him is the Republican thing to do.", 
        "intTime": 20090519, 
        "postID": 9, 
        "quote": "Originally posted by Kegler300: Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "reply": " Obviously you failed to notice 90% of the negative economic effects occured before Obama even became President. That's okay. Blaming it on him is the Republican thing to do.", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 12:06:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Kegler300: Obama Stood For Change, But All He's Brought Is Negative Economic Change Obviously you failed to notice 90% of the negative economic effects occured before Obama even became President. That's okay. Blaming it on him is the Republican thing to do. Yea, the first 100 days ok, not now though, it's all him now. Or are you going to blame Bush all the way through the next election? Will you be using the ole, \"No Third Bush term\" mantra again? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 10, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Kegler300: Obama Stood For Change, But All He's Brought Is Negative Economic Change Obviously you failed to notice 90% of the negative economic effects occured before Obama even became President. That's okay. Blaming it on him is the Republican thing to do.", 
        "reply": " Yea, the first 100 days ok, not now though, it's all him now. Or are you going to blame Bush all the way through the next election? Will you be using the ole, \"No Third Bush term\" mantra again? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 12:33:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR! But yet, you complain of the trickle down effect of Bush. Wait until the trickled down effect of Obama starts to happen. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090519, 
        "postID": 11, 
        "quote": "Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR!", 
        "reply": " But yet, you complain of the trickle down effect of Bush. Wait until the trickled down effect of Obama starts to happen. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 12:37:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Yea, the first 100 days ok, not now though, it's all him now. Or are you going to blame Bush all the way through the next election? Will you be using the ole, \"No Third Bush term\" mantra again? He's still trying to fix everything that ALL the guys (Republican and Democrat) before him broke. Bush's first stimulus bill wasn't even passed when he took office.", 
        "intTime": 20090519, 
        "postID": 12, 
        "quote": "Originally posted by L0A1: Yea, the first 100 days ok, not now though, it's all him now. Or are you going to blame Bush all the way through the next election? Will you be using the ole, \"No Third Bush term\" mantra again?", 
        "reply": " He's still trying to fix everything that ALL the guys (Republican and Democrat) before him broke. Bush's first stimulus bill wasn't even passed when he took office.", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 12:38:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Kegler300: Obama Stood For Change, But All He's Brought Is Negative Economic Change Obviously you failed to notice 90% of the negative economic effects occured before Obama even became President. That's okay. Blaming it on him is the Republican thing to do. You mean like how the Democrats have none stopped blamed the Republicans. I'm sure by next year it will still be Bush's fault somehow even though it is still and has always been Obama. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090519, 
        "postID": 13, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Kegler300: Obama Stood For Change, But All He's Brought Is Negative Economic Change Obviously you failed to notice 90% of the negative economic effects occured before Obama even became President. That's okay. Blaming it on him is the Republican thing to do.", 
        "reply": " You mean like how the Democrats have none stopped blamed the Republicans. I'm sure by next year it will still be Bush's fault somehow even though it is still and has always been Obama. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 12:39:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: You're not alone, governor. Obama is bringing economic suicide to the rest of America as well. quote: Gov. Jim Gibbons said today that President Obama has denied his request to meet with him in Las Vegas later this month. \"I am disappointed at the hypocrisy shown by this administration,\" Gibbons said in a prepared statement. \"President Obama is coming to Las Vegas later this month for a political fundraiser, but he will not help the struggling families in Las Vegas and Nevada who are out of work because of his reckless comments.\" The Las Vegas Convention and Visitors Authority reports over 400 conventions and business meetings scheduled to take place in Las Vegas recently have cancelled. These cancelled events translate into 111,800 guests in Las Vegas and over 250,000 “room-nights”. The cancelled conventions and meetings have cost the Las Vegas economy over $100-million, not including gaming revenue. \"This is politics, pure and simple, President Obama stood for change, but all he has done is brought negative economic change to Nevada,\" Gibbons said. \"http://www.ktnv.com/Global/story.asp?S=10383051\" I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September", 
        "intTime": 20090519, 
        "postID": 14, 
        "quote": "Originally posted by Kegler300: You're not alone, governor. Obama is bringing economic suicide to the rest of America as well. quote: Gov. Jim Gibbons said today that President Obama has denied his request to meet with him in Las Vegas later this month. \"I am disappointed at the hypocrisy shown by this administration,\" Gibbons said in a prepared statement. \"President Obama is coming to Las Vegas later this month for a political fundraiser, but he will not help the struggling families in Las Vegas and Nevada who are out of work because of his reckless comments.\" The Las Vegas Convention and Visitors Authority reports over 400 conventions and business meetings scheduled to take place in Las Vegas recently have cancelled. These cancelled events translate into 111,800 guests in Las Vegas and over 250,000 “room-nights”. The cancelled conventions and meetings have cost the Las Vegas economy over $100-million, not including gaming revenue. \"This is politics, pure and simple, President Obama stood for change, but all he has done is brought negative economic change to Nevada,\" Gibbons said. \"http://www.ktnv.com/Global/story.asp?S=10383051\"", 
        "reply": " I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 13:07:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September It's funny how they get excited about the last administration being blamed for the economy. Obama hasn't even made it through his first year and the blame him, much less two terms.", 
        "intTime": 20090519, 
        "postID": 15, 
        "quote": "Originally posted by rayld2: I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September", 
        "reply": " It's funny how they get excited about the last administration being blamed for the economy. Obama hasn't even made it through his first year and the blame him, much less two terms.", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 13:19:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I'm starting to like Obama as President. Now he is making all SUV's, trucks, and cars in the US get at least 35 miles per gallon of gas by 2016. Thank God. I can't wait to drive my Shelby GT 500 Mustang down interstate 95 and get 35 miles per gallon coasting at 80 mph. I told you all a year or two ago that the Toyota Prius is here to stay.", 
        "intTime": 20090519, 
        "postID": 16, 
        "quote": "", 
        "reply": "I'm starting to like Obama as President. Now he is making all SUV's, trucks, and cars in the US get at least 35 miles per gallon of gas by 2016. Thank God. I can't wait to drive my Shelby GT 500 Mustang down interstate 95 and get 35 miles per gallon coasting at 80 mph. I told you all a year or two ago that the Toyota Prius is here to stay.", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 13:22:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by rayld2: I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September It's funny how they get excited about the last administration being blamed for the economy. Obama hasn't even made it through his first year and the blame him, much less two terms. Considering how much tax payer cash hes ****ed down the toilet since hes been in office can you blame them?", 
        "intTime": 20090519, 
        "postID": 17, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by rayld2: I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September It's funny how they get excited about the last administration being blamed for the economy. Obama hasn't even made it through his first year and the blame him, much less two terms.", 
        "reply": " Considering how much tax payer cash hes ****ed down the toilet since hes been in office can you blame them?", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 13:45:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: quote: Originally posted by Ol_Doc: quote: Originally posted by rayld2: I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September It's funny how they get excited about the last administration being blamed for the economy. Obama hasn't even made it through his first year and the blame him, much less two terms. Considering how much tax payer cash hes ****ed down the toilet since hes been in office can you blame them? Spending our way out of a recession isn't new. It's also worked before.", 
        "intTime": 20090519, 
        "postID": 18, 
        "quote": "Originally posted by NickBrand: quote: Originally posted by Ol_Doc: quote: Originally posted by rayld2: I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September It's funny how they get excited about the last administration being blamed for the economy. Obama hasn't even made it through his first year and the blame him, much less two terms. Considering how much tax payer cash hes ****ed down the toilet since hes been in office can you blame them?", 
        "reply": " Spending our way out of a recession isn't new. It's also worked before.", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 13:48:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I'm starting to like Obama as President. Now he is making all SUV's, trucks, and cars in the US get at least 35 miles per gallon of gas by 2016. Thank God. I can't wait to drive my Shelby GT 500 Mustang down interstate 95 and get 35 miles per gallon coasting at 80 mph. I told you all a year or two ago that the Toyota Prius is here to stay. You could put a direct injection 4-cyl turbo charged engine in the Shelby, cut the weight down to 2,500 pounds (the engine alone weighs almost 1,000 pounds with the 5.4L iron block and blower) and it could get better than CAFE standard mileage averages. Europe has been making efficient and economical cars for decades. It's about time we caught up. Good for Obama. We may be able to salvage the American Auto Industry yet. (Or were SUVs supposed to do that?)", 
        "intTime": 20090519, 
        "postID": 19, 
        "quote": "Originally posted by Duster6: I'm starting to like Obama as President. Now he is making all SUV's, trucks, and cars in the US get at least 35 miles per gallon of gas by 2016. Thank God. I can't wait to drive my Shelby GT 500 Mustang down interstate 95 and get 35 miles per gallon coasting at 80 mph. I told you all a year or two ago that the Toyota Prius is here to stay.", 
        "reply": " You could put a direct injection 4-cyl turbo charged engine in the Shelby, cut the weight down to 2,500 pounds (the engine alone weighs almost 1,000 pounds with the 5.4L iron block and blower) and it could get better than CAFE standard mileage averages. Europe has been making efficient and economical cars for decades. It's about time we caught up. Good for Obama. We may be able to salvage the American Auto Industry yet. (Or were SUVs supposed to do that?)", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 13:53:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Even the \"stimulus\" package is designed to fail to stimulate, and almost NONE of it has been distributed. So, even if it COULD, it CAN'T because the Bureauracy is not spending it. But, it is all George Bush's fault, right? For some reason, either Mr. Obama wants America to fail, or he's far less bright than we've all been told that he is. BTW, what, as Imus asked, is his IQ? nothing partcularly brghit about using the uh word in front of multiple teleprompters!", 
        "intTime": 20090519, 
        "postID": 20, 
        "quote": "Originally posted by peter3_1: Even the \"stimulus\" package is designed to fail to stimulate, and almost NONE of it has been distributed. So, even if it COULD, it CAN'T because the Bureauracy is not spending it. But, it is all George Bush's fault, right? For some reason, either Mr. Obama wants America to fail, or he's far less bright than we've all been told that he is. BTW, what, as Imus asked, is his IQ?", 
        "reply": " nothing partcularly brghit about using the uh word in front of multiple teleprompters!", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 14:00:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "EAG154"
    }, 
    {
        "content": "You're not alone, governor. Obama is bringing economic suicide to the rest of America as well. quote: Gov. Jim Gibbons said today that President Obama has denied his request to meet with him in Las Vegas later this month. \"I am disappointed at the hypocrisy shown by this administration,\" Gibbons said in a prepared statement. \"President Obama is coming to Las Vegas later this month for a political fundraiser, but he will not help the struggling families in Las Vegas and Nevada who are out of work because of his reckless comments.\" The Las Vegas Convention and Visitors Authority reports over 400 conventions and business meetings scheduled to take place in Las Vegas recently have cancelled. These cancelled events translate into 111,800 guests in Las Vegas and over 250,000 “room-nights”. The cancelled conventions and meetings have cost the Las Vegas economy over $100-million, not including gaming revenue. \"This is politics, pure and simple, President Obama stood for change, but all he has done is brought negative economic change to Nevada,\" Gibbons said. \"http://www.ktnv.com/Global/story.asp?S=10383051\" \"The World's Finest\"", 
        "intTime": 20090519, 
        "postID": 21, 
        "quote": "Gov. Jim Gibbons said today that President Obama has denied his request to meet with him in Las Vegas later this month. \"I am disappointed at the hypocrisy shown by this administration,\" Gibbons said in a prepared statement. \"President Obama is coming to Las Vegas later this month for a political fundraiser, but he will not help the struggling families in Las Vegas and Nevada who are out of work because of his reckless comments.\" The Las Vegas Convention and Visitors Authority reports over 400 conventions and business meetings scheduled to take place in Las Vegas recently have cancelled. These cancelled events translate into 111,800 guests in Las Vegas and over 250,000 “room-nights”. The cancelled conventions and meetings have cost the Las Vegas economy over $100-million, not including gaming revenue. \"This is politics, pure and simple, President Obama stood for change, but all he has done is brought negative economic change to Nevada,\" Gibbons said. \"http://www.ktnv.com/Global/story.asp?S=10383051\"", 
        "reply": "You're not alone, governor. Obama is bringing economic suicide to the rest of America as well.  \"The World's Finest\"", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 03:12:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "Kegler300"
    }, 
    {
        "content": "And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR!", 
        "intTime": 20090519, 
        "postID": 22, 
        "quote": "", 
        "reply": "And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR!", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 03:22:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR! But he will be flying into Las Vegas on \"Air Force One\" for a political fundraiser. Who pays for the operation, maintanence, and fuel for that jet again?", 
        "intTime": 20090519, 
        "postID": 23, 
        "quote": "Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR!", 
        "reply": " But he will be flying into Las Vegas on \"Air Force One\" for a political fundraiser. Who pays for the operation, maintanence, and fuel for that jet again?", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 07:36:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR! His statements are said to have cost Las Vegas over 100 million dollars, over 400 conventions have been cancelled since he made his statements. That can not be good for their economy. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 24, 
        "quote": "Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR!", 
        "reply": " His statements are said to have cost Las Vegas over 100 million dollars, over 400 conventions have been cancelled since he made his statements. That can not be good for their economy. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 07:38:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "L0A1"
    }, 
    {
        "content": "Why isn't harry marching right up Pennsylvania Ave and complaining? After, wasn't there some 'stimulus money' set for a useless high speed rail line from Los Angeles to Las Vegas---FOR WHAT? A political fundraiser is just more lip service! C'mon jack_flats--NO COMMENT!", 
        "intTime": 20090519, 
        "postID": 25, 
        "quote": "", 
        "reply": "Why isn't harry marching right up Pennsylvania Ave and complaining? After, wasn't there some 'stimulus money' set for a useless high speed rail line from Los Angeles to Las Vegas---FOR WHAT? A political fundraiser is just more lip service! C'mon jack_flats--NO COMMENT!", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 07:47:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Maybe those wealthy voters in Nevada who make their living off gamblers and conventions will boycott this fundraiser?? We can \"hope\" huh??", 
        "intTime": 20090519, 
        "postID": 26, 
        "quote": "", 
        "reply": "Maybe those wealthy voters in Nevada who make their living off gamblers and conventions will boycott this fundraiser?? We can \"hope\" huh??", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 10:52:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR! But he will be flying into Las Vegas on \"Air Force One\" for a political fundraiser. Who pays for the operation, maintanence, and fuel for that jet again? The same People he had running in the streets of Lower Manhattan in fear of their lives while his plane got a Photo Op. Those Americans who actually pay taxes, which leaves out large numbers of his Cabinet.............", 
        "intTime": 20090519, 
        "postID": 27, 
        "quote": "Originally posted by stec74: quote: Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR! But he will be flying into Las Vegas on \"Air Force One\" for a political fundraiser. Who pays for the operation, maintanence, and fuel for that jet again?", 
        "reply": " The same People he had running in the streets of Lower Manhattan in fear of their lives while his plane got a Photo Op. Those Americans who actually pay taxes, which leaves out large numbers of his Cabinet.............", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 11:17:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Even the \"stimulus\" package is designed to fail to stimulate, and almost NONE of it has been distributed. So, even if it COULD, it CAN'T because the Bureauracy is not spending it. But, it is all George Bush's fault, right? For some reason, either Mr. Obama wants America to fail, or he's far less bright than we've all been told that he is. BTW, what, as Imus asked, is his IQ?", 
        "intTime": 20090519, 
        "postID": 28, 
        "quote": "", 
        "reply": "Even the \"stimulus\" package is designed to fail to stimulate, and almost NONE of it has been distributed. So, even if it COULD, it CAN'T because the Bureauracy is not spending it. But, it is all George Bush's fault, right? For some reason, either Mr. Obama wants America to fail, or he's far less bright than we've all been told that he is. BTW, what, as Imus asked, is his IQ?", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 11:34:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Obama Stood For Change, But All He's Brought Is Negative Economic Change Obviously you failed to notice 90% of the negative economic effects occured before Obama even became President. That's okay. Blaming it on him is the Republican thing to do.", 
        "intTime": 20090519, 
        "postID": 29, 
        "quote": "Originally posted by Kegler300: Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "reply": " Obviously you failed to notice 90% of the negative economic effects occured before Obama even became President. That's okay. Blaming it on him is the Republican thing to do.", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 12:06:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Kegler300: Obama Stood For Change, But All He's Brought Is Negative Economic Change Obviously you failed to notice 90% of the negative economic effects occured before Obama even became President. That's okay. Blaming it on him is the Republican thing to do. Yea, the first 100 days ok, not now though, it's all him now. Or are you going to blame Bush all the way through the next election? Will you be using the ole, \"No Third Bush term\" mantra again? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 30, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Kegler300: Obama Stood For Change, But All He's Brought Is Negative Economic Change Obviously you failed to notice 90% of the negative economic effects occured before Obama even became President. That's okay. Blaming it on him is the Republican thing to do.", 
        "reply": " Yea, the first 100 days ok, not now though, it's all him now. Or are you going to blame Bush all the way through the next election? Will you be using the ole, \"No Third Bush term\" mantra again? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 12:33:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR! But yet, you complain of the trickle down effect of Bush. Wait until the trickled down effect of Obama starts to happen. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090519, 
        "postID": 31, 
        "quote": "Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR!", 
        "reply": " But yet, you complain of the trickle down effect of Bush. Wait until the trickled down effect of Obama starts to happen. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 12:37:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Yea, the first 100 days ok, not now though, it's all him now. Or are you going to blame Bush all the way through the next election? Will you be using the ole, \"No Third Bush term\" mantra again? He's still trying to fix everything that ALL the guys (Republican and Democrat) before him broke. Bush's first stimulus bill wasn't even passed when he took office.", 
        "intTime": 20090519, 
        "postID": 32, 
        "quote": "Originally posted by L0A1: Yea, the first 100 days ok, not now though, it's all him now. Or are you going to blame Bush all the way through the next election? Will you be using the ole, \"No Third Bush term\" mantra again?", 
        "reply": " He's still trying to fix everything that ALL the guys (Republican and Democrat) before him broke. Bush's first stimulus bill wasn't even passed when he took office.", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 12:38:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Kegler300: Obama Stood For Change, But All He's Brought Is Negative Economic Change Obviously you failed to notice 90% of the negative economic effects occured before Obama even became President. That's okay. Blaming it on him is the Republican thing to do. You mean like how the Democrats have none stopped blamed the Republicans. I'm sure by next year it will still be Bush's fault somehow even though it is still and has always been Obama. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090519, 
        "postID": 33, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Kegler300: Obama Stood For Change, But All He's Brought Is Negative Economic Change Obviously you failed to notice 90% of the negative economic effects occured before Obama even became President. That's okay. Blaming it on him is the Republican thing to do.", 
        "reply": " You mean like how the Democrats have none stopped blamed the Republicans. I'm sure by next year it will still be Bush's fault somehow even though it is still and has always been Obama. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 12:39:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: You're not alone, governor. Obama is bringing economic suicide to the rest of America as well. quote: Gov. Jim Gibbons said today that President Obama has denied his request to meet with him in Las Vegas later this month. \"I am disappointed at the hypocrisy shown by this administration,\" Gibbons said in a prepared statement. \"President Obama is coming to Las Vegas later this month for a political fundraiser, but he will not help the struggling families in Las Vegas and Nevada who are out of work because of his reckless comments.\" The Las Vegas Convention and Visitors Authority reports over 400 conventions and business meetings scheduled to take place in Las Vegas recently have cancelled. These cancelled events translate into 111,800 guests in Las Vegas and over 250,000 “room-nights”. The cancelled conventions and meetings have cost the Las Vegas economy over $100-million, not including gaming revenue. \"This is politics, pure and simple, President Obama stood for change, but all he has done is brought negative economic change to Nevada,\" Gibbons said. \"http://www.ktnv.com/Global/story.asp?S=10383051\" I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September", 
        "intTime": 20090519, 
        "postID": 34, 
        "quote": "Originally posted by Kegler300: You're not alone, governor. Obama is bringing economic suicide to the rest of America as well. quote: Gov. Jim Gibbons said today that President Obama has denied his request to meet with him in Las Vegas later this month. \"I am disappointed at the hypocrisy shown by this administration,\" Gibbons said in a prepared statement. \"President Obama is coming to Las Vegas later this month for a political fundraiser, but he will not help the struggling families in Las Vegas and Nevada who are out of work because of his reckless comments.\" The Las Vegas Convention and Visitors Authority reports over 400 conventions and business meetings scheduled to take place in Las Vegas recently have cancelled. These cancelled events translate into 111,800 guests in Las Vegas and over 250,000 “room-nights”. The cancelled conventions and meetings have cost the Las Vegas economy over $100-million, not including gaming revenue. \"This is politics, pure and simple, President Obama stood for change, but all he has done is brought negative economic change to Nevada,\" Gibbons said. \"http://www.ktnv.com/Global/story.asp?S=10383051\"", 
        "reply": " I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 13:07:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September It's funny how they get excited about the last administration being blamed for the economy. Obama hasn't even made it through his first year and the blame him, much less two terms.", 
        "intTime": 20090519, 
        "postID": 35, 
        "quote": "Originally posted by rayld2: I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September", 
        "reply": " It's funny how they get excited about the last administration being blamed for the economy. Obama hasn't even made it through his first year and the blame him, much less two terms.", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 13:19:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I'm starting to like Obama as President. Now he is making all SUV's, trucks, and cars in the US get at least 35 miles per gallon of gas by 2016. Thank God. I can't wait to drive my Shelby GT 500 Mustang down interstate 95 and get 35 miles per gallon coasting at 80 mph. I told you all a year or two ago that the Toyota Prius is here to stay.", 
        "intTime": 20090519, 
        "postID": 36, 
        "quote": "", 
        "reply": "I'm starting to like Obama as President. Now he is making all SUV's, trucks, and cars in the US get at least 35 miles per gallon of gas by 2016. Thank God. I can't wait to drive my Shelby GT 500 Mustang down interstate 95 and get 35 miles per gallon coasting at 80 mph. I told you all a year or two ago that the Toyota Prius is here to stay.", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 13:22:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by rayld2: I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September It's funny how they get excited about the last administration being blamed for the economy. Obama hasn't even made it through his first year and the blame him, much less two terms. Considering how much tax payer cash hes ****ed down the toilet since hes been in office can you blame them?", 
        "intTime": 20090519, 
        "postID": 37, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by rayld2: I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September It's funny how they get excited about the last administration being blamed for the economy. Obama hasn't even made it through his first year and the blame him, much less two terms.", 
        "reply": " Considering how much tax payer cash hes ****ed down the toilet since hes been in office can you blame them?", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 13:45:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: quote: Originally posted by Ol_Doc: quote: Originally posted by rayld2: I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September It's funny how they get excited about the last administration being blamed for the economy. Obama hasn't even made it through his first year and the blame him, much less two terms. Considering how much tax payer cash hes ****ed down the toilet since hes been in office can you blame them? Spending our way out of a recession isn't new. It's also worked before.", 
        "intTime": 20090519, 
        "postID": 38, 
        "quote": "Originally posted by NickBrand: quote: Originally posted by Ol_Doc: quote: Originally posted by rayld2: I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September It's funny how they get excited about the last administration being blamed for the economy. Obama hasn't even made it through his first year and the blame him, much less two terms. Considering how much tax payer cash hes ****ed down the toilet since hes been in office can you blame them?", 
        "reply": " Spending our way out of a recession isn't new. It's also worked before.", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 13:48:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I'm starting to like Obama as President. Now he is making all SUV's, trucks, and cars in the US get at least 35 miles per gallon of gas by 2016. Thank God. I can't wait to drive my Shelby GT 500 Mustang down interstate 95 and get 35 miles per gallon coasting at 80 mph. I told you all a year or two ago that the Toyota Prius is here to stay. You could put a direct injection 4-cyl turbo charged engine in the Shelby, cut the weight down to 2,500 pounds (the engine alone weighs almost 1,000 pounds with the 5.4L iron block and blower) and it could get better than CAFE standard mileage averages. Europe has been making efficient and economical cars for decades. It's about time we caught up. Good for Obama. We may be able to salvage the American Auto Industry yet. (Or were SUVs supposed to do that?)", 
        "intTime": 20090519, 
        "postID": 39, 
        "quote": "Originally posted by Duster6: I'm starting to like Obama as President. Now he is making all SUV's, trucks, and cars in the US get at least 35 miles per gallon of gas by 2016. Thank God. I can't wait to drive my Shelby GT 500 Mustang down interstate 95 and get 35 miles per gallon coasting at 80 mph. I told you all a year or two ago that the Toyota Prius is here to stay.", 
        "reply": " You could put a direct injection 4-cyl turbo charged engine in the Shelby, cut the weight down to 2,500 pounds (the engine alone weighs almost 1,000 pounds with the 5.4L iron block and blower) and it could get better than CAFE standard mileage averages. Europe has been making efficient and economical cars for decades. It's about time we caught up. Good for Obama. We may be able to salvage the American Auto Industry yet. (Or were SUVs supposed to do that?)", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 13:53:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Even the \"stimulus\" package is designed to fail to stimulate, and almost NONE of it has been distributed. So, even if it COULD, it CAN'T because the Bureauracy is not spending it. But, it is all George Bush's fault, right? For some reason, either Mr. Obama wants America to fail, or he's far less bright than we've all been told that he is. BTW, what, as Imus asked, is his IQ? nothing partcularly brghit about using the uh word in front of multiple teleprompters!", 
        "intTime": 20090519, 
        "postID": 40, 
        "quote": "Originally posted by peter3_1: Even the \"stimulus\" package is designed to fail to stimulate, and almost NONE of it has been distributed. So, even if it COULD, it CAN'T because the Bureauracy is not spending it. But, it is all George Bush's fault, right? For some reason, either Mr. Obama wants America to fail, or he's far less bright than we've all been told that he is. BTW, what, as Imus asked, is his IQ?", 
        "reply": " nothing partcularly brghit about using the uh word in front of multiple teleprompters!", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 14:00:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "EAG154"
    }, 
    {
        "content": "You're not alone, governor. Obama is bringing economic suicide to the rest of America as well. quote: Gov. Jim Gibbons said today that President Obama has denied his request to meet with him in Las Vegas later this month. \"I am disappointed at the hypocrisy shown by this administration,\" Gibbons said in a prepared statement. \"President Obama is coming to Las Vegas later this month for a political fundraiser, but he will not help the struggling families in Las Vegas and Nevada who are out of work because of his reckless comments.\" The Las Vegas Convention and Visitors Authority reports over 400 conventions and business meetings scheduled to take place in Las Vegas recently have cancelled. These cancelled events translate into 111,800 guests in Las Vegas and over 250,000 “room-nights”. The cancelled conventions and meetings have cost the Las Vegas economy over $100-million, not including gaming revenue. \"This is politics, pure and simple, President Obama stood for change, but all he has done is brought negative economic change to Nevada,\" Gibbons said. \"http://www.ktnv.com/Global/story.asp?S=10383051\" \"The World's Finest\"", 
        "intTime": 20090519, 
        "postID": 41, 
        "quote": "Gov. Jim Gibbons said today that President Obama has denied his request to meet with him in Las Vegas later this month. \"I am disappointed at the hypocrisy shown by this administration,\" Gibbons said in a prepared statement. \"President Obama is coming to Las Vegas later this month for a political fundraiser, but he will not help the struggling families in Las Vegas and Nevada who are out of work because of his reckless comments.\" The Las Vegas Convention and Visitors Authority reports over 400 conventions and business meetings scheduled to take place in Las Vegas recently have cancelled. These cancelled events translate into 111,800 guests in Las Vegas and over 250,000 “room-nights”. The cancelled conventions and meetings have cost the Las Vegas economy over $100-million, not including gaming revenue. \"This is politics, pure and simple, President Obama stood for change, but all he has done is brought negative economic change to Nevada,\" Gibbons said. \"http://www.ktnv.com/Global/story.asp?S=10383051\"", 
        "reply": "You're not alone, governor. Obama is bringing economic suicide to the rest of America as well.  \"The World's Finest\"", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 03:12:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "Kegler300"
    }, 
    {
        "content": "And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR!", 
        "intTime": 20090519, 
        "postID": 42, 
        "quote": "", 
        "reply": "And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR!", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 03:22:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR! But he will be flying into Las Vegas on \"Air Force One\" for a political fundraiser. Who pays for the operation, maintanence, and fuel for that jet again?", 
        "intTime": 20090519, 
        "postID": 43, 
        "quote": "Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR!", 
        "reply": " But he will be flying into Las Vegas on \"Air Force One\" for a political fundraiser. Who pays for the operation, maintanence, and fuel for that jet again?", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 07:36:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR! His statements are said to have cost Las Vegas over 100 million dollars, over 400 conventions have been cancelled since he made his statements. That can not be good for their economy. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 44, 
        "quote": "Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR!", 
        "reply": " His statements are said to have cost Las Vegas over 100 million dollars, over 400 conventions have been cancelled since he made his statements. That can not be good for their economy. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 07:38:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "L0A1"
    }, 
    {
        "content": "Why isn't harry marching right up Pennsylvania Ave and complaining? After, wasn't there some 'stimulus money' set for a useless high speed rail line from Los Angeles to Las Vegas---FOR WHAT? A political fundraiser is just more lip service! C'mon jack_flats--NO COMMENT!", 
        "intTime": 20090519, 
        "postID": 45, 
        "quote": "", 
        "reply": "Why isn't harry marching right up Pennsylvania Ave and complaining? After, wasn't there some 'stimulus money' set for a useless high speed rail line from Los Angeles to Las Vegas---FOR WHAT? A political fundraiser is just more lip service! C'mon jack_flats--NO COMMENT!", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 07:47:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Maybe those wealthy voters in Nevada who make their living off gamblers and conventions will boycott this fundraiser?? We can \"hope\" huh??", 
        "intTime": 20090519, 
        "postID": 46, 
        "quote": "", 
        "reply": "Maybe those wealthy voters in Nevada who make their living off gamblers and conventions will boycott this fundraiser?? We can \"hope\" huh??", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 10:52:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "3678131"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR! But he will be flying into Las Vegas on \"Air Force One\" for a political fundraiser. Who pays for the operation, maintanence, and fuel for that jet again? The same People he had running in the streets of Lower Manhattan in fear of their lives while his plane got a Photo Op. Those Americans who actually pay taxes, which leaves out large numbers of his Cabinet.............", 
        "intTime": 20090519, 
        "postID": 47, 
        "quote": "Originally posted by stec74: quote: Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR! But he will be flying into Las Vegas on \"Air Force One\" for a political fundraiser. Who pays for the operation, maintanence, and fuel for that jet again?", 
        "reply": " The same People he had running in the streets of Lower Manhattan in fear of their lives while his plane got a Photo Op. Those Americans who actually pay taxes, which leaves out large numbers of his Cabinet.............", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 11:17:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "Even the \"stimulus\" package is designed to fail to stimulate, and almost NONE of it has been distributed. So, even if it COULD, it CAN'T because the Bureauracy is not spending it. But, it is all George Bush's fault, right? For some reason, either Mr. Obama wants America to fail, or he's far less bright than we've all been told that he is. BTW, what, as Imus asked, is his IQ?", 
        "intTime": 20090519, 
        "postID": 48, 
        "quote": "", 
        "reply": "Even the \"stimulus\" package is designed to fail to stimulate, and almost NONE of it has been distributed. So, even if it COULD, it CAN'T because the Bureauracy is not spending it. But, it is all George Bush's fault, right? For some reason, either Mr. Obama wants America to fail, or he's far less bright than we've all been told that he is. BTW, what, as Imus asked, is his IQ?", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 11:34:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: Obama Stood For Change, But All He's Brought Is Negative Economic Change Obviously you failed to notice 90% of the negative economic effects occured before Obama even became President. That's okay. Blaming it on him is the Republican thing to do.", 
        "intTime": 20090519, 
        "postID": 49, 
        "quote": "Originally posted by Kegler300: Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "reply": " Obviously you failed to notice 90% of the negative economic effects occured before Obama even became President. That's okay. Blaming it on him is the Republican thing to do.", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 12:06:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Kegler300: Obama Stood For Change, But All He's Brought Is Negative Economic Change Obviously you failed to notice 90% of the negative economic effects occured before Obama even became President. That's okay. Blaming it on him is the Republican thing to do. Yea, the first 100 days ok, not now though, it's all him now. Or are you going to blame Bush all the way through the next election? Will you be using the ole, \"No Third Bush term\" mantra again? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090519, 
        "postID": 50, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Kegler300: Obama Stood For Change, But All He's Brought Is Negative Economic Change Obviously you failed to notice 90% of the negative economic effects occured before Obama even became President. That's okay. Blaming it on him is the Republican thing to do.", 
        "reply": " Yea, the first 100 days ok, not now though, it's all him now. Or are you going to blame Bush all the way through the next election? Will you be using the ole, \"No Third Bush term\" mantra again? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 12:33:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR! But yet, you complain of the trickle down effect of Bush. Wait until the trickled down effect of Obama starts to happen. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090519, 
        "postID": 51, 
        "quote": "Originally posted by karlhungusjr: And what did Obama do to cause the state such disaster? He said \"You can't get corporate jets. You can't go take a trip to Las Vegas or go down to the Super Bowl on the taxpayer's dime.\" the HORROR!", 
        "reply": " But yet, you complain of the trickle down effect of Bush. Wait until the trickled down effect of Obama starts to happen. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 12:37:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Yea, the first 100 days ok, not now though, it's all him now. Or are you going to blame Bush all the way through the next election? Will you be using the ole, \"No Third Bush term\" mantra again? He's still trying to fix everything that ALL the guys (Republican and Democrat) before him broke. Bush's first stimulus bill wasn't even passed when he took office.", 
        "intTime": 20090519, 
        "postID": 52, 
        "quote": "Originally posted by L0A1: Yea, the first 100 days ok, not now though, it's all him now. Or are you going to blame Bush all the way through the next election? Will you be using the ole, \"No Third Bush term\" mantra again?", 
        "reply": " He's still trying to fix everything that ALL the guys (Republican and Democrat) before him broke. Bush's first stimulus bill wasn't even passed when he took office.", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 12:38:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Kegler300: Obama Stood For Change, But All He's Brought Is Negative Economic Change Obviously you failed to notice 90% of the negative economic effects occured before Obama even became President. That's okay. Blaming it on him is the Republican thing to do. You mean like how the Democrats have none stopped blamed the Republicans. I'm sure by next year it will still be Bush's fault somehow even though it is still and has always been Obama. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090519, 
        "postID": 53, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Kegler300: Obama Stood For Change, But All He's Brought Is Negative Economic Change Obviously you failed to notice 90% of the negative economic effects occured before Obama even became President. That's okay. Blaming it on him is the Republican thing to do.", 
        "reply": " You mean like how the Democrats have none stopped blamed the Republicans. I'm sure by next year it will still be Bush's fault somehow even though it is still and has always been Obama. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 12:39:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: You're not alone, governor. Obama is bringing economic suicide to the rest of America as well. quote: Gov. Jim Gibbons said today that President Obama has denied his request to meet with him in Las Vegas later this month. \"I am disappointed at the hypocrisy shown by this administration,\" Gibbons said in a prepared statement. \"President Obama is coming to Las Vegas later this month for a political fundraiser, but he will not help the struggling families in Las Vegas and Nevada who are out of work because of his reckless comments.\" The Las Vegas Convention and Visitors Authority reports over 400 conventions and business meetings scheduled to take place in Las Vegas recently have cancelled. These cancelled events translate into 111,800 guests in Las Vegas and over 250,000 “room-nights”. The cancelled conventions and meetings have cost the Las Vegas economy over $100-million, not including gaming revenue. \"This is politics, pure and simple, President Obama stood for change, but all he has done is brought negative economic change to Nevada,\" Gibbons said. \"http://www.ktnv.com/Global/story.asp?S=10383051\" I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September", 
        "intTime": 20090519, 
        "postID": 54, 
        "quote": "Originally posted by Kegler300: You're not alone, governor. Obama is bringing economic suicide to the rest of America as well. quote: Gov. Jim Gibbons said today that President Obama has denied his request to meet with him in Las Vegas later this month. \"I am disappointed at the hypocrisy shown by this administration,\" Gibbons said in a prepared statement. \"President Obama is coming to Las Vegas later this month for a political fundraiser, but he will not help the struggling families in Las Vegas and Nevada who are out of work because of his reckless comments.\" The Las Vegas Convention and Visitors Authority reports over 400 conventions and business meetings scheduled to take place in Las Vegas recently have cancelled. These cancelled events translate into 111,800 guests in Las Vegas and over 250,000 “room-nights”. The cancelled conventions and meetings have cost the Las Vegas economy over $100-million, not including gaming revenue. \"This is politics, pure and simple, President Obama stood for change, but all he has done is brought negative economic change to Nevada,\" Gibbons said. \"http://www.ktnv.com/Global/story.asp?S=10383051\"", 
        "reply": " I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 13:07:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September It's funny how they get excited about the last administration being blamed for the economy. Obama hasn't even made it through his first year and the blame him, much less two terms.", 
        "intTime": 20090519, 
        "postID": 55, 
        "quote": "Originally posted by rayld2: I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September", 
        "reply": " It's funny how they get excited about the last administration being blamed for the economy. Obama hasn't even made it through his first year and the blame him, much less two terms.", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 13:19:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "I'm starting to like Obama as President. Now he is making all SUV's, trucks, and cars in the US get at least 35 miles per gallon of gas by 2016. Thank God. I can't wait to drive my Shelby GT 500 Mustang down interstate 95 and get 35 miles per gallon coasting at 80 mph. I told you all a year or two ago that the Toyota Prius is here to stay.", 
        "intTime": 20090519, 
        "postID": 56, 
        "quote": "", 
        "reply": "I'm starting to like Obama as President. Now he is making all SUV's, trucks, and cars in the US get at least 35 miles per gallon of gas by 2016. Thank God. I can't wait to drive my Shelby GT 500 Mustang down interstate 95 and get 35 miles per gallon coasting at 80 mph. I told you all a year or two ago that the Toyota Prius is here to stay.", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 13:22:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by rayld2: I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September It's funny how they get excited about the last administration being blamed for the economy. Obama hasn't even made it through his first year and the blame him, much less two terms. Considering how much tax payer cash hes ****ed down the toilet since hes been in office can you blame them?", 
        "intTime": 20090519, 
        "postID": 57, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by rayld2: I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September It's funny how they get excited about the last administration being blamed for the economy. Obama hasn't even made it through his first year and the blame him, much less two terms.", 
        "reply": " Considering how much tax payer cash hes ****ed down the toilet since hes been in office can you blame them?", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 13:45:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: quote: Originally posted by Ol_Doc: quote: Originally posted by rayld2: I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September It's funny how they get excited about the last administration being blamed for the economy. Obama hasn't even made it through his first year and the blame him, much less two terms. Considering how much tax payer cash hes ****ed down the toilet since hes been in office can you blame them? Spending our way out of a recession isn't new. It's also worked before.", 
        "intTime": 20090519, 
        "postID": 58, 
        "quote": "Originally posted by NickBrand: quote: Originally posted by Ol_Doc: quote: Originally posted by rayld2: I love the way the Repubs are trying to blame this all on Obama as if nothing they did in the previous years had any effect. Do Repubs really think their party was that ineffective?. Obama's FIRST budget doesn't even go into effect until Oct. 2009, we are STILL using the last Bush admin budget. US Fiscal Year: 1 October - 30 September It's funny how they get excited about the last administration being blamed for the economy. Obama hasn't even made it through his first year and the blame him, much less two terms. Considering how much tax payer cash hes ****ed down the toilet since hes been in office can you blame them?", 
        "reply": " Spending our way out of a recession isn't new. It's also worked before.", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 13:48:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I'm starting to like Obama as President. Now he is making all SUV's, trucks, and cars in the US get at least 35 miles per gallon of gas by 2016. Thank God. I can't wait to drive my Shelby GT 500 Mustang down interstate 95 and get 35 miles per gallon coasting at 80 mph. I told you all a year or two ago that the Toyota Prius is here to stay. You could put a direct injection 4-cyl turbo charged engine in the Shelby, cut the weight down to 2,500 pounds (the engine alone weighs almost 1,000 pounds with the 5.4L iron block and blower) and it could get better than CAFE standard mileage averages. Europe has been making efficient and economical cars for decades. It's about time we caught up. Good for Obama. We may be able to salvage the American Auto Industry yet. (Or were SUVs supposed to do that?)", 
        "intTime": 20090519, 
        "postID": 59, 
        "quote": "Originally posted by Duster6: I'm starting to like Obama as President. Now he is making all SUV's, trucks, and cars in the US get at least 35 miles per gallon of gas by 2016. Thank God. I can't wait to drive my Shelby GT 500 Mustang down interstate 95 and get 35 miles per gallon coasting at 80 mph. I told you all a year or two ago that the Toyota Prius is here to stay.", 
        "reply": " You could put a direct injection 4-cyl turbo charged engine in the Shelby, cut the weight down to 2,500 pounds (the engine alone weighs almost 1,000 pounds with the 5.4L iron block and blower) and it could get better than CAFE standard mileage averages. Europe has been making efficient and economical cars for decades. It's about time we caught up. Good for Obama. We may be able to salvage the American Auto Industry yet. (Or were SUVs supposed to do that?)", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 13:53:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Even the \"stimulus\" package is designed to fail to stimulate, and almost NONE of it has been distributed. So, even if it COULD, it CAN'T because the Bureauracy is not spending it. But, it is all George Bush's fault, right? For some reason, either Mr. Obama wants America to fail, or he's far less bright than we've all been told that he is. BTW, what, as Imus asked, is his IQ? nothing partcularly brghit about using the uh word in front of multiple teleprompters!", 
        "intTime": 20090519, 
        "postID": 60, 
        "quote": "Originally posted by peter3_1: Even the \"stimulus\" package is designed to fail to stimulate, and almost NONE of it has been distributed. So, even if it COULD, it CAN'T because the Bureauracy is not spending it. But, it is all George Bush's fault, right? For some reason, either Mr. Obama wants America to fail, or he's far less bright than we've all been told that he is. BTW, what, as Imus asked, is his IQ?", 
        "reply": " nothing partcularly brghit about using the uh word in front of multiple teleprompters!", 
        "threadID": "672198221_6820036322001", 
        "time": "2009-05-19 14:00:00", 
        "title": "Obama Stood For Change, But All He's Brought Is Negative Economic Change", 
        "userID": "EAG154"
    }
]