[
    {
        "content": "\"http://seattletimes.nwsource.com/html/localnews/2008955371_webraid31m.html\" quote: In an unusual move, a group of illegal immigrants arrested in a work-site raid at a Bellingham engine plant last month have been released from detention, without bond, and given permission to work legally, while a post-raid investigation continues. Agents with U.S. Immigration and Customs Enforcement had arrested 28 workers during a Feb. 24 raid at Yamato Engine Specialists. ICE investigators said many of the workers from Mexico and Central America had used false documents to obtain employment at the plant. Saying she had not been made aware of the raid, Secretary of Homeland Security Janet Napolitano immediately ordered a probe into the actions of the Seattle-based ICE team that conducted the raid. Napolitano and the Obama administration have said they want to shift the focus of these raids from the illegal workers themselves to the employers who knowingly hire them. Immediately following the arrest of the workers, three women with children were released on humanitarian grounds and a fourth worker with a medical condition was also allowed to leave. Last week, all the remaining workers not deported were allowed to leave the Northwest Detention Center in Tacoma without bond — a move immigration attorneys call highly unusual. Now all Americans will know why Illegal Immigration is such a problem in Arizona. When Napolitano was Governor she cared more for the immigrants than her own state. She left us with a huge defecit and an unsustainable budget. Why do we even have laws when the offenders are not only set free but they are rewarded with work visas? That is 28 less jobs for Americans.", 
        "intTime": 20090402, 
        "postID": 1, 
        "quote": "In an unusual move, a group of illegal immigrants arrested in a work-site raid at a Bellingham engine plant last month have been released from detention, without bond, and given permission to work legally, while a post-raid investigation continues. Agents with U.S. Immigration and Customs Enforcement had arrested 28 workers during a Feb. 24 raid at Yamato Engine Specialists. ICE investigators said many of the workers from Mexico and Central America had used false documents to obtain employment at the plant. Saying she had not been made aware of the raid, Secretary of Homeland Security Janet Napolitano immediately ordered a probe into the actions of the Seattle-based ICE team that conducted the raid. Napolitano and the Obama administration have said they want to shift the focus of these raids from the illegal workers themselves to the employers who knowingly hire them. Immediately following the arrest of the workers, three women with children were released on humanitarian grounds and a fourth worker with a medical condition was also allowed to leave. Last week, all the remaining workers not deported were allowed to leave the Northwest Detention Center in Tacoma without bond — a move immigration attorneys call highly unusual.", 
        "reply": "\"http://seattletimes.nwsource.com/html/localnews/2008955371_webraid31m.html\"  Now all Americans will know why Illegal Immigration is such a problem in Arizona. When Napolitano was Governor she cared more for the immigrants than her own state. She left us with a huge defecit and an unsustainable budget. Why do we even have laws when the offenders are not only set free but they are rewarded with work visas? That is 28 less jobs for Americans.", 
        "threadID": "672198221_1650016912001", 
        "time": "2009-04-02 06:28:00", 
        "title": "Illegal Immigrants Arrested, Then Released, Allowed to Work Legally", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: \"http://seattletimes.nwsource.com/html/localnews/2008955371_webraid31m.html\" quote: In an unusual move, a group of illegal immigrants arrested in a work-site raid at a Bellingham engine plant last month have been released from detention, without bond, and given permission to work legally, while a post-raid investigation continues. Agents with U.S. Immigration and Customs Enforcement had arrested 28 workers during a Feb. 24 raid at Yamato Engine Specialists. ICE investigators said many of the workers from Mexico and Central America had used false documents to obtain employment at the plant. Saying she had not been made aware of the raid, Secretary of Homeland Security Janet Napolitano immediately ordered a probe into the actions of the Seattle-based ICE team that conducted the raid. Napolitano and the Obama administration have said they want to shift the focus of these raids from the illegal workers themselves to the employers who knowingly hire them. Immediately following the arrest of the workers, three women with children were released on humanitarian grounds and a fourth worker with a medical condition was also allowed to leave. Last week, all the remaining workers not deported were allowed to leave the Northwest Detention Center in Tacoma without bond — a move immigration attorneys call highly unusual. Now all Americans will know why Illegal Immigration is such a problem in Arizona. When Napolitano was Governor she cared more for the immigrants than her own state. She left us with a huge defecit and an unsustainable budget. Why do we even have laws when the offenders are not only set free but they are rewarded with work visas? That is 28 less jobs for Americans. Aparently our officials don't understand how fast the U.S.A. can become a Mexican state!", 
        "intTime": 20090403, 
        "postID": 2, 
        "quote": "Originally posted by stec74: \"http://seattletimes.nwsource.com/html/localnews/2008955371_webraid31m.html\" quote: In an unusual move, a group of illegal immigrants arrested in a work-site raid at a Bellingham engine plant last month have been released from detention, without bond, and given permission to work legally, while a post-raid investigation continues. Agents with U.S. Immigration and Customs Enforcement had arrested 28 workers during a Feb. 24 raid at Yamato Engine Specialists. ICE investigators said many of the workers from Mexico and Central America had used false documents to obtain employment at the plant. Saying she had not been made aware of the raid, Secretary of Homeland Security Janet Napolitano immediately ordered a probe into the actions of the Seattle-based ICE team that conducted the raid. Napolitano and the Obama administration have said they want to shift the focus of these raids from the illegal workers themselves to the employers who knowingly hire them. Immediately following the arrest of the workers, three women with children were released on humanitarian grounds and a fourth worker with a medical condition was also allowed to leave. Last week, all the remaining workers not deported were allowed to leave the Northwest Detention Center in Tacoma without bond — a move immigration attorneys call highly unusual. Now all Americans will know why Illegal Immigration is such a problem in Arizona. When Napolitano was Governor she cared more for the immigrants than her own state. She left us with a huge defecit and an unsustainable budget. Why do we even have laws when the offenders are not only set free but they are rewarded with work visas? That is 28 less jobs for Americans.", 
        "reply": " Aparently our officials don't understand how fast the U.S.A. can become a Mexican state!", 
        "threadID": "672198221_1650016912001", 
        "time": "2009-04-03 06:24:00", 
        "title": "Illegal Immigrants Arrested, Then Released, Allowed to Work Legally", 
        "userID": "EAG154"
    }, 
    {
        "content": "and another one of my friends are out of a job... my friend lost his job about a year ago.... he went back about a week or so ago to see if he could come back to work... nope it is filled with illegals who work for $4-5 less then what my friend was making...", 
        "intTime": 20090403, 
        "postID": 3, 
        "quote": "", 
        "reply": "and another one of my friends are out of a job... my friend lost his job about a year ago.... he went back about a week or so ago to see if he could come back to work... nope it is filled with illegals who work for $4-5 less then what my friend was making...", 
        "threadID": "672198221_1650016912001", 
        "time": "2009-04-03 06:27:00", 
        "title": "Illegal Immigrants Arrested, Then Released, Allowed to Work Legally", 
        "userID": "outlaws93"
    }
]