[
    {
        "content": "By EDMUND L. ANDREWS Published: April 19, 2009 \"\"\"http://www.nytimes.com/2009/04/20/business/20bailout.html?hp WASHINGTON — President Obama’s top economic advisers have determined that they can shore up the nation’s banking system without having to ask Congress for more money any time soon, according to administration officials. In a significant shift, White House and Treasury Department officials now say they can stretch what is left of the $700 billion financial bailout fund further than they had expected a few months ago, simply by converting the government’s existing loans to the nation’s 19 biggest banks into common stock. Converting those loans to common shares would turn the federal aid into available capital for a bank — and give the government a large ownership stake in return. While the option appears to be a quick and easy way to avoid a confrontation with Congressional leaders wary of putting more money into the banks, some critics would consider it a back door to nationalization, since the government could become the largest shareholder in several banks.",
        "intTime": 20090421,
        "postID": 1,
        "quote": "",
        "reply": "By EDMUND L. ANDREWS Published: April 19, 2009 \"\"\"http://www.nytimes.com/2009/04/20/business/20bailout.html?hp WASHINGTON — President Obama’s top economic advisers have determined that they can shore up the nation’s banking system without having to ask Congress for more money any time soon, according to administration officials. In a significant shift, White House and Treasury Department officials now say they can stretch what is left of the $700 billion financial bailout fund further than they had expected a few months ago, simply by converting the government’s existing loans to the nation’s 19 biggest banks into common stock. Converting those loans to common shares would turn the federal aid into available capital for a bank — and give the government a large ownership stake in return. While the option appears to be a quick and easy way to avoid a confrontation with Congressional leaders wary of putting more money into the banks, some critics would consider it a back door to nationalization, since the government could become the largest shareholder in several banks.",
        "threadID": "672198221_9810093122001",
        "time": "2009-04-21 12:43:00",
        "title": "U.S. May Convert Bailouts To Common Stock: B",
        "userID": "mainedawg"
    },
    {
        "content": "quote: Originally posted by mainedawg: By EDMUND L. ANDREWS Published: April 19, 2009 \"\"\"http://www.nytimes.com/2009/04/20/business/20bailout.html?hp WASHINGTON — President Obama’s top economic advisers have determined that they can shore up the nation’s banking system without having to ask Congress for more money any time soon, according to administration officials. In a significant shift, White House and Treasury Department officials now say they can stretch what is left of the $700 billion financial bailout fund further than they had expected a few months ago, simply by converting the government’s existing loans to the nation’s 19 biggest banks into common stock. Converting those loans to common shares would turn the federal aid into available capital for a bank — and give the government a large ownership stake in return. While the option appears to be a quick and easy way to avoid a confrontation with Congressional leaders wary of putting more money into the banks, some critics would consider it a back door to nationalization, since the government could become the largest shareholder in several banks. Welcome to Nationalized banking... Way to go you socialist *******s, first the automobile industry, now the banks.... Yeaaaaa to stalinism....gobama, gobama, gobama I can't wait for the new electric meter to be put on my house.",
        "intTime": 20090421,
        "postID": 2,
        "quote": "Originally posted by mainedawg: By EDMUND L. ANDREWS Published: April 19, 2009 \"\"\"http://www.nytimes.com/2009/04/20/business/20bailout.html?hp WASHINGTON — President Obama’s top economic advisers have determined that they can shore up the nation’s banking system without having to ask Congress for more money any time soon, according to administration officials. In a significant shift, White House and Treasury Department officials now say they can stretch what is left of the $700 billion financial bailout fund further than they had expected a few months ago, simply by converting the government’s existing loans to the nation’s 19 biggest banks into common stock. Converting those loans to common shares would turn the federal aid into available capital for a bank — and give the government a large ownership stake in return. While the option appears to be a quick and easy way to avoid a confrontation with Congressional leaders wary of putting more money into the banks, some critics would consider it a back door to nationalization, since the government could become the largest shareholder in several banks.",
        "reply": " Welcome to Nationalized banking... Way to go you socialist *******s, first the automobile industry, now the banks.... Yeaaaaa to stalinism....gobama, gobama, gobama I can't wait for the new electric meter to be put on my house.",
        "threadID": "672198221_9810093122001",
        "time": "2009-04-21 12:52:00",
        "title": "U.S. May Convert Bailouts To Common Stock: B",
        "userID": "comingofage"
    },
    {
        "content": "When I read the story I thought I was seeing it wrong and read it again. The option will be quick and easy they say. That was the trouble before, it was too easy for the ones that should be playing with our money. Let alone the loans they gave to the unqualified My bank showed me where allthis thieft of our money thru the banking system now costs me 1.452 higher on the interest rate. Where is all the money and we put one person in jail. Everyone that wrote one of the loans or paper buyouts should serve 10 years each. And now we are going to trust the Government to be the largest shareholder?????????????",
        "intTime": 20090421,
        "postID": 3,
        "quote": "",
        "reply": "When I read the story I thought I was seeing it wrong and read it again. The option will be quick and easy they say. That was the trouble before, it was too easy for the ones that should be playing with our money. Let alone the loans they gave to the unqualified My bank showed me where allthis thieft of our money thru the banking system now costs me 1.452 higher on the interest rate. Where is all the money and we put one person in jail. Everyone that wrote one of the loans or paper buyouts should serve 10 years each. And now we are going to trust the Government to be the largest shareholder?????????????",
        "threadID": "672198221_9810093122001",
        "time": "2009-04-21 13:04:00",
        "title": "U.S. May Convert Bailouts To Common Stock: B",
        "userID": "mainedawg"
    },
    {
        "content": "i dont understand a lot of this but what i do i dont like...",
        "intTime": 20090421,
        "postID": 4,
        "quote": "",
        "reply": "i dont understand a lot of this but what i do i dont like...",
        "threadID": "672198221_9810093122001",
        "time": "2009-04-21 13:18:00",
        "title": "U.S. May Convert Bailouts To Common Stock: B",
        "userID": "outlaws93"
    },
    {
        "content": "Dawg; I believe President Reagan was the one that said; \"Some revolutions are won without anybody firing a shot\". Our government has figured out a way to circumvent the Constitution and take contol of our economy. This is actually very simple. They've been waiting for this since Carter. They've had 30+ years to get all there ducks in a row. The left (Socialists) have won the battle. They are going to continue taking over businesses and destroying the founding documents until the next election. Some of the damage we can fix quickly, some we will never fix. This problem can be fixed. Oh, its gonna cost us, but it will be reversed. The things that really scare me are Obama's damning words on foreign lands. His wanting to work with dicatators and communist leaders. His lack of strenght when he's being disrespected by these morons. I wrote a letter and sent it to every swinging (idiot) @#$% in washington. The last thing I said in the letter was; \"On January 20th, Obama will begin tearing up the Constitution and the Bill of Rights\". The banks are a small step to the plan.",
        "intTime": 20090421,
        "postID": 5,
        "quote": "",
        "reply": "Dawg; I believe President Reagan was the one that said; \"Some revolutions are won without anybody firing a shot\". Our government has figured out a way to circumvent the Constitution and take contol of our economy. This is actually very simple. They've been waiting for this since Carter. They've had 30+ years to get all there ducks in a row. The left (Socialists) have won the battle. They are going to continue taking over businesses and destroying the founding documents until the next election. Some of the damage we can fix quickly, some we will never fix. This problem can be fixed. Oh, its gonna cost us, but it will be reversed. The things that really scare me are Obama's damning words on foreign lands. His wanting to work with dicatators and communist leaders. His lack of strenght when he's being disrespected by these morons. I wrote a letter and sent it to every swinging (idiot) @#$% in washington. The last thing I said in the letter was; \"On January 20th, Obama will begin tearing up the Constitution and the Bill of Rights\". The banks are a small step to the plan.",
        "threadID": "672198221_9810093122001",
        "time": "2009-04-21 13:23:00",
        "title": "U.S. May Convert Bailouts To Common Stock: B",
        "userID": "comingofage"
    },
    {
        "content": "The plan to convert government loan funds into common stock is risky and they'll have to be very careful as to which companies have their TARP funds converted to stock - but if it works, then the TARP money could be recovered (and then some) far quicker than anticipated and we might actually make a profit off of the whole mess.",
        "intTime": 20090422,
        "postID": 6,
        "quote": "",
        "reply": "The plan to convert government loan funds into common stock is risky and they'll have to be very careful as to which companies have their TARP funds converted to stock - but if it works, then the TARP money could be recovered (and then some) far quicker than anticipated and we might actually make a profit off of the whole mess.",
        "threadID": "672198221_9810093122001",
        "time": "2009-04-22 05:13:00",
        "title": "U.S. May Convert Bailouts To Common Stock: B",
        "userID": "PhoenixDark"
    },
    {
        "content": "Seems to me that such a conversion of TARP funds to shares would set up a huge conflict of interest for the government ... Should it happen, I would hope that that conflict is partially minimized by taking non-voting shares.",
        "intTime": 20090422,
        "postID": 7,
        "quote": "",
        "reply": "Seems to me that such a conversion of TARP funds to shares would set up a huge conflict of interest for the government ... Should it happen, I would hope that that conflict is partially minimized by taking non-voting shares.",
        "threadID": "672198221_9810093122001",
        "time": "2009-04-22 06:10:00",
        "title": "U.S. May Convert Bailouts To Common Stock: B",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "Anyone notice the thread running on the CFO of Freddie Mac and his suicide?... The plot thickens or is it sickens?... I would say LOL but, this isn't funny... Respectfully, SUNLINER81",
        "intTime": 20090422,
        "postID": 8,
        "quote": "",
        "reply": "Anyone notice the thread running on the CFO of Freddie Mac and his suicide?... The plot thickens or is it sickens?... I would say LOL but, this isn't funny... Respectfully, SUNLINER81",
        "threadID": "672198221_9810093122001",
        "time": "2009-04-22 06:14:00",
        "title": "U.S. May Convert Bailouts To Common Stock: B",
        "userID": "SUNLINER81"
    },
    {
        "content": "Govermints owning the banks ... that's commy-nism, ain't it?",
        "intTime": 20090422,
        "postID": 9,
        "quote": "",
        "reply": "Govermints owning the banks ... that's commy-nism, ain't it?",
        "threadID": "672198221_9810093122001",
        "time": "2009-04-22 07:13:00",
        "title": "U.S. May Convert Bailouts To Common Stock: B",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by PhoenixDark: The plan to convert government loan funds into common stock is risky and they'll have to be very careful as to which companies have their TARP funds converted to stock - but if it works, then the TARP money could be recovered (and then some) far quicker than anticipated and we might actually make a profit off of the whole mess. Risky? Answer one question: Name a department of the (except the military) government that runs correctly, within a budget and actually produces something and that comes in under budget? And please, don't use the word \"we\" in a sentence that has the federal governemnt as the share holder. Ummmm do you know anything about the Social Security system in this county? History lesson: FDR (the Dumbacrats hero) said it was an \"investment\" that Americans would be putting there money into. It would be \"safe\" and the return would be high. And the whole time FDR was telling Americans this, he was getting the Supreme Court to rule in his favor to let the government use the funds for whatever the governemnt needed them for. They still are doing that today. Now do you still think \"we\" are going to make a penny? If you do, you are probably still waiting for that \"stimulus check\"...RLAMO.",
        "intTime": 20090422,
        "postID": 10,
        "quote": "Originally posted by PhoenixDark: The plan to convert government loan funds into common stock is risky and they'll have to be very careful as to which companies have their TARP funds converted to stock - but if it works, then the TARP money could be recovered (and then some) far quicker than anticipated and we might actually make a profit off of the whole mess.",
        "reply": " Risky? Answer one question: Name a department of the (except the military) government that runs correctly, within a budget and actually produces something and that comes in under budget? And please, don't use the word \"we\" in a sentence that has the federal governemnt as the share holder. Ummmm do you know anything about the Social Security system in this county? History lesson: FDR (the Dumbacrats hero) said it was an \"investment\" that Americans would be putting there money into. It would be \"safe\" and the return would be high. And the whole time FDR was telling Americans this, he was getting the Supreme Court to rule in his favor to let the government use the funds for whatever the governemnt needed them for. They still are doing that today. Now do you still think \"we\" are going to make a penny? If you do, you are probably still waiting for that \"stimulus check\"...RLAMO.",
        "threadID": "672198221_9810093122001",
        "time": "2009-04-22 07:21:00",
        "title": "U.S. May Convert Bailouts To Common Stock: B",
        "userID": "comingofage"
    },
    {
        "content": "There's a bad joke about the 'old' homeless wanting to get away from the 'new' homeless by building their own tent city out in the boonies. But the rule will be no hi-tech tents. \"Are you getting a TARP loan?\", another asks. No we're using real tarps. I'm still trying to figure out what so bad about giving all this money to ordinary people. Let them claim it as income and if they are living well tax it back off them. It will stimulate the economy a lot more than letting the few rich convert dud shares into cash. At least they could buy some decent tenting equipment, and food. >from New America Media: Tarp Nation Squatter villages arise from the ashes of the West's booms and busts Posted: Mar 29, 2009 Editor's Note: Everywhere, Fresno, Calif., to the struggling casino district of Reno, Nev., and the upscale suburbs of Washington state, tent cities and shantytowns with names like Taco Flat have sprung up to house the poor and dispossessed. These roving, ramshackle neighborhoods were part of the American cityscape long before the stock market nosedived, and they are unlikely to disappear when prosperity returns. FRESNO, Calif. -- Marie and Francisco Caro needed a home after they married, but like many people in California's Central Valley, they didn't have enough money to sign a lease or take out a mortgage. They were tired of sleeping on separate beds in crowded homeless shelters, so they found a slice of land alongside the Union Pacific Railroad tracks in downtown Fresno. The soil was sandy and dry, prone to rising up into clouds when the autumn winds came. All around, farm equipment factories and warehouses loomed out of the dust, their walls coarse and sun-bleached like desert mountainsides. Even a strong person could wither in a place like this, but if they wanted to build a home, nobody was likely to stop them. So Marie and Francisco gathered scrap wood and took their chances. They raised their tarp roof high like a steeple, then walled off the world with office cubicle dividers. Thieves stayed outside and so did the wind, and the sound of the passing freight trains softened. When I visited the Caros in January, a fire burned in an overturned oil barrel, warming the cool air, and fresh-cut Christmas tree boughs hung on the walls for decoration. While Francisco chopped wood, Marie, 43, confided that she wants to live somewhere else. All she needs is a modest place with a sink and a gas stove, she said, maybe even a little television for watching church services on Sundays. ............(more)",
        "intTime": 20090422,
        "postID": 11,
        "quote": "",
        "reply": "There's a bad joke about the 'old' homeless wanting to get away from the 'new' homeless by building their own tent city out in the boonies. But the rule will be no hi-tech tents. \"Are you getting a TARP loan?\", another asks. No we're using real tarps. I'm still trying to figure out what so bad about giving all this money to ordinary people. Let them claim it as income and if they are living well tax it back off them. It will stimulate the economy a lot more than letting the few rich convert dud shares into cash. At least they could buy some decent tenting equipment, and food. >from New America Media: Tarp Nation Squatter villages arise from the ashes of the West's booms and busts Posted: Mar 29, 2009 Editor's Note: Everywhere, Fresno, Calif., to the struggling casino district of Reno, Nev., and the upscale suburbs of Washington state, tent cities and shantytowns with names like Taco Flat have sprung up to house the poor and dispossessed. These roving, ramshackle neighborhoods were part of the American cityscape long before the stock market nosedived, and they are unlikely to disappear when prosperity returns. FRESNO, Calif. -- Marie and Francisco Caro needed a home after they married, but like many people in California's Central Valley, they didn't have enough money to sign a lease or take out a mortgage. They were tired of sleeping on separate beds in crowded homeless shelters, so they found a slice of land alongside the Union Pacific Railroad tracks in downtown Fresno. The soil was sandy and dry, prone to rising up into clouds when the autumn winds came. All around, farm equipment factories and warehouses loomed out of the dust, their walls coarse and sun-bleached like desert mountainsides. Even a strong person could wither in a place like this, but if they wanted to build a home, nobody was likely to stop them. So Marie and Francisco gathered scrap wood and took their chances. They raised their tarp roof high like a steeple, then walled off the world with office cubicle dividers. Thieves stayed outside and so did the wind, and the sound of the passing freight trains softened. When I visited the Caros in January, a fire burned in an overturned oil barrel, warming the cool air, and fresh-cut Christmas tree boughs hung on the walls for decoration. While Francisco chopped wood, Marie, 43, confided that she wants to live somewhere else. All she needs is a modest place with a sink and a gas stove, she said, maybe even a little television for watching church services on Sundays. ............(more)",
        "threadID": "672198221_9810093122001",
        "time": "2009-04-22 07:42:00",
        "title": "U.S. May Convert Bailouts To Common Stock: B",
        "userID": "popsiq"
    },
    {
        "content": "quote: There's a bad joke about the 'old' homeless wanting to get away from the 'new' homeless by building their own tent city out in the boonies. But the rule will be no hi-tech tents. hehehehe not far off... what we use to do is have one nice squat we lived in and when mardi gras came along we would open up trashy junked out building to put the new squaters coming for mardi gras in.... but yet i was and there is a lot of squat nazies.... squat nazi is a squatter who hoards his squat for himself and his select few friends....",
        "intTime": 20090422,
        "postID": 12,
        "quote": "There's a bad joke about the 'old' homeless wanting to get away from the 'new' homeless by building their own tent city out in the boonies. But the rule will be no hi-tech tents.",
        "reply": " hehehehe not far off... what we use to do is have one nice squat we lived in and when mardi gras came along we would open up trashy junked out building to put the new squaters coming for mardi gras in.... but yet i was and there is a lot of squat nazies.... squat nazi is a squatter who hoards his squat for himself and his select few friends....",
        "threadID": "672198221_9810093122001",
        "time": "2009-04-22 07:57:00",
        "title": "U.S. May Convert Bailouts To Common Stock: B",
        "userID": "outlaws93"
    }
]