[
    {
        "content": "We hereby retract our April 28 editorial \"Barack's in the basement\" because we misapplied several polling comparisons of various presidents after their first 100 days in office. The point of our editorial was that various establishment media outlets were overstating President Obama's popularity. We continue to believe that, in terms of the tone of coverage, the point is valid. However, for data establishing that point, we followed George Mason University professor Judith Apter Klinghoffer's analysis and compared Gallup polling data for elected presidents going back to President Nixon. We did our own analysis but failed to see that some of the polls we were using did not lend themselves to direct intercomparisons. Most importantly, we used figures for overall \"approval\" ratings for former President George W. Bush - 62 percent - and compared them to the ratings of \"excellent\" or \"good\" for Mr. Obama, which combined were 56 percent. However, when asked the same question - approve or disapprove - for Mr. Obama for the same three days of his first term, April 20-22, his rating actually was 65 percent, thus putting him above rather than below Mr. Bush. In short, even if our overall figures did not compare oranges to something almost entirely different like apples, we did at least do something like comparing oranges to tangerines. But close doesn't cut it in this business. We regret the errors. http://washingtontimes.com/news/2009/may/06/we-were-wrong/ Now if all the right wing 'News' sources that cited this would follow their example. Not likely though.",
        "intTime": 20090507,
        "postID": 1,
        "quote": "",
        "reply": "We hereby retract our April 28 editorial \"Barack's in the basement\" because we misapplied several polling comparisons of various presidents after their first 100 days in office. The point of our editorial was that various establishment media outlets were overstating President Obama's popularity. We continue to believe that, in terms of the tone of coverage, the point is valid. However, for data establishing that point, we followed George Mason University professor Judith Apter Klinghoffer's analysis and compared Gallup polling data for elected presidents going back to President Nixon. We did our own analysis but failed to see that some of the polls we were using did not lend themselves to direct intercomparisons. Most importantly, we used figures for overall \"approval\" ratings for former President George W. Bush - 62 percent - and compared them to the ratings of \"excellent\" or \"good\" for Mr. Obama, which combined were 56 percent. However, when asked the same question - approve or disapprove - for Mr. Obama for the same three days of his first term, April 20-22, his rating actually was 65 percent, thus putting him above rather than below Mr. Bush. In short, even if our overall figures did not compare oranges to something almost entirely different like apples, we did at least do something like comparing oranges to tangerines. But close doesn't cut it in this business. We regret the errors. http://washingtontimes.com/news/2009/may/06/we-were-wrong/ Now if all the right wing 'News' sources that cited this would follow their example. Not likely though.",
        "threadID": "672198221_9070087222001",
        "time": "2009-05-07 21:18:00",
        "title": "EDITORIAL:  Washington Times, \"We were wrong\"",
        "userID": "jdksfcret"
    },
    {
        "content": "I have to respect any reporting agency that voluntarily -- not coerced -- retracts a statement of misinformation. Accidents happen. When they do, stand up like a responsible business and agent of truth and admit the error. Right wing or left wing, anyone that purported this same misinformation should follow the example of the Washington Times. Then again, it might be a good idea to have all your ducks in a row before you decide to go public in the first place. But, like I said, accidents happen. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "intTime": 20090508,
        "postID": 2,
        "quote": "",
        "reply": "I have to respect any reporting agency that voluntarily -- not coerced -- retracts a statement of misinformation. Accidents happen. When they do, stand up like a responsible business and agent of truth and admit the error. Right wing or left wing, anyone that purported this same misinformation should follow the example of the Washington Times. Then again, it might be a good idea to have all your ducks in a row before you decide to go public in the first place. But, like I said, accidents happen. It's not that there is no God or that He isn't listening. You're probably just asking the wrong questions.",
        "threadID": "672198221_9070087222001",
        "time": "2009-05-08 04:46:00",
        "title": "EDITORIAL:  Washington Times, \"We were wrong\"",
        "userID": "FollowMeInfantry"
    },
    {
        "content": "quote: Originally posted by FollowMeInfantry: I have to respect any reporting agency that voluntarily -- not coerced -- retracts a statement of misinformation. Accidents happen. When they do, stand up like a responsible business and agent of truth and admit the error. Right wing or left wing, anyone that purported this same misinformation should follow the example of the Washington Times. Then again, it might be a good idea to have all your ducks in a row before you decide to go public in the first place. But, like I said, accidents happen. They really didn't have much of a choice. Their own numbers didn't add up, and anyone who bothered to do the addition noticed it. Bascially they apologised for claiming the one plus one equals three. Dave",
        "intTime": 20090508,
        "postID": 3,
        "quote": "Originally posted by FollowMeInfantry: I have to respect any reporting agency that voluntarily -- not coerced -- retracts a statement of misinformation. Accidents happen. When they do, stand up like a responsible business and agent of truth and admit the error. Right wing or left wing, anyone that purported this same misinformation should follow the example of the Washington Times. Then again, it might be a good idea to have all your ducks in a row before you decide to go public in the first place. But, like I said, accidents happen.",
        "reply": " They really didn't have much of a choice. Their own numbers didn't add up, and anyone who bothered to do the addition noticed it. Bascially they apologised for claiming the one plus one equals three. Dave",
        "threadID": "672198221_9070087222001",
        "time": "2009-05-08 08:16:00",
        "title": "EDITORIAL:  Washington Times, \"We were wrong\"",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by jdksfcret: We hereby retract our April 28 editorial \"Barack's in the basement\" because we misapplied several polling comparisons of various presidents after their first 100 days in office. The point of our editorial was that various establishment media outlets were overstating President Obama's popularity. We continue to believe that, in terms of the tone of coverage, the point is valid. However, for data establishing that point, we followed George Mason University professor Judith Apter Klinghoffer's analysis and compared Gallup polling data for elected presidents going back to President Nixon. We did our own analysis but failed to see that some of the polls we were using did not lend themselves to direct intercomparisons. Most importantly, we used figures for overall \"approval\" ratings for former President George W. Bush - 62 percent - and compared them to the ratings of \"excellent\" or \"good\" for Mr. Obama, which combined were 56 percent. However, when asked the same question - approve or disapprove - for Mr. Obama for the same three days of his first term, April 20-22, his rating actually was 65 percent, thus putting him above rather than below Mr. Bush. In short, even if our overall figures did not compare oranges to something almost entirely different like apples, we did at least do something like comparing oranges to tangerines. But close doesn't cut it in this business. We regret the errors. http://washingtontimes.com/news/2009/may/06/we-were-wrong/ Now if all the right wing 'News' sources that cited this would follow their example. Not likely though. That wishful thinking applies to all news sources, not just \"right wing\". Do you believe that all \"left wing\" news sources are abouve reproach? And yes, it is nice to see a publication freely admit a mistake.",
        "intTime": 20090508,
        "postID": 4,
        "quote": "Originally posted by jdksfcret: We hereby retract our April 28 editorial \"Barack's in the basement\" because we misapplied several polling comparisons of various presidents after their first 100 days in office. The point of our editorial was that various establishment media outlets were overstating President Obama's popularity. We continue to believe that, in terms of the tone of coverage, the point is valid. However, for data establishing that point, we followed George Mason University professor Judith Apter Klinghoffer's analysis and compared Gallup polling data for elected presidents going back to President Nixon. We did our own analysis but failed to see that some of the polls we were using did not lend themselves to direct intercomparisons. Most importantly, we used figures for overall \"approval\" ratings for former President George W. Bush - 62 percent - and compared them to the ratings of \"excellent\" or \"good\" for Mr. Obama, which combined were 56 percent. However, when asked the same question - approve or disapprove - for Mr. Obama for the same three days of his first term, April 20-22, his rating actually was 65 percent, thus putting him above rather than below Mr. Bush. In short, even if our overall figures did not compare oranges to something almost entirely different like apples, we did at least do something like comparing oranges to tangerines. But close doesn't cut it in this business. We regret the errors. http://washingtontimes.com/news/2009/may/06/we-were-wrong/ Now if all the right wing 'News' sources that cited this would follow their example. Not likely though.",
        "reply": " That wishful thinking applies to all news sources, not just \"right wing\". Do you believe that all \"left wing\" news sources are abouve reproach? And yes, it is nice to see a publication freely admit a mistake.",
        "threadID": "672198221_9070087222001",
        "time": "2009-05-08 12:12:00",
        "title": "EDITORIAL:  Washington Times, \"We were wrong\"",
        "userID": "sw614"
    },
    {
        "content": "quote: sw614 sw614, If they do (which I doubt) you'll be the first to know. No I don't think that 'left wing' news sources are above reproach. That 'left wing' rag 'The Washington Post' contiues to let George Will get away with putting out false data about global warming in his op-ed columns. http://mediamatters.org/blog/200904080037",
        "intTime": 20090508,
        "postID": 5,
        "quote": "sw614",
        "reply": " sw614, If they do (which I doubt) you'll be the first to know. No I don't think that 'left wing' news sources are above reproach. That 'left wing' rag 'The Washington Post' contiues to let George Will get away with putting out false data about global warming in his op-ed columns. http://mediamatters.org/blog/200904080037",
        "threadID": "672198221_9070087222001",
        "time": "2009-05-08 17:36:00",
        "title": "EDITORIAL:  Washington Times, \"We were wrong\"",
        "userID": "jdksfcret"
    }
]