[
    {
        "content": "Posted on youtube by user \"d43e49\"... in less than 30 seconds the raptor was in the HUD display of a nimble T-38 Talon used to train space shuttle astronuts.", 
        "intTime": 20090422, 
        "postID": 1, 
        "quote": "", 
        "reply": "Posted on youtube by user \"d43e49\"... in less than 30 seconds the raptor was in the HUD display of a nimble T-38 Talon used to train space shuttle astronuts.", 
        "threadID": "672198221_6540064122001", 
        "time": "2009-04-22 11:55:00", 
        "title": "F-22 Raptor Shot Down by T-38 Talon", 
        "userID": "wharthog"
    }, 
    {
        "content": "+http://www.youtube.com/watch?v=UXmDj3mFrXQ Can anyone confirm or debunk this? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090422, 
        "postID": 2, 
        "quote": "", 
        "reply": "+http://www.youtube.com/watch?v=UXmDj3mFrXQ Can anyone confirm or debunk this? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6540064122001", 
        "time": "2009-04-22 12:11:00", 
        "title": "F-22 Raptor Shot Down by T-38 Talon", 
        "userID": "NSNN"
    }, 
    {
        "content": "True or not, the T-38 would have been shot down several times before engagement became visual. What was the scenario and where was it at? Interesting. But then again, every acft that has ever exercised against the T-38 has ended up in the crosshairs.", 
        "intTime": 20090422, 
        "postID": 3, 
        "quote": "", 
        "reply": "True or not, the T-38 would have been shot down several times before engagement became visual. What was the scenario and where was it at? Interesting. But then again, every acft that has ever exercised against the T-38 has ended up in the crosshairs.", 
        "threadID": "672198221_6540064122001", 
        "time": "2009-04-22 12:20:00", 
        "title": "F-22 Raptor Shot Down by T-38 Talon", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: True or not, the T-38 would have been shot down several times before engagement became visual. What was the scenario and where was it at? Interesting. But then again, every acft that has ever exercised against the T-38 has ended up in the crosshairs. If this happened it just proves again what has ALWAYS been true. In combat the most important thing about an aircraft is the pilot at the controls.", 
        "intTime": 20090422, 
        "postID": 4, 
        "quote": "Originally posted by sw614: True or not, the T-38 would have been shot down several times before engagement became visual. What was the scenario and where was it at? Interesting. But then again, every acft that has ever exercised against the T-38 has ended up in the crosshairs.", 
        "reply": " If this happened it just proves again what has ALWAYS been true. In combat the most important thing about an aircraft is the pilot at the controls.", 
        "threadID": "672198221_6540064122001", 
        "time": "2009-04-22 12:23:00", 
        "title": "F-22 Raptor Shot Down by T-38 Talon", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by sw614: True or not, the T-38 would have been shot down several times before engagement became visual. What was the scenario and where was it at? Interesting. But then again, every acft that has ever exercised against the T-38 has ended up in the crosshairs. If this happened it just proves again what has ALWAYS been true. In combat the most important thing about an aircraft is the pilot at the controls. Absolutely correct. If a pilot flying any acft loses aituation awareness, he is dead. We also do not know the ROEs for the engagement or who was started at the advantage, etc. From what I saw in the vidoe, the F-22 never used thrust vectoring to any large degree, if at all. Wonder why? That he did not know the plane was there is the only answer I can come up with unless T/V was not allowed for the engagement.", 
        "intTime": 20090422, 
        "postID": 5, 
        "quote": "Originally posted by rayld2: quote: Originally posted by sw614: True or not, the T-38 would have been shot down several times before engagement became visual. What was the scenario and where was it at? Interesting. But then again, every acft that has ever exercised against the T-38 has ended up in the crosshairs. If this happened it just proves again what has ALWAYS been true. In combat the most important thing about an aircraft is the pilot at the controls.", 
        "reply": " Absolutely correct. If a pilot flying any acft loses aituation awareness, he is dead. We also do not know the ROEs for the engagement or who was started at the advantage, etc. From what I saw in the vidoe, the F-22 never used thrust vectoring to any large degree, if at all. Wonder why? That he did not know the plane was there is the only answer I can come up with unless T/V was not allowed for the engagement.", 
        "threadID": "672198221_6540064122001", 
        "time": "2009-04-22 12:30:00", 
        "title": "F-22 Raptor Shot Down by T-38 Talon", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by sw614: quote: Originally posted by rayld2: quote: Originally posted by sw614: True or not, the T-38 would have been shot down several times before engagement became visual. What was the scenario and where was it at? Interesting. But then again, every acft that has ever exercised against the T-38 has ended up in the crosshairs. If this happened it just proves again what has ALWAYS been true. In combat the most important thing about an aircraft is the pilot at the controls. Absolutely correct. If a pilot flying any acft loses aituation awareness, he is dead. We also do not know the ROEs for the engagement or who was started at the advantage, etc. From what I saw in the vidoe, the F-22 never used thrust vectoring to any large degree, if at all. Wonder why? That he did not know the plane was there is the only answer I can come up with unless T/V was not allowed for the engagement. The F-22 can't turn thrust vectoring \"on\" and \"off\" - it's an automatic feature, activated by the aircraft's flight control computer. One thing I did notice is that the HUD footage was spliced at least a half dozen times - indicating that the engagement took longer than the 42 seconds depicted in the video. As to the Raptor pilot not knowing the T-38 was there - unlikely given the passive sensors embedded throughout the Raptor's airframe. If the pilot didn't know the Talon was there, he was ignoring or unaware of what his sensors were telling him.", 
        "intTime": 20090422, 
        "postID": 6, 
        "quote": "Originally posted by sw614: quote: Originally posted by rayld2: quote: Originally posted by sw614: True or not, the T-38 would have been shot down several times before engagement became visual. What was the scenario and where was it at? Interesting. But then again, every acft that has ever exercised against the T-38 has ended up in the crosshairs. If this happened it just proves again what has ALWAYS been true. In combat the most important thing about an aircraft is the pilot at the controls. Absolutely correct. If a pilot flying any acft loses aituation awareness, he is dead. We also do not know the ROEs for the engagement or who was started at the advantage, etc. From what I saw in the vidoe, the F-22 never used thrust vectoring to any large degree, if at all. Wonder why? That he did not know the plane was there is the only answer I can come up with unless T/V was not allowed for the engagement.", 
        "reply": " The F-22 can't turn thrust vectoring \"on\" and \"off\" - it's an automatic feature, activated by the aircraft's flight control computer. One thing I did notice is that the HUD footage was spliced at least a half dozen times - indicating that the engagement took longer than the 42 seconds depicted in the video. As to the Raptor pilot not knowing the T-38 was there - unlikely given the passive sensors embedded throughout the Raptor's airframe. If the pilot didn't know the Talon was there, he was ignoring or unaware of what his sensors were telling him.", 
        "threadID": "672198221_6540064122001", 
        "time": "2009-04-22 13:26:00", 
        "title": "F-22 Raptor Shot Down by T-38 Talon", 
        "userID": "PhoenixDark"
    }, 
    {
        "content": "Seems plausable to me. The T-38 is, in reality a two seat version of the Northrup F-5 supersonic fighter. When I was assigned to adversary squadron VFC-13 the pilots would electronically \"shoot down\" fleet F-14 Tomcat fighters with subsonic A-4 Skyhawk attack bombers. And in most cases they were equipped with just a \"gun\" electronic pod and not \"missiles.\" The naval Fighter Weapons School \"Top Gun\" and VF-126 would do the same thing.", 
        "intTime": 20090422, 
        "postID": 7, 
        "quote": "", 
        "reply": "Seems plausable to me. The T-38 is, in reality a two seat version of the Northrup F-5 supersonic fighter. When I was assigned to adversary squadron VFC-13 the pilots would electronically \"shoot down\" fleet F-14 Tomcat fighters with subsonic A-4 Skyhawk attack bombers. And in most cases they were equipped with just a \"gun\" electronic pod and not \"missiles.\" The naval Fighter Weapons School \"Top Gun\" and VF-126 would do the same thing.", 
        "threadID": "672198221_6540064122001", 
        "time": "2009-04-22 13:55:00", 
        "title": "F-22 Raptor Shot Down by T-38 Talon", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "It was me I confess, I promise to never use my bee-bee gun again.....", 
        "intTime": 20090422, 
        "postID": 8, 
        "quote": "", 
        "reply": "It was me I confess, I promise to never use my bee-bee gun again.....", 
        "threadID": "672198221_6540064122001", 
        "time": "2009-04-22 16:32:00", 
        "title": "F-22 Raptor Shot Down by T-38 Talon", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by sw614: quote: Originally posted by rayld2: quote: Originally posted by sw614: True or not, the T-38 would have been shot down several times before engagement became visual. What was the scenario and where was it at? Interesting. But then again, every acft that has ever exercised against the T-38 has ended up in the crosshairs. If this happened it just proves again what has ALWAYS been true. In combat the most important thing about an aircraft is the pilot at the controls. Absolutely correct. If a pilot flying any acft loses aituation awareness, he is dead. We also do not know the ROEs for the engagement or who was started at the advantage, etc. From what I saw in the vidoe, the F-22 never used thrust vectoring to any large degree, if at all. Wonder why? That he did not know the plane was there is the only answer I can come up with unless T/V was not allowed for the engagement. The F-22 can't turn thrust vectoring \"on\" and \"off\" - it's an automatic feature, activated by the aircraft's flight control computer. One thing I did notice is that the HUD footage was spliced at least a half dozen times - indicating that the engagement took longer than the 42 seconds depicted in the video. As to the Raptor pilot not knowing the T-38 was there - unlikely given the passive sensors embedded throughout the Raptor's airframe. If the pilot didn't know the Talon was there, he was ignoring or unaware of what his sensors were telling him. Very true, but vectoring is activated by what manuvers the pilot wants to do. Evidently he did not input to the point they are activated. I wonder if the ROEs set a maximum G for the engagement??????? Anyone recall the max G for a T-38? given age, are they under any type of restrictions? The T-38 really isn't a F-5, so those num,bers really can not be used. F-5 had regualr skins and different wings and attach points. The T-38 used much more honeycomb for panels. If the T-38 is not emitting anything, he may have been able to sneak up. And you are correct, the clip is a compilation of what the author wanted us to see. Makes me wonder why the F-22 did not simply accelerate away. Another 'real world' question to ponder. How well would a T-38 type airframe be able to accomplish close in combat with weapons hanging from it? The T-38 is not know for its high thrust-to-weight ratio. While the J-85 is a decent performer, at best in burner it is what, around 3800 lb thrust each?", 
        "intTime": 20090422, 
        "postID": 9, 
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by sw614: quote: Originally posted by rayld2: quote: Originally posted by sw614: True or not, the T-38 would have been shot down several times before engagement became visual. What was the scenario and where was it at? Interesting. But then again, every acft that has ever exercised against the T-38 has ended up in the crosshairs. If this happened it just proves again what has ALWAYS been true. In combat the most important thing about an aircraft is the pilot at the controls. Absolutely correct. If a pilot flying any acft loses aituation awareness, he is dead. We also do not know the ROEs for the engagement or who was started at the advantage, etc. From what I saw in the vidoe, the F-22 never used thrust vectoring to any large degree, if at all. Wonder why? That he did not know the plane was there is the only answer I can come up with unless T/V was not allowed for the engagement. The F-22 can't turn thrust vectoring \"on\" and \"off\" - it's an automatic feature, activated by the aircraft's flight control computer. One thing I did notice is that the HUD footage was spliced at least a half dozen times - indicating that the engagement took longer than the 42 seconds depicted in the video. As to the Raptor pilot not knowing the T-38 was there - unlikely given the passive sensors embedded throughout the Raptor's airframe. If the pilot didn't know the Talon was there, he was ignoring or unaware of what his sensors were telling him.", 
        "reply": " Very true, but vectoring is activated by what manuvers the pilot wants to do. Evidently he did not input to the point they are activated. I wonder if the ROEs set a maximum G for the engagement??????? Anyone recall the max G for a T-38? given age, are they under any type of restrictions? The T-38 really isn't a F-5, so those num,bers really can not be used. F-5 had regualr skins and different wings and attach points. The T-38 used much more honeycomb for panels. If the T-38 is not emitting anything, he may have been able to sneak up. And you are correct, the clip is a compilation of what the author wanted us to see. Makes me wonder why the F-22 did not simply accelerate away. Another 'real world' question to ponder. How well would a T-38 type airframe be able to accomplish close in combat with weapons hanging from it? The T-38 is not know for its high thrust-to-weight ratio. While the J-85 is a decent performer, at best in burner it is what, around 3800 lb thrust each?", 
        "threadID": "672198221_6540064122001", 
        "time": "2009-04-22 17:14:00", 
        "title": "F-22 Raptor Shot Down by T-38 Talon", 
        "userID": "sw614"
    }, 
    {
        "content": "it's those Chinese virus bugs they gots in the computer components..... and they're \"hatching\". One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090422, 
        "postID": 10, 
        "quote": "", 
        "reply": "it's those Chinese virus bugs they gots in the computer components..... and they're \"hatching\". One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_6540064122001", 
        "time": "2009-04-22 17:36:00", 
        "title": "F-22 Raptor Shot Down by T-38 Talon", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "You do have it registered don't you? quote: Originally posted by dman1948: It was me I confess, I promise to never use my bee-bee gun again.....", 
        "intTime": 20090422, 
        "postID": 11, 
        "quote": "Originally posted by dman1948: It was me I confess, I promise to never use my bee-bee gun again.....", 
        "reply": "You do have it registered don't you? ", 
        "threadID": "672198221_6540064122001", 
        "time": "2009-04-22 18:20:00", 
        "title": "F-22 Raptor Shot Down by T-38 Talon", 
        "userID": "fishnfanatic"
    }, 
    {
        "content": "In this video, the F-22 pilot is flying \"blind\" meaning they are not using AESA. This video comes from an excersise in which the pilots had to use optical/IR only in a WVR engagement against 2 T-38s. The Raptor pilot was a newbie taking on very highly skilled aggressor pilots to test their situational awareness against enemy \"stealth\" aircraft. Using T-38s gives the Raptor trainee a chance to take on small but nimble adversaries. A clean T-38/F-5 is much more agile and capable than one would think. In these exercises its the pilots skill and not the aircraft itself that gets tested.", 
        "intTime": 20090422, 
        "postID": 12, 
        "quote": "", 
        "reply": "In this video, the F-22 pilot is flying \"blind\" meaning they are not using AESA. This video comes from an excersise in which the pilots had to use optical/IR only in a WVR engagement against 2 T-38s. The Raptor pilot was a newbie taking on very highly skilled aggressor pilots to test their situational awareness against enemy \"stealth\" aircraft. Using T-38s gives the Raptor trainee a chance to take on small but nimble adversaries. A clean T-38/F-5 is much more agile and capable than one would think. In these exercises its the pilots skill and not the aircraft itself that gets tested.", 
        "threadID": "672198221_6540064122001", 
        "time": "2009-04-22 18:52:00", 
        "title": "F-22 Raptor Shot Down by T-38 Talon", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: In this video, the F-22 pilot is flying \"blind\" meaning they are not using AESA. This video comes from an excersise in which the pilots had to use optical/IR only in a WVR engagement against 2 T-38s. The Raptor pilot was a newbie taking on very highly skilled aggressor pilots to test their situational awareness against enemy \"stealth\" aircraft. Using T-38s gives the Raptor trainee a chance to take on small but nimble adversaries. A clean T-38/F-5 is much more agile and capable than one would think. In these exercises its the pilots skill and not the aircraft itself that gets tested. Yes, they are very nimble. It was just when the T-birds flew them, they did not make enough good ole NOISE!!!!!", 
        "intTime": 20090423, 
        "postID": 13, 
        "quote": "Originally posted by FlankerFlyer: In this video, the F-22 pilot is flying \"blind\" meaning they are not using AESA. This video comes from an excersise in which the pilots had to use optical/IR only in a WVR engagement against 2 T-38s. The Raptor pilot was a newbie taking on very highly skilled aggressor pilots to test their situational awareness against enemy \"stealth\" aircraft. Using T-38s gives the Raptor trainee a chance to take on small but nimble adversaries. A clean T-38/F-5 is much more agile and capable than one would think. In these exercises its the pilots skill and not the aircraft itself that gets tested.", 
        "reply": " Yes, they are very nimble. It was just when the T-birds flew them, they did not make enough good ole NOISE!!!!!", 
        "threadID": "672198221_6540064122001", 
        "time": "2009-04-23 06:50:00", 
        "title": "F-22 Raptor Shot Down by T-38 Talon", 
        "userID": "sw614"
    }, 
    {
        "content": "Yes NSNN, I work at Sheppard and it indeed is true that a T-38A model, no less ,shot (Electronicaly) Aa F-22 last summer, I believe the time is right. The F-22 was from Langley. It was al;l hush, hish for a whjile but it was soome out in the open.", 
        "intTime": 20090424, 
        "postID": 14, 
        "quote": "", 
        "reply": "Yes NSNN, I work at Sheppard and it indeed is true that a T-38A model, no less ,shot (Electronicaly) Aa F-22 last summer, I believe the time is right. The F-22 was from Langley. It was al;l hush, hish for a whjile but it was soome out in the open.", 
        "threadID": "672198221_6540064122001", 
        "time": "2009-04-24 15:01:00", 
        "title": "F-22 Raptor Shot Down by T-38 Talon", 
        "userID": "FALCON16CC"
    }, 
    {
        "content": "Training is training. Got to learn to crawl before walking or running. The whole pass is very typical of any bump-head mission...no big deal... By the way, high tech doesn't automatically mean victory. I've had Harriers and F-4s beat F-16s. Pilots, Tactics and Opportunity makes as much difference as the geewizz in their ride - - Study up on the trouble MIG-17s gave the F-4s over Nam -- The biggest mistake is to assume the other guy will run or die just because he's in an older jet. If he knows your tactics well enough, he can get you to use your over-confidence to kill yourself. Wandering and Wondering", 
        "intTime": 20090424, 
        "postID": 15, 
        "quote": "", 
        "reply": "Training is training. Got to learn to crawl before walking or running. The whole pass is very typical of any bump-head mission...no big deal... By the way, high tech doesn't automatically mean victory. I've had Harriers and F-4s beat F-16s. Pilots, Tactics and Opportunity makes as much difference as the geewizz in their ride - - Study up on the trouble MIG-17s gave the F-4s over Nam -- The biggest mistake is to assume the other guy will run or die just because he's in an older jet. If he knows your tactics well enough, he can get you to use your over-confidence to kill yourself. Wandering and Wondering", 
        "threadID": "672198221_6540064122001", 
        "time": "2009-04-24 17:08:00", 
        "title": "F-22 Raptor Shot Down by T-38 Talon", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by dman1948: It was me I confess, I promise to never use my bee-bee gun again..... Oh yes !!! And you were on the grassy noll with that bee-bee gun too. I knew it.", 
        "intTime": 20090425, 
        "postID": 16, 
        "quote": "Originally posted by dman1948: It was me I confess, I promise to never use my bee-bee gun again.....", 
        "reply": " Oh yes !!! And you were on the grassy noll with that bee-bee gun too. I knew it.", 
        "threadID": "672198221_6540064122001", 
        "time": "2009-04-25 20:49:00", 
        "title": "F-22 Raptor Shot Down by T-38 Talon", 
        "userID": "SP_Five_O"
    }
]