[
    {
        "content": "RE: http://www.military.com/opinion/0,15202,187049,00.html Good on him. I have always liked their music, now even moreso",
        "intTime": 20090317,
        "postID": 1,
        "quote": "",
        "reply": "RE: http://www.military.com/opinion/0,15202,187049,00.html Good on him. I have always liked their music, now even moreso",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-17 19:20:00",
        "title": "Thank a Soldier",
        "userID": "billdawg24"
    },
    {
        "content": "We have and do talk to the veterans we know, they are a wealth of perspective and inspiration. I am curious to hear the album. I am a longtime fan of queensryche and can relate to this subject very much of recent time. My wife is a newly commissioned Ensign and through out the last year have come to realize a lot of the same things Geoff mentioned in his column. We have turned into a patriotic family. You become perceived in a certain way when you are. I am very proud of her and it's been interesting and eye opening as to what others feel about the military. She is a child of divorce and it's been very weird seeing the way each side has reacted. Our biggest regret is that her Grand father had passed prior to the decision to join. He was a highly decorated veteran (a flying tiger) and regrettably wouldn't talk about it with us when he was still living. I have found it that a lot of families don't speak of their time in the service. I am curious if Geoff has heard stories that family members haven't. For example he has waited this long to speak to his own father.",
        "intTime": 20090317,
        "postID": 2,
        "quote": "",
        "reply": "We have and do talk to the veterans we know, they are a wealth of perspective and inspiration. I am curious to hear the album. I am a longtime fan of queensryche and can relate to this subject very much of recent time. My wife is a newly commissioned Ensign and through out the last year have come to realize a lot of the same things Geoff mentioned in his column. We have turned into a patriotic family. You become perceived in a certain way when you are. I am very proud of her and it's been interesting and eye opening as to what others feel about the military. She is a child of divorce and it's been very weird seeing the way each side has reacted. Our biggest regret is that her Grand father had passed prior to the decision to join. He was a highly decorated veteran (a flying tiger) and regrettably wouldn't talk about it with us when he was still living. I have found it that a lot of families don't speak of their time in the service. I am curious if Geoff has heard stories that family members haven't. For example he has waited this long to speak to his own father.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-17 22:40:00",
        "title": "Thank a Soldier",
        "userID": "obsidian05"
    },
    {
        "content": "Hats off to Geoff Tate for interviewing his father on video about his wartime experiences. In fact, a video interview posted on the internet is how I found a living WWII soldier back in January. I have since established a dialog with his grand-nephew to let him know I honor his bravery. A year ago, I knew nothing really of the sacrifices of a soldier. Then, in April, I found a trunk full of letters in my great aunt's garage (over 400). These were written to and from her husband who was a 1st Lt. in the 551st Parachute Infantry Battalion and who died in the Battle of the Bulge in 1945. I try to imagine myself sleep starved and hungry, jumping out of airplanes with explosives and marching head-on into machine guns in the frozen forest. My great uncle did all of this and somehow remained a hopeless romantic, describing in great detail the home they would one day share overlooking the bay. How lucky I am to have a home and share it with my husband! Reading the letters led to watching films on the subject, then reading books... searching the internet... and finding people who were actually there. I love how today's technology can help us learn stories untold, share pictures unseen. An aspiring writer, I am compelled to pen some of their story for future generations. I feel it is our responsibility to preserve the many facets of a given history. Nobody wants to glorify war, but I hope we all continue to glorify our freedoms and the remarkable courage of a soldier. Thanks Geoff. My husband and I will have to get the new album. We grew up on your songs. They are a shining part of our history. Jennifer Minshall",
        "intTime": 20090318,
        "postID": 3,
        "quote": "",
        "reply": "Hats off to Geoff Tate for interviewing his father on video about his wartime experiences. In fact, a video interview posted on the internet is how I found a living WWII soldier back in January. I have since established a dialog with his grand-nephew to let him know I honor his bravery. A year ago, I knew nothing really of the sacrifices of a soldier. Then, in April, I found a trunk full of letters in my great aunt's garage (over 400). These were written to and from her husband who was a 1st Lt. in the 551st Parachute Infantry Battalion and who died in the Battle of the Bulge in 1945. I try to imagine myself sleep starved and hungry, jumping out of airplanes with explosives and marching head-on into machine guns in the frozen forest. My great uncle did all of this and somehow remained a hopeless romantic, describing in great detail the home they would one day share overlooking the bay. How lucky I am to have a home and share it with my husband! Reading the letters led to watching films on the subject, then reading books... searching the internet... and finding people who were actually there. I love how today's technology can help us learn stories untold, share pictures unseen. An aspiring writer, I am compelled to pen some of their story for future generations. I feel it is our responsibility to preserve the many facets of a given history. Nobody wants to glorify war, but I hope we all continue to glorify our freedoms and the remarkable courage of a soldier. Thanks Geoff. My husband and I will have to get the new album. We grew up on your songs. They are a shining part of our history. Jennifer Minshall",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 04:18:00",
        "title": "Thank a Soldier",
        "userID": "20591640"
    },
    {
        "content": "Thanks to Geoff- I guess this is a problem of our own making- wanting to protect our families,my dad took years to talk about WWII- I had to let him in on my problems from GFI to get it started. War is not pretty & hard to explain- I have been remiss in not tlking to my son about either. It's uncomfortable to bare you're soul to someone who ahs never been there. But like our WWII vets, if we don't then the complacent will never realize the thin line between having and not having. Thanks Geoff for the wake up call.",
        "intTime": 20090318,
        "postID": 4,
        "quote": "",
        "reply": "Thanks to Geoff- I guess this is a problem of our own making- wanting to protect our families,my dad took years to talk about WWII- I had to let him in on my problems from GFI to get it started. War is not pretty & hard to explain- I have been remiss in not tlking to my son about either. It's uncomfortable to bare you're soul to someone who ahs never been there. But like our WWII vets, if we don't then the complacent will never realize the thin line between having and not having. Thanks Geoff for the wake up call.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 06:53:00",
        "title": "Thank a Soldier",
        "userID": "lovatscot"
    },
    {
        "content": "When i was flipping through the pages on the military.com home page, i saw a picture that had been a face that i have met in person before. I asked myself \"Could this be Geoff Tate? On military.com?\" Sure enough, it had been one of my favorite singers. It was quite moving to read the article that he had written. Some times, people that are sucessful in this world are, indeed, losing sight of the fact that their fame and their fortune would not be possible without our military men and women risking, and at times even losing their lives. I am glad to read that some one who is leading a life that is a dream to most, and is also some one that i look up to, reconizes that he is only free because of many brave men and women.",
        "intTime": 20090318,
        "postID": 5,
        "quote": "",
        "reply": "When i was flipping through the pages on the military.com home page, i saw a picture that had been a face that i have met in person before. I asked myself \"Could this be Geoff Tate? On military.com?\" Sure enough, it had been one of my favorite singers. It was quite moving to read the article that he had written. Some times, people that are sucessful in this world are, indeed, losing sight of the fact that their fame and their fortune would not be possible without our military men and women risking, and at times even losing their lives. I am glad to read that some one who is leading a life that is a dream to most, and is also some one that i look up to, reconizes that he is only free because of many brave men and women.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 07:15:00",
        "title": "Thank a Soldier",
        "userID": "AceShaw"
    },
    {
        "content": "Always loved Queensryche... Funny story: A local radio station does a charity every year where you can call in and donate money to hear any song you want..of course people want to hear some off the wall stuff, right. Well one of the DJ's is a queensryche fan and wants to play operation mindcrime..the entire album. The general manager comes up with some random dollar figure, I forget what it was..and adds a time limit..if the listeners dont pony up the money by a certain time...no deal. Well about five minutes before the deadline the DJ is about $1000 short of whatever the figure is..so she calls Tate. Tate is clearly a little confused as to what is going on..after a few times of explaining the situation all Tate can understand is that this DJ he does not know wants a 1000 bucks for some charity to play his album. Well, Tate gives with the money.. and the rest is radio gold. Operation mind crime playing from start to finish over Boston airways..",
        "intTime": 20090318,
        "postID": 6,
        "quote": "",
        "reply": "Always loved Queensryche... Funny story: A local radio station does a charity every year where you can call in and donate money to hear any song you want..of course people want to hear some off the wall stuff, right. Well one of the DJ's is a queensryche fan and wants to play operation mindcrime..the entire album. The general manager comes up with some random dollar figure, I forget what it was..and adds a time limit..if the listeners dont pony up the money by a certain time...no deal. Well about five minutes before the deadline the DJ is about $1000 short of whatever the figure is..so she calls Tate. Tate is clearly a little confused as to what is going on..after a few times of explaining the situation all Tate can understand is that this DJ he does not know wants a 1000 bucks for some charity to play his album. Well, Tate gives with the money.. and the rest is radio gold. Operation mind crime playing from start to finish over Boston airways..",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 08:16:00",
        "title": "Thank a Soldier",
        "userID": "threerings"
    },
    {
        "content": "Thank you Geoff, you have always been a terrific singer/songwriter and an all around good guy. This doesn't surprise me at all that you'd have an album like this, though I thought it would have been much sooner. Keep up the good work brother and thank you for this article and the album.",
        "intTime": 20090318,
        "postID": 7,
        "quote": "",
        "reply": "Thank you Geoff, you have always been a terrific singer/songwriter and an all around good guy. This doesn't surprise me at all that you'd have an album like this, though I thought it would have been much sooner. Keep up the good work brother and thank you for this article and the album.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 08:59:00",
        "title": "Thank a Soldier",
        "userID": "LeatherNeck_99"
    },
    {
        "content": "Since I am not from this planet and have been observing organized warfare between humans since it began, I feel compelled to tell anyone in any army anywhere on Earth that you are constantly being lied to by your leaders, armies do not bring \"freedom\" to anyone but rather oppression, and that war has been obsolete as a form of socio-political engineering for thousands of years. Furthermore, military service is in no way, shape or form any more \"honorable\" than any other occupation. As a matter of fact, it is WORSE than any other occupation, because it requires otherwise well-meaning humans to sacrifice their god-given individuality and creativity for a cause that is ultimately useless and offers no benefit to mankind. I strongly advise all soldiers everywhere to immediately resign their posts and tell anyone who wishes to \"thank\" them for their service to please stop doing so. Find something else to do for a living that is fun, satisfying and creative, and which doesn't require you to potentially lose life or limb while taking part in what is essentially a series of large-scale bar fights. Until the people of Earth realize that violence is a counter-productive form of conflict resolution, you will continue to be trapped in the death/rebirth cycle, with no awareness of your true nature -- an immortal spiritual being with godlike powers aka \"soul\" that has no need for a physical container, much less the need to destroy the physical containers of other souls to achieve your ends. In closing, if my words offend anyone in the U.S. military, please remember that I am saying them because I care about you, and don't want you to waste your life serving those who couldn't care less about you or your families. And finally, remember that when you joined the military, you took an oath to defend the Constitution, whose first amendment guarantees freedom of speech for EVERYONE -- not just those with whom you agree. MAY ALL BE WELL",
        "intTime": 20090318,
        "postID": 8,
        "quote": "",
        "reply": "Since I am not from this planet and have been observing organized warfare between humans since it began, I feel compelled to tell anyone in any army anywhere on Earth that you are constantly being lied to by your leaders, armies do not bring \"freedom\" to anyone but rather oppression, and that war has been obsolete as a form of socio-political engineering for thousands of years. Furthermore, military service is in no way, shape or form any more \"honorable\" than any other occupation. As a matter of fact, it is WORSE than any other occupation, because it requires otherwise well-meaning humans to sacrifice their god-given individuality and creativity for a cause that is ultimately useless and offers no benefit to mankind. I strongly advise all soldiers everywhere to immediately resign their posts and tell anyone who wishes to \"thank\" them for their service to please stop doing so. Find something else to do for a living that is fun, satisfying and creative, and which doesn't require you to potentially lose life or limb while taking part in what is essentially a series of large-scale bar fights. Until the people of Earth realize that violence is a counter-productive form of conflict resolution, you will continue to be trapped in the death/rebirth cycle, with no awareness of your true nature -- an immortal spiritual being with godlike powers aka \"soul\" that has no need for a physical container, much less the need to destroy the physical containers of other souls to achieve your ends. In closing, if my words offend anyone in the U.S. military, please remember that I am saying them because I care about you, and don't want you to waste your life serving those who couldn't care less about you or your families. And finally, remember that when you joined the military, you took an oath to defend the Constitution, whose first amendment guarantees freedom of speech for EVERYONE -- not just those with whom you agree. MAY ALL BE WELL",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 12:22:00",
        "title": "Thank a Soldier",
        "userID": "AMBASSADORIKU"
    },
    {
        "content": "Like others I thought this was a nice op-ed however a few lines caught my eye. This is one worth mentioning. \"Our military men and women make sacrifices, and I for one never stopped to realize just how enormous these sacrifices are. I took it all for granted.\" This whole country takes for granted the service of others. Too many think those \"who have served\" are either stupid or couldn't get a job. As many of us Vets have stated before the problem with our do nothing or anti military Reps in congress is because they do not have military experience. That experience would allow them to better understand the military or understand our position in the world structure. This is not to say that \"non-servers\" are dumb but without that experience they must ask others what the military is all about. Consider this for a moment. If the son of a WWII vet did not serve in any service from about 1960 thru 1980 was it because they tried not to or did not care enough about the US of A to serve? The same follows with the offspring of Vets of Korea, Nam etc. Did they think they were \"too good\" to serve or did not care? I don't know the reason but if more citizens of this great country \"signed on the dotted line and took the pledge\" maybe we would not have the hatred toward those who keep us free that is in congress and many state houses. My family served and sacrificed many. There were forty-eight (48) in WWII. The New Mexico National Guard, which included many members of our family, was activated (as was many other state's units) and sent to the Philippines. As a result we lost members there and on the Bataan Death March, Camp O'Donnell and other Japanese POW camps. We lost two on hell ships sunk by allied forces and have six MIA's in the Pacific and one in the ETO. My own Father was in the ETO and survived. In addition I have too many (9) cousins on the Nam wall. As our family’s genealogist I have researched our military involvement since our arrival in this great land in 1598 with the Conquistadors. The family has and will continue to do our part. I am glad this rock and roller has seen the light but if he had served he could have spoken to his father as one Vet to another. I know my brother and I did with our father. My son has passed but I look forward to having the same conversation with my grandchildren, God willing.",
        "intTime": 20090318,
        "postID": 9,
        "quote": "",
        "reply": "Like others I thought this was a nice op-ed however a few lines caught my eye. This is one worth mentioning. \"Our military men and women make sacrifices, and I for one never stopped to realize just how enormous these sacrifices are. I took it all for granted.\" This whole country takes for granted the service of others. Too many think those \"who have served\" are either stupid or couldn't get a job. As many of us Vets have stated before the problem with our do nothing or anti military Reps in congress is because they do not have military experience. That experience would allow them to better understand the military or understand our position in the world structure. This is not to say that \"non-servers\" are dumb but without that experience they must ask others what the military is all about. Consider this for a moment. If the son of a WWII vet did not serve in any service from about 1960 thru 1980 was it because they tried not to or did not care enough about the US of A to serve? The same follows with the offspring of Vets of Korea, Nam etc. Did they think they were \"too good\" to serve or did not care? I don't know the reason but if more citizens of this great country \"signed on the dotted line and took the pledge\" maybe we would not have the hatred toward those who keep us free that is in congress and many state houses. My family served and sacrificed many. There were forty-eight (48) in WWII. The New Mexico National Guard, which included many members of our family, was activated (as was many other state's units) and sent to the Philippines. As a result we lost members there and on the Bataan Death March, Camp O'Donnell and other Japanese POW camps. We lost two on hell ships sunk by allied forces and have six MIA's in the Pacific and one in the ETO. My own Father was in the ETO and survived. In addition I have too many (9) cousins on the Nam wall. As our family’s genealogist I have researched our military involvement since our arrival in this great land in 1598 with the Conquistadors. The family has and will continue to do our part. I am glad this rock and roller has seen the light but if he had served he could have spoken to his father as one Vet to another. I know my brother and I did with our father. My son has passed but I look forward to having the same conversation with my grandchildren, God willing.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 12:56:00",
        "title": "Thank a Soldier",
        "userID": "maluka"
    },
    {
        "content": "quote: Originally posted by AMBASSADORIKU: Since I am not from this planet and have been observing organized warfare between humans since it began, I feel compelled to tell anyone in any army anywhere on Earth that you are constantly being lied to by your leaders, armies do not bring \"freedom\" to anyone but rather oppression, and that war has been obsolete as a form of socio-political engineering for thousands of years. Furthermore, military service is in no way, shape or form any more \"honorable\" than any other occupation. As a matter of fact, it is WORSE than any other occupation, because it requires otherwise well-meaning humans to sacrifice their god-given individuality and creativity for a cause that is ultimately useless and offers no benefit to mankind. I strongly advise all soldiers everywhere to immediately resign their posts and tell anyone who wishes to \"thank\" them for their service to please stop doing so. Find something else to do for a living that is fun, satisfying and creative, and which doesn't require you to potentially lose life or limb while taking part in what is essentially a series of large-scale bar fights. Until the people of Earth realize that violence is a counter-productive form of conflict resolution, you will continue to be trapped in the death/rebirth cycle, with no awareness of your true nature -- an immortal spiritual being with godlike powers aka \"soul\" that has no need for a physical container, much less the need to destroy the physical containers of other souls to achieve your ends. In closing, if my words offend anyone in the U.S. military, please remember that I am saying them because I care about you, and don't want you to waste your life serving those who couldn't care less about you or your families. And finally, remember that when you joined the military, you took an oath to defend the Constitution, whose first amendment guarantees freedom of speech for EVERYONE -- not just those with whom you agree. MAY ALL BE WELL Hey!!! Mr This Member, post number one...........take a long walk off a short pier. Who the hell gave you the freedom to say those words? Any feckin clue?",
        "intTime": 20090318,
        "postID": 10,
        "quote": "Originally posted by AMBASSADORIKU: Since I am not from this planet and have been observing organized warfare between humans since it began, I feel compelled to tell anyone in any army anywhere on Earth that you are constantly being lied to by your leaders, armies do not bring \"freedom\" to anyone but rather oppression, and that war has been obsolete as a form of socio-political engineering for thousands of years. Furthermore, military service is in no way, shape or form any more \"honorable\" than any other occupation. As a matter of fact, it is WORSE than any other occupation, because it requires otherwise well-meaning humans to sacrifice their god-given individuality and creativity for a cause that is ultimately useless and offers no benefit to mankind. I strongly advise all soldiers everywhere to immediately resign their posts and tell anyone who wishes to \"thank\" them for their service to please stop doing so. Find something else to do for a living that is fun, satisfying and creative, and which doesn't require you to potentially lose life or limb while taking part in what is essentially a series of large-scale bar fights. Until the people of Earth realize that violence is a counter-productive form of conflict resolution, you will continue to be trapped in the death/rebirth cycle, with no awareness of your true nature -- an immortal spiritual being with godlike powers aka \"soul\" that has no need for a physical container, much less the need to destroy the physical containers of other souls to achieve your ends. In closing, if my words offend anyone in the U.S. military, please remember that I am saying them because I care about you, and don't want you to waste your life serving those who couldn't care less about you or your families. And finally, remember that when you joined the military, you took an oath to defend the Constitution, whose first amendment guarantees freedom of speech for EVERYONE -- not just those with whom you agree. MAY ALL BE WELL",
        "reply": " Hey!!! Mr This Member, post number one...........take a long walk off a short pier. Who the hell gave you the freedom to say those words? Any feckin clue?",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 13:03:00",
        "title": "Thank a Soldier",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "quote: Originally posted by Since I am not from this planet and have been observing organized warfare between humans since it began, I feel compelled to tell anyone in any army anywhere on Earth that you are constantly being lied to by your leaders, armies do not bring \"freedom\" to anyone but rather oppression, and that war has been obsolete as a form of socio-political engineering for thousands of years. Furthermore, military service is in no way, shape or form any more \"honorable\" than any other occupation. As a matter of fact, it is WORSE than any other occupation, because it requires otherwise well-meaning humans to sacrifice their god-given individuality and creativity for a cause that is ultimately useless and offers no benefit to mankind. I strongly advise all soldiers everywhere to immediately resign their posts and tell anyone who wishes to \"thank\" them for their service to please stop doing so. Find something else to do for a living that is fun, satisfying and creative, and which doesn't require you to potentially lose life or limb while taking part in what is essentially a series of large-scale bar fights. Until the people of Earth realize that violence is a counter-productive form of conflict resolution, you will continue to be trapped in the death/rebirth cycle, with no awareness of your true nature -- an immortal spiritual being with godlike powers aka \"soul\" that has no need for a physical container, much less the need to destroy the physical containers of other souls to achieve your ends. In closing, if my words offend anyone in the U.S. military, please remember that I am saying them because I care about you, and don't want you to waste your life serving those who couldn't care less about you or your families. And finally, remember that when you joined the military, you took an oath to defend the Constitution, whose first amendment guarantees freedom of speech for EVERYONE -- not just those with whom you agree. MAY ALL BE WELL My answer to the pathetic little twerp piehole called: \"AMBASSADORIKU\" / / / / / / A picture is worth TEN Thousand words...Fool!",
        "intTime": 20090318,
        "postID": 11,
        "quote": "Originally posted by Since I am not from this planet and have been observing organized warfare between humans since it began, I feel compelled to tell anyone in any army anywhere on Earth that you are constantly being lied to by your leaders, armies do not bring \"freedom\" to anyone but rather oppression, and that war has been obsolete as a form of socio-political engineering for thousands of years. Furthermore, military service is in no way, shape or form any more \"honorable\" than any other occupation. As a matter of fact, it is WORSE than any other occupation, because it requires otherwise well-meaning humans to sacrifice their god-given individuality and creativity for a cause that is ultimately useless and offers no benefit to mankind. I strongly advise all soldiers everywhere to immediately resign their posts and tell anyone who wishes to \"thank\" them for their service to please stop doing so. Find something else to do for a living that is fun, satisfying and creative, and which doesn't require you to potentially lose life or limb while taking part in what is essentially a series of large-scale bar fights. Until the people of Earth realize that violence is a counter-productive form of conflict resolution, you will continue to be trapped in the death/rebirth cycle, with no awareness of your true nature -- an immortal spiritual being with godlike powers aka \"soul\" that has no need for a physical container, much less the need to destroy the physical containers of other souls to achieve your ends. In closing, if my words offend anyone in the U.S. military, please remember that I am saying them because I care about you, and don't want you to waste your life serving those who couldn't care less about you or your families. And finally, remember that when you joined the military, you took an oath to defend the Constitution, whose first amendment guarantees freedom of speech for EVERYONE -- not just those with whom you agree. MAY ALL BE WELL",
        "reply": " My answer to the pathetic little twerp piehole called: \"AMBASSADORIKU\" / / / / / / A picture is worth TEN Thousand words...Fool!",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 13:33:00",
        "title": "Thank a Soldier",
        "userID": "SSGDuke53"
    },
    {
        "content": "It still truly amazes me the total ignorance of posters that came on mil.com and slam the Military with one hand, and with the other hand, state: “And finally, remember that when you joined the military, you took an oath to defend the Constitution, whose first amendment guarantees freedom of speech for EVERYONE -- not just those with whom you agree.” Hey…dud/e just go away… bag…. Break glass…in case of Emergency! Or, just wait till I get to the bottom of the bottle!",
        "intTime": 20090318,
        "postID": 12,
        "quote": "",
        "reply": "It still truly amazes me the total ignorance of posters that came on mil.com and slam the Military with one hand, and with the other hand, state: “And finally, remember that when you joined the military, you took an oath to defend the Constitution, whose first amendment guarantees freedom of speech for EVERYONE -- not just those with whom you agree.” Hey…dud/e just go away… bag…. Break glass…in case of Emergency! Or, just wait till I get to the bottom of the bottle!",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 14:05:00",
        "title": "Thank a Soldier",
        "userID": "ReaperDoc"
    },
    {
        "content": "While I think AMBASSADORIKU is a certifiable Wing Nut, I also think the obviously huge chip on the shoulders of some of the respondents to his comments almost prove his point (the few sane ones, anyway). Look, despite what we’re always told, every military action is not about securing my right to free speech. If it were I wouldn’t have free speech today. Say what you will, but clearly we lost the Vietnam War. We were told again and again and again that if South Vietnam fell we would soon be taken over by the communists and lose all of our rights. Still, almost 35 years ago we left Vietnam and “Uncle Ho” and the North took over the South and Vietnam went entirely communist. And yet today Vietnam is a major trading partner of the U.S. and I still have free speech. Were our men and women fighting for my right to “free speech” in Vietnam? They may have believed they were, but clearly history proves that what they were actually fighting for were political policies that had little or nothing to do with my rights. Hence, when we abandoned Vietnam, my rights didn’t change one bit. There are many of us who believe that the Iraq War is a lot closer to the Vietnam War scenario then we’d like. Therefore, it’s difficult to just accept that 1,000s upon 1,000s of innocent Iraqis and several 1000 American troops are dying for our rights. Many believe that regardless of how the Iraq War goes, our rights will remain intact and we wonder how many will have to die before this is proven out. I appreciate that our soldiers can’t go around picking and choosing which are righteous causes and when they are being used as pawns in some political game so maybe always believing the cause is righteous is necessary to do the job. But, don’t for a second allow yourself to believe that those who question what you’ve been asked to do are somehow your enemies. This isn’t ancient Rome, the President isn’t Caesar, and mine is to “reason why.”",
        "intTime": 20090318,
        "postID": 13,
        "quote": "",
        "reply": "While I think AMBASSADORIKU is a certifiable Wing Nut, I also think the obviously huge chip on the shoulders of some of the respondents to his comments almost prove his point (the few sane ones, anyway). Look, despite what we’re always told, every military action is not about securing my right to free speech. If it were I wouldn’t have free speech today. Say what you will, but clearly we lost the Vietnam War. We were told again and again and again that if South Vietnam fell we would soon be taken over by the communists and lose all of our rights. Still, almost 35 years ago we left Vietnam and “Uncle Ho” and the North took over the South and Vietnam went entirely communist. And yet today Vietnam is a major trading partner of the U.S. and I still have free speech. Were our men and women fighting for my right to “free speech” in Vietnam? They may have believed they were, but clearly history proves that what they were actually fighting for were political policies that had little or nothing to do with my rights. Hence, when we abandoned Vietnam, my rights didn’t change one bit. There are many of us who believe that the Iraq War is a lot closer to the Vietnam War scenario then we’d like. Therefore, it’s difficult to just accept that 1,000s upon 1,000s of innocent Iraqis and several 1000 American troops are dying for our rights. Many believe that regardless of how the Iraq War goes, our rights will remain intact and we wonder how many will have to die before this is proven out. I appreciate that our soldiers can’t go around picking and choosing which are righteous causes and when they are being used as pawns in some political game so maybe always believing the cause is righteous is necessary to do the job. But, don’t for a second allow yourself to believe that those who question what you’ve been asked to do are somehow your enemies. This isn’t ancient Rome, the President isn’t Caesar, and mine is to “reason why.”",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 16:02:00",
        "title": "Thank a Soldier",
        "userID": "DAWN2DUSK999"
    },
    {
        "content": "Geoff Tate :Salute: \"I support our troops!\" A simple, everyday statement. The differnce is, he actaully thought about it and then to the next step to really understand it, which meant understanding \"the troops\". I have not listened to this groups music in the past, but I think I am going to have to listen to them now, because he took the time to try and understand what I did with almost 34 years of my life, actually 36 when you include the ROTC time.",
        "intTime": 20090318,
        "postID": 14,
        "quote": "",
        "reply": "Geoff Tate :Salute: \"I support our troops!\" A simple, everyday statement. The differnce is, he actaully thought about it and then to the next step to really understand it, which meant understanding \"the troops\". I have not listened to this groups music in the past, but I think I am going to have to listen to them now, because he took the time to try and understand what I did with almost 34 years of my life, actually 36 when you include the ROTC time.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 16:13:00",
        "title": "Thank a Soldier",
        "userID": "oseles"
    },
    {
        "content": "quote: Originally posted by AMBASSADORIKU: Since I am not from this planet I would have to agree that to a lot of people La-La-Land can't be from this planet. As for your attitude - you are a joke.",
        "intTime": 20090318,
        "postID": 15,
        "quote": "Originally posted by AMBASSADORIKU: Since I am not from this planet",
        "reply": " I would have to agree that to a lot of people La-La-Land can't be from this planet. As for your attitude - you are a joke.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 16:18:00",
        "title": "Thank a Soldier",
        "userID": "oseles"
    },
    {
        "content": "It's awesome to hear a rocker support our troops. It's sad that the likes of Eddie Vedder, Springsteen, Stype, and a host of others drag politics and slamming President Bush into the war because all it does is bring our soldiers down when their CinC is constantly attacked. These people (I forgot the Dixie Chicks) are classless. What really saddened me was watching the debacle at the Republican Convention in St. Paul last September. I went down on more than one occasion and witnessed some of these individuals enjoying their freedom at the same time as denigrating the troops and war effort. I just wish that more people had the class of Mr. Tate and would speak up rather than worry about any impact on their careers.",
        "intTime": 20090319,
        "postID": 16,
        "quote": "",
        "reply": "It's awesome to hear a rocker support our troops. It's sad that the likes of Eddie Vedder, Springsteen, Stype, and a host of others drag politics and slamming President Bush into the war because all it does is bring our soldiers down when their CinC is constantly attacked. These people (I forgot the Dixie Chicks) are classless. What really saddened me was watching the debacle at the Republican Convention in St. Paul last September. I went down on more than one occasion and witnessed some of these individuals enjoying their freedom at the same time as denigrating the troops and war effort. I just wish that more people had the class of Mr. Tate and would speak up rather than worry about any impact on their careers.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-19 23:58:00",
        "title": "Thank a Soldier",
        "userID": "14184094"
    },
    {
        "content": "quote: Originally posted by oseles: quote: Originally posted by AMBASSADORIKU: Since I am not from this planet I would have to agree that to a lot of people La-La-Land can't be from this planet. As for your attitude - you are a joke. I hope everybody who has the occasion to LaLa, if they wish, hit the Mall, grab a bite, or just take a dump in peace, will think about, and thank, the noble guys and gals who claim the credit for making it all possible. There are a bunch of guys and gals in Washington, Hollywood and on Madidson Avenue who might make a run for that money, too. It's all about buying and selling dreams, ain't it? Then again, that's one of those 'fruits of victory', too.",
        "intTime": 20090320,
        "postID": 17,
        "quote": "Originally posted by oseles: quote: Originally posted by AMBASSADORIKU: Since I am not from this planet I would have to agree that to a lot of people La-La-Land can't be from this planet. As for your attitude - you are a joke.",
        "reply": " I hope everybody who has the occasion to LaLa, if they wish, hit the Mall, grab a bite, or just take a dump in peace, will think about, and thank, the noble guys and gals who claim the credit for making it all possible. There are a bunch of guys and gals in Washington, Hollywood and on Madidson Avenue who might make a run for that money, too. It's all about buying and selling dreams, ain't it? Then again, that's one of those 'fruits of victory', too.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-20 05:13:00",
        "title": "Thank a Soldier",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by DAWN2DUSK999: While I think AMBASSADORIKU is a certifiable Wing Nut, I also think the obviously huge chip on the shoulders of some of the respondents to his comments almost prove his point (the few sane ones, anyway). Look, despite what we’re always told, every military action is not about securing my right to free speech. If it were I wouldn’t have free speech today. Say what you will, but clearly we lost the Vietnam War. We were told again and again and again that if South Vietnam fell we would soon be taken over by the communists and lose all of our rights. Still, almost 35 years ago we left Vietnam and “Uncle Ho” and the North took over the South and Vietnam went entirely communist. And yet today Vietnam is a major trading partner of the U.S. and I still have free speech. Were our men and women fighting for my right to “free speech” in Vietnam? They may have believed they were, but clearly history proves that what they were actually fighting for were political policies that had little or nothing to do with my rights. Hence, when we abandoned Vietnam, my rights didn’t change one bit. There are many of us who believe that the Iraq War is a lot closer to the Vietnam War scenario then we’d like. Therefore, it’s difficult to just accept that 1,000s upon 1,000s of innocent Iraqis and several 1000 American troops are dying for our rights. Many believe that regardless of how the Iraq War goes, our rights will remain intact and we wonder how many will have to die before this is proven out. I appreciate that our soldiers can’t go around picking and choosing which are righteous causes and when they are being used as pawns in some political game so maybe always believing the cause is righteous is necessary to do the job. But, don’t for a second allow yourself to believe that those who question what you’ve been asked to do are somehow your enemies. This isn’t ancient Rome, the President isn’t Caesar, and mine is to “reason why.” So, who told you that we went into Iraq to secure our right to free speech? I have never been told that nor have I even thought it. I was under the impression that we went into Iraq to secure our right to live. When people state that we (the Soldier, Sailor, Airman, and Marine) fight for our freedoms, they include much more than the freedom of speech. Now, I don't want to get the left wing loonies started with their \"Bush lied\" BS (which is exactly what it is - total BS), but we went into Iraq to secure us against the threat of future attacks. You can argue whether that was right or wrong, and I suspect people will be arguing that for generations to come. The point is, at the time we invaded Iraq, there was substantial intelligence to suggest they were a credible, serious, and imminent threat against us. Much of that intelligence has not panned out but it was credible enough at the time to garner overwhelming support. Again, the Iraq war will be used extensively in the debate on whether or not we should conduct pre-emptive attacks, but at the time most thought it necessary. In addition, Iraq was constantly violating a treaty from a previous war, the Gulf War, which, IMO, was justification in itself to remove the regime. Amazingly enough, the Gulf War was also not about free speech. The Gulf War was about freeing a country that was hostilely taken over by Iraq. No one ever suggested that war had anything to do with our freedoms. It had to do with protecting the little guy (of course, we also had significant oil interests in the region). Come to think about it, did anyone ever claim that WWI or WWII were about free speech? Maybe indirectly because if we were taken over by a ruthless dictator, we would certainly lose our free speech, but I think we would have lost many more freedoms than that. You will hear many on this board state that the sacrifices of the military is one of the main reasons why we all have the freedom of speech to say some of the hateful things that people say, but we provide much more than that. We fight to protect all our freedoms the most basic of which are the right to LIFE, liberty and the pursuit of happiness. SCOUTS OUT!",
        "intTime": 20090320,
        "postID": 18,
        "quote": "Originally posted by DAWN2DUSK999: While I think AMBASSADORIKU is a certifiable Wing Nut, I also think the obviously huge chip on the shoulders of some of the respondents to his comments almost prove his point (the few sane ones, anyway). Look, despite what we’re always told, every military action is not about securing my right to free speech. If it were I wouldn’t have free speech today. Say what you will, but clearly we lost the Vietnam War. We were told again and again and again that if South Vietnam fell we would soon be taken over by the communists and lose all of our rights. Still, almost 35 years ago we left Vietnam and “Uncle Ho” and the North took over the South and Vietnam went entirely communist. And yet today Vietnam is a major trading partner of the U.S. and I still have free speech. Were our men and women fighting for my right to “free speech” in Vietnam? They may have believed they were, but clearly history proves that what they were actually fighting for were political policies that had little or nothing to do with my rights. Hence, when we abandoned Vietnam, my rights didn’t change one bit. There are many of us who believe that the Iraq War is a lot closer to the Vietnam War scenario then we’d like. Therefore, it’s difficult to just accept that 1,000s upon 1,000s of innocent Iraqis and several 1000 American troops are dying for our rights. Many believe that regardless of how the Iraq War goes, our rights will remain intact and we wonder how many will have to die before this is proven out. I appreciate that our soldiers can’t go around picking and choosing which are righteous causes and when they are being used as pawns in some political game so maybe always believing the cause is righteous is necessary to do the job. But, don’t for a second allow yourself to believe that those who question what you’ve been asked to do are somehow your enemies. This isn’t ancient Rome, the President isn’t Caesar, and mine is to “reason why.”",
        "reply": " So, who told you that we went into Iraq to secure our right to free speech? I have never been told that nor have I even thought it. I was under the impression that we went into Iraq to secure our right to live. When people state that we (the Soldier, Sailor, Airman, and Marine) fight for our freedoms, they include much more than the freedom of speech. Now, I don't want to get the left wing loonies started with their \"Bush lied\" BS (which is exactly what it is - total BS), but we went into Iraq to secure us against the threat of future attacks. You can argue whether that was right or wrong, and I suspect people will be arguing that for generations to come. The point is, at the time we invaded Iraq, there was substantial intelligence to suggest they were a credible, serious, and imminent threat against us. Much of that intelligence has not panned out but it was credible enough at the time to garner overwhelming support. Again, the Iraq war will be used extensively in the debate on whether or not we should conduct pre-emptive attacks, but at the time most thought it necessary. In addition, Iraq was constantly violating a treaty from a previous war, the Gulf War, which, IMO, was justification in itself to remove the regime. Amazingly enough, the Gulf War was also not about free speech. The Gulf War was about freeing a country that was hostilely taken over by Iraq. No one ever suggested that war had anything to do with our freedoms. It had to do with protecting the little guy (of course, we also had significant oil interests in the region). Come to think about it, did anyone ever claim that WWI or WWII were about free speech? Maybe indirectly because if we were taken over by a ruthless dictator, we would certainly lose our free speech, but I think we would have lost many more freedoms than that. You will hear many on this board state that the sacrifices of the military is one of the main reasons why we all have the freedom of speech to say some of the hateful things that people say, but we provide much more than that. We fight to protect all our freedoms the most basic of which are the right to LIFE, liberty and the pursuit of happiness. SCOUTS OUT!",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-20 06:24:00",
        "title": "Thank a Soldier",
        "userID": "RCcav"
    },
    {
        "content": "My dad is still with us 87 yrs 88 in July and is in good health considering. He served on Sebu Island in the Phillipeans guarding Army Corps doing roads when they has to go after a Jap sniper. He was there when the bombs were dropped on Japan and was aboard a troop transport in Tokyo Bay when the surrender was signed. He described how the city was so devastated from the bombing (conventional) and while on the mainland Japan that the woman and children didn't come out initially because they were told they would be raped by the Americans. He also stated that the war so ravaged the country that Jap women would line up outside of the GI chow tent with empty tins looking for leftover scraps as the GIs got done with their chow and he saw A US soldier just kick an old woman to the ground with his boot.....\"I felt bad for her but had no idea why he did that\" said my dad but \"that was war\". Several of my uncles were in the Army. I have 2 brothers that served along with a couple of my brothers in law. WW-II, The Berlin Wall, Korea, Vietnam. Me....I didn't serve in combat but I voluteered but my roomate and several friends went. But I did give 10 yrs of my life 1984-94. That doesn't matter. My dad still naggs me if I drink too much and I remind him to take his meds. We love each other all the same and talk as long as we can. God Bless my Dad, my Uncles, My brothers, My Brothers in Law, and all of my friends over those years. Most importantly...God bless the families. Especially my mom and sisters who sent all the care packages to me and all my friends who were so lonely for home.",
        "intTime": 20090320,
        "postID": 19,
        "quote": "",
        "reply": "My dad is still with us 87 yrs 88 in July and is in good health considering. He served on Sebu Island in the Phillipeans guarding Army Corps doing roads when they has to go after a Jap sniper. He was there when the bombs were dropped on Japan and was aboard a troop transport in Tokyo Bay when the surrender was signed. He described how the city was so devastated from the bombing (conventional) and while on the mainland Japan that the woman and children didn't come out initially because they were told they would be raped by the Americans. He also stated that the war so ravaged the country that Jap women would line up outside of the GI chow tent with empty tins looking for leftover scraps as the GIs got done with their chow and he saw A US soldier just kick an old woman to the ground with his boot.....\"I felt bad for her but had no idea why he did that\" said my dad but \"that was war\". Several of my uncles were in the Army. I have 2 brothers that served along with a couple of my brothers in law. WW-II, The Berlin Wall, Korea, Vietnam. Me....I didn't serve in combat but I voluteered but my roomate and several friends went. But I did give 10 yrs of my life 1984-94. That doesn't matter. My dad still naggs me if I drink too much and I remind him to take his meds. We love each other all the same and talk as long as we can. God Bless my Dad, my Uncles, My brothers, My Brothers in Law, and all of my friends over those years. Most importantly...God bless the families. Especially my mom and sisters who sent all the care packages to me and all my friends who were so lonely for home.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-20 16:59:00",
        "title": "Thank a Soldier",
        "userID": "CarlofCasselberry"
    },
    {
        "content": "Beware, people of Earth!!! AMBASSADORIKU lies......he is really a clingon from Uranus!!! A \"Z class\" advanced dingleberry. (Are we havin' fun yet?) They are a war loving race that soften up a planet's defences with lies!!! BEWAAARRRE!!!",
        "intTime": 20090320,
        "postID": 20,
        "quote": "",
        "reply": "Beware, people of Earth!!! AMBASSADORIKU lies......he is really a clingon from Uranus!!! A \"Z class\" advanced dingleberry. (Are we havin' fun yet?) They are a war loving race that soften up a planet's defences with lies!!! BEWAAARRRE!!!",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-20 22:18:00",
        "title": "Thank a Soldier",
        "userID": "WolfMurman"
    },
    {
        "content": "RE: http://www.military.com/opinion/0,15202,187049,00.html Good on him. I have always liked their music, now even moreso",
        "intTime": 20090317,
        "postID": 21,
        "quote": "",
        "reply": "RE: http://www.military.com/opinion/0,15202,187049,00.html Good on him. I have always liked their music, now even moreso",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-17 19:20:00",
        "title": "Thank a Soldier",
        "userID": "billdawg24"
    },
    {
        "content": "We have and do talk to the veterans we know, they are a wealth of perspective and inspiration. I am curious to hear the album. I am a longtime fan of queensryche and can relate to this subject very much of recent time. My wife is a newly commissioned Ensign and through out the last year have come to realize a lot of the same things Geoff mentioned in his column. We have turned into a patriotic family. You become perceived in a certain way when you are. I am very proud of her and it's been interesting and eye opening as to what others feel about the military. She is a child of divorce and it's been very weird seeing the way each side has reacted. Our biggest regret is that her Grand father had passed prior to the decision to join. He was a highly decorated veteran (a flying tiger) and regrettably wouldn't talk about it with us when he was still living. I have found it that a lot of families don't speak of their time in the service. I am curious if Geoff has heard stories that family members haven't. For example he has waited this long to speak to his own father.",
        "intTime": 20090317,
        "postID": 22,
        "quote": "",
        "reply": "We have and do talk to the veterans we know, they are a wealth of perspective and inspiration. I am curious to hear the album. I am a longtime fan of queensryche and can relate to this subject very much of recent time. My wife is a newly commissioned Ensign and through out the last year have come to realize a lot of the same things Geoff mentioned in his column. We have turned into a patriotic family. You become perceived in a certain way when you are. I am very proud of her and it's been interesting and eye opening as to what others feel about the military. She is a child of divorce and it's been very weird seeing the way each side has reacted. Our biggest regret is that her Grand father had passed prior to the decision to join. He was a highly decorated veteran (a flying tiger) and regrettably wouldn't talk about it with us when he was still living. I have found it that a lot of families don't speak of their time in the service. I am curious if Geoff has heard stories that family members haven't. For example he has waited this long to speak to his own father.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-17 22:40:00",
        "title": "Thank a Soldier",
        "userID": "obsidian05"
    },
    {
        "content": "Hats off to Geoff Tate for interviewing his father on video about his wartime experiences. In fact, a video interview posted on the internet is how I found a living WWII soldier back in January. I have since established a dialog with his grand-nephew to let him know I honor his bravery. A year ago, I knew nothing really of the sacrifices of a soldier. Then, in April, I found a trunk full of letters in my great aunt's garage (over 400). These were written to and from her husband who was a 1st Lt. in the 551st Parachute Infantry Battalion and who died in the Battle of the Bulge in 1945. I try to imagine myself sleep starved and hungry, jumping out of airplanes with explosives and marching head-on into machine guns in the frozen forest. My great uncle did all of this and somehow remained a hopeless romantic, describing in great detail the home they would one day share overlooking the bay. How lucky I am to have a home and share it with my husband! Reading the letters led to watching films on the subject, then reading books... searching the internet... and finding people who were actually there. I love how today's technology can help us learn stories untold, share pictures unseen. An aspiring writer, I am compelled to pen some of their story for future generations. I feel it is our responsibility to preserve the many facets of a given history. Nobody wants to glorify war, but I hope we all continue to glorify our freedoms and the remarkable courage of a soldier. Thanks Geoff. My husband and I will have to get the new album. We grew up on your songs. They are a shining part of our history. Jennifer Minshall",
        "intTime": 20090318,
        "postID": 23,
        "quote": "",
        "reply": "Hats off to Geoff Tate for interviewing his father on video about his wartime experiences. In fact, a video interview posted on the internet is how I found a living WWII soldier back in January. I have since established a dialog with his grand-nephew to let him know I honor his bravery. A year ago, I knew nothing really of the sacrifices of a soldier. Then, in April, I found a trunk full of letters in my great aunt's garage (over 400). These were written to and from her husband who was a 1st Lt. in the 551st Parachute Infantry Battalion and who died in the Battle of the Bulge in 1945. I try to imagine myself sleep starved and hungry, jumping out of airplanes with explosives and marching head-on into machine guns in the frozen forest. My great uncle did all of this and somehow remained a hopeless romantic, describing in great detail the home they would one day share overlooking the bay. How lucky I am to have a home and share it with my husband! Reading the letters led to watching films on the subject, then reading books... searching the internet... and finding people who were actually there. I love how today's technology can help us learn stories untold, share pictures unseen. An aspiring writer, I am compelled to pen some of their story for future generations. I feel it is our responsibility to preserve the many facets of a given history. Nobody wants to glorify war, but I hope we all continue to glorify our freedoms and the remarkable courage of a soldier. Thanks Geoff. My husband and I will have to get the new album. We grew up on your songs. They are a shining part of our history. Jennifer Minshall",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 04:18:00",
        "title": "Thank a Soldier",
        "userID": "20591640"
    },
    {
        "content": "Thanks to Geoff- I guess this is a problem of our own making- wanting to protect our families,my dad took years to talk about WWII- I had to let him in on my problems from GFI to get it started. War is not pretty & hard to explain- I have been remiss in not tlking to my son about either. It's uncomfortable to bare you're soul to someone who ahs never been there. But like our WWII vets, if we don't then the complacent will never realize the thin line between having and not having. Thanks Geoff for the wake up call.",
        "intTime": 20090318,
        "postID": 24,
        "quote": "",
        "reply": "Thanks to Geoff- I guess this is a problem of our own making- wanting to protect our families,my dad took years to talk about WWII- I had to let him in on my problems from GFI to get it started. War is not pretty & hard to explain- I have been remiss in not tlking to my son about either. It's uncomfortable to bare you're soul to someone who ahs never been there. But like our WWII vets, if we don't then the complacent will never realize the thin line between having and not having. Thanks Geoff for the wake up call.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 06:53:00",
        "title": "Thank a Soldier",
        "userID": "lovatscot"
    },
    {
        "content": "When i was flipping through the pages on the military.com home page, i saw a picture that had been a face that i have met in person before. I asked myself \"Could this be Geoff Tate? On military.com?\" Sure enough, it had been one of my favorite singers. It was quite moving to read the article that he had written. Some times, people that are sucessful in this world are, indeed, losing sight of the fact that their fame and their fortune would not be possible without our military men and women risking, and at times even losing their lives. I am glad to read that some one who is leading a life that is a dream to most, and is also some one that i look up to, reconizes that he is only free because of many brave men and women.",
        "intTime": 20090318,
        "postID": 25,
        "quote": "",
        "reply": "When i was flipping through the pages on the military.com home page, i saw a picture that had been a face that i have met in person before. I asked myself \"Could this be Geoff Tate? On military.com?\" Sure enough, it had been one of my favorite singers. It was quite moving to read the article that he had written. Some times, people that are sucessful in this world are, indeed, losing sight of the fact that their fame and their fortune would not be possible without our military men and women risking, and at times even losing their lives. I am glad to read that some one who is leading a life that is a dream to most, and is also some one that i look up to, reconizes that he is only free because of many brave men and women.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 07:15:00",
        "title": "Thank a Soldier",
        "userID": "AceShaw"
    },
    {
        "content": "Always loved Queensryche... Funny story: A local radio station does a charity every year where you can call in and donate money to hear any song you want..of course people want to hear some off the wall stuff, right. Well one of the DJ's is a queensryche fan and wants to play operation mindcrime..the entire album. The general manager comes up with some random dollar figure, I forget what it was..and adds a time limit..if the listeners dont pony up the money by a certain time...no deal. Well about five minutes before the deadline the DJ is about $1000 short of whatever the figure is..so she calls Tate. Tate is clearly a little confused as to what is going on..after a few times of explaining the situation all Tate can understand is that this DJ he does not know wants a 1000 bucks for some charity to play his album. Well, Tate gives with the money.. and the rest is radio gold. Operation mind crime playing from start to finish over Boston airways..",
        "intTime": 20090318,
        "postID": 26,
        "quote": "",
        "reply": "Always loved Queensryche... Funny story: A local radio station does a charity every year where you can call in and donate money to hear any song you want..of course people want to hear some off the wall stuff, right. Well one of the DJ's is a queensryche fan and wants to play operation mindcrime..the entire album. The general manager comes up with some random dollar figure, I forget what it was..and adds a time limit..if the listeners dont pony up the money by a certain time...no deal. Well about five minutes before the deadline the DJ is about $1000 short of whatever the figure is..so she calls Tate. Tate is clearly a little confused as to what is going on..after a few times of explaining the situation all Tate can understand is that this DJ he does not know wants a 1000 bucks for some charity to play his album. Well, Tate gives with the money.. and the rest is radio gold. Operation mind crime playing from start to finish over Boston airways..",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 08:16:00",
        "title": "Thank a Soldier",
        "userID": "threerings"
    },
    {
        "content": "Thank you Geoff, you have always been a terrific singer/songwriter and an all around good guy. This doesn't surprise me at all that you'd have an album like this, though I thought it would have been much sooner. Keep up the good work brother and thank you for this article and the album.",
        "intTime": 20090318,
        "postID": 27,
        "quote": "",
        "reply": "Thank you Geoff, you have always been a terrific singer/songwriter and an all around good guy. This doesn't surprise me at all that you'd have an album like this, though I thought it would have been much sooner. Keep up the good work brother and thank you for this article and the album.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 08:59:00",
        "title": "Thank a Soldier",
        "userID": "LeatherNeck_99"
    },
    {
        "content": "Since I am not from this planet and have been observing organized warfare between humans since it began, I feel compelled to tell anyone in any army anywhere on Earth that you are constantly being lied to by your leaders, armies do not bring \"freedom\" to anyone but rather oppression, and that war has been obsolete as a form of socio-political engineering for thousands of years. Furthermore, military service is in no way, shape or form any more \"honorable\" than any other occupation. As a matter of fact, it is WORSE than any other occupation, because it requires otherwise well-meaning humans to sacrifice their god-given individuality and creativity for a cause that is ultimately useless and offers no benefit to mankind. I strongly advise all soldiers everywhere to immediately resign their posts and tell anyone who wishes to \"thank\" them for their service to please stop doing so. Find something else to do for a living that is fun, satisfying and creative, and which doesn't require you to potentially lose life or limb while taking part in what is essentially a series of large-scale bar fights. Until the people of Earth realize that violence is a counter-productive form of conflict resolution, you will continue to be trapped in the death/rebirth cycle, with no awareness of your true nature -- an immortal spiritual being with godlike powers aka \"soul\" that has no need for a physical container, much less the need to destroy the physical containers of other souls to achieve your ends. In closing, if my words offend anyone in the U.S. military, please remember that I am saying them because I care about you, and don't want you to waste your life serving those who couldn't care less about you or your families. And finally, remember that when you joined the military, you took an oath to defend the Constitution, whose first amendment guarantees freedom of speech for EVERYONE -- not just those with whom you agree. MAY ALL BE WELL",
        "intTime": 20090318,
        "postID": 28,
        "quote": "",
        "reply": "Since I am not from this planet and have been observing organized warfare between humans since it began, I feel compelled to tell anyone in any army anywhere on Earth that you are constantly being lied to by your leaders, armies do not bring \"freedom\" to anyone but rather oppression, and that war has been obsolete as a form of socio-political engineering for thousands of years. Furthermore, military service is in no way, shape or form any more \"honorable\" than any other occupation. As a matter of fact, it is WORSE than any other occupation, because it requires otherwise well-meaning humans to sacrifice their god-given individuality and creativity for a cause that is ultimately useless and offers no benefit to mankind. I strongly advise all soldiers everywhere to immediately resign their posts and tell anyone who wishes to \"thank\" them for their service to please stop doing so. Find something else to do for a living that is fun, satisfying and creative, and which doesn't require you to potentially lose life or limb while taking part in what is essentially a series of large-scale bar fights. Until the people of Earth realize that violence is a counter-productive form of conflict resolution, you will continue to be trapped in the death/rebirth cycle, with no awareness of your true nature -- an immortal spiritual being with godlike powers aka \"soul\" that has no need for a physical container, much less the need to destroy the physical containers of other souls to achieve your ends. In closing, if my words offend anyone in the U.S. military, please remember that I am saying them because I care about you, and don't want you to waste your life serving those who couldn't care less about you or your families. And finally, remember that when you joined the military, you took an oath to defend the Constitution, whose first amendment guarantees freedom of speech for EVERYONE -- not just those with whom you agree. MAY ALL BE WELL",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 12:22:00",
        "title": "Thank a Soldier",
        "userID": "AMBASSADORIKU"
    },
    {
        "content": "Like others I thought this was a nice op-ed however a few lines caught my eye. This is one worth mentioning. \"Our military men and women make sacrifices, and I for one never stopped to realize just how enormous these sacrifices are. I took it all for granted.\" This whole country takes for granted the service of others. Too many think those \"who have served\" are either stupid or couldn't get a job. As many of us Vets have stated before the problem with our do nothing or anti military Reps in congress is because they do not have military experience. That experience would allow them to better understand the military or understand our position in the world structure. This is not to say that \"non-servers\" are dumb but without that experience they must ask others what the military is all about. Consider this for a moment. If the son of a WWII vet did not serve in any service from about 1960 thru 1980 was it because they tried not to or did not care enough about the US of A to serve? The same follows with the offspring of Vets of Korea, Nam etc. Did they think they were \"too good\" to serve or did not care? I don't know the reason but if more citizens of this great country \"signed on the dotted line and took the pledge\" maybe we would not have the hatred toward those who keep us free that is in congress and many state houses. My family served and sacrificed many. There were forty-eight (48) in WWII. The New Mexico National Guard, which included many members of our family, was activated (as was many other state's units) and sent to the Philippines. As a result we lost members there and on the Bataan Death March, Camp O'Donnell and other Japanese POW camps. We lost two on hell ships sunk by allied forces and have six MIA's in the Pacific and one in the ETO. My own Father was in the ETO and survived. In addition I have too many (9) cousins on the Nam wall. As our family’s genealogist I have researched our military involvement since our arrival in this great land in 1598 with the Conquistadors. The family has and will continue to do our part. I am glad this rock and roller has seen the light but if he had served he could have spoken to his father as one Vet to another. I know my brother and I did with our father. My son has passed but I look forward to having the same conversation with my grandchildren, God willing.",
        "intTime": 20090318,
        "postID": 29,
        "quote": "",
        "reply": "Like others I thought this was a nice op-ed however a few lines caught my eye. This is one worth mentioning. \"Our military men and women make sacrifices, and I for one never stopped to realize just how enormous these sacrifices are. I took it all for granted.\" This whole country takes for granted the service of others. Too many think those \"who have served\" are either stupid or couldn't get a job. As many of us Vets have stated before the problem with our do nothing or anti military Reps in congress is because they do not have military experience. That experience would allow them to better understand the military or understand our position in the world structure. This is not to say that \"non-servers\" are dumb but without that experience they must ask others what the military is all about. Consider this for a moment. If the son of a WWII vet did not serve in any service from about 1960 thru 1980 was it because they tried not to or did not care enough about the US of A to serve? The same follows with the offspring of Vets of Korea, Nam etc. Did they think they were \"too good\" to serve or did not care? I don't know the reason but if more citizens of this great country \"signed on the dotted line and took the pledge\" maybe we would not have the hatred toward those who keep us free that is in congress and many state houses. My family served and sacrificed many. There were forty-eight (48) in WWII. The New Mexico National Guard, which included many members of our family, was activated (as was many other state's units) and sent to the Philippines. As a result we lost members there and on the Bataan Death March, Camp O'Donnell and other Japanese POW camps. We lost two on hell ships sunk by allied forces and have six MIA's in the Pacific and one in the ETO. My own Father was in the ETO and survived. In addition I have too many (9) cousins on the Nam wall. As our family’s genealogist I have researched our military involvement since our arrival in this great land in 1598 with the Conquistadors. The family has and will continue to do our part. I am glad this rock and roller has seen the light but if he had served he could have spoken to his father as one Vet to another. I know my brother and I did with our father. My son has passed but I look forward to having the same conversation with my grandchildren, God willing.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 12:56:00",
        "title": "Thank a Soldier",
        "userID": "maluka"
    },
    {
        "content": "quote: Originally posted by AMBASSADORIKU: Since I am not from this planet and have been observing organized warfare between humans since it began, I feel compelled to tell anyone in any army anywhere on Earth that you are constantly being lied to by your leaders, armies do not bring \"freedom\" to anyone but rather oppression, and that war has been obsolete as a form of socio-political engineering for thousands of years. Furthermore, military service is in no way, shape or form any more \"honorable\" than any other occupation. As a matter of fact, it is WORSE than any other occupation, because it requires otherwise well-meaning humans to sacrifice their god-given individuality and creativity for a cause that is ultimately useless and offers no benefit to mankind. I strongly advise all soldiers everywhere to immediately resign their posts and tell anyone who wishes to \"thank\" them for their service to please stop doing so. Find something else to do for a living that is fun, satisfying and creative, and which doesn't require you to potentially lose life or limb while taking part in what is essentially a series of large-scale bar fights. Until the people of Earth realize that violence is a counter-productive form of conflict resolution, you will continue to be trapped in the death/rebirth cycle, with no awareness of your true nature -- an immortal spiritual being with godlike powers aka \"soul\" that has no need for a physical container, much less the need to destroy the physical containers of other souls to achieve your ends. In closing, if my words offend anyone in the U.S. military, please remember that I am saying them because I care about you, and don't want you to waste your life serving those who couldn't care less about you or your families. And finally, remember that when you joined the military, you took an oath to defend the Constitution, whose first amendment guarantees freedom of speech for EVERYONE -- not just those with whom you agree. MAY ALL BE WELL Hey!!! Mr This Member, post number one...........take a long walk off a short pier. Who the hell gave you the freedom to say those words? Any feckin clue?",
        "intTime": 20090318,
        "postID": 30,
        "quote": "Originally posted by AMBASSADORIKU: Since I am not from this planet and have been observing organized warfare between humans since it began, I feel compelled to tell anyone in any army anywhere on Earth that you are constantly being lied to by your leaders, armies do not bring \"freedom\" to anyone but rather oppression, and that war has been obsolete as a form of socio-political engineering for thousands of years. Furthermore, military service is in no way, shape or form any more \"honorable\" than any other occupation. As a matter of fact, it is WORSE than any other occupation, because it requires otherwise well-meaning humans to sacrifice their god-given individuality and creativity for a cause that is ultimately useless and offers no benefit to mankind. I strongly advise all soldiers everywhere to immediately resign their posts and tell anyone who wishes to \"thank\" them for their service to please stop doing so. Find something else to do for a living that is fun, satisfying and creative, and which doesn't require you to potentially lose life or limb while taking part in what is essentially a series of large-scale bar fights. Until the people of Earth realize that violence is a counter-productive form of conflict resolution, you will continue to be trapped in the death/rebirth cycle, with no awareness of your true nature -- an immortal spiritual being with godlike powers aka \"soul\" that has no need for a physical container, much less the need to destroy the physical containers of other souls to achieve your ends. In closing, if my words offend anyone in the U.S. military, please remember that I am saying them because I care about you, and don't want you to waste your life serving those who couldn't care less about you or your families. And finally, remember that when you joined the military, you took an oath to defend the Constitution, whose first amendment guarantees freedom of speech for EVERYONE -- not just those with whom you agree. MAY ALL BE WELL",
        "reply": " Hey!!! Mr This Member, post number one...........take a long walk off a short pier. Who the hell gave you the freedom to say those words? Any feckin clue?",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 13:03:00",
        "title": "Thank a Soldier",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "quote: Originally posted by Since I am not from this planet and have been observing organized warfare between humans since it began, I feel compelled to tell anyone in any army anywhere on Earth that you are constantly being lied to by your leaders, armies do not bring \"freedom\" to anyone but rather oppression, and that war has been obsolete as a form of socio-political engineering for thousands of years. Furthermore, military service is in no way, shape or form any more \"honorable\" than any other occupation. As a matter of fact, it is WORSE than any other occupation, because it requires otherwise well-meaning humans to sacrifice their god-given individuality and creativity for a cause that is ultimately useless and offers no benefit to mankind. I strongly advise all soldiers everywhere to immediately resign their posts and tell anyone who wishes to \"thank\" them for their service to please stop doing so. Find something else to do for a living that is fun, satisfying and creative, and which doesn't require you to potentially lose life or limb while taking part in what is essentially a series of large-scale bar fights. Until the people of Earth realize that violence is a counter-productive form of conflict resolution, you will continue to be trapped in the death/rebirth cycle, with no awareness of your true nature -- an immortal spiritual being with godlike powers aka \"soul\" that has no need for a physical container, much less the need to destroy the physical containers of other souls to achieve your ends. In closing, if my words offend anyone in the U.S. military, please remember that I am saying them because I care about you, and don't want you to waste your life serving those who couldn't care less about you or your families. And finally, remember that when you joined the military, you took an oath to defend the Constitution, whose first amendment guarantees freedom of speech for EVERYONE -- not just those with whom you agree. MAY ALL BE WELL My answer to the pathetic little twerp piehole called: \"AMBASSADORIKU\" / / / / / / A picture is worth TEN Thousand words...Fool!",
        "intTime": 20090318,
        "postID": 31,
        "quote": "Originally posted by Since I am not from this planet and have been observing organized warfare between humans since it began, I feel compelled to tell anyone in any army anywhere on Earth that you are constantly being lied to by your leaders, armies do not bring \"freedom\" to anyone but rather oppression, and that war has been obsolete as a form of socio-political engineering for thousands of years. Furthermore, military service is in no way, shape or form any more \"honorable\" than any other occupation. As a matter of fact, it is WORSE than any other occupation, because it requires otherwise well-meaning humans to sacrifice their god-given individuality and creativity for a cause that is ultimately useless and offers no benefit to mankind. I strongly advise all soldiers everywhere to immediately resign their posts and tell anyone who wishes to \"thank\" them for their service to please stop doing so. Find something else to do for a living that is fun, satisfying and creative, and which doesn't require you to potentially lose life or limb while taking part in what is essentially a series of large-scale bar fights. Until the people of Earth realize that violence is a counter-productive form of conflict resolution, you will continue to be trapped in the death/rebirth cycle, with no awareness of your true nature -- an immortal spiritual being with godlike powers aka \"soul\" that has no need for a physical container, much less the need to destroy the physical containers of other souls to achieve your ends. In closing, if my words offend anyone in the U.S. military, please remember that I am saying them because I care about you, and don't want you to waste your life serving those who couldn't care less about you or your families. And finally, remember that when you joined the military, you took an oath to defend the Constitution, whose first amendment guarantees freedom of speech for EVERYONE -- not just those with whom you agree. MAY ALL BE WELL",
        "reply": " My answer to the pathetic little twerp piehole called: \"AMBASSADORIKU\" / / / / / / A picture is worth TEN Thousand words...Fool!",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 13:33:00",
        "title": "Thank a Soldier",
        "userID": "SSGDuke53"
    },
    {
        "content": "It still truly amazes me the total ignorance of posters that came on mil.com and slam the Military with one hand, and with the other hand, state: “And finally, remember that when you joined the military, you took an oath to defend the Constitution, whose first amendment guarantees freedom of speech for EVERYONE -- not just those with whom you agree.” Hey…dud/e just go away… bag…. Break glass…in case of Emergency! Or, just wait till I get to the bottom of the bottle!",
        "intTime": 20090318,
        "postID": 32,
        "quote": "",
        "reply": "It still truly amazes me the total ignorance of posters that came on mil.com and slam the Military with one hand, and with the other hand, state: “And finally, remember that when you joined the military, you took an oath to defend the Constitution, whose first amendment guarantees freedom of speech for EVERYONE -- not just those with whom you agree.” Hey…dud/e just go away… bag…. Break glass…in case of Emergency! Or, just wait till I get to the bottom of the bottle!",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 14:05:00",
        "title": "Thank a Soldier",
        "userID": "ReaperDoc"
    },
    {
        "content": "While I think AMBASSADORIKU is a certifiable Wing Nut, I also think the obviously huge chip on the shoulders of some of the respondents to his comments almost prove his point (the few sane ones, anyway). Look, despite what we’re always told, every military action is not about securing my right to free speech. If it were I wouldn’t have free speech today. Say what you will, but clearly we lost the Vietnam War. We were told again and again and again that if South Vietnam fell we would soon be taken over by the communists and lose all of our rights. Still, almost 35 years ago we left Vietnam and “Uncle Ho” and the North took over the South and Vietnam went entirely communist. And yet today Vietnam is a major trading partner of the U.S. and I still have free speech. Were our men and women fighting for my right to “free speech” in Vietnam? They may have believed they were, but clearly history proves that what they were actually fighting for were political policies that had little or nothing to do with my rights. Hence, when we abandoned Vietnam, my rights didn’t change one bit. There are many of us who believe that the Iraq War is a lot closer to the Vietnam War scenario then we’d like. Therefore, it’s difficult to just accept that 1,000s upon 1,000s of innocent Iraqis and several 1000 American troops are dying for our rights. Many believe that regardless of how the Iraq War goes, our rights will remain intact and we wonder how many will have to die before this is proven out. I appreciate that our soldiers can’t go around picking and choosing which are righteous causes and when they are being used as pawns in some political game so maybe always believing the cause is righteous is necessary to do the job. But, don’t for a second allow yourself to believe that those who question what you’ve been asked to do are somehow your enemies. This isn’t ancient Rome, the President isn’t Caesar, and mine is to “reason why.”",
        "intTime": 20090318,
        "postID": 33,
        "quote": "",
        "reply": "While I think AMBASSADORIKU is a certifiable Wing Nut, I also think the obviously huge chip on the shoulders of some of the respondents to his comments almost prove his point (the few sane ones, anyway). Look, despite what we’re always told, every military action is not about securing my right to free speech. If it were I wouldn’t have free speech today. Say what you will, but clearly we lost the Vietnam War. We were told again and again and again that if South Vietnam fell we would soon be taken over by the communists and lose all of our rights. Still, almost 35 years ago we left Vietnam and “Uncle Ho” and the North took over the South and Vietnam went entirely communist. And yet today Vietnam is a major trading partner of the U.S. and I still have free speech. Were our men and women fighting for my right to “free speech” in Vietnam? They may have believed they were, but clearly history proves that what they were actually fighting for were political policies that had little or nothing to do with my rights. Hence, when we abandoned Vietnam, my rights didn’t change one bit. There are many of us who believe that the Iraq War is a lot closer to the Vietnam War scenario then we’d like. Therefore, it’s difficult to just accept that 1,000s upon 1,000s of innocent Iraqis and several 1000 American troops are dying for our rights. Many believe that regardless of how the Iraq War goes, our rights will remain intact and we wonder how many will have to die before this is proven out. I appreciate that our soldiers can’t go around picking and choosing which are righteous causes and when they are being used as pawns in some political game so maybe always believing the cause is righteous is necessary to do the job. But, don’t for a second allow yourself to believe that those who question what you’ve been asked to do are somehow your enemies. This isn’t ancient Rome, the President isn’t Caesar, and mine is to “reason why.”",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 16:02:00",
        "title": "Thank a Soldier",
        "userID": "DAWN2DUSK999"
    },
    {
        "content": "Geoff Tate :Salute: \"I support our troops!\" A simple, everyday statement. The differnce is, he actaully thought about it and then to the next step to really understand it, which meant understanding \"the troops\". I have not listened to this groups music in the past, but I think I am going to have to listen to them now, because he took the time to try and understand what I did with almost 34 years of my life, actually 36 when you include the ROTC time.",
        "intTime": 20090318,
        "postID": 34,
        "quote": "",
        "reply": "Geoff Tate :Salute: \"I support our troops!\" A simple, everyday statement. The differnce is, he actaully thought about it and then to the next step to really understand it, which meant understanding \"the troops\". I have not listened to this groups music in the past, but I think I am going to have to listen to them now, because he took the time to try and understand what I did with almost 34 years of my life, actually 36 when you include the ROTC time.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 16:13:00",
        "title": "Thank a Soldier",
        "userID": "oseles"
    },
    {
        "content": "quote: Originally posted by AMBASSADORIKU: Since I am not from this planet I would have to agree that to a lot of people La-La-Land can't be from this planet. As for your attitude - you are a joke.",
        "intTime": 20090318,
        "postID": 35,
        "quote": "Originally posted by AMBASSADORIKU: Since I am not from this planet",
        "reply": " I would have to agree that to a lot of people La-La-Land can't be from this planet. As for your attitude - you are a joke.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-18 16:18:00",
        "title": "Thank a Soldier",
        "userID": "oseles"
    },
    {
        "content": "It's awesome to hear a rocker support our troops. It's sad that the likes of Eddie Vedder, Springsteen, Stype, and a host of others drag politics and slamming President Bush into the war because all it does is bring our soldiers down when their CinC is constantly attacked. These people (I forgot the Dixie Chicks) are classless. What really saddened me was watching the debacle at the Republican Convention in St. Paul last September. I went down on more than one occasion and witnessed some of these individuals enjoying their freedom at the same time as denigrating the troops and war effort. I just wish that more people had the class of Mr. Tate and would speak up rather than worry about any impact on their careers.",
        "intTime": 20090319,
        "postID": 36,
        "quote": "",
        "reply": "It's awesome to hear a rocker support our troops. It's sad that the likes of Eddie Vedder, Springsteen, Stype, and a host of others drag politics and slamming President Bush into the war because all it does is bring our soldiers down when their CinC is constantly attacked. These people (I forgot the Dixie Chicks) are classless. What really saddened me was watching the debacle at the Republican Convention in St. Paul last September. I went down on more than one occasion and witnessed some of these individuals enjoying their freedom at the same time as denigrating the troops and war effort. I just wish that more people had the class of Mr. Tate and would speak up rather than worry about any impact on their careers.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-19 23:58:00",
        "title": "Thank a Soldier",
        "userID": "14184094"
    },
    {
        "content": "quote: Originally posted by oseles: quote: Originally posted by AMBASSADORIKU: Since I am not from this planet I would have to agree that to a lot of people La-La-Land can't be from this planet. As for your attitude - you are a joke. I hope everybody who has the occasion to LaLa, if they wish, hit the Mall, grab a bite, or just take a dump in peace, will think about, and thank, the noble guys and gals who claim the credit for making it all possible. There are a bunch of guys and gals in Washington, Hollywood and on Madidson Avenue who might make a run for that money, too. It's all about buying and selling dreams, ain't it? Then again, that's one of those 'fruits of victory', too.",
        "intTime": 20090320,
        "postID": 37,
        "quote": "Originally posted by oseles: quote: Originally posted by AMBASSADORIKU: Since I am not from this planet I would have to agree that to a lot of people La-La-Land can't be from this planet. As for your attitude - you are a joke.",
        "reply": " I hope everybody who has the occasion to LaLa, if they wish, hit the Mall, grab a bite, or just take a dump in peace, will think about, and thank, the noble guys and gals who claim the credit for making it all possible. There are a bunch of guys and gals in Washington, Hollywood and on Madidson Avenue who might make a run for that money, too. It's all about buying and selling dreams, ain't it? Then again, that's one of those 'fruits of victory', too.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-20 05:13:00",
        "title": "Thank a Soldier",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by DAWN2DUSK999: While I think AMBASSADORIKU is a certifiable Wing Nut, I also think the obviously huge chip on the shoulders of some of the respondents to his comments almost prove his point (the few sane ones, anyway). Look, despite what we’re always told, every military action is not about securing my right to free speech. If it were I wouldn’t have free speech today. Say what you will, but clearly we lost the Vietnam War. We were told again and again and again that if South Vietnam fell we would soon be taken over by the communists and lose all of our rights. Still, almost 35 years ago we left Vietnam and “Uncle Ho” and the North took over the South and Vietnam went entirely communist. And yet today Vietnam is a major trading partner of the U.S. and I still have free speech. Were our men and women fighting for my right to “free speech” in Vietnam? They may have believed they were, but clearly history proves that what they were actually fighting for were political policies that had little or nothing to do with my rights. Hence, when we abandoned Vietnam, my rights didn’t change one bit. There are many of us who believe that the Iraq War is a lot closer to the Vietnam War scenario then we’d like. Therefore, it’s difficult to just accept that 1,000s upon 1,000s of innocent Iraqis and several 1000 American troops are dying for our rights. Many believe that regardless of how the Iraq War goes, our rights will remain intact and we wonder how many will have to die before this is proven out. I appreciate that our soldiers can’t go around picking and choosing which are righteous causes and when they are being used as pawns in some political game so maybe always believing the cause is righteous is necessary to do the job. But, don’t for a second allow yourself to believe that those who question what you’ve been asked to do are somehow your enemies. This isn’t ancient Rome, the President isn’t Caesar, and mine is to “reason why.” So, who told you that we went into Iraq to secure our right to free speech? I have never been told that nor have I even thought it. I was under the impression that we went into Iraq to secure our right to live. When people state that we (the Soldier, Sailor, Airman, and Marine) fight for our freedoms, they include much more than the freedom of speech. Now, I don't want to get the left wing loonies started with their \"Bush lied\" BS (which is exactly what it is - total BS), but we went into Iraq to secure us against the threat of future attacks. You can argue whether that was right or wrong, and I suspect people will be arguing that for generations to come. The point is, at the time we invaded Iraq, there was substantial intelligence to suggest they were a credible, serious, and imminent threat against us. Much of that intelligence has not panned out but it was credible enough at the time to garner overwhelming support. Again, the Iraq war will be used extensively in the debate on whether or not we should conduct pre-emptive attacks, but at the time most thought it necessary. In addition, Iraq was constantly violating a treaty from a previous war, the Gulf War, which, IMO, was justification in itself to remove the regime. Amazingly enough, the Gulf War was also not about free speech. The Gulf War was about freeing a country that was hostilely taken over by Iraq. No one ever suggested that war had anything to do with our freedoms. It had to do with protecting the little guy (of course, we also had significant oil interests in the region). Come to think about it, did anyone ever claim that WWI or WWII were about free speech? Maybe indirectly because if we were taken over by a ruthless dictator, we would certainly lose our free speech, but I think we would have lost many more freedoms than that. You will hear many on this board state that the sacrifices of the military is one of the main reasons why we all have the freedom of speech to say some of the hateful things that people say, but we provide much more than that. We fight to protect all our freedoms the most basic of which are the right to LIFE, liberty and the pursuit of happiness. SCOUTS OUT!",
        "intTime": 20090320,
        "postID": 38,
        "quote": "Originally posted by DAWN2DUSK999: While I think AMBASSADORIKU is a certifiable Wing Nut, I also think the obviously huge chip on the shoulders of some of the respondents to his comments almost prove his point (the few sane ones, anyway). Look, despite what we’re always told, every military action is not about securing my right to free speech. If it were I wouldn’t have free speech today. Say what you will, but clearly we lost the Vietnam War. We were told again and again and again that if South Vietnam fell we would soon be taken over by the communists and lose all of our rights. Still, almost 35 years ago we left Vietnam and “Uncle Ho” and the North took over the South and Vietnam went entirely communist. And yet today Vietnam is a major trading partner of the U.S. and I still have free speech. Were our men and women fighting for my right to “free speech” in Vietnam? They may have believed they were, but clearly history proves that what they were actually fighting for were political policies that had little or nothing to do with my rights. Hence, when we abandoned Vietnam, my rights didn’t change one bit. There are many of us who believe that the Iraq War is a lot closer to the Vietnam War scenario then we’d like. Therefore, it’s difficult to just accept that 1,000s upon 1,000s of innocent Iraqis and several 1000 American troops are dying for our rights. Many believe that regardless of how the Iraq War goes, our rights will remain intact and we wonder how many will have to die before this is proven out. I appreciate that our soldiers can’t go around picking and choosing which are righteous causes and when they are being used as pawns in some political game so maybe always believing the cause is righteous is necessary to do the job. But, don’t for a second allow yourself to believe that those who question what you’ve been asked to do are somehow your enemies. This isn’t ancient Rome, the President isn’t Caesar, and mine is to “reason why.”",
        "reply": " So, who told you that we went into Iraq to secure our right to free speech? I have never been told that nor have I even thought it. I was under the impression that we went into Iraq to secure our right to live. When people state that we (the Soldier, Sailor, Airman, and Marine) fight for our freedoms, they include much more than the freedom of speech. Now, I don't want to get the left wing loonies started with their \"Bush lied\" BS (which is exactly what it is - total BS), but we went into Iraq to secure us against the threat of future attacks. You can argue whether that was right or wrong, and I suspect people will be arguing that for generations to come. The point is, at the time we invaded Iraq, there was substantial intelligence to suggest they were a credible, serious, and imminent threat against us. Much of that intelligence has not panned out but it was credible enough at the time to garner overwhelming support. Again, the Iraq war will be used extensively in the debate on whether or not we should conduct pre-emptive attacks, but at the time most thought it necessary. In addition, Iraq was constantly violating a treaty from a previous war, the Gulf War, which, IMO, was justification in itself to remove the regime. Amazingly enough, the Gulf War was also not about free speech. The Gulf War was about freeing a country that was hostilely taken over by Iraq. No one ever suggested that war had anything to do with our freedoms. It had to do with protecting the little guy (of course, we also had significant oil interests in the region). Come to think about it, did anyone ever claim that WWI or WWII were about free speech? Maybe indirectly because if we were taken over by a ruthless dictator, we would certainly lose our free speech, but I think we would have lost many more freedoms than that. You will hear many on this board state that the sacrifices of the military is one of the main reasons why we all have the freedom of speech to say some of the hateful things that people say, but we provide much more than that. We fight to protect all our freedoms the most basic of which are the right to LIFE, liberty and the pursuit of happiness. SCOUTS OUT!",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-20 06:24:00",
        "title": "Thank a Soldier",
        "userID": "RCcav"
    },
    {
        "content": "My dad is still with us 87 yrs 88 in July and is in good health considering. He served on Sebu Island in the Phillipeans guarding Army Corps doing roads when they has to go after a Jap sniper. He was there when the bombs were dropped on Japan and was aboard a troop transport in Tokyo Bay when the surrender was signed. He described how the city was so devastated from the bombing (conventional) and while on the mainland Japan that the woman and children didn't come out initially because they were told they would be raped by the Americans. He also stated that the war so ravaged the country that Jap women would line up outside of the GI chow tent with empty tins looking for leftover scraps as the GIs got done with their chow and he saw A US soldier just kick an old woman to the ground with his boot.....\"I felt bad for her but had no idea why he did that\" said my dad but \"that was war\". Several of my uncles were in the Army. I have 2 brothers that served along with a couple of my brothers in law. WW-II, The Berlin Wall, Korea, Vietnam. Me....I didn't serve in combat but I voluteered but my roomate and several friends went. But I did give 10 yrs of my life 1984-94. That doesn't matter. My dad still naggs me if I drink too much and I remind him to take his meds. We love each other all the same and talk as long as we can. God Bless my Dad, my Uncles, My brothers, My Brothers in Law, and all of my friends over those years. Most importantly...God bless the families. Especially my mom and sisters who sent all the care packages to me and all my friends who were so lonely for home.",
        "intTime": 20090320,
        "postID": 39,
        "quote": "",
        "reply": "My dad is still with us 87 yrs 88 in July and is in good health considering. He served on Sebu Island in the Phillipeans guarding Army Corps doing roads when they has to go after a Jap sniper. He was there when the bombs were dropped on Japan and was aboard a troop transport in Tokyo Bay when the surrender was signed. He described how the city was so devastated from the bombing (conventional) and while on the mainland Japan that the woman and children didn't come out initially because they were told they would be raped by the Americans. He also stated that the war so ravaged the country that Jap women would line up outside of the GI chow tent with empty tins looking for leftover scraps as the GIs got done with their chow and he saw A US soldier just kick an old woman to the ground with his boot.....\"I felt bad for her but had no idea why he did that\" said my dad but \"that was war\". Several of my uncles were in the Army. I have 2 brothers that served along with a couple of my brothers in law. WW-II, The Berlin Wall, Korea, Vietnam. Me....I didn't serve in combat but I voluteered but my roomate and several friends went. But I did give 10 yrs of my life 1984-94. That doesn't matter. My dad still naggs me if I drink too much and I remind him to take his meds. We love each other all the same and talk as long as we can. God Bless my Dad, my Uncles, My brothers, My Brothers in Law, and all of my friends over those years. Most importantly...God bless the families. Especially my mom and sisters who sent all the care packages to me and all my friends who were so lonely for home.",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-20 16:59:00",
        "title": "Thank a Soldier",
        "userID": "CarlofCasselberry"
    },
    {
        "content": "Beware, people of Earth!!! AMBASSADORIKU lies......he is really a clingon from Uranus!!! A \"Z class\" advanced dingleberry. (Are we havin' fun yet?) They are a war loving race that soften up a planet's defences with lies!!! BEWAAARRRE!!!",
        "intTime": 20090320,
        "postID": 40,
        "quote": "",
        "reply": "Beware, people of Earth!!! AMBASSADORIKU lies......he is really a clingon from Uranus!!! A \"Z class\" advanced dingleberry. (Are we havin' fun yet?) They are a war loving race that soften up a planet's defences with lies!!! BEWAAARRRE!!!",
        "threadID": "672198221_8690051812001",
        "time": "2009-03-20 22:18:00",
        "title": "Thank a Soldier",
        "userID": "WolfMurman"
    }
]