[
    {
        "content": "Looks like the article posted by crackerjacks last week or so, which was titled \"Pakistan may collapse within months\", may be coming closer to reality. quote: Pakistan sends troops to area grabbed by Taliban ISLAMABAD, Pakistan (CNN) -- Pakistani authorities on Thursday deployed paramilitary troops to a district, only 96 kilometers (60 miles) from the capital, where Taliban militants appeared to be consolidating control after this week's land-grab. Militants locked up courthouses and seized court documents in the district of Buner, said police Superintendent Arsala Khan. However, a highly placed Buner official said the judges left voluntarily after meeting with Taliban leaders. A van carrying Frontier Corps paramilitary troops through the district came under fire Thursday. One police official was killed and another wounded, authorities said. The troops were sent to protect civilians and properties, said Maj. Gen Athar Abbas, spokesman for Pakistan's military. (...) The militant group's leaders met with community elders and the civilian administration Thursday and agreed that its members will not move about openly with guns nor will they disturb police, courts, schools, hospitals or non-governmental organizations. The takeover of Buner brings the Taliban closer to the capital, Islamabad, than it has been since the insurgency started. The Taliban commander in Buner, Mowlana Mohammed Khalil, gave a statement before Pakistani television cameras Wednesday, appearing with his face hidden behind a cloth mask. Watch as Taliban is emboldened » \"We came here only to preach Islam,\" Khalil said. He added that his fighters were carrying weapons only because they were an important symbol for Muslims. The militants said they took control of the Buner district to ensure that Islamic law, or sharia, was properly imposed. The Pakistani government called the advance into the district a breach of a recently signed peace agreement. Residents of Buner said the militants had set up checkpoints and were patrolling streets throughout the district. (...) On Wednesday, U.S. Secretary of State Hillary Clinton warned that Pakistan was in danger of falling into terrorist hands because of failed government policies, and called on Pakistani citizens and expatriates to voice more concern. (...) Mike Mullen, U.S. chairman of the joint chiefs of staff, was in Islamabad on Wednesday to meet with Pakistani officials. Taliban militants implemented Islamic law in Pakistan's violence-plagued Swat Valley last week, before taking control of the neighboring Buner district. But Pakistan's ambassador to the United States, Husain Haqqani, told CNN on Wednesday that the situation was not as dire as Clinton described. (...) Taliban fighters moved into the Swat Valley as part of a peace deal with the government that has come under fire from U.S. observers. But Haqqani compared it to the deals U.S. commanders in Iraq made to peel insurgents away from Islamic jihadists blamed for the worst attacks on civilians there. (...)", 
        "intTime": 20090423, 
        "postID": 1, 
        "quote": "Pakistan sends troops to area grabbed by Taliban ISLAMABAD, Pakistan (CNN) -- Pakistani authorities on Thursday deployed paramilitary troops to a district, only 96 kilometers (60 miles) from the capital, where Taliban militants appeared to be consolidating control after this week's land-grab. Militants locked up courthouses and seized court documents in the district of Buner, said police Superintendent Arsala Khan. However, a highly placed Buner official said the judges left voluntarily after meeting with Taliban leaders. A van carrying Frontier Corps paramilitary troops through the district came under fire Thursday. One police official was killed and another wounded, authorities said. The troops were sent to protect civilians and properties, said Maj. Gen Athar Abbas, spokesman for Pakistan's military. (...) The militant group's leaders met with community elders and the civilian administration Thursday and agreed that its members will not move about openly with guns nor will they disturb police, courts, schools, hospitals or non-governmental organizations. The takeover of Buner brings the Taliban closer to the capital, Islamabad, than it has been since the insurgency started. The Taliban commander in Buner, Mowlana Mohammed Khalil, gave a statement before Pakistani television cameras Wednesday, appearing with his face hidden behind a cloth mask. Watch as Taliban is emboldened » \"We came here only to preach Islam,\" Khalil said. He added that his fighters were carrying weapons only because they were an important symbol for Muslims. The militants said they took control of the Buner district to ensure that Islamic law, or sharia, was properly imposed. The Pakistani government called the advance into the district a breach of a recently signed peace agreement. Residents of Buner said the militants had set up checkpoints and were patrolling streets throughout the district. (...) On Wednesday, U.S. Secretary of State Hillary Clinton warned that Pakistan was in danger of falling into terrorist hands because of failed government policies, and called on Pakistani citizens and expatriates to voice more concern. (...) Mike Mullen, U.S. chairman of the joint chiefs of staff, was in Islamabad on Wednesday to meet with Pakistani officials. Taliban militants implemented Islamic law in Pakistan's violence-plagued Swat Valley last week, before taking control of the neighboring Buner district. But Pakistan's ambassador to the United States, Husain Haqqani, told CNN on Wednesday that the situation was not as dire as Clinton described. (...) Taliban fighters moved into the Swat Valley as part of a peace deal with the government that has come under fire from U.S. observers. But Haqqani compared it to the deals U.S. commanders in Iraq made to peel insurgents away from Islamic jihadists blamed for the worst attacks on civilians there. (...)", 
        "reply": "Looks like the article posted by crackerjacks last week or so, which was titled \"Pakistan may collapse within months\", may be coming closer to reality. ", 
        "threadID": "672198221_1070055122001", 
        "time": "2009-04-23 10:33:00", 
        "title": "Taliban grab land closer to Pakistani capital; Pak. troops sent against them", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Its clear now more than ever that Pakistan is incapable of dealing with the clear and present danger of terrorists. It is time for President Obama to order our troops into action deal with this clear and present danger...", 
        "intTime": 20090423, 
        "postID": 2, 
        "quote": "", 
        "reply": "Its clear now more than ever that Pakistan is incapable of dealing with the clear and present danger of terrorists. It is time for President Obama to order our troops into action deal with this clear and present danger...", 
        "threadID": "672198221_1070055122001", 
        "time": "2009-04-23 10:37:00", 
        "title": "Taliban grab land closer to Pakistani capital; Pak. troops sent against them", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "BUMP. Aired on the 14th \"Pakistan: Children of the Taliban\" PBS Frontline Documentary 36 mins ++http://www.pbs.org/frontlineworld/stories/pakistan802/video/video_index.html Just more background.", 
        "intTime": 20090423, 
        "postID": 3, 
        "quote": "", 
        "reply": "BUMP. Aired on the 14th \"Pakistan: Children of the Taliban\" PBS Frontline Documentary 36 mins ++http://www.pbs.org/frontlineworld/stories/pakistan802/video/video_index.html Just more background.", 
        "threadID": "672198221_1070055122001", 
        "time": "2009-04-23 14:44:00", 
        "title": "Taliban grab land closer to Pakistani capital; Pak. troops sent against them", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": ">http://www.google.com/hostednews/ap/article/ALeqM5hkiMxbHNH0BqgpWA2ZG6VD6wVTmAD97OQNM00 And to-day they've been ordered to withdraw. Guess it isn't time for the general offensive yet.", 
        "intTime": 20090424, 
        "postID": 4, 
        "quote": "", 
        "reply": ">http://www.google.com/hostednews/ap/article/ALeqM5hkiMxbHNH0BqgpWA2ZG6VD6wVTmAD97OQNM00 And to-day they've been ordered to withdraw. Guess it isn't time for the general offensive yet.", 
        "threadID": "672198221_1070055122001", 
        "time": "2009-04-24 05:42:00", 
        "title": "Taliban grab land closer to Pakistani capital; Pak. troops sent against them", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Its clear now more than ever that Pakistan is incapable of dealing with the clear and present danger of terrorists. It is time for President Obama to order our troops into action deal with this clear and present danger... I sure hope you are a draft supporter, because you are a fool if you think we can fight a THIRD war right now with the size of Army we currently have. Nevermind the fact that we are already committed to two open-ended wars with no end in sight and 60% of our military committed at any one time to fighting in Iraq and Afghanistan.", 
        "intTime": 20090424, 
        "postID": 5, 
        "quote": "Originally posted by Irwin_R_Schyster: Its clear now more than ever that Pakistan is incapable of dealing with the clear and present danger of terrorists. It is time for President Obama to order our troops into action deal with this clear and present danger...", 
        "reply": " I sure hope you are a draft supporter, because you are a fool if you think we can fight a THIRD war right now with the size of Army we currently have. Nevermind the fact that we are already committed to two open-ended wars with no end in sight and 60% of our military committed at any one time to fighting in Iraq and Afghanistan.", 
        "threadID": "672198221_1070055122001", 
        "time": "2009-04-24 09:21:00", 
        "title": "Taliban grab land closer to Pakistani capital; Pak. troops sent against them", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Its clear now more than ever that Pakistan is incapable of dealing with the clear and present danger of terrorists. It is time for President Obama to order our troops into action deal with this clear and present danger... Do you suppose we should \"encourage\" Pakistan to invite us? There may come a point where that won't be necessary however. If the Taliban appear to be gaining control of Pakistan's nukes the whole game changes.", 
        "intTime": 20090424, 
        "postID": 6, 
        "quote": "Originally posted by Irwin_R_Schyster: Its clear now more than ever that Pakistan is incapable of dealing with the clear and present danger of terrorists. It is time for President Obama to order our troops into action deal with this clear and present danger...", 
        "reply": " Do you suppose we should \"encourage\" Pakistan to invite us? There may come a point where that won't be necessary however. If the Taliban appear to be gaining control of Pakistan's nukes the whole game changes.", 
        "threadID": "672198221_1070055122001", 
        "time": "2009-04-24 09:27:00", 
        "title": "Taliban grab land closer to Pakistani capital; Pak. troops sent against them", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: If the Taliban appear to be gaining control of Pakistan's nukes the whole game changes. Its estimated they have 50-60 nuclear weapons! AWESOME!!! ~Sarcasm off~ \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090424, 
        "postID": 7, 
        "quote": "Originally posted by Ol_Doc: If the Taliban appear to be gaining control of Pakistan's nukes the whole game changes.", 
        "reply": " Its estimated they have 50-60 nuclear weapons! AWESOME!!! ~Sarcasm off~ \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_1070055122001", 
        "time": "2009-04-24 10:07:00", 
        "title": "Taliban grab land closer to Pakistani capital; Pak. troops sent against them", 
        "userID": "NSNN"
    }, 
    {
        "content": "Just in time for us to Load our troops into A-Stan, just so the Taliban can get control of the nukes and set them on our troops in A-Stan Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090424, 
        "postID": 8, 
        "quote": "", 
        "reply": "Just in time for us to Load our troops into A-Stan, just so the Taliban can get control of the nukes and set them on our troops in A-Stan Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_1070055122001", 
        "time": "2009-04-24 10:08:00", 
        "title": "Taliban grab land closer to Pakistani capital; Pak. troops sent against them", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: Just in time for us to Load our troops into A-Stan, just so the Taliban can get control of the nukes and set them on our troops in A-Stan Terrorists have weapons of mass destruction in Pakistan? Is it 2003 again?", 
        "intTime": 20090424, 
        "postID": 9, 
        "quote": "Originally posted by L0A1: Just in time for us to Load our troops into A-Stan, just so the Taliban can get control of the nukes and set them on our troops in A-Stan", 
        "reply": " Terrorists have weapons of mass destruction in Pakistan? Is it 2003 again?", 
        "threadID": "672198221_1070055122001", 
        "time": "2009-04-24 17:32:00", 
        "title": "Taliban grab land closer to Pakistani capital; Pak. troops sent against them", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by L0A1: Just in time for us to Load our troops into A-Stan, just so the Taliban can get control of the nukes and set them on our troops in A-Stan Terrorists have weapons of mass destruction in Pakistan? Is it 2003 again? Don't be ignorant. So far the Pakistani Army has had their azzes whooped a few times. If the Taliban make it all the way, THEY WILL HAVE ACCESS to NUKES. They are insae enough to use them. Please use commen sense and don't play politics with our Troops lives. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090425, 
        "postID": 10, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by L0A1: Just in time for us to Load our troops into A-Stan, just so the Taliban can get control of the nukes and set them on our troops in A-Stan Terrorists have weapons of mass destruction in Pakistan? Is it 2003 again?", 
        "reply": " Don't be ignorant. So far the Pakistani Army has had their azzes whooped a few times. If the Taliban make it all the way, THEY WILL HAVE ACCESS to NUKES. They are insae enough to use them. Please use commen sense and don't play politics with our Troops lives. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_1070055122001", 
        "time": "2009-04-25 08:32:00", 
        "title": "Taliban grab land closer to Pakistani capital; Pak. troops sent against them", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Don't be ignorant. So far the Pakistani Army has had their azzes whooped a few times. If the Taliban make it all the way, THEY WILL HAVE ACCESS to NUKES. They are insae enough to use them. Please use commen sense and don't play politics with our Troops lives. Pakistan is clearly in danger of becoming a failed state and this has been brewing for a few years now even while they got F-16s and billions in US aid. As far back as 3 years ago I have said Pakistan poses more of a risk than Iran in the region because they already have nukes. India is getting prepared for the worst case scenario so maybe everyone else should too.", 
        "intTime": 20090425, 
        "postID": 11, 
        "quote": "Don't be ignorant. So far the Pakistani Army has had their azzes whooped a few times. If the Taliban make it all the way, THEY WILL HAVE ACCESS to NUKES. They are insae enough to use them. Please use commen sense and don't play politics with our Troops lives.", 
        "reply": " Pakistan is clearly in danger of becoming a failed state and this has been brewing for a few years now even while they got F-16s and billions in US aid. As far back as 3 years ago I have said Pakistan poses more of a risk than Iran in the region because they already have nukes. India is getting prepared for the worst case scenario so maybe everyone else should too.", 
        "threadID": "672198221_1070055122001", 
        "time": "2009-04-25 19:56:00", 
        "title": "Taliban grab land closer to Pakistani capital; Pak. troops sent against them", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "This is a situation that has to be carefully handled. Pakistan has a big army. We are not going to take them out with a handful of troops in Afghanistan. They have modern weapons. (Ours). We're going to need help, and we're going to have to proceed cautiously. A Pakistan controled by the Taliban is a menace to everyone. A little diplomacy to India and Russia is in order. The Taliban is MORE of a threat to them then us. This is payback for leaving Afghanistan to stew while we went off to Iraq. Six years wasted. Dave", 
        "intTime": 20090425, 
        "postID": 12, 
        "quote": "", 
        "reply": "This is a situation that has to be carefully handled. Pakistan has a big army. We are not going to take them out with a handful of troops in Afghanistan. They have modern weapons. (Ours). We're going to need help, and we're going to have to proceed cautiously. A Pakistan controled by the Taliban is a menace to everyone. A little diplomacy to India and Russia is in order. The Taliban is MORE of a threat to them then us. This is payback for leaving Afghanistan to stew while we went off to Iraq. Six years wasted. Dave", 
        "threadID": "672198221_1070055122001", 
        "time": "2009-04-25 20:05:00", 
        "title": "Taliban grab land closer to Pakistani capital; Pak. troops sent against them", 
        "userID": "Grachus"
    }
]