[
    {
        "content": "If not they should be. A rule is a rule. I'm sure it's only a matter of time before they are sent \"where ever they spent the weekend\" for good. http://www.military.com/news/article/April-2009/gay-wes...ont-ask.html?wh=news She talks about how can not \"lie\" anymore. Well she should of thought about that when she lied to herself joining and knowing the regulations in the first place. She should be discharged immediately. \"Forcing people to lie - it's absolutely a morally bankrupt idea,\" LMAO Forcing people to lie? That statement is pure stupidity! \"I started to feel immature - I was too grown up to be lying about where I spent the weekend,\" she said.\" Sounds like your still immature lady and can not follow simple military rules. You deserve the boot. How are these people being allowed to stay in where is the leadership that is suppose to enforce the rules? This message has been edited. Last edited by: crackerjacks61, Mon 13 April 2009 07:11 PM",
        "intTime": 20090413,
        "postID": 1,
        "quote": "",
        "reply": "If not they should be. A rule is a rule. I'm sure it's only a matter of time before they are sent \"where ever they spent the weekend\" for good. http://www.military.com/news/article/April-2009/gay-wes...ont-ask.html?wh=news She talks about how can not \"lie\" anymore. Well she should of thought about that when she lied to herself joining and knowing the regulations in the first place. She should be discharged immediately. \"Forcing people to lie - it's absolutely a morally bankrupt idea,\" LMAO Forcing people to lie? That statement is pure stupidity! \"I started to feel immature - I was too grown up to be lying about where I spent the weekend,\" she said.\" Sounds like your still immature lady and can not follow simple military rules. You deserve the boot. How are these people being allowed to stay in where is the leadership that is suppose to enforce the rules? This message has been edited. Last edited by: crackerjacks61, Mon 13 April 2009 07:11 PM",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-13 18:55:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "crackerjacks61"
    },
    {
        "content": "Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "intTime": 20090413,
        "postID": 2,
        "quote": "",
        "reply": "Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-13 19:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Irwin_R_Schyster"
    },
    {
        "content": "I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior.",
        "intTime": 20090414,
        "postID": 3,
        "quote": "",
        "reply": "I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:00:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SeaWitch1220"
    },
    {
        "content": "I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable.",
        "intTime": 20090414,
        "postID": 4,
        "quote": "",
        "reply": "I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Woody_in_La"
    },
    {
        "content": "I have a better idea. . . . let them never join to try to compel the military to accept such immoral behavior. If they do something immoral in private, they should have the class and dignity to not raise the issue in public, as if to say, \"Those of you who understand and endorse the strictures societies throughout history have usually imposed against such behavior must now ignore morality and openly accept my immorality.\" The first two posts might be the authors' ideas of humor, but if so, the joke is on them. They are correct in what they say.",
        "intTime": 20090414,
        "postID": 5,
        "quote": "",
        "reply": "I have a better idea. . . . let them never join to try to compel the military to accept such immoral behavior. If they do something immoral in private, they should have the class and dignity to not raise the issue in public, as if to say, \"Those of you who understand and endorse the strictures societies throughout history have usually imposed against such behavior must now ignore morality and openly accept my immorality.\" The first two posts might be the authors' ideas of humor, but if so, the joke is on them. They are correct in what they say.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "RRR52"
    },
    {
        "content": "quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "intTime": 20090414,
        "postID": 6,
        "quote": "Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior.",
        "reply": " Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "PhoenixDark"
    },
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. None of the 25 countries that have lifted their bans experienced any problems with unit cohesion and morale. It is amazing that the military, that holds honor above all else, would support a policy that requires people to lie. Good thing President Obama will do away with DADT in the near future!",
        "intTime": 20090414,
        "postID": 7,
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "reply": " None of the 25 countries that have lifted their bans experienced any problems with unit cohesion and morale. It is amazing that the military, that holds honor above all else, would support a policy that requires people to lie. Good thing President Obama will do away with DADT in the near future!",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:50:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SeaWitch1220"
    },
    {
        "content": "Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too?",
        "intTime": 20090414,
        "postID": 8,
        "quote": "",
        "reply": "Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too?",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:01:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by popsiq: Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too? Really? Cadets give up sex for four years?",
        "intTime": 20090414,
        "postID": 9,
        "quote": "Originally posted by popsiq: Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too?",
        "reply": " Really? Cadets give up sex for four years?",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:07:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SeaWitch1220"
    },
    {
        "content": "quote: Originally posted by Woody_in_La: I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable. yea no joke i was saying the same thing ... wow...",
        "intTime": 20090414,
        "postID": 10,
        "quote": "Originally posted by Woody_in_La: I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable.",
        "reply": " yea no joke i was saying the same thing ... wow...",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:10:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "outlaws93"
    },
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "intTime": 20090414,
        "postID": 11,
        "quote": "Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:11:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "NSNN"
    },
    {
        "content": "quote: Originally posted by SeaWitch1220: Good thing President Obama will do away with DADT in the near future! Still waiting I see................ Stop comparing racism and what other countries do to this issue. It's getting old.",
        "intTime": 20090414,
        "postID": 12,
        "quote": "Originally posted by SeaWitch1220: Good thing President Obama will do away with DADT in the near future!",
        "reply": " Still waiting I see................ Stop comparing racism and what other countries do to this issue. It's getting old.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:23:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "Good.",
        "intTime": 20090414,
        "postID": 13,
        "quote": "",
        "reply": "Good.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:52:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years.",
        "intTime": 20090414,
        "postID": 14,
        "quote": "Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "reply": " Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:05:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "nspreitler"
    },
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Another BS post by someone who takes any excuse to attacks homosexuals. The rule is they are not supposed to TELL so until they admit to being homosexual they are NOT breaking the rules. If they are sexually active then they are breaking the rules to the EXACT same extent as the straight members who have sex outside of marriage or married couple who have anything except vaginal sex . In other words the majority of members of the military have broken these rules.",
        "intTime": 20090414,
        "postID": 15,
        "quote": "Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "reply": " Another BS post by someone who takes any excuse to attacks homosexuals. The rule is they are not supposed to TELL so until they admit to being homosexual they are NOT breaking the rules. If they are sexually active then they are breaking the rules to the EXACT same extent as the straight members who have sex outside of marriage or married couple who have anything except vaginal sex . In other words the majority of members of the military have broken these rules.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:36:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years. So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don",
        "intTime": 20090414,
        "postID": 16,
        "quote": "Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years.",
        "reply": " So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "21yrsUSCGUSCS"
    },
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private.",
        "intTime": 20090414,
        "postID": 17,
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "reply": " Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:41:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "stec74"
    },
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. There are a lot of gays over there. Iraq is full of them. Actually I almost believe that their whole Iraqi Army is gay. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090414,
        "postID": 18,
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "reply": " There are a lot of gays over there. Iraq is full of them. Actually I almost believe that their whole Iraqi Army is gay. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 08:21:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private. That is sort of a circuitous logic. If we reinstituted the draft would you be in favor of allowing gays to serve openly? \"Actually I almost believe that their whole Iraqi Army is gay.\" There may be a bit of truth in that.",
        "intTime": 20090414,
        "postID": 19,
        "quote": "Originally posted by stec74: quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private.",
        "reply": " That is sort of a circuitous logic. If we reinstituted the draft would you be in favor of allowing gays to serve openly? \"Actually I almost believe that their whole Iraqi Army is gay.\" There may be a bit of truth in that.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 08:24:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years. So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don Who cares what two consenting adults do at home? The one mentioned in the article that wasn't in a relationship while she was in wouldn't have even violated DADT. Straight people violate the sodomy rules in the UCMJ all the time, and nobody is up in arms about what Private Snuffy is doing at home with his wife.",
        "intTime": 20090414,
        "postID": 20,
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years. So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don",
        "reply": " Who cares what two consenting adults do at home? The one mentioned in the article that wasn't in a relationship while she was in wouldn't have even violated DADT. Straight people violate the sodomy rules in the UCMJ all the time, and nobody is up in arms about what Private Snuffy is doing at home with his wife.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 09:50:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "nspreitler"
    },
    {
        "content": "If not they should be. A rule is a rule. I'm sure it's only a matter of time before they are sent \"where ever they spent the weekend\" for good. http://www.military.com/news/article/April-2009/gay-wes...ont-ask.html?wh=news She talks about how can not \"lie\" anymore. Well she should of thought about that when she lied to herself joining and knowing the regulations in the first place. She should be discharged immediately. \"Forcing people to lie - it's absolutely a morally bankrupt idea,\" LMAO Forcing people to lie? That statement is pure stupidity! \"I started to feel immature - I was too grown up to be lying about where I spent the weekend,\" she said.\" Sounds like your still immature lady and can not follow simple military rules. You deserve the boot. How are these people being allowed to stay in where is the leadership that is suppose to enforce the rules? This message has been edited. Last edited by: crackerjacks61, Mon 13 April 2009 07:11 PM",
        "intTime": 20090413,
        "postID": 21,
        "quote": "",
        "reply": "If not they should be. A rule is a rule. I'm sure it's only a matter of time before they are sent \"where ever they spent the weekend\" for good. http://www.military.com/news/article/April-2009/gay-wes...ont-ask.html?wh=news She talks about how can not \"lie\" anymore. Well she should of thought about that when she lied to herself joining and knowing the regulations in the first place. She should be discharged immediately. \"Forcing people to lie - it's absolutely a morally bankrupt idea,\" LMAO Forcing people to lie? That statement is pure stupidity! \"I started to feel immature - I was too grown up to be lying about where I spent the weekend,\" she said.\" Sounds like your still immature lady and can not follow simple military rules. You deserve the boot. How are these people being allowed to stay in where is the leadership that is suppose to enforce the rules? This message has been edited. Last edited by: crackerjacks61, Mon 13 April 2009 07:11 PM",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-13 18:55:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "crackerjacks61"
    },
    {
        "content": "Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "intTime": 20090413,
        "postID": 22,
        "quote": "",
        "reply": "Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-13 19:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Irwin_R_Schyster"
    },
    {
        "content": "I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior.",
        "intTime": 20090414,
        "postID": 23,
        "quote": "",
        "reply": "I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:00:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SeaWitch1220"
    },
    {
        "content": "I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable.",
        "intTime": 20090414,
        "postID": 24,
        "quote": "",
        "reply": "I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Woody_in_La"
    },
    {
        "content": "I have a better idea. . . . let them never join to try to compel the military to accept such immoral behavior. If they do something immoral in private, they should have the class and dignity to not raise the issue in public, as if to say, \"Those of you who understand and endorse the strictures societies throughout history have usually imposed against such behavior must now ignore morality and openly accept my immorality.\" The first two posts might be the authors' ideas of humor, but if so, the joke is on them. They are correct in what they say.",
        "intTime": 20090414,
        "postID": 25,
        "quote": "",
        "reply": "I have a better idea. . . . let them never join to try to compel the military to accept such immoral behavior. If they do something immoral in private, they should have the class and dignity to not raise the issue in public, as if to say, \"Those of you who understand and endorse the strictures societies throughout history have usually imposed against such behavior must now ignore morality and openly accept my immorality.\" The first two posts might be the authors' ideas of humor, but if so, the joke is on them. They are correct in what they say.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "RRR52"
    },
    {
        "content": "quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "intTime": 20090414,
        "postID": 26,
        "quote": "Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior.",
        "reply": " Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "PhoenixDark"
    },
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. None of the 25 countries that have lifted their bans experienced any problems with unit cohesion and morale. It is amazing that the military, that holds honor above all else, would support a policy that requires people to lie. Good thing President Obama will do away with DADT in the near future!",
        "intTime": 20090414,
        "postID": 27,
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "reply": " None of the 25 countries that have lifted their bans experienced any problems with unit cohesion and morale. It is amazing that the military, that holds honor above all else, would support a policy that requires people to lie. Good thing President Obama will do away with DADT in the near future!",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:50:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SeaWitch1220"
    },
    {
        "content": "Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too?",
        "intTime": 20090414,
        "postID": 28,
        "quote": "",
        "reply": "Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too?",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:01:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by popsiq: Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too? Really? Cadets give up sex for four years?",
        "intTime": 20090414,
        "postID": 29,
        "quote": "Originally posted by popsiq: Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too?",
        "reply": " Really? Cadets give up sex for four years?",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:07:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SeaWitch1220"
    },
    {
        "content": "quote: Originally posted by Woody_in_La: I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable. yea no joke i was saying the same thing ... wow...",
        "intTime": 20090414,
        "postID": 30,
        "quote": "Originally posted by Woody_in_La: I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable.",
        "reply": " yea no joke i was saying the same thing ... wow...",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:10:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "outlaws93"
    },
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "intTime": 20090414,
        "postID": 31,
        "quote": "Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:11:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "NSNN"
    },
    {
        "content": "quote: Originally posted by SeaWitch1220: Good thing President Obama will do away with DADT in the near future! Still waiting I see................ Stop comparing racism and what other countries do to this issue. It's getting old.",
        "intTime": 20090414,
        "postID": 32,
        "quote": "Originally posted by SeaWitch1220: Good thing President Obama will do away with DADT in the near future!",
        "reply": " Still waiting I see................ Stop comparing racism and what other countries do to this issue. It's getting old.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:23:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "Good.",
        "intTime": 20090414,
        "postID": 33,
        "quote": "",
        "reply": "Good.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:52:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years.",
        "intTime": 20090414,
        "postID": 34,
        "quote": "Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "reply": " Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:05:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "nspreitler"
    },
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Another BS post by someone who takes any excuse to attacks homosexuals. The rule is they are not supposed to TELL so until they admit to being homosexual they are NOT breaking the rules. If they are sexually active then they are breaking the rules to the EXACT same extent as the straight members who have sex outside of marriage or married couple who have anything except vaginal sex . In other words the majority of members of the military have broken these rules.",
        "intTime": 20090414,
        "postID": 35,
        "quote": "Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "reply": " Another BS post by someone who takes any excuse to attacks homosexuals. The rule is they are not supposed to TELL so until they admit to being homosexual they are NOT breaking the rules. If they are sexually active then they are breaking the rules to the EXACT same extent as the straight members who have sex outside of marriage or married couple who have anything except vaginal sex . In other words the majority of members of the military have broken these rules.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:36:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years. So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don",
        "intTime": 20090414,
        "postID": 36,
        "quote": "Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years.",
        "reply": " So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "21yrsUSCGUSCS"
    },
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private.",
        "intTime": 20090414,
        "postID": 37,
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "reply": " Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:41:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "stec74"
    },
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. There are a lot of gays over there. Iraq is full of them. Actually I almost believe that their whole Iraqi Army is gay. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090414,
        "postID": 38,
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "reply": " There are a lot of gays over there. Iraq is full of them. Actually I almost believe that their whole Iraqi Army is gay. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 08:21:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private. That is sort of a circuitous logic. If we reinstituted the draft would you be in favor of allowing gays to serve openly? \"Actually I almost believe that their whole Iraqi Army is gay.\" There may be a bit of truth in that.",
        "intTime": 20090414,
        "postID": 39,
        "quote": "Originally posted by stec74: quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private.",
        "reply": " That is sort of a circuitous logic. If we reinstituted the draft would you be in favor of allowing gays to serve openly? \"Actually I almost believe that their whole Iraqi Army is gay.\" There may be a bit of truth in that.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 08:24:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years. So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don Who cares what two consenting adults do at home? The one mentioned in the article that wasn't in a relationship while she was in wouldn't have even violated DADT. Straight people violate the sodomy rules in the UCMJ all the time, and nobody is up in arms about what Private Snuffy is doing at home with his wife.",
        "intTime": 20090414,
        "postID": 40,
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years. So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don",
        "reply": " Who cares what two consenting adults do at home? The one mentioned in the article that wasn't in a relationship while she was in wouldn't have even violated DADT. Straight people violate the sodomy rules in the UCMJ all the time, and nobody is up in arms about what Private Snuffy is doing at home with his wife.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 09:50:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "nspreitler"
    },
    {
        "content": "If not they should be. A rule is a rule. I'm sure it's only a matter of time before they are sent \"where ever they spent the weekend\" for good. http://www.military.com/news/article/April-2009/gay-wes...ont-ask.html?wh=news She talks about how can not \"lie\" anymore. Well she should of thought about that when she lied to herself joining and knowing the regulations in the first place. She should be discharged immediately. \"Forcing people to lie - it's absolutely a morally bankrupt idea,\" LMAO Forcing people to lie? That statement is pure stupidity! \"I started to feel immature - I was too grown up to be lying about where I spent the weekend,\" she said.\" Sounds like your still immature lady and can not follow simple military rules. You deserve the boot. How are these people being allowed to stay in where is the leadership that is suppose to enforce the rules? This message has been edited. Last edited by: crackerjacks61, Mon 13 April 2009 07:11 PM",
        "intTime": 20090413,
        "postID": 41,
        "quote": "",
        "reply": "If not they should be. A rule is a rule. I'm sure it's only a matter of time before they are sent \"where ever they spent the weekend\" for good. http://www.military.com/news/article/April-2009/gay-wes...ont-ask.html?wh=news She talks about how can not \"lie\" anymore. Well she should of thought about that when she lied to herself joining and knowing the regulations in the first place. She should be discharged immediately. \"Forcing people to lie - it's absolutely a morally bankrupt idea,\" LMAO Forcing people to lie? That statement is pure stupidity! \"I started to feel immature - I was too grown up to be lying about where I spent the weekend,\" she said.\" Sounds like your still immature lady and can not follow simple military rules. You deserve the boot. How are these people being allowed to stay in where is the leadership that is suppose to enforce the rules? This message has been edited. Last edited by: crackerjacks61, Mon 13 April 2009 07:11 PM",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-13 18:55:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "crackerjacks61"
    },
    {
        "content": "Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "intTime": 20090413,
        "postID": 42,
        "quote": "",
        "reply": "Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-13 19:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Irwin_R_Schyster"
    },
    {
        "content": "I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior.",
        "intTime": 20090414,
        "postID": 43,
        "quote": "",
        "reply": "I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:00:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SeaWitch1220"
    },
    {
        "content": "I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable.",
        "intTime": 20090414,
        "postID": 44,
        "quote": "",
        "reply": "I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Woody_in_La"
    },
    {
        "content": "I have a better idea. . . . let them never join to try to compel the military to accept such immoral behavior. If they do something immoral in private, they should have the class and dignity to not raise the issue in public, as if to say, \"Those of you who understand and endorse the strictures societies throughout history have usually imposed against such behavior must now ignore morality and openly accept my immorality.\" The first two posts might be the authors' ideas of humor, but if so, the joke is on them. They are correct in what they say.",
        "intTime": 20090414,
        "postID": 45,
        "quote": "",
        "reply": "I have a better idea. . . . let them never join to try to compel the military to accept such immoral behavior. If they do something immoral in private, they should have the class and dignity to not raise the issue in public, as if to say, \"Those of you who understand and endorse the strictures societies throughout history have usually imposed against such behavior must now ignore morality and openly accept my immorality.\" The first two posts might be the authors' ideas of humor, but if so, the joke is on them. They are correct in what they say.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "RRR52"
    },
    {
        "content": "quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "intTime": 20090414,
        "postID": 46,
        "quote": "Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior.",
        "reply": " Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "PhoenixDark"
    },
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. None of the 25 countries that have lifted their bans experienced any problems with unit cohesion and morale. It is amazing that the military, that holds honor above all else, would support a policy that requires people to lie. Good thing President Obama will do away with DADT in the near future!",
        "intTime": 20090414,
        "postID": 47,
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "reply": " None of the 25 countries that have lifted their bans experienced any problems with unit cohesion and morale. It is amazing that the military, that holds honor above all else, would support a policy that requires people to lie. Good thing President Obama will do away with DADT in the near future!",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:50:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SeaWitch1220"
    },
    {
        "content": "Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too?",
        "intTime": 20090414,
        "postID": 48,
        "quote": "",
        "reply": "Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too?",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:01:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by popsiq: Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too? Really? Cadets give up sex for four years?",
        "intTime": 20090414,
        "postID": 49,
        "quote": "Originally posted by popsiq: Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too?",
        "reply": " Really? Cadets give up sex for four years?",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:07:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SeaWitch1220"
    },
    {
        "content": "quote: Originally posted by Woody_in_La: I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable. yea no joke i was saying the same thing ... wow...",
        "intTime": 20090414,
        "postID": 50,
        "quote": "Originally posted by Woody_in_La: I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable.",
        "reply": " yea no joke i was saying the same thing ... wow...",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:10:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "outlaws93"
    },
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "intTime": 20090414,
        "postID": 51,
        "quote": "Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:11:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "NSNN"
    },
    {
        "content": "quote: Originally posted by SeaWitch1220: Good thing President Obama will do away with DADT in the near future! Still waiting I see................ Stop comparing racism and what other countries do to this issue. It's getting old.",
        "intTime": 20090414,
        "postID": 52,
        "quote": "Originally posted by SeaWitch1220: Good thing President Obama will do away with DADT in the near future!",
        "reply": " Still waiting I see................ Stop comparing racism and what other countries do to this issue. It's getting old.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:23:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "Good.",
        "intTime": 20090414,
        "postID": 53,
        "quote": "",
        "reply": "Good.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:52:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years.",
        "intTime": 20090414,
        "postID": 54,
        "quote": "Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "reply": " Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:05:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "nspreitler"
    },
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Another BS post by someone who takes any excuse to attacks homosexuals. The rule is they are not supposed to TELL so until they admit to being homosexual they are NOT breaking the rules. If they are sexually active then they are breaking the rules to the EXACT same extent as the straight members who have sex outside of marriage or married couple who have anything except vaginal sex . In other words the majority of members of the military have broken these rules.",
        "intTime": 20090414,
        "postID": 55,
        "quote": "Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "reply": " Another BS post by someone who takes any excuse to attacks homosexuals. The rule is they are not supposed to TELL so until they admit to being homosexual they are NOT breaking the rules. If they are sexually active then they are breaking the rules to the EXACT same extent as the straight members who have sex outside of marriage or married couple who have anything except vaginal sex . In other words the majority of members of the military have broken these rules.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:36:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years. So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don",
        "intTime": 20090414,
        "postID": 56,
        "quote": "Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years.",
        "reply": " So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "21yrsUSCGUSCS"
    },
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private.",
        "intTime": 20090414,
        "postID": 57,
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "reply": " Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:41:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "stec74"
    },
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. There are a lot of gays over there. Iraq is full of them. Actually I almost believe that their whole Iraqi Army is gay. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090414,
        "postID": 58,
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "reply": " There are a lot of gays over there. Iraq is full of them. Actually I almost believe that their whole Iraqi Army is gay. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 08:21:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private. That is sort of a circuitous logic. If we reinstituted the draft would you be in favor of allowing gays to serve openly? \"Actually I almost believe that their whole Iraqi Army is gay.\" There may be a bit of truth in that.",
        "intTime": 20090414,
        "postID": 59,
        "quote": "Originally posted by stec74: quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private.",
        "reply": " That is sort of a circuitous logic. If we reinstituted the draft would you be in favor of allowing gays to serve openly? \"Actually I almost believe that their whole Iraqi Army is gay.\" There may be a bit of truth in that.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 08:24:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years. So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don Who cares what two consenting adults do at home? The one mentioned in the article that wasn't in a relationship while she was in wouldn't have even violated DADT. Straight people violate the sodomy rules in the UCMJ all the time, and nobody is up in arms about what Private Snuffy is doing at home with his wife.",
        "intTime": 20090414,
        "postID": 60,
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years. So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don",
        "reply": " Who cares what two consenting adults do at home? The one mentioned in the article that wasn't in a relationship while she was in wouldn't have even violated DADT. Straight people violate the sodomy rules in the UCMJ all the time, and nobody is up in arms about what Private Snuffy is doing at home with his wife.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 09:50:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "nspreitler"
    },
    {
        "content": "If not they should be. A rule is a rule. I'm sure it's only a matter of time before they are sent \"where ever they spent the weekend\" for good. http://www.military.com/news/article/April-2009/gay-wes...ont-ask.html?wh=news She talks about how can not \"lie\" anymore. Well she should of thought about that when she lied to herself joining and knowing the regulations in the first place. She should be discharged immediately. \"Forcing people to lie - it's absolutely a morally bankrupt idea,\" LMAO Forcing people to lie? That statement is pure stupidity! \"I started to feel immature - I was too grown up to be lying about where I spent the weekend,\" she said.\" Sounds like your still immature lady and can not follow simple military rules. You deserve the boot. How are these people being allowed to stay in where is the leadership that is suppose to enforce the rules? This message has been edited. Last edited by: crackerjacks61, Mon 13 April 2009 07:11 PM",
        "intTime": 20090413,
        "postID": 61,
        "quote": "",
        "reply": "If not they should be. A rule is a rule. I'm sure it's only a matter of time before they are sent \"where ever they spent the weekend\" for good. http://www.military.com/news/article/April-2009/gay-wes...ont-ask.html?wh=news She talks about how can not \"lie\" anymore. Well she should of thought about that when she lied to herself joining and knowing the regulations in the first place. She should be discharged immediately. \"Forcing people to lie - it's absolutely a morally bankrupt idea,\" LMAO Forcing people to lie? That statement is pure stupidity! \"I started to feel immature - I was too grown up to be lying about where I spent the weekend,\" she said.\" Sounds like your still immature lady and can not follow simple military rules. You deserve the boot. How are these people being allowed to stay in where is the leadership that is suppose to enforce the rules? This message has been edited. Last edited by: crackerjacks61, Mon 13 April 2009 07:11 PM",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-13 18:55:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "crackerjacks61"
    },
    {
        "content": "Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "intTime": 20090413,
        "postID": 62,
        "quote": "",
        "reply": "Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-13 19:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Irwin_R_Schyster"
    },
    {
        "content": "I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior.",
        "intTime": 20090414,
        "postID": 63,
        "quote": "",
        "reply": "I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:00:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SeaWitch1220"
    },
    {
        "content": "I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable.",
        "intTime": 20090414,
        "postID": 64,
        "quote": "",
        "reply": "I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Woody_in_La"
    },
    {
        "content": "I have a better idea. . . . let them never join to try to compel the military to accept such immoral behavior. If they do something immoral in private, they should have the class and dignity to not raise the issue in public, as if to say, \"Those of you who understand and endorse the strictures societies throughout history have usually imposed against such behavior must now ignore morality and openly accept my immorality.\" The first two posts might be the authors' ideas of humor, but if so, the joke is on them. They are correct in what they say.",
        "intTime": 20090414,
        "postID": 65,
        "quote": "",
        "reply": "I have a better idea. . . . let them never join to try to compel the military to accept such immoral behavior. If they do something immoral in private, they should have the class and dignity to not raise the issue in public, as if to say, \"Those of you who understand and endorse the strictures societies throughout history have usually imposed against such behavior must now ignore morality and openly accept my immorality.\" The first two posts might be the authors' ideas of humor, but if so, the joke is on them. They are correct in what they say.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "RRR52"
    },
    {
        "content": "quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "intTime": 20090414,
        "postID": 66,
        "quote": "Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior.",
        "reply": " Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "PhoenixDark"
    },
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. None of the 25 countries that have lifted their bans experienced any problems with unit cohesion and morale. It is amazing that the military, that holds honor above all else, would support a policy that requires people to lie. Good thing President Obama will do away with DADT in the near future!",
        "intTime": 20090414,
        "postID": 67,
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "reply": " None of the 25 countries that have lifted their bans experienced any problems with unit cohesion and morale. It is amazing that the military, that holds honor above all else, would support a policy that requires people to lie. Good thing President Obama will do away with DADT in the near future!",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:50:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SeaWitch1220"
    },
    {
        "content": "Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too?",
        "intTime": 20090414,
        "postID": 68,
        "quote": "",
        "reply": "Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too?",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:01:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by popsiq: Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too? Really? Cadets give up sex for four years?",
        "intTime": 20090414,
        "postID": 69,
        "quote": "Originally posted by popsiq: Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too?",
        "reply": " Really? Cadets give up sex for four years?",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:07:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SeaWitch1220"
    },
    {
        "content": "quote: Originally posted by Woody_in_La: I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable. yea no joke i was saying the same thing ... wow...",
        "intTime": 20090414,
        "postID": 70,
        "quote": "Originally posted by Woody_in_La: I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable.",
        "reply": " yea no joke i was saying the same thing ... wow...",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:10:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "outlaws93"
    },
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "intTime": 20090414,
        "postID": 71,
        "quote": "Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:11:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "NSNN"
    },
    {
        "content": "quote: Originally posted by SeaWitch1220: Good thing President Obama will do away with DADT in the near future! Still waiting I see................ Stop comparing racism and what other countries do to this issue. It's getting old.",
        "intTime": 20090414,
        "postID": 72,
        "quote": "Originally posted by SeaWitch1220: Good thing President Obama will do away with DADT in the near future!",
        "reply": " Still waiting I see................ Stop comparing racism and what other countries do to this issue. It's getting old.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:23:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "Good.",
        "intTime": 20090414,
        "postID": 73,
        "quote": "",
        "reply": "Good.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:52:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years.",
        "intTime": 20090414,
        "postID": 74,
        "quote": "Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "reply": " Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:05:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "nspreitler"
    },
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Another BS post by someone who takes any excuse to attacks homosexuals. The rule is they are not supposed to TELL so until they admit to being homosexual they are NOT breaking the rules. If they are sexually active then they are breaking the rules to the EXACT same extent as the straight members who have sex outside of marriage or married couple who have anything except vaginal sex . In other words the majority of members of the military have broken these rules.",
        "intTime": 20090414,
        "postID": 75,
        "quote": "Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "reply": " Another BS post by someone who takes any excuse to attacks homosexuals. The rule is they are not supposed to TELL so until they admit to being homosexual they are NOT breaking the rules. If they are sexually active then they are breaking the rules to the EXACT same extent as the straight members who have sex outside of marriage or married couple who have anything except vaginal sex . In other words the majority of members of the military have broken these rules.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:36:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years. So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don",
        "intTime": 20090414,
        "postID": 76,
        "quote": "Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years.",
        "reply": " So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "21yrsUSCGUSCS"
    },
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private.",
        "intTime": 20090414,
        "postID": 77,
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "reply": " Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:41:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "stec74"
    },
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. There are a lot of gays over there. Iraq is full of them. Actually I almost believe that their whole Iraqi Army is gay. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090414,
        "postID": 78,
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "reply": " There are a lot of gays over there. Iraq is full of them. Actually I almost believe that their whole Iraqi Army is gay. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 08:21:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private. That is sort of a circuitous logic. If we reinstituted the draft would you be in favor of allowing gays to serve openly? \"Actually I almost believe that their whole Iraqi Army is gay.\" There may be a bit of truth in that.",
        "intTime": 20090414,
        "postID": 79,
        "quote": "Originally posted by stec74: quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private.",
        "reply": " That is sort of a circuitous logic. If we reinstituted the draft would you be in favor of allowing gays to serve openly? \"Actually I almost believe that their whole Iraqi Army is gay.\" There may be a bit of truth in that.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 08:24:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years. So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don Who cares what two consenting adults do at home? The one mentioned in the article that wasn't in a relationship while she was in wouldn't have even violated DADT. Straight people violate the sodomy rules in the UCMJ all the time, and nobody is up in arms about what Private Snuffy is doing at home with his wife.",
        "intTime": 20090414,
        "postID": 80,
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years. So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don",
        "reply": " Who cares what two consenting adults do at home? The one mentioned in the article that wasn't in a relationship while she was in wouldn't have even violated DADT. Straight people violate the sodomy rules in the UCMJ all the time, and nobody is up in arms about what Private Snuffy is doing at home with his wife.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 09:50:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "nspreitler"
    },
    {
        "content": "If not they should be. A rule is a rule. I'm sure it's only a matter of time before they are sent \"where ever they spent the weekend\" for good. http://www.military.com/news/article/April-2009/gay-wes...ont-ask.html?wh=news She talks about how can not \"lie\" anymore. Well she should of thought about that when she lied to herself joining and knowing the regulations in the first place. She should be discharged immediately. \"Forcing people to lie - it's absolutely a morally bankrupt idea,\" LMAO Forcing people to lie? That statement is pure stupidity! \"I started to feel immature - I was too grown up to be lying about where I spent the weekend,\" she said.\" Sounds like your still immature lady and can not follow simple military rules. You deserve the boot. How are these people being allowed to stay in where is the leadership that is suppose to enforce the rules? This message has been edited. Last edited by: crackerjacks61, Mon 13 April 2009 07:11 PM",
        "intTime": 20090413,
        "postID": 81,
        "quote": "",
        "reply": "If not they should be. A rule is a rule. I'm sure it's only a matter of time before they are sent \"where ever they spent the weekend\" for good. http://www.military.com/news/article/April-2009/gay-wes...ont-ask.html?wh=news She talks about how can not \"lie\" anymore. Well she should of thought about that when she lied to herself joining and knowing the regulations in the first place. She should be discharged immediately. \"Forcing people to lie - it's absolutely a morally bankrupt idea,\" LMAO Forcing people to lie? That statement is pure stupidity! \"I started to feel immature - I was too grown up to be lying about where I spent the weekend,\" she said.\" Sounds like your still immature lady and can not follow simple military rules. You deserve the boot. How are these people being allowed to stay in where is the leadership that is suppose to enforce the rules? This message has been edited. Last edited by: crackerjacks61, Mon 13 April 2009 07:11 PM",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-13 18:55:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "crackerjacks61"
    },
    {
        "content": "Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "intTime": 20090413,
        "postID": 82,
        "quote": "",
        "reply": "Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-13 19:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Irwin_R_Schyster"
    },
    {
        "content": "I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior.",
        "intTime": 20090414,
        "postID": 83,
        "quote": "",
        "reply": "I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:00:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SeaWitch1220"
    },
    {
        "content": "I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable.",
        "intTime": 20090414,
        "postID": 84,
        "quote": "",
        "reply": "I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Woody_in_La"
    },
    {
        "content": "I have a better idea. . . . let them never join to try to compel the military to accept such immoral behavior. If they do something immoral in private, they should have the class and dignity to not raise the issue in public, as if to say, \"Those of you who understand and endorse the strictures societies throughout history have usually imposed against such behavior must now ignore morality and openly accept my immorality.\" The first two posts might be the authors' ideas of humor, but if so, the joke is on them. They are correct in what they say.",
        "intTime": 20090414,
        "postID": 85,
        "quote": "",
        "reply": "I have a better idea. . . . let them never join to try to compel the military to accept such immoral behavior. If they do something immoral in private, they should have the class and dignity to not raise the issue in public, as if to say, \"Those of you who understand and endorse the strictures societies throughout history have usually imposed against such behavior must now ignore morality and openly accept my immorality.\" The first two posts might be the authors' ideas of humor, but if so, the joke is on them. They are correct in what they say.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "RRR52"
    },
    {
        "content": "quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "intTime": 20090414,
        "postID": 86,
        "quote": "Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior.",
        "reply": " Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "PhoenixDark"
    },
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. None of the 25 countries that have lifted their bans experienced any problems with unit cohesion and morale. It is amazing that the military, that holds honor above all else, would support a policy that requires people to lie. Good thing President Obama will do away with DADT in the near future!",
        "intTime": 20090414,
        "postID": 87,
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "reply": " None of the 25 countries that have lifted their bans experienced any problems with unit cohesion and morale. It is amazing that the military, that holds honor above all else, would support a policy that requires people to lie. Good thing President Obama will do away with DADT in the near future!",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 05:50:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SeaWitch1220"
    },
    {
        "content": "Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too?",
        "intTime": 20090414,
        "postID": 88,
        "quote": "",
        "reply": "Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too?",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:01:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "popsiq"
    },
    {
        "content": "quote: Originally posted by popsiq: Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too? Really? Cadets give up sex for four years?",
        "intTime": 20090414,
        "postID": 89,
        "quote": "Originally posted by popsiq: Doesn't the 'honor' code at military academies constrain sexual activity of any kind? Or are 'goonads' replacing grey matter there too?",
        "reply": " Really? Cadets give up sex for four years?",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:07:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SeaWitch1220"
    },
    {
        "content": "quote: Originally posted by Woody_in_La: I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable. yea no joke i was saying the same thing ... wow...",
        "intTime": 20090414,
        "postID": 90,
        "quote": "Originally posted by Woody_in_La: I can not believe I agree with both CJ and schyster! But they lied pure and simple. They should be held accountable.",
        "reply": " yea no joke i was saying the same thing ... wow...",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:10:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "outlaws93"
    },
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "intTime": 20090414,
        "postID": 91,
        "quote": "Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:11:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "NSNN"
    },
    {
        "content": "quote: Originally posted by SeaWitch1220: Good thing President Obama will do away with DADT in the near future! Still waiting I see................ Stop comparing racism and what other countries do to this issue. It's getting old.",
        "intTime": 20090414,
        "postID": 92,
        "quote": "Originally posted by SeaWitch1220: Good thing President Obama will do away with DADT in the near future!",
        "reply": " Still waiting I see................ Stop comparing racism and what other countries do to this issue. It's getting old.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:23:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "Good.",
        "intTime": 20090414,
        "postID": 93,
        "quote": "",
        "reply": "Good.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 06:52:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years.",
        "intTime": 20090414,
        "postID": 94,
        "quote": "Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "reply": " Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:05:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "nspreitler"
    },
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Another BS post by someone who takes any excuse to attacks homosexuals. The rule is they are not supposed to TELL so until they admit to being homosexual they are NOT breaking the rules. If they are sexually active then they are breaking the rules to the EXACT same extent as the straight members who have sex outside of marriage or married couple who have anything except vaginal sex . In other words the majority of members of the military have broken these rules.",
        "intTime": 20090414,
        "postID": 95,
        "quote": "Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else...",
        "reply": " Another BS post by someone who takes any excuse to attacks homosexuals. The rule is they are not supposed to TELL so until they admit to being homosexual they are NOT breaking the rules. If they are sexually active then they are breaking the rules to the EXACT same extent as the straight members who have sex outside of marriage or married couple who have anything except vaginal sex . In other words the majority of members of the military have broken these rules.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:36:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years. So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don",
        "intTime": 20090414,
        "postID": 96,
        "quote": "Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years.",
        "reply": " So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:40:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "21yrsUSCGUSCS"
    },
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private.",
        "intTime": 20090414,
        "postID": 97,
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "reply": " Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 07:41:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "stec74"
    },
    {
        "content": "quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. There are a lot of gays over there. Iraq is full of them. Actually I almost believe that their whole Iraqi Army is gay. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090414,
        "postID": 98,
        "quote": "Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT.",
        "reply": " There are a lot of gays over there. Iraq is full of them. Actually I almost believe that their whole Iraqi Army is gay. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 08:21:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private. That is sort of a circuitous logic. If we reinstituted the draft would you be in favor of allowing gays to serve openly? \"Actually I almost believe that their whole Iraqi Army is gay.\" There may be a bit of truth in that.",
        "intTime": 20090414,
        "postID": 99,
        "quote": "Originally posted by stec74: quote: Originally posted by PhoenixDark: quote: Originally posted by SeaWitch1220: I have a better idea...let them serve honestly. Stop discharging people for their private consenting adult behavior. Even the vaunted Israeli Defense Forces allows openly gay personnel to serve without fear of retribution and hasn't suffered any of the oft-claimed downsides (bad effects on individual moral and unit cohesion) that detractors often claim would result if we did away with DADT. Military service in Israel is MANDATORY. If they had a DADT policy in Israel, how many people would use that as an excuse not to serve? Military service in the US is VOLUNTARY. If you don't like the rules or regulations that you will be held accountable to then you have the choice not to volunteer. If you choose to enlist under the DADT policy, then you choose to keep your sexual orientation private.",
        "reply": " That is sort of a circuitous logic. If we reinstituted the draft would you be in favor of allowing gays to serve openly? \"Actually I almost believe that their whole Iraqi Army is gay.\" There may be a bit of truth in that.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 08:24:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by 21yrsUSCGUSCS: quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years. So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don Who cares what two consenting adults do at home? The one mentioned in the article that wasn't in a relationship while she was in wouldn't have even violated DADT. Straight people violate the sodomy rules in the UCMJ all the time, and nobody is up in arms about what Private Snuffy is doing at home with his wife.",
        "intTime": 20090414,
        "postID": 100,
        "quote": "Originally posted by 21yrsUSCGUSCS: quote: Originally posted by nspreitler: quote: Originally posted by Irwin_R_Schyster: Not only should they be thrown out of the Military, they should be charged the full price of their education which they ROBBED from a qualified candidate. Throw em out, prosecute them for fraud, and charge them for the price of admission. Its BS how these idiots join KNOWING they are breaking the damn rules while stealing a valuable seat for someone else... Did you read the article. All but one of the people have done their service honorably and gotten out. Only one is still serving and he has been in for 6 years. So what's your point? If CPO So and So serves 22 yrs in the military and does his job everyday but it is found out that while home, he had been having sex with his goat all those years, is that serving with honor? I guess someone noticed the kids looked a lot like him. (Pun definitely intended) Don",
        "reply": " Who cares what two consenting adults do at home? The one mentioned in the article that wasn't in a relationship while she was in wouldn't have even violated DADT. Straight people violate the sodomy rules in the UCMJ all the time, and nobody is up in arms about what Private Snuffy is doing at home with his wife.",
        "threadID": "672198221_8880046022001",
        "time": "2009-04-14 09:50:00",
        "title": "Gay Cadets Getting Busted Out Of The Military All Over The Place!",
        "userID": "nspreitler"
    }
]