[
    {
        "content": "Seems like in our current economic situation we easily could be. One side of me says there is no way in hell I will use a foreign dollar in my country, then again if the Gov. does it what choice do we have? \"http://www.breitbart.com/article.php?id=CNG.7e6cab4fec704a0fdd135ecdac00673b.9c1&show_article=1\" How do you guys feel about this?", 
        "intTime": 20090330, 
        "postID": 1, 
        "quote": "", 
        "reply": "Seems like in our current economic situation we easily could be. One side of me says there is no way in hell I will use a foreign dollar in my country, then again if the Gov. does it what choice do we have? \"http://www.breitbart.com/article.php?id=CNG.7e6cab4fec704a0fdd135ecdac00673b.9c1&show_article=1\" How do you guys feel about this?", 
        "threadID": "672198221_1920083912001", 
        "time": "2009-03-30 15:58:00", 
        "title": "Could the US Be Backed In A Corner For World Currency?", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Seems like in our current economic situation we easily could be. One side of me says there is no way in hell I will use a foreign dollar in my country, then again if the Gov. does it what choice do we have? \"http://www.breitbart.com/article.php?id=CNG.7e6cab4fec704a0fdd135ecdac00673b.9c1&show_article=1\" How do you guys feel about this? All of the feedback I've seen is that this would be devastating for the US! Partly since Geithner was taken to the wood shed after he suggested this was a possibility. Why would any SECTREAS even consider a switch to any currency other then the dollar? Lends some credence to him not being qualified for the position.", 
        "intTime": 20090330, 
        "postID": 2, 
        "quote": "Originally posted by crackerjacks61: Seems like in our current economic situation we easily could be. One side of me says there is no way in hell I will use a foreign dollar in my country, then again if the Gov. does it what choice do we have? \"http://www.breitbart.com/article.php?id=CNG.7e6cab4fec704a0fdd135ecdac00673b.9c1&show_article=1\" How do you guys feel about this?", 
        "reply": " All of the feedback I've seen is that this would be devastating for the US! Partly since Geithner was taken to the wood shed after he suggested this was a possibility. Why would any SECTREAS even consider a switch to any currency other then the dollar? Lends some credence to him not being qualified for the position.", 
        "threadID": "672198221_1920083912001", 
        "time": "2009-03-30 17:15:00", 
        "title": "Could the US Be Backed In A Corner For World Currency?", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: quote: Originally posted by crackerjacks61: Seems like in our current economic situation we easily could be. One side of me says there is no way in hell I will use a foreign dollar in my country, then again if the Gov. does it what choice do we have? \"http://www.breitbart.com/article.php?id=CNG.7e6cab4fec704a0fdd135ecdac00673b.9c1&show_article=1\" How do you guys feel about this? All of the feedback I've seen is that this would be devastating for the US! Partly since Geithner was taken to the wood shed after he suggested this was a possibility. Why would any SECTREAS even consider a switch to any currency other then the dollar? Lends some credence to him not being qualified for the position. Certainly not qualified to be an American with red white and blue blood. You would think that that would be a minimum standard. But despie him, again it's the NWO and the elites pushing this stuff.", 
        "intTime": 20090330, 
        "postID": 3, 
        "quote": "Originally posted by busnrete8: quote: Originally posted by crackerjacks61: Seems like in our current economic situation we easily could be. One side of me says there is no way in hell I will use a foreign dollar in my country, then again if the Gov. does it what choice do we have? \"http://www.breitbart.com/article.php?id=CNG.7e6cab4fec704a0fdd135ecdac00673b.9c1&show_article=1\" How do you guys feel about this? All of the feedback I've seen is that this would be devastating for the US! Partly since Geithner was taken to the wood shed after he suggested this was a possibility. Why would any SECTREAS even consider a switch to any currency other then the dollar? Lends some credence to him not being qualified for the position.", 
        "reply": " Certainly not qualified to be an American with red white and blue blood. You would think that that would be a minimum standard. But despie him, again it's the NWO and the elites pushing this stuff.", 
        "threadID": "672198221_1920083912001", 
        "time": "2009-03-30 18:33:00", 
        "title": "Could the US Be Backed In A Corner For World Currency?", 
        "userID": "crackerjacks61"
    }
]