[
    {
        "content": "Soyuz commander Roman Romanenko (left) and flight engineer Frank De Winne monitor cockpit displays during the climb to space Wednesday. quote: Russian Soyuz rocket roared to life and streaked into orbit Wednesday, setting off for the International Space Station in a long-awaited mission to boost the lab's crew from three to six full-time residents. With Apollo 11 moon walker Buzz Aldrin and a throng of dignitaries and well-wishers looking on, the Soyuz TMA-15 spacecraft lifted off at 3:34 a.m. PDT and quickly climbed away from the sprawling Baikonur Cosmodrome in Kazakhstan. Live television shots from inside the capsule showed Soyuz commander Roman Romanenko, son of a Russian cosmonaut, at the controls in the capsule's center seat. He was flanked on the left by European Space Agency astronaut Frank De Winne of Belgium and on the right by Canadian Space Agency astronaut Robert Thirsk, a shuttle veteran. Nine minutes after liftoff, the Soyuz TMA-15 spacecraft slipped into its planned preliminary orbit and a few minutes later, its solar panels and antennas unfolded and locked in place as planned. Over the next two days, Romanenko will oversee a series of rocket firings designed to bring the spacecraft to within a stone's throw of the space station. If all goes well, the Soyuz capsule will dock at an Earth-facing port on the front end of the space station's Russian Zarya module around 5:36 a.m. PDT Friday. Waiting to welcome their new crewmates aboard will be Expedition 20 commander Gennady Padalka, NASA physician-astronaut Michael Barratt, and Japanese astronaut Koichi Wakata. (....) +http://news.cnet.com/8301-19514_3-10249894-239.html \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090527, 
        "postID": 1, 
        "quote": "Russian Soyuz rocket roared to life and streaked into orbit Wednesday, setting off for the International Space Station in a long-awaited mission to boost the lab's crew from three to six full-time residents. With Apollo 11 moon walker Buzz Aldrin and a throng of dignitaries and well-wishers looking on, the Soyuz TMA-15 spacecraft lifted off at 3:34 a.m. PDT and quickly climbed away from the sprawling Baikonur Cosmodrome in Kazakhstan. Live television shots from inside the capsule showed Soyuz commander Roman Romanenko, son of a Russian cosmonaut, at the controls in the capsule's center seat. He was flanked on the left by European Space Agency astronaut Frank De Winne of Belgium and on the right by Canadian Space Agency astronaut Robert Thirsk, a shuttle veteran. Nine minutes after liftoff, the Soyuz TMA-15 spacecraft slipped into its planned preliminary orbit and a few minutes later, its solar panels and antennas unfolded and locked in place as planned. Over the next two days, Romanenko will oversee a series of rocket firings designed to bring the spacecraft to within a stone's throw of the space station. If all goes well, the Soyuz capsule will dock at an Earth-facing port on the front end of the space station's Russian Zarya module around 5:36 a.m. PDT Friday. Waiting to welcome their new crewmates aboard will be Expedition 20 commander Gennady Padalka, NASA physician-astronaut Michael Barratt, and Japanese astronaut Koichi Wakata. (....)", 
        "reply": "Soyuz commander Roman Romanenko (left) and flight engineer Frank De Winne monitor cockpit displays during the climb to space Wednesday.  +http://news.cnet.com/8301-19514_3-10249894-239.html \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_4020024422001", 
        "time": "2009-05-27 12:03:00", 
        "title": "Soyuz blasts off on key flight to space station", 
        "userID": "NSNN"
    }
]