[
    {
        "content": "\"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" A lot of folks are always saying they like to keep it real, that they want authenticity and straight talk. Yet when someone actually does it, there is hell to pay. Welcome to the world of Miss California, Carrie Prejean, who, since she answered a question regarding same-sex marriage in Sunday's Miss USA pageant, has been savagely attacked by those who oppose what she had to say. Leading the burn-her-at-the-stake parade is media opportunist Perez Hilton, the self-described gossip queen, and the individual who kick-started this controversy by asking the initial question as to whether the issue of same-sex marriage should be left up to the states. It seems that Hilton, who is gay, was none too pleased that Prejean chose to actually give her personal opinion on the issue, and ripped her on his blog after the show, using crude obscenities as he continued to attack her at every turn on his media blitz. Hey, Hilton, from a real journalist to a wanna-be who traffics in gossip: Never ask a question if you're unprepared for the answer! Frankly, this whole story is pretty stupid. Isn't the whole point of asking a question to get someone's true feelings, rather than the plastic and superficial answers we are all used to receiving? Sure, Prejean could have gone the safe route and given one of those answers that reveal nothing and is hard to decipher -- you know, the ones politicians give all the time -- but no! She actually gave her real opinion, and is now being torn to shreds for it. She opposes same-sex marriage. OK, fine. So what if she had said, \"Hey, I'm in full support of same-sex marriage.\" Would she now be celebrated on gay-focused blogs, magazines and Web sites? Would her detractors actually be saying how open she is and that she's a great person? Same-sex marriage is undoubtedly a hot button issue. And being from California, the site of Proposition 8, the ballot initiative that voters approved outlawing same-sex marriage, Prejean has surely had to hear the debate go back and forth. But her remark isn't outside the mainstream. A CNN/Opinion Research Corp. poll shows that 55 percent of Americans are against same-sex marriage, and Proposition 8 did pass in her state 52-48 percent. What's interesting about this is that many of the same folks who are slamming her for her remark voted for President Obama and Vice President Joe Biden, who both have the same belief: that marriage should be between a man and a woman. Even Secretary of State Hillary Clinton made it clear that she has the same view, and it was her husband, President Bill Clinton, who signed the In Defense of Marriage Act, the federal law that forbids states from having to recognize gay marriage in other states. In other words, four of the biggest liberals in the country have the same belief as Prejean, but a beauty pageant winner is being torn to shreds. Hello, hypocrisy! Those who criticize Prejean have the same right as she does to express their viewpoints. But enough with all the political correctness, where someone says she should have danced around the issue, smiled and move on. At the end of the day, we all have to be true to ourselves. Whether it's a gay gossip writer who favors same-sex marriage or a heterosexual woman who is against same-sex marriage. The day we condemn folks for speaking honestly is the day we become a bland society. Now, I have no issue with gay marriage. If it passes, I just don't care. I live in a gay marriage state and I don't care. However, I respect the beliefs of other, both for and against. What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy.", 
        "intTime": 20090422, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" A lot of folks are always saying they like to keep it real, that they want authenticity and straight talk. Yet when someone actually does it, there is hell to pay. Welcome to the world of Miss California, Carrie Prejean, who, since she answered a question regarding same-sex marriage in Sunday's Miss USA pageant, has been savagely attacked by those who oppose what she had to say. Leading the burn-her-at-the-stake parade is media opportunist Perez Hilton, the self-described gossip queen, and the individual who kick-started this controversy by asking the initial question as to whether the issue of same-sex marriage should be left up to the states. It seems that Hilton, who is gay, was none too pleased that Prejean chose to actually give her personal opinion on the issue, and ripped her on his blog after the show, using crude obscenities as he continued to attack her at every turn on his media blitz. Hey, Hilton, from a real journalist to a wanna-be who traffics in gossip: Never ask a question if you're unprepared for the answer! Frankly, this whole story is pretty stupid. Isn't the whole point of asking a question to get someone's true feelings, rather than the plastic and superficial answers we are all used to receiving? Sure, Prejean could have gone the safe route and given one of those answers that reveal nothing and is hard to decipher -- you know, the ones politicians give all the time -- but no! She actually gave her real opinion, and is now being torn to shreds for it. She opposes same-sex marriage. OK, fine. So what if she had said, \"Hey, I'm in full support of same-sex marriage.\" Would she now be celebrated on gay-focused blogs, magazines and Web sites? Would her detractors actually be saying how open she is and that she's a great person? Same-sex marriage is undoubtedly a hot button issue. And being from California, the site of Proposition 8, the ballot initiative that voters approved outlawing same-sex marriage, Prejean has surely had to hear the debate go back and forth. But her remark isn't outside the mainstream. A CNN/Opinion Research Corp. poll shows that 55 percent of Americans are against same-sex marriage, and Proposition 8 did pass in her state 52-48 percent. What's interesting about this is that many of the same folks who are slamming her for her remark voted for President Obama and Vice President Joe Biden, who both have the same belief: that marriage should be between a man and a woman. Even Secretary of State Hillary Clinton made it clear that she has the same view, and it was her husband, President Bill Clinton, who signed the In Defense of Marriage Act, the federal law that forbids states from having to recognize gay marriage in other states. In other words, four of the biggest liberals in the country have the same belief as Prejean, but a beauty pageant winner is being torn to shreds. Hello, hypocrisy! Those who criticize Prejean have the same right as she does to express their viewpoints. But enough with all the political correctness, where someone says she should have danced around the issue, smiled and move on. At the end of the day, we all have to be true to ourselves. Whether it's a gay gossip writer who favors same-sex marriage or a heterosexual woman who is against same-sex marriage. The day we condemn folks for speaking honestly is the day we become a bland society. Now, I have no issue with gay marriage. If it passes, I just don't care. I live in a gay marriage state and I don't care. However, I respect the beliefs of other, both for and against. What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy.", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 11:55:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Osedax"
    }, 
    {
        "content": "quote: Originally posted by Osedax: \"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy. Everyone on this board who has commented on this story has been supportive of this young lady. What you are doing is simply saying that THIS clown who insulted her speaks for \"Liberals.\" As if posting from some Conservative clown would prove that all Conservatives hold some stupid position. This guy has gotten SO much flack from Liberals that he's been forced to apoligise. Dave", 
        "intTime": 20090422, 
        "postID": 2, 
        "quote": "Originally posted by Osedax: \"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy.", 
        "reply": " Everyone on this board who has commented on this story has been supportive of this young lady. What you are doing is simply saying that THIS clown who insulted her speaks for \"Liberals.\" As if posting from some Conservative clown would prove that all Conservatives hold some stupid position. This guy has gotten SO much flack from Liberals that he's been forced to apoligise. Dave", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 12:02:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Grachus"
    }, 
    {
        "content": "Yeah, like Rush Limbaugh and drugs.", 
        "intTime": 20090422, 
        "postID": 3, 
        "quote": "", 
        "reply": "Yeah, like Rush Limbaugh and drugs.", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 12:25:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Osedax: \"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy. Everyone on this board who has commented on this story has been supportive of this young lady. What you are doing is simply saying that THIS clown who insulted her speaks for \"Liberals.\" As if posting from some Conservative clown would prove that all Conservatives hold some stupid position. This guy has gotten SO much flack from Liberals that he's been forced to apoligise. Dave Comments, Like hey she said her real feelings but is a POS. And they left in the msm is tearing her apart.", 
        "intTime": 20090422, 
        "postID": 4, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Osedax: \"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy. Everyone on this board who has commented on this story has been supportive of this young lady. What you are doing is simply saying that THIS clown who insulted her speaks for \"Liberals.\" As if posting from some Conservative clown would prove that all Conservatives hold some stupid position. This guy has gotten SO much flack from Liberals that he's been forced to apoligise. Dave", 
        "reply": " Comments, Like hey she said her real feelings but is a POS. And they left in the msm is tearing her apart.", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 12:48:00", 
        "title": "Liberal hypocrisy", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Comments, Like hey she said her real feelings but is a POS. And they left in the msm is tearing her apart. I challenge you to post a quote from anyone on this board who said that. And while I'm waiting I'll memorise the telephone book. Dave", 
        "intTime": 20090422, 
        "postID": 5, 
        "quote": "Originally posted by GunnyRet03: Comments, Like hey she said her real feelings but is a POS. And they left in the msm is tearing her apart.", 
        "reply": " I challenge you to post a quote from anyone on this board who said that. And while I'm waiting I'll memorise the telephone book. Dave", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 12:50:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Grachus"
    }, 
    {
        "content": "It's a frakkin' Beauty Pagent fer crissakes! Who the heck cares! It means absolutely nothing, whoever wins! Sheesh! I think this nation has more important concerns that a bunch of whiney primadonnas who probably will never accomplish anything of greater import than this meaningless contest! Get a life! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090422, 
        "postID": 6, 
        "quote": "", 
        "reply": "It's a frakkin' Beauty Pagent fer crissakes! Who the heck cares! It means absolutely nothing, whoever wins! Sheesh! I think this nation has more important concerns that a bunch of whiney primadonnas who probably will never accomplish anything of greater import than this meaningless contest! Get a life! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 12:58:00", 
        "title": "Liberal hypocrisy", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by Grachus: [QUOTE]Originally posted by Osedax: \"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" This guy has gotten SO much flack from Liberals that he's been forced to apoligise. Dave There has been no apolgy from him on any station: CNN, Headline talking head, MSNBC or FOX, in point of fact Headline and MSNBC gave him a pat on the back for his comments.", 
        "intTime": 20090422, 
        "postID": 7, 
        "quote": "Originally posted by Grachus: [QUOTE]Originally posted by Osedax: \"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" This guy has gotten SO much flack from Liberals that he's been forced to apoligise. Dave", 
        "reply": " There has been no apolgy from him on any station: CNN, Headline talking head, MSNBC or FOX, in point of fact Headline and MSNBC gave him a pat on the back for his comments.", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 13:03:00", 
        "title": "Liberal hypocrisy", 
        "userID": "8404_8406_9"
    }, 
    {
        "content": "So if I say I dislike group X because a book makes some obscure reference to the \"abomination\" of that group and some other people have (mis)interpreted the words in that book for centuries then I'm right and anyone who says differently is a biased/bigoted/hatemonger? The pageant contestants \"right\" to her opinion is somehow more correct then the pageant judges \"right\" to his opinion? Because one is more vociferous in their \"rightness\" it makes that person more wrong then the other? Admittedly, the one being the most vocal is only making their position more tenuous. Seems that to make a better case for his position, Hilton should have praised her for her convictions....Duh. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090422, 
        "postID": 8, 
        "quote": "", 
        "reply": "So if I say I dislike group X because a book makes some obscure reference to the \"abomination\" of that group and some other people have (mis)interpreted the words in that book for centuries then I'm right and anyone who says differently is a biased/bigoted/hatemonger? The pageant contestants \"right\" to her opinion is somehow more correct then the pageant judges \"right\" to his opinion? Because one is more vociferous in their \"rightness\" it makes that person more wrong then the other? Admittedly, the one being the most vocal is only making their position more tenuous. Seems that to make a better case for his position, Hilton should have praised her for her convictions....Duh. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 13:12:00", 
        "title": "Liberal hypocrisy", 
        "userID": "mmulder67"
    }, 
    {
        "content": "Depends on if your answer was using PC phrasing or your un-biased, own words opinion", 
        "intTime": 20090422, 
        "postID": 9, 
        "quote": "", 
        "reply": "Depends on if your answer was using PC phrasing or your un-biased, own words opinion", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 13:26:00", 
        "title": "Liberal hypocrisy", 
        "userID": "8404_8406_9"
    }, 
    {
        "content": "quote: Originally posted by 8404_8406_9: quote: Originally posted by Grachus: [QUOTE]Originally posted by Osedax: \"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" This guy has gotten SO much flack from Liberals that he's been forced to apoligise. Dave There has been no apolgy from him on any station: CNN, Headline talking head, MSNBC or FOX, in point of fact Headline and MSNBC gave him a pat on the back for his comments. Actually there WAS an apology, but my statement has been over taken by events, and he \"retracted\" his apology \"http://www.kansascity.com/stargazing/story/1153833.html\" I have nothing for respect for the young lady, whose views I disagree with. And I have nothing but contempt for Mr. Hilton, whose views on Gay marriage I do agree with. Clearly she's a far better person then him. But THIS thread is called \"Liberal Hypocrisy,\" and a number of people who support Gay marriage have posted to support Hilton? Nope, they posted to support her. So where's the hypocrisy? Could it be called \"hypocritical\" to take the remarks of one jerk, and then say that, I for examnple, am a hypocrite? Dave", 
        "intTime": 20090422, 
        "postID": 10, 
        "quote": "Originally posted by 8404_8406_9: quote: Originally posted by Grachus: [QUOTE]Originally posted by Osedax: \"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" This guy has gotten SO much flack from Liberals that he's been forced to apoligise. Dave There has been no apolgy from him on any station: CNN, Headline talking head, MSNBC or FOX, in point of fact Headline and MSNBC gave him a pat on the back for his comments.", 
        "reply": " Actually there WAS an apology, but my statement has been over taken by events, and he \"retracted\" his apology \"http://www.kansascity.com/stargazing/story/1153833.html\" I have nothing for respect for the young lady, whose views I disagree with. And I have nothing but contempt for Mr. Hilton, whose views on Gay marriage I do agree with. Clearly she's a far better person then him. But THIS thread is called \"Liberal Hypocrisy,\" and a number of people who support Gay marriage have posted to support Hilton? Nope, they posted to support her. So where's the hypocrisy? Could it be called \"hypocritical\" to take the remarks of one jerk, and then say that, I for examnple, am a hypocrite? Dave", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 13:41:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Grachus"
    }, 
    {
        "content": "How true but the topic was not to you but about vocal biased liberals, i.e News and blogs and in that they (others) are correct. Thier attitude is my way or the wrong way. There is a middle which is disappearing rather fast. I bounce between stations and found that FOX then CNN are more accurate and not swung to either extreme like Headline talking head News or MSNBC.", 
        "intTime": 20090422, 
        "postID": 11, 
        "quote": "", 
        "reply": "How true but the topic was not to you but about vocal biased liberals, i.e News and blogs and in that they (others) are correct. Thier attitude is my way or the wrong way. There is a middle which is disappearing rather fast. I bounce between stations and found that FOX then CNN are more accurate and not swung to either extreme like Headline talking head News or MSNBC.", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 13:50:00", 
        "title": "Liberal hypocrisy", 
        "userID": "8404_8406_9"
    }, 
    {
        "content": "quote: Originally posted by 8404_8406_9: How true but the topic was not to you but about vocal biased liberals, i.e News and blogs and in that they (others) are correct. Thier attitude is my way or the wrong way. There is a middle which is disappearing rather fast. I bounce between stations and found that FOX then CNN are more accurate and not swung to either extreme like Headline talking head News or MSNBC. I don't doubt you can search the net and find \"someone\" bad mouthing this young lady. Heck, I disagree with her views. Are you sure that actual voices are not saying what I said on the thread about her? i.e. \"I disagreed with her but she displayed admirable moral courage in expressing her views?\" My understanding of these questions is that you're supposed to be judged on how articulate you are in your replies, not the content of these replies. Short of saying something truly offensive, like \"*****s should all be stoned,\" that's the position I would take. And what if she had been asked about whether she supports Israel, and she tactfully stated that she opposes Israel's foreign policy, or for that matter supports Israels foreign policy. Would you STILL support her, as I would? It is after all a \"Beauty Contest,\" not a political debate. Dave", 
        "intTime": 20090422, 
        "postID": 12, 
        "quote": "Originally posted by 8404_8406_9: How true but the topic was not to you but about vocal biased liberals, i.e News and blogs and in that they (others) are correct. Thier attitude is my way or the wrong way. There is a middle which is disappearing rather fast. I bounce between stations and found that FOX then CNN are more accurate and not swung to either extreme like Headline talking head News or MSNBC.", 
        "reply": " I don't doubt you can search the net and find \"someone\" bad mouthing this young lady. Heck, I disagree with her views. Are you sure that actual voices are not saying what I said on the thread about her? i.e. \"I disagreed with her but she displayed admirable moral courage in expressing her views?\" My understanding of these questions is that you're supposed to be judged on how articulate you are in your replies, not the content of these replies. Short of saying something truly offensive, like \"*****s should all be stoned,\" that's the position I would take. And what if she had been asked about whether she supports Israel, and she tactfully stated that she opposes Israel's foreign policy, or for that matter supports Israels foreign policy. Would you STILL support her, as I would? It is after all a \"Beauty Contest,\" not a political debate. Dave", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 14:46:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Osedax: What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy. Perez Hilton is a moron.", 
        "intTime": 20090422, 
        "postID": 13, 
        "quote": "Originally posted by Osedax: What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy.", 
        "reply": " Perez Hilton is a moron.", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 14:51:00", 
        "title": "Liberal hypocrisy", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Osedax: What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy. Perez Hilton is a moron. ROFLMAO!", 
        "intTime": 20090422, 
        "postID": 14, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Osedax: What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy. Perez Hilton is a moron.", 
        "reply": " ROFLMAO!", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 14:54:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Grachus"
    }, 
    {
        "content": "Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard...", 
        "intTime": 20090422, 
        "postID": 15, 
        "quote": "", 
        "reply": "Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard...", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 15:01:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard... What is your freaking point? You claim \"Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage\"...BS. All of the \"liberals\" on this board have condemned this jerk, not only for his demeaning language toward this young woman, but for bringing his political agenda into the “beauty contest”. You can back off the right-wing paranoia any old time now.", 
        "intTime": 20090422, 
        "postID": 16, 
        "quote": "Originally posted by Irwin_R_Schyster: Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard...", 
        "reply": " What is your freaking point? You claim \"Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage\"...BS. All of the \"liberals\" on this board have condemned this jerk, not only for his demeaning language toward this young woman, but for bringing his political agenda into the “beauty contest”. You can back off the right-wing paranoia any old time now.", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 15:12:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by Irwin_R_Schyster: Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard... What is your freaking point? You claim \"Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage\"...BS. All of the \"liberals\" on this board have condemned this jerk, not only for his demeaning language toward this young woman, but for bringing his political agenda into the “beauty contest”. You can back off the right-wing paranoia any old time now. Really, really bizzare, how they pretend we don't exist. Dave", 
        "intTime": 20090422, 
        "postID": 17, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by Irwin_R_Schyster: Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard... What is your freaking point? You claim \"Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage\"...BS. All of the \"liberals\" on this board have condemned this jerk, not only for his demeaning language toward this young woman, but for bringing his political agenda into the “beauty contest”. You can back off the right-wing paranoia any old time now.", 
        "reply": " Really, really bizzare, how they pretend we don't exist. Dave", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 15:15:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by Irwin_R_Schyster: Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard... What is your freaking point? You claim \"Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage\"...BS. All of the \"liberals\" on this board have condemned this jerk, not only for his demeaning language toward this young woman, but for bringing his political agenda into the “beauty contest”. You can back off the right-wing paranoia any old time now. Perez Hilton is your typical gay liberal. Just like Dick Cheney or Rush Limbaugh are your typical conservative I suppose... Either way, the national organization for women and other liberal organizations condemned and demanded an apology from Ultimate Fighting Championship chairman Dana White for his comments...they were considered sexist. Yet....When a liberal uses the same exact words as Mr.White did.....SILENCE... Thats my point...and te OP's point...liberal BS.", 
        "intTime": 20090422, 
        "postID": 18, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by Irwin_R_Schyster: Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard... What is your freaking point? You claim \"Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage\"...BS. All of the \"liberals\" on this board have condemned this jerk, not only for his demeaning language toward this young woman, but for bringing his political agenda into the “beauty contest”. You can back off the right-wing paranoia any old time now.", 
        "reply": " Perez Hilton is your typical gay liberal. Just like Dick Cheney or Rush Limbaugh are your typical conservative I suppose... Either way, the national organization for women and other liberal organizations condemned and demanded an apology from Ultimate Fighting Championship chairman Dana White for his comments...they were considered sexist. Yet....When a liberal uses the same exact words as Mr.White did.....SILENCE... Thats my point...and te OP's point...liberal BS.", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 15:18:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Ol_Doc: quote: Originally posted by Irwin_R_Schyster: Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard... What is your freaking point? You claim \"Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage\"...BS. All of the \"liberals\" on this board have condemned this jerk, not only for his demeaning language toward this young woman, but for bringing his political agenda into the “beauty contest”. You can back off the right-wing paranoia any old time now. Perez Hilton is your typical gay liberal. Just like Dick Cheney or Rush Limbaugh are your typical conservative I suppose... Either way, the national organization for women and other liberal organizations condemned and demanded an apology from Ultimate Fighting Championship chairman Dana White for his comments...they were considered sexist. Yet....When a liberal uses the same exact words as Mr.White did.....SILENCE... Thats my point...and te OP's point...liberal BS. Summary of Statement by California NOW quote: So here's my little three-part note to everyone out there: Dear bigots, please start recognizing the inherent human worth of every individual, even those you don't like or understand. Dear oppressed minority group members, please stop using oppressive language about members of other oppressed minority groups. Dear members of majority religious groups, please stop acting like you're part of the oppressed minority. Now of course is an organisation with an agenda. And that agenda is quite limited. Any statement from NOW represnts NOW, not Liberals, not the political left. To quote a great Liberal Spokesperson, who actually posts here: Perez IS a moron. Dave", 
        "intTime": 20090422, 
        "postID": 19, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Ol_Doc: quote: Originally posted by Irwin_R_Schyster: Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard... What is your freaking point? You claim \"Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage\"...BS. All of the \"liberals\" on this board have condemned this jerk, not only for his demeaning language toward this young woman, but for bringing his political agenda into the “beauty contest”. You can back off the right-wing paranoia any old time now. Perez Hilton is your typical gay liberal. Just like Dick Cheney or Rush Limbaugh are your typical conservative I suppose... Either way, the national organization for women and other liberal organizations condemned and demanded an apology from Ultimate Fighting Championship chairman Dana White for his comments...they were considered sexist. Yet....When a liberal uses the same exact words as Mr.White did.....SILENCE... Thats my point...and te OP's point...liberal BS.", 
        "reply": " Summary of Statement by California NOW quote: So here's my little three-part note to everyone out there: Dear bigots, please start recognizing the inherent human worth of every individual, even those you don't like or understand. Dear oppressed minority group members, please stop using oppressive language about members of other oppressed minority groups. Dear members of majority religious groups, please stop acting like you're part of the oppressed minority. Now of course is an organisation with an agenda. And that agenda is quite limited. Any statement from NOW represnts NOW, not Liberals, not the political left. To quote a great Liberal Spokesperson, who actually posts here: Perez IS a moron. Dave", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 15:38:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: It's a frakkin' Beauty Pagent fer crissakes! Who the heck cares! It means absolutely nothing, whoever wins! Sheesh! I think this nation has more important concerns that a bunch of whiney primadonnas who probably will never accomplish anything of greater import than this meaningless contest! Get a life! Glad someone said it, because I didn't even want to have to type it out", 
        "intTime": 20090422, 
        "postID": 20, 
        "quote": "Originally posted by KJ1110: It's a frakkin' Beauty Pagent fer crissakes! Who the heck cares! It means absolutely nothing, whoever wins! Sheesh! I think this nation has more important concerns that a bunch of whiney primadonnas who probably will never accomplish anything of greater import than this meaningless contest! Get a life!", 
        "reply": " Glad someone said it, because I didn't even want to have to type it out", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 15:49:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Grimbo"
    }, 
    {
        "content": "\"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" A lot of folks are always saying they like to keep it real, that they want authenticity and straight talk. Yet when someone actually does it, there is hell to pay. Welcome to the world of Miss California, Carrie Prejean, who, since she answered a question regarding same-sex marriage in Sunday's Miss USA pageant, has been savagely attacked by those who oppose what she had to say. Leading the burn-her-at-the-stake parade is media opportunist Perez Hilton, the self-described gossip queen, and the individual who kick-started this controversy by asking the initial question as to whether the issue of same-sex marriage should be left up to the states. It seems that Hilton, who is gay, was none too pleased that Prejean chose to actually give her personal opinion on the issue, and ripped her on his blog after the show, using crude obscenities as he continued to attack her at every turn on his media blitz. Hey, Hilton, from a real journalist to a wanna-be who traffics in gossip: Never ask a question if you're unprepared for the answer! Frankly, this whole story is pretty stupid. Isn't the whole point of asking a question to get someone's true feelings, rather than the plastic and superficial answers we are all used to receiving? Sure, Prejean could have gone the safe route and given one of those answers that reveal nothing and is hard to decipher -- you know, the ones politicians give all the time -- but no! She actually gave her real opinion, and is now being torn to shreds for it. She opposes same-sex marriage. OK, fine. So what if she had said, \"Hey, I'm in full support of same-sex marriage.\" Would she now be celebrated on gay-focused blogs, magazines and Web sites? Would her detractors actually be saying how open she is and that she's a great person? Same-sex marriage is undoubtedly a hot button issue. And being from California, the site of Proposition 8, the ballot initiative that voters approved outlawing same-sex marriage, Prejean has surely had to hear the debate go back and forth. But her remark isn't outside the mainstream. A CNN/Opinion Research Corp. poll shows that 55 percent of Americans are against same-sex marriage, and Proposition 8 did pass in her state 52-48 percent. What's interesting about this is that many of the same folks who are slamming her for her remark voted for President Obama and Vice President Joe Biden, who both have the same belief: that marriage should be between a man and a woman. Even Secretary of State Hillary Clinton made it clear that she has the same view, and it was her husband, President Bill Clinton, who signed the In Defense of Marriage Act, the federal law that forbids states from having to recognize gay marriage in other states. In other words, four of the biggest liberals in the country have the same belief as Prejean, but a beauty pageant winner is being torn to shreds. Hello, hypocrisy! Those who criticize Prejean have the same right as she does to express their viewpoints. But enough with all the political correctness, where someone says she should have danced around the issue, smiled and move on. At the end of the day, we all have to be true to ourselves. Whether it's a gay gossip writer who favors same-sex marriage or a heterosexual woman who is against same-sex marriage. The day we condemn folks for speaking honestly is the day we become a bland society. Now, I have no issue with gay marriage. If it passes, I just don't care. I live in a gay marriage state and I don't care. However, I respect the beliefs of other, both for and against. What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy.", 
        "intTime": 20090422, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" A lot of folks are always saying they like to keep it real, that they want authenticity and straight talk. Yet when someone actually does it, there is hell to pay. Welcome to the world of Miss California, Carrie Prejean, who, since she answered a question regarding same-sex marriage in Sunday's Miss USA pageant, has been savagely attacked by those who oppose what she had to say. Leading the burn-her-at-the-stake parade is media opportunist Perez Hilton, the self-described gossip queen, and the individual who kick-started this controversy by asking the initial question as to whether the issue of same-sex marriage should be left up to the states. It seems that Hilton, who is gay, was none too pleased that Prejean chose to actually give her personal opinion on the issue, and ripped her on his blog after the show, using crude obscenities as he continued to attack her at every turn on his media blitz. Hey, Hilton, from a real journalist to a wanna-be who traffics in gossip: Never ask a question if you're unprepared for the answer! Frankly, this whole story is pretty stupid. Isn't the whole point of asking a question to get someone's true feelings, rather than the plastic and superficial answers we are all used to receiving? Sure, Prejean could have gone the safe route and given one of those answers that reveal nothing and is hard to decipher -- you know, the ones politicians give all the time -- but no! She actually gave her real opinion, and is now being torn to shreds for it. She opposes same-sex marriage. OK, fine. So what if she had said, \"Hey, I'm in full support of same-sex marriage.\" Would she now be celebrated on gay-focused blogs, magazines and Web sites? Would her detractors actually be saying how open she is and that she's a great person? Same-sex marriage is undoubtedly a hot button issue. And being from California, the site of Proposition 8, the ballot initiative that voters approved outlawing same-sex marriage, Prejean has surely had to hear the debate go back and forth. But her remark isn't outside the mainstream. A CNN/Opinion Research Corp. poll shows that 55 percent of Americans are against same-sex marriage, and Proposition 8 did pass in her state 52-48 percent. What's interesting about this is that many of the same folks who are slamming her for her remark voted for President Obama and Vice President Joe Biden, who both have the same belief: that marriage should be between a man and a woman. Even Secretary of State Hillary Clinton made it clear that she has the same view, and it was her husband, President Bill Clinton, who signed the In Defense of Marriage Act, the federal law that forbids states from having to recognize gay marriage in other states. In other words, four of the biggest liberals in the country have the same belief as Prejean, but a beauty pageant winner is being torn to shreds. Hello, hypocrisy! Those who criticize Prejean have the same right as she does to express their viewpoints. But enough with all the political correctness, where someone says she should have danced around the issue, smiled and move on. At the end of the day, we all have to be true to ourselves. Whether it's a gay gossip writer who favors same-sex marriage or a heterosexual woman who is against same-sex marriage. The day we condemn folks for speaking honestly is the day we become a bland society. Now, I have no issue with gay marriage. If it passes, I just don't care. I live in a gay marriage state and I don't care. However, I respect the beliefs of other, both for and against. What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy.", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 11:55:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Osedax"
    }, 
    {
        "content": "quote: Originally posted by Osedax: \"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy. Everyone on this board who has commented on this story has been supportive of this young lady. What you are doing is simply saying that THIS clown who insulted her speaks for \"Liberals.\" As if posting from some Conservative clown would prove that all Conservatives hold some stupid position. This guy has gotten SO much flack from Liberals that he's been forced to apoligise. Dave", 
        "intTime": 20090422, 
        "postID": 22, 
        "quote": "Originally posted by Osedax: \"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy.", 
        "reply": " Everyone on this board who has commented on this story has been supportive of this young lady. What you are doing is simply saying that THIS clown who insulted her speaks for \"Liberals.\" As if posting from some Conservative clown would prove that all Conservatives hold some stupid position. This guy has gotten SO much flack from Liberals that he's been forced to apoligise. Dave", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 12:02:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Grachus"
    }, 
    {
        "content": "Yeah, like Rush Limbaugh and drugs.", 
        "intTime": 20090422, 
        "postID": 23, 
        "quote": "", 
        "reply": "Yeah, like Rush Limbaugh and drugs.", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 12:25:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Osedax: \"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy. Everyone on this board who has commented on this story has been supportive of this young lady. What you are doing is simply saying that THIS clown who insulted her speaks for \"Liberals.\" As if posting from some Conservative clown would prove that all Conservatives hold some stupid position. This guy has gotten SO much flack from Liberals that he's been forced to apoligise. Dave Comments, Like hey she said her real feelings but is a POS. And they left in the msm is tearing her apart.", 
        "intTime": 20090422, 
        "postID": 24, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Osedax: \"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy. Everyone on this board who has commented on this story has been supportive of this young lady. What you are doing is simply saying that THIS clown who insulted her speaks for \"Liberals.\" As if posting from some Conservative clown would prove that all Conservatives hold some stupid position. This guy has gotten SO much flack from Liberals that he's been forced to apoligise. Dave", 
        "reply": " Comments, Like hey she said her real feelings but is a POS. And they left in the msm is tearing her apart.", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 12:48:00", 
        "title": "Liberal hypocrisy", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: Comments, Like hey she said her real feelings but is a POS. And they left in the msm is tearing her apart. I challenge you to post a quote from anyone on this board who said that. And while I'm waiting I'll memorise the telephone book. Dave", 
        "intTime": 20090422, 
        "postID": 25, 
        "quote": "Originally posted by GunnyRet03: Comments, Like hey she said her real feelings but is a POS. And they left in the msm is tearing her apart.", 
        "reply": " I challenge you to post a quote from anyone on this board who said that. And while I'm waiting I'll memorise the telephone book. Dave", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 12:50:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Grachus"
    }, 
    {
        "content": "It's a frakkin' Beauty Pagent fer crissakes! Who the heck cares! It means absolutely nothing, whoever wins! Sheesh! I think this nation has more important concerns that a bunch of whiney primadonnas who probably will never accomplish anything of greater import than this meaningless contest! Get a life! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "intTime": 20090422, 
        "postID": 26, 
        "quote": "", 
        "reply": "It's a frakkin' Beauty Pagent fer crissakes! Who the heck cares! It means absolutely nothing, whoever wins! Sheesh! I think this nation has more important concerns that a bunch of whiney primadonnas who probably will never accomplish anything of greater import than this meaningless contest! Get a life! It is not our belief or disbelief that can make or unmake the fact. ~ Thomas Paine", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 12:58:00", 
        "title": "Liberal hypocrisy", 
        "userID": "KJ1110"
    }, 
    {
        "content": "quote: Originally posted by Grachus: [QUOTE]Originally posted by Osedax: \"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" This guy has gotten SO much flack from Liberals that he's been forced to apoligise. Dave There has been no apolgy from him on any station: CNN, Headline talking head, MSNBC or FOX, in point of fact Headline and MSNBC gave him a pat on the back for his comments.", 
        "intTime": 20090422, 
        "postID": 27, 
        "quote": "Originally posted by Grachus: [QUOTE]Originally posted by Osedax: \"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" This guy has gotten SO much flack from Liberals that he's been forced to apoligise. Dave", 
        "reply": " There has been no apolgy from him on any station: CNN, Headline talking head, MSNBC or FOX, in point of fact Headline and MSNBC gave him a pat on the back for his comments.", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 13:03:00", 
        "title": "Liberal hypocrisy", 
        "userID": "8404_8406_9"
    }, 
    {
        "content": "So if I say I dislike group X because a book makes some obscure reference to the \"abomination\" of that group and some other people have (mis)interpreted the words in that book for centuries then I'm right and anyone who says differently is a biased/bigoted/hatemonger? The pageant contestants \"right\" to her opinion is somehow more correct then the pageant judges \"right\" to his opinion? Because one is more vociferous in their \"rightness\" it makes that person more wrong then the other? Admittedly, the one being the most vocal is only making their position more tenuous. Seems that to make a better case for his position, Hilton should have praised her for her convictions....Duh. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090422, 
        "postID": 28, 
        "quote": "", 
        "reply": "So if I say I dislike group X because a book makes some obscure reference to the \"abomination\" of that group and some other people have (mis)interpreted the words in that book for centuries then I'm right and anyone who says differently is a biased/bigoted/hatemonger? The pageant contestants \"right\" to her opinion is somehow more correct then the pageant judges \"right\" to his opinion? Because one is more vociferous in their \"rightness\" it makes that person more wrong then the other? Admittedly, the one being the most vocal is only making their position more tenuous. Seems that to make a better case for his position, Hilton should have praised her for her convictions....Duh. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 13:12:00", 
        "title": "Liberal hypocrisy", 
        "userID": "mmulder67"
    }, 
    {
        "content": "Depends on if your answer was using PC phrasing or your un-biased, own words opinion", 
        "intTime": 20090422, 
        "postID": 29, 
        "quote": "", 
        "reply": "Depends on if your answer was using PC phrasing or your un-biased, own words opinion", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 13:26:00", 
        "title": "Liberal hypocrisy", 
        "userID": "8404_8406_9"
    }, 
    {
        "content": "quote: Originally posted by 8404_8406_9: quote: Originally posted by Grachus: [QUOTE]Originally posted by Osedax: \"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" This guy has gotten SO much flack from Liberals that he's been forced to apoligise. Dave There has been no apolgy from him on any station: CNN, Headline talking head, MSNBC or FOX, in point of fact Headline and MSNBC gave him a pat on the back for his comments. Actually there WAS an apology, but my statement has been over taken by events, and he \"retracted\" his apology \"http://www.kansascity.com/stargazing/story/1153833.html\" I have nothing for respect for the young lady, whose views I disagree with. And I have nothing but contempt for Mr. Hilton, whose views on Gay marriage I do agree with. Clearly she's a far better person then him. But THIS thread is called \"Liberal Hypocrisy,\" and a number of people who support Gay marriage have posted to support Hilton? Nope, they posted to support her. So where's the hypocrisy? Could it be called \"hypocritical\" to take the remarks of one jerk, and then say that, I for examnple, am a hypocrite? Dave", 
        "intTime": 20090422, 
        "postID": 30, 
        "quote": "Originally posted by 8404_8406_9: quote: Originally posted by Grachus: [QUOTE]Originally posted by Osedax: \"http://www.cnn.com/2009/POLITICS/04/22/martin.miss.california/index.html\" This guy has gotten SO much flack from Liberals that he's been forced to apoligise. Dave There has been no apolgy from him on any station: CNN, Headline talking head, MSNBC or FOX, in point of fact Headline and MSNBC gave him a pat on the back for his comments.", 
        "reply": " Actually there WAS an apology, but my statement has been over taken by events, and he \"retracted\" his apology \"http://www.kansascity.com/stargazing/story/1153833.html\" I have nothing for respect for the young lady, whose views I disagree with. And I have nothing but contempt for Mr. Hilton, whose views on Gay marriage I do agree with. Clearly she's a far better person then him. But THIS thread is called \"Liberal Hypocrisy,\" and a number of people who support Gay marriage have posted to support Hilton? Nope, they posted to support her. So where's the hypocrisy? Could it be called \"hypocritical\" to take the remarks of one jerk, and then say that, I for examnple, am a hypocrite? Dave", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 13:41:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Grachus"
    }, 
    {
        "content": "How true but the topic was not to you but about vocal biased liberals, i.e News and blogs and in that they (others) are correct. Thier attitude is my way or the wrong way. There is a middle which is disappearing rather fast. I bounce between stations and found that FOX then CNN are more accurate and not swung to either extreme like Headline talking head News or MSNBC.", 
        "intTime": 20090422, 
        "postID": 31, 
        "quote": "", 
        "reply": "How true but the topic was not to you but about vocal biased liberals, i.e News and blogs and in that they (others) are correct. Thier attitude is my way or the wrong way. There is a middle which is disappearing rather fast. I bounce between stations and found that FOX then CNN are more accurate and not swung to either extreme like Headline talking head News or MSNBC.", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 13:50:00", 
        "title": "Liberal hypocrisy", 
        "userID": "8404_8406_9"
    }, 
    {
        "content": "quote: Originally posted by 8404_8406_9: How true but the topic was not to you but about vocal biased liberals, i.e News and blogs and in that they (others) are correct. Thier attitude is my way or the wrong way. There is a middle which is disappearing rather fast. I bounce between stations and found that FOX then CNN are more accurate and not swung to either extreme like Headline talking head News or MSNBC. I don't doubt you can search the net and find \"someone\" bad mouthing this young lady. Heck, I disagree with her views. Are you sure that actual voices are not saying what I said on the thread about her? i.e. \"I disagreed with her but she displayed admirable moral courage in expressing her views?\" My understanding of these questions is that you're supposed to be judged on how articulate you are in your replies, not the content of these replies. Short of saying something truly offensive, like \"*****s should all be stoned,\" that's the position I would take. And what if she had been asked about whether she supports Israel, and she tactfully stated that she opposes Israel's foreign policy, or for that matter supports Israels foreign policy. Would you STILL support her, as I would? It is after all a \"Beauty Contest,\" not a political debate. Dave", 
        "intTime": 20090422, 
        "postID": 32, 
        "quote": "Originally posted by 8404_8406_9: How true but the topic was not to you but about vocal biased liberals, i.e News and blogs and in that they (others) are correct. Thier attitude is my way or the wrong way. There is a middle which is disappearing rather fast. I bounce between stations and found that FOX then CNN are more accurate and not swung to either extreme like Headline talking head News or MSNBC.", 
        "reply": " I don't doubt you can search the net and find \"someone\" bad mouthing this young lady. Heck, I disagree with her views. Are you sure that actual voices are not saying what I said on the thread about her? i.e. \"I disagreed with her but she displayed admirable moral courage in expressing her views?\" My understanding of these questions is that you're supposed to be judged on how articulate you are in your replies, not the content of these replies. Short of saying something truly offensive, like \"*****s should all be stoned,\" that's the position I would take. And what if she had been asked about whether she supports Israel, and she tactfully stated that she opposes Israel's foreign policy, or for that matter supports Israels foreign policy. Would you STILL support her, as I would? It is after all a \"Beauty Contest,\" not a political debate. Dave", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 14:46:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Osedax: What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy. Perez Hilton is a moron.", 
        "intTime": 20090422, 
        "postID": 33, 
        "quote": "Originally posted by Osedax: What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy.", 
        "reply": " Perez Hilton is a moron.", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 14:51:00", 
        "title": "Liberal hypocrisy", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: quote: Originally posted by Osedax: What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy. Perez Hilton is a moron. ROFLMAO!", 
        "intTime": 20090422, 
        "postID": 34, 
        "quote": "Originally posted by mrmixitup: quote: Originally posted by Osedax: What strikes me about this whole situation is how much vitrol the \"liberal\" and \"open minded\" crowd show toward someone who disagrees with them. This animosity and pure hatred from those that are supposed to be the keepers of \"accept that which is different\" group of people is really just pure hypocrisy. Perez Hilton is a moron.", 
        "reply": " ROFLMAO!", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 14:54:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Grachus"
    }, 
    {
        "content": "Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard...", 
        "intTime": 20090422, 
        "postID": 35, 
        "quote": "", 
        "reply": "Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard...", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 15:01:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard... What is your freaking point? You claim \"Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage\"...BS. All of the \"liberals\" on this board have condemned this jerk, not only for his demeaning language toward this young woman, but for bringing his political agenda into the “beauty contest”. You can back off the right-wing paranoia any old time now.", 
        "intTime": 20090422, 
        "postID": 36, 
        "quote": "Originally posted by Irwin_R_Schyster: Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard...", 
        "reply": " What is your freaking point? You claim \"Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage\"...BS. All of the \"liberals\" on this board have condemned this jerk, not only for his demeaning language toward this young woman, but for bringing his political agenda into the “beauty contest”. You can back off the right-wing paranoia any old time now.", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 15:12:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by Irwin_R_Schyster: Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard... What is your freaking point? You claim \"Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage\"...BS. All of the \"liberals\" on this board have condemned this jerk, not only for his demeaning language toward this young woman, but for bringing his political agenda into the “beauty contest”. You can back off the right-wing paranoia any old time now. Really, really bizzare, how they pretend we don't exist. Dave", 
        "intTime": 20090422, 
        "postID": 37, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by Irwin_R_Schyster: Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard... What is your freaking point? You claim \"Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage\"...BS. All of the \"liberals\" on this board have condemned this jerk, not only for his demeaning language toward this young woman, but for bringing his political agenda into the “beauty contest”. You can back off the right-wing paranoia any old time now.", 
        "reply": " Really, really bizzare, how they pretend we don't exist. Dave", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 15:15:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by Irwin_R_Schyster: Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard... What is your freaking point? You claim \"Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage\"...BS. All of the \"liberals\" on this board have condemned this jerk, not only for his demeaning language toward this young woman, but for bringing his political agenda into the “beauty contest”. You can back off the right-wing paranoia any old time now. Perez Hilton is your typical gay liberal. Just like Dick Cheney or Rush Limbaugh are your typical conservative I suppose... Either way, the national organization for women and other liberal organizations condemned and demanded an apology from Ultimate Fighting Championship chairman Dana White for his comments...they were considered sexist. Yet....When a liberal uses the same exact words as Mr.White did.....SILENCE... Thats my point...and te OP's point...liberal BS.", 
        "intTime": 20090422, 
        "postID": 38, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by Irwin_R_Schyster: Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard... What is your freaking point? You claim \"Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage\"...BS. All of the \"liberals\" on this board have condemned this jerk, not only for his demeaning language toward this young woman, but for bringing his political agenda into the “beauty contest”. You can back off the right-wing paranoia any old time now.", 
        "reply": " Perez Hilton is your typical gay liberal. Just like Dick Cheney or Rush Limbaugh are your typical conservative I suppose... Either way, the national organization for women and other liberal organizations condemned and demanded an apology from Ultimate Fighting Championship chairman Dana White for his comments...they were considered sexist. Yet....When a liberal uses the same exact words as Mr.White did.....SILENCE... Thats my point...and te OP's point...liberal BS.", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 15:18:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Ol_Doc: quote: Originally posted by Irwin_R_Schyster: Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard... What is your freaking point? You claim \"Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage\"...BS. All of the \"liberals\" on this board have condemned this jerk, not only for his demeaning language toward this young woman, but for bringing his political agenda into the “beauty contest”. You can back off the right-wing paranoia any old time now. Perez Hilton is your typical gay liberal. Just like Dick Cheney or Rush Limbaugh are your typical conservative I suppose... Either way, the national organization for women and other liberal organizations condemned and demanded an apology from Ultimate Fighting Championship chairman Dana White for his comments...they were considered sexist. Yet....When a liberal uses the same exact words as Mr.White did.....SILENCE... Thats my point...and te OP's point...liberal BS. Summary of Statement by California NOW quote: So here's my little three-part note to everyone out there: Dear bigots, please start recognizing the inherent human worth of every individual, even those you don't like or understand. Dear oppressed minority group members, please stop using oppressive language about members of other oppressed minority groups. Dear members of majority religious groups, please stop acting like you're part of the oppressed minority. Now of course is an organisation with an agenda. And that agenda is quite limited. Any statement from NOW represnts NOW, not Liberals, not the political left. To quote a great Liberal Spokesperson, who actually posts here: Perez IS a moron. Dave", 
        "intTime": 20090422, 
        "postID": 39, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Ol_Doc: quote: Originally posted by Irwin_R_Schyster: Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage, but there is hell to pay when Ultimate Fighting Championship chairman Dana White calls a reporter a \"Dumb B*TCH\" Yup, I agree....liberal hypocrisy... Look up the UFC's Dana White and you will see proof of this ******** double standard... What is your freaking point? You claim \"Its perfectly okay for Liberal darling and spokesman Perez Hilton to call Miss California a \"B*TCH\" and a \"C*nt\" for not supporting same-sex marriage\"...BS. All of the \"liberals\" on this board have condemned this jerk, not only for his demeaning language toward this young woman, but for bringing his political agenda into the “beauty contest”. You can back off the right-wing paranoia any old time now. Perez Hilton is your typical gay liberal. Just like Dick Cheney or Rush Limbaugh are your typical conservative I suppose... Either way, the national organization for women and other liberal organizations condemned and demanded an apology from Ultimate Fighting Championship chairman Dana White for his comments...they were considered sexist. Yet....When a liberal uses the same exact words as Mr.White did.....SILENCE... Thats my point...and te OP's point...liberal BS.", 
        "reply": " Summary of Statement by California NOW quote: So here's my little three-part note to everyone out there: Dear bigots, please start recognizing the inherent human worth of every individual, even those you don't like or understand. Dear oppressed minority group members, please stop using oppressive language about members of other oppressed minority groups. Dear members of majority religious groups, please stop acting like you're part of the oppressed minority. Now of course is an organisation with an agenda. And that agenda is quite limited. Any statement from NOW represnts NOW, not Liberals, not the political left. To quote a great Liberal Spokesperson, who actually posts here: Perez IS a moron. Dave", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 15:38:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by KJ1110: It's a frakkin' Beauty Pagent fer crissakes! Who the heck cares! It means absolutely nothing, whoever wins! Sheesh! I think this nation has more important concerns that a bunch of whiney primadonnas who probably will never accomplish anything of greater import than this meaningless contest! Get a life! Glad someone said it, because I didn't even want to have to type it out", 
        "intTime": 20090422, 
        "postID": 40, 
        "quote": "Originally posted by KJ1110: It's a frakkin' Beauty Pagent fer crissakes! Who the heck cares! It means absolutely nothing, whoever wins! Sheesh! I think this nation has more important concerns that a bunch of whiney primadonnas who probably will never accomplish anything of greater import than this meaningless contest! Get a life!", 
        "reply": " Glad someone said it, because I didn't even want to have to type it out", 
        "threadID": "672198221_5510074122001", 
        "time": "2009-04-22 15:49:00", 
        "title": "Liberal hypocrisy", 
        "userID": "Grimbo"
    }
]