[
    {
        "content": "And India demonstrates its capabilities once again. No wonder the Chinese are starting to get more wary of their neighbour. quote: India launches spy satellite AFP The Polar Satellite Launch Vehicle (PSLV) rocket, carrying a spy satellite as payload, leaves a trail of smoke as it blasts off into space from Sriharikota. India put the Israeli-built spy satellite into orbit Monday, aimed at boosting its defence surveillance capabilities in the aftermath of the Mumbai militant attacks. (AFP/Str) BANGALORE (AFP) – India put an Israeli-built spy satellite into orbit Monday, aimed at boosting its defence surveillance capabilities in the aftermath of the Mumbai militant attacks. (...) India's existing satellites get blinded at night and in the monsoon season. The new acquisition will also provide New Delhi with the capability to track incoming hostile ballistic missiles. India treated Israel like a pariah for decades, but has forged close military links with Tel Aviv in recent years with the Jewish state replacing France in 2007 as its second-largest arms supplier after Russia. ++http://news.yahoo.com/s/afp/20090420/wl_st...xTdny164dEBxg8F", 
        "intTime": 20090420, 
        "postID": 1, 
        "quote": "India launches spy satellite AFP The Polar Satellite Launch Vehicle (PSLV) rocket, carrying a spy satellite as payload, leaves a trail of smoke as it blasts off into space from Sriharikota. India put the Israeli-built spy satellite into orbit Monday, aimed at boosting its defence surveillance capabilities in the aftermath of the Mumbai militant attacks. (AFP/Str) BANGALORE (AFP) – India put an Israeli-built spy satellite into orbit Monday, aimed at boosting its defence surveillance capabilities in the aftermath of the Mumbai militant attacks. (...) India's existing satellites get blinded at night and in the monsoon season. The new acquisition will also provide New Delhi with the capability to track incoming hostile ballistic missiles. India treated Israel like a pariah for decades, but has forged close military links with Tel Aviv in recent years with the Jewish state replacing France in 2007 as its second-largest arms supplier after Russia. ++http://news.yahoo.com/s/afp/20090420/wl_st...xTdny164dEBxg8F", 
        "reply": "And India demonstrates its capabilities once again. No wonder the Chinese are starting to get more wary of their neighbour. ", 
        "threadID": "672198221_4810072122001", 
        "time": "2009-04-20 09:16:00", 
        "title": "India launches spy satellite", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "It would be nice if the people that write articles like this had a clue what they are talking about. The satellite is either a spy satellite or it is used to detect missiles. Those are very different missions that require very different orbits.", 
        "intTime": 20090420, 
        "postID": 2, 
        "quote": "", 
        "reply": "It would be nice if the people that write articles like this had a clue what they are talking about. The satellite is either a spy satellite or it is used to detect missiles. Those are very different missions that require very different orbits.", 
        "threadID": "672198221_4810072122001", 
        "time": "2009-04-20 09:59:00", 
        "title": "India launches spy satellite", 
        "userID": "nspreitler"
    }
]