[
    {
        "content": "Fox's decision not to air President Obama's press conference Wednesday night sheds light on the behind-the-scenes process by which the major TV networks decide to preempt their regular programming at the president's request -- a decision which costs them millions of dollars. The conference, scheduled to air at 8 p.m. ET, will not just be held during prime time, but during the important sweeps period, costing the networks each millions of dollars in ad revenue. One source said Fox would lose $2 million to $3 million by airing the news conference instead of its regular programming. In 2000 Fox did not air a presidential debate and in 2001 it declined a request for airtime by President George W. Bush. ***So Libs can't say it was because it was Obama. They did it to Bush as well.*** Twice this year Fox has rescheduled \"American Idol,\" the highest-rated program on television to make room for an Obama press conference. Wednesday's news conference will be Obama's third in prime time. At the current pace, he is on track to hold one a month. \"http://abcnews.go.com/Business/IndustryInfo/Story?id=7451512&page=2\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090430, 
        "postID": 1, 
        "quote": "", 
        "reply": "Fox's decision not to air President Obama's press conference Wednesday night sheds light on the behind-the-scenes process by which the major TV networks decide to preempt their regular programming at the president's request -- a decision which costs them millions of dollars. The conference, scheduled to air at 8 p.m. ET, will not just be held during prime time, but during the important sweeps period, costing the networks each millions of dollars in ad revenue. One source said Fox would lose $2 million to $3 million by airing the news conference instead of its regular programming. In 2000 Fox did not air a presidential debate and in 2001 it declined a request for airtime by President George W. Bush. ***So Libs can't say it was because it was Obama. They did it to Bush as well.*** Twice this year Fox has rescheduled \"American Idol,\" the highest-rated program on television to make room for an Obama press conference. Wednesday's news conference will be Obama's third in prime time. At the current pace, he is on track to hold one a month. \"http://abcnews.go.com/Business/IndustryInfo/Story?id=7451512&page=2\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 06:46:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Anbar7"
    }, 
    {
        "content": "I don't know who watched it last night, but that crazy question from New York about being humble and enchanted was ridiculous. There were some good questions out there and I think Obama did ok in answering some of them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090430, 
        "postID": 2, 
        "quote": "", 
        "reply": "I don't know who watched it last night, but that crazy question from New York about being humble and enchanted was ridiculous. There were some good questions out there and I think Obama did ok in answering some of them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 06:47:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Can’t let anything or anybody stop us in our never-ending quest for greenbacks! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 3, 
        "quote": "", 
        "reply": "Can’t let anything or anybody stop us in our never-ending quest for greenbacks! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 06:54:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: One source said Fox would lose $2 million to $3 million by airing the news conference instead of its regular programming. Im sure Fox still had more viewers than the other networks. Did he even say anything we havent already heard? Besides, His teleprompter had his whole speech online hours before so why even bother listening to Obama read it. I did see the excerpts on Foxnews channel and is it just me or does anyone else notice how he swaggers like he is God when he is approaching the podium? Kinda Pathetic to watch, all show and now substance. I thought the campaign was over but Iowa already has an office set up for 2012 elections", 
        "intTime": 20090430, 
        "postID": 4, 
        "quote": "One source said Fox would lose $2 million to $3 million by airing the news conference instead of its regular programming.", 
        "reply": " Im sure Fox still had more viewers than the other networks. Did he even say anything we havent already heard? Besides, His teleprompter had his whole speech online hours before so why even bother listening to Obama read it. I did see the excerpts on Foxnews channel and is it just me or does anyone else notice how he swaggers like he is God when he is approaching the podium? Kinda Pathetic to watch, all show and now substance. I thought the campaign was over but Iowa already has an office set up for 2012 elections", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 06:55:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: One source said Fox would lose $2 million to $3 million by airing the news conference instead of its regular programming. Im sure Fox still had more viewers than the other networks. Did he even say anything we havent already heard? Besides, His teleprompter had his whole speech online hours before so why even bother listening to Obama read it. I did see the excerpts on Foxnews channel and is it just me or does anyone else notice how he swaggers like he is God when he is approaching the podium? Kinda Pathetic to watch, all show and now substance. I thought the campaign was over but Iowa already has an office set up for 2012 elections Nobody swaggered or smirked like Shrub and we now have a POTUS who can speak proper english.", 
        "intTime": 20090430, 
        "postID": 5, 
        "quote": "Originally posted by FlankerFlyer: quote: One source said Fox would lose $2 million to $3 million by airing the news conference instead of its regular programming. Im sure Fox still had more viewers than the other networks. Did he even say anything we havent already heard? Besides, His teleprompter had his whole speech online hours before so why even bother listening to Obama read it. I did see the excerpts on Foxnews channel and is it just me or does anyone else notice how he swaggers like he is God when he is approaching the podium? Kinda Pathetic to watch, all show and now substance. I thought the campaign was over but Iowa already has an office set up for 2012 elections", 
        "reply": " Nobody swaggered or smirked like Shrub and we now have a POTUS who can speak proper english.", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 07:15:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Motive25: quote: Originally posted by FlankerFlyer: quote: One source said Fox would lose $2 million to $3 million by airing the news conference instead of its regular programming. Im sure Fox still had more viewers than the other networks. Did he even say anything we havent already heard? Besides, His teleprompter had his whole speech online hours before so why even bother listening to Obama read it. I did see the excerpts on Foxnews channel and is it just me or does anyone else notice how he swaggers like he is God when he is approaching the podium? Kinda Pathetic to watch, all show and now substance. I thought the campaign was over but Iowa already has an office set up for 2012 elections Nobody swaggered or smirked like Shrub and we now have a POTUS who can speak proper english. Don’t mind Flanker when it comes to POTUS. I find it rather suspect that a “Ukrainian” who always takes the Russian side when it comes to international issues (regardless of the issue), displays so much contempt for Obama and somehow thinks he knows what’s best for us! Even more conflicting is the fact that he displayed the same revulsion toward Bush as well. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 6, 
        "quote": "Originally posted by Motive25: quote: Originally posted by FlankerFlyer: quote: One source said Fox would lose $2 million to $3 million by airing the news conference instead of its regular programming. Im sure Fox still had more viewers than the other networks. Did he even say anything we havent already heard? Besides, His teleprompter had his whole speech online hours before so why even bother listening to Obama read it. I did see the excerpts on Foxnews channel and is it just me or does anyone else notice how he swaggers like he is God when he is approaching the podium? Kinda Pathetic to watch, all show and now substance. I thought the campaign was over but Iowa already has an office set up for 2012 elections Nobody swaggered or smirked like Shrub and we now have a POTUS who can speak proper english.", 
        "reply": " Don’t mind Flanker when it comes to POTUS. I find it rather suspect that a “Ukrainian” who always takes the Russian side when it comes to international issues (regardless of the issue), displays so much contempt for Obama and somehow thinks he knows what’s best for us! Even more conflicting is the fact that he displayed the same revulsion toward Bush as well. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 07:26:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "NSNN"
    }, 
    {
        "content": "Are we talking about broadcast Fox or Fox News? I don't know about Fox News, but my local affiliate of Fox did air the press conference in its entirety.", 
        "intTime": 20090430, 
        "postID": 7, 
        "quote": "", 
        "reply": "Are we talking about broadcast Fox or Fox News? I don't know about Fox News, but my local affiliate of Fox did air the press conference in its entirety.", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 07:27:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Jimmy_Tee"
    }, 
    {
        "content": "quote: Originally posted by Jimmy_Tee: Are we talking about broadcast Fox or Fox News? I don't know about Fox News, but my local affiliate of Fox did air the press conference in its entirety. Talking about Fox network, yes the business and cable did air it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090430, 
        "postID": 8, 
        "quote": "Originally posted by Jimmy_Tee: Are we talking about broadcast Fox or Fox News? I don't know about Fox News, but my local affiliate of Fox did air the press conference in its entirety.", 
        "reply": " Talking about Fox network, yes the business and cable did air it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 07:29:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Anbar7"
    }, 
    {
        "content": "I hated to watch Bush on TV and after about 60 seconds of listing to him say hummmmmm about 10 times I would change the channel. Now I hate to watch Obama simply because he tries to baffle everyone with his BS. I change the channel on him after 60 seconds also. If Pelosi is on I don't even stop the remote channel for 1 second.", 
        "intTime": 20090430, 
        "postID": 9, 
        "quote": "", 
        "reply": "I hated to watch Bush on TV and after about 60 seconds of listing to him say hummmmmm about 10 times I would change the channel. Now I hate to watch Obama simply because he tries to baffle everyone with his BS. I change the channel on him after 60 seconds also. If Pelosi is on I don't even stop the remote channel for 1 second.", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 07:35:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by NSNN: Can’t let anything or anybody stop us in our never-ending quest for greenbacks! Last time I checked it was a private sector business not the Presidents personal propaganda TV station on par with Hugo Chavez's \"news\" stations. I think its time to get your priorities in check and drop the ideolgue B.S.", 
        "intTime": 20090430, 
        "postID": 10, 
        "quote": "Originally posted by NSNN: Can’t let anything or anybody stop us in our never-ending quest for greenbacks!", 
        "reply": " Last time I checked it was a private sector business not the Presidents personal propaganda TV station on par with Hugo Chavez's \"news\" stations. I think its time to get your priorities in check and drop the ideolgue B.S.", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 07:43:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: quote: Originally posted by NSNN: Can’t let anything or anybody stop us in our never-ending quest for greenbacks! Last time I checked it was a private sector business not the Presidents personal propaganda TV station on par with Hugo Chavez's \"news\" stations. I think its time to get your priorities in check and drop the ideolgue B.S. Like I’ve said, $$$ above all! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 11, 
        "quote": "Originally posted by NickBrand: quote: Originally posted by NSNN: Can’t let anything or anybody stop us in our never-ending quest for greenbacks! Last time I checked it was a private sector business not the Presidents personal propaganda TV station on par with Hugo Chavez's \"news\" stations. I think its time to get your priorities in check and drop the ideolgue B.S.", 
        "reply": " Like I’ve said, $$$ above all! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 07:48:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I hated to watch Bush on TV and after about 60 seconds of listing to him say hummmmmm about 10 times I would change the channel. Now I hate to watch Obama simply because he tries to baffle everyone with his BS. I change the channel on him after 60 seconds also. If Pelosi is on I don't even stop the remote channel for 1 second. Clicking on any channel with Obama talking and clicking right off again is a waste of the remote battery power.", 
        "intTime": 20090430, 
        "postID": 12, 
        "quote": "Originally posted by Duster6: I hated to watch Bush on TV and after about 60 seconds of listing to him say hummmmmm about 10 times I would change the channel. Now I hate to watch Obama simply because he tries to baffle everyone with his BS. I change the channel on him after 60 seconds also. If Pelosi is on I don't even stop the remote channel for 1 second.", 
        "reply": " Clicking on any channel with Obama talking and clicking right off again is a waste of the remote battery power.", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 08:44:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "On one hand this press conference was a complete waste of time, just garbage. On the other, it is a clear sign of the ONLY capital this administration has: A popular President. The ONLY thing they are doing right is keeping President Obama popular, and therefore reassure the public that he is \"on the job\" and \"getting things done\"....\"Trust us\"", 
        "intTime": 20090430, 
        "postID": 13, 
        "quote": "", 
        "reply": "On one hand this press conference was a complete waste of time, just garbage. On the other, it is a clear sign of the ONLY capital this administration has: A popular President. The ONLY thing they are doing right is keeping President Obama popular, and therefore reassure the public that he is \"on the job\" and \"getting things done\"....\"Trust us\"", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 08:49:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: On one hand this press conference was a complete waste of time, just garbage. On the other, it is a clear sign of the ONLY capital this administration has: A popular President. The ONLY thing they are doing right is keeping President Obama popular, and therefore reassure the public that he is \"on the job\" and \"getting things done\"....\"Trust us\" As opposed to the Republican Party and their new moto: \"We've Got Nothing\"? ...lol", 
        "intTime": 20090430, 
        "postID": 14, 
        "quote": "Originally posted by Irwin_R_Schyster: On one hand this press conference was a complete waste of time, just garbage. On the other, it is a clear sign of the ONLY capital this administration has: A popular President. The ONLY thing they are doing right is keeping President Obama popular, and therefore reassure the public that he is \"on the job\" and \"getting things done\"....\"Trust us\"", 
        "reply": " As opposed to the Republican Party and their new moto: \"We've Got Nothing\"? ...lol", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 08:52:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by Irwin_R_Schyster: On one hand this press conference was a complete waste of time, just garbage. On the other, it is a clear sign of the ONLY capital this administration has: A popular President. The ONLY thing they are doing right is keeping President Obama popular, and therefore reassure the public that he is \"on the job\" and \"getting things done\"....\"Trust us\" As opposed to the Republican Party and their new moto: \"We've Got Nothing\"? ...lol Didn't see that motto anywhere before...? Maybe if they show they have nothing like the empty suit in the Dem party then they will be popular too. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090430, 
        "postID": 15, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by Irwin_R_Schyster: On one hand this press conference was a complete waste of time, just garbage. On the other, it is a clear sign of the ONLY capital this administration has: A popular President. The ONLY thing they are doing right is keeping President Obama popular, and therefore reassure the public that he is \"on the job\" and \"getting things done\"....\"Trust us\" As opposed to the Republican Party and their new moto: \"We've Got Nothing\"? ...lol", 
        "reply": " Didn't see that motto anywhere before...? Maybe if they show they have nothing like the empty suit in the Dem party then they will be popular too. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 08:54:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by NickBrand: quote: Originally posted by NSNN: Can’t let anything or anybody stop us in our never-ending quest for greenbacks! Last time I checked it was a private sector business not the Presidents personal propaganda TV station on par with Hugo Chavez's \"news\" stations. I think its time to get your priorities in check and drop the ideolgue B.S. Like I’ve said, $$$ above all! Maybe he should stop campaigning, and give us a break.", 
        "intTime": 20090430, 
        "postID": 16, 
        "quote": "Originally posted by NSNN: quote: Originally posted by NickBrand: quote: Originally posted by NSNN: Can’t let anything or anybody stop us in our never-ending quest for greenbacks! Last time I checked it was a private sector business not the Presidents personal propaganda TV station on par with Hugo Chavez's \"news\" stations. I think its time to get your priorities in check and drop the ideolgue B.S. Like I’ve said, $$$ above all!", 
        "reply": " Maybe he should stop campaigning, and give us a break.", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 09:08:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "AngryPuppy"
    }, 
    {
        "content": "quote: Originally posted by Motive25: ...we now have a POTUS who can speak proper english. Now that is laughable after watching Obama become speechless the other day when his teleprompter was malfunctioning. At least Bush could carry on a conversation without a teleprompter telling him what to say. \"The World's Finest\"", 
        "intTime": 20090430, 
        "postID": 17, 
        "quote": "Originally posted by Motive25: ...we now have a POTUS who can speak proper english.", 
        "reply": " Now that is laughable after watching Obama become speechless the other day when his teleprompter was malfunctioning. At least Bush could carry on a conversation without a teleprompter telling him what to say. \"The World's Finest\"", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 09:17:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Motive25: ...we now have a POTUS who can speak proper english. Now that is laughable after watching Obama become speechless the other day when his teleprompter was malfunctioning. At least Bush could carry on a conversation without a teleprompter telling him what to say. In Dubya’s case, it would have been better (smarter) if he kept his mouth shut. +www.dubyaspeak.com \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 18, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Motive25: ...we now have a POTUS who can speak proper english. Now that is laughable after watching Obama become speechless the other day when his teleprompter was malfunctioning. At least Bush could carry on a conversation without a teleprompter telling him what to say.", 
        "reply": " In Dubya’s case, it would have been better (smarter) if he kept his mouth shut. +www.dubyaspeak.com \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 09:33:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Nobody swaggered or smirked like Shrub and we now have a POTUS who can speak proper english. You have absolutely positively with out any doubt got to be kidding...", 
        "intTime": 20090430, 
        "postID": 19, 
        "quote": "Nobody swaggered or smirked like Shrub and we now have a POTUS who can speak proper english.", 
        "reply": " You have absolutely positively with out any doubt got to be kidding...", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 09:49:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "ACR26"
    }, 
    {
        "content": "Fox's decision not to air President Obama's press conference Wednesday night sheds light on the behind-the-scenes process by which the major TV networks decide to preempt their regular programming at the president's request -- a decision which costs them millions of dollars. The conference, scheduled to air at 8 p.m. ET, will not just be held during prime time, but during the important sweeps period, costing the networks each millions of dollars in ad revenue. One source said Fox would lose $2 million to $3 million by airing the news conference instead of its regular programming. In 2000 Fox did not air a presidential debate and in 2001 it declined a request for airtime by President George W. Bush. ***So Libs can't say it was because it was Obama. They did it to Bush as well.*** Twice this year Fox has rescheduled \"American Idol,\" the highest-rated program on television to make room for an Obama press conference. Wednesday's news conference will be Obama's third in prime time. At the current pace, he is on track to hold one a month. \"http://abcnews.go.com/Business/IndustryInfo/Story?id=7451512&page=2\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090430, 
        "postID": 20, 
        "quote": "", 
        "reply": "Fox's decision not to air President Obama's press conference Wednesday night sheds light on the behind-the-scenes process by which the major TV networks decide to preempt their regular programming at the president's request -- a decision which costs them millions of dollars. The conference, scheduled to air at 8 p.m. ET, will not just be held during prime time, but during the important sweeps period, costing the networks each millions of dollars in ad revenue. One source said Fox would lose $2 million to $3 million by airing the news conference instead of its regular programming. In 2000 Fox did not air a presidential debate and in 2001 it declined a request for airtime by President George W. Bush. ***So Libs can't say it was because it was Obama. They did it to Bush as well.*** Twice this year Fox has rescheduled \"American Idol,\" the highest-rated program on television to make room for an Obama press conference. Wednesday's news conference will be Obama's third in prime time. At the current pace, he is on track to hold one a month. \"http://abcnews.go.com/Business/IndustryInfo/Story?id=7451512&page=2\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 06:46:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Anbar7"
    }, 
    {
        "content": "I don't know who watched it last night, but that crazy question from New York about being humble and enchanted was ridiculous. There were some good questions out there and I think Obama did ok in answering some of them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090430, 
        "postID": 21, 
        "quote": "", 
        "reply": "I don't know who watched it last night, but that crazy question from New York about being humble and enchanted was ridiculous. There were some good questions out there and I think Obama did ok in answering some of them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 06:47:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Can’t let anything or anybody stop us in our never-ending quest for greenbacks! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 22, 
        "quote": "", 
        "reply": "Can’t let anything or anybody stop us in our never-ending quest for greenbacks! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 06:54:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: One source said Fox would lose $2 million to $3 million by airing the news conference instead of its regular programming. Im sure Fox still had more viewers than the other networks. Did he even say anything we havent already heard? Besides, His teleprompter had his whole speech online hours before so why even bother listening to Obama read it. I did see the excerpts on Foxnews channel and is it just me or does anyone else notice how he swaggers like he is God when he is approaching the podium? Kinda Pathetic to watch, all show and now substance. I thought the campaign was over but Iowa already has an office set up for 2012 elections", 
        "intTime": 20090430, 
        "postID": 23, 
        "quote": "One source said Fox would lose $2 million to $3 million by airing the news conference instead of its regular programming.", 
        "reply": " Im sure Fox still had more viewers than the other networks. Did he even say anything we havent already heard? Besides, His teleprompter had his whole speech online hours before so why even bother listening to Obama read it. I did see the excerpts on Foxnews channel and is it just me or does anyone else notice how he swaggers like he is God when he is approaching the podium? Kinda Pathetic to watch, all show and now substance. I thought the campaign was over but Iowa already has an office set up for 2012 elections", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 06:55:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: One source said Fox would lose $2 million to $3 million by airing the news conference instead of its regular programming. Im sure Fox still had more viewers than the other networks. Did he even say anything we havent already heard? Besides, His teleprompter had his whole speech online hours before so why even bother listening to Obama read it. I did see the excerpts on Foxnews channel and is it just me or does anyone else notice how he swaggers like he is God when he is approaching the podium? Kinda Pathetic to watch, all show and now substance. I thought the campaign was over but Iowa already has an office set up for 2012 elections Nobody swaggered or smirked like Shrub and we now have a POTUS who can speak proper english.", 
        "intTime": 20090430, 
        "postID": 24, 
        "quote": "Originally posted by FlankerFlyer: quote: One source said Fox would lose $2 million to $3 million by airing the news conference instead of its regular programming. Im sure Fox still had more viewers than the other networks. Did he even say anything we havent already heard? Besides, His teleprompter had his whole speech online hours before so why even bother listening to Obama read it. I did see the excerpts on Foxnews channel and is it just me or does anyone else notice how he swaggers like he is God when he is approaching the podium? Kinda Pathetic to watch, all show and now substance. I thought the campaign was over but Iowa already has an office set up for 2012 elections", 
        "reply": " Nobody swaggered or smirked like Shrub and we now have a POTUS who can speak proper english.", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 07:15:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Motive25: quote: Originally posted by FlankerFlyer: quote: One source said Fox would lose $2 million to $3 million by airing the news conference instead of its regular programming. Im sure Fox still had more viewers than the other networks. Did he even say anything we havent already heard? Besides, His teleprompter had his whole speech online hours before so why even bother listening to Obama read it. I did see the excerpts on Foxnews channel and is it just me or does anyone else notice how he swaggers like he is God when he is approaching the podium? Kinda Pathetic to watch, all show and now substance. I thought the campaign was over but Iowa already has an office set up for 2012 elections Nobody swaggered or smirked like Shrub and we now have a POTUS who can speak proper english. Don’t mind Flanker when it comes to POTUS. I find it rather suspect that a “Ukrainian” who always takes the Russian side when it comes to international issues (regardless of the issue), displays so much contempt for Obama and somehow thinks he knows what’s best for us! Even more conflicting is the fact that he displayed the same revulsion toward Bush as well. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 25, 
        "quote": "Originally posted by Motive25: quote: Originally posted by FlankerFlyer: quote: One source said Fox would lose $2 million to $3 million by airing the news conference instead of its regular programming. Im sure Fox still had more viewers than the other networks. Did he even say anything we havent already heard? Besides, His teleprompter had his whole speech online hours before so why even bother listening to Obama read it. I did see the excerpts on Foxnews channel and is it just me or does anyone else notice how he swaggers like he is God when he is approaching the podium? Kinda Pathetic to watch, all show and now substance. I thought the campaign was over but Iowa already has an office set up for 2012 elections Nobody swaggered or smirked like Shrub and we now have a POTUS who can speak proper english.", 
        "reply": " Don’t mind Flanker when it comes to POTUS. I find it rather suspect that a “Ukrainian” who always takes the Russian side when it comes to international issues (regardless of the issue), displays so much contempt for Obama and somehow thinks he knows what’s best for us! Even more conflicting is the fact that he displayed the same revulsion toward Bush as well. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 07:26:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "NSNN"
    }, 
    {
        "content": "Are we talking about broadcast Fox or Fox News? I don't know about Fox News, but my local affiliate of Fox did air the press conference in its entirety.", 
        "intTime": 20090430, 
        "postID": 26, 
        "quote": "", 
        "reply": "Are we talking about broadcast Fox or Fox News? I don't know about Fox News, but my local affiliate of Fox did air the press conference in its entirety.", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 07:27:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Jimmy_Tee"
    }, 
    {
        "content": "quote: Originally posted by Jimmy_Tee: Are we talking about broadcast Fox or Fox News? I don't know about Fox News, but my local affiliate of Fox did air the press conference in its entirety. Talking about Fox network, yes the business and cable did air it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090430, 
        "postID": 27, 
        "quote": "Originally posted by Jimmy_Tee: Are we talking about broadcast Fox or Fox News? I don't know about Fox News, but my local affiliate of Fox did air the press conference in its entirety.", 
        "reply": " Talking about Fox network, yes the business and cable did air it. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 07:29:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Anbar7"
    }, 
    {
        "content": "I hated to watch Bush on TV and after about 60 seconds of listing to him say hummmmmm about 10 times I would change the channel. Now I hate to watch Obama simply because he tries to baffle everyone with his BS. I change the channel on him after 60 seconds also. If Pelosi is on I don't even stop the remote channel for 1 second.", 
        "intTime": 20090430, 
        "postID": 28, 
        "quote": "", 
        "reply": "I hated to watch Bush on TV and after about 60 seconds of listing to him say hummmmmm about 10 times I would change the channel. Now I hate to watch Obama simply because he tries to baffle everyone with his BS. I change the channel on him after 60 seconds also. If Pelosi is on I don't even stop the remote channel for 1 second.", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 07:35:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by NSNN: Can’t let anything or anybody stop us in our never-ending quest for greenbacks! Last time I checked it was a private sector business not the Presidents personal propaganda TV station on par with Hugo Chavez's \"news\" stations. I think its time to get your priorities in check and drop the ideolgue B.S.", 
        "intTime": 20090430, 
        "postID": 29, 
        "quote": "Originally posted by NSNN: Can’t let anything or anybody stop us in our never-ending quest for greenbacks!", 
        "reply": " Last time I checked it was a private sector business not the Presidents personal propaganda TV station on par with Hugo Chavez's \"news\" stations. I think its time to get your priorities in check and drop the ideolgue B.S.", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 07:43:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "NickBrand"
    }, 
    {
        "content": "quote: Originally posted by NickBrand: quote: Originally posted by NSNN: Can’t let anything or anybody stop us in our never-ending quest for greenbacks! Last time I checked it was a private sector business not the Presidents personal propaganda TV station on par with Hugo Chavez's \"news\" stations. I think its time to get your priorities in check and drop the ideolgue B.S. Like I’ve said, $$$ above all! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 30, 
        "quote": "Originally posted by NickBrand: quote: Originally posted by NSNN: Can’t let anything or anybody stop us in our never-ending quest for greenbacks! Last time I checked it was a private sector business not the Presidents personal propaganda TV station on par with Hugo Chavez's \"news\" stations. I think its time to get your priorities in check and drop the ideolgue B.S.", 
        "reply": " Like I’ve said, $$$ above all! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 07:48:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by Duster6: I hated to watch Bush on TV and after about 60 seconds of listing to him say hummmmmm about 10 times I would change the channel. Now I hate to watch Obama simply because he tries to baffle everyone with his BS. I change the channel on him after 60 seconds also. If Pelosi is on I don't even stop the remote channel for 1 second. Clicking on any channel with Obama talking and clicking right off again is a waste of the remote battery power.", 
        "intTime": 20090430, 
        "postID": 31, 
        "quote": "Originally posted by Duster6: I hated to watch Bush on TV and after about 60 seconds of listing to him say hummmmmm about 10 times I would change the channel. Now I hate to watch Obama simply because he tries to baffle everyone with his BS. I change the channel on him after 60 seconds also. If Pelosi is on I don't even stop the remote channel for 1 second.", 
        "reply": " Clicking on any channel with Obama talking and clicking right off again is a waste of the remote battery power.", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 08:44:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "On one hand this press conference was a complete waste of time, just garbage. On the other, it is a clear sign of the ONLY capital this administration has: A popular President. The ONLY thing they are doing right is keeping President Obama popular, and therefore reassure the public that he is \"on the job\" and \"getting things done\"....\"Trust us\"", 
        "intTime": 20090430, 
        "postID": 32, 
        "quote": "", 
        "reply": "On one hand this press conference was a complete waste of time, just garbage. On the other, it is a clear sign of the ONLY capital this administration has: A popular President. The ONLY thing they are doing right is keeping President Obama popular, and therefore reassure the public that he is \"on the job\" and \"getting things done\"....\"Trust us\"", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 08:49:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: On one hand this press conference was a complete waste of time, just garbage. On the other, it is a clear sign of the ONLY capital this administration has: A popular President. The ONLY thing they are doing right is keeping President Obama popular, and therefore reassure the public that he is \"on the job\" and \"getting things done\"....\"Trust us\" As opposed to the Republican Party and their new moto: \"We've Got Nothing\"? ...lol", 
        "intTime": 20090430, 
        "postID": 33, 
        "quote": "Originally posted by Irwin_R_Schyster: On one hand this press conference was a complete waste of time, just garbage. On the other, it is a clear sign of the ONLY capital this administration has: A popular President. The ONLY thing they are doing right is keeping President Obama popular, and therefore reassure the public that he is \"on the job\" and \"getting things done\"....\"Trust us\"", 
        "reply": " As opposed to the Republican Party and their new moto: \"We've Got Nothing\"? ...lol", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 08:52:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by Irwin_R_Schyster: On one hand this press conference was a complete waste of time, just garbage. On the other, it is a clear sign of the ONLY capital this administration has: A popular President. The ONLY thing they are doing right is keeping President Obama popular, and therefore reassure the public that he is \"on the job\" and \"getting things done\"....\"Trust us\" As opposed to the Republican Party and their new moto: \"We've Got Nothing\"? ...lol Didn't see that motto anywhere before...? Maybe if they show they have nothing like the empty suit in the Dem party then they will be popular too. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090430, 
        "postID": 34, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by Irwin_R_Schyster: On one hand this press conference was a complete waste of time, just garbage. On the other, it is a clear sign of the ONLY capital this administration has: A popular President. The ONLY thing they are doing right is keeping President Obama popular, and therefore reassure the public that he is \"on the job\" and \"getting things done\"....\"Trust us\" As opposed to the Republican Party and their new moto: \"We've Got Nothing\"? ...lol", 
        "reply": " Didn't see that motto anywhere before...? Maybe if they show they have nothing like the empty suit in the Dem party then they will be popular too. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 08:54:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by NickBrand: quote: Originally posted by NSNN: Can’t let anything or anybody stop us in our never-ending quest for greenbacks! Last time I checked it was a private sector business not the Presidents personal propaganda TV station on par with Hugo Chavez's \"news\" stations. I think its time to get your priorities in check and drop the ideolgue B.S. Like I’ve said, $$$ above all! Maybe he should stop campaigning, and give us a break.", 
        "intTime": 20090430, 
        "postID": 35, 
        "quote": "Originally posted by NSNN: quote: Originally posted by NickBrand: quote: Originally posted by NSNN: Can’t let anything or anybody stop us in our never-ending quest for greenbacks! Last time I checked it was a private sector business not the Presidents personal propaganda TV station on par with Hugo Chavez's \"news\" stations. I think its time to get your priorities in check and drop the ideolgue B.S. Like I’ve said, $$$ above all!", 
        "reply": " Maybe he should stop campaigning, and give us a break.", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 09:08:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "AngryPuppy"
    }, 
    {
        "content": "quote: Originally posted by Motive25: ...we now have a POTUS who can speak proper english. Now that is laughable after watching Obama become speechless the other day when his teleprompter was malfunctioning. At least Bush could carry on a conversation without a teleprompter telling him what to say. \"The World's Finest\"", 
        "intTime": 20090430, 
        "postID": 36, 
        "quote": "Originally posted by Motive25: ...we now have a POTUS who can speak proper english.", 
        "reply": " Now that is laughable after watching Obama become speechless the other day when his teleprompter was malfunctioning. At least Bush could carry on a conversation without a teleprompter telling him what to say. \"The World's Finest\"", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 09:17:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by Kegler300: quote: Originally posted by Motive25: ...we now have a POTUS who can speak proper english. Now that is laughable after watching Obama become speechless the other day when his teleprompter was malfunctioning. At least Bush could carry on a conversation without a teleprompter telling him what to say. In Dubya’s case, it would have been better (smarter) if he kept his mouth shut. +www.dubyaspeak.com \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090430, 
        "postID": 37, 
        "quote": "Originally posted by Kegler300: quote: Originally posted by Motive25: ...we now have a POTUS who can speak proper english. Now that is laughable after watching Obama become speechless the other day when his teleprompter was malfunctioning. At least Bush could carry on a conversation without a teleprompter telling him what to say.", 
        "reply": " In Dubya’s case, it would have been better (smarter) if he kept his mouth shut. +www.dubyaspeak.com \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 09:33:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Nobody swaggered or smirked like Shrub and we now have a POTUS who can speak proper english. You have absolutely positively with out any doubt got to be kidding...", 
        "intTime": 20090430, 
        "postID": 38, 
        "quote": "Nobody swaggered or smirked like Shrub and we now have a POTUS who can speak proper english.", 
        "reply": " You have absolutely positively with out any doubt got to be kidding...", 
        "threadID": "672198221_6300051222001", 
        "time": "2009-04-30 09:49:00", 
        "title": "ABC News said that Fox News saved $2-$3 Million by not airing Obama last night", 
        "userID": "ACR26"
    }
]