[
    {
        "content": "On Friday a group of about 8 officers (all majors) including myself were interviewed as part of an internet radio show. We were led to believe that the show would be no more than a Q and A about the local area and what it had to offer. This could not have been farther from the truth. He soon started talking about Jane Fonda and his personal feelings about how we should not have invaded Iraq. He asked us the following questions: -Would you go on vacation in Iraq with your family? -Why do we have 70,000 troops in Germany when we have illegal aliens invading our country along the border? Same thing in S. Korea. -Why don't we (US) split Iraq up into three seperate countries? -Why should we keep fighting in Afghanistan? Needless to say the interview was a challenge, but all in all we handled it well. The question is, how does a person in uniform answer such questions about US foreign policy when addressing the media? This message has been edited. Last edited by: chickenhawk75, Sun 12 April 2009 03:22 PM", 
        "intTime": 20090411, 
        "postID": 1, 
        "quote": "", 
        "reply": "On Friday a group of about 8 officers (all majors) including myself were interviewed as part of an internet radio show. We were led to believe that the show would be no more than a Q and A about the local area and what it had to offer. This could not have been farther from the truth. He soon started talking about Jane Fonda and his personal feelings about how we should not have invaded Iraq. He asked us the following questions: -Would you go on vacation in Iraq with your family? -Why do we have 70,000 troops in Germany when we have illegal aliens invading our country along the border? Same thing in S. Korea. -Why don't we (US) split Iraq up into three seperate countries? -Why should we keep fighting in Afghanistan? Needless to say the interview was a challenge, but all in all we handled it well. The question is, how does a person in uniform answer such questions about US foreign policy when addressing the media? This message has been edited. Last edited by: chickenhawk75, Sun 12 April 2009 03:22 PM", 
        "threadID": "672198221_8210084022001", 
        "time": "2009-04-11 19:08:00", 
        "title": "Handling the media", 
        "userID": "chickenhawk75"
    }, 
    {
        "content": "Um, I thought that you said you were a Major. Well, your profile says that you are an O-3 in the Navy. So, you aren't being honest somewhere. Also, your screen name containing the name \"chickenhawk\" kinda gives away a few things about you. But, to answer your question you don't answer those questions because a Major or an O-3 in the Navy doesn't have the time, rank or experience to answer those questions. To say it politely, those questions are above your paygrade. Oh, by the way, this section is for new articles only.", 
        "intTime": 20090411, 
        "postID": 2, 
        "quote": "", 
        "reply": "Um, I thought that you said you were a Major. Well, your profile says that you are an O-3 in the Navy. So, you aren't being honest somewhere. Also, your screen name containing the name \"chickenhawk\" kinda gives away a few things about you. But, to answer your question you don't answer those questions because a Major or an O-3 in the Navy doesn't have the time, rank or experience to answer those questions. To say it politely, those questions are above your paygrade. Oh, by the way, this section is for new articles only.", 
        "threadID": "672198221_8210084022001", 
        "time": "2009-04-11 19:47:00", 
        "title": "Handling the media", 
        "userID": "10Tenths"
    }, 
    {
        "content": "I updated my profile, the questions were directed towards the Army Majors in attendance, not myself. I agree that the questions are well above an 0-4s paygrade, but the question is how do you answer them with out saying it is above your paygrade, the interviewer knows you have an opinion.", 
        "intTime": 20090412, 
        "postID": 3, 
        "quote": "", 
        "reply": "I updated my profile, the questions were directed towards the Army Majors in attendance, not myself. I agree that the questions are well above an 0-4s paygrade, but the question is how do you answer them with out saying it is above your paygrade, the interviewer knows you have an opinion.", 
        "threadID": "672198221_8210084022001", 
        "time": "2009-04-12 08:35:00", 
        "title": "Handling the media", 
        "userID": "chickenhawk75"
    }, 
    {
        "content": "Simple answer is to state that you were informed that the interview was to be about XXXX, and those are the only type of questions that you will entertain. If the interviewer continues, state that since you were misinformed (lied to) about the nature of the interview, that the session is over. Then get up and walk out.", 
        "intTime": 20090412, 
        "postID": 4, 
        "quote": "", 
        "reply": "Simple answer is to state that you were informed that the interview was to be about XXXX, and those are the only type of questions that you will entertain. If the interviewer continues, state that since you were misinformed (lied to) about the nature of the interview, that the session is over. Then get up and walk out.", 
        "threadID": "672198221_8210084022001", 
        "time": "2009-04-12 08:41:00", 
        "title": "Handling the media", 
        "userID": "DragonRider01"
    }, 
    {
        "content": "Yep. Unless you are well informed of what the Pentagon's policies are on those issues, they are not yours to answer.", 
        "intTime": 20090412, 
        "postID": 5, 
        "quote": "", 
        "reply": "Yep. Unless you are well informed of what the Pentagon's policies are on those issues, they are not yours to answer.", 
        "threadID": "672198221_8210084022001", 
        "time": "2009-04-12 10:18:00", 
        "title": "Handling the media", 
        "userID": "10Tenths"
    }, 
    {
        "content": "Just happened upon this thread and wanted to add my 2 cents. Want to say up front, it's a good day for both the US and the US Navy - in rescuing Captain Richard Phillips from his Somali captors. To the point, well I would have to say the majors should've done some homework first by contacting the radio station to get more info on the interview (what angle the radio host was going to take). By the sounds of it, seems the army majors tactifully did their job. Gotta remember, when dealing with the media -- they want to address issues that only gain ratings -- ratings via shock value not in the feel good stories or the positive things in life. As much as I would have wanted to answer the questions from a personal point of view, I would have to agree with dragonrider01 about getting up and leaving.", 
        "intTime": 20090412, 
        "postID": 6, 
        "quote": "", 
        "reply": "Just happened upon this thread and wanted to add my 2 cents. Want to say up front, it's a good day for both the US and the US Navy - in rescuing Captain Richard Phillips from his Somali captors. To the point, well I would have to say the majors should've done some homework first by contacting the radio station to get more info on the interview (what angle the radio host was going to take). By the sounds of it, seems the army majors tactifully did their job. Gotta remember, when dealing with the media -- they want to address issues that only gain ratings -- ratings via shock value not in the feel good stories or the positive things in life. As much as I would have wanted to answer the questions from a personal point of view, I would have to agree with dragonrider01 about getting up and leaving.", 
        "threadID": "672198221_8210084022001", 
        "time": "2009-04-12 11:39:00", 
        "title": "Handling the media", 
        "userID": "13555562"
    }, 
    {
        "content": "What internet radio show was this?", 
        "intTime": 20090412, 
        "postID": 7, 
        "quote": "", 
        "reply": "What internet radio show was this?", 
        "threadID": "672198221_8210084022001", 
        "time": "2009-04-12 11:42:00", 
        "title": "Handling the media", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by chickenhawk75: On Friday a group of about 8 officers (all majors) including myself were interviewed as part of an internet radio show. We were led to believe that the show would be no more than a Q and A about the local area and what it had to offer. This could not have been farther from the truth. He soon started talking about Jane Fonda and his personal feelings about how we should not have invaded Iraq. He asked us the following questions: -Would you go on vacation in Iraq with your family? -Why do we have 70,000 troops in Germany when we have illegal aliens invading our country along the border? Same thing in S. Korea. -Why don't we (US) split Iraq up into three seperate countries? -Why should we keep fighting in Afghanastan? Needless to say the interview was a challenge, but all in all we handled it well. The question is, how does a person in uniform answer such questions about US foreign policy when addressing the media? You don't answer questions like that. It is that simple, and if you are an O-4 you should know that. I would also think an O-4 would know how to spell Afghanistan.", 
        "intTime": 20090412, 
        "postID": 8, 
        "quote": "Originally posted by chickenhawk75: On Friday a group of about 8 officers (all majors) including myself were interviewed as part of an internet radio show. We were led to believe that the show would be no more than a Q and A about the local area and what it had to offer. This could not have been farther from the truth. He soon started talking about Jane Fonda and his personal feelings about how we should not have invaded Iraq. He asked us the following questions: -Would you go on vacation in Iraq with your family? -Why do we have 70,000 troops in Germany when we have illegal aliens invading our country along the border? Same thing in S. Korea. -Why don't we (US) split Iraq up into three seperate countries? -Why should we keep fighting in Afghanastan? Needless to say the interview was a challenge, but all in all we handled it well. The question is, how does a person in uniform answer such questions about US foreign policy when addressing the media?", 
        "reply": " You don't answer questions like that. It is that simple, and if you are an O-4 you should know that. I would also think an O-4 would know how to spell Afghanistan.", 
        "threadID": "672198221_8210084022001", 
        "time": "2009-04-12 11:52:00", 
        "title": "Handling the media", 
        "userID": "nspreitler"
    }, 
    {
        "content": "My name is Maj Rob Milan, a CGSC student and I was sitting in the same interview with Joe on Friday. The point he was trying to make is that no matter how innocent an interview may seem, always have your talking points ready to go. We thought we were going to talk about how nice Kansas is. Once the interviews started it turned very political in nature. The host was doing us a favor by having us on the show. He was not hostile but he also asked questions that were of interest to him and his listeners. How do you accommodate an interview like this without throwing out “the above my pay grade”? Ideally you stick to your talking points and try to get your message across, but we we’re severely under prepared for this. That said I learned a lot from this experience.", 
        "intTime": 20090414, 
        "postID": 9, 
        "quote": "", 
        "reply": "My name is Maj Rob Milan, a CGSC student and I was sitting in the same interview with Joe on Friday. The point he was trying to make is that no matter how innocent an interview may seem, always have your talking points ready to go. We thought we were going to talk about how nice Kansas is. Once the interviews started it turned very political in nature. The host was doing us a favor by having us on the show. He was not hostile but he also asked questions that were of interest to him and his listeners. How do you accommodate an interview like this without throwing out “the above my pay grade”? Ideally you stick to your talking points and try to get your message across, but we we’re severely under prepared for this. That said I learned a lot from this experience.", 
        "threadID": "672198221_8210084022001", 
        "time": "2009-04-14 11:07:00", 
        "title": "Handling the media", 
        "userID": "17853347"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by chickenhawk75: On Friday a group of about 8 officers (all majors) including myself were interviewed as part of an internet radio show. We were led to believe that the show would be no more than a Q and A about the local area and what it had to offer. This could not have been farther from the truth. He soon started talking about Jane Fonda and his personal feelings about how we should not have invaded Iraq. He asked us the following questions: -Would you go on vacation in Iraq with your family? -Why do we have 70,000 troops in Germany when we have illegal aliens invading our country along the border? Same thing in S. Korea. -Why don't we (US) split Iraq up into three seperate countries? -Why should we keep fighting in Afghanastan? Needless to say the interview was a challenge, but all in all we handled it well. The question is, how does a person in uniform answer such questions about US foreign policy when addressing the media? You don't answer questions like that. It is that simple, and if you are an O-4 you should know that. I would also think an O-4 would know how to spell Afghanistan. LMAO! ding!", 
        "intTime": 20090414, 
        "postID": 10, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by chickenhawk75: On Friday a group of about 8 officers (all majors) including myself were interviewed as part of an internet radio show. We were led to believe that the show would be no more than a Q and A about the local area and what it had to offer. This could not have been farther from the truth. He soon started talking about Jane Fonda and his personal feelings about how we should not have invaded Iraq. He asked us the following questions: -Would you go on vacation in Iraq with your family? -Why do we have 70,000 troops in Germany when we have illegal aliens invading our country along the border? Same thing in S. Korea. -Why don't we (US) split Iraq up into three seperate countries? -Why should we keep fighting in Afghanastan? Needless to say the interview was a challenge, but all in all we handled it well. The question is, how does a person in uniform answer such questions about US foreign policy when addressing the media? You don't answer questions like that. It is that simple, and if you are an O-4 you should know that. I would also think an O-4 would know how to spell Afghanistan.", 
        "reply": " LMAO! ding!", 
        "threadID": "672198221_8210084022001", 
        "time": "2009-04-14 11:14:00", 
        "title": "Handling the media", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by nspreitler: quote: Originally posted by chickenhawk75: On Friday a group of about 8 officers (all majors) including myself were interviewed as part of an internet radio show. We were led to believe that the show would be no more than a Q and A about the local area and what it had to offer. This could not have been farther from the truth. He soon started talking about Jane Fonda and his personal feelings about how we should not have invaded Iraq. He asked us the following questions: -Would you go on vacation in Iraq with your family? -Why do we have 70,000 troops in Germany when we have illegal aliens invading our country along the border? Same thing in S. Korea. -Why don't we (US) split Iraq up into three seperate countries? -Why should we keep fighting in Afghanastan? Needless to say the interview was a challenge, but all in all we handled it well. The question is, how does a person in uniform answer such questions about US foreign policy when addressing the media? You don't answer questions like that. It is that simple, and if you are an O-4 you should know that. I would also think an O-4 would know how to spell Afghanistan. LMAO! ding! Ya know it seems more than a little odd that an active duty 04, regardless of service, would feel the need to turn to an internet chat room for career advice", 
        "intTime": 20090414, 
        "postID": 11, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by nspreitler: quote: Originally posted by chickenhawk75: On Friday a group of about 8 officers (all majors) including myself were interviewed as part of an internet radio show. We were led to believe that the show would be no more than a Q and A about the local area and what it had to offer. This could not have been farther from the truth. He soon started talking about Jane Fonda and his personal feelings about how we should not have invaded Iraq. He asked us the following questions: -Would you go on vacation in Iraq with your family? -Why do we have 70,000 troops in Germany when we have illegal aliens invading our country along the border? Same thing in S. Korea. -Why don't we (US) split Iraq up into three seperate countries? -Why should we keep fighting in Afghanastan? Needless to say the interview was a challenge, but all in all we handled it well. The question is, how does a person in uniform answer such questions about US foreign policy when addressing the media? You don't answer questions like that. It is that simple, and if you are an O-4 you should know that. I would also think an O-4 would know how to spell Afghanistan. LMAO! ding!", 
        "reply": " Ya know it seems more than a little odd that an active duty 04, regardless of service, would feel the need to turn to an internet chat room for career advice", 
        "threadID": "672198221_8210084022001", 
        "time": "2009-04-14 12:41:00", 
        "title": "Handling the media", 
        "userID": "adminnco1"
    }, 
    {
        "content": "Can't locate it but under UCMJ officers especially in a group would be breaking regs giving interviews to the media without permission and while on active duty. The author has to be a civilian and without a clue the workings of military SOP.", 
        "intTime": 20090414, 
        "postID": 12, 
        "quote": "", 
        "reply": "Can't locate it but under UCMJ officers especially in a group would be breaking regs giving interviews to the media without permission and while on active duty. The author has to be a civilian and without a clue the workings of military SOP.", 
        "threadID": "672198221_8210084022001", 
        "time": "2009-04-14 13:01:00", 
        "title": "Handling the media", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "To say true doesn’t matter how media manipulate us. It is important how audience is able to find out where and what is true. Interview was really interesting and I would say that if to count as training in was awesome. It is because questions were quit gloomy and not related to military but more to political life. The journalists are never interested what is going on fine and good. People are paying for good time and their job to give for audience good time in air. They are doing it. I am glad that we had possibility to be there and sometimes I am lucky that my English is poor. God bless good people in America. Alexander but unfortunately not Great . 3B is cool.", 
        "intTime": 20090414, 
        "postID": 13, 
        "quote": "", 
        "reply": "To say true doesn’t matter how media manipulate us. It is important how audience is able to find out where and what is true. Interview was really interesting and I would say that if to count as training in was awesome. It is because questions were quit gloomy and not related to military but more to political life. The journalists are never interested what is going on fine and good. People are paying for good time and their job to give for audience good time in air. They are doing it. I am glad that we had possibility to be there and sometimes I am lucky that my English is poor. God bless good people in America. Alexander but unfortunately not Great . 3B is cool.", 
        "threadID": "672198221_8210084022001", 
        "time": "2009-04-14 20:03:00", 
        "title": "Handling the media", 
        "userID": "AlexanderbutnotGreat"
    }, 
    {
        "content": "Well I see this has gotten interesting. I am attending the Command and General Staff College. The original author is a LtCdr in the US Navy who is here with me attending the Command and General Staff College at Ft Leavenworth, KS. This appearance on the radio talk show was a school approved media apearance where eight O-4s (not all Army but all O-4s) appeared on a radio talk show. The idea is for us CGSC students to get out into the community and through interaction with local print, radio, and TV media get our points of view to the American people. We are future battlaion commanders so the Army does not want us gun shy of the media or tough interviews. We wanted to get some feed back from others in the military and that is why we are blogging about it on military.com. A couple points about this radio appearance First, I could not disagree more with some of the posts saying that we should have ended the interview and walked out when the questions got hard. The intent was to get our perspectives out to the American people. We would have looked foolish and failed in the intent if we had done that. Some questions could not be answered directly but this was an opportunity to redirect to similar subjects we could address from our persepectives. Second none of these questions were above our paygrade. We all have deployed numerous times and can address these questions from the perspecitives we have seen. Again redirecting if necessary. We also as mid level Army officers should know what is going on in the world enough to comment, from our perspective, on these topics. Third, we should have gone into the interview a bit more prepared. This is definitely a learning point for all of us. We were given the impression most of the questions would not be policy or polical in nature. But when we got there the questions turned much more difficult. I don't think any one of us will make that mistake again and are better officers for it. I am very intested in constructive feedback from the broader military audiance on this so please keep the comments coming. MAJ Eric Gilge US Army, Command and General Staff College, Staff Group 3B Leavenworth KS", 
        "intTime": 20090415, 
        "postID": 14, 
        "quote": "", 
        "reply": "Well I see this has gotten interesting. I am attending the Command and General Staff College. The original author is a LtCdr in the US Navy who is here with me attending the Command and General Staff College at Ft Leavenworth, KS. This appearance on the radio talk show was a school approved media apearance where eight O-4s (not all Army but all O-4s) appeared on a radio talk show. The idea is for us CGSC students to get out into the community and through interaction with local print, radio, and TV media get our points of view to the American people. We are future battlaion commanders so the Army does not want us gun shy of the media or tough interviews. We wanted to get some feed back from others in the military and that is why we are blogging about it on military.com. A couple points about this radio appearance First, I could not disagree more with some of the posts saying that we should have ended the interview and walked out when the questions got hard. The intent was to get our perspectives out to the American people. We would have looked foolish and failed in the intent if we had done that. Some questions could not be answered directly but this was an opportunity to redirect to similar subjects we could address from our persepectives. Second none of these questions were above our paygrade. We all have deployed numerous times and can address these questions from the perspecitives we have seen. Again redirecting if necessary. We also as mid level Army officers should know what is going on in the world enough to comment, from our perspective, on these topics. Third, we should have gone into the interview a bit more prepared. This is definitely a learning point for all of us. We were given the impression most of the questions would not be policy or polical in nature. But when we got there the questions turned much more difficult. I don't think any one of us will make that mistake again and are better officers for it. I am very intested in constructive feedback from the broader military audiance on this so please keep the comments coming. MAJ Eric Gilge US Army, Command and General Staff College, Staff Group 3B Leavenworth KS", 
        "threadID": "672198221_8210084022001", 
        "time": "2009-04-15 12:35:00", 
        "title": "Handling the media", 
        "userID": "Warrior123"
    }, 
    {
        "content": "quote: Originally posted by chickenhawk75: I updated my profile, the questions were directed towards the Army Majors in attendance, not myself. I agree that the questions are well above an 0-4s paygrade, but the question is how do you answer them with out saying it is above your paygrade, the interviewer knows you have an opinion. You should have halted the interview immediately and walked away. Did you have a Public Affairs Officer present? You should if you are giving an interview.", 
        "intTime": 20090415, 
        "postID": 15, 
        "quote": "Originally posted by chickenhawk75: I updated my profile, the questions were directed towards the Army Majors in attendance, not myself. I agree that the questions are well above an 0-4s paygrade, but the question is how do you answer them with out saying it is above your paygrade, the interviewer knows you have an opinion.", 
        "reply": " You should have halted the interview immediately and walked away. Did you have a Public Affairs Officer present? You should if you are giving an interview.", 
        "threadID": "672198221_8210084022001", 
        "time": "2009-04-15 12:41:00", 
        "title": "Handling the media", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "I am another one of the eight interviewed on the radio show on 10 April. Although my colleague “Warrior123” has some good points, in some ways, I disagree with the comment regarding interview preparation. Certainly, being completely prepared for an interview is ideal, but that will not always be the case. Thinking on your feet during this low-threat type show was a good experience and perhaps served as practice for the countless more ad-lib interview opportunities that we will certainly face as more senior officers. The host was not hostile in any way towards the military. The questions he asked, although some were more difficult than others, were basic questions that he and other Americans have regarding the military. I thought that all eight spoke of their various experiences without crossing any political opinion lines. Since so little of the American population has or ever will serve in the military, most will never truly understand what it is like to serve in combat overseas. The countless questions of the details of Iraq, Afghanistan and the like is nothing more that a quest for knowledge, both from the host and perhaps his listeners. Of course, there were many “what do you think about…” questions that the host asked, that lured us into stating some personal opinions about U.S. policies. The great thing about radio though, is that the viewers don’t see the facial expressions made while formulating an answer to a tough question. The few seconds spent thinking about the best answer can prevent a regretful response. Bottom line on this radio interview is that the host is interested in learning more about our service as well as giving his listeners the opportunity to learn more about the small percentage of Soldiers, Sailors, Airmen, and Marines serving in the local area. We saw this as a chance to portray the military in a positive light and I think that we did just that. MAJ Scott Lenzmeier US Army, Command and General Staff College, Staff Group 3B Leavenworth KS", 
        "intTime": 20090415, 
        "postID": 16, 
        "quote": "", 
        "reply": "I am another one of the eight interviewed on the radio show on 10 April. Although my colleague “Warrior123” has some good points, in some ways, I disagree with the comment regarding interview preparation. Certainly, being completely prepared for an interview is ideal, but that will not always be the case. Thinking on your feet during this low-threat type show was a good experience and perhaps served as practice for the countless more ad-lib interview opportunities that we will certainly face as more senior officers. The host was not hostile in any way towards the military. The questions he asked, although some were more difficult than others, were basic questions that he and other Americans have regarding the military. I thought that all eight spoke of their various experiences without crossing any political opinion lines. Since so little of the American population has or ever will serve in the military, most will never truly understand what it is like to serve in combat overseas. The countless questions of the details of Iraq, Afghanistan and the like is nothing more that a quest for knowledge, both from the host and perhaps his listeners. Of course, there were many “what do you think about…” questions that the host asked, that lured us into stating some personal opinions about U.S. policies. The great thing about radio though, is that the viewers don’t see the facial expressions made while formulating an answer to a tough question. The few seconds spent thinking about the best answer can prevent a regretful response. Bottom line on this radio interview is that the host is interested in learning more about our service as well as giving his listeners the opportunity to learn more about the small percentage of Soldiers, Sailors, Airmen, and Marines serving in the local area. We saw this as a chance to portray the military in a positive light and I think that we did just that. MAJ Scott Lenzmeier US Army, Command and General Staff College, Staff Group 3B Leavenworth KS", 
        "threadID": "672198221_8210084022001", 
        "time": "2009-04-15 15:48:00", 
        "title": "Handling the media", 
        "userID": "AV8OR64"
    }, 
    {
        "content": "quote: We thought we were going to talk about how nice Kansas is. That's a challenge in it self.", 
        "intTime": 20090416, 
        "postID": 17, 
        "quote": "We thought we were going to talk about how nice Kansas is.", 
        "reply": " That's a challenge in it self.", 
        "threadID": "672198221_8210084022001", 
        "time": "2009-04-16 00:46:00", 
        "title": "Handling the media", 
        "userID": "karlhungusjr"
    }
]