[
    {
        "content": "quote: (Christian Science Monitor, March 25, 2009) After seven years of war, American foreign policy has become nearly synonymous with the brawny side of its military. But the U.S. armed forces may now be moving to show a different face to the world. Last week, Defense Secretary Robert M. Gates recommended an admiral better known for humanitarian and diplomatic initiatives than for muscle-flexing to assume a critical command post in Europe. Adm. James Stavridis is an unusual choice to fill a job usually held by the Army. In his two years overseeing U.S. military operations in South and Latin America, he has built a reputation for running a different kind of command — deploying hospital ships and soccer teams while contending with drug trafficking and corruption. Stavridis may be able to bring that balance to Europe, where deliberations over Afghanistan over the next few years will be critical to that mission’s success. Keeping Gates was one of Obama’s better decisions.", 
        "intTime": 20090325, 
        "postID": 1, 
        "quote": "(Christian Science Monitor, March 25, 2009) After seven years of war, American foreign policy has become nearly synonymous with the brawny side of its military. But the U.S. armed forces may now be moving to show a different face to the world. Last week, Defense Secretary Robert M. Gates recommended an admiral better known for humanitarian and diplomatic initiatives than for muscle-flexing to assume a critical command post in Europe. Adm. James Stavridis is an unusual choice to fill a job usually held by the Army. In his two years overseeing U.S. military operations in South and Latin America, he has built a reputation for running a different kind of command — deploying hospital ships and soccer teams while contending with drug trafficking and corruption. Stavridis may be able to bring that balance to Europe, where deliberations over Afghanistan over the next few years will be critical to that mission’s success.", 
        "reply": " Keeping Gates was one of Obama’s better decisions.", 
        "threadID": "672198221_7040058812001", 
        "time": "2009-03-25 06:30:00", 
        "title": "Pentagon to Show Softer Side to World", 
        "userID": "Knele"
    }
]