[
    {
        "content": "Of course it would be my home state to take the lead Good job Mo! This will set the stage for all of America to follow. A good test base for sure. here is one argument: \"Young people just starting out are going to pay a lot of this tax. They are doing a lot of consuming out there. Whereas people who are a little bit older and have their consumption out of the way are not going to have to pay as much,\" said McGowan. The older folks have also been paying income tax for years plus many younger folks rely on welfare and the give me programs more so than older (just a guess though, seems that way with unwed mothers etc..) \"http://www.ksdk.com/news/local/story.aspx?storyid=173102\"", 
        "intTime": 20090528, 
        "postID": 1, 
        "quote": "", 
        "reply": "Of course it would be my home state to take the lead Good job Mo! This will set the stage for all of America to follow. A good test base for sure. here is one argument: \"Young people just starting out are going to pay a lot of this tax. They are doing a lot of consuming out there. Whereas people who are a little bit older and have their consumption out of the way are not going to have to pay as much,\" said McGowan. The older folks have also been paying income tax for years plus many younger folks rely on welfare and the give me programs more so than older (just a guess though, seems that way with unwed mothers etc..) \"http://www.ksdk.com/news/local/story.aspx?storyid=173102\"", 
        "threadID": "672198221_5840025422001", 
        "time": "2009-05-28 14:50:00", 
        "title": "Missouri Fair Tax Act heads to State Senate", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Of course it would be my home state to take the lead Good job Mo! This will set the stage for all of America to follow. A good test base for sure. here is one argument: \"Young people just starting out are going to pay a lot of this tax. They are doing a lot of consuming out there. Whereas people who are a little bit older and have their consumption out of the way are not going to have to pay as much,\" said McGowan. The older folks have also been paying income tax for years plus many younger folks rely on welfare and the give me programs more so than older (just a guess though, seems that way with unwed mothers etc..) \"http://www.ksdk.com/news/local/story.aspx?storyid=173102\" This tax is going to be an education for you, as the wealthy make out like bandits. Come tax time, the poor are all going to be running to H&R Block, andholding a stack of reciepts for every little purchase. While the really wealthy will be able to do away with preparerd at all. Thier disposable income is so great, they might not even bother filing a return - The poor on the other hand are totally screwed. Dave", 
        "intTime": 20090528, 
        "postID": 2, 
        "quote": "Originally posted by crackerjacks61: Of course it would be my home state to take the lead Good job Mo! This will set the stage for all of America to follow. A good test base for sure. here is one argument: \"Young people just starting out are going to pay a lot of this tax. They are doing a lot of consuming out there. Whereas people who are a little bit older and have their consumption out of the way are not going to have to pay as much,\" said McGowan. The older folks have also been paying income tax for years plus many younger folks rely on welfare and the give me programs more so than older (just a guess though, seems that way with unwed mothers etc..) \"http://www.ksdk.com/news/local/story.aspx?storyid=173102\"", 
        "reply": " This tax is going to be an education for you, as the wealthy make out like bandits. Come tax time, the poor are all going to be running to H&R Block, andholding a stack of reciepts for every little purchase. While the really wealthy will be able to do away with preparerd at all. Thier disposable income is so great, they might not even bother filing a return - The poor on the other hand are totally screwed. Dave", 
        "threadID": "672198221_5840025422001", 
        "time": "2009-05-28 15:19:00", 
        "title": "Missouri Fair Tax Act heads to State Senate", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by crackerjacks61: Of course it would be my home state to take the lead Good job Mo! This will set the stage for all of America to follow. A good test base for sure. here is one argument: \"Young people just starting out are going to pay a lot of this tax. They are doing a lot of consuming out there. Whereas people who are a little bit older and have their consumption out of the way are not going to have to pay as much,\" said McGowan. The older folks have also been paying income tax for years plus many younger folks rely on welfare and the give me programs more so than older (just a guess though, seems that way with unwed mothers etc..) \"http://www.ksdk.com/news/local/story.aspx?storyid=173102\" This tax is going to be an education for you, as the wealthy make out like bandits. Come tax time, the poor are all going to be running to H&R Block, andholding a stack of reciepts for every little purchase. While the really wealthy will be able to do away with preparerd at all. Thier disposable income is so great, they might not even bother filing a return - The poor on the other hand are totally screwed. Dave Dave when has the wealthy not made out like bandits? Any case, let them pass it lets see how it goes.", 
        "intTime": 20090528, 
        "postID": 3, 
        "quote": "Originally posted by Grachus: quote: Originally posted by crackerjacks61: Of course it would be my home state to take the lead Good job Mo! This will set the stage for all of America to follow. A good test base for sure. here is one argument: \"Young people just starting out are going to pay a lot of this tax. They are doing a lot of consuming out there. Whereas people who are a little bit older and have their consumption out of the way are not going to have to pay as much,\" said McGowan. The older folks have also been paying income tax for years plus many younger folks rely on welfare and the give me programs more so than older (just a guess though, seems that way with unwed mothers etc..) \"http://www.ksdk.com/news/local/story.aspx?storyid=173102\" This tax is going to be an education for you, as the wealthy make out like bandits. Come tax time, the poor are all going to be running to H&R Block, andholding a stack of reciepts for every little purchase. While the really wealthy will be able to do away with preparerd at all. Thier disposable income is so great, they might not even bother filing a return - The poor on the other hand are totally screwed. Dave", 
        "reply": " Dave when has the wealthy not made out like bandits? Any case, let them pass it lets see how it goes.", 
        "threadID": "672198221_5840025422001", 
        "time": "2009-05-28 15:51:00", 
        "title": "Missouri Fair Tax Act heads to State Senate", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "So if you go to the Missouri State Fair you gotta pay a tax? Steve Forbes wanted this on the federal level back in 1996 and he got less respect in the media than Ralph Nader.", 
        "intTime": 20090530, 
        "postID": 4, 
        "quote": "", 
        "reply": "So if you go to the Missouri State Fair you gotta pay a tax? Steve Forbes wanted this on the federal level back in 1996 and he got less respect in the media than Ralph Nader.", 
        "threadID": "672198221_5840025422001", 
        "time": "2009-05-30 01:50:00", 
        "title": "Missouri Fair Tax Act heads to State Senate", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "God bless the great state of Missouri.", 
        "intTime": 20090530, 
        "postID": 5, 
        "quote": "", 
        "reply": "God bless the great state of Missouri.", 
        "threadID": "672198221_5840025422001", 
        "time": "2009-05-30 03:20:00", 
        "title": "Missouri Fair Tax Act heads to State Senate", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by scooter_mech: So if you go to the Missouri State Fair you gotta pay a tax? Steve Forbes wanted this on the federal level back in 1996 and he got less respect in the media than Ralph Nader. Income tax is punishment for working. That is the ONLY thing I agree with Boortz on. Consumption tax is the way it should have been all along.", 
        "intTime": 20090530, 
        "postID": 6, 
        "quote": "Originally posted by scooter_mech: So if you go to the Missouri State Fair you gotta pay a tax? Steve Forbes wanted this on the federal level back in 1996 and he got less respect in the media than Ralph Nader.", 
        "reply": " Income tax is punishment for working. That is the ONLY thing I agree with Boortz on. Consumption tax is the way it should have been all along.", 
        "threadID": "672198221_5840025422001", 
        "time": "2009-05-30 19:21:00", 
        "title": "Missouri Fair Tax Act heads to State Senate", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by scooter_mech: So if you go to the Missouri State Fair you gotta pay a tax? Steve Forbes wanted this on the federal level back in 1996 and he got less respect in the media than Ralph Nader. Income tax is punishment for working. That is the ONLY thing I agree with Boortz on. Consumption tax is the way it should have been all along. Since poor and working people spend every dime that have, this is the perfect solution for the wealthy... Dave", 
        "intTime": 20090530, 
        "postID": 7, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by scooter_mech: So if you go to the Missouri State Fair you gotta pay a tax? Steve Forbes wanted this on the federal level back in 1996 and he got less respect in the media than Ralph Nader. Income tax is punishment for working. That is the ONLY thing I agree with Boortz on. Consumption tax is the way it should have been all along.", 
        "reply": " Since poor and working people spend every dime that have, this is the perfect solution for the wealthy... Dave", 
        "threadID": "672198221_5840025422001", 
        "time": "2009-05-30 19:25:00", 
        "title": "Missouri Fair Tax Act heads to State Senate", 
        "userID": "Grachus"
    }, 
    {
        "content": "Since millions live scot free off of my pay check (and I am not wealthy) seems like the perfect solution for people that work for a living. Wealthy people will stay wealthy no matter what we do or don't do. I HATE getting up and going to work sometimes Dave, so the sorry azz that does not reaps the rewards of my labor, you have to admit, that's not right.", 
        "intTime": 20090530, 
        "postID": 8, 
        "quote": "", 
        "reply": "Since millions live scot free off of my pay check (and I am not wealthy) seems like the perfect solution for people that work for a living. Wealthy people will stay wealthy no matter what we do or don't do. I HATE getting up and going to work sometimes Dave, so the sorry azz that does not reaps the rewards of my labor, you have to admit, that's not right.", 
        "threadID": "672198221_5840025422001", 
        "time": "2009-05-30 19:29:00", 
        "title": "Missouri Fair Tax Act heads to State Senate", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "lets do away with the fed income tax and just have a national tax....... that way everybody pays. Cides this is how PO is going to get by his promise not to raise taxes on the lowly poor. Don't think so? How else is he going to pay for all his programs? One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090530, 
        "postID": 9, 
        "quote": "", 
        "reply": "lets do away with the fed income tax and just have a national tax....... that way everybody pays. Cides this is how PO is going to get by his promise not to raise taxes on the lowly poor. Don't think so? How else is he going to pay for all his programs? One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_5840025422001", 
        "time": "2009-05-30 19:34:00", 
        "title": "Missouri Fair Tax Act heads to State Senate", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Since millions live scot free off of my pay check (and I am not wealthy) seems like the perfect solution for people that work for a living. Wealthy people will stay wealthy no matter what we do or don't do. I HATE getting up and going to work sometimes Dave, so the sorry azz that does not reaps the rewards of my labor, you have to admit, that's not right. Millions of people who work full time get food stamps, other wise they'd be hungry. Millions of people who work full time need help, otherwise they'd be homeless. I've posted a thousand times how much I can't stand welfare. But now, you will indeed get a chance to see how a flat tax works in practice. Crackerjack, you're a great guy. And I don't say that to be patronising. Why you've bought into this flat tax schit is a reflection of how the wealthy today dodge taxes - But you will indeed find out what this crap really means... Dave", 
        "intTime": 20090530, 
        "postID": 10, 
        "quote": "Originally posted by crackerjacks61: Since millions live scot free off of my pay check (and I am not wealthy) seems like the perfect solution for people that work for a living. Wealthy people will stay wealthy no matter what we do or don't do. I HATE getting up and going to work sometimes Dave, so the sorry azz that does not reaps the rewards of my labor, you have to admit, that's not right.", 
        "reply": " Millions of people who work full time get food stamps, other wise they'd be hungry. Millions of people who work full time need help, otherwise they'd be homeless. I've posted a thousand times how much I can't stand welfare. But now, you will indeed get a chance to see how a flat tax works in practice. Crackerjack, you're a great guy. And I don't say that to be patronising. Why you've bought into this flat tax schit is a reflection of how the wealthy today dodge taxes - But you will indeed find out what this crap really means... Dave", 
        "threadID": "672198221_5840025422001", 
        "time": "2009-05-30 19:43:00", 
        "title": "Missouri Fair Tax Act heads to State Senate", 
        "userID": "Grachus"
    }
]