[
    {
        "content": "CSIS’s Anthony Cordesman gave a speech yesterday at the National Defense University where he blasted the defense culture that has produced what he called “the worst run department in our history.” He emailed the speech around and I’d thought I’d reproduce a few of the choicer bits. He said the current “crisis” facing all the services’ procurement and force structure plans, where “we are killing force structure to try to buy new weapons,” is a failure of leadership, not of process. “We talk of “jointness,” but the reality is that each service is involved in an existential battle for resources against the others. We have gone into two wars with no clear plan for conflict termination or for stability operations. We have tried to manage wars through supplementals in the absence of long-term plans, decoupled military operations from nation building, and been so slow to react to the growth of the threat in Afghanistan that we are now losing a war we once thought we had decisively won.” “Some of this can be blamed on what may have been the worst national security team of the postwar era. As someone who thought Robert McNamara represented the nadir in defense leadership, I have to give Donald Rumsfeld credit for being the epitome of a micromanaging bully who scattered snowflakes like dandruff, and with about as much effect. I also have a horrifying sense of déjà vu when I compare McGeorge Bundy and the Rostows to Cheney and our recent national security advisers. There is far too little difference between the “neoconservatives” of Iraq and Afghanistan and the “neoliberals” of Vietnam.” “Year after year, our top civilian and military decision makers came and went letting the under-budgeting of procurement, force plans, and manpower grow. We then found ourselves fighting “long” wars that we took years to fully deploy and budget for, each year asking for supplementals that tacitly assumed we would win in the next year. We were slow to react in Iraq, and took until FY2007 to seriously budget for Afghanistan. In fact, we used the totally predictable inability to precisely predict the cost of war to create a nightmare of unrealistic annual baseline budgets, half thought-out supplementals, and pointless Future Year Defense Plans (FYDPs).” Cordesman said the last thing DOD needs is another commission or study to examine the defense “process.” Rather, what is needed are leaders willing to make tough choices, that means cutting cherished weapons programs, and who are held accountable for their decisions. “There is only one test: what did you do that served the broader national interest of the U.S. successfully during your tour of duty. Not your party, not your ideology, not your service, and not your program.” The crisis befalling DOD is also the product of a complete decoupling of any meaningful strategy and detailed force and procurement plans and honest budgeting. Cordesman had some choice comments on the upcoming QDR, being run on the OSD side by under secretary of defense Michele Flournoy’s policy shop. “If God really hates you, you may end up working on a Quadrennial Defense Review: The most pointless and destructive planning effort imaginable. You will waste two years on a document decoupled from a real world force plan, from an honest set of decisions about manpower or procurement, with no clear budget or FYDP, and with no metrics to measure or determine its success. If God merely dislikes you, you may end up helping your service chief or the Chairman of the Joint Chiefs draft one of those vague, anodyne strategy documents that is all concepts and no plans or execution. If God is totally indifferent, you will end up working on our national strategy and simply be irrelevant.” “Is $533.7 billion in FY2010 and 4.2% of the GNP enough? Enough for what? Our most recent QDR is a morass of half thought-out ideas—many calling for further study or otherwise deferring tangible action. We don’t have a force plan. We don’t have a clearly defined procurement plan. We don’t tie it to end strength goals that are clearly defined and costed. We haven’t provided meaningful budget figures because the FYDP is not tied to the QDR. We haven’t set clear goals to be achieved. We have no metrics.” “Would we be where we are today if we forced the department to tie its strategy to plans and budget, if we demanded metrics, if we required a public annual accounting, and if we held our top leadership fully accountable? Can any change in process or business practices make up for this failure? The answer is no.” This message has been edited. Last edited by: stillkit, Fri 13 March 2009 05:55 PM \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090312, 
        "postID": 1, 
        "quote": "", 
        "reply": "CSIS’s Anthony Cordesman gave a speech yesterday at the National Defense University where he blasted the defense culture that has produced what he called “the worst run department in our history.” He emailed the speech around and I’d thought I’d reproduce a few of the choicer bits. He said the current “crisis” facing all the services’ procurement and force structure plans, where “we are killing force structure to try to buy new weapons,” is a failure of leadership, not of process. “We talk of “jointness,” but the reality is that each service is involved in an existential battle for resources against the others. We have gone into two wars with no clear plan for conflict termination or for stability operations. We have tried to manage wars through supplementals in the absence of long-term plans, decoupled military operations from nation building, and been so slow to react to the growth of the threat in Afghanistan that we are now losing a war we once thought we had decisively won.” “Some of this can be blamed on what may have been the worst national security team of the postwar era. As someone who thought Robert McNamara represented the nadir in defense leadership, I have to give Donald Rumsfeld credit for being the epitome of a micromanaging bully who scattered snowflakes like dandruff, and with about as much effect. I also have a horrifying sense of déjà vu when I compare McGeorge Bundy and the Rostows to Cheney and our recent national security advisers. There is far too little difference between the “neoconservatives” of Iraq and Afghanistan and the “neoliberals” of Vietnam.” “Year after year, our top civilian and military decision makers came and went letting the under-budgeting of procurement, force plans, and manpower grow. We then found ourselves fighting “long” wars that we took years to fully deploy and budget for, each year asking for supplementals that tacitly assumed we would win in the next year. We were slow to react in Iraq, and took until FY2007 to seriously budget for Afghanistan. In fact, we used the totally predictable inability to precisely predict the cost of war to create a nightmare of unrealistic annual baseline budgets, half thought-out supplementals, and pointless Future Year Defense Plans (FYDPs).” Cordesman said the last thing DOD needs is another commission or study to examine the defense “process.” Rather, what is needed are leaders willing to make tough choices, that means cutting cherished weapons programs, and who are held accountable for their decisions. “There is only one test: what did you do that served the broader national interest of the U.S. successfully during your tour of duty. Not your party, not your ideology, not your service, and not your program.” The crisis befalling DOD is also the product of a complete decoupling of any meaningful strategy and detailed force and procurement plans and honest budgeting. Cordesman had some choice comments on the upcoming QDR, being run on the OSD side by under secretary of defense Michele Flournoy’s policy shop. “If God really hates you, you may end up working on a Quadrennial Defense Review: The most pointless and destructive planning effort imaginable. You will waste two years on a document decoupled from a real world force plan, from an honest set of decisions about manpower or procurement, with no clear budget or FYDP, and with no metrics to measure or determine its success. If God merely dislikes you, you may end up helping your service chief or the Chairman of the Joint Chiefs draft one of those vague, anodyne strategy documents that is all concepts and no plans or execution. If God is totally indifferent, you will end up working on our national strategy and simply be irrelevant.” “Is $533.7 billion in FY2010 and 4.2% of the GNP enough? Enough for what? Our most recent QDR is a morass of half thought-out ideas—many calling for further study or otherwise deferring tangible action. We don’t have a force plan. We don’t have a clearly defined procurement plan. We don’t tie it to end strength goals that are clearly defined and costed. We haven’t provided meaningful budget figures because the FYDP is not tied to the QDR. We haven’t set clear goals to be achieved. We have no metrics.” “Would we be where we are today if we forced the department to tie its strategy to plans and budget, if we demanded metrics, if we required a public annual accounting, and if we held our top leadership fully accountable? Can any change in process or business practices make up for this failure? The answer is no.” This message has been edited. Last edited by: stillkit, Fri 13 March 2009 05:55 PM \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_5860056712001", 
        "time": "2009-03-12 11:40:00", 
        "title": "DoD “Worst Run Department”: Cordesman", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: CSIS’s Anthony Cordesman gave a speech yesterday at the National Defense University where he blasted the defense culture that has produced what he called “the worst run department in our history.” He emailed the speech around and I’d thought I’d reproduce a few of the choicer bits. He said the current “crisis” facing all the services’ procurement and force structure plans, where “we are killing force structure to try to buy new weapons,” is a failure of leadership, not of process. “We talk of “jointness,” but the reality is that each service is involved in an existential battle for resources against the others. We have gone into two wars with no clear plan for conflict termination or for stability operations. We have tried to manage wars through supplementals in the absence of long-term plans, decoupled military operations from nation building, and been so slow to react to the growth of the threat in Afghanistan that we are now losing a war we once thought we had decisively won.” “Some of this can be blamed on what may have been the worst national security team of the postwar era. As someone who thought Robert McNamara represented the nadir in defense leadership, I have to give Donald Rumsfeld credit for being the epitome of a micromanaging bully who scattered snowflakes like dandruff, and with about as much effect. I also have a horrifying sense of déjà vu when I compare McGeorge Bundy and the Rostows to Cheney and our recent national security advisers. There is far too little difference between the “neoconservatives” of Iraq and Afghanistan and the “neoliberals” of Vietnam.” “Year after year, our top civilian and military decision makers came and went letting the under-budgeting of procurement, force plans, and manpower grow. We then found ourselves fighting “long” wars that we took years to fully deploy and budget for, each year asking for supplementals that tacitly assumed we would win in the next year. We were slow to react in Iraq, and took until FY2007 to seriously budget for Afghanistan. In fact, we used the totally predictable inability to precisely predict the cost of war to create a nightmare of unrealistic annual baseline budgets, half thought-out supplementals, and pointless Future Year Defense Plans (FYDPs).” Cordesman said the last thing DOD needs is another commission or study to examine the defense “process.” Rather, what is needed are leaders willing to make tough choices, that means cutting cherished weapons programs, and who are held accountable for their decisions. “There is only one test: what did you do that served the broader national interest of the U.S. successfully during your tour of duty. Not your party, not your ideology, not your service, and not your program.” The crisis befalling DOD is also the product of a complete decoupling of any meaningful strategy and detailed force and procurement plans and honest budgeting. Cordesman had some choice comments on the upcoming QDR, being run on the OSD side by under secretary of defense Michele Flournoy’s policy shop. “If God really hates you, you may end up working on a Quadrennial Defense Review: The most pointless and destructive planning effort imaginable. You will waste two years on a document decoupled from a real world force plan, from an honest set of decisions about manpower or procurement, with no clear budget or FYDP, and with no metrics to measure or determine its success. If God merely dislikes you, you may end up helping your service chief or the Chairman of the Joint Chiefs draft one of those vague, anodyne strategy documents that is all concepts and no plans or execution. If God is totally indifferent, you will end up working on our national strategy and simply be irrelevant.” “Is $533.7 billion in FY2010 and 4.2% of the GNP enough? Enough for what? Our most recent QDR is a morass of half thought-out ideas—many calling for further study or otherwise deferring tangible action. We don’t have a force plan. We don’t have a clearly defined procurement plan. We don’t tie it to end strength goals that are clearly defined and costed. We haven’t provided meaningful budget figures because the FYDP is not tied to the QDR. We haven’t set clear goals to be achieved. We have no metrics.” “Would we be where we are today if we forced the department to tie its strategy to plans and budget, if we demanded metrics, if we required a public annual accounting, and if we held our top leadership fully accountable? Can any change in process or business practices make up for this failure? The answer is no.” COMMENT: Tony Cordesman is a long-time, very well-respected and thoughtful, introspective analyst on defense strategy and DoD processes. He has ample grist in various onerous planning and budgetary processes to rail against. This message has been edited. Last edited by: stillkit, Fri 13 March 2009 05:56 PM", 
        "intTime": 20090312, 
        "postID": 2, 
        "quote": "Originally posted by Anbar7: CSIS’s Anthony Cordesman gave a speech yesterday at the National Defense University where he blasted the defense culture that has produced what he called “the worst run department in our history.” He emailed the speech around and I’d thought I’d reproduce a few of the choicer bits. He said the current “crisis” facing all the services’ procurement and force structure plans, where “we are killing force structure to try to buy new weapons,” is a failure of leadership, not of process. “We talk of “jointness,” but the reality is that each service is involved in an existential battle for resources against the others. We have gone into two wars with no clear plan for conflict termination or for stability operations. We have tried to manage wars through supplementals in the absence of long-term plans, decoupled military operations from nation building, and been so slow to react to the growth of the threat in Afghanistan that we are now losing a war we once thought we had decisively won.” “Some of this can be blamed on what may have been the worst national security team of the postwar era. As someone who thought Robert McNamara represented the nadir in defense leadership, I have to give Donald Rumsfeld credit for being the epitome of a micromanaging bully who scattered snowflakes like dandruff, and with about as much effect. I also have a horrifying sense of déjà vu when I compare McGeorge Bundy and the Rostows to Cheney and our recent national security advisers. There is far too little difference between the “neoconservatives” of Iraq and Afghanistan and the “neoliberals” of Vietnam.” “Year after year, our top civilian and military decision makers came and went letting the under-budgeting of procurement, force plans, and manpower grow. We then found ourselves fighting “long” wars that we took years to fully deploy and budget for, each year asking for supplementals that tacitly assumed we would win in the next year. We were slow to react in Iraq, and took until FY2007 to seriously budget for Afghanistan. In fact, we used the totally predictable inability to precisely predict the cost of war to create a nightmare of unrealistic annual baseline budgets, half thought-out supplementals, and pointless Future Year Defense Plans (FYDPs).” Cordesman said the last thing DOD needs is another commission or study to examine the defense “process.” Rather, what is needed are leaders willing to make tough choices, that means cutting cherished weapons programs, and who are held accountable for their decisions. “There is only one test: what did you do that served the broader national interest of the U.S. successfully during your tour of duty. Not your party, not your ideology, not your service, and not your program.” The crisis befalling DOD is also the product of a complete decoupling of any meaningful strategy and detailed force and procurement plans and honest budgeting. Cordesman had some choice comments on the upcoming QDR, being run on the OSD side by under secretary of defense Michele Flournoy’s policy shop. “If God really hates you, you may end up working on a Quadrennial Defense Review: The most pointless and destructive planning effort imaginable. You will waste two years on a document decoupled from a real world force plan, from an honest set of decisions about manpower or procurement, with no clear budget or FYDP, and with no metrics to measure or determine its success. If God merely dislikes you, you may end up helping your service chief or the Chairman of the Joint Chiefs draft one of those vague, anodyne strategy documents that is all concepts and no plans or execution. If God is totally indifferent, you will end up working on our national strategy and simply be irrelevant.” “Is $533.7 billion in FY2010 and 4.2% of the GNP enough? Enough for what? Our most recent QDR is a morass of half thought-out ideas—many calling for further study or otherwise deferring tangible action. We don’t have a force plan. We don’t have a clearly defined procurement plan. We don’t tie it to end strength goals that are clearly defined and costed. We haven’t provided meaningful budget figures because the FYDP is not tied to the QDR. We haven’t set clear goals to be achieved. We have no metrics.” “Would we be where we are today if we forced the department to tie its strategy to plans and budget, if we demanded metrics, if we required a public annual accounting, and if we held our top leadership fully accountable? Can any change in process or business practices make up for this failure? The answer is no.”", 
        "reply": " COMMENT: Tony Cordesman is a long-time, very well-respected and thoughtful, introspective analyst on defense strategy and DoD processes. He has ample grist in various onerous planning and budgetary processes to rail against. This message has been edited. Last edited by: stillkit, Fri 13 March 2009 05:56 PM", 
        "threadID": "672198221_5860056712001", 
        "time": "2009-03-12 15:02:00", 
        "title": "DoD “Worst Run Department”: Cordesman", 
        "userID": "NOVAMarine"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: CSIS’s Anthony Cordesman gave a speech yesterday at the National Defense University where he blasted the defense culture that has produced what he called “the worst run department in our history.” He emailed the speech around and I’d thought I’d reproduce a few of the choicer bits. He said the current “crisis” facing all the services’ procurement and force structure plans, where “we are killing force structure to try to buy new weapons,” is a failure of leadership, not of process. “We talk of “jointness,” but the reality is that each service is involved in an existential battle for resources against the others. We have gone into two wars with no clear plan for conflict termination or for stability operations. We have tried to manage wars through supplementals in the absence of long-term plans, decoupled military operations from nation building, and been so slow to react to the growth of the threat in Afghanistan that we are now losing a war we once thought we had decisively won.” “Some of this can be blamed on what may have been the worst national security team of the postwar era. As someone who thought Robert McNamara represented the nadir in defense leadership, I have to give Donald Rumsfeld credit for being the epitome of a micromanaging bully who scattered snowflakes like dandruff, and with about as much effect. I also have a horrifying sense of déjà vu when I compare McGeorge Bundy and the Rostows to Cheney and our recent national security advisers. There is far too little difference between the “neoconservatives” of Iraq and Afghanistan and the “neoliberals” of Vietnam.” “Year after year, our top civilian and military decision makers came and went letting the under-budgeting of procurement, force plans, and manpower grow. We then found ourselves fighting “long” wars that we took years to fully deploy and budget for, each year asking for supplementals that tacitly assumed we would win in the next year. We were slow to react in Iraq, and took until FY2007 to seriously budget for Afghanistan. In fact, we used the totally predictable inability to precisely predict the cost of war to create a nightmare of unrealistic annual baseline budgets, half thought-out supplementals, and pointless Future Year Defense Plans (FYDPs).” Cordesman said the last thing DOD needs is another commission or study to examine the defense “process.” Rather, what is needed are leaders willing to make tough choices, that means cutting cherished weapons programs, and who are held accountable for their decisions. “There is only one test: what did you do that served the broader national interest of the U.S. successfully during your tour of duty. Not your party, not your ideology, not your service, and not your program.” The crisis befalling DOD is also the product of a complete decoupling of any meaningful strategy and detailed force and procurement plans and honest budgeting. Cordesman had some choice comments on the upcoming QDR, being run on the OSD side by under secretary of defense Michele Flournoy’s policy shop. “If God really hates you, you may end up working on a Quadrennial Defense Review: The most pointless and destructive planning effort imaginable. You will waste two years on a document decoupled from a real world force plan, from an honest set of decisions about manpower or procurement, with no clear budget or FYDP, and with no metrics to measure or determine its success. If God merely dislikes you, you may end up helping your service chief or the Chairman of the Joint Chiefs draft one of those vague, anodyne strategy documents that is all concepts and no plans or execution. If God is totally indifferent, you will end up working on our national strategy and simply be irrelevant.” “Is $533.7 billion in FY2010 and 4.2% of the GNP enough? Enough for what? Our most recent QDR is a morass of half thought-out ideas—many calling for further study or otherwise deferring tangible action. We don’t have a force plan. We don’t have a clearly defined procurement plan. We don’t tie it to end strength goals that are clearly defined and costed. We haven’t provided meaningful budget figures because the FYDP is not tied to the QDR. We haven’t set clear goals to be achieved. We have no metrics.” “Would we be where we are today if we forced the department to tie its strategy to plans and budget, if we demanded metrics, if we required a public annual accounting, and if we held our top leadership fully accountable? Can any change in process or business practices make up for this failure? The answer is no.” blah, this is sop, Anthony Cordsman gives no solutions This message has been edited. Last edited by: stillkit, Fri 13 March 2009 05:56 PM", 
        "intTime": 20090313, 
        "postID": 3, 
        "quote": "Originally posted by Anbar7: CSIS’s Anthony Cordesman gave a speech yesterday at the National Defense University where he blasted the defense culture that has produced what he called “the worst run department in our history.” He emailed the speech around and I’d thought I’d reproduce a few of the choicer bits. He said the current “crisis” facing all the services’ procurement and force structure plans, where “we are killing force structure to try to buy new weapons,” is a failure of leadership, not of process. “We talk of “jointness,” but the reality is that each service is involved in an existential battle for resources against the others. We have gone into two wars with no clear plan for conflict termination or for stability operations. We have tried to manage wars through supplementals in the absence of long-term plans, decoupled military operations from nation building, and been so slow to react to the growth of the threat in Afghanistan that we are now losing a war we once thought we had decisively won.” “Some of this can be blamed on what may have been the worst national security team of the postwar era. As someone who thought Robert McNamara represented the nadir in defense leadership, I have to give Donald Rumsfeld credit for being the epitome of a micromanaging bully who scattered snowflakes like dandruff, and with about as much effect. I also have a horrifying sense of déjà vu when I compare McGeorge Bundy and the Rostows to Cheney and our recent national security advisers. There is far too little difference between the “neoconservatives” of Iraq and Afghanistan and the “neoliberals” of Vietnam.” “Year after year, our top civilian and military decision makers came and went letting the under-budgeting of procurement, force plans, and manpower grow. We then found ourselves fighting “long” wars that we took years to fully deploy and budget for, each year asking for supplementals that tacitly assumed we would win in the next year. We were slow to react in Iraq, and took until FY2007 to seriously budget for Afghanistan. In fact, we used the totally predictable inability to precisely predict the cost of war to create a nightmare of unrealistic annual baseline budgets, half thought-out supplementals, and pointless Future Year Defense Plans (FYDPs).” Cordesman said the last thing DOD needs is another commission or study to examine the defense “process.” Rather, what is needed are leaders willing to make tough choices, that means cutting cherished weapons programs, and who are held accountable for their decisions. “There is only one test: what did you do that served the broader national interest of the U.S. successfully during your tour of duty. Not your party, not your ideology, not your service, and not your program.” The crisis befalling DOD is also the product of a complete decoupling of any meaningful strategy and detailed force and procurement plans and honest budgeting. Cordesman had some choice comments on the upcoming QDR, being run on the OSD side by under secretary of defense Michele Flournoy’s policy shop. “If God really hates you, you may end up working on a Quadrennial Defense Review: The most pointless and destructive planning effort imaginable. You will waste two years on a document decoupled from a real world force plan, from an honest set of decisions about manpower or procurement, with no clear budget or FYDP, and with no metrics to measure or determine its success. If God merely dislikes you, you may end up helping your service chief or the Chairman of the Joint Chiefs draft one of those vague, anodyne strategy documents that is all concepts and no plans or execution. If God is totally indifferent, you will end up working on our national strategy and simply be irrelevant.” “Is $533.7 billion in FY2010 and 4.2% of the GNP enough? Enough for what? Our most recent QDR is a morass of half thought-out ideas—many calling for further study or otherwise deferring tangible action. We don’t have a force plan. We don’t have a clearly defined procurement plan. We don’t tie it to end strength goals that are clearly defined and costed. We haven’t provided meaningful budget figures because the FYDP is not tied to the QDR. We haven’t set clear goals to be achieved. We have no metrics.” “Would we be where we are today if we forced the department to tie its strategy to plans and budget, if we demanded metrics, if we required a public annual accounting, and if we held our top leadership fully accountable? Can any change in process or business practices make up for this failure? The answer is no.”", 
        "reply": " blah, this is sop, Anthony Cordsman gives no solutions This message has been edited. Last edited by: stillkit, Fri 13 March 2009 05:56 PM", 
        "threadID": "672198221_5860056712001", 
        "time": "2009-03-13 06:55:00", 
        "title": "DoD “Worst Run Department”: Cordesman", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: blah, this is sop, Anthony Cordsman gives no solutions Did you actually read the entire article? It's full of solutions worded in a \"what not to do\" format...or do you insist on a \"by the numbers\" spelling out the details?", 
        "intTime": 20090313, 
        "postID": 4, 
        "quote": "Originally posted by EAG154: blah, this is sop, Anthony Cordsman gives no solutions", 
        "reply": " Did you actually read the entire article? It's full of solutions worded in a \"what not to do\" format...or do you insist on a \"by the numbers\" spelling out the details?", 
        "threadID": "672198221_5860056712001", 
        "time": "2009-03-13 07:06:00", 
        "title": "DoD “Worst Run Department”: Cordesman", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "Anyone can be critical. About the only thing he's got on any of us is working for John McCain at one time. How this shaped his thinking is anyone's guess. But, his history is littered with the discontent and lackidaisy achievements. Department of Energy, as we all know can't water out of a boot without approval of all the ecominded buffoons and Department of State, which hasn't done a remarkable thing since WWII. Of course DOD is the worse since they follow the lead of Congress and bureaucrats as himself. His ***** is for the Bush administration and Rumsfeld. So join the club. Must have a book in the offering.", 
        "intTime": 20090313, 
        "postID": 5, 
        "quote": "", 
        "reply": "Anyone can be critical. About the only thing he's got on any of us is working for John McCain at one time. How this shaped his thinking is anyone's guess. But, his history is littered with the discontent and lackidaisy achievements. Department of Energy, as we all know can't water out of a boot without approval of all the ecominded buffoons and Department of State, which hasn't done a remarkable thing since WWII. Of course DOD is the worse since they follow the lead of Congress and bureaucrats as himself. His ***** is for the Bush administration and Rumsfeld. So join the club. Must have a book in the offering.", 
        "threadID": "672198221_5860056712001", 
        "time": "2009-03-13 08:15:00", 
        "title": "DoD “Worst Run Department”: Cordesman", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: Anyone can be critical. About the only thing he's got on any of us is working for John McCain at one time. How this shaped his thinking is anyone's guess. But, his history is littered with the discontent and lackidaisy achievements. Department of Energy, as we all know can't water out of a boot without approval of all the ecominded buffoons and Department of State, which hasn't done a remarkable thing since WWII. Of course DOD is the worse since they follow the lead of Congress and bureaucrats as himself. His ***** is for the Bush administration and Rumsfeld. So join the club. Must have a book in the offering. Obviously you've never done anything in Military Procurement. The waste and BS no-bid contracts are costing the US Taxpayer billions each year! The chroniesm, waste, fraud and abuse is insane! The competition between branches to land their pet projects (and thereby land a cushie job upon retirement) is a frill the American people can no longer afford. IMHO we need several new mindsets, like: 1. If we need it, buy it. If we just want it, people in hell want icewater too. 2. No more going to war without a plan. If we have to respond to an emergency fine. But no protracted wars without a plan to win. If you don't plan to win...you're planning to lose. 3. If you are involved in procurement, retire and go to work with one of your former vendors, you go to jail. This hasn't got sheit to do with Bush, Obama, the republican party, or the democratic party. This is about waste and greed.", 
        "intTime": 20090313, 
        "postID": 6, 
        "quote": "Originally posted by rayevinsonsr: Anyone can be critical. About the only thing he's got on any of us is working for John McCain at one time. How this shaped his thinking is anyone's guess. But, his history is littered with the discontent and lackidaisy achievements. Department of Energy, as we all know can't water out of a boot without approval of all the ecominded buffoons and Department of State, which hasn't done a remarkable thing since WWII. Of course DOD is the worse since they follow the lead of Congress and bureaucrats as himself. His ***** is for the Bush administration and Rumsfeld. So join the club. Must have a book in the offering.", 
        "reply": " Obviously you've never done anything in Military Procurement. The waste and BS no-bid contracts are costing the US Taxpayer billions each year! The chroniesm, waste, fraud and abuse is insane! The competition between branches to land their pet projects (and thereby land a cushie job upon retirement) is a frill the American people can no longer afford. IMHO we need several new mindsets, like: 1. If we need it, buy it. If we just want it, people in hell want icewater too. 2. No more going to war without a plan. If we have to respond to an emergency fine. But no protracted wars without a plan to win. If you don't plan to win...you're planning to lose. 3. If you are involved in procurement, retire and go to work with one of your former vendors, you go to jail. This hasn't got sheit to do with Bush, Obama, the republican party, or the democratic party. This is about waste and greed.", 
        "threadID": "672198221_5860056712001", 
        "time": "2009-03-13 08:33:00", 
        "title": "DoD “Worst Run Department”: Cordesman", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "So happens, one of my first assignments was at Purchasing and Contracting Kessler AFB. Life was much simpler then and waste was never a issue. Anyway, I didn't bring political regime into the topic but Mr Cordesman analytic summation on Bush and Rumsfeld did. But I agree with you and not him.", 
        "intTime": 20090313, 
        "postID": 7, 
        "quote": "", 
        "reply": "So happens, one of my first assignments was at Purchasing and Contracting Kessler AFB. Life was much simpler then and waste was never a issue. Anyway, I didn't bring political regime into the topic but Mr Cordesman analytic summation on Bush and Rumsfeld did. But I agree with you and not him.", 
        "threadID": "672198221_5860056712001", 
        "time": "2009-03-13 09:23:00", 
        "title": "DoD “Worst Run Department”: Cordesman", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by Ol_Doc: quote: Originally posted by EAG154: blah, this is sop, Anthony Cordsman gives no solutions Did you actually read the entire article? It's full of solutions worded in a \"what not to do\" format...or do you insist on a \"by the numbers\" spelling out the details? read it by gum, saw no concrete solutions spelled out nor with numbers!", 
        "intTime": 20090313, 
        "postID": 8, 
        "quote": "Originally posted by Ol_Doc: quote: Originally posted by EAG154: blah, this is sop, Anthony Cordsman gives no solutions Did you actually read the entire article? It's full of solutions worded in a \"what not to do\" format...or do you insist on a \"by the numbers\" spelling out the details?", 
        "reply": " read it by gum, saw no concrete solutions spelled out nor with numbers!", 
        "threadID": "672198221_5860056712001", 
        "time": "2009-03-13 09:40:00", 
        "title": "DoD “Worst Run Department”: Cordesman", 
        "userID": "EAG154"
    }, 
    {
        "content": "Words of wisdom from Pres. Eisenhower (1961) that still ring true today: Until the latest of our world conflicts, the United States had no armaments industry. American makers of plowshares could, with time and as required, make swords as well. But now we can no longer risk emergency improvisation of national defense; we have been compelled to create a permanent armaments industry of vast proportions. Added to this, three and a half million men and women are directly engaged in the defense establishment. We annually spend on military security more than the net income of all United States corporations. This conjunction of an immense military establishment and a large arms industry is new in the American experience. The total influence -- economic, political, even spiritual -- is felt in every city, every State house, every office of the Federal government. We recognize the imperative need for this development. Yet we must not fail to comprehend its grave implications. Our toil, resources and livelihood are all involved; so is the very structure of our society. In the councils of government, we must guard against the acquisition of unwarranted influence, whether sought or unsought, by the military industrial complex. The potential for the disastrous rise of misplaced power exists and will persist. We must never let the weight of this combination endanger our liberties or democratic processes. We should take nothing for granted. Only an alert and knowledgeable citizenry can compel the proper meshing of the huge industrial and military machinery of defense with our peaceful methods and goals, so that security and liberty may prosper together. Reading Cordesman's statements, I was reminded of the above speech ... Relevent? \"http://coursesa.matrix.msu.edu/~hst306/documents/indust.html\"", 
        "intTime": 20090313, 
        "postID": 9, 
        "quote": "", 
        "reply": "Words of wisdom from Pres. Eisenhower (1961) that still ring true today: Until the latest of our world conflicts, the United States had no armaments industry. American makers of plowshares could, with time and as required, make swords as well. But now we can no longer risk emergency improvisation of national defense; we have been compelled to create a permanent armaments industry of vast proportions. Added to this, three and a half million men and women are directly engaged in the defense establishment. We annually spend on military security more than the net income of all United States corporations. This conjunction of an immense military establishment and a large arms industry is new in the American experience. The total influence -- economic, political, even spiritual -- is felt in every city, every State house, every office of the Federal government. We recognize the imperative need for this development. Yet we must not fail to comprehend its grave implications. Our toil, resources and livelihood are all involved; so is the very structure of our society. In the councils of government, we must guard against the acquisition of unwarranted influence, whether sought or unsought, by the military industrial complex. The potential for the disastrous rise of misplaced power exists and will persist. We must never let the weight of this combination endanger our liberties or democratic processes. We should take nothing for granted. Only an alert and knowledgeable citizenry can compel the proper meshing of the huge industrial and military machinery of defense with our peaceful methods and goals, so that security and liberty may prosper together. Reading Cordesman's statements, I was reminded of the above speech ... Relevent? \"http://coursesa.matrix.msu.edu/~hst306/documents/indust.html\"", 
        "threadID": "672198221_5860056712001", 
        "time": "2009-03-13 09:59:00", 
        "title": "DoD “Worst Run Department”: Cordesman", 
        "userID": "1WW"
    }, 
    {
        "content": "well lets put it this way... we arnt leaving iraq ever they have what we and the world needs and if we leave there the oil will stay in the ground and wont be used or what will be used will go to places like iran and other islamofascist nations which will be all of the middle east ... if we leave our enemies will win and take over that part of the world and you though $4 a gallon was high..... just wait till it goes up even higher then that....", 
        "intTime": 20090313, 
        "postID": 10, 
        "quote": "", 
        "reply": "well lets put it this way... we arnt leaving iraq ever they have what we and the world needs and if we leave there the oil will stay in the ground and wont be used or what will be used will go to places like iran and other islamofascist nations which will be all of the middle east ... if we leave our enemies will win and take over that part of the world and you though $4 a gallon was high..... just wait till it goes up even higher then that....", 
        "threadID": "672198221_5860056712001", 
        "time": "2009-03-13 10:06:00", 
        "title": "DoD “Worst Run Department”: Cordesman", 
        "userID": "outlaws93"
    }, 
    {
        "content": "If this were any other agency, the knee-jerk right-wingers would be screaming for big budget cuts, yet when any are proposed, they and the weapons programs = jobs lobby ensures that the status quo remains in place.", 
        "intTime": 20090313, 
        "postID": 11, 
        "quote": "", 
        "reply": "If this were any other agency, the knee-jerk right-wingers would be screaming for big budget cuts, yet when any are proposed, they and the weapons programs = jobs lobby ensures that the status quo remains in place.", 
        "threadID": "672198221_5860056712001", 
        "time": "2009-03-13 10:20:00", 
        "title": "DoD “Worst Run Department”: Cordesman", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by Ol_Doc: quote: Originally posted by EAG154: blah, this is sop, Anthony Cordsman gives no solutions Did you actually read the entire article? It's full of solutions worded in a \"what not to do\" format...or do you insist on a \"by the numbers\" spelling out the details? read it by gum, saw no concrete solutions spelled out nor with numbers! So? Are his points valid or not?", 
        "intTime": 20090313, 
        "postID": 12, 
        "quote": "Originally posted by EAG154: quote: Originally posted by Ol_Doc: quote: Originally posted by EAG154: blah, this is sop, Anthony Cordsman gives no solutions Did you actually read the entire article? It's full of solutions worded in a \"what not to do\" format...or do you insist on a \"by the numbers\" spelling out the details? read it by gum, saw no concrete solutions spelled out nor with numbers!", 
        "reply": " So? Are his points valid or not?", 
        "threadID": "672198221_5860056712001", 
        "time": "2009-03-13 10:22:00", 
        "title": "DoD “Worst Run Department”: Cordesman", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Motive25: quote: Originally posted by EAG154: quote: Originally posted by Ol_Doc: quote: Originally posted by EAG154: blah, this is sop, Anthony Cordsman gives no solutions Did you actually read the entire article? It's full of solutions worded in a \"what not to do\" format...or do you insist on a \"by the numbers\" spelling out the details? read it by gum, saw no concrete solutions spelled out nor with numbers! So? Are his points valid or not? Valid but not new!", 
        "intTime": 20090313, 
        "postID": 13, 
        "quote": "Originally posted by Motive25: quote: Originally posted by EAG154: quote: Originally posted by Ol_Doc: quote: Originally posted by EAG154: blah, this is sop, Anthony Cordsman gives no solutions Did you actually read the entire article? It's full of solutions worded in a \"what not to do\" format...or do you insist on a \"by the numbers\" spelling out the details? read it by gum, saw no concrete solutions spelled out nor with numbers! So? Are his points valid or not?", 
        "reply": " Valid but not new!", 
        "threadID": "672198221_5860056712001", 
        "time": "2009-03-13 16:46:00", 
        "title": "DoD “Worst Run Department”: Cordesman", 
        "userID": "EAG154"
    }
]