[
    {
        "content": "This article was on the front page of MSNBC.com. In this article posted by MSNBC it states that only 2 individual marines and a small band of untrained soldiers are close to the militants stronghold in Pakistan. This article even gives the exact location of and number of houses at the base. This article is nothing but a setup to get Marines killed. I for one am furious with MSNBC. But the real question is why would they do such a thing? Obviously, if the base were utterly destroyed by the militants than it would give excuse for the military to once again perform attacks against the militants inside Pakistan. Except this time, they are ready for a massive counterstrike that would, or might, be targeted against the Pakistani troops themselves in order to ignite Pakistan into a war against the United States itself. Don't discount the notion, for that is exactly what the terrorist have been saying all along. This is just one of many articles from Pakistan in which the fear of war with the United States is very real. In the article, the author claims that most Pakistanis don't laugh at the notion, instead, they lower their heads in despair. But why would the Unites States attack Pakistan? It all goes back to Iraq. Remember, there was no justification to attack Iraq. Sure Saddam was a tyrant, but we are the ones who helped him get there. We didn't care for over a decade that he murdered his own people. It was only when he outlived his usefulness that he was then seen as a target. In Pakistan, I believe it is largely the same. Our government like Musharif. I don't believe that our government likes who the Pakistanis have elected to be in charge of their country. This article goes on to explain that the Unites states has spent untold millions attempting to buy loyalty and fund tribal forces into doing our bidding. However, as you and I know, the money will soon dry up. The military knows this. And when the money does dry up and our government no longer has the capability to buy out our enemies, then war is what will happen next. But once again, why? It is all because of China. China is the next superpower on the globe and the United States won't be able to compete against it. China, unlike the old Soviet Union, has been given access to the world markets. China is building a world class Navy as fast as it can. This is what the United States fears most. Our huge and powerful navy is what truly intimidates the world into submission. We have enough aircraft carriers to dominate any point on the globe. The only problem is nuclear counterstrike. But that's where the stealth bombers and missile defense aircraft come into play. Theoretically, our military forces could fight any single country on the planet. But it is taking to long. In order to stay a military super power we need weapons technology and numerical superiority. China is attempting to break into our military sales market every day. Our old allies are purchasing Chinese aircraft instead of US aircraft. Eventually, this will give China the technological edge as it will enable them, through more military sales, to spend more on technology and production. It is practically a certainty that China will one day become the superpower of all superpowers. Eventually, they could field a military that is 5 times as large as ours with better technology. So, I believe that the United States government is trying to create a pseudo empire before China gains too many arms sales and too large a Navy What do you think? MOD HAT ON I think you need to read, and follow, the Terms of Service found at the bottom of the page and the stickies at the top. Pay particular attention to the part where it's explained that hot links are not allowed on this site, unless they go to military.com, .mil, .gov or a Veteran's service organization such as the VFW or DAV. This message has been edited. Last edited by: stillkit, Sat 02 May 2009 04:20 AM", 
        "intTime": 20090501, 
        "postID": 1, 
        "quote": "", 
        "reply": "This article was on the front page of MSNBC.com. In this article posted by MSNBC it states that only 2 individual marines and a small band of untrained soldiers are close to the militants stronghold in Pakistan. This article even gives the exact location of and number of houses at the base. This article is nothing but a setup to get Marines killed. I for one am furious with MSNBC. But the real question is why would they do such a thing? Obviously, if the base were utterly destroyed by the militants than it would give excuse for the military to once again perform attacks against the militants inside Pakistan. Except this time, they are ready for a massive counterstrike that would, or might, be targeted against the Pakistani troops themselves in order to ignite Pakistan into a war against the United States itself. Don't discount the notion, for that is exactly what the terrorist have been saying all along. This is just one of many articles from Pakistan in which the fear of war with the United States is very real. In the article, the author claims that most Pakistanis don't laugh at the notion, instead, they lower their heads in despair. But why would the Unites States attack Pakistan? It all goes back to Iraq. Remember, there was no justification to attack Iraq. Sure Saddam was a tyrant, but we are the ones who helped him get there. We didn't care for over a decade that he murdered his own people. It was only when he outlived his usefulness that he was then seen as a target. In Pakistan, I believe it is largely the same. Our government like Musharif. I don't believe that our government likes who the Pakistanis have elected to be in charge of their country. This article goes on to explain that the Unites states has spent untold millions attempting to buy loyalty and fund tribal forces into doing our bidding. However, as you and I know, the money will soon dry up. The military knows this. And when the money does dry up and our government no longer has the capability to buy out our enemies, then war is what will happen next. But once again, why? It is all because of China. China is the next superpower on the globe and the United States won't be able to compete against it. China, unlike the old Soviet Union, has been given access to the world markets. China is building a world class Navy as fast as it can. This is what the United States fears most. Our huge and powerful navy is what truly intimidates the world into submission. We have enough aircraft carriers to dominate any point on the globe. The only problem is nuclear counterstrike. But that's where the stealth bombers and missile defense aircraft come into play. Theoretically, our military forces could fight any single country on the planet. But it is taking to long. In order to stay a military super power we need weapons technology and numerical superiority. China is attempting to break into our military sales market every day. Our old allies are purchasing Chinese aircraft instead of US aircraft. Eventually, this will give China the technological edge as it will enable them, through more military sales, to spend more on technology and production. It is practically a certainty that China will one day become the superpower of all superpowers. Eventually, they could field a military that is 5 times as large as ours with better technology. So, I believe that the United States government is trying to create a pseudo empire before China gains too many arms sales and too large a Navy What do you think? MOD HAT ON I think you need to read, and follow, the Terms of Service found at the bottom of the page and the stickies at the top. Pay particular attention to the part where it's explained that hot links are not allowed on this site, unless they go to military.com, .mil, .gov or a Veteran's service organization such as the VFW or DAV. This message has been edited. Last edited by: stillkit, Sat 02 May 2009 04:20 AM", 
        "threadID": "672198221_6590042222001", 
        "time": "2009-05-01 10:09:00", 
        "title": "Are 2 Marines Being Set Up to Die for The Empire?", 
        "userID": "1334392"
    }, 
    {
        "content": "Looks like they may have twice as many Marines as they really need... \"The World's Finest\"", 
        "intTime": 20090501, 
        "postID": 2, 
        "quote": "", 
        "reply": "Looks like they may have twice as many Marines as they really need... \"The World's Finest\"", 
        "threadID": "672198221_6590042222001", 
        "time": "2009-05-01 10:38:00", 
        "title": "Are 2 Marines Being Set Up to Die for The Empire?", 
        "userID": "Kegler300"
    }, 
    {
        "content": "quote: Originally posted by 1334392: This article was on the front page of MSNBC.com. In this article posted by MSNBC it states that only 2 individual marines and a small band of untrained soldiers are close to the militants stronghold in Pakistan. This article even gives the exact location of and number of houses at the base. This article is nothing but a setup to get Marines killed. I for one am furious with MSNBC. But the real question is why would they do such a thing? The article gives no information that the Taliban doesn't already know. Didn't you actually read the article? Dave This message has been edited. Last edited by: stillkit, Sat 02 May 2009 04:20 AM", 
        "intTime": 20090501, 
        "postID": 3, 
        "quote": "Originally posted by 1334392: This article was on the front page of MSNBC.com. In this article posted by MSNBC it states that only 2 individual marines and a small band of untrained soldiers are close to the militants stronghold in Pakistan. This article even gives the exact location of and number of houses at the base. This article is nothing but a setup to get Marines killed. I for one am furious with MSNBC. But the real question is why would they do such a thing?", 
        "reply": " The article gives no information that the Taliban doesn't already know. Didn't you actually read the article? Dave This message has been edited. Last edited by: stillkit, Sat 02 May 2009 04:20 AM", 
        "threadID": "672198221_6590042222001", 
        "time": "2009-05-01 10:42:00", 
        "title": "Are 2 Marines Being Set Up to Die for The Empire?", 
        "userID": "Grachus"
    }, 
    {
        "content": "Its the point of the news media running their mouths and getting our troops kill. Just like the liberal/democrat congress who change the rules of engagement in Iraq, to the tune of over 1,000 of our troops so far being kill because of the changes and countless wounded. But they promise us better benefits!!! Then lied about them also... What a bunce of crap. I think we ought to disband the CIA, FBI and all of the Armed Forces and let the liberals and democrats talk our enemy's out of attacking us. How much money do you think that will cost? Then what happens when we run out? When the next attac comes and it will, esp now, with everything going on to make us weaker. Look in the mirror liberals and democrats and say, Its MY FAULT, for it will be your fault, just like the first time.", 
        "intTime": 20090501, 
        "postID": 4, 
        "quote": "", 
        "reply": "Its the point of the news media running their mouths and getting our troops kill. Just like the liberal/democrat congress who change the rules of engagement in Iraq, to the tune of over 1,000 of our troops so far being kill because of the changes and countless wounded. But they promise us better benefits!!! Then lied about them also... What a bunce of crap. I think we ought to disband the CIA, FBI and all of the Armed Forces and let the liberals and democrats talk our enemy's out of attacking us. How much money do you think that will cost? Then what happens when we run out? When the next attac comes and it will, esp now, with everything going on to make us weaker. Look in the mirror liberals and democrats and say, Its MY FAULT, for it will be your fault, just like the first time.", 
        "threadID": "672198221_6590042222001", 
        "time": "2009-05-01 13:52:00", 
        "title": "Are 2 Marines Being Set Up to Die for The Empire?", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by dman1948: Its the point of the news media running their mouths and getting our troops kill. Their story and article was approved by the military. The Times has been running a whole series of articles about Afghanistan, all supported by the military. Nothing in those articles that the enemy doesn't know. Did you complain about the Times article of a US patrol wiping out a Taliban force? Did you? I can't recall it. quote: Originally posted by dman1948: Just like the liberal/democrat congress who change the rules of engagement in Iraq, to the tune of over 1,000 of our troops so far being kill because of the changes and countless wounded. But they promise us better benefits!!! Then lied about them also... What a bunce of crap. I think we ought to disband the CIA, FBI and all of the Armed Forces and let the liberals and democrats talk our enemy's out of attacking us. How much money do you think that will cost? Then what happens when we run out? When the next attac comes and it will, esp now, with everything going on to make us weaker. Look in the mirror liberals and democrats and say, Its MY FAULT, for it will be your fault, just like the first time. All the above isn't even related in the remotest way to this thread. No offense, but I'm getting bored with comments on how Liberals are destroying America and HAVE to be tossed in with every subject that we discuss. It's as if there's a \"play button\" on your head, and no matter what the subject, you have to push it. Dave", 
        "intTime": 20090501, 
        "postID": 5, 
        "quote": "Originally posted by dman1948: Its the point of the news media running their mouths and getting our troops kill.", 
        "reply": " Their story and article was approved by the military. The Times has been running a whole series of articles about Afghanistan, all supported by the military. Nothing in those articles that the enemy doesn't know. Did you complain about the Times article of a US patrol wiping out a Taliban force? Did you? I can't recall it. quote: Originally posted by dman1948: Just like the liberal/democrat congress who change the rules of engagement in Iraq, to the tune of over 1,000 of our troops so far being kill because of the changes and countless wounded. But they promise us better benefits!!! Then lied about them also... What a bunce of crap. I think we ought to disband the CIA, FBI and all of the Armed Forces and let the liberals and democrats talk our enemy's out of attacking us. How much money do you think that will cost? Then what happens when we run out? When the next attac comes and it will, esp now, with everything going on to make us weaker. Look in the mirror liberals and democrats and say, Its MY FAULT, for it will be your fault, just like the first time. All the above isn't even related in the remotest way to this thread. No offense, but I'm getting bored with comments on how Liberals are destroying America and HAVE to be tossed in with every subject that we discuss. It's as if there's a \"play button\" on your head, and no matter what the subject, you have to push it. Dave", 
        "threadID": "672198221_6590042222001", 
        "time": "2009-05-01 14:17:00", 
        "title": "Are 2 Marines Being Set Up to Die for The Empire?", 
        "userID": "Grachus"
    }, 
    {
        "content": "Liberalism is the worst disease to ever affect any country that has ever existed. From unbridled and depraved forms of liberalism come almost all forms of dictatorship and totalitarianism when the people revolt against the depravity and earnestly desire self-discipline, good order, and a return to morality. Let me explain… A Quote from “The Protocols of the Learned Elders of Zion” “In any state in which there is a bad organization of authority, an impersonality of laws and of the rulers who have lost their personality amid the flood of rights ever multiplying out of liberalism, I find a new right – to attack by the right of the strong, and to scatter to the winds all existing forces of order and regulation, to reconstruct all institutions and to become the sovereign lord of those who have left to us the rights of their power by laying them down voluntarily in their liberalism.” Let me explain what this paragraph means with reflection of our own history. In the 1950’s we had the pinnacle of American civilization. The people were united in morality, decency, and purpose. The generation of adults lived through world war and depression. Conservation of resources, discipline of purpose, and strong morality were the hallmarks of this generation of adults. The children, however, rebelled, and were encouraged to rebel, by the liberal ideals of the media elite. America was Christian and groups of persons who were against such ideals banded together to gain control of the press and media sources. Rumors suggest that these liberal groups were supported by enemy governments, such as the Soviet Union. In time, liberalism has used the notion that “all men are created equal” as an excuse to claim that all liberal actions, such as homosexuality and satanic worship, deserve equal consideration under the law and equal importance as ideals to be transmitted among society. Liberals have been allowed, under the guise of freedom speech, to inundate by repetition these flawed ideals among the population. So much so, that the general masses now feel that it is morally flawed to use their own freedom of speech rights to openly object to them. The liberal ideal of tolerance is, in practice, contrary to good order and discipline. Tolerance is the excuse to perform almost any evil deed and spread corruption and debauchery so long as its victims can not be adequately identified on the whole. The true masters of the spread of liberalism and tolerance actively hide in the shadows, as all evil does. Instead, they actively create social fringe groups activists comprising the morally weak and socially unwanted to perform their evil desires of civil unrest and vigilante property destruction. For need of attention and social interaction, the morally corrupt willingly perform the deeds of their hidden masters. Only the evil deeds of individual soldiers of liberalism are discovered and punished when they become known. As so, we readily and eagerly punish the effects of liberalism and never the cause. Liberalisms ultimate goal of course is power, which is why so many of them promote and follow the ideals of communism and socialism. They use the unbridled freedoms of our society to commit many evils only to secretly desire to take these freedoms away from others who don’t agree with their deeds. They, the masters of liberalism, secretly feel that they will gain control of our society once society again craves a return to civility, good order, and discipline. For all societies who promote unbridled debaucher, homosexuality, and immorality soon crave a return to basic, necessary, conservative ideals that follow basic biology, security, and safety. For the human condition is one that secretly craves discipline and good order while only momentary does it have fits of depravity and loss of self control. The universal truth of the human condition is that freedom itself does not come from liberalism, but instead, from disciplined self-control. For it is only when one has self-control that one is truly free to think and act apart from slavery. Only self-control gains freedom in the first place. Only self control can prevent its loss. And when liberalism has done its deed the society at large craves once again self-discipline, good order, and civility. Have you not noticed that those who grow up under the most undisciplined homes are those who most readily join the most disciplined branches of our military? It is the formerly most depraved of our society that most often joins the Marine Corps. This is no accident and it is no wrong. Instead, it is simply the instinctive will of the undisciplined mind to crave what it knows that it needs most for self preservation. And so our entire liberal society will soon crave the most ardent and severe discipline of mind and body, just as the Germans did before World War Two. And in like kind, we ourselves will most probably suffer our own “Night of the Long Knives” as the leaders of discipline and good order once again attempt to cleanse the society of those who promoted the most immoral kinds of liberalism and debauchery. For history moves in cycles my friend and most often repeats itself. And the instillation of liberalism, homosexuality, immorality, and depravity in this nation is no accident or happenstance. Instead, it is, as it most probably always has been, the systematic actions of many evil secret societies of persons, actively orchestrating affairs from behind the scenes. It is the billionaire homosexuals who entice their depraved followers to come out of the closet and promote homosexuality while they themselves remain quietly hidden who are systematically destroying our society. It is the lesbian business associations who pool their money for the purposes of depraved advertising and the purchase of great media influence. In conclusion, I will end my rant with the words that began it. Liberalism is the worst disease to ever affect any country that has ever existed. From unbridled and depraved forms of liberalism come almost all forms of dictatorship and totalitarianism when the people revolt against the depravity and earnestly desire self-discipline, good order, and a return to morality.", 
        "intTime": 20090501, 
        "postID": 6, 
        "quote": "", 
        "reply": "Liberalism is the worst disease to ever affect any country that has ever existed. From unbridled and depraved forms of liberalism come almost all forms of dictatorship and totalitarianism when the people revolt against the depravity and earnestly desire self-discipline, good order, and a return to morality. Let me explain… A Quote from “The Protocols of the Learned Elders of Zion” “In any state in which there is a bad organization of authority, an impersonality of laws and of the rulers who have lost their personality amid the flood of rights ever multiplying out of liberalism, I find a new right – to attack by the right of the strong, and to scatter to the winds all existing forces of order and regulation, to reconstruct all institutions and to become the sovereign lord of those who have left to us the rights of their power by laying them down voluntarily in their liberalism.” Let me explain what this paragraph means with reflection of our own history. In the 1950’s we had the pinnacle of American civilization. The people were united in morality, decency, and purpose. The generation of adults lived through world war and depression. Conservation of resources, discipline of purpose, and strong morality were the hallmarks of this generation of adults. The children, however, rebelled, and were encouraged to rebel, by the liberal ideals of the media elite. America was Christian and groups of persons who were against such ideals banded together to gain control of the press and media sources. Rumors suggest that these liberal groups were supported by enemy governments, such as the Soviet Union. In time, liberalism has used the notion that “all men are created equal” as an excuse to claim that all liberal actions, such as homosexuality and satanic worship, deserve equal consideration under the law and equal importance as ideals to be transmitted among society. Liberals have been allowed, under the guise of freedom speech, to inundate by repetition these flawed ideals among the population. So much so, that the general masses now feel that it is morally flawed to use their own freedom of speech rights to openly object to them. The liberal ideal of tolerance is, in practice, contrary to good order and discipline. Tolerance is the excuse to perform almost any evil deed and spread corruption and debauchery so long as its victims can not be adequately identified on the whole. The true masters of the spread of liberalism and tolerance actively hide in the shadows, as all evil does. Instead, they actively create social fringe groups activists comprising the morally weak and socially unwanted to perform their evil desires of civil unrest and vigilante property destruction. For need of attention and social interaction, the morally corrupt willingly perform the deeds of their hidden masters. Only the evil deeds of individual soldiers of liberalism are discovered and punished when they become known. As so, we readily and eagerly punish the effects of liberalism and never the cause. Liberalisms ultimate goal of course is power, which is why so many of them promote and follow the ideals of communism and socialism. They use the unbridled freedoms of our society to commit many evils only to secretly desire to take these freedoms away from others who don’t agree with their deeds. They, the masters of liberalism, secretly feel that they will gain control of our society once society again craves a return to civility, good order, and discipline. For all societies who promote unbridled debaucher, homosexuality, and immorality soon crave a return to basic, necessary, conservative ideals that follow basic biology, security, and safety. For the human condition is one that secretly craves discipline and good order while only momentary does it have fits of depravity and loss of self control. The universal truth of the human condition is that freedom itself does not come from liberalism, but instead, from disciplined self-control. For it is only when one has self-control that one is truly free to think and act apart from slavery. Only self-control gains freedom in the first place. Only self control can prevent its loss. And when liberalism has done its deed the society at large craves once again self-discipline, good order, and civility. Have you not noticed that those who grow up under the most undisciplined homes are those who most readily join the most disciplined branches of our military? It is the formerly most depraved of our society that most often joins the Marine Corps. This is no accident and it is no wrong. Instead, it is simply the instinctive will of the undisciplined mind to crave what it knows that it needs most for self preservation. And so our entire liberal society will soon crave the most ardent and severe discipline of mind and body, just as the Germans did before World War Two. And in like kind, we ourselves will most probably suffer our own “Night of the Long Knives” as the leaders of discipline and good order once again attempt to cleanse the society of those who promoted the most immoral kinds of liberalism and debauchery. For history moves in cycles my friend and most often repeats itself. And the instillation of liberalism, homosexuality, immorality, and depravity in this nation is no accident or happenstance. Instead, it is, as it most probably always has been, the systematic actions of many evil secret societies of persons, actively orchestrating affairs from behind the scenes. It is the billionaire homosexuals who entice their depraved followers to come out of the closet and promote homosexuality while they themselves remain quietly hidden who are systematically destroying our society. It is the lesbian business associations who pool their money for the purposes of depraved advertising and the purchase of great media influence. In conclusion, I will end my rant with the words that began it. Liberalism is the worst disease to ever affect any country that has ever existed. From unbridled and depraved forms of liberalism come almost all forms of dictatorship and totalitarianism when the people revolt against the depravity and earnestly desire self-discipline, good order, and a return to morality.", 
        "threadID": "672198221_6590042222001", 
        "time": "2009-05-01 20:40:00", 
        "title": "Are 2 Marines Being Set Up to Die for The Empire?", 
        "userID": "1334392"
    }, 
    {
        "content": "quote: Originally posted by 1334392: Liberalism is the worst disease to ever affect any country that has ever existed. From unbridled and depraved forms of liberalism come almost all forms of dictatorship and totalitarianism when the people revolt against the depravity and earnestly desire self-discipline, good order, and a return to morality. Let me explain… A Quote from “The Protocols of the Learned Elders of Zion” “In any state in which there is a bad organization of authority, an impersonality of laws and of the rulers who have lost their personality amid the flood of rights ever multiplying out of liberalism, I find a new right – to attack by the right of the strong, and to scatter to the winds all existing forces of order and regulation, to reconstruct all institutions and to become the sovereign lord of those who have left to us the rights of their power by laying them down voluntarily in their liberalism.” Let me explain what this paragraph means with reflection of our own history. In the 1950’s we had the pinnacle of American civilization. The people were united in morality, decency, and purpose. The generation of adults lived through world war and depression. Conservation of resources, discipline of purpose, and strong morality were the hallmarks of this generation of adults. The children, however, rebelled, and were encouraged to rebel, by the liberal ideals of the media elite. America was Christian and groups of persons who were against such ideals banded together to gain control of the press and media sources. Rumors suggest that these liberal groups were supported by enemy governments, such as the Soviet Union. In time, liberalism has used the notion that “all men are created equal” as an excuse to claim that all liberal actions, such as homosexuality and satanic worship, deserve equal consideration under the law and equal importance as ideals to be transmitted among society. Liberals have been allowed, under the guise of freedom speech, to inundate by repetition these flawed ideals among the population. So much so, that the general masses now feel that it is morally flawed to use their own freedom of speech rights to openly object to them. The liberal ideal of tolerance is, in practice, contrary to good order and discipline. Tolerance is the excuse to perform almost any evil deed and spread corruption and debauchery so long as its victims can not be adequately identified on the whole. The true masters of the spread of liberalism and tolerance actively hide in the shadows, as all evil does. Instead, they actively create social fringe groups activists comprising the morally weak and socially unwanted to perform their evil desires of civil unrest and vigilante property destruction. For need of attention and social interaction, the morally corrupt willingly perform the deeds of their hidden masters. Only the evil deeds of individual soldiers of liberalism are discovered and punished when they become known. As so, we readily and eagerly punish the effects of liberalism and never the cause. Liberalisms ultimate goal of course is power, which is why so many of them promote and follow the ideals of communism and socialism. They use the unbridled freedoms of our society to commit many evils only to secretly desire to take these freedoms away from others who don’t agree with their deeds. They, the masters of liberalism, secretly feel that they will gain control of our society once society again craves a return to civility, good order, and discipline. For all societies who promote unbridled debaucher, homosexuality, and immorality soon crave a return to basic, necessary, conservative ideals that follow basic biology, security, and safety. For the human condition is one that secretly craves discipline and good order while only momentary does it have fits of depravity and loss of self control. The universal truth of the human condition is that freedom itself does not come from liberalism, but instead, from disciplined self-control. For it is only when one has self-control that one is truly free to think and act apart from slavery. Only self-control gains freedom in the first place. Only self control can prevent its loss. And when liberalism has done its deed the society at large craves once again self-discipline, good order, and civility. Have you not noticed that those who grow up under the most undisciplined homes are those who most readily join the most disciplined branches of our military? It is the formerly most depraved of our society that most often joins the Marine Corps. This is no accident and it is no wrong. Instead, it is simply the instinctive will of the undisciplined mind to crave what it knows that it needs most for self preservation. And so our entire liberal society will soon crave the most ardent and severe discipline of mind and body, just as the Germans did before World War Two. And in like kind, we ourselves will most probably suffer our own “Night of the Long Knives” as the leaders of discipline and good order once again attempt to cleanse the society of those who promoted the most immoral kinds of liberalism and debauchery. For history moves in cycles my friend and most often repeats itself. And the instillation of liberalism, homosexuality, immorality, and depravity in this nation is no accident or happenstance. Instead, it is, as it most probably always has been, the systematic actions of many evil secret societies of persons, actively orchestrating affairs from behind the scenes. It is the billionaire homosexuals who entice their depraved followers to come out of the closet and promote homosexuality while they themselves remain quietly hidden who are systematically destroying our society. It is the lesbian business associations who pool their money for the purposes of depraved advertising and the purchase of great media influence. In conclusion, I will end my rant with the words that began it. Liberalism is the worst disease to ever affect any country that has ever existed. From unbridled and depraved forms of liberalism come almost all forms of dictatorship and totalitarianism when the people revolt against the depravity and earnestly desire self-discipline, good order, and a return to morality. Look, posting a diatribe from an Anti-Semitic Hate manual cooked up by the Russian Czar is not exactely an argument. If you're going to quote from that schit, you might as well realise that America was FOUNDED by Liberals. The US Constitution war WRITTEN by Liberals, and your little hate America rant smells like stinking Fascism to me. Go and take your ravings to Stormfront, where they appreciate NAZI's. The Third Reich and it's \"ideals\" are dead. Get used to it. Dave", 
        "intTime": 20090502, 
        "postID": 7, 
        "quote": "Originally posted by 1334392: Liberalism is the worst disease to ever affect any country that has ever existed. From unbridled and depraved forms of liberalism come almost all forms of dictatorship and totalitarianism when the people revolt against the depravity and earnestly desire self-discipline, good order, and a return to morality. Let me explain… A Quote from “The Protocols of the Learned Elders of Zion” “In any state in which there is a bad organization of authority, an impersonality of laws and of the rulers who have lost their personality amid the flood of rights ever multiplying out of liberalism, I find a new right – to attack by the right of the strong, and to scatter to the winds all existing forces of order and regulation, to reconstruct all institutions and to become the sovereign lord of those who have left to us the rights of their power by laying them down voluntarily in their liberalism.” Let me explain what this paragraph means with reflection of our own history. In the 1950’s we had the pinnacle of American civilization. The people were united in morality, decency, and purpose. The generation of adults lived through world war and depression. Conservation of resources, discipline of purpose, and strong morality were the hallmarks of this generation of adults. The children, however, rebelled, and were encouraged to rebel, by the liberal ideals of the media elite. America was Christian and groups of persons who were against such ideals banded together to gain control of the press and media sources. Rumors suggest that these liberal groups were supported by enemy governments, such as the Soviet Union. In time, liberalism has used the notion that “all men are created equal” as an excuse to claim that all liberal actions, such as homosexuality and satanic worship, deserve equal consideration under the law and equal importance as ideals to be transmitted among society. Liberals have been allowed, under the guise of freedom speech, to inundate by repetition these flawed ideals among the population. So much so, that the general masses now feel that it is morally flawed to use their own freedom of speech rights to openly object to them. The liberal ideal of tolerance is, in practice, contrary to good order and discipline. Tolerance is the excuse to perform almost any evil deed and spread corruption and debauchery so long as its victims can not be adequately identified on the whole. The true masters of the spread of liberalism and tolerance actively hide in the shadows, as all evil does. Instead, they actively create social fringe groups activists comprising the morally weak and socially unwanted to perform their evil desires of civil unrest and vigilante property destruction. For need of attention and social interaction, the morally corrupt willingly perform the deeds of their hidden masters. Only the evil deeds of individual soldiers of liberalism are discovered and punished when they become known. As so, we readily and eagerly punish the effects of liberalism and never the cause. Liberalisms ultimate goal of course is power, which is why so many of them promote and follow the ideals of communism and socialism. They use the unbridled freedoms of our society to commit many evils only to secretly desire to take these freedoms away from others who don’t agree with their deeds. They, the masters of liberalism, secretly feel that they will gain control of our society once society again craves a return to civility, good order, and discipline. For all societies who promote unbridled debaucher, homosexuality, and immorality soon crave a return to basic, necessary, conservative ideals that follow basic biology, security, and safety. For the human condition is one that secretly craves discipline and good order while only momentary does it have fits of depravity and loss of self control. The universal truth of the human condition is that freedom itself does not come from liberalism, but instead, from disciplined self-control. For it is only when one has self-control that one is truly free to think and act apart from slavery. Only self-control gains freedom in the first place. Only self control can prevent its loss. And when liberalism has done its deed the society at large craves once again self-discipline, good order, and civility. Have you not noticed that those who grow up under the most undisciplined homes are those who most readily join the most disciplined branches of our military? It is the formerly most depraved of our society that most often joins the Marine Corps. This is no accident and it is no wrong. Instead, it is simply the instinctive will of the undisciplined mind to crave what it knows that it needs most for self preservation. And so our entire liberal society will soon crave the most ardent and severe discipline of mind and body, just as the Germans did before World War Two. And in like kind, we ourselves will most probably suffer our own “Night of the Long Knives” as the leaders of discipline and good order once again attempt to cleanse the society of those who promoted the most immoral kinds of liberalism and debauchery. For history moves in cycles my friend and most often repeats itself. And the instillation of liberalism, homosexuality, immorality, and depravity in this nation is no accident or happenstance. Instead, it is, as it most probably always has been, the systematic actions of many evil secret societies of persons, actively orchestrating affairs from behind the scenes. It is the billionaire homosexuals who entice their depraved followers to come out of the closet and promote homosexuality while they themselves remain quietly hidden who are systematically destroying our society. It is the lesbian business associations who pool their money for the purposes of depraved advertising and the purchase of great media influence. In conclusion, I will end my rant with the words that began it. Liberalism is the worst disease to ever affect any country that has ever existed. From unbridled and depraved forms of liberalism come almost all forms of dictatorship and totalitarianism when the people revolt against the depravity and earnestly desire self-discipline, good order, and a return to morality.", 
        "reply": " Look, posting a diatribe from an Anti-Semitic Hate manual cooked up by the Russian Czar is not exactely an argument. If you're going to quote from that schit, you might as well realise that America was FOUNDED by Liberals. The US Constitution war WRITTEN by Liberals, and your little hate America rant smells like stinking Fascism to me. Go and take your ravings to Stormfront, where they appreciate NAZI's. The Third Reich and it's \"ideals\" are dead. Get used to it. Dave", 
        "threadID": "672198221_6590042222001", 
        "time": "2009-05-02 08:36:00", 
        "title": "Are 2 Marines Being Set Up to Die for The Empire?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by 1334392: Liberalism is the worst disease to ever affect any country that has ever existed. From unbridled and depraved forms of liberalism come almost all forms of dictatorship and totalitarianism when the people revolt against the depravity and earnestly desire self-discipline, good order, and a return to morality. Let me explain… A Quote from “The Protocols of the Learned Elders of Zion” “In any state in which there is a bad organization of authority, an impersonality of laws and of the rulers who have lost their personality amid the flood of rights ever multiplying out of liberalism, I find a new right – to attack by the right of the strong, and to scatter to the winds all existing forces of order and regulation, to reconstruct all institutions and to become the sovereign lord of those who have left to us the rights of their power by laying them down voluntarily in their liberalism.” Let me explain what this paragraph means with reflection of our own history. In the 1950’s we had the pinnacle of American civilization. The people were united in morality, decency, and purpose. The generation of adults lived through world war and depression. Conservation of resources, discipline of purpose, and strong morality were the hallmarks of this generation of adults. The children, however, rebelled, and were encouraged to rebel, by the liberal ideals of the media elite. America was Christian and groups of persons who were against such ideals banded together to gain control of the press and media sources. Rumors suggest that these liberal groups were supported by enemy governments, such as the Soviet Union. In time, liberalism has used the notion that “all men are created equal” as an excuse to claim that all liberal actions, such as homosexuality and satanic worship, deserve equal consideration under the law and equal importance as ideals to be transmitted among society. Liberals have been allowed, under the guise of freedom speech, to inundate by repetition these flawed ideals among the population. So much so, that the general masses now feel that it is morally flawed to use their own freedom of speech rights to openly object to them. The liberal ideal of tolerance is, in practice, contrary to good order and discipline. Tolerance is the excuse to perform almost any evil deed and spread corruption and debauchery so long as its victims can not be adequately identified on the whole. The true masters of the spread of liberalism and tolerance actively hide in the shadows, as all evil does. Instead, they actively create social fringe groups activists comprising the morally weak and socially unwanted to perform their evil desires of civil unrest and vigilante property destruction. For need of attention and social interaction, the morally corrupt willingly perform the deeds of their hidden masters. Only the evil deeds of individual soldiers of liberalism are discovered and punished when they become known. As so, we readily and eagerly punish the effects of liberalism and never the cause. Liberalisms ultimate goal of course is power, which is why so many of them promote and follow the ideals of communism and socialism. They use the unbridled freedoms of our society to commit many evils only to secretly desire to take these freedoms away from others who don’t agree with their deeds. They, the masters of liberalism, secretly feel that they will gain control of our society once society again craves a return to civility, good order, and discipline. For all societies who promote unbridled debaucher, homosexuality, and immorality soon crave a return to basic, necessary, conservative ideals that follow basic biology, security, and safety. For the human condition is one that secretly craves discipline and good order while only momentary does it have fits of depravity and loss of self control. The universal truth of the human condition is that freedom itself does not come from liberalism, but instead, from disciplined self-control. For it is only when one has self-control that one is truly free to think and act apart from slavery. Only self-control gains freedom in the first place. Only self control can prevent its loss. And when liberalism has done its deed the society at large craves once again self-discipline, good order, and civility. Have you not noticed that those who grow up under the most undisciplined homes are those who most readily join the most disciplined branches of our military? It is the formerly most depraved of our society that most often joins the Marine Corps. This is no accident and it is no wrong. Instead, it is simply the instinctive will of the undisciplined mind to crave what it knows that it needs most for self preservation. And so our entire liberal society will soon crave the most ardent and severe discipline of mind and body, just as the Germans did before World War Two. And in like kind, we ourselves will most probably suffer our own “Night of the Long Knives” as the leaders of discipline and good order once again attempt to cleanse the society of those who promoted the most immoral kinds of liberalism and debauchery. For history moves in cycles my friend and most often repeats itself. And the instillation of liberalism, homosexuality, immorality, and depravity in this nation is no accident or happenstance. Instead, it is, as it most probably always has been, the systematic actions of many evil secret societies of persons, actively orchestrating affairs from behind the scenes. It is the billionaire homosexuals who entice their depraved followers to come out of the closet and promote homosexuality while they themselves remain quietly hidden who are systematically destroying our society. It is the lesbian business associations who pool their money for the purposes of depraved advertising and the purchase of great media influence. In conclusion, I will end my rant with the words that began it. Liberalism is the worst disease to ever affect any country that has ever existed. From unbridled and depraved forms of liberalism come almost all forms of dictatorship and totalitarianism when the people revolt against the depravity and earnestly desire self-discipline, good order, and a return to morality. Already past the future", 
        "intTime": 20090502, 
        "postID": 8, 
        "quote": "Originally posted by 1334392: Liberalism is the worst disease to ever affect any country that has ever existed. From unbridled and depraved forms of liberalism come almost all forms of dictatorship and totalitarianism when the people revolt against the depravity and earnestly desire self-discipline, good order, and a return to morality. Let me explain… A Quote from “The Protocols of the Learned Elders of Zion” “In any state in which there is a bad organization of authority, an impersonality of laws and of the rulers who have lost their personality amid the flood of rights ever multiplying out of liberalism, I find a new right – to attack by the right of the strong, and to scatter to the winds all existing forces of order and regulation, to reconstruct all institutions and to become the sovereign lord of those who have left to us the rights of their power by laying them down voluntarily in their liberalism.” Let me explain what this paragraph means with reflection of our own history. In the 1950’s we had the pinnacle of American civilization. The people were united in morality, decency, and purpose. The generation of adults lived through world war and depression. Conservation of resources, discipline of purpose, and strong morality were the hallmarks of this generation of adults. The children, however, rebelled, and were encouraged to rebel, by the liberal ideals of the media elite. America was Christian and groups of persons who were against such ideals banded together to gain control of the press and media sources. Rumors suggest that these liberal groups were supported by enemy governments, such as the Soviet Union. In time, liberalism has used the notion that “all men are created equal” as an excuse to claim that all liberal actions, such as homosexuality and satanic worship, deserve equal consideration under the law and equal importance as ideals to be transmitted among society. Liberals have been allowed, under the guise of freedom speech, to inundate by repetition these flawed ideals among the population. So much so, that the general masses now feel that it is morally flawed to use their own freedom of speech rights to openly object to them. The liberal ideal of tolerance is, in practice, contrary to good order and discipline. Tolerance is the excuse to perform almost any evil deed and spread corruption and debauchery so long as its victims can not be adequately identified on the whole. The true masters of the spread of liberalism and tolerance actively hide in the shadows, as all evil does. Instead, they actively create social fringe groups activists comprising the morally weak and socially unwanted to perform their evil desires of civil unrest and vigilante property destruction. For need of attention and social interaction, the morally corrupt willingly perform the deeds of their hidden masters. Only the evil deeds of individual soldiers of liberalism are discovered and punished when they become known. As so, we readily and eagerly punish the effects of liberalism and never the cause. Liberalisms ultimate goal of course is power, which is why so many of them promote and follow the ideals of communism and socialism. They use the unbridled freedoms of our society to commit many evils only to secretly desire to take these freedoms away from others who don’t agree with their deeds. They, the masters of liberalism, secretly feel that they will gain control of our society once society again craves a return to civility, good order, and discipline. For all societies who promote unbridled debaucher, homosexuality, and immorality soon crave a return to basic, necessary, conservative ideals that follow basic biology, security, and safety. For the human condition is one that secretly craves discipline and good order while only momentary does it have fits of depravity and loss of self control. The universal truth of the human condition is that freedom itself does not come from liberalism, but instead, from disciplined self-control. For it is only when one has self-control that one is truly free to think and act apart from slavery. Only self-control gains freedom in the first place. Only self control can prevent its loss. And when liberalism has done its deed the society at large craves once again self-discipline, good order, and civility. Have you not noticed that those who grow up under the most undisciplined homes are those who most readily join the most disciplined branches of our military? It is the formerly most depraved of our society that most often joins the Marine Corps. This is no accident and it is no wrong. Instead, it is simply the instinctive will of the undisciplined mind to crave what it knows that it needs most for self preservation. And so our entire liberal society will soon crave the most ardent and severe discipline of mind and body, just as the Germans did before World War Two. And in like kind, we ourselves will most probably suffer our own “Night of the Long Knives” as the leaders of discipline and good order once again attempt to cleanse the society of those who promoted the most immoral kinds of liberalism and debauchery. For history moves in cycles my friend and most often repeats itself. And the instillation of liberalism, homosexuality, immorality, and depravity in this nation is no accident or happenstance. Instead, it is, as it most probably always has been, the systematic actions of many evil secret societies of persons, actively orchestrating affairs from behind the scenes. It is the billionaire homosexuals who entice their depraved followers to come out of the closet and promote homosexuality while they themselves remain quietly hidden who are systematically destroying our society. It is the lesbian business associations who pool their money for the purposes of depraved advertising and the purchase of great media influence. In conclusion, I will end my rant with the words that began it. Liberalism is the worst disease to ever affect any country that has ever existed. From unbridled and depraved forms of liberalism come almost all forms of dictatorship and totalitarianism when the people revolt against the depravity and earnestly desire self-discipline, good order, and a return to morality.", 
        "reply": " Already past the future", 
        "threadID": "672198221_6590042222001", 
        "time": "2009-05-02 08:42:00", 
        "title": "Are 2 Marines Being Set Up to Die for The Empire?", 
        "userID": "6486143"
    }, 
    {
        "content": "I was six miles from the Pakistan border during my Afghanistan tour. I'm sure there were people closer.", 
        "intTime": 20090502, 
        "postID": 9, 
        "quote": "", 
        "reply": "I was six miles from the Pakistan border during my Afghanistan tour. I'm sure there were people closer.", 
        "threadID": "672198221_6590042222001", 
        "time": "2009-05-02 09:44:00", 
        "title": "Are 2 Marines Being Set Up to Die for The Empire?", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by 6486143: quote: Originally posted by 1334392 Liberalism is the worst disease to ever affect any country that has ever existed. From unbridled and depraved forms of liberalism come almost all forms of dictatorship and totalitarianism when the people revolt against the depravity and earnestly desire self-discipline, good order, and a return to morality. Let me explain… A Quote from “The Protocols of the Learned Elders of Zion” “In any state in which there is a bad organization of authority, an impersonality of laws and of the rulers who have lost their personality amid the flood of rights ever multiplying out of liberalism, I find a new right – to attack by the right of the strong, and to scatter to the winds all existing forces of order and regulation, to reconstruct all institutions and to become the sovereign lord of those who have left to us the rights of their power by laying them down voluntarily in their liberalism.” Well good for you, applauding the Protocols of the Elders of Zion as a good source of information. Why not quote from Mein Kampf? He hated Liberals and thought they were the source of all evil as well. Dave", 
        "intTime": 20090502, 
        "postID": 10, 
        "quote": "Originally posted by 6486143:", 
        "reply": " quote: Originally posted by 1334392 Liberalism is the worst disease to ever affect any country that has ever existed. From unbridled and depraved forms of liberalism come almost all forms of dictatorship and totalitarianism when the people revolt against the depravity and earnestly desire self-discipline, good order, and a return to morality. Let me explain… A Quote from “The Protocols of the Learned Elders of Zion” “In any state in which there is a bad organization of authority, an impersonality of laws and of the rulers who have lost their personality amid the flood of rights ever multiplying out of liberalism, I find a new right – to attack by the right of the strong, and to scatter to the winds all existing forces of order and regulation, to reconstruct all institutions and to become the sovereign lord of those who have left to us the rights of their power by laying them down voluntarily in their liberalism.” Well good for you, applauding the Protocols of the Elders of Zion as a good source of information. Why not quote from Mein Kampf? He hated Liberals and thought they were the source of all evil as well. Dave", 
        "threadID": "672198221_6590042222001", 
        "time": "2009-05-02 10:12:00", 
        "title": "Are 2 Marines Being Set Up to Die for The Empire?", 
        "userID": "Grachus"
    }, 
    {
        "content": "I thank GOD for Liberals in America, past and present, for without them, the United States of America would never be and we would still be paying homage to the Queen of England. I thank GOD also for \"true\" Conservatives, not the radical righties and 2nd Amendment types who hi-jacked the once great Republican Party, but true Conservatives whose moderating voice was once the cornerstone of the Republican Party, and the conscience of America. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090502, 
        "postID": 11, 
        "quote": "", 
        "reply": "I thank GOD for Liberals in America, past and present, for without them, the United States of America would never be and we would still be paying homage to the Queen of England. I thank GOD also for \"true\" Conservatives, not the radical righties and 2nd Amendment types who hi-jacked the once great Republican Party, but true Conservatives whose moderating voice was once the cornerstone of the Republican Party, and the conscience of America. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6590042222001", 
        "time": "2009-05-02 10:24:00", 
        "title": "Are 2 Marines Being Set Up to Die for The Empire?", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by 1334392: A Quote from “The Protocols of the Learned Elders of Zion”... And what other learned document do you wish to quote from? \"Winnie The Pooh\"? \"Treasure Island\"? \"The Fellowship Of The Ring\" All three of the above are just like “The Protocols of the Learned Elders of Zion” - all works of fiction with no basis in fact or reality.", 
        "intTime": 20090502, 
        "postID": 12, 
        "quote": "Originally posted by 1334392: A Quote from “The Protocols of the Learned Elders of Zion”...", 
        "reply": " And what other learned document do you wish to quote from? \"Winnie The Pooh\"? \"Treasure Island\"? \"The Fellowship Of The Ring\" All three of the above are just like “The Protocols of the Learned Elders of Zion” - all works of fiction with no basis in fact or reality.", 
        "threadID": "672198221_6590042222001", 
        "time": "2009-05-02 10:32:00", 
        "title": "Are 2 Marines Being Set Up to Die for The Empire?", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "Lets take a look at the authors that you have listed here. First is the Winnie the Phoo author. A. A. Milne was a Cambridge graduate and playwright. He also wrote a book, Peace With Honour, condemning World War One. Some would consider him a child prodigy. [WHAT PART OF NO HOT LINKS IS TO MUCH FOR YOU? “Alan Alexander Milne was born in London. His father owned a private school at Mortiner Road, the Henley House. Among the teachers were, for some time, the science fiction writer H.G. Wells. A gifted mathematician, Milne won a scholarship to Westminster School when he was only eleven”... as well, “During World War I Milne served in the Royal Warwickshire Regiment as a signals officer. He was posted to France briefly in 1916 and wrote propaganda for the Intelligence service.” I am sure that I don’t have to tell you that writing propaganda is considered one of the most difficult forms of writing. Expert writers are hired by the government to write propaganda. Ok, now lets go to the second author that you have listed, Robert Louis Balfour Stevenson. [READ THE TOS...NO HOT LINKS “Stevenson was greatly admired by many authors, including Jorge Luis Borges, Ernest Hemingway, Rudyard Kipling, Vladimir Nabokov, J. M. Barrie, and G. K. Chesterton, who said of him that he \"seemed to pick the right word up on the point of his pen, like a man playing spillikins\" “To provide some security, it was agreed that Stevenson should read Law (again at Edinburgh University) and be called to the Scottish bar Yes, a law graduate from Edinburgh University who passed the bar exam. So I guess he doesn't qualify as a worthy author in your eyes either does he? The last author is, J. R. R. Tolkien. [SAY GOOD NIGHT GRACIE,YOU GONE Tolkien was Rawlinson and Bosworth Professor of Anglo-Saxon at Oxford from 1925 to 1945, Oh yes, an Oxford University professor for 20 years. Yes, I am sure that his work is foolish as well. Now that we have destroyed the premise of your argument, that the books, and of course the authors who wrote them, are worthless and the works that they wrote are not worth repeating. We shall now discuss the object of this post, “The Protocols of the Learned Elders of Zion.” It is widely believed that the work itself is a work of fraud, this is true. But to say that it is a fraud is not to state that its words are meaningless. It is only to state that when the author accused the Jews of writing the entire document that he was telling a lie. The words of the Protocols of the learned Elders of Zion is widely know to have come from an earlier work called, “The Prince” and another book called “The Dialog in Hell between Machiavelli and Montesquieu” written by Maurice Jolly Machiavelli is not only considered an expert in political affairs, he is considered by many to be the father of modern political science. [YOU DESERVE A BREAK TODAY “Niccolò di Bernardo dei Machiavelli (3 May 1469 – 21 June 1527) was an Italian philosopher, writer, and politician and is considered one of the main founders of modern political science.” The book \"Dialog in Hell\" was written about Napoleon Bonaparte. A man considered by many to be the second Anti-Christ.The book describes how a despotic regime gains power and then abuses it. “The Prince”, “Dialog in Hell”, and the later book based on those works, “The Protocols of the Learned Elders of Zion” all describe the same methods and techniques of despotic regimes. The methods themselves are not in debate. Instead, they are studied throughout the world. In these books, as I am learning, are written the evils of liberalism. As for our founding fathers being called liberals, I believe they would take offense to this classification. As stated by someone else, They were all extremely wealthy, many with hereditary wealth. - Many owned slaves and it's believed that some abused these slaves. Jefferson apparently fathered children by a couple of his. - They were extremely pro-business. In fact, their opposition to British taxes was the result of the impact those taxes had on their profit. - They used the media to insight the public to war with blatant yellow journalism. Did you know that even with the tea tax, tea in the colonys was cheaper than tea in Great Britain? - They opposed any form of public 'welfare'. - They opposed any form of public tax. ALL taxes came from import fees. - They insighted war with England more to free their business enterprises from British taxation and control rather than for any altruistic 'human rights'. - They were all, to a man, devoutly religious and sought to protect religion from government oppression. Does this sound liberal to you? The founding fathers were anything but the modern classification of Liberal. They would turn over in their graves if you classified them with homosexuals and atheists. It is these same evil liberals who have attempted to hijack historical facts and lie about them to further their cause. The founding fathers were conservatives. They simply weren't worshipers of the king. What a perverse lie it is to claim that freedom of speech, the right to keep and bear arms, and Christian religious values are liberal ideals. You need to stop swallowing whole the lies that evil iberal college professors dictate to the hapless, naive youths of our society. This message has been edited. Last edited by: <NEMESIS1960>, Sat 02 May 2009 10:46 PM", 
        "intTime": 20090502, 
        "postID": 13, 
        "quote": "", 
        "reply": "Lets take a look at the authors that you have listed here. First is the Winnie the Phoo author. A. A. Milne was a Cambridge graduate and playwright. He also wrote a book, Peace With Honour, condemning World War One. Some would consider him a child prodigy. [WHAT PART OF NO HOT LINKS IS TO MUCH FOR YOU? “Alan Alexander Milne was born in London. His father owned a private school at Mortiner Road, the Henley House. Among the teachers were, for some time, the science fiction writer H.G. Wells. A gifted mathematician, Milne won a scholarship to Westminster School when he was only eleven”... as well, “During World War I Milne served in the Royal Warwickshire Regiment as a signals officer. He was posted to France briefly in 1916 and wrote propaganda for the Intelligence service.” I am sure that I don’t have to tell you that writing propaganda is considered one of the most difficult forms of writing. Expert writers are hired by the government to write propaganda. Ok, now lets go to the second author that you have listed, Robert Louis Balfour Stevenson. [READ THE TOS...NO HOT LINKS “Stevenson was greatly admired by many authors, including Jorge Luis Borges, Ernest Hemingway, Rudyard Kipling, Vladimir Nabokov, J. M. Barrie, and G. K. Chesterton, who said of him that he \"seemed to pick the right word up on the point of his pen, like a man playing spillikins\" “To provide some security, it was agreed that Stevenson should read Law (again at Edinburgh University) and be called to the Scottish bar Yes, a law graduate from Edinburgh University who passed the bar exam. So I guess he doesn't qualify as a worthy author in your eyes either does he? The last author is, J. R. R. Tolkien. [SAY GOOD NIGHT GRACIE,YOU GONE Tolkien was Rawlinson and Bosworth Professor of Anglo-Saxon at Oxford from 1925 to 1945, Oh yes, an Oxford University professor for 20 years. Yes, I am sure that his work is foolish as well. Now that we have destroyed the premise of your argument, that the books, and of course the authors who wrote them, are worthless and the works that they wrote are not worth repeating. We shall now discuss the object of this post, “The Protocols of the Learned Elders of Zion.” It is widely believed that the work itself is a work of fraud, this is true. But to say that it is a fraud is not to state that its words are meaningless. It is only to state that when the author accused the Jews of writing the entire document that he was telling a lie. The words of the Protocols of the learned Elders of Zion is widely know to have come from an earlier work called, “The Prince” and another book called “The Dialog in Hell between Machiavelli and Montesquieu” written by Maurice Jolly Machiavelli is not only considered an expert in political affairs, he is considered by many to be the father of modern political science. [YOU DESERVE A BREAK TODAY “Niccolò di Bernardo dei Machiavelli (3 May 1469 – 21 June 1527) was an Italian philosopher, writer, and politician and is considered one of the main founders of modern political science.” The book \"Dialog in Hell\" was written about Napoleon Bonaparte. A man considered by many to be the second Anti-Christ.The book describes how a despotic regime gains power and then abuses it. “The Prince”, “Dialog in Hell”, and the later book based on those works, “The Protocols of the Learned Elders of Zion” all describe the same methods and techniques of despotic regimes. The methods themselves are not in debate. Instead, they are studied throughout the world. In these books, as I am learning, are written the evils of liberalism. As for our founding fathers being called liberals, I believe they would take offense to this classification. As stated by someone else, They were all extremely wealthy, many with hereditary wealth. - Many owned slaves and it's believed that some abused these slaves. Jefferson apparently fathered children by a couple of his. - They were extremely pro-business. In fact, their opposition to British taxes was the result of the impact those taxes had on their profit. - They used the media to insight the public to war with blatant yellow journalism. Did you know that even with the tea tax, tea in the colonys was cheaper than tea in Great Britain? - They opposed any form of public 'welfare'. - They opposed any form of public tax. ALL taxes came from import fees. - They insighted war with England more to free their business enterprises from British taxation and control rather than for any altruistic 'human rights'. - They were all, to a man, devoutly religious and sought to protect religion from government oppression. Does this sound liberal to you? The founding fathers were anything but the modern classification of Liberal. They would turn over in their graves if you classified them with homosexuals and atheists. It is these same evil liberals who have attempted to hijack historical facts and lie about them to further their cause. The founding fathers were conservatives. They simply weren't worshipers of the king. What a perverse lie it is to claim that freedom of speech, the right to keep and bear arms, and Christian religious values are liberal ideals. You need to stop swallowing whole the lies that evil iberal college professors dictate to the hapless, naive youths of our society. This message has been edited. Last edited by: <NEMESIS1960>, Sat 02 May 2009 10:46 PM", 
        "threadID": "672198221_6590042222001", 
        "time": "2009-05-02 17:27:00", 
        "title": "Are 2 Marines Being Set Up to Die for The Empire?", 
        "userID": "1334392"
    }, 
    {
        "content": "quote: Originally posted by 1334392: They were all extremely wealthy, many with hereditary wealth. - Many owned slaves and it's believed that some abused these slaves. Jefferson apparently fathered children by a couple of his. - They were extremely pro-business. In fact, their opposition to British taxes was the result of the impact those taxes had on their profit. - They used the media to insight the public to war with blatant yellow journalism. Did you know that even with the tea tax, tea in the colonys was cheaper than tea in Great Britain? - They opposed any form of public 'welfare'. - They opposed any form of public tax. ALL taxes came from import fees. - They insighted war with England more to free their business enterprises from British taxation and control rather than for any altruistic 'human rights'. - They were all, to a man, devoutly religious and sought to protect religion from government oppression. Does this sound liberal to you? It sounds like you are full of schit. Sam Adams? Thomas Paine, Patirck Henry, Ethan Allan? All wealthy? All religious fanatics? Just who the hell wrote the Bill of Rights? Attila the Hun? Name one of the Founders besides Hancock who made a dime off of tea? The plain fact of the matter is that while taxes triggered a civil rights movement, it was the British response to peaceful civil disobedience that started the Revolution. It was the \"Intolerable Acts\" that caused a civil issue to become a revolutionary one. The suspension of local government. The suspension of trial by jury. The suspension of Habeaus Corpus. The defacto imposition of a condition approaching slavery, that changed the protestors into Revolutionaries. \"Taxation without Representation\" was the slogan of a civil rights movement - It was British acts of tyrany which converted that movement into a movement for independance. quote: Originally posted by 1334392: The founding fathers were anything but the modern classification of Liberal. They would turn over in their graves if you classified them with homosexuals and atheists. It is these same evil liberals who have attempted to hijack historical facts and lie about them to further their cause. The founding fathers were conservatives. Both Tom Paine and Ethan Allan wrote books attacking organised religion and supporting Free thinkers. Many others were Diests. The first results of the revolution was the End of government supported religion. The abolishment of State Religions. The legalisation of the right of anyone to believe or not believe whatever they wanted to. No where else in the world was this true. Indeed, its STILL not true for much of the world. quote: Originally posted by 1334392: They simply weren't worshipers of the king. What a perverse lie it is to claim that freedom of speech, the right to keep and bear arms, and Christian religious values are liberal ideals. You need to stop swallowing whole the lies that evil iberal college professors dictate to the hapless, naive youths of our society. If their not \"liberal values,\" they sure as hell aren't the totalitarian values you recomend in your first post. The right of privacy, the right of free speech, the right of a free press, the right to believe or not believe, anyway you please. The right of a fair trial. The RIGHT of Habeaus Corpus. The right to protest against the government. The right to bear arms. Most of the world today does not recognise these rights. You quoted from the Protocols of the Elders of Zion, you could just as well quoted the exact same thing from Mein Kampf, with the explanation that, \"Well Hitler was a bad guy doesn't mean he was always wrong.\" The United States Constitution is the most Liberal Document in the history of the world. If it had compromises to slavery, unlike other Constitutions it had it's own internal mechanisms for change. Indeed, with the exception of slavery, there's been little change in the basic structure of that document, and even those changes, such as one man, one vote, were all accomplished by the 1830's, long before your supposed Liberal professors were around. The REALLY wealthy all sided with the King. And we kicked their sorry azzes out of the country. Now in your previous post you wrote: quote: Originally posted by 1334392: The liberal ideal of tolerance is, in practice, contrary to good order and discipline. Tolerance is the excuse to perform almost any evil deed and spread corruption and debauchery so long as its victims can not be adequately identified on the whole. The true masters of the spread of liberalism and tolerance actively hide in the shadows, as all evil does. Instead, they actively create social fringe groups activists comprising the morally weak and socially unwanted to perform their evil desires of civil unrest and vigilante property destruction. For need of attention and social interaction, the morally corrupt willingly perform the deeds of their hidden masters. Only the evil deeds of individual soldiers of liberalism are discovered and punished when they become known. As so, we readily and eagerly punish the effects of liberalism and never the cause. Liberalisms ultimate goal of course is power, which is why so many of them promote and follow the ideals of communism and socialism. They use the unbridled freedoms of our society to commit many evils only to secretly desire to take these freedoms away from others who don’t agree with their deeds. Plain and simply, all you are is a Fascist, who suddenly realised your first post just ain't going down so well. So now you are reduced to slandering the Founders of our country, the authors of our Liberal Freedoms, and of course covering your tracks with platitudes which just ain't true. Dave", 
        "intTime": 20090502, 
        "postID": 14, 
        "quote": "Originally posted by 1334392: They were all extremely wealthy, many with hereditary wealth. - Many owned slaves and it's believed that some abused these slaves. Jefferson apparently fathered children by a couple of his. - They were extremely pro-business. In fact, their opposition to British taxes was the result of the impact those taxes had on their profit. - They used the media to insight the public to war with blatant yellow journalism. Did you know that even with the tea tax, tea in the colonys was cheaper than tea in Great Britain? - They opposed any form of public 'welfare'. - They opposed any form of public tax. ALL taxes came from import fees. - They insighted war with England more to free their business enterprises from British taxation and control rather than for any altruistic 'human rights'. - They were all, to a man, devoutly religious and sought to protect religion from government oppression. Does this sound liberal to you?", 
        "reply": " It sounds like you are full of schit. Sam Adams? Thomas Paine, Patirck Henry, Ethan Allan? All wealthy? All religious fanatics? Just who the hell wrote the Bill of Rights? Attila the Hun? Name one of the Founders besides Hancock who made a dime off of tea? The plain fact of the matter is that while taxes triggered a civil rights movement, it was the British response to peaceful civil disobedience that started the Revolution. It was the \"Intolerable Acts\" that caused a civil issue to become a revolutionary one. The suspension of local government. The suspension of trial by jury. The suspension of Habeaus Corpus. The defacto imposition of a condition approaching slavery, that changed the protestors into Revolutionaries. \"Taxation without Representation\" was the slogan of a civil rights movement - It was British acts of tyrany which converted that movement into a movement for independance. quote: Originally posted by 1334392: The founding fathers were anything but the modern classification of Liberal. They would turn over in their graves if you classified them with homosexuals and atheists. It is these same evil liberals who have attempted to hijack historical facts and lie about them to further their cause. The founding fathers were conservatives. Both Tom Paine and Ethan Allan wrote books attacking organised religion and supporting Free thinkers. Many others were Diests. The first results of the revolution was the End of government supported religion. The abolishment of State Religions. The legalisation of the right of anyone to believe or not believe whatever they wanted to. No where else in the world was this true. Indeed, its STILL not true for much of the world. quote: Originally posted by 1334392: They simply weren't worshipers of the king. What a perverse lie it is to claim that freedom of speech, the right to keep and bear arms, and Christian religious values are liberal ideals. You need to stop swallowing whole the lies that evil iberal college professors dictate to the hapless, naive youths of our society. If their not \"liberal values,\" they sure as hell aren't the totalitarian values you recomend in your first post. The right of privacy, the right of free speech, the right of a free press, the right to believe or not believe, anyway you please. The right of a fair trial. The RIGHT of Habeaus Corpus. The right to protest against the government. The right to bear arms. Most of the world today does not recognise these rights. You quoted from the Protocols of the Elders of Zion, you could just as well quoted the exact same thing from Mein Kampf, with the explanation that, \"Well Hitler was a bad guy doesn't mean he was always wrong.\" The United States Constitution is the most Liberal Document in the history of the world. If it had compromises to slavery, unlike other Constitutions it had it's own internal mechanisms for change. Indeed, with the exception of slavery, there's been little change in the basic structure of that document, and even those changes, such as one man, one vote, were all accomplished by the 1830's, long before your supposed Liberal professors were around. The REALLY wealthy all sided with the King. And we kicked their sorry azzes out of the country. Now in your previous post you wrote: quote: Originally posted by 1334392: The liberal ideal of tolerance is, in practice, contrary to good order and discipline. Tolerance is the excuse to perform almost any evil deed and spread corruption and debauchery so long as its victims can not be adequately identified on the whole. The true masters of the spread of liberalism and tolerance actively hide in the shadows, as all evil does. Instead, they actively create social fringe groups activists comprising the morally weak and socially unwanted to perform their evil desires of civil unrest and vigilante property destruction. For need of attention and social interaction, the morally corrupt willingly perform the deeds of their hidden masters. Only the evil deeds of individual soldiers of liberalism are discovered and punished when they become known. As so, we readily and eagerly punish the effects of liberalism and never the cause. Liberalisms ultimate goal of course is power, which is why so many of them promote and follow the ideals of communism and socialism. They use the unbridled freedoms of our society to commit many evils only to secretly desire to take these freedoms away from others who don’t agree with their deeds. Plain and simply, all you are is a Fascist, who suddenly realised your first post just ain't going down so well. So now you are reduced to slandering the Founders of our country, the authors of our Liberal Freedoms, and of course covering your tracks with platitudes which just ain't true. Dave", 
        "threadID": "672198221_6590042222001", 
        "time": "2009-05-02 18:05:00", 
        "title": "Are 2 Marines Being Set Up to Die for The Empire?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: I thank GOD for Liberals in America, past and present, for without them, the United States of America would never be and we would still be paying homage to the Queen of England. I thank GOD also for \"true\" Conservatives, not the radical righties and 2nd Amendment types who hi-jacked the once great Republican Party, but true Conservatives whose moderating voice was once the cornerstone of the Republican Party, and the conscience of America. ...OK LEEKY Already past the future", 
        "intTime": 20090502, 
        "postID": 15, 
        "quote": "Originally posted by jack_flats: I thank GOD for Liberals in America, past and present, for without them, the United States of America would never be and we would still be paying homage to the Queen of England. I thank GOD also for \"true\" Conservatives, not the radical righties and 2nd Amendment types who hi-jacked the once great Republican Party, but true Conservatives whose moderating voice was once the cornerstone of the Republican Party, and the conscience of America.", 
        "reply": " ...OK LEEKY Already past the future", 
        "threadID": "672198221_6590042222001", 
        "time": "2009-05-02 18:09:00", 
        "title": "Are 2 Marines Being Set Up to Die for The Empire?", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by 6486143: quote: Originally posted by jack_flats: I thank GOD for Liberals in America, past and present, for without them, the United States of America would never be and we would still be paying homage to the Queen of England. I thank GOD also for \"true\" Conservatives, not the radical righties and 2nd Amendment types who hi-jacked the once great Republican Party, but true Conservatives whose moderating voice was once the cornerstone of the Republican Party, and the conscience of America. ...OK LEEKY Leeky? That the best you got? Care to explain what you mean here? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090502, 
        "postID": 16, 
        "quote": "Originally posted by 6486143: quote: Originally posted by jack_flats: I thank GOD for Liberals in America, past and present, for without them, the United States of America would never be and we would still be paying homage to the Queen of England. I thank GOD also for \"true\" Conservatives, not the radical righties and 2nd Amendment types who hi-jacked the once great Republican Party, but true Conservatives whose moderating voice was once the cornerstone of the Republican Party, and the conscience of America. ...OK LEEKY", 
        "reply": " Leeky? That the best you got? Care to explain what you mean here? \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6590042222001", 
        "time": "2009-05-02 21:10:00", 
        "title": "Are 2 Marines Being Set Up to Die for The Empire?", 
        "userID": "jack_flats"
    }
]