[
    {
        "content": "Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation.",
        "intTime": 20090309,
        "postID": 1,
        "quote": "",
        "reply": "Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation.",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-09 15:16:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "crackerjacks61"
    },
    {
        "content": "I have always said that the Saudi's are the head of the snake but nobody believes me.",
        "intTime": 20090309,
        "postID": 2,
        "quote": "",
        "reply": "I have always said that the Saudi's are the head of the snake but nobody believes me.",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-09 17:58:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Duster6: I have always said that the Saudi's are the head of the snake but nobody believes me. and it is time to \"cut it off\".... we have what we need right here... time to put the PC eco friendly crap on hold and take care of out own, with our own. One Flag......One Heart......One Nation............EVERMORE",
        "intTime": 20090309,
        "postID": 3,
        "quote": "Originally posted by Duster6: I have always said that the Saudi's are the head of the snake but nobody believes me.",
        "reply": " and it is time to \"cut it off\".... we have what we need right here... time to put the PC eco friendly crap on hold and take care of out own, with our own. One Flag......One Heart......One Nation............EVERMORE",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-09 18:15:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "m551sheridan"
    },
    {
        "content": "The Sauidis are slavers!",
        "intTime": 20090309,
        "postID": 4,
        "quote": "",
        "reply": "The Sauidis are slavers!",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-09 18:25:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "EAG154"
    },
    {
        "content": "Their religious police are determined to go down fighting, losing a lot of prestige and power recently. Women are now taking positions in teaching, medical, business and government. The King has recently replaced the head clergy that determines the tone in the Mosque each Friday. How far this interference will go you can only hope. To make such a ruling on a 75 year old woman is a death sentence, begs for invention.",
        "intTime": 20090309,
        "postID": 5,
        "quote": "",
        "reply": "Their religious police are determined to go down fighting, losing a lot of prestige and power recently. Women are now taking positions in teaching, medical, business and government. The King has recently replaced the head clergy that determines the tone in the Mosque each Friday. How far this interference will go you can only hope. To make such a ruling on a 75 year old woman is a death sentence, begs for invention.",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-09 18:39:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "rayevinsonsr"
    },
    {
        "content": "They have made substantial progress in Womens issues of late.......I must agree with that. I think I could hold up Barney Frank's performance in Saudi Arabia and garner equal disgust in that country over how they could do business with the United States. Wait a minute, I could do that in Texas even....LOL.",
        "intTime": 20090309,
        "postID": 6,
        "quote": "",
        "reply": "They have made substantial progress in Womens issues of late.......I must agree with that. I think I could hold up Barney Frank's performance in Saudi Arabia and garner equal disgust in that country over how they could do business with the United States. Wait a minute, I could do that in Texas even....LOL.",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-09 22:35:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "ErichG2"
    },
    {
        "content": "quote: Originally posted by Duster6: I have always said that the Saudi's are the head of the snake but nobody believes me. I agree. I'm beginning to formulate the opinion that being anything other than a reluctant trading partner with SA (oil) is immoral and Un-American. Our military needs to relocate and we should minimize diplomatic activity due to their severe and daily human rights violations. No more hand-holding.",
        "intTime": 20090310,
        "postID": 7,
        "quote": "Originally posted by Duster6: I have always said that the Saudi's are the head of the snake but nobody believes me.",
        "reply": " I agree. I'm beginning to formulate the opinion that being anything other than a reluctant trading partner with SA (oil) is immoral and Un-American. Our military needs to relocate and we should minimize diplomatic activity due to their severe and daily human rights violations. No more hand-holding.",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 02:41:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "vsibaby"
    },
    {
        "content": "You know the reason nobody can find bin Laden? Because he is living in Saudi, in comfort and wealth, being hidden by wealthy and influential Saudi's, bin Laden and his entire family. Come on now, why have they not even found a single member of his family, other than for the son who showed up in Spain a few months ago. The guy is rich, very very rich, as is his family, as is his family well connected in Saudi government circles. In my opinion, Saudi Arabia is the REAL enemy. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090310,
        "postID": 8,
        "quote": "",
        "reply": "You know the reason nobody can find bin Laden? Because he is living in Saudi, in comfort and wealth, being hidden by wealthy and influential Saudi's, bin Laden and his entire family. Come on now, why have they not even found a single member of his family, other than for the son who showed up in Spain a few months ago. The guy is rich, very very rich, as is his family, as is his family well connected in Saudi government circles. In my opinion, Saudi Arabia is the REAL enemy. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 10:23:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by jack_flats: You know the reason nobody can find bin Laden? Because he is living in Saudi, in comfort and wealth, being hidden by wealthy and influential Saudi's, bin Laden and his entire family. Come on now, why have they not even found a single member of his family, other than for the son who showed up in Spain a few months ago. The guy is rich, very very rich, as is his family, as is his family well connected in Saudi government circles. In my opinion, Saudi Arabia is the REAL enemy. Why were at it let's just attack the whole Middle East. Get it over with. Just start on one side and sweep to the other killing everybody. That way we don't have to ever worry about them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090310,
        "postID": 9,
        "quote": "Originally posted by jack_flats: You know the reason nobody can find bin Laden? Because he is living in Saudi, in comfort and wealth, being hidden by wealthy and influential Saudi's, bin Laden and his entire family. Come on now, why have they not even found a single member of his family, other than for the son who showed up in Spain a few months ago. The guy is rich, very very rich, as is his family, as is his family well connected in Saudi government circles. In my opinion, Saudi Arabia is the REAL enemy.",
        "reply": " Why were at it let's just attack the whole Middle East. Get it over with. Just start on one side and sweep to the other killing everybody. That way we don't have to ever worry about them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 10:27:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation. Sorry to say it, but that is the way their justice is done over there. The Religious police that they have are above the actual police that they have. This is not uncommon. People who steal get their hands cut off. This is the way they practice their religion and their Criminal Justice System. I don't believe it is humane, but America can't go around and tell other countries how to discipline their own people. Then we would be a dictator. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090310,
        "postID": 10,
        "quote": "Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation.",
        "reply": " Sorry to say it, but that is the way their justice is done over there. The Religious police that they have are above the actual police that they have. This is not uncommon. People who steal get their hands cut off. This is the way they practice their religion and their Criminal Justice System. I don't believe it is humane, but America can't go around and tell other countries how to discipline their own people. Then we would be a dictator. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 10:29:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation. Sorry to say it, but that is the way their justice is done over there. The Religious police that they have are above the actual police that they have. This is not uncommon. People who steal get their hands cut off. This is the way they practice their religion and their Criminal Justice System. I don't believe it is humane, but America can't go around and tell other countries how to discipline their own people. Then we would be a dictator. Usually they are the first ones to tell Americans we shouldn't wage a war to give people freedoms and do away with tyrants. Damn if we do, damned if we don't. Before the American revolution those that were held for thievery in Williamsburg (since there was no thing as a jail) would have an ear nailed to the wall. Piercing was not the intent. the culprit could stay nailed, or could pull free making an even larger hole as the nail was tapered. It was not hard to determine a thief thereafter, just look at the lobes. Imagine this type of justice in 2009.",
        "intTime": 20090310,
        "postID": 11,
        "quote": "Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation. Sorry to say it, but that is the way their justice is done over there. The Religious police that they have are above the actual police that they have. This is not uncommon. People who steal get their hands cut off. This is the way they practice their religion and their Criminal Justice System. I don't believe it is humane, but America can't go around and tell other countries how to discipline their own people. Then we would be a dictator.",
        "reply": " Usually they are the first ones to tell Americans we shouldn't wage a war to give people freedoms and do away with tyrants. Damn if we do, damned if we don't. Before the American revolution those that were held for thievery in Williamsburg (since there was no thing as a jail) would have an ear nailed to the wall. Piercing was not the intent. the culprit could stay nailed, or could pull free making an even larger hole as the nail was tapered. It was not hard to determine a thief thereafter, just look at the lobes. Imagine this type of justice in 2009.",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 10:43:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "rayevinsonsr"
    },
    {
        "content": "Interesting. It seems to be a bipartisan consensus that the saudis are a bunch of 3 eyed kissing cousins who oughta have their laundry turned inside out.",
        "intTime": 20090310,
        "postID": 12,
        "quote": "",
        "reply": "Interesting. It seems to be a bipartisan consensus that the saudis are a bunch of 3 eyed kissing cousins who oughta have their laundry turned inside out.",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 10:49:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "Sand_Flea"
    },
    {
        "content": "*sigh* And people wonder why I insist that mixing religion with law is a BAD IDEA. Religious police beating old women because of the alleged \"word of God\"... sick, sick people. The United States is not a backwards religious dictatorship... and let's hope it never becomes one, or Saudi Arabia will be nothing more than a mirror to us.",
        "intTime": 20090310,
        "postID": 13,
        "quote": "",
        "reply": "*sigh* And people wonder why I insist that mixing religion with law is a BAD IDEA. Religious police beating old women because of the alleged \"word of God\"... sick, sick people. The United States is not a backwards religious dictatorship... and let's hope it never becomes one, or Saudi Arabia will be nothing more than a mirror to us.",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 10:52:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "Whirled_Peas"
    },
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation. Sorry to say it, but that is the way their justice is done over there. The Religious police that they have are above the actual police that they have. This is not uncommon. People who steal get their hands cut off. This is the way they practice their religion and their Criminal Justice System. I don't believe it is humane, but America can't go around and tell other countries how to discipline their own people. Then we would be a dictator. No, just Saudi. Just Saudi is the enemy. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090310,
        "postID": 14,
        "quote": "Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation. Sorry to say it, but that is the way their justice is done over there. The Religious police that they have are above the actual police that they have. This is not uncommon. People who steal get their hands cut off. This is the way they practice their religion and their Criminal Justice System. I don't believe it is humane, but America can't go around and tell other countries how to discipline their own people. Then we would be a dictator.",
        "reply": " No, just Saudi. Just Saudi is the enemy. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 10:52:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "jack_flats"
    },
    {
        "content": "quote: No, just Saudi. Just Saudi is the enemy. Comon Jack, give some credit to Iran, Pakistan, Afghanistan, and few other stans.",
        "intTime": 20090310,
        "postID": 15,
        "quote": "No, just Saudi. Just Saudi is the enemy.",
        "reply": " Comon Jack, give some credit to Iran, Pakistan, Afghanistan, and few other stans.",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 11:18:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "rayevinsonsr"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation. So, let's see, till we have solved or at least made up for the resultant loss of \"OIL\", that would come from them, you are willing to subject the \"little old ladies\" of this country to freezing and starving to death, because they couldn't afford to heat their homes, buy food and cook it... Yup, makes sense to me, NOT!... So, YOU choose, buy Saudi crude or drive the costs of food and utilities up here... One day, hopefully, we will not need their crude oil but, right now we do... YOU figure it out!... Respectfully, SUNLINER81",
        "intTime": 20090310,
        "postID": 16,
        "quote": "Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation.",
        "reply": " So, let's see, till we have solved or at least made up for the resultant loss of \"OIL\", that would come from them, you are willing to subject the \"little old ladies\" of this country to freezing and starving to death, because they couldn't afford to heat their homes, buy food and cook it... Yup, makes sense to me, NOT!... So, YOU choose, buy Saudi crude or drive the costs of food and utilities up here... One day, hopefully, we will not need their crude oil but, right now we do... YOU figure it out!... Respectfully, SUNLINER81",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 11:36:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "SUNLINER81"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation. Interesting, but is the economics of oil or their Islam beliefs that bother you the most? It's preached here not to mix politics and religion, but when it happens in other countries, we are appalled? We don't have to succum to Saudi Arabia for oil when the availability of reserves in Alaska will provide all we need and then we could tell SA to get lost. But until the tree hugging libs will stop their opposition to that, what can we do?",
        "intTime": 20090310,
        "postID": 17,
        "quote": "Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation.",
        "reply": " Interesting, but is the economics of oil or their Islam beliefs that bother you the most? It's preached here not to mix politics and religion, but when it happens in other countries, we are appalled? We don't have to succum to Saudi Arabia for oil when the availability of reserves in Alaska will provide all we need and then we could tell SA to get lost. But until the tree hugging libs will stop their opposition to that, what can we do?",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 11:36:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "busnrete8"
    },
    {
        "content": "In the 1740's the House of Saud and the House of Wahhab entered into a treaty and binding marrage. The Wahhabi would dictate rthe Muslim Religion on the Arabian Peninsula , the Saudi would run government. Neither would interfear with the others realm. Fast forward almost three hundred years, fortunes wax and wane and, except for the unprotected traveler,no one cared what a bunch of Bedoin nomads did to each other. Then, there was OIL discovered in Arabia, then BIG OIL was discovered in the 1930's. It was diacovered by the Brits.. Treaties were made, America moved in, ARAMCO was fomed and BILLIONS went into the Saudi bank accounts. And the house of Wahhab? They has continued their teaching of THEIR VERSION of the Muslin religion. And, THEY rules the more primitive peoples minds. Now, the Wahhabi detest the Saudi, but honor their end of the 1740's treaty while seeking damned near any excuse to accuse the Saudi \"Princes\" os apostacy. The Saudi keep a very loyal \"modern army\" at their back, reducing the chances that the Wahhabi will turn on them. The Saudi Families, mostly modern, educated in Great Britian and at American Colleges, keep the religuious law in place. Otherwise they risk a revolt, as the religious know damned well the Saudi Familes are indeed apostates. So, what should OUR role be? Do we destabelize the House of Saud? If so, how do we influence who takes over? How can we restore order in the land on MECCA without a world wide open aNTI WESTERN \"Jihad\" against western culture and the great satan? All the while keeping Saudi oil flowing to Europe, Japan and India? We could cut off Saudi oil and would be moderately inconvenienced until the Cabnadians could take up the slack. Or we got sereous about north slope oil, Colorado Shale, Bakken oil, etc etc.. So here we are, and there they are. Solutions that keep the Arabian Oil flowing, or are we up for a several decade world widwe religious war?",
        "intTime": 20090310,
        "postID": 18,
        "quote": "",
        "reply": "In the 1740's the House of Saud and the House of Wahhab entered into a treaty and binding marrage. The Wahhabi would dictate rthe Muslim Religion on the Arabian Peninsula , the Saudi would run government. Neither would interfear with the others realm. Fast forward almost three hundred years, fortunes wax and wane and, except for the unprotected traveler,no one cared what a bunch of Bedoin nomads did to each other. Then, there was OIL discovered in Arabia, then BIG OIL was discovered in the 1930's. It was diacovered by the Brits.. Treaties were made, America moved in, ARAMCO was fomed and BILLIONS went into the Saudi bank accounts. And the house of Wahhab? They has continued their teaching of THEIR VERSION of the Muslin religion. And, THEY rules the more primitive peoples minds. Now, the Wahhabi detest the Saudi, but honor their end of the 1740's treaty while seeking damned near any excuse to accuse the Saudi \"Princes\" os apostacy. The Saudi keep a very loyal \"modern army\" at their back, reducing the chances that the Wahhabi will turn on them. The Saudi Families, mostly modern, educated in Great Britian and at American Colleges, keep the religuious law in place. Otherwise they risk a revolt, as the religious know damned well the Saudi Familes are indeed apostates. So, what should OUR role be? Do we destabelize the House of Saud? If so, how do we influence who takes over? How can we restore order in the land on MECCA without a world wide open aNTI WESTERN \"Jihad\" against western culture and the great satan? All the while keeping Saudi oil flowing to Europe, Japan and India? We could cut off Saudi oil and would be moderately inconvenienced until the Cabnadians could take up the slack. Or we got sereous about north slope oil, Colorado Shale, Bakken oil, etc etc.. So here we are, and there they are. Solutions that keep the Arabian Oil flowing, or are we up for a several decade world widwe religious war?",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 12:18:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "peter3_1"
    },
    {
        "content": "quote: Originally posted by jack_flats: You know the reason nobody can find bin Laden? Because he is living in Saudi, in comfort and wealth, being hidden by wealthy and influential Saudi's, bin Laden and his entire family. Come on now, why have they not even found a single member of his family, other than for the son who showed up in Spain a few months ago. The guy is rich, very very rich, as is his family, as is his family well connected in Saudi government circles. In my opinion, Saudi Arabia is the REAL enemy. You do realize that that is totally crazy right? Osama Bin Laden is a huge threat to the Saudi royal family. Christ, spend five minutes on wikipedia researching that...",
        "intTime": 20090310,
        "postID": 19,
        "quote": "Originally posted by jack_flats: You know the reason nobody can find bin Laden? Because he is living in Saudi, in comfort and wealth, being hidden by wealthy and influential Saudi's, bin Laden and his entire family. Come on now, why have they not even found a single member of his family, other than for the son who showed up in Spain a few months ago. The guy is rich, very very rich, as is his family, as is his family well connected in Saudi government circles. In my opinion, Saudi Arabia is the REAL enemy.",
        "reply": " You do realize that that is totally crazy right? Osama Bin Laden is a huge threat to the Saudi royal family. Christ, spend five minutes on wikipedia researching that...",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 12:26:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by foxred03: quote: Originally posted by jack_flats: You know the reason nobody can find bin Laden? Because he is living in Saudi, in comfort and wealth, being hidden by wealthy and influential Saudi's, bin Laden and his entire family. Come on now, why have they not even found a single member of his family, other than for the son who showed up in Spain a few months ago. The guy is rich, very very rich, as is his family, as is his family well connected in Saudi government circles. In my opinion, Saudi Arabia is the REAL enemy. You do realize that that is totally crazy right? Osama Bin Laden is a huge threat to the Saudi royal family. Christ, spend five minutes on wikipedia researching that... Wikipedia is not an actual source. It is more of a blog. It is not accepted by colleges to use in papers. It should not be allowed here. But that is up to everyone here. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090310,
        "postID": 20,
        "quote": "Originally posted by foxred03: quote: Originally posted by jack_flats: You know the reason nobody can find bin Laden? Because he is living in Saudi, in comfort and wealth, being hidden by wealthy and influential Saudi's, bin Laden and his entire family. Come on now, why have they not even found a single member of his family, other than for the son who showed up in Spain a few months ago. The guy is rich, very very rich, as is his family, as is his family well connected in Saudi government circles. In my opinion, Saudi Arabia is the REAL enemy. You do realize that that is totally crazy right? Osama Bin Laden is a huge threat to the Saudi royal family. Christ, spend five minutes on wikipedia researching that...",
        "reply": " Wikipedia is not an actual source. It is more of a blog. It is not accepted by colleges to use in papers. It should not be allowed here. But that is up to everyone here. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 12:30:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "Anbar7"
    },
    {
        "content": "Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation.",
        "intTime": 20090309,
        "postID": 21,
        "quote": "",
        "reply": "Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation.",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-09 15:16:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "crackerjacks61"
    },
    {
        "content": "I have always said that the Saudi's are the head of the snake but nobody believes me.",
        "intTime": 20090309,
        "postID": 22,
        "quote": "",
        "reply": "I have always said that the Saudi's are the head of the snake but nobody believes me.",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-09 17:58:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Duster6: I have always said that the Saudi's are the head of the snake but nobody believes me. and it is time to \"cut it off\".... we have what we need right here... time to put the PC eco friendly crap on hold and take care of out own, with our own. One Flag......One Heart......One Nation............EVERMORE",
        "intTime": 20090309,
        "postID": 23,
        "quote": "Originally posted by Duster6: I have always said that the Saudi's are the head of the snake but nobody believes me.",
        "reply": " and it is time to \"cut it off\".... we have what we need right here... time to put the PC eco friendly crap on hold and take care of out own, with our own. One Flag......One Heart......One Nation............EVERMORE",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-09 18:15:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "m551sheridan"
    },
    {
        "content": "The Sauidis are slavers!",
        "intTime": 20090309,
        "postID": 24,
        "quote": "",
        "reply": "The Sauidis are slavers!",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-09 18:25:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "EAG154"
    },
    {
        "content": "Their religious police are determined to go down fighting, losing a lot of prestige and power recently. Women are now taking positions in teaching, medical, business and government. The King has recently replaced the head clergy that determines the tone in the Mosque each Friday. How far this interference will go you can only hope. To make such a ruling on a 75 year old woman is a death sentence, begs for invention.",
        "intTime": 20090309,
        "postID": 25,
        "quote": "",
        "reply": "Their religious police are determined to go down fighting, losing a lot of prestige and power recently. Women are now taking positions in teaching, medical, business and government. The King has recently replaced the head clergy that determines the tone in the Mosque each Friday. How far this interference will go you can only hope. To make such a ruling on a 75 year old woman is a death sentence, begs for invention.",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-09 18:39:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "rayevinsonsr"
    },
    {
        "content": "They have made substantial progress in Womens issues of late.......I must agree with that. I think I could hold up Barney Frank's performance in Saudi Arabia and garner equal disgust in that country over how they could do business with the United States. Wait a minute, I could do that in Texas even....LOL.",
        "intTime": 20090309,
        "postID": 26,
        "quote": "",
        "reply": "They have made substantial progress in Womens issues of late.......I must agree with that. I think I could hold up Barney Frank's performance in Saudi Arabia and garner equal disgust in that country over how they could do business with the United States. Wait a minute, I could do that in Texas even....LOL.",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-09 22:35:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "ErichG2"
    },
    {
        "content": "quote: Originally posted by Duster6: I have always said that the Saudi's are the head of the snake but nobody believes me. I agree. I'm beginning to formulate the opinion that being anything other than a reluctant trading partner with SA (oil) is immoral and Un-American. Our military needs to relocate and we should minimize diplomatic activity due to their severe and daily human rights violations. No more hand-holding.",
        "intTime": 20090310,
        "postID": 27,
        "quote": "Originally posted by Duster6: I have always said that the Saudi's are the head of the snake but nobody believes me.",
        "reply": " I agree. I'm beginning to formulate the opinion that being anything other than a reluctant trading partner with SA (oil) is immoral and Un-American. Our military needs to relocate and we should minimize diplomatic activity due to their severe and daily human rights violations. No more hand-holding.",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 02:41:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "vsibaby"
    },
    {
        "content": "You know the reason nobody can find bin Laden? Because he is living in Saudi, in comfort and wealth, being hidden by wealthy and influential Saudi's, bin Laden and his entire family. Come on now, why have they not even found a single member of his family, other than for the son who showed up in Spain a few months ago. The guy is rich, very very rich, as is his family, as is his family well connected in Saudi government circles. In my opinion, Saudi Arabia is the REAL enemy. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090310,
        "postID": 28,
        "quote": "",
        "reply": "You know the reason nobody can find bin Laden? Because he is living in Saudi, in comfort and wealth, being hidden by wealthy and influential Saudi's, bin Laden and his entire family. Come on now, why have they not even found a single member of his family, other than for the son who showed up in Spain a few months ago. The guy is rich, very very rich, as is his family, as is his family well connected in Saudi government circles. In my opinion, Saudi Arabia is the REAL enemy. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 10:23:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by jack_flats: You know the reason nobody can find bin Laden? Because he is living in Saudi, in comfort and wealth, being hidden by wealthy and influential Saudi's, bin Laden and his entire family. Come on now, why have they not even found a single member of his family, other than for the son who showed up in Spain a few months ago. The guy is rich, very very rich, as is his family, as is his family well connected in Saudi government circles. In my opinion, Saudi Arabia is the REAL enemy. Why were at it let's just attack the whole Middle East. Get it over with. Just start on one side and sweep to the other killing everybody. That way we don't have to ever worry about them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090310,
        "postID": 29,
        "quote": "Originally posted by jack_flats: You know the reason nobody can find bin Laden? Because he is living in Saudi, in comfort and wealth, being hidden by wealthy and influential Saudi's, bin Laden and his entire family. Come on now, why have they not even found a single member of his family, other than for the son who showed up in Spain a few months ago. The guy is rich, very very rich, as is his family, as is his family well connected in Saudi government circles. In my opinion, Saudi Arabia is the REAL enemy.",
        "reply": " Why were at it let's just attack the whole Middle East. Get it over with. Just start on one side and sweep to the other killing everybody. That way we don't have to ever worry about them. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 10:27:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation. Sorry to say it, but that is the way their justice is done over there. The Religious police that they have are above the actual police that they have. This is not uncommon. People who steal get their hands cut off. This is the way they practice their religion and their Criminal Justice System. I don't believe it is humane, but America can't go around and tell other countries how to discipline their own people. Then we would be a dictator. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090310,
        "postID": 30,
        "quote": "Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation.",
        "reply": " Sorry to say it, but that is the way their justice is done over there. The Religious police that they have are above the actual police that they have. This is not uncommon. People who steal get their hands cut off. This is the way they practice their religion and their Criminal Justice System. I don't believe it is humane, but America can't go around and tell other countries how to discipline their own people. Then we would be a dictator. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 10:29:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "Anbar7"
    },
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation. Sorry to say it, but that is the way their justice is done over there. The Religious police that they have are above the actual police that they have. This is not uncommon. People who steal get their hands cut off. This is the way they practice their religion and their Criminal Justice System. I don't believe it is humane, but America can't go around and tell other countries how to discipline their own people. Then we would be a dictator. Usually they are the first ones to tell Americans we shouldn't wage a war to give people freedoms and do away with tyrants. Damn if we do, damned if we don't. Before the American revolution those that were held for thievery in Williamsburg (since there was no thing as a jail) would have an ear nailed to the wall. Piercing was not the intent. the culprit could stay nailed, or could pull free making an even larger hole as the nail was tapered. It was not hard to determine a thief thereafter, just look at the lobes. Imagine this type of justice in 2009.",
        "intTime": 20090310,
        "postID": 31,
        "quote": "Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation. Sorry to say it, but that is the way their justice is done over there. The Religious police that they have are above the actual police that they have. This is not uncommon. People who steal get their hands cut off. This is the way they practice their religion and their Criminal Justice System. I don't believe it is humane, but America can't go around and tell other countries how to discipline their own people. Then we would be a dictator.",
        "reply": " Usually they are the first ones to tell Americans we shouldn't wage a war to give people freedoms and do away with tyrants. Damn if we do, damned if we don't. Before the American revolution those that were held for thievery in Williamsburg (since there was no thing as a jail) would have an ear nailed to the wall. Piercing was not the intent. the culprit could stay nailed, or could pull free making an even larger hole as the nail was tapered. It was not hard to determine a thief thereafter, just look at the lobes. Imagine this type of justice in 2009.",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 10:43:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "rayevinsonsr"
    },
    {
        "content": "Interesting. It seems to be a bipartisan consensus that the saudis are a bunch of 3 eyed kissing cousins who oughta have their laundry turned inside out.",
        "intTime": 20090310,
        "postID": 32,
        "quote": "",
        "reply": "Interesting. It seems to be a bipartisan consensus that the saudis are a bunch of 3 eyed kissing cousins who oughta have their laundry turned inside out.",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 10:49:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "Sand_Flea"
    },
    {
        "content": "*sigh* And people wonder why I insist that mixing religion with law is a BAD IDEA. Religious police beating old women because of the alleged \"word of God\"... sick, sick people. The United States is not a backwards religious dictatorship... and let's hope it never becomes one, or Saudi Arabia will be nothing more than a mirror to us.",
        "intTime": 20090310,
        "postID": 33,
        "quote": "",
        "reply": "*sigh* And people wonder why I insist that mixing religion with law is a BAD IDEA. Religious police beating old women because of the alleged \"word of God\"... sick, sick people. The United States is not a backwards religious dictatorship... and let's hope it never becomes one, or Saudi Arabia will be nothing more than a mirror to us.",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 10:52:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "Whirled_Peas"
    },
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation. Sorry to say it, but that is the way their justice is done over there. The Religious police that they have are above the actual police that they have. This is not uncommon. People who steal get their hands cut off. This is the way they practice their religion and their Criminal Justice System. I don't believe it is humane, but America can't go around and tell other countries how to discipline their own people. Then we would be a dictator. No, just Saudi. Just Saudi is the enemy. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090310,
        "postID": 34,
        "quote": "Originally posted by Anbar7: quote: Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation. Sorry to say it, but that is the way their justice is done over there. The Religious police that they have are above the actual police that they have. This is not uncommon. People who steal get their hands cut off. This is the way they practice their religion and their Criminal Justice System. I don't believe it is humane, but America can't go around and tell other countries how to discipline their own people. Then we would be a dictator.",
        "reply": " No, just Saudi. Just Saudi is the enemy. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 10:52:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "jack_flats"
    },
    {
        "content": "quote: No, just Saudi. Just Saudi is the enemy. Comon Jack, give some credit to Iran, Pakistan, Afghanistan, and few other stans.",
        "intTime": 20090310,
        "postID": 35,
        "quote": "No, just Saudi. Just Saudi is the enemy.",
        "reply": " Comon Jack, give some credit to Iran, Pakistan, Afghanistan, and few other stans.",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 11:18:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "rayevinsonsr"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation. So, let's see, till we have solved or at least made up for the resultant loss of \"OIL\", that would come from them, you are willing to subject the \"little old ladies\" of this country to freezing and starving to death, because they couldn't afford to heat their homes, buy food and cook it... Yup, makes sense to me, NOT!... So, YOU choose, buy Saudi crude or drive the costs of food and utilities up here... One day, hopefully, we will not need their crude oil but, right now we do... YOU figure it out!... Respectfully, SUNLINER81",
        "intTime": 20090310,
        "postID": 36,
        "quote": "Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation.",
        "reply": " So, let's see, till we have solved or at least made up for the resultant loss of \"OIL\", that would come from them, you are willing to subject the \"little old ladies\" of this country to freezing and starving to death, because they couldn't afford to heat their homes, buy food and cook it... Yup, makes sense to me, NOT!... So, YOU choose, buy Saudi crude or drive the costs of food and utilities up here... One day, hopefully, we will not need their crude oil but, right now we do... YOU figure it out!... Respectfully, SUNLINER81",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 11:36:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "SUNLINER81"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation. Interesting, but is the economics of oil or their Islam beliefs that bother you the most? It's preached here not to mix politics and religion, but when it happens in other countries, we are appalled? We don't have to succum to Saudi Arabia for oil when the availability of reserves in Alaska will provide all we need and then we could tell SA to get lost. But until the tree hugging libs will stop their opposition to that, what can we do?",
        "intTime": 20090310,
        "postID": 37,
        "quote": "Originally posted by crackerjacks61: Some of You people rant and rave about free trade, and the right a company has to do business where it wants while what our government was founded upon gets trampled. We use to be enemies with human right abusers, now they are our \"friends\" all for the sake of the all mighty dollar. I Hope some of you are proud of yourselves for supporting this type of behavior that sends the message, it does not matter how you treat people, we will still do business with you. Add China to that list as well. Saudi court sentences 75-year-old woman to lashes \"http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1]http://www.breitbart.com/article.php?id=D96QN30O0&show_article=1\" How despicable and disgusting we are to do any business with that nation.",
        "reply": " Interesting, but is the economics of oil or their Islam beliefs that bother you the most? It's preached here not to mix politics and religion, but when it happens in other countries, we are appalled? We don't have to succum to Saudi Arabia for oil when the availability of reserves in Alaska will provide all we need and then we could tell SA to get lost. But until the tree hugging libs will stop their opposition to that, what can we do?",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 11:36:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "busnrete8"
    },
    {
        "content": "In the 1740's the House of Saud and the House of Wahhab entered into a treaty and binding marrage. The Wahhabi would dictate rthe Muslim Religion on the Arabian Peninsula , the Saudi would run government. Neither would interfear with the others realm. Fast forward almost three hundred years, fortunes wax and wane and, except for the unprotected traveler,no one cared what a bunch of Bedoin nomads did to each other. Then, there was OIL discovered in Arabia, then BIG OIL was discovered in the 1930's. It was diacovered by the Brits.. Treaties were made, America moved in, ARAMCO was fomed and BILLIONS went into the Saudi bank accounts. And the house of Wahhab? They has continued their teaching of THEIR VERSION of the Muslin religion. And, THEY rules the more primitive peoples minds. Now, the Wahhabi detest the Saudi, but honor their end of the 1740's treaty while seeking damned near any excuse to accuse the Saudi \"Princes\" os apostacy. The Saudi keep a very loyal \"modern army\" at their back, reducing the chances that the Wahhabi will turn on them. The Saudi Families, mostly modern, educated in Great Britian and at American Colleges, keep the religuious law in place. Otherwise they risk a revolt, as the religious know damned well the Saudi Familes are indeed apostates. So, what should OUR role be? Do we destabelize the House of Saud? If so, how do we influence who takes over? How can we restore order in the land on MECCA without a world wide open aNTI WESTERN \"Jihad\" against western culture and the great satan? All the while keeping Saudi oil flowing to Europe, Japan and India? We could cut off Saudi oil and would be moderately inconvenienced until the Cabnadians could take up the slack. Or we got sereous about north slope oil, Colorado Shale, Bakken oil, etc etc.. So here we are, and there they are. Solutions that keep the Arabian Oil flowing, or are we up for a several decade world widwe religious war?",
        "intTime": 20090310,
        "postID": 38,
        "quote": "",
        "reply": "In the 1740's the House of Saud and the House of Wahhab entered into a treaty and binding marrage. The Wahhabi would dictate rthe Muslim Religion on the Arabian Peninsula , the Saudi would run government. Neither would interfear with the others realm. Fast forward almost three hundred years, fortunes wax and wane and, except for the unprotected traveler,no one cared what a bunch of Bedoin nomads did to each other. Then, there was OIL discovered in Arabia, then BIG OIL was discovered in the 1930's. It was diacovered by the Brits.. Treaties were made, America moved in, ARAMCO was fomed and BILLIONS went into the Saudi bank accounts. And the house of Wahhab? They has continued their teaching of THEIR VERSION of the Muslin religion. And, THEY rules the more primitive peoples minds. Now, the Wahhabi detest the Saudi, but honor their end of the 1740's treaty while seeking damned near any excuse to accuse the Saudi \"Princes\" os apostacy. The Saudi keep a very loyal \"modern army\" at their back, reducing the chances that the Wahhabi will turn on them. The Saudi Families, mostly modern, educated in Great Britian and at American Colleges, keep the religuious law in place. Otherwise they risk a revolt, as the religious know damned well the Saudi Familes are indeed apostates. So, what should OUR role be? Do we destabelize the House of Saud? If so, how do we influence who takes over? How can we restore order in the land on MECCA without a world wide open aNTI WESTERN \"Jihad\" against western culture and the great satan? All the while keeping Saudi oil flowing to Europe, Japan and India? We could cut off Saudi oil and would be moderately inconvenienced until the Cabnadians could take up the slack. Or we got sereous about north slope oil, Colorado Shale, Bakken oil, etc etc.. So here we are, and there they are. Solutions that keep the Arabian Oil flowing, or are we up for a several decade world widwe religious war?",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 12:18:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "peter3_1"
    },
    {
        "content": "quote: Originally posted by jack_flats: You know the reason nobody can find bin Laden? Because he is living in Saudi, in comfort and wealth, being hidden by wealthy and influential Saudi's, bin Laden and his entire family. Come on now, why have they not even found a single member of his family, other than for the son who showed up in Spain a few months ago. The guy is rich, very very rich, as is his family, as is his family well connected in Saudi government circles. In my opinion, Saudi Arabia is the REAL enemy. You do realize that that is totally crazy right? Osama Bin Laden is a huge threat to the Saudi royal family. Christ, spend five minutes on wikipedia researching that...",
        "intTime": 20090310,
        "postID": 39,
        "quote": "Originally posted by jack_flats: You know the reason nobody can find bin Laden? Because he is living in Saudi, in comfort and wealth, being hidden by wealthy and influential Saudi's, bin Laden and his entire family. Come on now, why have they not even found a single member of his family, other than for the son who showed up in Spain a few months ago. The guy is rich, very very rich, as is his family, as is his family well connected in Saudi government circles. In my opinion, Saudi Arabia is the REAL enemy.",
        "reply": " You do realize that that is totally crazy right? Osama Bin Laden is a huge threat to the Saudi royal family. Christ, spend five minutes on wikipedia researching that...",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 12:26:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "foxred03"
    },
    {
        "content": "quote: Originally posted by foxred03: quote: Originally posted by jack_flats: You know the reason nobody can find bin Laden? Because he is living in Saudi, in comfort and wealth, being hidden by wealthy and influential Saudi's, bin Laden and his entire family. Come on now, why have they not even found a single member of his family, other than for the son who showed up in Spain a few months ago. The guy is rich, very very rich, as is his family, as is his family well connected in Saudi government circles. In my opinion, Saudi Arabia is the REAL enemy. You do realize that that is totally crazy right? Osama Bin Laden is a huge threat to the Saudi royal family. Christ, spend five minutes on wikipedia researching that... Wikipedia is not an actual source. It is more of a blog. It is not accepted by colleges to use in papers. It should not be allowed here. But that is up to everyone here. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "intTime": 20090310,
        "postID": 40,
        "quote": "Originally posted by foxred03: quote: Originally posted by jack_flats: You know the reason nobody can find bin Laden? Because he is living in Saudi, in comfort and wealth, being hidden by wealthy and influential Saudi's, bin Laden and his entire family. Come on now, why have they not even found a single member of his family, other than for the son who showed up in Spain a few months ago. The guy is rich, very very rich, as is his family, as is his family well connected in Saudi government circles. In my opinion, Saudi Arabia is the REAL enemy. You do realize that that is totally crazy right? Osama Bin Laden is a huge threat to the Saudi royal family. Christ, spend five minutes on wikipedia researching that...",
        "reply": " Wikipedia is not an actual source. It is more of a blog. It is not accepted by colleges to use in papers. It should not be allowed here. But that is up to everyone here. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford",
        "threadID": "672198221_9950073712001",
        "time": "2009-03-10 12:30:00",
        "title": "The Saudi's Are Such Wonderful Friends Of Ours",
        "userID": "Anbar7"
    }
]