[
    {
        "content": "quote: An Air Force colonel has been cleared in an investigation into whether an e-mail she sent to her airmen violated the military’s stance of religious neutrality. Col. Kimberly Toney, commander of the 501st Combat Support Wing at RAF Alconbury, sent an e-mail on Jan. 16 referring airmen to an \"inspirational\" video on a Roman Catholic Web site. The video featured the life of Nick Vujicic, who was born without arms or legs. In the video, Vujicic says he finds his \"greatest joy in this life is to introduce Jesus to those he meets and tell them of his (Jesus’) great desire to get to know them personally by allowing him to become their Lord and Savior.\" <more> AF COL Cleared of Promoting Religion", 
        "intTime": 20090406, 
        "postID": 1, 
        "quote": "An Air Force colonel has been cleared in an investigation into whether an e-mail she sent to her airmen violated the military’s stance of religious neutrality. Col. Kimberly Toney, commander of the 501st Combat Support Wing at RAF Alconbury, sent an e-mail on Jan. 16 referring airmen to an \"inspirational\" video on a Roman Catholic Web site. The video featured the life of Nick Vujicic, who was born without arms or legs. In the video, Vujicic says he finds his \"greatest joy in this life is to introduce Jesus to those he meets and tell them of his (Jesus’) great desire to get to know them personally by allowing him to become their Lord and Savior.\" <more> AF COL Cleared of Promoting Religion", 
        "reply": "", 
        "threadID": "672198221_2700000022001", 
        "time": "2009-04-06 13:09:00", 
        "title": "Follow-Up to Earlier Thread - AF COL Cleared of Promoting Religion", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "that's good... it did smell of sour-grapes from the git-go. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090406, 
        "postID": 2, 
        "quote": "", 
        "reply": "that's good... it did smell of sour-grapes from the git-go. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_2700000022001", 
        "time": "2009-04-06 13:13:00", 
        "title": "Follow-Up to Earlier Thread - AF COL Cleared of Promoting Religion", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "I think she''l stick close to only business in the future.", 
        "intTime": 20090406, 
        "postID": 3, 
        "quote": "", 
        "reply": "I think she''l stick close to only business in the future.", 
        "threadID": "672198221_2700000022001", 
        "time": "2009-04-06 14:40:00", 
        "title": "Follow-Up to Earlier Thread - AF COL Cleared of Promoting Religion", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "That's good. There was no need for that to even be an issue. She sent out a link to a video and people could watch it if they wanted. To her it was inspirational and an example to follow. That people get upset because it was on a Catholic website or it mentions Jesus is just stupid. People have become so ati-religion that they get offended by anything.", 
        "intTime": 20090406, 
        "postID": 4, 
        "quote": "", 
        "reply": "That's good. There was no need for that to even be an issue. She sent out a link to a video and people could watch it if they wanted. To her it was inspirational and an example to follow. That people get upset because it was on a Catholic website or it mentions Jesus is just stupid. People have become so ati-religion that they get offended by anything.", 
        "threadID": "672198221_2700000022001", 
        "time": "2009-04-06 14:46:00", 
        "title": "Follow-Up to Earlier Thread - AF COL Cleared of Promoting Religion", 
        "userID": "nspreitler"
    }, 
    {
        "content": "What, no atheists claiming that the ruling is a \"travesty of justice\"?... It was much ado about nothing, tempest in a tea cup and like SignalSergeantWilliams said, she will be more careful in the future, with anything that may even be remotely connected to anything religious... IMNO... Respectfully, SUNLINER81", 
        "intTime": 20090406, 
        "postID": 5, 
        "quote": "", 
        "reply": "What, no atheists claiming that the ruling is a \"travesty of justice\"?... It was much ado about nothing, tempest in a tea cup and like SignalSergeantWilliams said, she will be more careful in the future, with anything that may even be remotely connected to anything religious... IMNO... Respectfully, SUNLINER81", 
        "threadID": "672198221_2700000022001", 
        "time": "2009-04-06 14:52:00", 
        "title": "Follow-Up to Earlier Thread - AF COL Cleared of Promoting Religion", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "*", 
        "intTime": 20090408, 
        "postID": 6, 
        "quote": "", 
        "reply": "*", 
        "threadID": "672198221_2700000022001", 
        "time": "2009-04-08 08:49:00", 
        "title": "Follow-Up to Earlier Thread - AF COL Cleared of Promoting Religion", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: That's good. There was no need for that to even be an issue. She sent out a link to a video and people could watch it if they wanted. To her it was inspirational and an example to follow. That people get upset because it was on a Catholic website or it mentions Jesus is just stupid. People have become so ati-religion that they get offended by anything. The SAME people who in this case refuse to acknowledge that having a person with power over others sending what LOOKS like religious material to the people they have power over is incorrect would pitch a screaming fit if it was a Pagan or Muslim doing it.", 
        "intTime": 20090409, 
        "postID": 7, 
        "quote": "Originally posted by nspreitler: That's good. There was no need for that to even be an issue. She sent out a link to a video and people could watch it if they wanted. To her it was inspirational and an example to follow. That people get upset because it was on a Catholic website or it mentions Jesus is just stupid. People have become so ati-religion that they get offended by anything.", 
        "reply": " The SAME people who in this case refuse to acknowledge that having a person with power over others sending what LOOKS like religious material to the people they have power over is incorrect would pitch a screaming fit if it was a Pagan or Muslim doing it.", 
        "threadID": "672198221_2700000022001", 
        "time": "2009-04-09 06:13:00", 
        "title": "Follow-Up to Earlier Thread - AF COL Cleared of Promoting Religion", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: What, no atheists claiming that the ruling is a \"travesty of justice\"?... It was much ado about nothing, tempest in a tea cup and like SignalSergeantWilliams said, she will be more careful in the future, with anything that may even be remotely connected to anything religious... IMNO... Respectfully, SUNLINER81 Actually most people said it should be investigated AS PER THE RULES and IF the office broke the rules then something should be done. A lot of people DID state they thought it was a stupid thing to do, especially given the recent problems the Air Force has had with other officers misusing their positions to push religion and that they thought the officer's actions gave the APPEARANCE of pushing religion on those the officer had power over.", 
        "intTime": 20090409, 
        "postID": 8, 
        "quote": "Originally posted by SUNLINER81: What, no atheists claiming that the ruling is a \"travesty of justice\"?... It was much ado about nothing, tempest in a tea cup and like SignalSergeantWilliams said, she will be more careful in the future, with anything that may even be remotely connected to anything religious... IMNO... Respectfully, SUNLINER81", 
        "reply": " Actually most people said it should be investigated AS PER THE RULES and IF the office broke the rules then something should be done. A lot of people DID state they thought it was a stupid thing to do, especially given the recent problems the Air Force has had with other officers misusing their positions to push religion and that they thought the officer's actions gave the APPEARANCE of pushing religion on those the officer had power over.", 
        "threadID": "672198221_2700000022001", 
        "time": "2009-04-09 06:17:00", 
        "title": "Follow-Up to Earlier Thread - AF COL Cleared of Promoting Religion", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by nspreitler: That's good. There was no need for that to even be an issue. She sent out a link to a video and people could watch it if they wanted. To her it was inspirational and an example to follow. That people get upset because it was on a Catholic website or it mentions Jesus is just stupid. People have become so ati-religion that they get offended by anything. The SAME people who in this case refuse to acknowledge that having a person with power over others sending what LOOKS like religious material to the people they have power over is incorrect would pitch a screaming fit if it was a Pagan or Muslim doing it. Can you give an example of where this has happened? I find that the People of Tolerance (those on the left) are far more likely to want to silence others. Any number of schools have programs to honor Islam. Can you point me to one that has a day to honor Jesus? Christmas has been sanitized just so this won't happen. [www.worldnetdaily.com/news/article.asp?ARTICLE_ID=52335] [/www.thesun.co.uk/sol/homepage/news/article407311.ece] Forward me the links and I'll be happy to consider your point of view. I can't hear the screams, myself. This message has been edited. Last edited by: Silent_Surface, Sun 12 April 2009 08:12 AM", 
        "intTime": 20090409, 
        "postID": 9, 
        "quote": "Originally posted by rayld2: quote: Originally posted by nspreitler: That's good. There was no need for that to even be an issue. She sent out a link to a video and people could watch it if they wanted. To her it was inspirational and an example to follow. That people get upset because it was on a Catholic website or it mentions Jesus is just stupid. People have become so ati-religion that they get offended by anything. The SAME people who in this case refuse to acknowledge that having a person with power over others sending what LOOKS like religious material to the people they have power over is incorrect would pitch a screaming fit if it was a Pagan or Muslim doing it.", 
        "reply": " Can you give an example of where this has happened? I find that the People of Tolerance (those on the left) are far more likely to want to silence others. Any number of schools have programs to honor Islam. Can you point me to one that has a day to honor Jesus? Christmas has been sanitized just so this won't happen. [www.worldnetdaily.com/news/article.asp?ARTICLE_ID=52335] [/www.thesun.co.uk/sol/homepage/news/article407311.ece] Forward me the links and I'll be happy to consider your point of view. I can't hear the screams, myself. This message has been edited. Last edited by: Silent_Surface, Sun 12 April 2009 08:12 AM", 
        "threadID": "672198221_2700000022001", 
        "time": "2009-04-09 07:03:00", 
        "title": "Follow-Up to Earlier Thread - AF COL Cleared of Promoting Religion", 
        "userID": "8844199"
    }, 
    {
        "content": "The general government standards of ethical conduct describe situations that may give the \"appearance\" of a loss of impartiality and spell out steps to be taken when those situations arise. The first step is to ask yourself whether a reasonable person with knowledge of the relevant facts would question your impartiality if you participated in the matter. The general rule is that if your participation is going to raise eyebrows, you will need to stop working on the matter unless your are specifically authorized you to participate. Only the Colonel knows her true intent but she probably shouldn't have promoted the issue.", 
        "intTime": 20090409, 
        "postID": 10, 
        "quote": "", 
        "reply": "The general government standards of ethical conduct describe situations that may give the \"appearance\" of a loss of impartiality and spell out steps to be taken when those situations arise. The first step is to ask yourself whether a reasonable person with knowledge of the relevant facts would question your impartiality if you participated in the matter. The general rule is that if your participation is going to raise eyebrows, you will need to stop working on the matter unless your are specifically authorized you to participate. Only the Colonel knows her true intent but she probably shouldn't have promoted the issue.", 
        "threadID": "672198221_2700000022001", 
        "time": "2009-04-09 07:54:00", 
        "title": "Follow-Up to Earlier Thread - AF COL Cleared of Promoting Religion", 
        "userID": "Sand_Flea"
    }, 
    {
        "content": "I know Col Toni personally and stand by her 100%. It's a sad day when such a positive influence as she has on everyone around is crushed by a small few taking things out of context. IF there were more people like her then the would would truly be a better place. When someone is unable to share a story where a person has overcame unthinkable odds in life and still loves life then maybe those who are \"offended\" should dig deep within themselves and find what is driving their anger and outrage at encouragement. I applaud you Kim and am honored to know you. Thanks for being a wonderful influence to our airmen @ the 501st. See you on the volleyball court", 
        "intTime": 20090411, 
        "postID": 11, 
        "quote": "", 
        "reply": "I know Col Toni personally and stand by her 100%. It's a sad day when such a positive influence as she has on everyone around is crushed by a small few taking things out of context. IF there were more people like her then the would would truly be a better place. When someone is unable to share a story where a person has overcame unthinkable odds in life and still loves life then maybe those who are \"offended\" should dig deep within themselves and find what is driving their anger and outrage at encouragement. I applaud you Kim and am honored to know you. Thanks for being a wonderful influence to our airmen @ the 501st. See you on the volleyball court", 
        "threadID": "672198221_2700000022001", 
        "time": "2009-04-11 13:47:00", 
        "title": "Follow-Up to Earlier Thread - AF COL Cleared of Promoting Religion", 
        "userID": "10551897"
    }, 
    {
        "content": "quote: Originally posted by 10551897: I know Col Toni personally and stand by her 100%. It's a sad day when such a positive influence as she has on everyone around is crushed by a small few taking things out of context. IF there were more people like her then the would would truly be a better place. When someone is unable to share a story where a person has overcame unthinkable odds in life and still loves life then maybe those who are \"offended\" should dig deep within themselves and find what is driving their anger and outrage at encouragement. I applaud you Kim and am honored to know you. Thanks for being a wonderful influence to our airmen @ the 501st. See you on the volleyball court Yep ... sad day when so many try to build themselves up by tearing down others. They must live sad little lives ...", 
        "intTime": 20090411, 
        "postID": 12, 
        "quote": "Originally posted by 10551897: I know Col Toni personally and stand by her 100%. It's a sad day when such a positive influence as she has on everyone around is crushed by a small few taking things out of context. IF there were more people like her then the would would truly be a better place. When someone is unable to share a story where a person has overcame unthinkable odds in life and still loves life then maybe those who are \"offended\" should dig deep within themselves and find what is driving their anger and outrage at encouragement. I applaud you Kim and am honored to know you. Thanks for being a wonderful influence to our airmen @ the 501st. See you on the volleyball court", 
        "reply": " Yep ... sad day when so many try to build themselves up by tearing down others. They must live sad little lives ...", 
        "threadID": "672198221_2700000022001", 
        "time": "2009-04-11 13:59:00", 
        "title": "Follow-Up to Earlier Thread - AF COL Cleared of Promoting Religion", 
        "userID": "I_M_Qwerty"
    }
]