[
    {
        "content": "\"http://www.alertnet.org/thenews/newsdesk/24443479.htm\" Another wasted government agency and world organization.", 
        "intTime": 20090425, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.alertnet.org/thenews/newsdesk/24443479.htm\" Another wasted government agency and world organization.", 
        "threadID": "672198221_1260027122001", 
        "time": "2009-04-25 05:09:00", 
        "title": "CDC and WHO On Top Of Things - \"Too Late\"", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "\"Prevention said on Friday it was too late to contain the swine flu outbreak in the United States. CDC acting director Dr. Richard Besser told reporters in a telephone briefing it was likely too late to try to contain the outbreak, by vaccinating, treating or isolating people. \"There are things that we see that suggest that containment is not very likely,\" he said. He said the U.S. cases and Mexican cases are likely the same virus. \"So far the genetic elements that we have looked at are the same.\" But Besser said it was unclear why the virus was causing so many deaths in deaths in Mexico and such mild disease in the United States. - CDC \"http://www.cdc.gov/swineflu/\" \"Swine Influenza (Flu) Swine Influenza (swine flu) is a respiratory disease of pigs caused by type A influenza that regularly cause outbreaks of influenza among pigs. Swine flu viruses do not normally infect humans, however, human infections with swine flu do occur, and cases of human-to-human spread of swine flu viruses has been documented. \"", 
        "intTime": 20090425, 
        "postID": 2, 
        "quote": "", 
        "reply": "\"Prevention said on Friday it was too late to contain the swine flu outbreak in the United States. CDC acting director Dr. Richard Besser told reporters in a telephone briefing it was likely too late to try to contain the outbreak, by vaccinating, treating or isolating people. \"There are things that we see that suggest that containment is not very likely,\" he said. He said the U.S. cases and Mexican cases are likely the same virus. \"So far the genetic elements that we have looked at are the same.\" But Besser said it was unclear why the virus was causing so many deaths in deaths in Mexico and such mild disease in the United States. - CDC \"http://www.cdc.gov/swineflu/\" \"Swine Influenza (Flu) Swine Influenza (swine flu) is a respiratory disease of pigs caused by type A influenza that regularly cause outbreaks of influenza among pigs. Swine flu viruses do not normally infect humans, however, human infections with swine flu do occur, and cases of human-to-human spread of swine flu viruses has been documented. \"", 
        "threadID": "672198221_1260027122001", 
        "time": "2009-04-25 05:23:00", 
        "title": "CDC and WHO On Top Of Things - \"Too Late\"", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "OK, as of this morning there were less than TEN cases in the US - none fatal - and more in Mexico, some fatal. How, exactly, is this a \"wasted\" agency and world organization? Would you have even known about the disease, how it's spread, how to prevent it, or that there is even a vaccine for it without the existence of the CDC or WHO? You wouldn't even have been able to post a link or quote without either one. Sometime's you can be an idiot, CJ.", 
        "intTime": 20090425, 
        "postID": 3, 
        "quote": "", 
        "reply": "OK, as of this morning there were less than TEN cases in the US - none fatal - and more in Mexico, some fatal. How, exactly, is this a \"wasted\" agency and world organization? Would you have even known about the disease, how it's spread, how to prevent it, or that there is even a vaccine for it without the existence of the CDC or WHO? You wouldn't even have been able to post a link or quote without either one. Sometime's you can be an idiot, CJ.", 
        "threadID": "672198221_1260027122001", 
        "time": "2009-04-25 07:40:00", 
        "title": "CDC and WHO On Top Of Things - \"Too Late\"", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: OK, as of this morning there were less than TEN cases in the US - none fatal - and more in Mexico, some fatal. How, exactly, is this a \"wasted\" agency and world organization? Would you have even known about the disease, how it's spread, how to prevent it, or that there is even a vaccine for it without the existence of the CDC or WHO? You wouldn't even have been able to post a link or quote without either one. Sometime's you can be an idiot, CJ. The world effort to stop SARS worked out in the end. It appears that this disease has managed to avoid being isolated - probably BECAUSE so many people have mild symptoms. Mild symptoms, no need to go to the hospital - they then just spread it. Science can ameliorate epidemics, can't always stop them. But most people aren't dead of AIDS last time I checked. Dave", 
        "intTime": 20090425, 
        "postID": 4, 
        "quote": "Originally posted by Cider33_Alpha: OK, as of this morning there were less than TEN cases in the US - none fatal - and more in Mexico, some fatal. How, exactly, is this a \"wasted\" agency and world organization? Would you have even known about the disease, how it's spread, how to prevent it, or that there is even a vaccine for it without the existence of the CDC or WHO? You wouldn't even have been able to post a link or quote without either one. Sometime's you can be an idiot, CJ.", 
        "reply": " The world effort to stop SARS worked out in the end. It appears that this disease has managed to avoid being isolated - probably BECAUSE so many people have mild symptoms. Mild symptoms, no need to go to the hospital - they then just spread it. Science can ameliorate epidemics, can't always stop them. But most people aren't dead of AIDS last time I checked. Dave", 
        "threadID": "672198221_1260027122001", 
        "time": "2009-04-25 08:17:00", 
        "title": "CDC and WHO On Top Of Things - \"Too Late\"", 
        "userID": "Grachus"
    }, 
    {
        "content": "Sorry, I will not have time to do a follow up on this so ya all are going to just have to do your own research. WITHIN DAYS of the CDC (Atlanta) receiving a virus sample from the Mexican Government, the CDC defined this virus as totally new... and totally unique. We are about ten days downrange from that date if memory serves. The states of Texas and California didn't know they were dealing with a new virus either as there have only been 2-3 cases reported (as of now) since the CDC made its declaration. San Diego County and Imperial County (on the mexican border) in California... and one single city in Texas are the only known US cases. Again... this information has only arisen AFTER the Mexican Government sent CDC the sample for identification. Prior to that Mexico was thinking that they just had an outbreak of an existing flu type. But now that government is taking rather strict actions to limit its further spread... actions that the CDC thinks may be too late. As for the mortality rate... no one has died in the USA. Perhaps because we have better medical aid for the most part. In Mexico a little under 1100 cases have been identified so far since testing for the exact CDC confirmed virus began. Of taht at LEAST 62 deaths have already resulted. That is roughly 6% mortality rate... That is very high by US standards. Again it is not known exactly how many deats or infections there actually are in Mexico at this point. too much is never reported there. BTW: say 100 million Americans get exposed to this new virus... do you think a 5% or 6% mortality rate could be realistic? I am not certain myself. My fear is that Mexico is NOT ground zero for this virus strain. I am kind of worried that it originated in points south of Mexico where reporting is almost non-existant. And for a few more months I have loved ones down there... working it the area where viruses incubate and are easily transmitted. There is no cure or prevention for this swine flu bug. All one can do is ride it out. Not the best answer for a warm and fuzzy feeling.", 
        "intTime": 20090425, 
        "postID": 5, 
        "quote": "", 
        "reply": "Sorry, I will not have time to do a follow up on this so ya all are going to just have to do your own research. WITHIN DAYS of the CDC (Atlanta) receiving a virus sample from the Mexican Government, the CDC defined this virus as totally new... and totally unique. We are about ten days downrange from that date if memory serves. The states of Texas and California didn't know they were dealing with a new virus either as there have only been 2-3 cases reported (as of now) since the CDC made its declaration. San Diego County and Imperial County (on the mexican border) in California... and one single city in Texas are the only known US cases. Again... this information has only arisen AFTER the Mexican Government sent CDC the sample for identification. Prior to that Mexico was thinking that they just had an outbreak of an existing flu type. But now that government is taking rather strict actions to limit its further spread... actions that the CDC thinks may be too late. As for the mortality rate... no one has died in the USA. Perhaps because we have better medical aid for the most part. In Mexico a little under 1100 cases have been identified so far since testing for the exact CDC confirmed virus began. Of taht at LEAST 62 deaths have already resulted. That is roughly 6% mortality rate... That is very high by US standards. Again it is not known exactly how many deats or infections there actually are in Mexico at this point. too much is never reported there. BTW: say 100 million Americans get exposed to this new virus... do you think a 5% or 6% mortality rate could be realistic? I am not certain myself. My fear is that Mexico is NOT ground zero for this virus strain. I am kind of worried that it originated in points south of Mexico where reporting is almost non-existant. And for a few more months I have loved ones down there... working it the area where viruses incubate and are easily transmitted. There is no cure or prevention for this swine flu bug. All one can do is ride it out. Not the best answer for a warm and fuzzy feeling.", 
        "threadID": "672198221_1260027122001", 
        "time": "2009-04-25 09:09:00", 
        "title": "CDC and WHO On Top Of Things - \"Too Late\"", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by Cider33_Alpha: OK, as of this morning there were less than TEN cases in the US - none fatal - and more in Mexico, some fatal. How, exactly, is this a \"wasted\" agency and world organization? Would you have even known about the disease, how it's spread, how to prevent it, or that there is even a vaccine for it without the existence of the CDC or WHO? You wouldn't even have been able to post a link or quote without either one. Sometime's you can be an idiot, CJ. Did you even read the articles I posted? In one the CDC says it poses no threat to humans, then the other article completely contradicts itself. IMHO The CDC and the WHO are both JOKES the world could do without.", 
        "intTime": 20090425, 
        "postID": 6, 
        "quote": "Originally posted by Cider33_Alpha: OK, as of this morning there were less than TEN cases in the US - none fatal - and more in Mexico, some fatal. How, exactly, is this a \"wasted\" agency and world organization? Would you have even known about the disease, how it's spread, how to prevent it, or that there is even a vaccine for it without the existence of the CDC or WHO? You wouldn't even have been able to post a link or quote without either one. Sometime's you can be an idiot, CJ.", 
        "reply": " Did you even read the articles I posted? In one the CDC says it poses no threat to humans, then the other article completely contradicts itself. IMHO The CDC and the WHO are both JOKES the world could do without.", 
        "threadID": "672198221_1260027122001", 
        "time": "2009-04-25 12:42:00", 
        "title": "CDC and WHO On Top Of Things - \"Too Late\"", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "\"Welcome to the Centers for Disease Control and Prevention. For over 60 years, CDC has been dedicated to protecting health and promoting quality of life through the prevention and control of disease, injury, and disability. We are committed to programs that reduce the health and economic consequences of the leading causes of death and disability, thereby ensuring a long, productive, healthy life for all people. \" This should read: For Over 60 Years The CDC and us fat cat government employees have been bilking the American Tax payer for every dime we can get. Although We are suppose to be \"promoting quality of life through the prevention and control of disease, injury, and disability\" that's just a BS statement that makes it sound like were something other than just another beaoruocratic government agency that is more worried about political outcome and job security than our actuall stated mission\". In the mean time hundreds are dying and the Borders are not closed so this crap is going to spread all over the world, where is the CDC now when they are needed the most? I know...to busy making dumb 10 line news articles that simple say \"Hey we found this, but found it to late, lots of luck to you habre\".", 
        "intTime": 20090425, 
        "postID": 7, 
        "quote": "", 
        "reply": "\"Welcome to the Centers for Disease Control and Prevention. For over 60 years, CDC has been dedicated to protecting health and promoting quality of life through the prevention and control of disease, injury, and disability. We are committed to programs that reduce the health and economic consequences of the leading causes of death and disability, thereby ensuring a long, productive, healthy life for all people. \" This should read: For Over 60 Years The CDC and us fat cat government employees have been bilking the American Tax payer for every dime we can get. Although We are suppose to be \"promoting quality of life through the prevention and control of disease, injury, and disability\" that's just a BS statement that makes it sound like were something other than just another beaoruocratic government agency that is more worried about political outcome and job security than our actuall stated mission\". In the mean time hundreds are dying and the Borders are not closed so this crap is going to spread all over the world, where is the CDC now when they are needed the most? I know...to busy making dumb 10 line news articles that simple say \"Hey we found this, but found it to late, lots of luck to you habre\".", 
        "threadID": "672198221_1260027122001", 
        "time": "2009-04-25 12:49:00", 
        "title": "CDC and WHO On Top Of Things - \"Too Late\"", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "We couldn't find bin laden, what makes you think we can immediately \"apprehend\" micro-organisms? I'm not a disease expert, and you are not either...so let them do their job and see what happens.", 
        "intTime": 20090425, 
        "postID": 8, 
        "quote": "", 
        "reply": "We couldn't find bin laden, what makes you think we can immediately \"apprehend\" micro-organisms? I'm not a disease expert, and you are not either...so let them do their job and see what happens.", 
        "threadID": "672198221_1260027122001", 
        "time": "2009-04-25 12:54:00", 
        "title": "CDC and WHO On Top Of Things - \"Too Late\"", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: We couldn't find bin laden, what makes you think we can immediately \"apprehend\" micro-organisms? I'm not a disease expert, and you are not either...so let them do their job and see what happens. It takes an \"expert\" to close a border? lol", 
        "intTime": 20090425, 
        "postID": 9, 
        "quote": "Originally posted by Irwin_R_Schyster: We couldn't find bin laden, what makes you think we can immediately \"apprehend\" micro-organisms? I'm not a disease expert, and you are not either...so let them do their job and see what happens.", 
        "reply": " It takes an \"expert\" to close a border? lol", 
        "threadID": "672198221_1260027122001", 
        "time": "2009-04-25 13:18:00", 
        "title": "CDC and WHO On Top Of Things - \"Too Late\"", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Irwin_R_Schyster: We couldn't find bin laden, what makes you think we can immediately \"apprehend\" micro-organisms? I'm not a disease expert, and you are not either...so let them do their job and see what happens. It takes an \"expert\" to close a border? lol Closing borders is not what we're talking about, we're talking about travel restrictions which are alot more complex and costly... If those cases in New York turn out to be swine flu then they have to shut all travel in and out of Mexico....ugh, this swedish bomb shell in my english class just got back from Cabo on spring break", 
        "intTime": 20090425, 
        "postID": 10, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Irwin_R_Schyster: We couldn't find bin laden, what makes you think we can immediately \"apprehend\" micro-organisms? I'm not a disease expert, and you are not either...so let them do their job and see what happens. It takes an \"expert\" to close a border? lol", 
        "reply": " Closing borders is not what we're talking about, we're talking about travel restrictions which are alot more complex and costly... If those cases in New York turn out to be swine flu then they have to shut all travel in and out of Mexico....ugh, this swedish bomb shell in my english class just got back from Cabo on spring break", 
        "threadID": "672198221_1260027122001", 
        "time": "2009-04-25 13:26:00", 
        "title": "CDC and WHO On Top Of Things - \"Too Late\"", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "Remind us again, Dave , of how an influenza virus and the aids virus spread? How are they similar, and how are they different? Comparing applea and handgrenades again?", 
        "intTime": 20090425, 
        "postID": 11, 
        "quote": "", 
        "reply": "Remind us again, Dave , of how an influenza virus and the aids virus spread? How are they similar, and how are they different? Comparing applea and handgrenades again?", 
        "threadID": "672198221_1260027122001", 
        "time": "2009-04-25 13:56:00", 
        "title": "CDC and WHO On Top Of Things - \"Too Late\"", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Worries that the new swine flu strain that has killed as many as 68 people and sickened more than 1,000 across Mexico has “pandemic potential” increased with the announcement that the virus had spread to Kansas, and likely to New York City. On Saturday, two new cases of swine flu were confirmed in Kansas. And New York City Health Commissioner Dr. Thomas Frieden announced that tests showed that eight New York schoolchildren had a type A influenza virus that was likely the swine flu. California, Texas, Kansas, New York.....and these are just the ones we know about.", 
        "intTime": 20090425, 
        "postID": 12, 
        "quote": "Worries that the new swine flu strain that has killed as many as 68 people and sickened more than 1,000 across Mexico has “pandemic potential” increased with the announcement that the virus had spread to Kansas, and likely to New York City. On Saturday, two new cases of swine flu were confirmed in Kansas. And New York City Health Commissioner Dr. Thomas Frieden announced that tests showed that eight New York schoolchildren had a type A influenza virus that was likely the swine flu.", 
        "reply": " California, Texas, Kansas, New York.....and these are just the ones we know about.", 
        "threadID": "672198221_1260027122001", 
        "time": "2009-04-25 14:04:00", 
        "title": "CDC and WHO On Top Of Things - \"Too Late\"", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "I recently discovered that Kroger has started selling beef and pork that is from Mexico. I no longer buy either from them. Just how many other places get either from Mexico? I personally prefer to get food products that are grown and processed here in the USA. The USDA has been keeping the industry safe for the most part. I tend to trust them more at keeping my food safe.", 
        "intTime": 20090426, 
        "postID": 13, 
        "quote": "", 
        "reply": "I recently discovered that Kroger has started selling beef and pork that is from Mexico. I no longer buy either from them. Just how many other places get either from Mexico? I personally prefer to get food products that are grown and processed here in the USA. The USDA has been keeping the industry safe for the most part. I tend to trust them more at keeping my food safe.", 
        "threadID": "672198221_1260027122001", 
        "time": "2009-04-26 06:17:00", 
        "title": "CDC and WHO On Top Of Things - \"Too Late\"", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Irwin_R_Schyster: We couldn't find bin laden, what makes you think we can immediately \"apprehend\" micro-organisms? I'm not a disease expert, and you are not either...so let them do their job and see what happens. It takes an \"expert\" to close a border? lol Nothing like hot coffee flowing through the nose..... LOL But seriously, it must take one. If you look at how it has been handled so far, it is obvious that neither party in DC know how to do it.", 
        "intTime": 20090426, 
        "postID": 14, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Irwin_R_Schyster: We couldn't find bin laden, what makes you think we can immediately \"apprehend\" micro-organisms? I'm not a disease expert, and you are not either...so let them do their job and see what happens. It takes an \"expert\" to close a border? lol", 
        "reply": " Nothing like hot coffee flowing through the nose..... LOL But seriously, it must take one. If you look at how it has been handled so far, it is obvious that neither party in DC know how to do it.", 
        "threadID": "672198221_1260027122001", 
        "time": "2009-04-26 06:20:00", 
        "title": "CDC and WHO On Top Of Things - \"Too Late\"", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Woody in LA...The US in not doing what other nations are doing. \"http://www.breitbart.com/article.php?id=D97Q6EUG0&show_article=1\" Here you can see Thermal Imaging being utilized to monitor Body Temps at airports. Spot on about \"Pork\". {Russia banned the import of meat products from Mexico, California, Texans and Kansas. South Korea said it would increase the number of its influenza virus checks on pork products from Mexico and the U.S. Serbia on Saturday banned all imports of pork from North America, despite reassurances from the FAO that pigs appear not to be the immediate source of infection.} From BreitbartDOTcom. Keep alert. Stay safe!! Thanks...signed Agent 99!", 
        "intTime": 20090426, 
        "postID": 15, 
        "quote": "", 
        "reply": "Woody in LA...The US in not doing what other nations are doing. \"http://www.breitbart.com/article.php?id=D97Q6EUG0&show_article=1\" Here you can see Thermal Imaging being utilized to monitor Body Temps at airports. Spot on about \"Pork\". {Russia banned the import of meat products from Mexico, California, Texans and Kansas. South Korea said it would increase the number of its influenza virus checks on pork products from Mexico and the U.S. Serbia on Saturday banned all imports of pork from North America, despite reassurances from the FAO that pigs appear not to be the immediate source of infection.} From BreitbartDOTcom. Keep alert. Stay safe!! Thanks...signed Agent 99!", 
        "threadID": "672198221_1260027122001", 
        "time": "2009-04-26 09:33:00", 
        "title": "CDC and WHO On Top Of Things - \"Too Late\"", 
        "userID": "Agent991"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Irwin_R_Schyster: We couldn't find bin laden, what makes you think we can immediately \"apprehend\" micro-organisms? I'm not a disease expert, and you are not either...so let them do their job and see what happens. It takes an \"expert\" to close a border? lol I take it you suggest shutting down all international flights in/out of Mexico as well? Ah, but probably too late (THIRTEEN days after the first case in Mexico diagnosed ... WHY have they been dragging their heels so? ) ... cases already in at least five states, three countries (Mexico, Canada, US), with two more suspected (NZ and France). STFU and let the pros do their job. CJ. You'll benefit for it, and beyotch the whole time.", 
        "intTime": 20090426, 
        "postID": 16, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Irwin_R_Schyster: We couldn't find bin laden, what makes you think we can immediately \"apprehend\" micro-organisms? I'm not a disease expert, and you are not either...so let them do their job and see what happens. It takes an \"expert\" to close a border? lol", 
        "reply": " I take it you suggest shutting down all international flights in/out of Mexico as well? Ah, but probably too late (THIRTEEN days after the first case in Mexico diagnosed ... WHY have they been dragging their heels so? ) ... cases already in at least five states, three countries (Mexico, Canada, US), with two more suspected (NZ and France). STFU and let the pros do their job. CJ. You'll benefit for it, and beyotch the whole time.", 
        "threadID": "672198221_1260027122001", 
        "time": "2009-04-26 12:46:00", 
        "title": "CDC and WHO On Top Of Things - \"Too Late\"", 
        "userID": "Cider33_Alpha"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Remind us again, Dave , of how an influenza virus and the aids virus spread? How are they similar, and how are they different? Comparing applea and handgrenades again? Quiet right to say this Peter, but I was pointing out that you cannot prevent new diseases from mutating into existance. Just what can the CDC do to stop mutations? And no one even knew that AIDS was a disease. This was because AIDS doesn't kill you, other diseases take advantage of your lower immune system to do that. Everyone seems to have forgotten this about AIDS. On this thread the CDC is being blamed for not acting sooner - Heck, no one even knew this was occuring. There are now eight confirmed cases in New York. Kids \"flew\" to Mexico on some sort of arranged trip - Didn't \"cross\" any borders. So is the CDC responsible for not acting when they had nothing to act on? Schid happens. Dave", 
        "intTime": 20090426, 
        "postID": 17, 
        "quote": "Originally posted by peter3_1: Remind us again, Dave , of how an influenza virus and the aids virus spread? How are they similar, and how are they different? Comparing applea and handgrenades again?", 
        "reply": " Quiet right to say this Peter, but I was pointing out that you cannot prevent new diseases from mutating into existance. Just what can the CDC do to stop mutations? And no one even knew that AIDS was a disease. This was because AIDS doesn't kill you, other diseases take advantage of your lower immune system to do that. Everyone seems to have forgotten this about AIDS. On this thread the CDC is being blamed for not acting sooner - Heck, no one even knew this was occuring. There are now eight confirmed cases in New York. Kids \"flew\" to Mexico on some sort of arranged trip - Didn't \"cross\" any borders. So is the CDC responsible for not acting when they had nothing to act on? Schid happens. Dave", 
        "threadID": "672198221_1260027122001", 
        "time": "2009-04-26 13:00:00", 
        "title": "CDC and WHO On Top Of Things - \"Too Late\"", 
        "userID": "Grachus"
    }
]