[
    {
        "content": "\"http://www.federalnewsradio.com/?nid=27&sid=1683371\" WASHINGTON (AP) - President Barack Obama announced Tuesday he is combining White House staffs dealing with international and homeland security, predicting the change will make Americans safer. Obama also is creating a new office intended to communicate more effectively with other countries about U.S. security policy. The Homeland Security Council, created after the Sept. 11, 2001, terrorist attacks, will be kept as a venue for discussing issues concerning domestic security, including terrorism, weapons of mass destruction, natural disasters and pandemic influenza. Its staff will be integrated into the National Security Council. \"These decisions reflect the fundamental truth that the challenges of the 21st century are increasingly unconventional and transnational, and therefore demand a response that effectively integrates all aspects of American power,\" Obama said in a written statement. The president's national security adviser, retired Marine Gen. James Jones, told reporters the reorganization reflects the view that national security has both foreign and domestic components. \"What this does is recognize the world as it is, not as it was or as we perhaps wish it would be,\" Jones said. \"The idea that somehow counterterrorism is a homeland security issue doesn't make sense when you recognize the fact that terror around the world doesn't recognize borders.\" Similarly, issues like energy and cyber security need to be part of an integrated National Security Council, he said. Fran Townsend, who was President George W. Bush's top adviser on homeland security and counterterrorism, said in an e-mail exchange Tuesday that the important issue is not how the White House is organized. \"It has been my view that Homeland Security Council organization is less important than having direct access to the president and adequate resources,\" Townsend said. \"The administration's new (security) organization will require the necessary resource allocations across the broad spectrum of threats against the United States. Gen. Jones and John Brennan are experienced, competent officials up to the task.\" Brennan is assistant to the president for homeland security and counterterrorism. The reorganization will retain that position. The National Security Council has historically been centered on State Department and Pentagon matters, but Jones made clear when he joined the administration in January that he believed national security must be addressed more broadly to include economic, narco-terror, arms proliferation and other issues. Obama said the newly expanded National Security staff, under Jones' direction, \"will end the artificial divide between White House staff who have been dealing with national security and homeland security issues.\" The president also is creating a new \"global engagement directorate\" within the National Security Council to more effectively use diplomacy, communications and international aid to support U.S. national security. Other new positions on the council include cybersecurity and transborder security. The House Homeland Security Committee's top Republican, Rep. Peter King of New York, said Obama had come up with a \"workable solution.\" He praised the decision to retain the Homeland Security Council but said he would have preferred that Brennan have direct hiring authority and control over his staff.", 
        "intTime": 20090526, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.federalnewsradio.com/?nid=27&sid=1683371\" WASHINGTON (AP) - President Barack Obama announced Tuesday he is combining White House staffs dealing with international and homeland security, predicting the change will make Americans safer. Obama also is creating a new office intended to communicate more effectively with other countries about U.S. security policy. The Homeland Security Council, created after the Sept. 11, 2001, terrorist attacks, will be kept as a venue for discussing issues concerning domestic security, including terrorism, weapons of mass destruction, natural disasters and pandemic influenza. Its staff will be integrated into the National Security Council. \"These decisions reflect the fundamental truth that the challenges of the 21st century are increasingly unconventional and transnational, and therefore demand a response that effectively integrates all aspects of American power,\" Obama said in a written statement. The president's national security adviser, retired Marine Gen. James Jones, told reporters the reorganization reflects the view that national security has both foreign and domestic components. \"What this does is recognize the world as it is, not as it was or as we perhaps wish it would be,\" Jones said. \"The idea that somehow counterterrorism is a homeland security issue doesn't make sense when you recognize the fact that terror around the world doesn't recognize borders.\" Similarly, issues like energy and cyber security need to be part of an integrated National Security Council, he said. Fran Townsend, who was President George W. Bush's top adviser on homeland security and counterterrorism, said in an e-mail exchange Tuesday that the important issue is not how the White House is organized. \"It has been my view that Homeland Security Council organization is less important than having direct access to the president and adequate resources,\" Townsend said. \"The administration's new (security) organization will require the necessary resource allocations across the broad spectrum of threats against the United States. Gen. Jones and John Brennan are experienced, competent officials up to the task.\" Brennan is assistant to the president for homeland security and counterterrorism. The reorganization will retain that position. The National Security Council has historically been centered on State Department and Pentagon matters, but Jones made clear when he joined the administration in January that he believed national security must be addressed more broadly to include economic, narco-terror, arms proliferation and other issues. Obama said the newly expanded National Security staff, under Jones' direction, \"will end the artificial divide between White House staff who have been dealing with national security and homeland security issues.\" The president also is creating a new \"global engagement directorate\" within the National Security Council to more effectively use diplomacy, communications and international aid to support U.S. national security. Other new positions on the council include cybersecurity and transborder security. The House Homeland Security Committee's top Republican, Rep. Peter King of New York, said Obama had come up with a \"workable solution.\" He praised the decision to retain the Homeland Security Council but said he would have preferred that Brennan have direct hiring authority and control over his staff.", 
        "threadID": "672198221_6290043422001", 
        "time": "2009-05-26 17:18:00", 
        "title": "White House merging national and homeland security", 
        "userID": "ss_287"
    }, 
    {
        "content": "On paper it makes sense. I've never really understood the difference between \"national\" and \"homeland\" security, so if they can cut down the size of the bureaucratic wiring diagram even a little that is a good thing. The real issue is not what the org chart looks like, but how well all the little boxes in the org chart play together.", 
        "intTime": 20090526, 
        "postID": 2, 
        "quote": "", 
        "reply": "On paper it makes sense. I've never really understood the difference between \"national\" and \"homeland\" security, so if they can cut down the size of the bureaucratic wiring diagram even a little that is a good thing. The real issue is not what the org chart looks like, but how well all the little boxes in the org chart play together.", 
        "threadID": "672198221_6290043422001", 
        "time": "2009-05-26 18:15:00", 
        "title": "White House merging national and homeland security", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Motive25: On paper it makes sense. I've never really understood the difference between \"national\" and \"homeland\" security, so if they can cut down the size of the bureaucratic wiring diagram even a little that is a good thing. The real issue is not what the org chart looks like, but how well all the little boxes in the org chart play together. Historicaly they do not play very well together, if at all.", 
        "intTime": 20090526, 
        "postID": 3, 
        "quote": "Originally posted by Motive25: On paper it makes sense. I've never really understood the difference between \"national\" and \"homeland\" security, so if they can cut down the size of the bureaucratic wiring diagram even a little that is a good thing. The real issue is not what the org chart looks like, but how well all the little boxes in the org chart play together.", 
        "reply": " Historicaly they do not play very well together, if at all.", 
        "threadID": "672198221_6290043422001", 
        "time": "2009-05-26 18:20:00", 
        "title": "White House merging national and homeland security", 
        "userID": "grizzybear"
    }, 
    {
        "content": "Can we also get rid of that stupid color-coded alert system that we never use?", 
        "intTime": 20090526, 
        "postID": 4, 
        "quote": "", 
        "reply": "Can we also get rid of that stupid color-coded alert system that we never use?", 
        "threadID": "672198221_6290043422001", 
        "time": "2009-05-26 18:22:00", 
        "title": "White House merging national and homeland security", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Historicaly they do not play very well together, if at all. Why do the names SS and Gestapo come to mind?", 
        "intTime": 20090526, 
        "postID": 5, 
        "quote": "Historicaly they do not play very well together, if at all.", 
        "reply": " Why do the names SS and Gestapo come to mind?", 
        "threadID": "672198221_6290043422001", 
        "time": "2009-05-26 18:45:00", 
        "title": "White House merging national and homeland security", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: Can we also get rid of that stupid color-coded alert system that we never use? I know I thought it was dumb when it first come out. Any bureaucrat will keep it yellow or over just to cover his/her azz. It is really dumb.", 
        "intTime": 20090526, 
        "postID": 6, 
        "quote": "Originally posted by mrmixitup: Can we also get rid of that stupid color-coded alert system that we never use?", 
        "reply": " I know I thought it was dumb when it first come out. Any bureaucrat will keep it yellow or over just to cover his/her azz. It is really dumb.", 
        "threadID": "672198221_6290043422001", 
        "time": "2009-05-26 18:47:00", 
        "title": "White House merging national and homeland security", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Historicaly they do not play very well together, if at all. Why do the names SS and Gestapo come to mind? Because you will accept any excuse or lie to attack Mr. Obama.", 
        "intTime": 20090526, 
        "postID": 7, 
        "quote": "Originally posted by crackerjacks61: quote: Historicaly they do not play very well together, if at all. Why do the names SS and Gestapo come to mind?", 
        "reply": " Because you will accept any excuse or lie to attack Mr. Obama.", 
        "threadID": "672198221_6290043422001", 
        "time": "2009-05-26 18:57:00", 
        "title": "White House merging national and homeland security", 
        "userID": "rayld2"
    }
]