[
    {
        "content": "Apparently this guy was trying to help terrorists accomplish another USS Cole type incident. Isn't 10 years pretty light for something this treasonous? quote: ++http://www.ctv.ca/servlet/ArticleNews/story/CTVNews/20090403/abujihaad_sentence_090403/20090403?hub=Canada NEW HAVEN, Conn. -- A federal judge in Connecticut has sentenced a former U.S. navy sailor to 10 years in prison for leaking details about Canadian and American warships. Hassan Abu-Jihaad did not speak at today's hearing in New Haven. U.S. District Judge Mark Kravitz says the leak was \"a fundamental betrayal.\" Prosecutors say the Phoenix man is a traitor who was trying to help foreign terrorists replicate the bombing of the USS Cole. Abu-Jihaad was convicted last year of disclosing classified national defence information...", 
        "intTime": 20090403, 
        "postID": 1, 
        "quote": "++http://www.ctv.ca/servlet/ArticleNews/story/CTVNews/20090403/abujihaad_sentence_090403/20090403?hub=Canada NEW HAVEN, Conn. -- A federal judge in Connecticut has sentenced a former U.S. navy sailor to 10 years in prison for leaking details about Canadian and American warships. Hassan Abu-Jihaad did not speak at today's hearing in New Haven. U.S. District Judge Mark Kravitz says the leak was \"a fundamental betrayal.\" Prosecutors say the Phoenix man is a traitor who was trying to help foreign terrorists replicate the bombing of the USS Cole. Abu-Jihaad was convicted last year of disclosing classified national defence information...", 
        "reply": "Apparently this guy was trying to help terrorists accomplish another USS Cole type incident. Isn't 10 years pretty light for something this treasonous? ", 
        "threadID": "672198221_1720087912001", 
        "time": "2009-04-03 17:23:00", 
        "title": "Ex-USN sailor sentenced to 10 years for leaking USN, Canadian intel to terrorists", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Apparently this guy was trying to help terrorists accomplish another USS Cole type incident. Isn't 10 years pretty light for something this treasonous? Yes and welcome to the era of dumb justice. unless these charges were BS to begin with, indeed death would be more the punishment.", 
        "intTime": 20090403, 
        "postID": 2, 
        "quote": "Apparently this guy was trying to help terrorists accomplish another USS Cole type incident. Isn't 10 years pretty light for something this treasonous?", 
        "reply": " Yes and welcome to the era of dumb justice. unless these charges were BS to begin with, indeed death would be more the punishment.", 
        "threadID": "672198221_1720087912001", 
        "time": "2009-04-03 18:03:00", 
        "title": "Ex-USN sailor sentenced to 10 years for leaking USN, Canadian intel to terrorists", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: unless these charges were BS to begin with, and you state this because of some insight into the case? (Quote) Abu-Jihaad, 33, was convicted last year of disclosing classified national defence information. Prosecutors labelled him a traitor who was trying to help foreign terrorists replicate the bombing of the USS Cole, which killed 17 American sailors.(Quote) Why did it take a year to decide the sentence?", 
        "intTime": 20090404, 
        "postID": 3, 
        "quote": "Originally posted by crackerjacks61: unless these charges were BS to begin with,", 
        "reply": " and you state this because of some insight into the case? (Quote) Abu-Jihaad, 33, was convicted last year of disclosing classified national defence information. Prosecutors labelled him a traitor who was trying to help foreign terrorists replicate the bombing of the USS Cole, which killed 17 American sailors.(Quote) Why did it take a year to decide the sentence?", 
        "threadID": "672198221_1720087912001", 
        "time": "2009-04-04 03:55:00", 
        "title": "Ex-USN sailor sentenced to 10 years for leaking USN, Canadian intel to terrorists", 
        "userID": "busnrete8"
    }
]