[
    {
        "content": "\"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen.",
        "intTime": 20090311,
        "postID": 1,
        "quote": "",
        "reply": "\"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:19:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "The whole thing is unfortunate, but if true this is their own private matter. Bristol Palin and Levi Johnston are not public figures.",
        "intTime": 20090311,
        "postID": 2,
        "quote": "",
        "reply": "The whole thing is unfortunate, but if true this is their own private matter. Bristol Palin and Levi Johnston are not public figures.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:21:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "RPCVDR"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: \"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen. COMMENT: I guess we should dedicate an appropriate Righteous Brothers tune to the demise of their partnership, \"You've Lost That Loving Feeling.\" I wonder if it plays in Alaska in English ... or Russian.",
        "intTime": 20090311,
        "postID": 3,
        "quote": "Originally posted by crackerjacks61: \"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen.",
        "reply": " COMMENT: I guess we should dedicate an appropriate Righteous Brothers tune to the demise of their partnership, \"You've Lost That Loving Feeling.\" I wonder if it plays in Alaska in English ... or Russian.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:25:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "NOVAMarine"
    },
    {
        "content": "It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" \"Common sense isn't.\"",
        "intTime": 20090311,
        "postID": 4,
        "quote": "",
        "reply": "It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" \"Common sense isn't.\"",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:28:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "Gladewalker"
    },
    {
        "content": "Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open.",
        "intTime": 20090311,
        "postID": 5,
        "quote": "",
        "reply": "Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:31:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets......",
        "intTime": 20090311,
        "postID": 6,
        "quote": "",
        "reply": "You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets......",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:34:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "LineDoggie"
    },
    {
        "content": "Way to go Bristol, your too good for that bum anyway.",
        "intTime": 20090311,
        "postID": 7,
        "quote": "",
        "reply": "Way to go Bristol, your too good for that bum anyway.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:35:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" COMMENT: Well, I would certainly hope that we wouldn't be reading about either of the Obama daughters being unwed mothers.",
        "intTime": 20090311,
        "postID": 8,
        "quote": "Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\"",
        "reply": " COMMENT: Well, I would certainly hope that we wouldn't be reading about either of the Obama daughters being unwed mothers.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:42:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "NOVAMarine"
    },
    {
        "content": "Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap",
        "intTime": 20090311,
        "postID": 9,
        "quote": "",
        "reply": "Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:52:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "ACR26"
    },
    {
        "content": "quote: Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" It isn't Sarah Palin, it is her daughter. And if it was a Clinton or Obama daughter, it still wouldn't be THEM. quote: Originally posted by crackerjacks61: Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open. And I am sure she still believes the morals and values she was preaching and still believes in abstinence. Again, it wasn't Sarah Palin but her daughter. It wasn't Sarah Palin who had a child out of wedlock was it? Did I miss something?",
        "intTime": 20090311,
        "postID": 10,
        "quote": "Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\"",
        "reply": " It isn't Sarah Palin, it is her daughter. And if it was a Clinton or Obama daughter, it still wouldn't be THEM. quote: Originally posted by crackerjacks61: Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open. And I am sure she still believes the morals and values she was preaching and still believes in abstinence. Again, it wasn't Sarah Palin but her daughter. It wasn't Sarah Palin who had a child out of wedlock was it? Did I miss something?",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:58:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "klc2000us"
    },
    {
        "content": "quote: Originally posted by LineDoggie: You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets...... No, candidates' children (especially young children and teenagers) are not fair game, regardless of their parents' politics. Recall that when the story about Bristol Palin first broke, Barak Obama was very emphatic, that politicians' families are off limits and their children are especially off-limits. Barack Obama and Sarah Palin are fair game. Their spouses MAY be fair game, particularly if they intentionally insert themselves into the political process. However, their children never asked to become part of the public process, and they deserve privacy and to be left alone.",
        "intTime": 20090311,
        "postID": 11,
        "quote": "Originally posted by LineDoggie: You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets......",
        "reply": " No, candidates' children (especially young children and teenagers) are not fair game, regardless of their parents' politics. Recall that when the story about Bristol Palin first broke, Barak Obama was very emphatic, that politicians' families are off limits and their children are especially off-limits. Barack Obama and Sarah Palin are fair game. Their spouses MAY be fair game, particularly if they intentionally insert themselves into the political process. However, their children never asked to become part of the public process, and they deserve privacy and to be left alone.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:01:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "RPCVDR"
    },
    {
        "content": "This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation.",
        "intTime": 20090311,
        "postID": 12,
        "quote": "",
        "reply": "This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:02:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult.",
        "intTime": 20090311,
        "postID": 13,
        "quote": "Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap",
        "reply": " COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:07:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "NOVAMarine"
    },
    {
        "content": "Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live?",
        "intTime": 20090311,
        "postID": 14,
        "quote": "",
        "reply": "Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live?",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:13:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by NOVAMarine: quote: Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap COMMENT: Oh, so it's okay to wish that the president fail ... I wish Obama would do well but that won't make it so nova. I wanted to believe in him but it didn't take long for that hope to crash and burn as I have watched him try and take control of every aspect of this country, including us Americans. Why is it that you want the government to control us and everything we do or don't do? Go ahead... you keep telling yourself that I am living in a world of delusions and Obama will actually keep at least 1 promise he has made. Convince yourself that the trillions of dollars he is trying to use to bail every loser out, isn't being made on a copy machine. I know it makes you feel all that much more superior to think we are all a bunch of idiots. But don't be suprised when reality slaps you in the face.",
        "intTime": 20090311,
        "postID": 15,
        "quote": "Originally posted by NOVAMarine: quote: Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap COMMENT: Oh, so it's okay to wish that the president fail ...",
        "reply": " I wish Obama would do well but that won't make it so nova. I wanted to believe in him but it didn't take long for that hope to crash and burn as I have watched him try and take control of every aspect of this country, including us Americans. Why is it that you want the government to control us and everything we do or don't do? Go ahead... you keep telling yourself that I am living in a world of delusions and Obama will actually keep at least 1 promise he has made. Convince yourself that the trillions of dollars he is trying to use to bail every loser out, isn't being made on a copy machine. I know it makes you feel all that much more superior to think we are all a bunch of idiots. But don't be suprised when reality slaps you in the face.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:25:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "intTime": 20090311,
        "postID": 16,
        "quote": "Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live?",
        "reply": " Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:25:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke. She isn't pretending. Her daughter makes her own choices. Sarah doesn't control the masses like Obama is trying to do. Either way this story is false so try something else to bash Palin since it gives you so much joy. But next time have some actual proof.",
        "intTime": 20090311,
        "postID": 17,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "reply": " She isn't pretending. Her daughter makes her own choices. Sarah doesn't control the masses like Obama is trying to do. Either way this story is false so try something else to bash Palin since it gives you so much joy. But next time have some actual proof.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:29:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation. Your point has absolutely nothing to do with Bristol Palin, so if this isn't about the kids, why did you drag her into it? quote: Originally posted by NOVAMarine:COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult. It never should have been publicly reported. It's no one's business. Palin and Obama chose to be in the limelight, the children did not. And the fact she's now 18 doesn't change that.",
        "intTime": 20090311,
        "postID": 18,
        "quote": "Originally posted by crackerjacks61: This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation.",
        "reply": " Your point has absolutely nothing to do with Bristol Palin, so if this isn't about the kids, why did you drag her into it? quote: Originally posted by NOVAMarine:COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult. It never should have been publicly reported. It's no one's business. Palin and Obama chose to be in the limelight, the children did not. And the fact she's now 18 doesn't change that.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:32:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "BayStateGal"
    },
    {
        "content": "hmm, sex is good but the realities of life are to much..... and the boy walks. To bad we can't teach young folks this fact when they have hormone overload. One Flag......One Heart......One Nation............EVERMORE",
        "intTime": 20090311,
        "postID": 19,
        "quote": "",
        "reply": "hmm, sex is good but the realities of life are to much..... and the boy walks. To bad we can't teach young folks this fact when they have hormone overload. One Flag......One Heart......One Nation............EVERMORE",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:38:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "m551sheridan"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke. I am uncomfortable reading about Ms. Palins daughter - And I was unconfortable reading about how \"ugly\" Chelsea Clinton was. Clicking on Rush Limbaughs site, he manages to bring up Chelsea Clinton 48 times in just the last two years. Here's one example, and it's pure slander... quote: RUSH: Well, let me tell you what the chaos is. Let me give you a great example. We had Michelle Obama, who was in Zanesville, Ohio talking to a bunch of people that live there. The income, average income is below the national average. So is the education level. And Michelle Obama is telling them, \"Don't go into corporate America,\" and she specified two things. Don't become a corporate lawyer, and don't become a hedge-fund operator. Now, Hillary was a corporate lawyer, and Chelsea is in the hedge-fund business. The younger Clinton is an employee of a brokerage firm - Neat trick saying that she's \"in the Hedge fund business.\" Dave",
        "intTime": 20090311,
        "postID": 20,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "reply": " I am uncomfortable reading about Ms. Palins daughter - And I was unconfortable reading about how \"ugly\" Chelsea Clinton was. Clicking on Rush Limbaughs site, he manages to bring up Chelsea Clinton 48 times in just the last two years. Here's one example, and it's pure slander... quote: RUSH: Well, let me tell you what the chaos is. Let me give you a great example. We had Michelle Obama, who was in Zanesville, Ohio talking to a bunch of people that live there. The income, average income is below the national average. So is the education level. And Michelle Obama is telling them, \"Don't go into corporate America,\" and she specified two things. Don't become a corporate lawyer, and don't become a hedge-fund operator. Now, Hillary was a corporate lawyer, and Chelsea is in the hedge-fund business. The younger Clinton is an employee of a brokerage firm - Neat trick saying that she's \"in the Hedge fund business.\" Dave",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:39:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "Grachus"
    },
    {
        "content": "\"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen.",
        "intTime": 20090311,
        "postID": 21,
        "quote": "",
        "reply": "\"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:19:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "The whole thing is unfortunate, but if true this is their own private matter. Bristol Palin and Levi Johnston are not public figures.",
        "intTime": 20090311,
        "postID": 22,
        "quote": "",
        "reply": "The whole thing is unfortunate, but if true this is their own private matter. Bristol Palin and Levi Johnston are not public figures.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:21:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "RPCVDR"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: \"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen. COMMENT: I guess we should dedicate an appropriate Righteous Brothers tune to the demise of their partnership, \"You've Lost That Loving Feeling.\" I wonder if it plays in Alaska in English ... or Russian.",
        "intTime": 20090311,
        "postID": 23,
        "quote": "Originally posted by crackerjacks61: \"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen.",
        "reply": " COMMENT: I guess we should dedicate an appropriate Righteous Brothers tune to the demise of their partnership, \"You've Lost That Loving Feeling.\" I wonder if it plays in Alaska in English ... or Russian.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:25:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "NOVAMarine"
    },
    {
        "content": "It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" \"Common sense isn't.\"",
        "intTime": 20090311,
        "postID": 24,
        "quote": "",
        "reply": "It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" \"Common sense isn't.\"",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:28:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "Gladewalker"
    },
    {
        "content": "Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open.",
        "intTime": 20090311,
        "postID": 25,
        "quote": "",
        "reply": "Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:31:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets......",
        "intTime": 20090311,
        "postID": 26,
        "quote": "",
        "reply": "You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets......",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:34:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "LineDoggie"
    },
    {
        "content": "Way to go Bristol, your too good for that bum anyway.",
        "intTime": 20090311,
        "postID": 27,
        "quote": "",
        "reply": "Way to go Bristol, your too good for that bum anyway.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:35:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" COMMENT: Well, I would certainly hope that we wouldn't be reading about either of the Obama daughters being unwed mothers.",
        "intTime": 20090311,
        "postID": 28,
        "quote": "Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\"",
        "reply": " COMMENT: Well, I would certainly hope that we wouldn't be reading about either of the Obama daughters being unwed mothers.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:42:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "NOVAMarine"
    },
    {
        "content": "Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap",
        "intTime": 20090311,
        "postID": 29,
        "quote": "",
        "reply": "Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:52:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "ACR26"
    },
    {
        "content": "quote: Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" It isn't Sarah Palin, it is her daughter. And if it was a Clinton or Obama daughter, it still wouldn't be THEM. quote: Originally posted by crackerjacks61: Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open. And I am sure she still believes the morals and values she was preaching and still believes in abstinence. Again, it wasn't Sarah Palin but her daughter. It wasn't Sarah Palin who had a child out of wedlock was it? Did I miss something?",
        "intTime": 20090311,
        "postID": 30,
        "quote": "Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\"",
        "reply": " It isn't Sarah Palin, it is her daughter. And if it was a Clinton or Obama daughter, it still wouldn't be THEM. quote: Originally posted by crackerjacks61: Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open. And I am sure she still believes the morals and values she was preaching and still believes in abstinence. Again, it wasn't Sarah Palin but her daughter. It wasn't Sarah Palin who had a child out of wedlock was it? Did I miss something?",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:58:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "klc2000us"
    },
    {
        "content": "quote: Originally posted by LineDoggie: You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets...... No, candidates' children (especially young children and teenagers) are not fair game, regardless of their parents' politics. Recall that when the story about Bristol Palin first broke, Barak Obama was very emphatic, that politicians' families are off limits and their children are especially off-limits. Barack Obama and Sarah Palin are fair game. Their spouses MAY be fair game, particularly if they intentionally insert themselves into the political process. However, their children never asked to become part of the public process, and they deserve privacy and to be left alone.",
        "intTime": 20090311,
        "postID": 31,
        "quote": "Originally posted by LineDoggie: You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets......",
        "reply": " No, candidates' children (especially young children and teenagers) are not fair game, regardless of their parents' politics. Recall that when the story about Bristol Palin first broke, Barak Obama was very emphatic, that politicians' families are off limits and their children are especially off-limits. Barack Obama and Sarah Palin are fair game. Their spouses MAY be fair game, particularly if they intentionally insert themselves into the political process. However, their children never asked to become part of the public process, and they deserve privacy and to be left alone.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:01:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "RPCVDR"
    },
    {
        "content": "This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation.",
        "intTime": 20090311,
        "postID": 32,
        "quote": "",
        "reply": "This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:02:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult.",
        "intTime": 20090311,
        "postID": 33,
        "quote": "Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap",
        "reply": " COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:07:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "NOVAMarine"
    },
    {
        "content": "Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live?",
        "intTime": 20090311,
        "postID": 34,
        "quote": "",
        "reply": "Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live?",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:13:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by NOVAMarine: quote: Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap COMMENT: Oh, so it's okay to wish that the president fail ... I wish Obama would do well but that won't make it so nova. I wanted to believe in him but it didn't take long for that hope to crash and burn as I have watched him try and take control of every aspect of this country, including us Americans. Why is it that you want the government to control us and everything we do or don't do? Go ahead... you keep telling yourself that I am living in a world of delusions and Obama will actually keep at least 1 promise he has made. Convince yourself that the trillions of dollars he is trying to use to bail every loser out, isn't being made on a copy machine. I know it makes you feel all that much more superior to think we are all a bunch of idiots. But don't be suprised when reality slaps you in the face.",
        "intTime": 20090311,
        "postID": 35,
        "quote": "Originally posted by NOVAMarine: quote: Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap COMMENT: Oh, so it's okay to wish that the president fail ...",
        "reply": " I wish Obama would do well but that won't make it so nova. I wanted to believe in him but it didn't take long for that hope to crash and burn as I have watched him try and take control of every aspect of this country, including us Americans. Why is it that you want the government to control us and everything we do or don't do? Go ahead... you keep telling yourself that I am living in a world of delusions and Obama will actually keep at least 1 promise he has made. Convince yourself that the trillions of dollars he is trying to use to bail every loser out, isn't being made on a copy machine. I know it makes you feel all that much more superior to think we are all a bunch of idiots. But don't be suprised when reality slaps you in the face.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:25:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "intTime": 20090311,
        "postID": 36,
        "quote": "Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live?",
        "reply": " Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:25:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke. She isn't pretending. Her daughter makes her own choices. Sarah doesn't control the masses like Obama is trying to do. Either way this story is false so try something else to bash Palin since it gives you so much joy. But next time have some actual proof.",
        "intTime": 20090311,
        "postID": 37,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "reply": " She isn't pretending. Her daughter makes her own choices. Sarah doesn't control the masses like Obama is trying to do. Either way this story is false so try something else to bash Palin since it gives you so much joy. But next time have some actual proof.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:29:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation. Your point has absolutely nothing to do with Bristol Palin, so if this isn't about the kids, why did you drag her into it? quote: Originally posted by NOVAMarine:COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult. It never should have been publicly reported. It's no one's business. Palin and Obama chose to be in the limelight, the children did not. And the fact she's now 18 doesn't change that.",
        "intTime": 20090311,
        "postID": 38,
        "quote": "Originally posted by crackerjacks61: This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation.",
        "reply": " Your point has absolutely nothing to do with Bristol Palin, so if this isn't about the kids, why did you drag her into it? quote: Originally posted by NOVAMarine:COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult. It never should have been publicly reported. It's no one's business. Palin and Obama chose to be in the limelight, the children did not. And the fact she's now 18 doesn't change that.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:32:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "BayStateGal"
    },
    {
        "content": "hmm, sex is good but the realities of life are to much..... and the boy walks. To bad we can't teach young folks this fact when they have hormone overload. One Flag......One Heart......One Nation............EVERMORE",
        "intTime": 20090311,
        "postID": 39,
        "quote": "",
        "reply": "hmm, sex is good but the realities of life are to much..... and the boy walks. To bad we can't teach young folks this fact when they have hormone overload. One Flag......One Heart......One Nation............EVERMORE",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:38:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "m551sheridan"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke. I am uncomfortable reading about Ms. Palins daughter - And I was unconfortable reading about how \"ugly\" Chelsea Clinton was. Clicking on Rush Limbaughs site, he manages to bring up Chelsea Clinton 48 times in just the last two years. Here's one example, and it's pure slander... quote: RUSH: Well, let me tell you what the chaos is. Let me give you a great example. We had Michelle Obama, who was in Zanesville, Ohio talking to a bunch of people that live there. The income, average income is below the national average. So is the education level. And Michelle Obama is telling them, \"Don't go into corporate America,\" and she specified two things. Don't become a corporate lawyer, and don't become a hedge-fund operator. Now, Hillary was a corporate lawyer, and Chelsea is in the hedge-fund business. The younger Clinton is an employee of a brokerage firm - Neat trick saying that she's \"in the Hedge fund business.\" Dave",
        "intTime": 20090311,
        "postID": 40,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "reply": " I am uncomfortable reading about Ms. Palins daughter - And I was unconfortable reading about how \"ugly\" Chelsea Clinton was. Clicking on Rush Limbaughs site, he manages to bring up Chelsea Clinton 48 times in just the last two years. Here's one example, and it's pure slander... quote: RUSH: Well, let me tell you what the chaos is. Let me give you a great example. We had Michelle Obama, who was in Zanesville, Ohio talking to a bunch of people that live there. The income, average income is below the national average. So is the education level. And Michelle Obama is telling them, \"Don't go into corporate America,\" and she specified two things. Don't become a corporate lawyer, and don't become a hedge-fund operator. Now, Hillary was a corporate lawyer, and Chelsea is in the hedge-fund business. The younger Clinton is an employee of a brokerage firm - Neat trick saying that she's \"in the Hedge fund business.\" Dave",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:39:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "Grachus"
    },
    {
        "content": "\"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen.",
        "intTime": 20090311,
        "postID": 41,
        "quote": "",
        "reply": "\"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:19:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "The whole thing is unfortunate, but if true this is their own private matter. Bristol Palin and Levi Johnston are not public figures.",
        "intTime": 20090311,
        "postID": 42,
        "quote": "",
        "reply": "The whole thing is unfortunate, but if true this is their own private matter. Bristol Palin and Levi Johnston are not public figures.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:21:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "RPCVDR"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: \"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen. COMMENT: I guess we should dedicate an appropriate Righteous Brothers tune to the demise of their partnership, \"You've Lost That Loving Feeling.\" I wonder if it plays in Alaska in English ... or Russian.",
        "intTime": 20090311,
        "postID": 43,
        "quote": "Originally posted by crackerjacks61: \"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen.",
        "reply": " COMMENT: I guess we should dedicate an appropriate Righteous Brothers tune to the demise of their partnership, \"You've Lost That Loving Feeling.\" I wonder if it plays in Alaska in English ... or Russian.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:25:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "NOVAMarine"
    },
    {
        "content": "It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" \"Common sense isn't.\"",
        "intTime": 20090311,
        "postID": 44,
        "quote": "",
        "reply": "It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" \"Common sense isn't.\"",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:28:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "Gladewalker"
    },
    {
        "content": "Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open.",
        "intTime": 20090311,
        "postID": 45,
        "quote": "",
        "reply": "Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:31:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets......",
        "intTime": 20090311,
        "postID": 46,
        "quote": "",
        "reply": "You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets......",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:34:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "LineDoggie"
    },
    {
        "content": "Way to go Bristol, your too good for that bum anyway.",
        "intTime": 20090311,
        "postID": 47,
        "quote": "",
        "reply": "Way to go Bristol, your too good for that bum anyway.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:35:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" COMMENT: Well, I would certainly hope that we wouldn't be reading about either of the Obama daughters being unwed mothers.",
        "intTime": 20090311,
        "postID": 48,
        "quote": "Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\"",
        "reply": " COMMENT: Well, I would certainly hope that we wouldn't be reading about either of the Obama daughters being unwed mothers.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:42:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "NOVAMarine"
    },
    {
        "content": "Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap",
        "intTime": 20090311,
        "postID": 49,
        "quote": "",
        "reply": "Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:52:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "ACR26"
    },
    {
        "content": "quote: Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" It isn't Sarah Palin, it is her daughter. And if it was a Clinton or Obama daughter, it still wouldn't be THEM. quote: Originally posted by crackerjacks61: Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open. And I am sure she still believes the morals and values she was preaching and still believes in abstinence. Again, it wasn't Sarah Palin but her daughter. It wasn't Sarah Palin who had a child out of wedlock was it? Did I miss something?",
        "intTime": 20090311,
        "postID": 50,
        "quote": "Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\"",
        "reply": " It isn't Sarah Palin, it is her daughter. And if it was a Clinton or Obama daughter, it still wouldn't be THEM. quote: Originally posted by crackerjacks61: Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open. And I am sure she still believes the morals and values she was preaching and still believes in abstinence. Again, it wasn't Sarah Palin but her daughter. It wasn't Sarah Palin who had a child out of wedlock was it? Did I miss something?",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:58:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "klc2000us"
    },
    {
        "content": "quote: Originally posted by LineDoggie: You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets...... No, candidates' children (especially young children and teenagers) are not fair game, regardless of their parents' politics. Recall that when the story about Bristol Palin first broke, Barak Obama was very emphatic, that politicians' families are off limits and their children are especially off-limits. Barack Obama and Sarah Palin are fair game. Their spouses MAY be fair game, particularly if they intentionally insert themselves into the political process. However, their children never asked to become part of the public process, and they deserve privacy and to be left alone.",
        "intTime": 20090311,
        "postID": 51,
        "quote": "Originally posted by LineDoggie: You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets......",
        "reply": " No, candidates' children (especially young children and teenagers) are not fair game, regardless of their parents' politics. Recall that when the story about Bristol Palin first broke, Barak Obama was very emphatic, that politicians' families are off limits and their children are especially off-limits. Barack Obama and Sarah Palin are fair game. Their spouses MAY be fair game, particularly if they intentionally insert themselves into the political process. However, their children never asked to become part of the public process, and they deserve privacy and to be left alone.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:01:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "RPCVDR"
    },
    {
        "content": "This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation.",
        "intTime": 20090311,
        "postID": 52,
        "quote": "",
        "reply": "This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:02:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult.",
        "intTime": 20090311,
        "postID": 53,
        "quote": "Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap",
        "reply": " COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:07:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "NOVAMarine"
    },
    {
        "content": "Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live?",
        "intTime": 20090311,
        "postID": 54,
        "quote": "",
        "reply": "Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live?",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:13:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by NOVAMarine: quote: Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap COMMENT: Oh, so it's okay to wish that the president fail ... I wish Obama would do well but that won't make it so nova. I wanted to believe in him but it didn't take long for that hope to crash and burn as I have watched him try and take control of every aspect of this country, including us Americans. Why is it that you want the government to control us and everything we do or don't do? Go ahead... you keep telling yourself that I am living in a world of delusions and Obama will actually keep at least 1 promise he has made. Convince yourself that the trillions of dollars he is trying to use to bail every loser out, isn't being made on a copy machine. I know it makes you feel all that much more superior to think we are all a bunch of idiots. But don't be suprised when reality slaps you in the face.",
        "intTime": 20090311,
        "postID": 55,
        "quote": "Originally posted by NOVAMarine: quote: Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap COMMENT: Oh, so it's okay to wish that the president fail ...",
        "reply": " I wish Obama would do well but that won't make it so nova. I wanted to believe in him but it didn't take long for that hope to crash and burn as I have watched him try and take control of every aspect of this country, including us Americans. Why is it that you want the government to control us and everything we do or don't do? Go ahead... you keep telling yourself that I am living in a world of delusions and Obama will actually keep at least 1 promise he has made. Convince yourself that the trillions of dollars he is trying to use to bail every loser out, isn't being made on a copy machine. I know it makes you feel all that much more superior to think we are all a bunch of idiots. But don't be suprised when reality slaps you in the face.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:25:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "intTime": 20090311,
        "postID": 56,
        "quote": "Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live?",
        "reply": " Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:25:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke. She isn't pretending. Her daughter makes her own choices. Sarah doesn't control the masses like Obama is trying to do. Either way this story is false so try something else to bash Palin since it gives you so much joy. But next time have some actual proof.",
        "intTime": 20090311,
        "postID": 57,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "reply": " She isn't pretending. Her daughter makes her own choices. Sarah doesn't control the masses like Obama is trying to do. Either way this story is false so try something else to bash Palin since it gives you so much joy. But next time have some actual proof.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:29:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation. Your point has absolutely nothing to do with Bristol Palin, so if this isn't about the kids, why did you drag her into it? quote: Originally posted by NOVAMarine:COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult. It never should have been publicly reported. It's no one's business. Palin and Obama chose to be in the limelight, the children did not. And the fact she's now 18 doesn't change that.",
        "intTime": 20090311,
        "postID": 58,
        "quote": "Originally posted by crackerjacks61: This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation.",
        "reply": " Your point has absolutely nothing to do with Bristol Palin, so if this isn't about the kids, why did you drag her into it? quote: Originally posted by NOVAMarine:COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult. It never should have been publicly reported. It's no one's business. Palin and Obama chose to be in the limelight, the children did not. And the fact she's now 18 doesn't change that.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:32:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "BayStateGal"
    },
    {
        "content": "hmm, sex is good but the realities of life are to much..... and the boy walks. To bad we can't teach young folks this fact when they have hormone overload. One Flag......One Heart......One Nation............EVERMORE",
        "intTime": 20090311,
        "postID": 59,
        "quote": "",
        "reply": "hmm, sex is good but the realities of life are to much..... and the boy walks. To bad we can't teach young folks this fact when they have hormone overload. One Flag......One Heart......One Nation............EVERMORE",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:38:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "m551sheridan"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke. I am uncomfortable reading about Ms. Palins daughter - And I was unconfortable reading about how \"ugly\" Chelsea Clinton was. Clicking on Rush Limbaughs site, he manages to bring up Chelsea Clinton 48 times in just the last two years. Here's one example, and it's pure slander... quote: RUSH: Well, let me tell you what the chaos is. Let me give you a great example. We had Michelle Obama, who was in Zanesville, Ohio talking to a bunch of people that live there. The income, average income is below the national average. So is the education level. And Michelle Obama is telling them, \"Don't go into corporate America,\" and she specified two things. Don't become a corporate lawyer, and don't become a hedge-fund operator. Now, Hillary was a corporate lawyer, and Chelsea is in the hedge-fund business. The younger Clinton is an employee of a brokerage firm - Neat trick saying that she's \"in the Hedge fund business.\" Dave",
        "intTime": 20090311,
        "postID": 60,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "reply": " I am uncomfortable reading about Ms. Palins daughter - And I was unconfortable reading about how \"ugly\" Chelsea Clinton was. Clicking on Rush Limbaughs site, he manages to bring up Chelsea Clinton 48 times in just the last two years. Here's one example, and it's pure slander... quote: RUSH: Well, let me tell you what the chaos is. Let me give you a great example. We had Michelle Obama, who was in Zanesville, Ohio talking to a bunch of people that live there. The income, average income is below the national average. So is the education level. And Michelle Obama is telling them, \"Don't go into corporate America,\" and she specified two things. Don't become a corporate lawyer, and don't become a hedge-fund operator. Now, Hillary was a corporate lawyer, and Chelsea is in the hedge-fund business. The younger Clinton is an employee of a brokerage firm - Neat trick saying that she's \"in the Hedge fund business.\" Dave",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:39:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "Grachus"
    },
    {
        "content": "\"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen.",
        "intTime": 20090311,
        "postID": 61,
        "quote": "",
        "reply": "\"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:19:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "The whole thing is unfortunate, but if true this is their own private matter. Bristol Palin and Levi Johnston are not public figures.",
        "intTime": 20090311,
        "postID": 62,
        "quote": "",
        "reply": "The whole thing is unfortunate, but if true this is their own private matter. Bristol Palin and Levi Johnston are not public figures.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:21:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "RPCVDR"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: \"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen. COMMENT: I guess we should dedicate an appropriate Righteous Brothers tune to the demise of their partnership, \"You've Lost That Loving Feeling.\" I wonder if it plays in Alaska in English ... or Russian.",
        "intTime": 20090311,
        "postID": 63,
        "quote": "Originally posted by crackerjacks61: \"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen.",
        "reply": " COMMENT: I guess we should dedicate an appropriate Righteous Brothers tune to the demise of their partnership, \"You've Lost That Loving Feeling.\" I wonder if it plays in Alaska in English ... or Russian.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:25:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "NOVAMarine"
    },
    {
        "content": "It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" \"Common sense isn't.\"",
        "intTime": 20090311,
        "postID": 64,
        "quote": "",
        "reply": "It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" \"Common sense isn't.\"",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:28:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "Gladewalker"
    },
    {
        "content": "Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open.",
        "intTime": 20090311,
        "postID": 65,
        "quote": "",
        "reply": "Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:31:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets......",
        "intTime": 20090311,
        "postID": 66,
        "quote": "",
        "reply": "You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets......",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:34:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "LineDoggie"
    },
    {
        "content": "Way to go Bristol, your too good for that bum anyway.",
        "intTime": 20090311,
        "postID": 67,
        "quote": "",
        "reply": "Way to go Bristol, your too good for that bum anyway.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:35:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" COMMENT: Well, I would certainly hope that we wouldn't be reading about either of the Obama daughters being unwed mothers.",
        "intTime": 20090311,
        "postID": 68,
        "quote": "Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\"",
        "reply": " COMMENT: Well, I would certainly hope that we wouldn't be reading about either of the Obama daughters being unwed mothers.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:42:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "NOVAMarine"
    },
    {
        "content": "Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap",
        "intTime": 20090311,
        "postID": 69,
        "quote": "",
        "reply": "Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:52:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "ACR26"
    },
    {
        "content": "quote: Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" It isn't Sarah Palin, it is her daughter. And if it was a Clinton or Obama daughter, it still wouldn't be THEM. quote: Originally posted by crackerjacks61: Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open. And I am sure she still believes the morals and values she was preaching and still believes in abstinence. Again, it wasn't Sarah Palin but her daughter. It wasn't Sarah Palin who had a child out of wedlock was it? Did I miss something?",
        "intTime": 20090311,
        "postID": 70,
        "quote": "Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\"",
        "reply": " It isn't Sarah Palin, it is her daughter. And if it was a Clinton or Obama daughter, it still wouldn't be THEM. quote: Originally posted by crackerjacks61: Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open. And I am sure she still believes the morals and values she was preaching and still believes in abstinence. Again, it wasn't Sarah Palin but her daughter. It wasn't Sarah Palin who had a child out of wedlock was it? Did I miss something?",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:58:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "klc2000us"
    },
    {
        "content": "quote: Originally posted by LineDoggie: You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets...... No, candidates' children (especially young children and teenagers) are not fair game, regardless of their parents' politics. Recall that when the story about Bristol Palin first broke, Barak Obama was very emphatic, that politicians' families are off limits and their children are especially off-limits. Barack Obama and Sarah Palin are fair game. Their spouses MAY be fair game, particularly if they intentionally insert themselves into the political process. However, their children never asked to become part of the public process, and they deserve privacy and to be left alone.",
        "intTime": 20090311,
        "postID": 71,
        "quote": "Originally posted by LineDoggie: You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets......",
        "reply": " No, candidates' children (especially young children and teenagers) are not fair game, regardless of their parents' politics. Recall that when the story about Bristol Palin first broke, Barak Obama was very emphatic, that politicians' families are off limits and their children are especially off-limits. Barack Obama and Sarah Palin are fair game. Their spouses MAY be fair game, particularly if they intentionally insert themselves into the political process. However, their children never asked to become part of the public process, and they deserve privacy and to be left alone.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:01:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "RPCVDR"
    },
    {
        "content": "This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation.",
        "intTime": 20090311,
        "postID": 72,
        "quote": "",
        "reply": "This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:02:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult.",
        "intTime": 20090311,
        "postID": 73,
        "quote": "Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap",
        "reply": " COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:07:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "NOVAMarine"
    },
    {
        "content": "Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live?",
        "intTime": 20090311,
        "postID": 74,
        "quote": "",
        "reply": "Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live?",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:13:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by NOVAMarine: quote: Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap COMMENT: Oh, so it's okay to wish that the president fail ... I wish Obama would do well but that won't make it so nova. I wanted to believe in him but it didn't take long for that hope to crash and burn as I have watched him try and take control of every aspect of this country, including us Americans. Why is it that you want the government to control us and everything we do or don't do? Go ahead... you keep telling yourself that I am living in a world of delusions and Obama will actually keep at least 1 promise he has made. Convince yourself that the trillions of dollars he is trying to use to bail every loser out, isn't being made on a copy machine. I know it makes you feel all that much more superior to think we are all a bunch of idiots. But don't be suprised when reality slaps you in the face.",
        "intTime": 20090311,
        "postID": 75,
        "quote": "Originally posted by NOVAMarine: quote: Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap COMMENT: Oh, so it's okay to wish that the president fail ...",
        "reply": " I wish Obama would do well but that won't make it so nova. I wanted to believe in him but it didn't take long for that hope to crash and burn as I have watched him try and take control of every aspect of this country, including us Americans. Why is it that you want the government to control us and everything we do or don't do? Go ahead... you keep telling yourself that I am living in a world of delusions and Obama will actually keep at least 1 promise he has made. Convince yourself that the trillions of dollars he is trying to use to bail every loser out, isn't being made on a copy machine. I know it makes you feel all that much more superior to think we are all a bunch of idiots. But don't be suprised when reality slaps you in the face.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:25:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "intTime": 20090311,
        "postID": 76,
        "quote": "Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live?",
        "reply": " Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:25:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke. She isn't pretending. Her daughter makes her own choices. Sarah doesn't control the masses like Obama is trying to do. Either way this story is false so try something else to bash Palin since it gives you so much joy. But next time have some actual proof.",
        "intTime": 20090311,
        "postID": 77,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "reply": " She isn't pretending. Her daughter makes her own choices. Sarah doesn't control the masses like Obama is trying to do. Either way this story is false so try something else to bash Palin since it gives you so much joy. But next time have some actual proof.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:29:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation. Your point has absolutely nothing to do with Bristol Palin, so if this isn't about the kids, why did you drag her into it? quote: Originally posted by NOVAMarine:COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult. It never should have been publicly reported. It's no one's business. Palin and Obama chose to be in the limelight, the children did not. And the fact she's now 18 doesn't change that.",
        "intTime": 20090311,
        "postID": 78,
        "quote": "Originally posted by crackerjacks61: This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation.",
        "reply": " Your point has absolutely nothing to do with Bristol Palin, so if this isn't about the kids, why did you drag her into it? quote: Originally posted by NOVAMarine:COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult. It never should have been publicly reported. It's no one's business. Palin and Obama chose to be in the limelight, the children did not. And the fact she's now 18 doesn't change that.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:32:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "BayStateGal"
    },
    {
        "content": "hmm, sex is good but the realities of life are to much..... and the boy walks. To bad we can't teach young folks this fact when they have hormone overload. One Flag......One Heart......One Nation............EVERMORE",
        "intTime": 20090311,
        "postID": 79,
        "quote": "",
        "reply": "hmm, sex is good but the realities of life are to much..... and the boy walks. To bad we can't teach young folks this fact when they have hormone overload. One Flag......One Heart......One Nation............EVERMORE",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:38:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "m551sheridan"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke. I am uncomfortable reading about Ms. Palins daughter - And I was unconfortable reading about how \"ugly\" Chelsea Clinton was. Clicking on Rush Limbaughs site, he manages to bring up Chelsea Clinton 48 times in just the last two years. Here's one example, and it's pure slander... quote: RUSH: Well, let me tell you what the chaos is. Let me give you a great example. We had Michelle Obama, who was in Zanesville, Ohio talking to a bunch of people that live there. The income, average income is below the national average. So is the education level. And Michelle Obama is telling them, \"Don't go into corporate America,\" and she specified two things. Don't become a corporate lawyer, and don't become a hedge-fund operator. Now, Hillary was a corporate lawyer, and Chelsea is in the hedge-fund business. The younger Clinton is an employee of a brokerage firm - Neat trick saying that she's \"in the Hedge fund business.\" Dave",
        "intTime": 20090311,
        "postID": 80,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "reply": " I am uncomfortable reading about Ms. Palins daughter - And I was unconfortable reading about how \"ugly\" Chelsea Clinton was. Clicking on Rush Limbaughs site, he manages to bring up Chelsea Clinton 48 times in just the last two years. Here's one example, and it's pure slander... quote: RUSH: Well, let me tell you what the chaos is. Let me give you a great example. We had Michelle Obama, who was in Zanesville, Ohio talking to a bunch of people that live there. The income, average income is below the national average. So is the education level. And Michelle Obama is telling them, \"Don't go into corporate America,\" and she specified two things. Don't become a corporate lawyer, and don't become a hedge-fund operator. Now, Hillary was a corporate lawyer, and Chelsea is in the hedge-fund business. The younger Clinton is an employee of a brokerage firm - Neat trick saying that she's \"in the Hedge fund business.\" Dave",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:39:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "Grachus"
    },
    {
        "content": "\"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen.",
        "intTime": 20090311,
        "postID": 81,
        "quote": "",
        "reply": "\"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:19:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "The whole thing is unfortunate, but if true this is their own private matter. Bristol Palin and Levi Johnston are not public figures.",
        "intTime": 20090311,
        "postID": 82,
        "quote": "",
        "reply": "The whole thing is unfortunate, but if true this is their own private matter. Bristol Palin and Levi Johnston are not public figures.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:21:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "RPCVDR"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: \"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen. COMMENT: I guess we should dedicate an appropriate Righteous Brothers tune to the demise of their partnership, \"You've Lost That Loving Feeling.\" I wonder if it plays in Alaska in English ... or Russian.",
        "intTime": 20090311,
        "postID": 83,
        "quote": "Originally posted by crackerjacks61: \"Gov. Sarah Palin's office on Wednesday refused to comment on a report that Palin's daughter Bristol Palin had broken off her engagement with fiancé Levi Johnston.\" \"http://www.huffingtonpost.com/2009/03/11/bristol-levi-split-up-rep_n_173917.html\" I knew that marriage would never happen.",
        "reply": " COMMENT: I guess we should dedicate an appropriate Righteous Brothers tune to the demise of their partnership, \"You've Lost That Loving Feeling.\" I wonder if it plays in Alaska in English ... or Russian.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:25:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "NOVAMarine"
    },
    {
        "content": "It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" \"Common sense isn't.\"",
        "intTime": 20090311,
        "postID": 84,
        "quote": "",
        "reply": "It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" \"Common sense isn't.\"",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:28:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "Gladewalker"
    },
    {
        "content": "Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open.",
        "intTime": 20090311,
        "postID": 85,
        "quote": "",
        "reply": "Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:31:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets......",
        "intTime": 20090311,
        "postID": 86,
        "quote": "",
        "reply": "You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets......",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:34:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "LineDoggie"
    },
    {
        "content": "Way to go Bristol, your too good for that bum anyway.",
        "intTime": 20090311,
        "postID": 87,
        "quote": "",
        "reply": "Way to go Bristol, your too good for that bum anyway.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:35:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "Duster6"
    },
    {
        "content": "quote: Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" COMMENT: Well, I would certainly hope that we wouldn't be reading about either of the Obama daughters being unwed mothers.",
        "intTime": 20090311,
        "postID": 88,
        "quote": "Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\"",
        "reply": " COMMENT: Well, I would certainly hope that we wouldn't be reading about either of the Obama daughters being unwed mothers.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:42:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "NOVAMarine"
    },
    {
        "content": "Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap",
        "intTime": 20090311,
        "postID": 89,
        "quote": "",
        "reply": "Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:52:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "ACR26"
    },
    {
        "content": "quote: Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\" It isn't Sarah Palin, it is her daughter. And if it was a Clinton or Obama daughter, it still wouldn't be THEM. quote: Originally posted by crackerjacks61: Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open. And I am sure she still believes the morals and values she was preaching and still believes in abstinence. Again, it wasn't Sarah Palin but her daughter. It wasn't Sarah Palin who had a child out of wedlock was it? Did I miss something?",
        "intTime": 20090311,
        "postID": 90,
        "quote": "Originally posted by Gladewalker: It's public if it's Sarah Palin. If it were a Clinton or Obama daughter... THEN it would be \"too personal.\"",
        "reply": " It isn't Sarah Palin, it is her daughter. And if it was a Clinton or Obama daughter, it still wouldn't be THEM. quote: Originally posted by crackerjacks61: Palin made them a public issue when she got up there preaching about abstinence , morals and values. Typical politician. Talks out of one side of the mouth while doing the opposite. Guess she could invoke \"executive privilege\" but this time, the \"secret door\" got busted open. And I am sure she still believes the morals and values she was preaching and still believes in abstinence. Again, it wasn't Sarah Palin but her daughter. It wasn't Sarah Palin who had a child out of wedlock was it? Did I miss something?",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 15:58:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "klc2000us"
    },
    {
        "content": "quote: Originally posted by LineDoggie: You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets...... No, candidates' children (especially young children and teenagers) are not fair game, regardless of their parents' politics. Recall that when the story about Bristol Palin first broke, Barak Obama was very emphatic, that politicians' families are off limits and their children are especially off-limits. Barack Obama and Sarah Palin are fair game. Their spouses MAY be fair game, particularly if they intentionally insert themselves into the political process. However, their children never asked to become part of the public process, and they deserve privacy and to be left alone.",
        "intTime": 20090311,
        "postID": 91,
        "quote": "Originally posted by LineDoggie: You have to wonder what type of Creep takes pleasure in this Girls Boyfriend, and father of her child leaving her? What kind of depraved mind conjures joy from that? I guess anytime when of the Obama Kids has problems they are now fair game since the Left Wing Extremists have decided children are targets......",
        "reply": " No, candidates' children (especially young children and teenagers) are not fair game, regardless of their parents' politics. Recall that when the story about Bristol Palin first broke, Barak Obama was very emphatic, that politicians' families are off limits and their children are especially off-limits. Barack Obama and Sarah Palin are fair game. Their spouses MAY be fair game, particularly if they intentionally insert themselves into the political process. However, their children never asked to become part of the public process, and they deserve privacy and to be left alone.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:01:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "RPCVDR"
    },
    {
        "content": "This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation.",
        "intTime": 20090311,
        "postID": 92,
        "quote": "",
        "reply": "This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:02:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult.",
        "intTime": 20090311,
        "postID": 93,
        "quote": "Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap",
        "reply": " COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:07:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "NOVAMarine"
    },
    {
        "content": "Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live?",
        "intTime": 20090311,
        "postID": 94,
        "quote": "",
        "reply": "Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live?",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:13:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by NOVAMarine: quote: Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap COMMENT: Oh, so it's okay to wish that the president fail ... I wish Obama would do well but that won't make it so nova. I wanted to believe in him but it didn't take long for that hope to crash and burn as I have watched him try and take control of every aspect of this country, including us Americans. Why is it that you want the government to control us and everything we do or don't do? Go ahead... you keep telling yourself that I am living in a world of delusions and Obama will actually keep at least 1 promise he has made. Convince yourself that the trillions of dollars he is trying to use to bail every loser out, isn't being made on a copy machine. I know it makes you feel all that much more superior to think we are all a bunch of idiots. But don't be suprised when reality slaps you in the face.",
        "intTime": 20090311,
        "postID": 95,
        "quote": "Originally posted by NOVAMarine: quote: Originally posted by ACR26: Even when spoken about by their own family members children are below the belt. Don't care if it is political or hollywood crap COMMENT: Oh, so it's okay to wish that the president fail ...",
        "reply": " I wish Obama would do well but that won't make it so nova. I wanted to believe in him but it didn't take long for that hope to crash and burn as I have watched him try and take control of every aspect of this country, including us Americans. Why is it that you want the government to control us and everything we do or don't do? Go ahead... you keep telling yourself that I am living in a world of delusions and Obama will actually keep at least 1 promise he has made. Convince yourself that the trillions of dollars he is trying to use to bail every loser out, isn't being made on a copy machine. I know it makes you feel all that much more superior to think we are all a bunch of idiots. But don't be suprised when reality slaps you in the face.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:25:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "intTime": 20090311,
        "postID": 96,
        "quote": "Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live?",
        "reply": " Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:25:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke. She isn't pretending. Her daughter makes her own choices. Sarah doesn't control the masses like Obama is trying to do. Either way this story is false so try something else to bash Palin since it gives you so much joy. But next time have some actual proof.",
        "intTime": 20090311,
        "postID": 97,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "reply": " She isn't pretending. Her daughter makes her own choices. Sarah doesn't control the masses like Obama is trying to do. Either way this story is false so try something else to bash Palin since it gives you so much joy. But next time have some actual proof.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:29:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "AngelHeart"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation. Your point has absolutely nothing to do with Bristol Palin, so if this isn't about the kids, why did you drag her into it? quote: Originally posted by NOVAMarine:COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult. It never should have been publicly reported. It's no one's business. Palin and Obama chose to be in the limelight, the children did not. And the fact she's now 18 doesn't change that.",
        "intTime": 20090311,
        "postID": 98,
        "quote": "Originally posted by crackerjacks61: This isn't about the kids, it's about how Palin was placed on a pedestal of the righteous by the Rep party. Same thing you guys do to Obama everyday. The only reason Obama's children have not been attacked in the media YET is because there has not been anything to attack them on. Trust me, when something happens, I guarantee it will be a big smear to Obama just to add to what I read everyday. Typical. My point once again for those that do not understand. Palin is a typical politician. Say whatever they think people want to hear instead of acting in the best interest of this nation.",
        "reply": " Your point has absolutely nothing to do with Bristol Palin, so if this isn't about the kids, why did you drag her into it? quote: Originally posted by NOVAMarine:COMMENT: Oh, so it's okay to wish that the president fail ... but don't dare mention anything publicly reported on a politician's child. Yeah, that's logically consistent. And by the way, Ms. Palin is 18. Although she hasn't reached her \"majority,\" she's now legally also an adult. It never should have been publicly reported. It's no one's business. Palin and Obama chose to be in the limelight, the children did not. And the fact she's now 18 doesn't change that.",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:32:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "BayStateGal"
    },
    {
        "content": "hmm, sex is good but the realities of life are to much..... and the boy walks. To bad we can't teach young folks this fact when they have hormone overload. One Flag......One Heart......One Nation............EVERMORE",
        "intTime": 20090311,
        "postID": 99,
        "quote": "",
        "reply": "hmm, sex is good but the realities of life are to much..... and the boy walks. To bad we can't teach young folks this fact when they have hormone overload. One Flag......One Heart......One Nation............EVERMORE",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:38:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "m551sheridan"
    },
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke. I am uncomfortable reading about Ms. Palins daughter - And I was unconfortable reading about how \"ugly\" Chelsea Clinton was. Clicking on Rush Limbaughs site, he manages to bring up Chelsea Clinton 48 times in just the last two years. Here's one example, and it's pure slander... quote: RUSH: Well, let me tell you what the chaos is. Let me give you a great example. We had Michelle Obama, who was in Zanesville, Ohio talking to a bunch of people that live there. The income, average income is below the national average. So is the education level. And Michelle Obama is telling them, \"Don't go into corporate America,\" and she specified two things. Don't become a corporate lawyer, and don't become a hedge-fund operator. Now, Hillary was a corporate lawyer, and Chelsea is in the hedge-fund business. The younger Clinton is an employee of a brokerage firm - Neat trick saying that she's \"in the Hedge fund business.\" Dave",
        "intTime": 20090311,
        "postID": 100,
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by AngelHeart: Get over it cracker. How pathetic can you get? I can just see the glee on your face when you read those lies in that rag they try to pass off as news. You really have nothing better to do, do you? Don't you have a life of your own to live? Well Angel since her stance is that \"Everyone should be abstinent but it's not realistic\" I guess her stance is also...everyone should be married but it's not realistic uh? Don't see much if any preachings of morals and values in that statement now do we? One of the root causes in this country that Palin pretended to be all about. What a joke.",
        "reply": " I am uncomfortable reading about Ms. Palins daughter - And I was unconfortable reading about how \"ugly\" Chelsea Clinton was. Clicking on Rush Limbaughs site, he manages to bring up Chelsea Clinton 48 times in just the last two years. Here's one example, and it's pure slander... quote: RUSH: Well, let me tell you what the chaos is. Let me give you a great example. We had Michelle Obama, who was in Zanesville, Ohio talking to a bunch of people that live there. The income, average income is below the national average. So is the education level. And Michelle Obama is telling them, \"Don't go into corporate America,\" and she specified two things. Don't become a corporate lawyer, and don't become a hedge-fund operator. Now, Hillary was a corporate lawyer, and Chelsea is in the hedge-fund business. The younger Clinton is an employee of a brokerage firm - Neat trick saying that she's \"in the Hedge fund business.\" Dave",
        "threadID": "672198221_8630085712001",
        "time": "2009-03-11 16:39:00",
        "title": "Say it Ain't So Joe - Bristol Palin and Lover Split Up",
        "userID": "Grachus"
    }
]