[
    {
        "content": "\"http://www.gallup.com/poll/118399/More-Americans-Pro-Life-Than-Pro-Choice-First-Time.aspx\" quote: A new Gallup Poll, conducted May 7-10, finds 51% of Americans calling themselves \"pro-life\" on the issue of abortion and 42% \"pro-choice.\" This is the first time a majority of U.S. adults have identified themselves as pro-life since Gallup began asking this question in 1995. The new results, obtained from Gallup's annual Values and Beliefs survey, represent a significant shift from a year ago, when 50% were pro-choice and 44% pro-life. Prior to now, the highest percentage identifying as pro-life was 46%, in both August 2001 and May 2002. The May 2009 survey documents comparable changes in public views about the legality of abortion. In answer to a question providing three options for the extent to which abortion should be legal, about as many Americans now say the procedure should be illegal in all circumstances (23%) as say it should be legal under any circumstances (22%). This contrasts with the last four years, when Gallup found a strong tilt of public attitudes in favor of unrestricted abortion.", 
        "intTime": 20090516, 
        "postID": 1, 
        "quote": "A new Gallup Poll, conducted May 7-10, finds 51% of Americans calling themselves \"pro-life\" on the issue of abortion and 42% \"pro-choice.\" This is the first time a majority of U.S. adults have identified themselves as pro-life since Gallup began asking this question in 1995. The new results, obtained from Gallup's annual Values and Beliefs survey, represent a significant shift from a year ago, when 50% were pro-choice and 44% pro-life. Prior to now, the highest percentage identifying as pro-life was 46%, in both August 2001 and May 2002. The May 2009 survey documents comparable changes in public views about the legality of abortion. In answer to a question providing three options for the extent to which abortion should be legal, about as many Americans now say the procedure should be illegal in all circumstances (23%) as say it should be legal under any circumstances (22%). This contrasts with the last four years, when Gallup found a strong tilt of public attitudes in favor of unrestricted abortion.", 
        "reply": "\"http://www.gallup.com/poll/118399/More-Americans-Pro-Life-Than-Pro-Choice-First-Time.aspx\" ", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 14:39:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090516, 
        "postID": 2, 
        "quote": "More-Americans-Pro-Life-Than-Pro-Choice", 
        "reply": " Highly doubt it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 15:00:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "intTime": 20090516, 
        "postID": 3, 
        "quote": "Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it.", 
        "reply": " Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 16:02:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question? Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match.", 
        "intTime": 20090516, 
        "postID": 4, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "reply": " quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question? Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 16:48:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question? Who's anti life? All well and good for the various sides of this question to push their propaganda, with cute titles. But this is supposed to be a neutral poll. Facing such a poll, who is NOT \"Pro life?\" quote: Originally posted by stec74: Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match. According to your link the middle ground has remained the same since they started using this (loaded) poll. Dave", 
        "intTime": 20090516, 
        "postID": 5, 
        "quote": "Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question?", 
        "reply": " Who's anti life? All well and good for the various sides of this question to push their propaganda, with cute titles. But this is supposed to be a neutral poll. Facing such a poll, who is NOT \"Pro life?\" quote: Originally posted by stec74: Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match. According to your link the middle ground has remained the same since they started using this (loaded) poll. Dave", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 16:54:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Grachus"
    }, 
    {
        "content": "I will do what nobody atttempted/has the incentive to do. I am going to fish out the real, but hidden intentions of the Right wing. The intention is quite obvious, once its pointed out. First off, a big portion of the right wing's platform is pro-life. They are against abortion. Second, Right wingers cut social programs. That means that if abortion were to be banned outright, the Right Wingers, still won't pay for improved foster services, or other adoption programs, or anything to deal with children not wanted, So, we know that they are against abortion, and we know that they won't pay for anything like improved adoptions, better foster care, etc. Since banning abortion and refusing to provide for the needs of unwanted children are polar opposite of one another, the right wing will probably try to get involuntary sterilization laws passed; at one time, it used to be perfectly legal.", 
        "intTime": 20090517, 
        "postID": 6, 
        "quote": "", 
        "reply": "I will do what nobody atttempted/has the incentive to do. I am going to fish out the real, but hidden intentions of the Right wing. The intention is quite obvious, once its pointed out. First off, a big portion of the right wing's platform is pro-life. They are against abortion. Second, Right wingers cut social programs. That means that if abortion were to be banned outright, the Right Wingers, still won't pay for improved foster services, or other adoption programs, or anything to deal with children not wanted, So, we know that they are against abortion, and we know that they won't pay for anything like improved adoptions, better foster care, etc. Since banning abortion and refusing to provide for the needs of unwanted children are polar opposite of one another, the right wing will probably try to get involuntary sterilization laws passed; at one time, it used to be perfectly legal.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 04:47:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "cybercafe"
    }, 
    {
        "content": "It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "intTime": 20090517, 
        "postID": 7, 
        "quote": "", 
        "reply": "It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 04:54:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion.", 
        "intTime": 20090517, 
        "postID": 8, 
        "quote": "Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "reply": " I didn't realize that animals practiced abortion.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 06:51:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "intTime": 20090517, 
        "postID": 9, 
        "quote": "Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "reply": " That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 06:59:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\".", 
        "intTime": 20090517, 
        "postID": 10, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "reply": " I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\".", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 07:58:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion. Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception.", 
        "intTime": 20090517, 
        "postID": 11, 
        "quote": "Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion.", 
        "reply": " Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 08:01:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "stec74; quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ quote: How is that a \"loaded\" question? To some pro-choice is only a choice when it comes to killing one's unborn child. So lets look at the real questions at hand.. pro-life--carry your child to term and give birth or pro-abort--kill your unborn child in the womb", 
        "intTime": 20090517, 
        "postID": 12, 
        "quote": "With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/", 
        "reply": "stec74;  quote: How is that a \"loaded\" question? To some pro-choice is only a choice when it comes to killing one's unborn child. So lets look at the real questions at hand.. pro-life--carry your child to term and give birth or pro-abort--kill your unborn child in the womb", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:31:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "3678131"
    }, 
    {
        "content": "More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090517, 
        "postID": 13, 
        "quote": "", 
        "reply": "More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:37:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: The word \"convent\" comes to mind!! LOL Or chastity belt..........", 
        "intTime": 20090517, 
        "postID": 14, 
        "quote": "Originally posted by klassylady25: The word \"convent\" comes to mind!! LOL", 
        "reply": " Or chastity belt..........", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:39:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "klc2000us"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. So, the man, i.e. the father of the child, has no say in the loss of life of his child also?... Just because the woman is blessed with the ability to carry the child to term, doesn't mean that the father of the child has any less of a bond with that child... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 15, 
        "quote": "Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "reply": " So, the man, i.e. the father of the child, has no say in the loss of life of his child also?... Just because the woman is blessed with the ability to carry the child to term, doesn't mean that the father of the child has any less of a bond with that child... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:43:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. Absolutely!... Where you and I may differ is, that I believe that a safe, medical abortion should be available when the life of the mother is in danger... Abortions just because you can't be bothered with a child or that you don't wish to \"ruin your figure\", is just simply wrong... Abortion is abortion and birth control is birth control, two completely different things... Sex education, should be provided by the parents but, who teaches the parents?... If it is to be taught in school, it should be done with the permission of the parents but, as I posted, \"who teaches the parents\"?... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 16, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "reply": " Absolutely!... Where you and I may differ is, that I believe that a safe, medical abortion should be available when the life of the mother is in danger... Abortions just because you can't be bothered with a child or that you don't wish to \"ruin your figure\", is just simply wrong... Abortion is abortion and birth control is birth control, two completely different things... Sex education, should be provided by the parents but, who teaches the parents?... If it is to be taught in school, it should be done with the permission of the parents but, as I posted, \"who teaches the parents\"?... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:47:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\". Those are all of the \"old saws\" of the \"pro abortion\" crowd... Till the subject can be addressed with out the \"hysteria\" of both sides, no solution can be found to unit us on the subject and more importantly, those children who are just as alive as you or I, are being executed daily and yet, they have committed no crime that would subject them to the death penalty... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 17, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\".", 
        "reply": " Those are all of the \"old saws\" of the \"pro abortion\" crowd... Till the subject can be addressed with out the \"hysteria\" of both sides, no solution can be found to unit us on the subject and more importantly, those children who are just as alive as you or I, are being executed daily and yet, they have committed no crime that would subject them to the death penalty... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:52:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion. Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception. Aren't we fortunate in that... It would be interesting to find out, if our ancestors functioned the same biologically, when we lived in caves and wore animal skins and hunted with sticks, rocks and clubs for food... One wonders... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 18, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion. Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception.", 
        "reply": " Aren't we fortunate in that... It would be interesting to find out, if our ancestors functioned the same biologically, when we lived in caves and wore animal skins and hunted with sticks, rocks and clubs for food... One wonders... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:55:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties. Is there not one thing, that doesn't bespeak of politics, i.e. republican versus democrat with you?... Sometimes, there are subjects that are \"apolitical\"... I am not \"knocking you\", though it may sound like it, I'm just trying to come to an understanding of how your opinion is formed... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 19, 
        "quote": "Originally posted by jack_flats: More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties.", 
        "reply": " Is there not one thing, that doesn't bespeak of politics, i.e. republican versus democrat with you?... Sometimes, there are subjects that are \"apolitical\"... I am not \"knocking you\", though it may sound like it, I'm just trying to come to an understanding of how your opinion is formed... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:58:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "\"http://www.gallup.com/poll/118399/More-Americans-Pro-Life-Than-Pro-Choice-First-Time.aspx\" quote: A new Gallup Poll, conducted May 7-10, finds 51% of Americans calling themselves \"pro-life\" on the issue of abortion and 42% \"pro-choice.\" This is the first time a majority of U.S. adults have identified themselves as pro-life since Gallup began asking this question in 1995. The new results, obtained from Gallup's annual Values and Beliefs survey, represent a significant shift from a year ago, when 50% were pro-choice and 44% pro-life. Prior to now, the highest percentage identifying as pro-life was 46%, in both August 2001 and May 2002. The May 2009 survey documents comparable changes in public views about the legality of abortion. In answer to a question providing three options for the extent to which abortion should be legal, about as many Americans now say the procedure should be illegal in all circumstances (23%) as say it should be legal under any circumstances (22%). This contrasts with the last four years, when Gallup found a strong tilt of public attitudes in favor of unrestricted abortion.", 
        "intTime": 20090516, 
        "postID": 20, 
        "quote": "A new Gallup Poll, conducted May 7-10, finds 51% of Americans calling themselves \"pro-life\" on the issue of abortion and 42% \"pro-choice.\" This is the first time a majority of U.S. adults have identified themselves as pro-life since Gallup began asking this question in 1995. The new results, obtained from Gallup's annual Values and Beliefs survey, represent a significant shift from a year ago, when 50% were pro-choice and 44% pro-life. Prior to now, the highest percentage identifying as pro-life was 46%, in both August 2001 and May 2002. The May 2009 survey documents comparable changes in public views about the legality of abortion. In answer to a question providing three options for the extent to which abortion should be legal, about as many Americans now say the procedure should be illegal in all circumstances (23%) as say it should be legal under any circumstances (22%). This contrasts with the last four years, when Gallup found a strong tilt of public attitudes in favor of unrestricted abortion.", 
        "reply": "\"http://www.gallup.com/poll/118399/More-Americans-Pro-Life-Than-Pro-Choice-First-Time.aspx\" ", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 14:39:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090516, 
        "postID": 21, 
        "quote": "More-Americans-Pro-Life-Than-Pro-Choice", 
        "reply": " Highly doubt it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 15:00:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "intTime": 20090516, 
        "postID": 22, 
        "quote": "Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it.", 
        "reply": " Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 16:02:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question? Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match.", 
        "intTime": 20090516, 
        "postID": 23, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "reply": " quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question? Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 16:48:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question? Who's anti life? All well and good for the various sides of this question to push their propaganda, with cute titles. But this is supposed to be a neutral poll. Facing such a poll, who is NOT \"Pro life?\" quote: Originally posted by stec74: Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match. According to your link the middle ground has remained the same since they started using this (loaded) poll. Dave", 
        "intTime": 20090516, 
        "postID": 24, 
        "quote": "Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question?", 
        "reply": " Who's anti life? All well and good for the various sides of this question to push their propaganda, with cute titles. But this is supposed to be a neutral poll. Facing such a poll, who is NOT \"Pro life?\" quote: Originally posted by stec74: Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match. According to your link the middle ground has remained the same since they started using this (loaded) poll. Dave", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 16:54:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Grachus"
    }, 
    {
        "content": "I will do what nobody atttempted/has the incentive to do. I am going to fish out the real, but hidden intentions of the Right wing. The intention is quite obvious, once its pointed out. First off, a big portion of the right wing's platform is pro-life. They are against abortion. Second, Right wingers cut social programs. That means that if abortion were to be banned outright, the Right Wingers, still won't pay for improved foster services, or other adoption programs, or anything to deal with children not wanted, So, we know that they are against abortion, and we know that they won't pay for anything like improved adoptions, better foster care, etc. Since banning abortion and refusing to provide for the needs of unwanted children are polar opposite of one another, the right wing will probably try to get involuntary sterilization laws passed; at one time, it used to be perfectly legal.", 
        "intTime": 20090517, 
        "postID": 25, 
        "quote": "", 
        "reply": "I will do what nobody atttempted/has the incentive to do. I am going to fish out the real, but hidden intentions of the Right wing. The intention is quite obvious, once its pointed out. First off, a big portion of the right wing's platform is pro-life. They are against abortion. Second, Right wingers cut social programs. That means that if abortion were to be banned outright, the Right Wingers, still won't pay for improved foster services, or other adoption programs, or anything to deal with children not wanted, So, we know that they are against abortion, and we know that they won't pay for anything like improved adoptions, better foster care, etc. Since banning abortion and refusing to provide for the needs of unwanted children are polar opposite of one another, the right wing will probably try to get involuntary sterilization laws passed; at one time, it used to be perfectly legal.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 04:47:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "cybercafe"
    }, 
    {
        "content": "It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "intTime": 20090517, 
        "postID": 26, 
        "quote": "", 
        "reply": "It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 04:54:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion.", 
        "intTime": 20090517, 
        "postID": 27, 
        "quote": "Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "reply": " I didn't realize that animals practiced abortion.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 06:51:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "intTime": 20090517, 
        "postID": 28, 
        "quote": "Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "reply": " That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 06:59:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\".", 
        "intTime": 20090517, 
        "postID": 29, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "reply": " I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\".", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 07:58:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion. Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception.", 
        "intTime": 20090517, 
        "postID": 30, 
        "quote": "Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion.", 
        "reply": " Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 08:01:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "stec74; quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ quote: How is that a \"loaded\" question? To some pro-choice is only a choice when it comes to killing one's unborn child. So lets look at the real questions at hand.. pro-life--carry your child to term and give birth or pro-abort--kill your unborn child in the womb", 
        "intTime": 20090517, 
        "postID": 31, 
        "quote": "With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/", 
        "reply": "stec74;  quote: How is that a \"loaded\" question? To some pro-choice is only a choice when it comes to killing one's unborn child. So lets look at the real questions at hand.. pro-life--carry your child to term and give birth or pro-abort--kill your unborn child in the womb", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:31:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "3678131"
    }, 
    {
        "content": "More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090517, 
        "postID": 32, 
        "quote": "", 
        "reply": "More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:37:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: The word \"convent\" comes to mind!! LOL Or chastity belt..........", 
        "intTime": 20090517, 
        "postID": 33, 
        "quote": "Originally posted by klassylady25: The word \"convent\" comes to mind!! LOL", 
        "reply": " Or chastity belt..........", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:39:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "klc2000us"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. So, the man, i.e. the father of the child, has no say in the loss of life of his child also?... Just because the woman is blessed with the ability to carry the child to term, doesn't mean that the father of the child has any less of a bond with that child... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 34, 
        "quote": "Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "reply": " So, the man, i.e. the father of the child, has no say in the loss of life of his child also?... Just because the woman is blessed with the ability to carry the child to term, doesn't mean that the father of the child has any less of a bond with that child... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:43:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. Absolutely!... Where you and I may differ is, that I believe that a safe, medical abortion should be available when the life of the mother is in danger... Abortions just because you can't be bothered with a child or that you don't wish to \"ruin your figure\", is just simply wrong... Abortion is abortion and birth control is birth control, two completely different things... Sex education, should be provided by the parents but, who teaches the parents?... If it is to be taught in school, it should be done with the permission of the parents but, as I posted, \"who teaches the parents\"?... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 35, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "reply": " Absolutely!... Where you and I may differ is, that I believe that a safe, medical abortion should be available when the life of the mother is in danger... Abortions just because you can't be bothered with a child or that you don't wish to \"ruin your figure\", is just simply wrong... Abortion is abortion and birth control is birth control, two completely different things... Sex education, should be provided by the parents but, who teaches the parents?... If it is to be taught in school, it should be done with the permission of the parents but, as I posted, \"who teaches the parents\"?... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:47:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\". Those are all of the \"old saws\" of the \"pro abortion\" crowd... Till the subject can be addressed with out the \"hysteria\" of both sides, no solution can be found to unit us on the subject and more importantly, those children who are just as alive as you or I, are being executed daily and yet, they have committed no crime that would subject them to the death penalty... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 36, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\".", 
        "reply": " Those are all of the \"old saws\" of the \"pro abortion\" crowd... Till the subject can be addressed with out the \"hysteria\" of both sides, no solution can be found to unit us on the subject and more importantly, those children who are just as alive as you or I, are being executed daily and yet, they have committed no crime that would subject them to the death penalty... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:52:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion. Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception. Aren't we fortunate in that... It would be interesting to find out, if our ancestors functioned the same biologically, when we lived in caves and wore animal skins and hunted with sticks, rocks and clubs for food... One wonders... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 37, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion. Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception.", 
        "reply": " Aren't we fortunate in that... It would be interesting to find out, if our ancestors functioned the same biologically, when we lived in caves and wore animal skins and hunted with sticks, rocks and clubs for food... One wonders... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:55:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties. Is there not one thing, that doesn't bespeak of politics, i.e. republican versus democrat with you?... Sometimes, there are subjects that are \"apolitical\"... I am not \"knocking you\", though it may sound like it, I'm just trying to come to an understanding of how your opinion is formed... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 38, 
        "quote": "Originally posted by jack_flats: More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties.", 
        "reply": " Is there not one thing, that doesn't bespeak of politics, i.e. republican versus democrat with you?... Sometimes, there are subjects that are \"apolitical\"... I am not \"knocking you\", though it may sound like it, I'm just trying to come to an understanding of how your opinion is formed... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:58:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "\"http://www.gallup.com/poll/118399/More-Americans-Pro-Life-Than-Pro-Choice-First-Time.aspx\" quote: A new Gallup Poll, conducted May 7-10, finds 51% of Americans calling themselves \"pro-life\" on the issue of abortion and 42% \"pro-choice.\" This is the first time a majority of U.S. adults have identified themselves as pro-life since Gallup began asking this question in 1995. The new results, obtained from Gallup's annual Values and Beliefs survey, represent a significant shift from a year ago, when 50% were pro-choice and 44% pro-life. Prior to now, the highest percentage identifying as pro-life was 46%, in both August 2001 and May 2002. The May 2009 survey documents comparable changes in public views about the legality of abortion. In answer to a question providing three options for the extent to which abortion should be legal, about as many Americans now say the procedure should be illegal in all circumstances (23%) as say it should be legal under any circumstances (22%). This contrasts with the last four years, when Gallup found a strong tilt of public attitudes in favor of unrestricted abortion.", 
        "intTime": 20090516, 
        "postID": 39, 
        "quote": "A new Gallup Poll, conducted May 7-10, finds 51% of Americans calling themselves \"pro-life\" on the issue of abortion and 42% \"pro-choice.\" This is the first time a majority of U.S. adults have identified themselves as pro-life since Gallup began asking this question in 1995. The new results, obtained from Gallup's annual Values and Beliefs survey, represent a significant shift from a year ago, when 50% were pro-choice and 44% pro-life. Prior to now, the highest percentage identifying as pro-life was 46%, in both August 2001 and May 2002. The May 2009 survey documents comparable changes in public views about the legality of abortion. In answer to a question providing three options for the extent to which abortion should be legal, about as many Americans now say the procedure should be illegal in all circumstances (23%) as say it should be legal under any circumstances (22%). This contrasts with the last four years, when Gallup found a strong tilt of public attitudes in favor of unrestricted abortion.", 
        "reply": "\"http://www.gallup.com/poll/118399/More-Americans-Pro-Life-Than-Pro-Choice-First-Time.aspx\" ", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 14:39:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090516, 
        "postID": 40, 
        "quote": "More-Americans-Pro-Life-Than-Pro-Choice", 
        "reply": " Highly doubt it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 15:00:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "intTime": 20090516, 
        "postID": 41, 
        "quote": "Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it.", 
        "reply": " Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 16:02:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question? Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match.", 
        "intTime": 20090516, 
        "postID": 42, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "reply": " quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question? Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 16:48:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question? Who's anti life? All well and good for the various sides of this question to push their propaganda, with cute titles. But this is supposed to be a neutral poll. Facing such a poll, who is NOT \"Pro life?\" quote: Originally posted by stec74: Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match. According to your link the middle ground has remained the same since they started using this (loaded) poll. Dave", 
        "intTime": 20090516, 
        "postID": 43, 
        "quote": "Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question?", 
        "reply": " Who's anti life? All well and good for the various sides of this question to push their propaganda, with cute titles. But this is supposed to be a neutral poll. Facing such a poll, who is NOT \"Pro life?\" quote: Originally posted by stec74: Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match. According to your link the middle ground has remained the same since they started using this (loaded) poll. Dave", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 16:54:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Grachus"
    }, 
    {
        "content": "I will do what nobody atttempted/has the incentive to do. I am going to fish out the real, but hidden intentions of the Right wing. The intention is quite obvious, once its pointed out. First off, a big portion of the right wing's platform is pro-life. They are against abortion. Second, Right wingers cut social programs. That means that if abortion were to be banned outright, the Right Wingers, still won't pay for improved foster services, or other adoption programs, or anything to deal with children not wanted, So, we know that they are against abortion, and we know that they won't pay for anything like improved adoptions, better foster care, etc. Since banning abortion and refusing to provide for the needs of unwanted children are polar opposite of one another, the right wing will probably try to get involuntary sterilization laws passed; at one time, it used to be perfectly legal.", 
        "intTime": 20090517, 
        "postID": 44, 
        "quote": "", 
        "reply": "I will do what nobody atttempted/has the incentive to do. I am going to fish out the real, but hidden intentions of the Right wing. The intention is quite obvious, once its pointed out. First off, a big portion of the right wing's platform is pro-life. They are against abortion. Second, Right wingers cut social programs. That means that if abortion were to be banned outright, the Right Wingers, still won't pay for improved foster services, or other adoption programs, or anything to deal with children not wanted, So, we know that they are against abortion, and we know that they won't pay for anything like improved adoptions, better foster care, etc. Since banning abortion and refusing to provide for the needs of unwanted children are polar opposite of one another, the right wing will probably try to get involuntary sterilization laws passed; at one time, it used to be perfectly legal.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 04:47:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "cybercafe"
    }, 
    {
        "content": "It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "intTime": 20090517, 
        "postID": 45, 
        "quote": "", 
        "reply": "It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 04:54:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion.", 
        "intTime": 20090517, 
        "postID": 46, 
        "quote": "Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "reply": " I didn't realize that animals practiced abortion.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 06:51:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "intTime": 20090517, 
        "postID": 47, 
        "quote": "Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "reply": " That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 06:59:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\".", 
        "intTime": 20090517, 
        "postID": 48, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "reply": " I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\".", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 07:58:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion. Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception.", 
        "intTime": 20090517, 
        "postID": 49, 
        "quote": "Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion.", 
        "reply": " Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 08:01:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "stec74; quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ quote: How is that a \"loaded\" question? To some pro-choice is only a choice when it comes to killing one's unborn child. So lets look at the real questions at hand.. pro-life--carry your child to term and give birth or pro-abort--kill your unborn child in the womb", 
        "intTime": 20090517, 
        "postID": 50, 
        "quote": "With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/", 
        "reply": "stec74;  quote: How is that a \"loaded\" question? To some pro-choice is only a choice when it comes to killing one's unborn child. So lets look at the real questions at hand.. pro-life--carry your child to term and give birth or pro-abort--kill your unborn child in the womb", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:31:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "3678131"
    }, 
    {
        "content": "More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090517, 
        "postID": 51, 
        "quote": "", 
        "reply": "More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:37:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: The word \"convent\" comes to mind!! LOL Or chastity belt..........", 
        "intTime": 20090517, 
        "postID": 52, 
        "quote": "Originally posted by klassylady25: The word \"convent\" comes to mind!! LOL", 
        "reply": " Or chastity belt..........", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:39:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "klc2000us"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. So, the man, i.e. the father of the child, has no say in the loss of life of his child also?... Just because the woman is blessed with the ability to carry the child to term, doesn't mean that the father of the child has any less of a bond with that child... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 53, 
        "quote": "Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "reply": " So, the man, i.e. the father of the child, has no say in the loss of life of his child also?... Just because the woman is blessed with the ability to carry the child to term, doesn't mean that the father of the child has any less of a bond with that child... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:43:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. Absolutely!... Where you and I may differ is, that I believe that a safe, medical abortion should be available when the life of the mother is in danger... Abortions just because you can't be bothered with a child or that you don't wish to \"ruin your figure\", is just simply wrong... Abortion is abortion and birth control is birth control, two completely different things... Sex education, should be provided by the parents but, who teaches the parents?... If it is to be taught in school, it should be done with the permission of the parents but, as I posted, \"who teaches the parents\"?... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 54, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "reply": " Absolutely!... Where you and I may differ is, that I believe that a safe, medical abortion should be available when the life of the mother is in danger... Abortions just because you can't be bothered with a child or that you don't wish to \"ruin your figure\", is just simply wrong... Abortion is abortion and birth control is birth control, two completely different things... Sex education, should be provided by the parents but, who teaches the parents?... If it is to be taught in school, it should be done with the permission of the parents but, as I posted, \"who teaches the parents\"?... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:47:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\". Those are all of the \"old saws\" of the \"pro abortion\" crowd... Till the subject can be addressed with out the \"hysteria\" of both sides, no solution can be found to unit us on the subject and more importantly, those children who are just as alive as you or I, are being executed daily and yet, they have committed no crime that would subject them to the death penalty... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 55, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\".", 
        "reply": " Those are all of the \"old saws\" of the \"pro abortion\" crowd... Till the subject can be addressed with out the \"hysteria\" of both sides, no solution can be found to unit us on the subject and more importantly, those children who are just as alive as you or I, are being executed daily and yet, they have committed no crime that would subject them to the death penalty... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:52:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion. Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception. Aren't we fortunate in that... It would be interesting to find out, if our ancestors functioned the same biologically, when we lived in caves and wore animal skins and hunted with sticks, rocks and clubs for food... One wonders... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 56, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion. Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception.", 
        "reply": " Aren't we fortunate in that... It would be interesting to find out, if our ancestors functioned the same biologically, when we lived in caves and wore animal skins and hunted with sticks, rocks and clubs for food... One wonders... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:55:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties. Is there not one thing, that doesn't bespeak of politics, i.e. republican versus democrat with you?... Sometimes, there are subjects that are \"apolitical\"... I am not \"knocking you\", though it may sound like it, I'm just trying to come to an understanding of how your opinion is formed... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 57, 
        "quote": "Originally posted by jack_flats: More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties.", 
        "reply": " Is there not one thing, that doesn't bespeak of politics, i.e. republican versus democrat with you?... Sometimes, there are subjects that are \"apolitical\"... I am not \"knocking you\", though it may sound like it, I'm just trying to come to an understanding of how your opinion is formed... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:58:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "\"http://www.gallup.com/poll/118399/More-Americans-Pro-Life-Than-Pro-Choice-First-Time.aspx\" quote: A new Gallup Poll, conducted May 7-10, finds 51% of Americans calling themselves \"pro-life\" on the issue of abortion and 42% \"pro-choice.\" This is the first time a majority of U.S. adults have identified themselves as pro-life since Gallup began asking this question in 1995. The new results, obtained from Gallup's annual Values and Beliefs survey, represent a significant shift from a year ago, when 50% were pro-choice and 44% pro-life. Prior to now, the highest percentage identifying as pro-life was 46%, in both August 2001 and May 2002. The May 2009 survey documents comparable changes in public views about the legality of abortion. In answer to a question providing three options for the extent to which abortion should be legal, about as many Americans now say the procedure should be illegal in all circumstances (23%) as say it should be legal under any circumstances (22%). This contrasts with the last four years, when Gallup found a strong tilt of public attitudes in favor of unrestricted abortion.", 
        "intTime": 20090516, 
        "postID": 58, 
        "quote": "A new Gallup Poll, conducted May 7-10, finds 51% of Americans calling themselves \"pro-life\" on the issue of abortion and 42% \"pro-choice.\" This is the first time a majority of U.S. adults have identified themselves as pro-life since Gallup began asking this question in 1995. The new results, obtained from Gallup's annual Values and Beliefs survey, represent a significant shift from a year ago, when 50% were pro-choice and 44% pro-life. Prior to now, the highest percentage identifying as pro-life was 46%, in both August 2001 and May 2002. The May 2009 survey documents comparable changes in public views about the legality of abortion. In answer to a question providing three options for the extent to which abortion should be legal, about as many Americans now say the procedure should be illegal in all circumstances (23%) as say it should be legal under any circumstances (22%). This contrasts with the last four years, when Gallup found a strong tilt of public attitudes in favor of unrestricted abortion.", 
        "reply": "\"http://www.gallup.com/poll/118399/More-Americans-Pro-Life-Than-Pro-Choice-First-Time.aspx\" ", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 14:39:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090516, 
        "postID": 59, 
        "quote": "More-Americans-Pro-Life-Than-Pro-Choice", 
        "reply": " Highly doubt it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 15:00:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "intTime": 20090516, 
        "postID": 60, 
        "quote": "Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it.", 
        "reply": " Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 16:02:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question? Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match.", 
        "intTime": 20090516, 
        "postID": 61, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "reply": " quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question? Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 16:48:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question? Who's anti life? All well and good for the various sides of this question to push their propaganda, with cute titles. But this is supposed to be a neutral poll. Facing such a poll, who is NOT \"Pro life?\" quote: Originally posted by stec74: Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match. According to your link the middle ground has remained the same since they started using this (loaded) poll. Dave", 
        "intTime": 20090516, 
        "postID": 62, 
        "quote": "Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question?", 
        "reply": " Who's anti life? All well and good for the various sides of this question to push their propaganda, with cute titles. But this is supposed to be a neutral poll. Facing such a poll, who is NOT \"Pro life?\" quote: Originally posted by stec74: Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match. According to your link the middle ground has remained the same since they started using this (loaded) poll. Dave", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 16:54:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Grachus"
    }, 
    {
        "content": "I will do what nobody atttempted/has the incentive to do. I am going to fish out the real, but hidden intentions of the Right wing. The intention is quite obvious, once its pointed out. First off, a big portion of the right wing's platform is pro-life. They are against abortion. Second, Right wingers cut social programs. That means that if abortion were to be banned outright, the Right Wingers, still won't pay for improved foster services, or other adoption programs, or anything to deal with children not wanted, So, we know that they are against abortion, and we know that they won't pay for anything like improved adoptions, better foster care, etc. Since banning abortion and refusing to provide for the needs of unwanted children are polar opposite of one another, the right wing will probably try to get involuntary sterilization laws passed; at one time, it used to be perfectly legal.", 
        "intTime": 20090517, 
        "postID": 63, 
        "quote": "", 
        "reply": "I will do what nobody atttempted/has the incentive to do. I am going to fish out the real, but hidden intentions of the Right wing. The intention is quite obvious, once its pointed out. First off, a big portion of the right wing's platform is pro-life. They are against abortion. Second, Right wingers cut social programs. That means that if abortion were to be banned outright, the Right Wingers, still won't pay for improved foster services, or other adoption programs, or anything to deal with children not wanted, So, we know that they are against abortion, and we know that they won't pay for anything like improved adoptions, better foster care, etc. Since banning abortion and refusing to provide for the needs of unwanted children are polar opposite of one another, the right wing will probably try to get involuntary sterilization laws passed; at one time, it used to be perfectly legal.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 04:47:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "cybercafe"
    }, 
    {
        "content": "It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "intTime": 20090517, 
        "postID": 64, 
        "quote": "", 
        "reply": "It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 04:54:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion.", 
        "intTime": 20090517, 
        "postID": 65, 
        "quote": "Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "reply": " I didn't realize that animals practiced abortion.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 06:51:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "intTime": 20090517, 
        "postID": 66, 
        "quote": "Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "reply": " That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 06:59:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\".", 
        "intTime": 20090517, 
        "postID": 67, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "reply": " I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\".", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 07:58:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion. Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception.", 
        "intTime": 20090517, 
        "postID": 68, 
        "quote": "Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion.", 
        "reply": " Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 08:01:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "stec74; quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ quote: How is that a \"loaded\" question? To some pro-choice is only a choice when it comes to killing one's unborn child. So lets look at the real questions at hand.. pro-life--carry your child to term and give birth or pro-abort--kill your unborn child in the womb", 
        "intTime": 20090517, 
        "postID": 69, 
        "quote": "With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/", 
        "reply": "stec74;  quote: How is that a \"loaded\" question? To some pro-choice is only a choice when it comes to killing one's unborn child. So lets look at the real questions at hand.. pro-life--carry your child to term and give birth or pro-abort--kill your unborn child in the womb", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:31:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "3678131"
    }, 
    {
        "content": "More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090517, 
        "postID": 70, 
        "quote": "", 
        "reply": "More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:37:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: The word \"convent\" comes to mind!! LOL Or chastity belt..........", 
        "intTime": 20090517, 
        "postID": 71, 
        "quote": "Originally posted by klassylady25: The word \"convent\" comes to mind!! LOL", 
        "reply": " Or chastity belt..........", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:39:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "klc2000us"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. So, the man, i.e. the father of the child, has no say in the loss of life of his child also?... Just because the woman is blessed with the ability to carry the child to term, doesn't mean that the father of the child has any less of a bond with that child... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 72, 
        "quote": "Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "reply": " So, the man, i.e. the father of the child, has no say in the loss of life of his child also?... Just because the woman is blessed with the ability to carry the child to term, doesn't mean that the father of the child has any less of a bond with that child... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:43:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. Absolutely!... Where you and I may differ is, that I believe that a safe, medical abortion should be available when the life of the mother is in danger... Abortions just because you can't be bothered with a child or that you don't wish to \"ruin your figure\", is just simply wrong... Abortion is abortion and birth control is birth control, two completely different things... Sex education, should be provided by the parents but, who teaches the parents?... If it is to be taught in school, it should be done with the permission of the parents but, as I posted, \"who teaches the parents\"?... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 73, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "reply": " Absolutely!... Where you and I may differ is, that I believe that a safe, medical abortion should be available when the life of the mother is in danger... Abortions just because you can't be bothered with a child or that you don't wish to \"ruin your figure\", is just simply wrong... Abortion is abortion and birth control is birth control, two completely different things... Sex education, should be provided by the parents but, who teaches the parents?... If it is to be taught in school, it should be done with the permission of the parents but, as I posted, \"who teaches the parents\"?... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:47:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\". Those are all of the \"old saws\" of the \"pro abortion\" crowd... Till the subject can be addressed with out the \"hysteria\" of both sides, no solution can be found to unit us on the subject and more importantly, those children who are just as alive as you or I, are being executed daily and yet, they have committed no crime that would subject them to the death penalty... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 74, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\".", 
        "reply": " Those are all of the \"old saws\" of the \"pro abortion\" crowd... Till the subject can be addressed with out the \"hysteria\" of both sides, no solution can be found to unit us on the subject and more importantly, those children who are just as alive as you or I, are being executed daily and yet, they have committed no crime that would subject them to the death penalty... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:52:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion. Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception. Aren't we fortunate in that... It would be interesting to find out, if our ancestors functioned the same biologically, when we lived in caves and wore animal skins and hunted with sticks, rocks and clubs for food... One wonders... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 75, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion. Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception.", 
        "reply": " Aren't we fortunate in that... It would be interesting to find out, if our ancestors functioned the same biologically, when we lived in caves and wore animal skins and hunted with sticks, rocks and clubs for food... One wonders... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:55:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties. Is there not one thing, that doesn't bespeak of politics, i.e. republican versus democrat with you?... Sometimes, there are subjects that are \"apolitical\"... I am not \"knocking you\", though it may sound like it, I'm just trying to come to an understanding of how your opinion is formed... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 76, 
        "quote": "Originally posted by jack_flats: More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties.", 
        "reply": " Is there not one thing, that doesn't bespeak of politics, i.e. republican versus democrat with you?... Sometimes, there are subjects that are \"apolitical\"... I am not \"knocking you\", though it may sound like it, I'm just trying to come to an understanding of how your opinion is formed... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:58:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "\"http://www.gallup.com/poll/118399/More-Americans-Pro-Life-Than-Pro-Choice-First-Time.aspx\" quote: A new Gallup Poll, conducted May 7-10, finds 51% of Americans calling themselves \"pro-life\" on the issue of abortion and 42% \"pro-choice.\" This is the first time a majority of U.S. adults have identified themselves as pro-life since Gallup began asking this question in 1995. The new results, obtained from Gallup's annual Values and Beliefs survey, represent a significant shift from a year ago, when 50% were pro-choice and 44% pro-life. Prior to now, the highest percentage identifying as pro-life was 46%, in both August 2001 and May 2002. The May 2009 survey documents comparable changes in public views about the legality of abortion. In answer to a question providing three options for the extent to which abortion should be legal, about as many Americans now say the procedure should be illegal in all circumstances (23%) as say it should be legal under any circumstances (22%). This contrasts with the last four years, when Gallup found a strong tilt of public attitudes in favor of unrestricted abortion.", 
        "intTime": 20090516, 
        "postID": 77, 
        "quote": "A new Gallup Poll, conducted May 7-10, finds 51% of Americans calling themselves \"pro-life\" on the issue of abortion and 42% \"pro-choice.\" This is the first time a majority of U.S. adults have identified themselves as pro-life since Gallup began asking this question in 1995. The new results, obtained from Gallup's annual Values and Beliefs survey, represent a significant shift from a year ago, when 50% were pro-choice and 44% pro-life. Prior to now, the highest percentage identifying as pro-life was 46%, in both August 2001 and May 2002. The May 2009 survey documents comparable changes in public views about the legality of abortion. In answer to a question providing three options for the extent to which abortion should be legal, about as many Americans now say the procedure should be illegal in all circumstances (23%) as say it should be legal under any circumstances (22%). This contrasts with the last four years, when Gallup found a strong tilt of public attitudes in favor of unrestricted abortion.", 
        "reply": "\"http://www.gallup.com/poll/118399/More-Americans-Pro-Life-Than-Pro-Choice-First-Time.aspx\" ", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 14:39:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090516, 
        "postID": 78, 
        "quote": "More-Americans-Pro-Life-Than-Pro-Choice", 
        "reply": " Highly doubt it. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 15:00:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "intTime": 20090516, 
        "postID": 79, 
        "quote": "Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it.", 
        "reply": " Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 16:02:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question? Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match.", 
        "intTime": 20090516, 
        "postID": 80, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "reply": " quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question? Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 16:48:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question? Who's anti life? All well and good for the various sides of this question to push their propaganda, with cute titles. But this is supposed to be a neutral poll. Facing such a poll, who is NOT \"Pro life?\" quote: Originally posted by stec74: Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match. According to your link the middle ground has remained the same since they started using this (loaded) poll. Dave", 
        "intTime": 20090516, 
        "postID": 81, 
        "quote": "Originally posted by stec74: quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: More-Americans-Pro-Life-Than-Pro-Choice Highly doubt it. Take a look at the link. I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ How is that a \"loaded\" question?", 
        "reply": " Who's anti life? All well and good for the various sides of this question to push their propaganda, with cute titles. But this is supposed to be a neutral poll. Facing such a poll, who is NOT \"Pro life?\" quote: Originally posted by stec74: Additionally, the question was asked if abortion should be \"legal in all cases\". That dropped 6% from 28% last year to 22% in this survey. So the trends match. According to your link the middle ground has remained the same since they started using this (loaded) poll. Dave", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-16 16:54:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Grachus"
    }, 
    {
        "content": "I will do what nobody atttempted/has the incentive to do. I am going to fish out the real, but hidden intentions of the Right wing. The intention is quite obvious, once its pointed out. First off, a big portion of the right wing's platform is pro-life. They are against abortion. Second, Right wingers cut social programs. That means that if abortion were to be banned outright, the Right Wingers, still won't pay for improved foster services, or other adoption programs, or anything to deal with children not wanted, So, we know that they are against abortion, and we know that they won't pay for anything like improved adoptions, better foster care, etc. Since banning abortion and refusing to provide for the needs of unwanted children are polar opposite of one another, the right wing will probably try to get involuntary sterilization laws passed; at one time, it used to be perfectly legal.", 
        "intTime": 20090517, 
        "postID": 82, 
        "quote": "", 
        "reply": "I will do what nobody atttempted/has the incentive to do. I am going to fish out the real, but hidden intentions of the Right wing. The intention is quite obvious, once its pointed out. First off, a big portion of the right wing's platform is pro-life. They are against abortion. Second, Right wingers cut social programs. That means that if abortion were to be banned outright, the Right Wingers, still won't pay for improved foster services, or other adoption programs, or anything to deal with children not wanted, So, we know that they are against abortion, and we know that they won't pay for anything like improved adoptions, better foster care, etc. Since banning abortion and refusing to provide for the needs of unwanted children are polar opposite of one another, the right wing will probably try to get involuntary sterilization laws passed; at one time, it used to be perfectly legal.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 04:47:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "cybercafe"
    }, 
    {
        "content": "It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "intTime": 20090517, 
        "postID": 83, 
        "quote": "", 
        "reply": "It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 04:54:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion.", 
        "intTime": 20090517, 
        "postID": 84, 
        "quote": "Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "reply": " I didn't realize that animals practiced abortion.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 06:51:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "intTime": 20090517, 
        "postID": 85, 
        "quote": "Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave", 
        "reply": " That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 06:59:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\".", 
        "intTime": 20090517, 
        "postID": 86, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "reply": " I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\".", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 07:58:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion. Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception.", 
        "intTime": 20090517, 
        "postID": 87, 
        "quote": "Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion.", 
        "reply": " Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception.", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 08:01:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "stec74; quote: With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/ quote: How is that a \"loaded\" question? To some pro-choice is only a choice when it comes to killing one's unborn child. So lets look at the real questions at hand.. pro-life--carry your child to term and give birth or pro-abort--kill your unborn child in the womb", 
        "intTime": 20090517, 
        "postID": 88, 
        "quote": "With respect to the abortion issue, would you consider yourself to be pro-choice or pro-life/", 
        "reply": "stec74;  quote: How is that a \"loaded\" question? To some pro-choice is only a choice when it comes to killing one's unborn child. So lets look at the real questions at hand.. pro-life--carry your child to term and give birth or pro-abort--kill your unborn child in the womb", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:31:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "3678131"
    }, 
    {
        "content": "More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090517, 
        "postID": 89, 
        "quote": "", 
        "reply": "More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:37:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "jack_flats"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: The word \"convent\" comes to mind!! LOL Or chastity belt..........", 
        "intTime": 20090517, 
        "postID": 90, 
        "quote": "Originally posted by klassylady25: The word \"convent\" comes to mind!! LOL", 
        "reply": " Or chastity belt..........", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:39:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "klc2000us"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. So, the man, i.e. the father of the child, has no say in the loss of life of his child also?... Just because the woman is blessed with the ability to carry the child to term, doesn't mean that the father of the child has any less of a bond with that child... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 91, 
        "quote": "Originally posted by crackerjacks61: It's a femals choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it.", 
        "reply": " So, the man, i.e. the father of the child, has no say in the loss of life of his child also?... Just because the woman is blessed with the ability to carry the child to term, doesn't mean that the father of the child has any less of a bond with that child... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:43:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. Absolutely!... Where you and I may differ is, that I believe that a safe, medical abortion should be available when the life of the mother is in danger... Abortions just because you can't be bothered with a child or that you don't wish to \"ruin your figure\", is just simply wrong... Abortion is abortion and birth control is birth control, two completely different things... Sex education, should be provided by the parents but, who teaches the parents?... If it is to be taught in school, it should be done with the permission of the parents but, as I posted, \"who teaches the parents\"?... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 92, 
        "quote": "Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies.", 
        "reply": " Absolutely!... Where you and I may differ is, that I believe that a safe, medical abortion should be available when the life of the mother is in danger... Abortions just because you can't be bothered with a child or that you don't wish to \"ruin your figure\", is just simply wrong... Abortion is abortion and birth control is birth control, two completely different things... Sex education, should be provided by the parents but, who teaches the parents?... If it is to be taught in school, it should be done with the permission of the parents but, as I posted, \"who teaches the parents\"?... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:47:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\". Those are all of the \"old saws\" of the \"pro abortion\" crowd... Till the subject can be addressed with out the \"hysteria\" of both sides, no solution can be found to unit us on the subject and more importantly, those children who are just as alive as you or I, are being executed daily and yet, they have committed no crime that would subject them to the death penalty... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 93, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by SeaWitch1220: quote: Originally posted by Grachus: I consider myself \"pro life,\" and I'm also \"pro choice.\" Ask a loaded question and you get what you want. Dave That is exactly my feelings on the issue Dave. Let's reduce abortion by reducing the number of unwanted pregnancies. I think, if the following questions were asked, the results would be instructive: \"Do you support criminalization of abortion under all circumstances (no abortions, no exceptions)?\" \"Do you support putting a woman who had an abortion in prison for getting an abortion?\" I suspect that the number of \"Yes\" answers would be quite small, even from those who consider themselves \"pro-life\".", 
        "reply": " Those are all of the \"old saws\" of the \"pro abortion\" crowd... Till the subject can be addressed with out the \"hysteria\" of both sides, no solution can be found to unit us on the subject and more importantly, those children who are just as alive as you or I, are being executed daily and yet, they have committed no crime that would subject them to the death penalty... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:52:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: quote: Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion. Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception. Aren't we fortunate in that... It would be interesting to find out, if our ancestors functioned the same biologically, when we lived in caves and wore animal skins and hunted with sticks, rocks and clubs for food... One wonders... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 94, 
        "quote": "Originally posted by Fightdirector: quote: Originally posted by stec74: quote: Originally posted by crackerjacks61: It's a females choice up to a certain point. Gov and Men need to get thier noses out of that choice. That choice Is just as natural as the animals on this planet..get over it. I didn't realize that animals practiced abortion. Zoologists and other scientists years ago have found evidence that animals spontaneously abort (have miscarrages) when food supplies are low, when the fetus is deformed, etc. Humans seem to be an exception.", 
        "reply": " Aren't we fortunate in that... It would be interesting to find out, if our ancestors functioned the same biologically, when we lived in caves and wore animal skins and hunted with sticks, rocks and clubs for food... One wonders... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:55:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by jack_flats: More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties. Is there not one thing, that doesn't bespeak of politics, i.e. republican versus democrat with you?... Sometimes, there are subjects that are \"apolitical\"... I am not \"knocking you\", though it may sound like it, I'm just trying to come to an understanding of how your opinion is formed... Respectfully, SUNLINER81", 
        "intTime": 20090517, 
        "postID": 95, 
        "quote": "Originally posted by jack_flats: More American's than ever are Democrat too, and a good number of them pro-life, but not orthodox enough in that belief to do the un-intelligent thing andnot vote for Democratic candidates. Hence, a good reason why the pro-life issue didn't amount to a hill of beans in the last election. It is finally being known for what it really is, a \"wedge\" issue taken off the shelf and dusted off every election year by the radical righties.", 
        "reply": " Is there not one thing, that doesn't bespeak of politics, i.e. republican versus democrat with you?... Sometimes, there are subjects that are \"apolitical\"... I am not \"knocking you\", though it may sound like it, I'm just trying to come to an understanding of how your opinion is formed... Respectfully, SUNLINER81", 
        "threadID": "672198221_5930064322001", 
        "time": "2009-05-17 11:58:00", 
        "title": "More Americans “Pro-Life” Than “Pro-Choice” for First Time", 
        "userID": "SUNLINER81"
    }
]