[
    {
        "content": "\"http://www.nydailynews.com/news/politics/2009/05/16/2009-05-16_president_obama_makes_call_ends_bid_by_gilli_rival.html\" quote: President Obama dipped his toe into New York's 2010 Democratic Senate primary Friday - and bigfooted the hopes of Sen. Kirsten Gillibrand's best-funded opponent. Long Island Rep. Steve Israel bowed out before he jumped in, saying the popular Democratic President called him up as asked him to skip the contest. \"This is a tough, heartfelt decision for me,\" Israel said. \"But in the interest of providing New York and our country with a united front for progressive change, I have decided to continue my efforts in Congress.\" A source close to the fifth-term congressman said he \"was just days away from announcing\" his bid, but Obama convinced him a tough primary against Gillibrand would hurt the party. Israel noted he had talked with Sen. Chuck Schumer about running, even though Schumer supports Gillibrand. Another Democrat said Schumer asked the White House to intervene a few days ago, and that Obama's move would also make it tougher for Reps. Carolyn Maloney (D-Manhattan) and Carolyn McCarthy to run. Democracy at it's finest.", 
        "intTime": 20090516, 
        "postID": 1, 
        "quote": "President Obama dipped his toe into New York's 2010 Democratic Senate primary Friday - and bigfooted the hopes of Sen. Kirsten Gillibrand's best-funded opponent. Long Island Rep. Steve Israel bowed out before he jumped in, saying the popular Democratic President called him up as asked him to skip the contest. \"This is a tough, heartfelt decision for me,\" Israel said. \"But in the interest of providing New York and our country with a united front for progressive change, I have decided to continue my efforts in Congress.\" A source close to the fifth-term congressman said he \"was just days away from announcing\" his bid, but Obama convinced him a tough primary against Gillibrand would hurt the party. Israel noted he had talked with Sen. Chuck Schumer about running, even though Schumer supports Gillibrand. Another Democrat said Schumer asked the White House to intervene a few days ago, and that Obama's move would also make it tougher for Reps. Carolyn Maloney (D-Manhattan) and Carolyn McCarthy to run.", 
        "reply": "\"http://www.nydailynews.com/news/politics/2009/05/16/2009-05-16_president_obama_makes_call_ends_bid_by_gilli_rival.html\"  Democracy at it's finest.", 
        "threadID": "672198221_2630064322001", 
        "time": "2009-05-16 14:31:00", 
        "title": "President Obama makes call, ends bid by Kirsten Gillibrand Democratic rival", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by stec74: \"http://www.nydailynews.com/news/politics/2009/05/16/2009-05-16_president_obama_makes_call_ends_bid_by_gilli_rival.html\" quote: President Obama dipped his toe into New York's 2010 Democratic Senate primary Friday - and bigfooted the hopes of Sen. Kirsten Gillibrand's best-funded opponent. Long Island Rep. Steve Israel bowed out before he jumped in, saying the popular Democratic President called him up as asked him to skip the contest. \"This is a tough, heartfelt decision for me,\" Israel said. \"But in the interest of providing New York and our country with a united front for progressive change, I have decided to continue my efforts in Congress.\" A source close to the fifth-term congressman said he \"was just days away from announcing\" his bid, but Obama convinced him a tough primary against Gillibrand would hurt the party. Israel noted he had talked with Sen. Chuck Schumer about running, even though Schumer supports Gillibrand. Another Democrat said Schumer asked the White House to intervene a few days ago, and that Obama's move would also make it tougher for Reps. Carolyn Maloney (D-Manhattan) and Carolyn McCarthy to run. Democracy at it's finest. He can phone call Caroline Maloney until his voice fails, and she's still going to run against Gillibrand... If I was a registered Dem, I'd vote for Gillibrand. Dave", 
        "intTime": 20090516, 
        "postID": 2, 
        "quote": "Originally posted by stec74: \"http://www.nydailynews.com/news/politics/2009/05/16/2009-05-16_president_obama_makes_call_ends_bid_by_gilli_rival.html\" quote: President Obama dipped his toe into New York's 2010 Democratic Senate primary Friday - and bigfooted the hopes of Sen. Kirsten Gillibrand's best-funded opponent. Long Island Rep. Steve Israel bowed out before he jumped in, saying the popular Democratic President called him up as asked him to skip the contest. \"This is a tough, heartfelt decision for me,\" Israel said. \"But in the interest of providing New York and our country with a united front for progressive change, I have decided to continue my efforts in Congress.\" A source close to the fifth-term congressman said he \"was just days away from announcing\" his bid, but Obama convinced him a tough primary against Gillibrand would hurt the party. Israel noted he had talked with Sen. Chuck Schumer about running, even though Schumer supports Gillibrand. Another Democrat said Schumer asked the White House to intervene a few days ago, and that Obama's move would also make it tougher for Reps. Carolyn Maloney (D-Manhattan) and Carolyn McCarthy to run. Democracy at it's finest.", 
        "reply": " He can phone call Caroline Maloney until his voice fails, and she's still going to run against Gillibrand... If I was a registered Dem, I'd vote for Gillibrand. Dave", 
        "threadID": "672198221_2630064322001", 
        "time": "2009-05-16 16:04:00", 
        "title": "President Obama makes call, ends bid by Kirsten Gillibrand Democratic rival", 
        "userID": "Grachus"
    }
]