[
    {
        "content": "\"http://news.bbc.co.uk/2/hi/business/8028174.stm\" Switzerland's largest bank, UBS, has asked a US court not to go ahead with a tax case involving more than 50,000 US customers with Swiss accounts. The Internal Revenue Service, which administers tax in the US, has taken out a civil suit to force UBS to reveal the identities of 52,000 American customers suspected of holding accounts totalling $14.8bn", 
        "intTime": 20090502, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://news.bbc.co.uk/2/hi/business/8028174.stm\" Switzerland's largest bank, UBS, has asked a US court not to go ahead with a tax case involving more than 50,000 US customers with Swiss accounts. The Internal Revenue Service, which administers tax in the US, has taken out a civil suit to force UBS to reveal the identities of 52,000 American customers suspected of holding accounts totalling $14.8bn", 
        "threadID": "672198221_6890033222001", 
        "time": "2009-05-02 15:41:00", 
        "title": "Swiss bank refuses US tax request", 
        "userID": "ss_287"
    }, 
    {
        "content": "quote: Originally posted by ss_287: \"http://news.bbc.co.uk/2/hi/business/8028174.stm\" Switzerland's largest bank, UBS, has asked a US court not to go ahead with a tax case involving more than 50,000 US customers with Swiss accounts. The Internal Revenue Service, which administers tax in the US, has taken out a civil suit to force UBS to reveal the identities of 52,000 American customers suspected of holding accounts totalling $14.8bn I only have one billion there so ... big deal", 
        "intTime": 20090502, 
        "postID": 2, 
        "quote": "Originally posted by ss_287: \"http://news.bbc.co.uk/2/hi/business/8028174.stm\" Switzerland's largest bank, UBS, has asked a US court not to go ahead with a tax case involving more than 50,000 US customers with Swiss accounts. The Internal Revenue Service, which administers tax in the US, has taken out a civil suit to force UBS to reveal the identities of 52,000 American customers suspected of holding accounts totalling $14.8bn", 
        "reply": " I only have one billion there so ... big deal", 
        "threadID": "672198221_6890033222001", 
        "time": "2009-05-02 15:50:00", 
        "title": "Swiss bank refuses US tax request", 
        "userID": "EAG154"
    }, 
    {
        "content": "Good for them.", 
        "intTime": 20090502, 
        "postID": 3, 
        "quote": "", 
        "reply": "Good for them.", 
        "threadID": "672198221_6890033222001", 
        "time": "2009-05-02 19:07:00", 
        "title": "Swiss bank refuses US tax request", 
        "userID": "shuman14"
    }, 
    {
        "content": "Thank you UBS for standing up against global imperialism and for protecting the privacy rights of those who are sick and tired of being taxed 7 ways to Sunday everytime they turn around. The US government under \"the one\" is simply going to take that money so lazy pukes can get another year of unemployment or welfare so they can continue to sit on their twinkie fattened behinds and not get a job.", 
        "intTime": 20090502, 
        "postID": 4, 
        "quote": "", 
        "reply": "Thank you UBS for standing up against global imperialism and for protecting the privacy rights of those who are sick and tired of being taxed 7 ways to Sunday everytime they turn around. The US government under \"the one\" is simply going to take that money so lazy pukes can get another year of unemployment or welfare so they can continue to sit on their twinkie fattened behinds and not get a job.", 
        "threadID": "672198221_6890033222001", 
        "time": "2009-05-02 19:32:00", 
        "title": "Swiss bank refuses US tax request", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: Thank you UBS for standing up against global imperialism and for protecting the privacy rights of those who are sick and tired of being taxed 7 ways to Sunday everytime they turn around. The US government under \"the one\" is simply going to take that money so lazy pukes can get another year of unemployment or welfare so they can continue to sit on their twinkie fattened behinds and not get a job. To coin a phrase, if you don't want to pay the tariff, go make your money somewhere else. This is all about some folk who hide money to avoid paying taxes. They steal the same as any other kind of thief. You've lived on welfare or unemployment Flanker? Walked a mile in their shoes? How do you feel about internet piracy? We know how you feel about 'private' immigration.", 
        "intTime": 20090502, 
        "postID": 5, 
        "quote": "Originally posted by FlankerFlyer: Thank you UBS for standing up against global imperialism and for protecting the privacy rights of those who are sick and tired of being taxed 7 ways to Sunday everytime they turn around. The US government under \"the one\" is simply going to take that money so lazy pukes can get another year of unemployment or welfare so they can continue to sit on their twinkie fattened behinds and not get a job.", 
        "reply": " To coin a phrase, if you don't want to pay the tariff, go make your money somewhere else. This is all about some folk who hide money to avoid paying taxes. They steal the same as any other kind of thief. You've lived on welfare or unemployment Flanker? Walked a mile in their shoes? How do you feel about internet piracy? We know how you feel about 'private' immigration.", 
        "threadID": "672198221_6890033222001", 
        "time": "2009-05-02 19:59:00", 
        "title": "Swiss bank refuses US tax request", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: Thank you UBS for standing up against global imperialism and for protecting the privacy rights of those who are sick and tired of being taxed 7 ways to Sunday everytime they turn around. The US government under \"the one\" is simply going to take that money so lazy pukes can get another year of unemployment or welfare so they can continue to sit on their twinkie fattened behinds and not get a job. Get real and quit blaming Obama for what has been in place since 1913. Those hidden accounts have been tucked away for years, way before him. Want to do something about it? fairtax.", 
        "intTime": 20090502, 
        "postID": 6, 
        "quote": "Originally posted by FlankerFlyer: Thank you UBS for standing up against global imperialism and for protecting the privacy rights of those who are sick and tired of being taxed 7 ways to Sunday everytime they turn around. The US government under \"the one\" is simply going to take that money so lazy pukes can get another year of unemployment or welfare so they can continue to sit on their twinkie fattened behinds and not get a job.", 
        "reply": " Get real and quit blaming Obama for what has been in place since 1913. Those hidden accounts have been tucked away for years, way before him. Want to do something about it? fairtax.", 
        "threadID": "672198221_6890033222001", 
        "time": "2009-05-02 20:50:00", 
        "title": "Swiss bank refuses US tax request", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: fairtax. bring it on, im all for it. BTW, yes I know how long the swiss have had banking privacy but what is different now from then is what that tax money is being spent on, Id rather support the VA with my tax money than give some UAW worker 90% of their pay for sitting on their asz for a year and refusing to take a job for less than $22/hr.", 
        "intTime": 20090502, 
        "postID": 7, 
        "quote": "fairtax.", 
        "reply": " bring it on, im all for it. BTW, yes I know how long the swiss have had banking privacy but what is different now from then is what that tax money is being spent on, Id rather support the VA with my tax money than give some UAW worker 90% of their pay for sitting on their asz for a year and refusing to take a job for less than $22/hr.", 
        "threadID": "672198221_6890033222001", 
        "time": "2009-05-02 20:57:00", 
        "title": "Swiss bank refuses US tax request", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: fairtax. bring it on, im all for it. BTW, yes I know how long the swiss have had banking privacy but what is different now from then is what that tax money is being spent on, Id rather support the VA with my tax money than give some UAW worker 90% of their pay for sitting on their asz for a year and refusing to take a job for less than $22/hr. I thought you stash your illegal wealth in Ukraine? I didn't know you used the Swiss. Well Flanker, apparently most of this money accumulated under the tax system of your hero, President Bush - So these guys are what we in America call common criminals. And apparently they steal more money then the Somali Pirates. I'm surprised you don't advocate bombing the Swiss... Is it because they are White collar criminals, instead of hard working blue collar criminals? Dave", 
        "intTime": 20090503, 
        "postID": 8, 
        "quote": "Originally posted by FlankerFlyer: quote: fairtax. bring it on, im all for it. BTW, yes I know how long the swiss have had banking privacy but what is different now from then is what that tax money is being spent on, Id rather support the VA with my tax money than give some UAW worker 90% of their pay for sitting on their asz for a year and refusing to take a job for less than $22/hr.", 
        "reply": " I thought you stash your illegal wealth in Ukraine? I didn't know you used the Swiss. Well Flanker, apparently most of this money accumulated under the tax system of your hero, President Bush - So these guys are what we in America call common criminals. And apparently they steal more money then the Somali Pirates. I'm surprised you don't advocate bombing the Swiss... Is it because they are White collar criminals, instead of hard working blue collar criminals? Dave", 
        "threadID": "672198221_6890033222001", 
        "time": "2009-05-03 11:31:00", 
        "title": "Swiss bank refuses US tax request", 
        "userID": "Grachus"
    }, 
    {
        "content": "The Swiss manufactured NAZI armaments during WW2 and exchanged looted gold and gems that allowed the NAZI's to but raw materials for their war, and because of the Swiss the WW2 was prolonged by several years. The Swiss stored and now refuse to give back art looted by the NAZI's. The Swiss stole money and valuables from thousands of Jews who put in their banks for safe keeping during WW2, and reuse to return it to their heirs. The country of Switzerland is a corporation and is run as such, and they are not nice people. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "intTime": 20090503, 
        "postID": 9, 
        "quote": "", 
        "reply": "The Swiss manufactured NAZI armaments during WW2 and exchanged looted gold and gems that allowed the NAZI's to but raw materials for their war, and because of the Swiss the WW2 was prolonged by several years. The Swiss stored and now refuse to give back art looted by the NAZI's. The Swiss stole money and valuables from thousands of Jews who put in their banks for safe keeping during WW2, and reuse to return it to their heirs. The country of Switzerland is a corporation and is run as such, and they are not nice people. \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson", 
        "threadID": "672198221_6890033222001", 
        "time": "2009-05-03 11:53:00", 
        "title": "Swiss bank refuses US tax request", 
        "userID": "jack_flats"
    }, 
    {
        "content": "jack_flats is correct on this one. The Swiss banking industry is morally bankrupt.", 
        "intTime": 20090503, 
        "postID": 10, 
        "quote": "", 
        "reply": "jack_flats is correct on this one. The Swiss banking industry is morally bankrupt.", 
        "threadID": "672198221_6890033222001", 
        "time": "2009-05-03 20:36:00", 
        "title": "Swiss bank refuses US tax request", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "quote: I thought you stash your illegal wealth in Ukraine? I didn't know you used the Swiss. Well Flanker, apparently most of this money accumulated under the tax system of your hero, President Bush - So these guys are what we in America call common criminals. And apparently they steal more money then the Somali Pirates. I'm surprised you don't advocate bombing the Swiss... Big Grin WHere I keep my retirement funds is none of your damn business but you can be guaranteed Im only getting taxed one time when it is made and wont get caught up by YOUR hero's idea of taxing wealth. Most of that money was in those accounts during Clinton's terms, its not something that came up all of the sudden. No one is doing anything illegal. All of that money has had the legitimately due taxes paid on it. The USA doesnt deserve to get to tax that money over and over and over and over again simply because its a good source to steal money from. Again its that idea that the US is the world's policeman and should get a chunk of any money made anywhere in the world because no one can stop them.(well except Chinese held cash) The Swiss are quite far from morally bankrupt. I think its far worse to continually print money because you cant even get enough people to buy bonds to cover the massive 3 billion per day of debt additions to that already 10 trillion of existing debt. But hey, I guess its fine by you to essentially commit financial and economic fraud against your citizens whose great, great grandkids will be struggling to pay the interest on a debt that makes up 70% of the federal budget. Im glad to understand that a few billion dollars held by 50,000 people that has already had taxes paid on is more morally bankrupt than tens of trillions of generational debt passed on to people who got absolutely no say in being born with a tax burden of nearly a million bucks each by 2012", 
        "intTime": 20090503, 
        "postID": 11, 
        "quote": "I thought you stash your illegal wealth in Ukraine? I didn't know you used the Swiss. Well Flanker, apparently most of this money accumulated under the tax system of your hero, President Bush - So these guys are what we in America call common criminals. And apparently they steal more money then the Somali Pirates. I'm surprised you don't advocate bombing the Swiss... Big Grin", 
        "reply": " WHere I keep my retirement funds is none of your damn business but you can be guaranteed Im only getting taxed one time when it is made and wont get caught up by YOUR hero's idea of taxing wealth. Most of that money was in those accounts during Clinton's terms, its not something that came up all of the sudden. No one is doing anything illegal. All of that money has had the legitimately due taxes paid on it. The USA doesnt deserve to get to tax that money over and over and over and over again simply because its a good source to steal money from. Again its that idea that the US is the world's policeman and should get a chunk of any money made anywhere in the world because no one can stop them.(well except Chinese held cash) The Swiss are quite far from morally bankrupt. I think its far worse to continually print money because you cant even get enough people to buy bonds to cover the massive 3 billion per day of debt additions to that already 10 trillion of existing debt. But hey, I guess its fine by you to essentially commit financial and economic fraud against your citizens whose great, great grandkids will be struggling to pay the interest on a debt that makes up 70% of the federal budget. Im glad to understand that a few billion dollars held by 50,000 people that has already had taxes paid on is more morally bankrupt than tens of trillions of generational debt passed on to people who got absolutely no say in being born with a tax burden of nearly a million bucks each by 2012", 
        "threadID": "672198221_6890033222001", 
        "time": "2009-05-03 21:57:00", 
        "title": "Swiss bank refuses US tax request", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: WHere I keep my retirement funds is none of your damn business but you can be guaranteed Im only getting taxed one time when it is made and wont get caught up by YOUR hero's idea of taxing wealth. Most of that money was in those accounts during Clinton's terms, its not something that came up all of the sudden. At least you're paying taxes on it once. quote: Originally posted by FlankerFlyer: No one is doing anything illegal. All of that money has had the legitimately due taxes paid on it. The USA doesnt deserve to get to tax that money over and over and over and over again simply because its a good source to steal money from. Again its that idea that the US is the world's policeman and should get a chunk of any money made anywhere in the world because no one can stop them.(well except Chinese held cash) Please give us \"credible\" sources for your claims of legitimacy. I highly, seriously, completely, without a doubt don't believe for one second that no one is doing anything illegal. Why do they need to put money overseas? Is there something wrong with the security of all the banks here in the U.S.? And lastly, like I said above about your funds, it needs to be taxed at least once, which is something that is being avoided by multitudes of companies and individuals when they transfer income overseas before taxes are paid on it. quote: Originally posted by FlankerFlyer: The Swiss are quite far from morally bankrupt. I think its far worse to continually print money because you cant even get enough people to buy bonds to cover the massive 3 billion per day of debt additions to that already 10 trillion of existing debt. But hey, I guess its fine by you to essentially commit financial and economic fraud against your citizens whose great, great grandkids will be struggling to pay the interest on a debt that makes up 70% of the federal budget. Had the individuals and corporations in question paid their share of taxes on all their income we might possibly not be in the deficit situation we are in now. Did that ever occur to you? quote: Originally posted by FlankerFlyer: Im glad to understand that a few billion dollars held by 50,000 people that has already had taxes paid on is more morally bankrupt than tens of trillions of generational debt passed on to people who got absolutely no say in being born with a tax burden of nearly a million bucks each by 2012 I'm glad to understand that your PHD in U.S. economics has served you so well. I'm glad to understand that you have claimed to know that all the income held by all those individuals has already been taxed. I'm glad to understand that the deficit of this country is growing because of the shortsightedness of all the previous administrations in their pursuits of global influence at the cost of domestic fiscal security. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090504, 
        "postID": 12, 
        "quote": "Originally posted by FlankerFlyer: WHere I keep my retirement funds is none of your damn business but you can be guaranteed Im only getting taxed one time when it is made and wont get caught up by YOUR hero's idea of taxing wealth. Most of that money was in those accounts during Clinton's terms, its not something that came up all of the sudden.", 
        "reply": " At least you're paying taxes on it once. quote: Originally posted by FlankerFlyer: No one is doing anything illegal. All of that money has had the legitimately due taxes paid on it. The USA doesnt deserve to get to tax that money over and over and over and over again simply because its a good source to steal money from. Again its that idea that the US is the world's policeman and should get a chunk of any money made anywhere in the world because no one can stop them.(well except Chinese held cash) Please give us \"credible\" sources for your claims of legitimacy. I highly, seriously, completely, without a doubt don't believe for one second that no one is doing anything illegal. Why do they need to put money overseas? Is there something wrong with the security of all the banks here in the U.S.? And lastly, like I said above about your funds, it needs to be taxed at least once, which is something that is being avoided by multitudes of companies and individuals when they transfer income overseas before taxes are paid on it. quote: Originally posted by FlankerFlyer: The Swiss are quite far from morally bankrupt. I think its far worse to continually print money because you cant even get enough people to buy bonds to cover the massive 3 billion per day of debt additions to that already 10 trillion of existing debt. But hey, I guess its fine by you to essentially commit financial and economic fraud against your citizens whose great, great grandkids will be struggling to pay the interest on a debt that makes up 70% of the federal budget. Had the individuals and corporations in question paid their share of taxes on all their income we might possibly not be in the deficit situation we are in now. Did that ever occur to you? quote: Originally posted by FlankerFlyer: Im glad to understand that a few billion dollars held by 50,000 people that has already had taxes paid on is more morally bankrupt than tens of trillions of generational debt passed on to people who got absolutely no say in being born with a tax burden of nearly a million bucks each by 2012 I'm glad to understand that your PHD in U.S. economics has served you so well. I'm glad to understand that you have claimed to know that all the income held by all those individuals has already been taxed. I'm glad to understand that the deficit of this country is growing because of the shortsightedness of all the previous administrations in their pursuits of global influence at the cost of domestic fiscal security. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "672198221_6890033222001", 
        "time": "2009-05-04 10:26:00", 
        "title": "Swiss bank refuses US tax request", 
        "userID": "mmulder67"
    }, 
    {
        "content": "This isJudge Learned Hand's famous statement on taxes: \"Anyone may arrange his affairs so that his taxes shall be as low as possible; he is not bound to choose that pattern which best pays the treasury. There is not even a patriotic duty to increase one's taxes. Over and over again the Courts have said that there is nothing sinister in so arranging affairs as to keep taxes as low as possible. Everyone does it, rich and poor alike and all do right, for nobody owes any public duty to pay more than the law demands.\" It is implicit therefor, that after arranging one's tax affairs properly one pay his taxes. I would like to see the US Congress pass a law that substantially increases prison time for any citizen or resident alien who hides his or her money in Switzerland or any other tax haven. Such a measure would \"bring\" the money back here post haste since there is no better country in which to live than the USA.", 
        "intTime": 20090504, 
        "postID": 13, 
        "quote": "", 
        "reply": "This isJudge Learned Hand's famous statement on taxes: \"Anyone may arrange his affairs so that his taxes shall be as low as possible; he is not bound to choose that pattern which best pays the treasury. There is not even a patriotic duty to increase one's taxes. Over and over again the Courts have said that there is nothing sinister in so arranging affairs as to keep taxes as low as possible. Everyone does it, rich and poor alike and all do right, for nobody owes any public duty to pay more than the law demands.\" It is implicit therefor, that after arranging one's tax affairs properly one pay his taxes. I would like to see the US Congress pass a law that substantially increases prison time for any citizen or resident alien who hides his or her money in Switzerland or any other tax haven. Such a measure would \"bring\" the money back here post haste since there is no better country in which to live than the USA.", 
        "threadID": "672198221_6890033222001", 
        "time": "2009-05-04 11:11:00", 
        "title": "Swiss bank refuses US tax request", 
        "userID": "fnewt"
    }, 
    {
        "content": "When you utilize the resources of this country to make money it is your responsibility to pay taxes on that money deemed necessary by the government to support that infrastructure that allowed you to make said money. Too many have avoided paying what the government has deemed necessary by hiding their income outside of the U.S. Change that is actually worth something. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "intTime": 20090504, 
        "postID": 14, 
        "quote": "", 
        "reply": "When you utilize the resources of this country to make money it is your responsibility to pay taxes on that money deemed necessary by the government to support that infrastructure that allowed you to make said money. Too many have avoided paying what the government has deemed necessary by hiding their income outside of the U.S. Change that is actually worth something. Of all escape mechanisms, Death is the most efficient. ~~ H.L. Mencken", 
        "threadID": "672198221_6890033222001", 
        "time": "2009-05-04 11:17:00", 
        "title": "Swiss bank refuses US tax request", 
        "userID": "mmulder67"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: I thought you stash your illegal wealth in Ukraine? I didn't know you used the Swiss. Well Flanker, apparently most of this money accumulated under the tax system of your hero, President Bush - So these guys are what we in America call common criminals. And apparently they steal more money then the Somali Pirates. I'm surprised you don't advocate bombing the Swiss... Big Grin WHere I keep my retirement funds is none of your damn business but you can be guaranteed Im only getting taxed one time when it is made and wont get caught up by YOUR hero's idea of taxing wealth. Most of that money was in those accounts during Clinton's terms, its not something that came up all of the sudden. No one is doing anything illegal. If they're not doing anything illegal, what's the fuss about? (And yes, where you keep your loot is NONE of my busines - But i wasn't askinig) And I'll bet you're near ballistic about Obama shutting down those illegal loopholes where people stash their ill gotten money offshore. Meanwhile of course you also go ballistic about food stamps, because two cheaters were found stuffing their faces on a frozen TV Dinner. Damn, the poor get just about everything, live like Kings, have two country homes, five cars and a lifetime subscription to the Wall Stree Journal. Whereas the wealthy can barely make ends meet, and never ever collect food stamps. Their such patriotic guys. Dave", 
        "intTime": 20090504, 
        "postID": 15, 
        "quote": "Originally posted by FlankerFlyer: quote: I thought you stash your illegal wealth in Ukraine? I didn't know you used the Swiss. Well Flanker, apparently most of this money accumulated under the tax system of your hero, President Bush - So these guys are what we in America call common criminals. And apparently they steal more money then the Somali Pirates. I'm surprised you don't advocate bombing the Swiss... Big Grin WHere I keep my retirement funds is none of your damn business but you can be guaranteed Im only getting taxed one time when it is made and wont get caught up by YOUR hero's idea of taxing wealth. Most of that money was in those accounts during Clinton's terms, its not something that came up all of the sudden. No one is doing anything illegal.", 
        "reply": " If they're not doing anything illegal, what's the fuss about? (And yes, where you keep your loot is NONE of my busines - But i wasn't askinig) And I'll bet you're near ballistic about Obama shutting down those illegal loopholes where people stash their ill gotten money offshore. Meanwhile of course you also go ballistic about food stamps, because two cheaters were found stuffing their faces on a frozen TV Dinner. Damn, the poor get just about everything, live like Kings, have two country homes, five cars and a lifetime subscription to the Wall Stree Journal. Whereas the wealthy can barely make ends meet, and never ever collect food stamps. Their such patriotic guys. Dave", 
        "threadID": "672198221_6890033222001", 
        "time": "2009-05-04 12:13:00", 
        "title": "Swiss bank refuses US tax request", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by mmulder67: Had the individuals and corporations in question paid their share of taxes on all their income we might possibly not be in the deficit situation we are in now. Did that ever occur to you? Come on. Examine the numbers. Whatever hidden taxes there have been cannot come near the national debt. Excessive spending--so much in the name of alligator tear \"compassion\" to fight poverty for victims (and provide all sorts of other unearned handouts) whose numbers only expand from the moral hazard--has screwed us and the unborn of this nation, if this nation can exist economically and otherwise long enough for them to be born and grow. And let us never forget that Obama's chief lawyer, Holder, went out of his way to let Marc Rich off the hook and get a pardon, once his wife contributed handsomely to Bill Clinton's fund. And Obama's great SecTreas and assorted other nominees never paid their just taxes. Enough of the leftist hypocrisy. Probably the most important stricture for leadership is to lead by force of personal example; the Obama administration which now complains about overseas accounts fails miserably in the most important measure of leadership.", 
        "intTime": 20090504, 
        "postID": 16, 
        "quote": "Originally posted by mmulder67: Had the individuals and corporations in question paid their share of taxes on all their income we might possibly not be in the deficit situation we are in now. Did that ever occur to you?", 
        "reply": " Come on. Examine the numbers. Whatever hidden taxes there have been cannot come near the national debt. Excessive spending--so much in the name of alligator tear \"compassion\" to fight poverty for victims (and provide all sorts of other unearned handouts) whose numbers only expand from the moral hazard--has screwed us and the unborn of this nation, if this nation can exist economically and otherwise long enough for them to be born and grow. And let us never forget that Obama's chief lawyer, Holder, went out of his way to let Marc Rich off the hook and get a pardon, once his wife contributed handsomely to Bill Clinton's fund. And Obama's great SecTreas and assorted other nominees never paid their just taxes. Enough of the leftist hypocrisy. Probably the most important stricture for leadership is to lead by force of personal example; the Obama administration which now complains about overseas accounts fails miserably in the most important measure of leadership.", 
        "threadID": "672198221_6890033222001", 
        "time": "2009-05-04 15:47:00", 
        "title": "Swiss bank refuses US tax request", 
        "userID": "RRR52"
    }
]