[
    {
        "content": "Wonderful story. All it took was one old gentleman standing in solemn respect and it spread from there. ++http://www.nytimes.com/2009/05/19/world/europe/19wootton.html?_r=2&ref=europe quote: WOOTTON BASSETT, England — It started two years ago, the first time a military hearse carrying the body of a slain British soldier drove through town. An elderly man stood silent and alone by the side of the road, saluting as the coffin went by. “It was a shocking, heart-wrenching experience,” said Sarah Dunn, who is 36 and works at a real estate office here. “Seeing the sight of the coffin actually go past, and seeing the gentleman out there.” No one ever really discussed it. But the next time a soldier’s hearse drove by on its way from Lyneham Royal Air Force Base to a hospital morgue in Oxford, Miss Dunn, her co-workers and most of the shopkeepers along the street quietly went outside and showed their respect by lining up to watch it pass, too. They have done it dozens of times since then, part of a growing crowd that now includes local residents, military veterans and others from across the country. Britain withdrew from Iraq at the end of April, but it still has 8,300 troops in Afghanistan, waging a war few people understand and fewer still support. The impromptu commemorations in this Wiltshire market town have provided a poignant reminder that, however unpopular and quixotic their mission, soldiers are still fighting, and still dying, for Britain... Earlier casualties of war were flown to a different air base. Lyneham became the primary site for casualties in 2007, when the hearses began coming through Wootton Bassett. “I think a lot of other parts of the country aren’t really aware of the war,” said Carol Lacey, who works at a stationery store on the main street. (...) Wootton Bassett has become famous for its response to the hearses in a country that seems at times to wish the whole thing would just go away. At one point, someone proposed renaming the main street “Highway of Heroes” to make it official. The townspeople balked, saying that they were just doing what any decent people would do and that they didn’t want to draw attention to themselves. Miss Dunn, the real estate agent, said: “It’s a ridiculous idea, because it takes the emphasis off of the soldiers. They’re the ones who are remarkable, not us.” Pat Mackie, who is 60 and owns a gift shop in town, said “people are doing it unconditionally, not for any other reason.” One repatriation took place during a bell-ringing practice at the church, and the sound seemed so fitting that now the bells are rung whenever a new hearse reaches the edge of town. (...) The hearses carried the coffins of Cpl. Kumar Pun, 31; Sgt. Ben Ross, 34; Rifleman Adrian Sheldon, 25; and Cpl. Sean Binnie, 22. (...) George Brooks, 61, who had served in the Royal Air Force and had traveled down from Bristol, as he always does for repatriations, said that when battalions came home from war they were welcomed and given parades. “But these lads have nothing,” he said. “This is their parade.”", 
        "intTime": 20090520, 
        "postID": 1, 
        "quote": "WOOTTON BASSETT, England — It started two years ago, the first time a military hearse carrying the body of a slain British soldier drove through town. An elderly man stood silent and alone by the side of the road, saluting as the coffin went by. “It was a shocking, heart-wrenching experience,” said Sarah Dunn, who is 36 and works at a real estate office here. “Seeing the sight of the coffin actually go past, and seeing the gentleman out there.” No one ever really discussed it. But the next time a soldier’s hearse drove by on its way from Lyneham Royal Air Force Base to a hospital morgue in Oxford, Miss Dunn, her co-workers and most of the shopkeepers along the street quietly went outside and showed their respect by lining up to watch it pass, too. They have done it dozens of times since then, part of a growing crowd that now includes local residents, military veterans and others from across the country. Britain withdrew from Iraq at the end of April, but it still has 8,300 troops in Afghanistan, waging a war few people understand and fewer still support. The impromptu commemorations in this Wiltshire market town have provided a poignant reminder that, however unpopular and quixotic their mission, soldiers are still fighting, and still dying, for Britain... Earlier casualties of war were flown to a different air base. Lyneham became the primary site for casualties in 2007, when the hearses began coming through Wootton Bassett. “I think a lot of other parts of the country aren’t really aware of the war,” said Carol Lacey, who works at a stationery store on the main street. (...) Wootton Bassett has become famous for its response to the hearses in a country that seems at times to wish the whole thing would just go away. At one point, someone proposed renaming the main street “Highway of Heroes” to make it official. The townspeople balked, saying that they were just doing what any decent people would do and that they didn’t want to draw attention to themselves. Miss Dunn, the real estate agent, said: “It’s a ridiculous idea, because it takes the emphasis off of the soldiers. They’re the ones who are remarkable, not us.” Pat Mackie, who is 60 and owns a gift shop in town, said “people are doing it unconditionally, not for any other reason.” One repatriation took place during a bell-ringing practice at the church, and the sound seemed so fitting that now the bells are rung whenever a new hearse reaches the edge of town. (...) The hearses carried the coffins of Cpl. Kumar Pun, 31; Sgt. Ben Ross, 34; Rifleman Adrian Sheldon, 25; and Cpl. Sean Binnie, 22. (...) George Brooks, 61, who had served in the Royal Air Force and had traveled down from Bristol, as he always does for repatriations, said that when battalions came home from war they were welcomed and given parades. “But these lads have nothing,” he said. “This is their parade.”", 
        "reply": "Wonderful story. All it took was one old gentleman standing in solemn respect and it spread from there. ++http://www.nytimes.com/2009/05/19/world/europe/19wootton.html?_r=2&ref=europe ", 
        "threadID": "672198221_6590087322001", 
        "time": "2009-05-20 13:15:00", 
        "title": "Britain's parade for the fallen", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Hand Salute. Of course the Reps will call this picture dishonorable and a disgrace.", 
        "intTime": 20090520, 
        "postID": 2, 
        "quote": "", 
        "reply": "Hand Salute. Of course the Reps will call this picture dishonorable and a disgrace.", 
        "threadID": "672198221_6590087322001", 
        "time": "2009-05-20 15:24:00", 
        "title": "Britain's parade for the fallen", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "How many posts do you think it will take for someone to turn even this humble gesture into something political. Oh, right. A wonderful gesture, and I bet a case of beer the old gentleman who started this was a WWII vet.", 
        "intTime": 20090520, 
        "postID": 3, 
        "quote": "", 
        "reply": "How many posts do you think it will take for someone to turn even this humble gesture into something political. Oh, right. A wonderful gesture, and I bet a case of beer the old gentleman who started this was a WWII vet.", 
        "threadID": "672198221_6590087322001", 
        "time": "2009-05-20 16:18:00", 
        "title": "Britain's parade for the fallen", 
        "userID": "2nd_freedomfighter"
    }, 
    {
        "content": "quote: Originally posted by 2nd_freedomfighter: How many posts do you think it will take for someone to turn even this humble gesture into something political. Oh, right. A wonderful gesture, and I bet a case of beer the old gentleman who started this was a WWII vet. Probably although Korea was a rumour I heard. Actually WWII is a pretty safe bet, the majority of men who were over 18 and under 40 in 1943 will have served in one or other of the forces and a significant proportion of the rest will have been something almost equally arduous like Bevin Boys or firemen.", 
        "intTime": 20090520, 
        "postID": 4, 
        "quote": "Originally posted by 2nd_freedomfighter: How many posts do you think it will take for someone to turn even this humble gesture into something political. Oh, right. A wonderful gesture, and I bet a case of beer the old gentleman who started this was a WWII vet.", 
        "reply": " Probably although Korea was a rumour I heard. Actually WWII is a pretty safe bet, the majority of men who were over 18 and under 40 in 1943 will have served in one or other of the forces and a significant proportion of the rest will have been something almost equally arduous like Bevin Boys or firemen.", 
        "threadID": "672198221_6590087322001", 
        "time": "2009-05-20 16:36:00", 
        "title": "Britain's parade for the fallen", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "Brits have big hearts and understanding of giving of oneself. Wootten Bassett is due east of London, small in population, large in loving. God Bless Ms. Dunn, Swindon, UK", 
        "intTime": 20090520, 
        "postID": 5, 
        "quote": "", 
        "reply": "Brits have big hearts and understanding of giving of oneself. Wootten Bassett is due east of London, small in population, large in loving. God Bless Ms. Dunn, Swindon, UK", 
        "threadID": "672198221_6590087322001", 
        "time": "2009-05-20 17:10:00", 
        "title": "Britain's parade for the fallen", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Hand Salute. Of course the Reps will call this picture dishonorable and a disgrace. The major reason why I have a problem with taking pictures of the flag draped coffins and publishing them is because it opens the door for anyone, regardless of what side of the political spectrum you are, to use them to further their own political agenda and/or opinions. YOU just made it a disgrace by using it to further your own political agenda, even if it is only an opinion. Why couldn't you just honor those men and just keep the politics out of it? I don't call the picture dishonorable or a disgrace. Just the person who uses it politically.", 
        "intTime": 20090520, 
        "postID": 6, 
        "quote": "Originally posted by crackerjacks61: Hand Salute. Of course the Reps will call this picture dishonorable and a disgrace.", 
        "reply": " The major reason why I have a problem with taking pictures of the flag draped coffins and publishing them is because it opens the door for anyone, regardless of what side of the political spectrum you are, to use them to further their own political agenda and/or opinions. YOU just made it a disgrace by using it to further your own political agenda, even if it is only an opinion. Why couldn't you just honor those men and just keep the politics out of it? I don't call the picture dishonorable or a disgrace. Just the person who uses it politically.", 
        "threadID": "672198221_6590087322001", 
        "time": "2009-05-20 21:00:00", 
        "title": "Britain's parade for the fallen", 
        "userID": "klc2000us"
    }, 
    {
        "content": "quote: Originally posted by klc2000us: quote: Originally posted by crackerjacks61: Hand Salute. Of course the Reps will call this picture dishonorable and a disgrace. The major reason why I have a problem with taking pictures of the flag draped coffins and publishing them is because it opens the door for anyone, regardless of what side of the political spectrum you are, to use them to further their own political agenda and/or opinions. YOU just made it a disgrace by using it to further your own political agenda, even if it is only an opinion. Why couldn't you just honor those men and just keep the politics out of it? I don't call the picture dishonorable or a disgrace. Just the person who uses it politically. That's nothing new with Crackerjack.........", 
        "intTime": 20090520, 
        "postID": 7, 
        "quote": "Originally posted by klc2000us: quote: Originally posted by crackerjacks61: Hand Salute. Of course the Reps will call this picture dishonorable and a disgrace. The major reason why I have a problem with taking pictures of the flag draped coffins and publishing them is because it opens the door for anyone, regardless of what side of the political spectrum you are, to use them to further their own political agenda and/or opinions. YOU just made it a disgrace by using it to further your own political agenda, even if it is only an opinion. Why couldn't you just honor those men and just keep the politics out of it? I don't call the picture dishonorable or a disgrace. Just the person who uses it politically.", 
        "reply": " That's nothing new with Crackerjack.........", 
        "threadID": "672198221_6590087322001", 
        "time": "2009-05-20 21:09:00", 
        "title": "Britain's parade for the fallen", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by klc2000us: quote: Originally posted by crackerjacks61: Hand Salute. Of course the Reps will call this picture dishonorable and a disgrace. The major reason why I have a problem with taking pictures of the flag draped coffins and publishing them is because it opens the door for anyone, regardless of what side of the political spectrum you are, to use them to further their own political agenda and/or opinions. YOU just made it a disgrace by using it to further your own political agenda, even if it is only an opinion. Why couldn't you just honor those men and just keep the politics out of it? I don't call the picture dishonorable or a disgrace. Just the person who uses it politically. That's nothing new with Crackerjack......... Yes, this I know. LOL I don't post a lot on here, but I am on here almost every day, mostly reading. Kind of like listening more and talking less............Usually someone has beat me to the punch in a response. This just ticked me off to no end. Especially since my hubby's Brigade in Afghanistan just lost two a few days ago...............still fresh on my mind.........", 
        "intTime": 20090520, 
        "postID": 8, 
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by klc2000us: quote: Originally posted by crackerjacks61: Hand Salute. Of course the Reps will call this picture dishonorable and a disgrace. The major reason why I have a problem with taking pictures of the flag draped coffins and publishing them is because it opens the door for anyone, regardless of what side of the political spectrum you are, to use them to further their own political agenda and/or opinions. YOU just made it a disgrace by using it to further your own political agenda, even if it is only an opinion. Why couldn't you just honor those men and just keep the politics out of it? I don't call the picture dishonorable or a disgrace. Just the person who uses it politically. That's nothing new with Crackerjack.........", 
        "reply": " Yes, this I know. LOL I don't post a lot on here, but I am on here almost every day, mostly reading. Kind of like listening more and talking less............Usually someone has beat me to the punch in a response. This just ticked me off to no end. Especially since my hubby's Brigade in Afghanistan just lost two a few days ago...............still fresh on my mind.........", 
        "threadID": "672198221_6590087322001", 
        "time": "2009-05-20 21:15:00", 
        "title": "Britain's parade for the fallen", 
        "userID": "klc2000us"
    }, 
    {
        "content": "quote: Originally posted by klc2000us: quote: Originally posted by crackerjacks61: Hand Salute. Of course the Reps will call this picture dishonorable and a disgrace. The major reason why I have a problem with taking pictures of the flag draped coffins and publishing them is because it opens the door for anyone, regardless of what side of the political spectrum you are, to use them to further their own political agenda and/or opinions. YOU just made it a disgrace by using it to further your own political agenda, even if it is only an opinion. Why couldn't you just honor those men and just keep the politics out of it? I don't call the picture dishonorable or a disgrace. Just the person who uses it politically. It doesn't really work like that in Britain because the Forces are fundamentally apolitical. We get quite uncomfortable if politicians try to make policy speeches in front of or to troops in the way that US Presidents regularly do and that discomfort tend to filter down to any use of forces related images for party-political purposes unrelated to defence policy. There has for example been a bit of a stink about the British National Party using a picture of a soldier in uniform to push their racist agenda.", 
        "intTime": 20090521, 
        "postID": 9, 
        "quote": "Originally posted by klc2000us: quote: Originally posted by crackerjacks61: Hand Salute. Of course the Reps will call this picture dishonorable and a disgrace. The major reason why I have a problem with taking pictures of the flag draped coffins and publishing them is because it opens the door for anyone, regardless of what side of the political spectrum you are, to use them to further their own political agenda and/or opinions. YOU just made it a disgrace by using it to further your own political agenda, even if it is only an opinion. Why couldn't you just honor those men and just keep the politics out of it? I don't call the picture dishonorable or a disgrace. Just the person who uses it politically.", 
        "reply": " It doesn't really work like that in Britain because the Forces are fundamentally apolitical. We get quite uncomfortable if politicians try to make policy speeches in front of or to troops in the way that US Presidents regularly do and that discomfort tend to filter down to any use of forces related images for party-political purposes unrelated to defence policy. There has for example been a bit of a stink about the British National Party using a picture of a soldier in uniform to push their racist agenda.", 
        "threadID": "672198221_6590087322001", 
        "time": "2009-05-21 03:55:00", 
        "title": "Britain's parade for the fallen", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "quote: Originally posted by klc2000us: quote: Originally posted by crackerjacks61: Hand Salute. Of course the Reps will call this picture dishonorable and a disgrace. The major reason why I have a problem with taking pictures of the flag draped coffins and publishing them is because it opens the door for anyone, regardless of what side of the political spectrum you are, to use them to further their own political agenda and/or opinions. YOU just made it a disgrace by using it to further your own political agenda, even if it is only an opinion. Why couldn't you just honor those men and just keep the politics out of it? I don't call the picture dishonorable or a disgrace. Just the person who uses it politically. So expressing a salute and an oppinon of honor and respect is being disrespectful or stating why people find such dishonorable and disrespectful is being dishonorable or disrespectful? I think not. Now if I came out and said hey look at all these dead military personnel we need to get out now or something to that effect, then I think that has crossed the line.", 
        "intTime": 20090521, 
        "postID": 10, 
        "quote": "Originally posted by klc2000us: quote: Originally posted by crackerjacks61: Hand Salute. Of course the Reps will call this picture dishonorable and a disgrace. The major reason why I have a problem with taking pictures of the flag draped coffins and publishing them is because it opens the door for anyone, regardless of what side of the political spectrum you are, to use them to further their own political agenda and/or opinions. YOU just made it a disgrace by using it to further your own political agenda, even if it is only an opinion. Why couldn't you just honor those men and just keep the politics out of it? I don't call the picture dishonorable or a disgrace. Just the person who uses it politically.", 
        "reply": " So expressing a salute and an oppinon of honor and respect is being disrespectful or stating why people find such dishonorable and disrespectful is being dishonorable or disrespectful? I think not. Now if I came out and said hey look at all these dead military personnel we need to get out now or something to that effect, then I think that has crossed the line.", 
        "threadID": "672198221_6590087322001", 
        "time": "2009-05-21 04:36:00", 
        "title": "Britain's parade for the fallen", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by klc2000us: quote: Originally posted by crackerjacks61: Hand Salute. Of course the Reps will call this picture dishonorable and a disgrace. The major reason why I have a problem with taking pictures of the flag draped coffins and publishing them is because it opens the door for anyone, regardless of what side of the political spectrum you are, to use them to further their own political agenda and/or opinions. YOU just made it a disgrace by using it to further your own political agenda, even if it is only an opinion. Why couldn't you just honor those men and just keep the politics out of it? I don't call the picture dishonorable or a disgrace. Just the person who uses it politically. So expressing a salute and an oppinon of honor and respect is being disrespectful or stating why people find such dishonorable and disrespectful is being dishonorable or disrespectful? I think not. Now if I came out and said hey look at all these dead military personnel we need to get out now or something to that effect, then I think that has crossed the line. No, the fact that you brought politics into something that doesn't need politics is disrespectful. I guess you just wanted to be the first one to say something political. I'm a Rep and I see no dishonor or disgrace in this. They are in a hearse that you can see in, they are out in public view, why wouldn't a pic be taken. They are not on a base coming off the plane. I said it before and I will say it again. I have no problem with the US media taking pics of our fallen as long as they have the approval of the family first. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090521, 
        "postID": 11, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by klc2000us: quote: Originally posted by crackerjacks61: Hand Salute. Of course the Reps will call this picture dishonorable and a disgrace. The major reason why I have a problem with taking pictures of the flag draped coffins and publishing them is because it opens the door for anyone, regardless of what side of the political spectrum you are, to use them to further their own political agenda and/or opinions. YOU just made it a disgrace by using it to further your own political agenda, even if it is only an opinion. Why couldn't you just honor those men and just keep the politics out of it? I don't call the picture dishonorable or a disgrace. Just the person who uses it politically. So expressing a salute and an oppinon of honor and respect is being disrespectful or stating why people find such dishonorable and disrespectful is being dishonorable or disrespectful? I think not. Now if I came out and said hey look at all these dead military personnel we need to get out now or something to that effect, then I think that has crossed the line.", 
        "reply": " No, the fact that you brought politics into something that doesn't need politics is disrespectful. I guess you just wanted to be the first one to say something political. I'm a Rep and I see no dishonor or disgrace in this. They are in a hearse that you can see in, they are out in public view, why wouldn't a pic be taken. They are not on a base coming off the plane. I said it before and I will say it again. I have no problem with the US media taking pics of our fallen as long as they have the approval of the family first. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_6590087322001", 
        "time": "2009-05-21 06:00:00", 
        "title": "Britain's parade for the fallen", 
        "userID": "Anbar7"
    }, 
    {
        "content": "Quoted from the poem \"Tommy\" by Rudyard Kipling: Yes, makin' mock o' uniforms that guard you while you sleep Is cheaper than them uniforms, an' they're starvation cheap; An' hustlin' drunken soldiers when they're goin' large a bit Is five times better business than paradin' in full kit. Then it's Tommy this, an' Tommy that, an' \"Tommy, 'ow's yer soul?\" But it's \"Thin red line of 'eroes\" when the drums begin to roll, The drums begin to roll, my boys, the drums begin to roll, O it's \"Thin red line of 'eroes\" when the drums begin to roll. The poem sort of sums-up the British respect for it soldiers, its \"Tommy Atkins\".", 
        "intTime": 20090521, 
        "postID": 12, 
        "quote": "", 
        "reply": "Quoted from the poem \"Tommy\" by Rudyard Kipling: Yes, makin' mock o' uniforms that guard you while you sleep Is cheaper than them uniforms, an' they're starvation cheap; An' hustlin' drunken soldiers when they're goin' large a bit Is five times better business than paradin' in full kit. Then it's Tommy this, an' Tommy that, an' \"Tommy, 'ow's yer soul?\" But it's \"Thin red line of 'eroes\" when the drums begin to roll, The drums begin to roll, my boys, the drums begin to roll, O it's \"Thin red line of 'eroes\" when the drums begin to roll. The poem sort of sums-up the British respect for it soldiers, its \"Tommy Atkins\".", 
        "threadID": "672198221_6590087322001", 
        "time": "2009-05-21 10:40:00", 
        "title": "Britain's parade for the fallen", 
        "userID": "fnewt"
    }, 
    {
        "content": "quote: Originally posted by fnewt: Quoted from the poem \"Tommy\" by Rudyard Kipling: Yes, makin' mock o' uniforms that guard you while you sleep Is cheaper than them uniforms, an' they're starvation cheap; An' hustlin' drunken soldiers when they're goin' large a bit Is five times better business than paradin' in full kit. Then it's Tommy this, an' Tommy that, an' \"Tommy, 'ow's yer soul?\" But it's \"Thin red line of 'eroes\" when the drums begin to roll, The drums begin to roll, my boys, the drums begin to roll, O it's \"Thin red line of 'eroes\" when the drums begin to roll. The poem sort of sums-up the British respect for it soldiers, its \"Tommy Atkins\". Always like Kipling, he was a soldier's poet. Who can forget........... So I'll meet'im later on at a place where'e is gone- Where it's always double drill and no canteen; E'll be squattin on the coals, an' I'll get a swig in hell from Gunga Din. Yes, Din! Din! Din! You Lazarushian-leather Gunga Din Though I've belted you and flayed you, by the livin Gawd that made you You're a better man than I am, Gunga Din!", 
        "intTime": 20090521, 
        "postID": 13, 
        "quote": "Originally posted by fnewt: Quoted from the poem \"Tommy\" by Rudyard Kipling: Yes, makin' mock o' uniforms that guard you while you sleep Is cheaper than them uniforms, an' they're starvation cheap; An' hustlin' drunken soldiers when they're goin' large a bit Is five times better business than paradin' in full kit. Then it's Tommy this, an' Tommy that, an' \"Tommy, 'ow's yer soul?\" But it's \"Thin red line of 'eroes\" when the drums begin to roll, The drums begin to roll, my boys, the drums begin to roll, O it's \"Thin red line of 'eroes\" when the drums begin to roll. The poem sort of sums-up the British respect for it soldiers, its \"Tommy Atkins\".", 
        "reply": " Always like Kipling, he was a soldier's poet. Who can forget........... So I'll meet'im later on at a place where'e is gone- Where it's always double drill and no canteen; E'll be squattin on the coals, an' I'll get a swig in hell from Gunga Din. Yes, Din! Din! Din! You Lazarushian-leather Gunga Din Though I've belted you and flayed you, by the livin Gawd that made you You're a better man than I am, Gunga Din!", 
        "threadID": "672198221_6590087322001", 
        "time": "2009-05-21 12:22:00", 
        "title": "Britain's parade for the fallen", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Hand Salute. Of course the Reps will call this picture dishonorable and a disgrace. CJ, sometimes you out do yourself with utter stupidity. This close to Memorial Day & you have to post something as ignorant as this. Pull your head out of your azz & come up for air. BTW, getting away from CJ's ignorance, way to go folks of Wootton.", 
        "intTime": 20090521, 
        "postID": 14, 
        "quote": "Originally posted by crackerjacks61: Hand Salute. Of course the Reps will call this picture dishonorable and a disgrace.", 
        "reply": " CJ, sometimes you out do yourself with utter stupidity. This close to Memorial Day & you have to post something as ignorant as this. Pull your head out of your azz & come up for air. BTW, getting away from CJ's ignorance, way to go folks of Wootton.", 
        "threadID": "672198221_6590087322001", 
        "time": "2009-05-21 13:03:00", 
        "title": "Britain's parade for the fallen", 
        "userID": "67NOV"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by klc2000us: quote: Originally posted by crackerjacks61: Hand Salute. Of course the Reps will call this picture dishonorable and a disgrace. The major reason why I have a problem with taking pictures of the flag draped coffins and publishing them is because it opens the door for anyone, regardless of what side of the political spectrum you are, to use them to further their own political agenda and/or opinions. YOU just made it a disgrace by using it to further your own political agenda, even if it is only an opinion. Why couldn't you just honor those men and just keep the politics out of it? I don't call the picture dishonorable or a disgrace. Just the person who uses it politically. So expressing a salute and an oppinon of honor and respect is being disrespectful or stating why people find such dishonorable and disrespectful is being dishonorable or disrespectful? I think not. Now if I came out and said hey look at all these dead military personnel we need to get out now or something to that effect, then I think that has crossed the line. You remind me of my teenage daughter. She is purposely obtuse about things too. I find you throwing your political babble right after your salute to be the problem. It is like apologizing for something and then adding \"but..........\". Just do the \"hand salute\" and keep the political rambling out of it.", 
        "intTime": 20090522, 
        "postID": 15, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by klc2000us: quote: Originally posted by crackerjacks61: Hand Salute. Of course the Reps will call this picture dishonorable and a disgrace. The major reason why I have a problem with taking pictures of the flag draped coffins and publishing them is because it opens the door for anyone, regardless of what side of the political spectrum you are, to use them to further their own political agenda and/or opinions. YOU just made it a disgrace by using it to further your own political agenda, even if it is only an opinion. Why couldn't you just honor those men and just keep the politics out of it? I don't call the picture dishonorable or a disgrace. Just the person who uses it politically. So expressing a salute and an oppinon of honor and respect is being disrespectful or stating why people find such dishonorable and disrespectful is being dishonorable or disrespectful? I think not. Now if I came out and said hey look at all these dead military personnel we need to get out now or something to that effect, then I think that has crossed the line.", 
        "reply": " You remind me of my teenage daughter. She is purposely obtuse about things too. I find you throwing your political babble right after your salute to be the problem. It is like apologizing for something and then adding \"but..........\". Just do the \"hand salute\" and keep the political rambling out of it.", 
        "threadID": "672198221_6590087322001", 
        "time": "2009-05-22 08:13:00", 
        "title": "Britain's parade for the fallen", 
        "userID": "klc2000us"
    }, 
    {
        "content": "Was a time when respect for the dead, of any station, was one of the social graces - in the Euro-American tradition at least. Dead military personnel (and others) have special honours. It's only fitting that we pause at their passing. As far as politics are concerned, we need to bear in mind that it is, generally, politics that place service personnel in situations where a sacrifice might be required. Sometimes that political judgement is correct and in a good cause. Sometimes it's not. According to the Romans the sacrifice was always good - 'dulce et decorum est pro patria mori'. I'm not sure that soldiers always share that sentiment.", 
        "intTime": 20090522, 
        "postID": 16, 
        "quote": "", 
        "reply": "Was a time when respect for the dead, of any station, was one of the social graces - in the Euro-American tradition at least. Dead military personnel (and others) have special honours. It's only fitting that we pause at their passing. As far as politics are concerned, we need to bear in mind that it is, generally, politics that place service personnel in situations where a sacrifice might be required. Sometimes that political judgement is correct and in a good cause. Sometimes it's not. According to the Romans the sacrifice was always good - 'dulce et decorum est pro patria mori'. I'm not sure that soldiers always share that sentiment.", 
        "threadID": "672198221_6590087322001", 
        "time": "2009-05-22 08:27:00", 
        "title": "Britain's parade for the fallen", 
        "userID": "AliBubba"
    }, 
    {
        "content": "quote: Originally posted by AliBubba: Was a time when respect for the dead, of any station, was one of the social graces - in the Euro-American tradition at least. Dead military personnel (and others) have special honours. It's only fitting that we pause at their passing. As far as politics are concerned, we need to bear in mind that it is, generally, politics that place service personnel in situations where a sacrifice might be required. Sometimes that political judgement is correct and in a good cause. Sometimes it's not. According to the Romans the sacrifice was always good - 'dulce et decorum est pro patria mori'. I'm not sure that soldiers always share that sentiment. Indeed, I assume you've read Wilfred Owen's poem on the subject of that saying?", 
        "intTime": 20090522, 
        "postID": 17, 
        "quote": "Originally posted by AliBubba: Was a time when respect for the dead, of any station, was one of the social graces - in the Euro-American tradition at least. Dead military personnel (and others) have special honours. It's only fitting that we pause at their passing. As far as politics are concerned, we need to bear in mind that it is, generally, politics that place service personnel in situations where a sacrifice might be required. Sometimes that political judgement is correct and in a good cause. Sometimes it's not. According to the Romans the sacrifice was always good - 'dulce et decorum est pro patria mori'. I'm not sure that soldiers always share that sentiment.", 
        "reply": " Indeed, I assume you've read Wilfred Owen's poem on the subject of that saying?", 
        "threadID": "672198221_6590087322001", 
        "time": "2009-05-22 10:58:00", 
        "title": "Britain's parade for the fallen", 
        "userID": "Bladensburg"
    }, 
    {
        "content": "You know since WW2 Britain or her common wealth has always backed us in war's. as a show of respect I would really like to see a few American officer's there showing America's respect for them.", 
        "intTime": 20090522, 
        "postID": 18, 
        "quote": "", 
        "reply": "You know since WW2 Britain or her common wealth has always backed us in war's. as a show of respect I would really like to see a few American officer's there showing America's respect for them.", 
        "threadID": "672198221_6590087322001", 
        "time": "2009-05-22 12:23:00", 
        "title": "Britain's parade for the fallen", 
        "userID": "world_king377"
    }
]