[
    {
        "content": "quote: Tens of thousands took to the streets in Tbilisi, vowing to demonstrate daily until President Mikheil Saakashvili resigns. The opposition accuses him of mishandling Georgia's August 2008 military conflict with Russia. +http://www.france24.com/en/20090409-georgia-tblisi-opposition-protests-saakashvili-russia-conflict This message has been edited. Last edited by: NSNN, Sun 12 April 2009 04:57 AM \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090410, 
        "postID": 1, 
        "quote": "Tens of thousands took to the streets in Tbilisi, vowing to demonstrate daily until President Mikheil Saakashvili resigns. The opposition accuses him of mishandling Georgia's August 2008 military conflict with Russia.", 
        "reply": " +http://www.france24.com/en/20090409-georgia-tblisi-opposition-protests-saakashvili-russia-conflict This message has been edited. Last edited by: NSNN, Sun 12 April 2009 04:57 AM \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-10 12:31:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: [QUOTE] Tens of thousands took to the streets in Tbilisi, vowing to demonstrate daily until President Mikheil Saakashvili resigns. The opposition accuses him of mishandling Georgia's August 2008 military conflict with Russia. Better headline would be, \"Tens of thousands call for ending Georgias Constitution\" Gosh, they don't like their President? Can't wait for the next election? Tsk, tsk... Dave", 
        "intTime": 20090410, 
        "postID": 2, 
        "quote": "Originally posted by NSNN: [QUOTE] Tens of thousands took to the streets in Tbilisi, vowing to demonstrate daily until President Mikheil Saakashvili resigns. The opposition accuses him of mishandling Georgia's August 2008 military conflict with Russia.", 
        "reply": " Better headline would be, \"Tens of thousands call for ending Georgias Constitution\" Gosh, they don't like their President? Can't wait for the next election? Tsk, tsk... Dave", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-10 12:36:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "Grachus"
    }, 
    {
        "content": "The only way to get thousands to turn out in Georgia is to hold a NASCAR race. Wrong Georgia.. Me, i'm not much concerned with what's going on in Stalin's birthplace. Now if there's a proovable threat to the national security of the USA...", 
        "intTime": 20090410, 
        "postID": 3, 
        "quote": "", 
        "reply": "The only way to get thousands to turn out in Georgia is to hold a NASCAR race. Wrong Georgia.. Me, i'm not much concerned with what's going on in Stalin's birthplace. Now if there's a proovable threat to the national security of the USA...", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-10 16:06:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Wow, I thought they were talking about Obama, shucks..........", 
        "intTime": 20090411, 
        "postID": 4, 
        "quote": "", 
        "reply": "Wow, I thought they were talking about Obama, shucks..........", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-11 17:16:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by dman1948: Wow, I thought they were talking about Obama, shucks.......... Me too. I was certain this was going to be another birth certificate thread!", 
        "intTime": 20090411, 
        "postID": 5, 
        "quote": "Originally posted by dman1948: Wow, I thought they were talking about Obama, shucks..........", 
        "reply": " Me too. I was certain this was going to be another birth certificate thread!", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-11 18:51:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by shuman14: quote: Originally posted by dman1948: Wow, I thought they were talking about Obama, shucks.......... Me too. I was certain this was going to be another birth certificate thread! And if a million or so people demanded that Obama resign and we IMMMEDIATLEY hold a new election, what does that mean? Tearing up the Constitution? Who are these clowns in Georgia, who demand a new election because the poor babies don't like their President? I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution. Dave", 
        "intTime": 20090411, 
        "postID": 6, 
        "quote": "Originally posted by shuman14: quote: Originally posted by dman1948: Wow, I thought they were talking about Obama, shucks.......... Me too. I was certain this was going to be another birth certificate thread!", 
        "reply": " And if a million or so people demanded that Obama resign and we IMMMEDIATLEY hold a new election, what does that mean? Tearing up the Constitution? Who are these clowns in Georgia, who demand a new election because the poor babies don't like their President? I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution. Dave", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-11 18:55:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution. Dave 1 milion total, or in each mayor city? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090411, 
        "postID": 7, 
        "quote": "Originally posted by Grachus: I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution. Dave", 
        "reply": " 1 milion total, or in each mayor city? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-11 19:14:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution. I think you just described a Code Pink rally.", 
        "intTime": 20090411, 
        "postID": 8, 
        "quote": "I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution.", 
        "reply": " I think you just described a Code Pink rally.", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-11 19:15:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Grachus: I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution. Dave 1 milion total, or in each mayor city? This is the USA, and I have a right to demand that Mr. Bush be impeached. And others have the right to demand that Mr. Obama be impeached. I do NOT have the right to demand that the Constitution be suspended, and neither do these clowns in Georgia. Dave", 
        "intTime": 20090411, 
        "postID": 9, 
        "quote": "Originally posted by NSNN: quote: Originally posted by Grachus: I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution. Dave 1 milion total, or in each mayor city?", 
        "reply": " This is the USA, and I have a right to demand that Mr. Bush be impeached. And others have the right to demand that Mr. Obama be impeached. I do NOT have the right to demand that the Constitution be suspended, and neither do these clowns in Georgia. Dave", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-11 19:19:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: www.france24.com/en/20090409-georgia-tblisi-opposition-protests-saakashvili-russia-conflict Unless I'm mistaken the article was about Russia, as in USSR, not the USA. The country of Georgia, not the state! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090412, 
        "postID": 10, 
        "quote": "Originally posted by klassylady25: quote: www.france24.com/en/20090409-georgia-tblisi-opposition-protests-saakashvili-russia-conflict Unless I'm mistaken the article was about Russia, as in USSR, not the USA.", 
        "reply": " The country of Georgia, not the state! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 04:52:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution. Dave 1 milion total, or in each mayor city? This is the USA, and I have a right to demand that Mr. Bush be impeached. And others have the right to demand that Mr. Obama be impeached. I do NOT have the right to demand that the Constitution be suspended, and neither do these clowns in Georgia. Dave So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090412, 
        "postID": 11, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution. Dave 1 milion total, or in each mayor city? This is the USA, and I have a right to demand that Mr. Bush be impeached. And others have the right to demand that Mr. Obama be impeached. I do NOT have the right to demand that the Constitution be suspended, and neither do these clowns in Georgia. Dave", 
        "reply": " So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 04:56:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave", 
        "intTime": 20090412, 
        "postID": 12, 
        "quote": "Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave.", 
        "reply": " And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 08:14:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090412, 
        "postID": 13, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave", 
        "reply": " So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 08:56:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?! If the President \"Wants\" to resign because he was deeply hurt at my remarks () who am I to stop him. Your response is a non-sequitor... (Second, if the Southern States had the \"right to succeed,\" this would be no news to Lincoln. All they needed to do was get 3/4ths of the States to approve their succession; just as they needed 3/4's to get into the union. ) Did they even try this legal method? Did they try a Constitutional Convention? What they did, plain and simple, was to declare the Law is whatever we want it to be, WHEN we want it to be. Dave", 
        "intTime": 20090412, 
        "postID": 14, 
        "quote": "Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?!", 
        "reply": " If the President \"Wants\" to resign because he was deeply hurt at my remarks () who am I to stop him. Your response is a non-sequitor... (Second, if the Southern States had the \"right to succeed,\" this would be no news to Lincoln. All they needed to do was get 3/4ths of the States to approve their succession; just as they needed 3/4's to get into the union. ) Did they even try this legal method? Did they try a Constitutional Convention? What they did, plain and simple, was to declare the Law is whatever we want it to be, WHEN we want it to be. Dave", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 09:08:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?! If the President \"Wants\" to resign because he was deeply hurt at my remarks () who am I to stop him. Your response is a non-sequitor... Then what’s your issue? Those protestors in Georgia are asking for him to resign, not be fired. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090412, 
        "postID": 15, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?! If the President \"Wants\" to resign because he was deeply hurt at my remarks () who am I to stop him. Your response is a non-sequitor... Then what’s your issue? Those protestors in Georgia are asking for him to resign, not be fired.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 09:15:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?! If the President \"Wants\" to resign because he was deeply hurt at my remarks () who am I to stop him. Your response is a non-sequitor... Then what’s your issue? Those protestors in Georgia are asking for him to resign, not be fired. You posted the article not me. They are demanding that New Elections be held. Now the Georgia Constitution DOES have a presidential succession clause... So if Obama is hurt by my remarks and decides to resign, we get Biden, not a new election. Basically they are demanding the abrogation of their Constitution because they're unhappy with their President. You call this Democracy? Dave", 
        "intTime": 20090412, 
        "postID": 16, 
        "quote": "Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?! If the President \"Wants\" to resign because he was deeply hurt at my remarks () who am I to stop him. Your response is a non-sequitor... Then what’s your issue? Those protestors in Georgia are asking for him to resign, not be fired.", 
        "reply": " You posted the article not me. They are demanding that New Elections be held. Now the Georgia Constitution DOES have a presidential succession clause... So if Obama is hurt by my remarks and decides to resign, we get Biden, not a new election. Basically they are demanding the abrogation of their Constitution because they're unhappy with their President. You call this Democracy? Dave", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 09:21:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?! If the President \"Wants\" to resign because he was deeply hurt at my remarks () who am I to stop him. Your response is a non-sequitor... Then what’s your issue? Those protestors in Georgia are asking for him to resign, not be fired. You posted the article not me. They are demanding that New Elections be held. Now the Georgia Constitution DOES have a presidential succession clause... The article I posted mentions they are calling the Pres to resign, nothing on the new election. So if Obama is hurt by my remarks and decides to resign, we get Biden, not a new election. Basically they are demanding the abrogation of their Constitution because they're unhappy with their President. You call this Democracy? I call it the will of the Georgian people! Dave \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090412, 
        "postID": 17, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?! If the President \"Wants\" to resign because he was deeply hurt at my remarks () who am I to stop him. Your response is a non-sequitor... Then what’s your issue? Those protestors in Georgia are asking for him to resign, not be fired. You posted the article not me. They are demanding that New Elections be held. Now the Georgia Constitution DOES have a presidential succession clause... The article I posted mentions they are calling the Pres to resign, nothing on the new election. So if Obama is hurt by my remarks and decides to resign, we get Biden, not a new election. Basically they are demanding the abrogation of their Constitution because they're unhappy with their President. You call this Democracy? I call it the will of the Georgian people! Dave", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 09:34:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: [QUOTE]Originally posted by Grachus: So if Obama is hurt by my remarks and decides to resign, we get Biden, not a new election. Basically they are demanding the abrogation of their Constitution because they're unhappy with their President. You call this Democracy? [QUOTE]Originally posted by NSNN: I call it the will of the Georgian people! This is good news to the Anti-Obama crowd. All they have to do is organise a demonstration of a large enough size (let's say a million) and we will have new elections! Yay for the will of the people!!!! And if only I had known this when Mr. Bush was President, we could have gotten rid of him in 2003! Dave", 
        "intTime": 20090412, 
        "postID": 18, 
        "quote": "Originally posted by NSNN: [QUOTE]Originally posted by Grachus: So if Obama is hurt by my remarks and decides to resign, we get Biden, not a new election. Basically they are demanding the abrogation of their Constitution because they're unhappy with their President. You call this Democracy? [QUOTE]Originally posted by NSNN: I call it the will of the Georgian people!", 
        "reply": " This is good news to the Anti-Obama crowd. All they have to do is organise a demonstration of a large enough size (let's say a million) and we will have new elections! Yay for the will of the people!!!! And if only I had known this when Mr. Bush was President, we could have gotten rid of him in 2003! Dave", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 09:38:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Who are these clowns in Georgia, who demand a new election because the poor babies don't like their President? Probably the ones who are sick and tired of being thrown in prison because they peacefully protest along with the ones who suffered because their insane president decided to take on an opponent who he should have known would quickly crush him. The folks suffering through homelessness and lack of basic necessities in Georgia shouldn't blame Russia but the madman Saakashvili. Had he not foolishly decided to take on the bear with the illusion that the USA would come to his aid and defend him then the Georgian people wouldn't still be suffering the aftereffects of his failed war. S. Ossetia and Abkhazia never at any time belonged to the new Georgian state when the USSR was dissolved. These provinvces fought and beat the Georgian army and won their defacto independence. Not that it is right, but demonstrations and protests are a way of life and very common in Europe. look at France, Greece, Moldova and Ukraine. All have had demonstrations against ruthless or incompetent leaders. Another thing, Georgian president serves a term of 10 years and just maybe these people who now suffer because of Saakashvili's heavy handed and almost dicator like rule dont want to suffer another 4+ years of tyranny and madness.", 
        "intTime": 20090412, 
        "postID": 19, 
        "quote": "Who are these clowns in Georgia, who demand a new election because the poor babies don't like their President?", 
        "reply": " Probably the ones who are sick and tired of being thrown in prison because they peacefully protest along with the ones who suffered because their insane president decided to take on an opponent who he should have known would quickly crush him. The folks suffering through homelessness and lack of basic necessities in Georgia shouldn't blame Russia but the madman Saakashvili. Had he not foolishly decided to take on the bear with the illusion that the USA would come to his aid and defend him then the Georgian people wouldn't still be suffering the aftereffects of his failed war. S. Ossetia and Abkhazia never at any time belonged to the new Georgian state when the USSR was dissolved. These provinvces fought and beat the Georgian army and won their defacto independence. Not that it is right, but demonstrations and protests are a way of life and very common in Europe. look at France, Greece, Moldova and Ukraine. All have had demonstrations against ruthless or incompetent leaders. Another thing, Georgian president serves a term of 10 years and just maybe these people who now suffer because of Saakashvili's heavy handed and almost dicator like rule dont want to suffer another 4+ years of tyranny and madness.", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 10:17:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Tens of thousands took to the streets in Tbilisi, vowing to demonstrate daily until President Mikheil Saakashvili resigns. The opposition accuses him of mishandling Georgia's August 2008 military conflict with Russia. +http://www.france24.com/en/20090409-georgia-tblisi-opposition-protests-saakashvili-russia-conflict This message has been edited. Last edited by: NSNN, Sun 12 April 2009 04:57 AM \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090410, 
        "postID": 20, 
        "quote": "Tens of thousands took to the streets in Tbilisi, vowing to demonstrate daily until President Mikheil Saakashvili resigns. The opposition accuses him of mishandling Georgia's August 2008 military conflict with Russia.", 
        "reply": " +http://www.france24.com/en/20090409-georgia-tblisi-opposition-protests-saakashvili-russia-conflict This message has been edited. Last edited by: NSNN, Sun 12 April 2009 04:57 AM \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-10 12:31:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: [QUOTE] Tens of thousands took to the streets in Tbilisi, vowing to demonstrate daily until President Mikheil Saakashvili resigns. The opposition accuses him of mishandling Georgia's August 2008 military conflict with Russia. Better headline would be, \"Tens of thousands call for ending Georgias Constitution\" Gosh, they don't like their President? Can't wait for the next election? Tsk, tsk... Dave", 
        "intTime": 20090410, 
        "postID": 21, 
        "quote": "Originally posted by NSNN: [QUOTE] Tens of thousands took to the streets in Tbilisi, vowing to demonstrate daily until President Mikheil Saakashvili resigns. The opposition accuses him of mishandling Georgia's August 2008 military conflict with Russia.", 
        "reply": " Better headline would be, \"Tens of thousands call for ending Georgias Constitution\" Gosh, they don't like their President? Can't wait for the next election? Tsk, tsk... Dave", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-10 12:36:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "Grachus"
    }, 
    {
        "content": "The only way to get thousands to turn out in Georgia is to hold a NASCAR race. Wrong Georgia.. Me, i'm not much concerned with what's going on in Stalin's birthplace. Now if there's a proovable threat to the national security of the USA...", 
        "intTime": 20090410, 
        "postID": 22, 
        "quote": "", 
        "reply": "The only way to get thousands to turn out in Georgia is to hold a NASCAR race. Wrong Georgia.. Me, i'm not much concerned with what's going on in Stalin's birthplace. Now if there's a proovable threat to the national security of the USA...", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-10 16:06:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "scooter_mech"
    }, 
    {
        "content": "Wow, I thought they were talking about Obama, shucks..........", 
        "intTime": 20090411, 
        "postID": 23, 
        "quote": "", 
        "reply": "Wow, I thought they were talking about Obama, shucks..........", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-11 17:16:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by dman1948: Wow, I thought they were talking about Obama, shucks.......... Me too. I was certain this was going to be another birth certificate thread!", 
        "intTime": 20090411, 
        "postID": 24, 
        "quote": "Originally posted by dman1948: Wow, I thought they were talking about Obama, shucks..........", 
        "reply": " Me too. I was certain this was going to be another birth certificate thread!", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-11 18:51:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by shuman14: quote: Originally posted by dman1948: Wow, I thought they were talking about Obama, shucks.......... Me too. I was certain this was going to be another birth certificate thread! And if a million or so people demanded that Obama resign and we IMMMEDIATLEY hold a new election, what does that mean? Tearing up the Constitution? Who are these clowns in Georgia, who demand a new election because the poor babies don't like their President? I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution. Dave", 
        "intTime": 20090411, 
        "postID": 25, 
        "quote": "Originally posted by shuman14: quote: Originally posted by dman1948: Wow, I thought they were talking about Obama, shucks.......... Me too. I was certain this was going to be another birth certificate thread!", 
        "reply": " And if a million or so people demanded that Obama resign and we IMMMEDIATLEY hold a new election, what does that mean? Tearing up the Constitution? Who are these clowns in Georgia, who demand a new election because the poor babies don't like their President? I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution. Dave", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-11 18:55:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution. Dave 1 milion total, or in each mayor city? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090411, 
        "postID": 26, 
        "quote": "Originally posted by Grachus: I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution. Dave", 
        "reply": " 1 milion total, or in each mayor city? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-11 19:14:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution. I think you just described a Code Pink rally.", 
        "intTime": 20090411, 
        "postID": 27, 
        "quote": "I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution.", 
        "reply": " I think you just described a Code Pink rally.", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-11 19:15:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Grachus: I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution. Dave 1 milion total, or in each mayor city? This is the USA, and I have a right to demand that Mr. Bush be impeached. And others have the right to demand that Mr. Obama be impeached. I do NOT have the right to demand that the Constitution be suspended, and neither do these clowns in Georgia. Dave", 
        "intTime": 20090411, 
        "postID": 28, 
        "quote": "Originally posted by NSNN: quote: Originally posted by Grachus: I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution. Dave 1 milion total, or in each mayor city?", 
        "reply": " This is the USA, and I have a right to demand that Mr. Bush be impeached. And others have the right to demand that Mr. Obama be impeached. I do NOT have the right to demand that the Constitution be suspended, and neither do these clowns in Georgia. Dave", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-11 19:19:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: quote: www.france24.com/en/20090409-georgia-tblisi-opposition-protests-saakashvili-russia-conflict Unless I'm mistaken the article was about Russia, as in USSR, not the USA. The country of Georgia, not the state! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090412, 
        "postID": 29, 
        "quote": "Originally posted by klassylady25: quote: www.france24.com/en/20090409-georgia-tblisi-opposition-protests-saakashvili-russia-conflict Unless I'm mistaken the article was about Russia, as in USSR, not the USA.", 
        "reply": " The country of Georgia, not the state! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 04:52:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution. Dave 1 milion total, or in each mayor city? This is the USA, and I have a right to demand that Mr. Bush be impeached. And others have the right to demand that Mr. Obama be impeached. I do NOT have the right to demand that the Constitution be suspended, and neither do these clowns in Georgia. Dave So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090412, 
        "postID": 30, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: I didn't like Mr. Bush, and if a million Americans held a demonstration demanding his resignation - What does that mean? It means they haven't read the Constitution. Dave 1 milion total, or in each mayor city? This is the USA, and I have a right to demand that Mr. Bush be impeached. And others have the right to demand that Mr. Obama be impeached. I do NOT have the right to demand that the Constitution be suspended, and neither do these clowns in Georgia. Dave", 
        "reply": " So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 04:56:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave", 
        "intTime": 20090412, 
        "postID": 31, 
        "quote": "Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave.", 
        "reply": " And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 08:14:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090412, 
        "postID": 32, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave", 
        "reply": " So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 08:56:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?! If the President \"Wants\" to resign because he was deeply hurt at my remarks () who am I to stop him. Your response is a non-sequitor... (Second, if the Southern States had the \"right to succeed,\" this would be no news to Lincoln. All they needed to do was get 3/4ths of the States to approve their succession; just as they needed 3/4's to get into the union. ) Did they even try this legal method? Did they try a Constitutional Convention? What they did, plain and simple, was to declare the Law is whatever we want it to be, WHEN we want it to be. Dave", 
        "intTime": 20090412, 
        "postID": 33, 
        "quote": "Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?!", 
        "reply": " If the President \"Wants\" to resign because he was deeply hurt at my remarks () who am I to stop him. Your response is a non-sequitor... (Second, if the Southern States had the \"right to succeed,\" this would be no news to Lincoln. All they needed to do was get 3/4ths of the States to approve their succession; just as they needed 3/4's to get into the union. ) Did they even try this legal method? Did they try a Constitutional Convention? What they did, plain and simple, was to declare the Law is whatever we want it to be, WHEN we want it to be. Dave", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 09:08:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?! If the President \"Wants\" to resign because he was deeply hurt at my remarks () who am I to stop him. Your response is a non-sequitor... Then what’s your issue? Those protestors in Georgia are asking for him to resign, not be fired. \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090412, 
        "postID": 34, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?! If the President \"Wants\" to resign because he was deeply hurt at my remarks () who am I to stop him. Your response is a non-sequitor... Then what’s your issue? Those protestors in Georgia are asking for him to resign, not be fired.", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 09:15:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?! If the President \"Wants\" to resign because he was deeply hurt at my remarks () who am I to stop him. Your response is a non-sequitor... Then what’s your issue? Those protestors in Georgia are asking for him to resign, not be fired. You posted the article not me. They are demanding that New Elections be held. Now the Georgia Constitution DOES have a presidential succession clause... So if Obama is hurt by my remarks and decides to resign, we get Biden, not a new election. Basically they are demanding the abrogation of their Constitution because they're unhappy with their President. You call this Democracy? Dave", 
        "intTime": 20090412, 
        "postID": 35, 
        "quote": "Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?! If the President \"Wants\" to resign because he was deeply hurt at my remarks () who am I to stop him. Your response is a non-sequitor... Then what’s your issue? Those protestors in Georgia are asking for him to resign, not be fired.", 
        "reply": " You posted the article not me. They are demanding that New Elections be held. Now the Georgia Constitution DOES have a presidential succession clause... So if Obama is hurt by my remarks and decides to resign, we get Biden, not a new election. Basically they are demanding the abrogation of their Constitution because they're unhappy with their President. You call this Democracy? Dave", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 09:21:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?! If the President \"Wants\" to resign because he was deeply hurt at my remarks () who am I to stop him. Your response is a non-sequitor... Then what’s your issue? Those protestors in Georgia are asking for him to resign, not be fired. You posted the article not me. They are demanding that New Elections be held. Now the Georgia Constitution DOES have a presidential succession clause... The article I posted mentions they are calling the Pres to resign, nothing on the new election. So if Obama is hurt by my remarks and decides to resign, we get Biden, not a new election. Basically they are demanding the abrogation of their Constitution because they're unhappy with their President. You call this Democracy? I call it the will of the Georgian people! Dave \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090412, 
        "postID": 36, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by Grachus: quote: Originally posted by NSNN: So let’s say 150 million people take to the streets and demand that the president resigns, and we have a new election; which happens around the world somewhat frequently; what should he do? Ignore them entirely? Your bias is showing Dave. And? The Southern States demanded that Lincohn not be innaugerated or they would succeed. Southern states had the legal right to succeed back then, not anymore though! Either you have a Constitution or you don't. Either you have the rule of Law or you don't. I had no use for Mr. Bush, in fact I wanted him legally removed by the process of impeachment. I would have defended him to the death if it meant sacrificing the Constitution to get rid of him. Dave So impeaching the President is OK, but if he personally resigns due do the fact that he is/was a dismal failure, he’s breaking the constitution?! If the President \"Wants\" to resign because he was deeply hurt at my remarks () who am I to stop him. Your response is a non-sequitor... Then what’s your issue? Those protestors in Georgia are asking for him to resign, not be fired. You posted the article not me. They are demanding that New Elections be held. Now the Georgia Constitution DOES have a presidential succession clause... The article I posted mentions they are calling the Pres to resign, nothing on the new election. So if Obama is hurt by my remarks and decides to resign, we get Biden, not a new election. Basically they are demanding the abrogation of their Constitution because they're unhappy with their President. You call this Democracy? I call it the will of the Georgian people! Dave", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 09:34:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: [QUOTE]Originally posted by Grachus: So if Obama is hurt by my remarks and decides to resign, we get Biden, not a new election. Basically they are demanding the abrogation of their Constitution because they're unhappy with their President. You call this Democracy? [QUOTE]Originally posted by NSNN: I call it the will of the Georgian people! This is good news to the Anti-Obama crowd. All they have to do is organise a demonstration of a large enough size (let's say a million) and we will have new elections! Yay for the will of the people!!!! And if only I had known this when Mr. Bush was President, we could have gotten rid of him in 2003! Dave", 
        "intTime": 20090412, 
        "postID": 37, 
        "quote": "Originally posted by NSNN: [QUOTE]Originally posted by Grachus: So if Obama is hurt by my remarks and decides to resign, we get Biden, not a new election. Basically they are demanding the abrogation of their Constitution because they're unhappy with their President. You call this Democracy? [QUOTE]Originally posted by NSNN: I call it the will of the Georgian people!", 
        "reply": " This is good news to the Anti-Obama crowd. All they have to do is organise a demonstration of a large enough size (let's say a million) and we will have new elections! Yay for the will of the people!!!! And if only I had known this when Mr. Bush was President, we could have gotten rid of him in 2003! Dave", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 09:38:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Who are these clowns in Georgia, who demand a new election because the poor babies don't like their President? Probably the ones who are sick and tired of being thrown in prison because they peacefully protest along with the ones who suffered because their insane president decided to take on an opponent who he should have known would quickly crush him. The folks suffering through homelessness and lack of basic necessities in Georgia shouldn't blame Russia but the madman Saakashvili. Had he not foolishly decided to take on the bear with the illusion that the USA would come to his aid and defend him then the Georgian people wouldn't still be suffering the aftereffects of his failed war. S. Ossetia and Abkhazia never at any time belonged to the new Georgian state when the USSR was dissolved. These provinvces fought and beat the Georgian army and won their defacto independence. Not that it is right, but demonstrations and protests are a way of life and very common in Europe. look at France, Greece, Moldova and Ukraine. All have had demonstrations against ruthless or incompetent leaders. Another thing, Georgian president serves a term of 10 years and just maybe these people who now suffer because of Saakashvili's heavy handed and almost dicator like rule dont want to suffer another 4+ years of tyranny and madness.", 
        "intTime": 20090412, 
        "postID": 38, 
        "quote": "Who are these clowns in Georgia, who demand a new election because the poor babies don't like their President?", 
        "reply": " Probably the ones who are sick and tired of being thrown in prison because they peacefully protest along with the ones who suffered because their insane president decided to take on an opponent who he should have known would quickly crush him. The folks suffering through homelessness and lack of basic necessities in Georgia shouldn't blame Russia but the madman Saakashvili. Had he not foolishly decided to take on the bear with the illusion that the USA would come to his aid and defend him then the Georgian people wouldn't still be suffering the aftereffects of his failed war. S. Ossetia and Abkhazia never at any time belonged to the new Georgian state when the USSR was dissolved. These provinvces fought and beat the Georgian army and won their defacto independence. Not that it is right, but demonstrations and protests are a way of life and very common in Europe. look at France, Greece, Moldova and Ukraine. All have had demonstrations against ruthless or incompetent leaders. Another thing, Georgian president serves a term of 10 years and just maybe these people who now suffer because of Saakashvili's heavy handed and almost dicator like rule dont want to suffer another 4+ years of tyranny and madness.", 
        "threadID": "672198221_6350073022001", 
        "time": "2009-04-12 10:17:00", 
        "title": "Georgia (Country) - Tens of thousands call for president to resign", 
        "userID": "FlankerFlyer"
    }
]