[
    {
        "content": "quote: Brazilians had something extra to celebrate at carnival this year — the relative health of the country’s financial system. While investors have fled emerging markets, Brazilian banks have held up nicely compared with rivals in the United States and Europe. They might even be able to lend a hand, Breakingviews says. Chief among the revelers is Banco Itaú. Fresh from its merger with Unibanco, the São Paulo-based bank has emerged as the biggest bank south of the Mexican border. The market value of its parent, at just around $28 billion, is nearly equal to the combined worth of Citigroup and Bank of America, the publication notes. That doesn’t mean Itaú should buy a United States bank, Breakingviews says. But it puts it in pole position to fulfill its ambitions to become a regional powerhouse, it says. In recent years it acquired banks and opened branches in countries including Argentina, Uruguay and Chile. It also bought the Latin assets of Bank of Boston in a deal that gave that bank, later acquired by Bank of America, a stake in Itaú. But its merger with a domestic rival, Unibanco, approved by regulators last month, has made it a more formidable force, rivaling not just regional players but also the Spanish banks, the publication says. These financial conquistadors, led by Santander, have tried to create pan-Latin franchises but struggled to make much headway in Brazil, Breakingviews says. ...... +http://dealbook.blogs.nytimes.com/2009/03/05/citi-should-talk-to-brazils-itau/", 
        "intTime": 20090305, 
        "postID": 1, 
        "quote": "Brazilians had something extra to celebrate at carnival this year — the relative health of the country’s financial system. While investors have fled emerging markets, Brazilian banks have held up nicely compared with rivals in the United States and Europe. They might even be able to lend a hand, Breakingviews says. Chief among the revelers is Banco Itaú. Fresh from its merger with Unibanco, the São Paulo-based bank has emerged as the biggest bank south of the Mexican border. The market value of its parent, at just around $28 billion, is nearly equal to the combined worth of Citigroup and Bank of America, the publication notes. That doesn’t mean Itaú should buy a United States bank, Breakingviews says. But it puts it in pole position to fulfill its ambitions to become a regional powerhouse, it says. In recent years it acquired banks and opened branches in countries including Argentina, Uruguay and Chile. It also bought the Latin assets of Bank of Boston in a deal that gave that bank, later acquired by Bank of America, a stake in Itaú. But its merger with a domestic rival, Unibanco, approved by regulators last month, has made it a more formidable force, rivaling not just regional players but also the Spanish banks, the publication says. These financial conquistadors, led by Santander, have tried to create pan-Latin franchises but struggled to make much headway in Brazil, Breakingviews says. ......", 
        "reply": " +http://dealbook.blogs.nytimes.com/2009/03/05/citi-should-talk-to-brazils-itau/", 
        "threadID": "672198221_4300000712001", 
        "time": "2009-03-05 09:47:00", 
        "title": "Citi Should Talk to Brazil’s Itaú", 
        "userID": "Knele"
    }
]