[
    {
        "content": "Transcript of the handwritten letter on Offical White House stationary. Sandy - Thanks for the wonderful and thoughful letter. It is because of outstanding Americans like you that I committed to changing our current policy. Although it will take some time to complete (partly becasu it needs Congressional action) I intend to fulfill my commitment! Signature Is this change we can believe in? If BHO is the CiNC, why does Congress need to take action. Why not just sign an executive order like Truman did in '48 for desegegation? From link: thinkprogress.org/2009/05/08/obama-dont-ask-dont-tell/", 
        "intTime": 20090511, 
        "postID": 1, 
        "quote": "", 
        "reply": "Transcript of the handwritten letter on Offical White House stationary. Sandy - Thanks for the wonderful and thoughful letter. It is because of outstanding Americans like you that I committed to changing our current policy. Although it will take some time to complete (partly becasu it needs Congressional action) I intend to fulfill my commitment! Signature Is this change we can believe in? If BHO is the CiNC, why does Congress need to take action. Why not just sign an executive order like Truman did in '48 for desegegation? From link: thinkprogress.org/2009/05/08/obama-dont-ask-dont-tell/", 
        "threadID": "672198221_5040010322001", 
        "time": "2009-05-11 04:34:00", 
        "title": "The POTUS, BHO, writes personal letter to Army Officer over DADT", 
        "userID": "wharthog"
    }, 
    {
        "content": "quote: Why not just sign an executive order like Truman did in '48 for desegegation? Because DADT is Federal Law.", 
        "intTime": 20090511, 
        "postID": 2, 
        "quote": "Why not just sign an executive order like Truman did in '48 for desegegation?", 
        "reply": " Because DADT is Federal Law.", 
        "threadID": "672198221_5040010322001", 
        "time": "2009-05-11 04:42:00", 
        "title": "The POTUS, BHO, writes personal letter to Army Officer over DADT", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Why not just sign an executive order like Truman did in '48 for desegegation? Because DADT is Federal Law. Actually, from all I've read, an Executive Order is a possibility, but it is not being sought as the answer to lifting DADT because it could be reversed by another President. \"http://www.palmcenter.org/press/dadt/in_print/Room+for+Debate\"", 
        "intTime": 20090511, 
        "postID": 3, 
        "quote": "Originally posted by karlhungusjr: quote: Why not just sign an executive order like Truman did in '48 for desegegation? Because DADT is Federal Law.", 
        "reply": " Actually, from all I've read, an Executive Order is a possibility, but it is not being sought as the answer to lifting DADT because it could be reversed by another President. \"http://www.palmcenter.org/press/dadt/in_print/Room+for+Debate\"", 
        "threadID": "672198221_5040010322001", 
        "time": "2009-05-11 05:58:00", 
        "title": "The POTUS, BHO, writes personal letter to Army Officer over DADT", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by wharthog: Transcript of the handwritten letter on Offical White House stationary. Sandy - Thanks for the wonderful and thoughful letter. It is because of outstanding Americans like you that I committed to changing our current policy. Although it will take some time to complete (partly becasu it needs Congressional action) I intend to fulfill my commitment! Signature Is this change we can believe in? If BHO is the CiNC, why does Congress need to take action. Why not just sign an executive order like Truman did in '48 for desegegation? From link: thinkprogress.org/2009/05/08/obama-dont-ask-dont-tell/ I love seeing all these futile \"change\" attempts at trying to slam Obama for something on the board. Particularly this one he did not implement nor can change on his own. I wouldn't either. This is too big of an issue to not get it changed in the politically correct way through congress and the American people. Not everyone wants it done away with. Unlike the opposition would like to believe.", 
        "intTime": 20090511, 
        "postID": 4, 
        "quote": "Originally posted by wharthog: Transcript of the handwritten letter on Offical White House stationary. Sandy - Thanks for the wonderful and thoughful letter. It is because of outstanding Americans like you that I committed to changing our current policy. Although it will take some time to complete (partly becasu it needs Congressional action) I intend to fulfill my commitment! Signature Is this change we can believe in? If BHO is the CiNC, why does Congress need to take action. Why not just sign an executive order like Truman did in '48 for desegegation? From link: thinkprogress.org/2009/05/08/obama-dont-ask-dont-tell/", 
        "reply": " I love seeing all these futile \"change\" attempts at trying to slam Obama for something on the board. Particularly this one he did not implement nor can change on his own. I wouldn't either. This is too big of an issue to not get it changed in the politically correct way through congress and the American people. Not everyone wants it done away with. Unlike the opposition would like to believe.", 
        "threadID": "672198221_5040010322001", 
        "time": "2009-05-11 07:52:00", 
        "title": "The POTUS, BHO, writes personal letter to Army Officer over DADT", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: from all I've read, an Executive Order is a possibility I'm not comfortable with that at all. If it's a federal law then congress needs to change it. I just don't like Executive Orders being used to go around congress. They have their place, but not in a case like this.", 
        "intTime": 20090511, 
        "postID": 5, 
        "quote": "from all I've read, an Executive Order is a possibility", 
        "reply": " I'm not comfortable with that at all. If it's a federal law then congress needs to change it. I just don't like Executive Orders being used to go around congress. They have their place, but not in a case like this.", 
        "threadID": "672198221_5040010322001", 
        "time": "2009-05-11 21:22:00", 
        "title": "The POTUS, BHO, writes personal letter to Army Officer over DADT", 
        "userID": "karlhungusjr"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: from all I've read, an Executive Order is a possibility I'm not comfortable with that at all. If it's a federal law then congress needs to change it. I just don't like Executive Orders being used to go around congress. They have their place, but not in a case like this. And yet it is exactly how the military was desegregated. (by Executive Order)", 
        "intTime": 20090512, 
        "postID": 6, 
        "quote": "Originally posted by karlhungusjr: quote: from all I've read, an Executive Order is a possibility I'm not comfortable with that at all. If it's a federal law then congress needs to change it. I just don't like Executive Orders being used to go around congress. They have their place, but not in a case like this.", 
        "reply": " And yet it is exactly how the military was desegregated. (by Executive Order)", 
        "threadID": "672198221_5040010322001", 
        "time": "2009-05-12 05:39:00", 
        "title": "The POTUS, BHO, writes personal letter to Army Officer over DADT", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by klassylady25: So if Obama wanted to segregate the military again he could? Dunno...maybe? I don't know if the Federal anti-discrimination laws would come into play or not.", 
        "intTime": 20090512, 
        "postID": 7, 
        "quote": "Originally posted by klassylady25: So if Obama wanted to segregate the military again he could?", 
        "reply": " Dunno...maybe? I don't know if the Federal anti-discrimination laws would come into play or not.", 
        "threadID": "672198221_5040010322001", 
        "time": "2009-05-12 06:17:00", 
        "title": "The POTUS, BHO, writes personal letter to Army Officer over DADT", 
        "userID": "SeaWitch1220"
    }, 
    {
        "content": "quote: Originally posted by karlhungusjr: quote: from all I've read, an Executive Order is a possibility I'm not comfortable with that at all. If it's a federal law then congress needs to change it. I just don't like Executive Orders being used to go around congress. They have their place, but not in a case like this. I agree with this sentiment, and perhaps it is one of the reasons that the prospect of an EO is not seriously discussed. It would be disingenuous to lambast the former President for his signing statements while simultaneously ignoring federal law by issuing a contradictory Executive Order. One thing that bothers me is the kid glove treatment of this issue. Everyone brings up what happened to President Clinton when he approached the issue, but no one looks at the cause for his failure - Senator Nunn. It was a personal contest of wills between Senator Nunn, who was mad at having his intended bid for the presidency unseated before it began by this upstart Clinton guy, and Clinton, a newcomer to Washington who badly fumbled the public relations war that consumed the Senate. Where is the prominent Democrat committee chairman that has the motivation and the power to derail President Obama's push on this issue? Doesn't exist. He would succeed with a surprisingly low level of fuss if he would just do it. We'd wind up with a few op eds and angry commercials, and then it would be done with, and the military - and the country - would be better (and safer) for it.", 
        "intTime": 20090512, 
        "postID": 8, 
        "quote": "Originally posted by karlhungusjr: quote: from all I've read, an Executive Order is a possibility I'm not comfortable with that at all. If it's a federal law then congress needs to change it. I just don't like Executive Orders being used to go around congress. They have their place, but not in a case like this.", 
        "reply": " I agree with this sentiment, and perhaps it is one of the reasons that the prospect of an EO is not seriously discussed. It would be disingenuous to lambast the former President for his signing statements while simultaneously ignoring federal law by issuing a contradictory Executive Order. One thing that bothers me is the kid glove treatment of this issue. Everyone brings up what happened to President Clinton when he approached the issue, but no one looks at the cause for his failure - Senator Nunn. It was a personal contest of wills between Senator Nunn, who was mad at having his intended bid for the presidency unseated before it began by this upstart Clinton guy, and Clinton, a newcomer to Washington who badly fumbled the public relations war that consumed the Senate. Where is the prominent Democrat committee chairman that has the motivation and the power to derail President Obama's push on this issue? Doesn't exist. He would succeed with a surprisingly low level of fuss if he would just do it. We'd wind up with a few op eds and angry commercials, and then it would be done with, and the military - and the country - would be better (and safer) for it.", 
        "threadID": "672198221_5040010322001", 
        "time": "2009-05-12 23:22:00", 
        "title": "The POTUS, BHO, writes personal letter to Army Officer over DADT", 
        "userID": "Bleah"
    }, 
    {
        "content": "quote: And yet it is exactly how the military was desegregated. (by Executive Order) But my understanding is that segregation in the military wasn't federal law at the time. I could easily be wrong on that though.", 
        "intTime": 20090513, 
        "postID": 9, 
        "quote": "And yet it is exactly how the military was desegregated. (by Executive Order)", 
        "reply": " But my understanding is that segregation in the military wasn't federal law at the time. I could easily be wrong on that though.", 
        "threadID": "672198221_5040010322001", 
        "time": "2009-05-13 21:21:00", 
        "title": "The POTUS, BHO, writes personal letter to Army Officer over DADT", 
        "userID": "karlhungusjr"
    }
]