[
    {
        "content": "\"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94153\" \"The man reportedly was carrying an Al-Jazeera television identity card.\" Could have well been a FOX News card.",
        "intTime": 20090407,
        "postID": 1,
        "quote": "",
        "reply": "\"http://www.worldnetdaily.com/index.php?fa=PAGE.view&pageId=94153\" \"The man reportedly was carrying an Al-Jazeera television identity card.\" Could have well been a FOX News card.",
        "threadID": "672198221_9410001022001",
        "time": "2009-04-07 14:19:00",
        "title": "'Obama assassination plot halted'",
        "userID": "crackerjacks61"
    },
    {
        "content": "quote: Barack Obama ended his first oversees trip as president Tuesday, as Turkey downplayed reports that he was the target of an assassination plot. Turkish police arrested a suspect Friday after receiving an e-mail tip claiming that the man, a Turkish national, was plotting to kill Obama during his visit. The tip was later ruled a hoax and the man was released. \"There was no threat to Obama's life,\" a Turkish official told the Associated Press. \"But the police naturally took such a tip seriously.\" \"http://www.nydailynews.com/news/politics/2009/04/07/2009-04-07_president_barack_obama_ends_turkish_visi-1.html\" Wasted thread.",
        "intTime": 20090407,
        "postID": 2,
        "quote": "Barack Obama ended his first oversees trip as president Tuesday, as Turkey downplayed reports that he was the target of an assassination plot. Turkish police arrested a suspect Friday after receiving an e-mail tip claiming that the man, a Turkish national, was plotting to kill Obama during his visit. The tip was later ruled a hoax and the man was released. \"There was no threat to Obama's life,\" a Turkish official told the Associated Press. \"But the police naturally took such a tip seriously.\" \"http://www.nydailynews.com/news/politics/2009/04/07/2009-04-07_president_barack_obama_ends_turkish_visi-1.html\"",
        "reply": " Wasted thread.",
        "threadID": "672198221_9410001022001",
        "time": "2009-04-07 14:30:00",
        "title": "'Obama assassination plot halted'",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "quote: Could have well been a FOX News card. What a stupid and extraneous comment. Glad it reflects on you and not me.",
        "intTime": 20090407,
        "postID": 3,
        "quote": "Could have well been a FOX News card.",
        "reply": " What a stupid and extraneous comment. Glad it reflects on you and not me.",
        "threadID": "672198221_9410001022001",
        "time": "2009-04-07 14:32:00",
        "title": "'Obama assassination plot halted'",
        "userID": "I_M_Qwerty"
    },
    {
        "content": "quote: Originally posted by I_M_Qwerty: quote: Could have well been a FOX News card. What a stupid and extraneous comment. Glad it reflects on you and not me. Laugh...I knew I would get a reaction from you IM.",
        "intTime": 20090407,
        "postID": 4,
        "quote": "Originally posted by I_M_Qwerty: quote: Could have well been a FOX News card. What a stupid and extraneous comment. Glad it reflects on you and not me.",
        "reply": " Laugh...I knew I would get a reaction from you IM.",
        "threadID": "672198221_9410001022001",
        "time": "2009-04-07 15:09:00",
        "title": "'Obama assassination plot halted'",
        "userID": "crackerjacks61"
    }
]