[
    {
        "content": "'The Exodus': Latinos Leaving NC In Droves As Incomes Drop, More Latinos Head Home WINSTON-SALEM -- Adios North Carolina. It's what local Latinos are calling \"The Exodus,\" as the housing crisis is forcing thousands to return to their homes south of the border. Fourteen buses each week bound for Mexico City leave from the Winston-Salem bus depot, but for many of the passengers on board, the ticket is one way only. Full article at > >http://www.wxii12.com/money/19067810/detail.html The recession seems to have a few up sides.", 
        "intTime": 20090401, 
        "postID": 1, 
        "quote": "", 
        "reply": "'The Exodus': Latinos Leaving NC In Droves As Incomes Drop, More Latinos Head Home WINSTON-SALEM -- Adios North Carolina. It's what local Latinos are calling \"The Exodus,\" as the housing crisis is forcing thousands to return to their homes south of the border. Fourteen buses each week bound for Mexico City leave from the Winston-Salem bus depot, but for many of the passengers on board, the ticket is one way only. Full article at > >http://www.wxii12.com/money/19067810/detail.html The recession seems to have a few up sides.", 
        "threadID": "672198221_4420095912001", 
        "time": "2009-04-01 19:42:00", 
        "title": "'The Exodus': Latinos Leaving NC In Droves", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "now thats what I call good news if they are Illegals", 
        "intTime": 20090401, 
        "postID": 2, 
        "quote": "", 
        "reply": "now thats what I call good news if they are Illegals", 
        "threadID": "672198221_4420095912001", 
        "time": "2009-04-01 21:26:00", 
        "title": "'The Exodus': Latinos Leaving NC In Droves", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: now thats what I call good news if they are Illegals Yeeeehaaaaaaw!!! Ive always said if you remove the economic incentive for the illegals they will self deport. No jobs, no free government housing, medical and food stamps and they will leave in droves. Excellent news, hope it continues.", 
        "intTime": 20090401, 
        "postID": 3, 
        "quote": "Originally posted by LineDoggie: now thats what I call good news if they are Illegals", 
        "reply": " Yeeeehaaaaaaw!!! Ive always said if you remove the economic incentive for the illegals they will self deport. No jobs, no free government housing, medical and food stamps and they will leave in droves. Excellent news, hope it continues.", 
        "threadID": "672198221_4420095912001", 
        "time": "2009-04-01 22:09:00", 
        "title": "'The Exodus': Latinos Leaving NC In Droves", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Looks like we here in NC will have to go to South Carolina now for good workers.", 
        "intTime": 20090402, 
        "postID": 4, 
        "quote": "", 
        "reply": "Looks like we here in NC will have to go to South Carolina now for good workers.", 
        "threadID": "672198221_4420095912001", 
        "time": "2009-04-02 01:49:00", 
        "title": "'The Exodus': Latinos Leaving NC In Droves", 
        "userID": "Duster6"
    }, 
    {
        "content": "quote: Originally posted by Duster6: Looks like we here in NC will have to go to South Carolina now for good workers. The illegals left here too. Walmart's are practically empty. Buh Bye, I hope the door hits you in the azz. But wait I thought they just wanted to be US citizens and loved this country? Why are they leaving after their under the table job dried up?", 
        "intTime": 20090402, 
        "postID": 5, 
        "quote": "Originally posted by Duster6: Looks like we here in NC will have to go to South Carolina now for good workers.", 
        "reply": " The illegals left here too. Walmart's are practically empty. Buh Bye, I hope the door hits you in the azz. But wait I thought they just wanted to be US citizens and loved this country? Why are they leaving after their under the table job dried up?", 
        "threadID": "672198221_4420095912001", 
        "time": "2009-04-02 05:40:00", 
        "title": "'The Exodus': Latinos Leaving NC In Droves", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "well.. good bye.. that is what happens when immigration laws are enforced. work dries up and they have no incentive. \"thank you for your work, but we have no use for you anymore. you may go home now.\" i am glad to see them leaving on their own accord. i really am...", 
        "intTime": 20090402, 
        "postID": 6, 
        "quote": "", 
        "reply": "well.. good bye.. that is what happens when immigration laws are enforced. work dries up and they have no incentive. \"thank you for your work, but we have no use for you anymore. you may go home now.\" i am glad to see them leaving on their own accord. i really am...", 
        "threadID": "672198221_4420095912001", 
        "time": "2009-04-02 09:28:00", 
        "title": "'The Exodus': Latinos Leaving NC In Droves", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: quote: Originally posted by Duster6: Looks like we here in NC will have to go to South Carolina now for good workers. The illegals left here too. Walmart's are practically empty. Buh Bye, I hope the door hits you in the azz. But wait I thought they just wanted to be US citizens and loved this country? Why are they leaving after their under the table job dried up? classy.. real classy", 
        "intTime": 20090402, 
        "postID": 7, 
        "quote": "Originally posted by GunnyRet03: quote: Originally posted by Duster6: Looks like we here in NC will have to go to South Carolina now for good workers. The illegals left here too. Walmart's are practically empty. Buh Bye, I hope the door hits you in the azz. But wait I thought they just wanted to be US citizens and loved this country? Why are they leaving after their under the table job dried up?", 
        "reply": " classy.. real classy", 
        "threadID": "672198221_4420095912001", 
        "time": "2009-04-02 09:29:00", 
        "title": "'The Exodus': Latinos Leaving NC In Droves", 
        "userID": "Elesso"
    }, 
    {
        "content": "quote: The recession seems to have a few up sides.", 
        "intTime": 20090402, 
        "postID": 8, 
        "quote": "The recession seems to have a few up sides.", 
        "reply": "", 
        "threadID": "672198221_4420095912001", 
        "time": "2009-04-02 09:34:00", 
        "title": "'The Exodus': Latinos Leaving NC In Droves", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Some much for the arguement on how the illegals contribute to our economy quote: \"They come and talk to me and say we go to back to Mexico,\" Quadra said. \"When you do not have any more opportunities for you for improving your life, for sending money back to Mexico, you begin to wonder.\" Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090402, 
        "postID": 9, 
        "quote": "\"They come and talk to me and say we go to back to Mexico,\" Quadra said. \"When you do not have any more opportunities for you for improving your life, for sending money back to Mexico, you begin to wonder.\"", 
        "reply": "Some much for the arguement on how the illegals contribute to our economy  Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4420095912001", 
        "time": "2009-04-02 10:04:00", 
        "title": "'The Exodus': Latinos Leaving NC In Droves", 
        "userID": "L0A1"
    }, 
    {
        "content": "anyone know how many of these people were illegal and how many had green cards?", 
        "intTime": 20090402, 
        "postID": 10, 
        "quote": "", 
        "reply": "anyone know how many of these people were illegal and how many had green cards?", 
        "threadID": "672198221_4420095912001", 
        "time": "2009-04-02 11:28:00", 
        "title": "'The Exodus': Latinos Leaving NC In Droves", 
        "userID": "Elesso"
    }
]