[
    {
        "content": "The Company that outfits the Maersk Alabama was commenting on the need for a multinational response to the problem of Piracy off the Somali coastline. But what REALLY caught my eye was this... quote: Johnsen said a replacement crew will be sent to the U.S.-flagged Maersk where it's docked in Kenya. For security reasons, he declined to comment on the ship's future destination. http://news.yahoo.com/s/ap/20090413/ap_on_bi_ge/piracy_ship_firm Well, I had worked with Maersk, through its subsiderary APM for two years. So I simply went to the Maersk website, entered the vessel name in the appropriate webpage and got this as the result quote: Schedules - by vessel (for optimal print set print orientation to landscape) Fill in the fields below and click \"Search\". Fields marked with * are mandatory. Enter dates manually or click on the calendar icon to select a date. Vessel name: MAERSK ALABAMA Voyage Number: » Download Schedule Dates in blue reflect actual arrival/departure dates Port Name .. Terminal Name .... Arrival Date ........ Departure Date .... Voyage Number Salalah ... Salalah Terminal .. 22 Apr 2009 01:00 .. 23 Apr 2009 08:00 .. 0913 Djibouti ... Djibouti ......... 25 Apr 2009 23:59 ... 26 Apr 2009 13:00 .. 0913 Mombasa ... Mombasa Terminal .. 02 May 2009 03:00 .. 07 May 2009 21:30 .. 0914 Generated on Mon, 13 Apr 2009 18:47 UTC Sailing Schedule data is refreshed 4 times daily at 00h00, 06h00, 12h00 and 18h00 UTC (last refreshed on Mon, 13 Apr 2009 12:48 UTC). And then I just gotta shake my head.", 
        "intTime": 20090413, 
        "postID": 1, 
        "quote": "Johnsen said a replacement crew will be sent to the U.S.-flagged Maersk where it's docked in Kenya. For security reasons, he declined to comment on the ship's future destination. http://news.yahoo.com/s/ap/20090413/ap_on_bi_ge/piracy_ship_firm", 
        "reply": "The Company that outfits the Maersk Alabama was commenting on the need for a multinational response to the problem of Piracy off the Somali coastline. But what REALLY caught my eye was this...  Well, I had worked with Maersk, through its subsiderary APM for two years. So I simply went to the Maersk website, entered the vessel name in the appropriate webpage and got this as the result quote: Schedules - by vessel (for optimal print set print orientation to landscape) Fill in the fields below and click \"Search\". Fields marked with * are mandatory. Enter dates manually or click on the calendar icon to select a date. Vessel name: MAERSK ALABAMA Voyage Number: » Download Schedule Dates in blue reflect actual arrival/departure dates Port Name .. Terminal Name .... Arrival Date ........ Departure Date .... Voyage Number Salalah ... Salalah Terminal .. 22 Apr 2009 01:00 .. 23 Apr 2009 08:00 .. 0913 Djibouti ... Djibouti ......... 25 Apr 2009 23:59 ... 26 Apr 2009 13:00 .. 0913 Mombasa ... Mombasa Terminal .. 02 May 2009 03:00 .. 07 May 2009 21:30 .. 0914 Generated on Mon, 13 Apr 2009 18:47 UTC Sailing Schedule data is refreshed 4 times daily at 00h00, 06h00, 12h00 and 18h00 UTC (last refreshed on Mon, 13 Apr 2009 12:48 UTC). And then I just gotta shake my head.", 
        "threadID": "672198221_8100026022001", 
        "time": "2009-04-13 12:01:00", 
        "title": "You just have to love Maritime Shipping Companies", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Good lord. So much for OPSEC. They'll probably dock the Captains pay for being late to boot.", 
        "intTime": 20090413, 
        "postID": 2, 
        "quote": "", 
        "reply": "Good lord. So much for OPSEC. They'll probably dock the Captains pay for being late to boot.", 
        "threadID": "672198221_8100026022001", 
        "time": "2009-04-13 12:05:00", 
        "title": "You just have to love Maritime Shipping Companies", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "quote: Originally posted by 101MPRAT: Good lord. So much for OPSEC. They'll probably dock the Captains pay for being late to boot. There is no such thing as OPSEC in any shipping industry... only when Governments are involved. Money and the making of money out trumps security any day of the week. And that unfortunately IS a universal constant in most businesses. but on the other hand... the exact routing is not stated. So a bit of security anyway", 
        "intTime": 20090413, 
        "postID": 3, 
        "quote": "Originally posted by 101MPRAT: Good lord. So much for OPSEC. They'll probably dock the Captains pay for being late to boot.", 
        "reply": " There is no such thing as OPSEC in any shipping industry... only when Governments are involved. Money and the making of money out trumps security any day of the week. And that unfortunately IS a universal constant in most businesses. but on the other hand... the exact routing is not stated. So a bit of security anyway", 
        "threadID": "672198221_8100026022001", 
        "time": "2009-04-13 12:20:00", 
        "title": "You just have to love Maritime Shipping Companies", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Money and the making of money out trumps security any day of the week. Too true.", 
        "intTime": 20090413, 
        "postID": 4, 
        "quote": "Money and the making of money out trumps security any day of the week.", 
        "reply": " Too true.", 
        "threadID": "672198221_8100026022001", 
        "time": "2009-04-13 12:39:00", 
        "title": "You just have to love Maritime Shipping Companies", 
        "userID": "101MPRAT"
    }, 
    {
        "content": "Well, in looking at the Alabama's schedule it appears that this Food aide mission is going to go on for some time. Without using dates... this is the Alabama's port calls for the rest of its mission. And this vessel operates exclusively in the Gulf of Aden area... At least until the food is all delivered quote: Port Name Terminal Name Salalah Salalah Terminal Djibouti Djibouti Mombasa Mombasa Terminal Salalah Salalah Terminal Salalah Salalah Terminal Mombasa Mombasa Terminal Salalah Salalah Terminal Mombasa Mombasa Terminal Salalah Salalah Terminal Djibouti Djibouti Mombasa Mombasa Terminal Dar es Salaam Dar Port Terminal Salalah Salalah Terminal Mombasa Mombasa Terminal Salalah Salalah Terminal Mombasa Mombasa Terminal Salalah Salalah Terminal Mombasa Mombasa Terminal Salalah Salalah Terminal Mission End", 
        "intTime": 20090413, 
        "postID": 5, 
        "quote": "Port Name Terminal Name Salalah Salalah Terminal Djibouti Djibouti Mombasa Mombasa Terminal Salalah Salalah Terminal Salalah Salalah Terminal Mombasa Mombasa Terminal Salalah Salalah Terminal Mombasa Mombasa Terminal Salalah Salalah Terminal Djibouti Djibouti Mombasa Mombasa Terminal Dar es Salaam Dar Port Terminal Salalah Salalah Terminal Mombasa Mombasa Terminal Salalah Salalah Terminal Mombasa Mombasa Terminal Salalah Salalah Terminal Mombasa Mombasa Terminal Salalah Salalah Terminal Mission End", 
        "reply": "Well, in looking at the Alabama's schedule it appears that this Food aide mission is going to go on for some time. Without using dates... this is the Alabama's port calls for the rest of its mission. And this vessel operates exclusively in the Gulf of Aden area... At least until the food is all delivered ", 
        "threadID": "672198221_8100026022001", 
        "time": "2009-04-13 13:07:00", 
        "title": "You just have to love Maritime Shipping Companies", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Part of that might be that their schedule is off due to the pirate issue. They may be in the middle of re-evaluating or amending the schedule. I guess it is posssible they decided publishing that information is not a good idea. I know they don't give specific route details but shipping lanes are common knowledge are they not? Point A to B you would think had limited alternatives taking fuel use into consideration. OK, I am an Army type but navigation is navigation.", 
        "intTime": 20090413, 
        "postID": 6, 
        "quote": "", 
        "reply": "Part of that might be that their schedule is off due to the pirate issue. They may be in the middle of re-evaluating or amending the schedule. I guess it is posssible they decided publishing that information is not a good idea. I know they don't give specific route details but shipping lanes are common knowledge are they not? Point A to B you would think had limited alternatives taking fuel use into consideration. OK, I am an Army type but navigation is navigation.", 
        "threadID": "672198221_8100026022001", 
        "time": "2009-04-13 14:17:00", 
        "title": "You just have to love Maritime Shipping Companies", 
        "userID": "101MPRAT"
    }
]