[
    {
        "content": "Comments from the Bush version of how to handle world terrorism crowd? I am certain that guilt or innocense has nothing to do in the holy war on Terror. I am left to wonder... just how many of those that were \"just caught up\" wound up being a terrorist following their stay with us? I suppose that you will still say that we are safer now than we were before and taht there are less terrorists in the world now because of George Bush... quote: SAN JUAN, Puerto Rico – Many detainees locked up at Guantanamo were innocent men swept up by U.S. forces unable to distinguish enemies from noncombatants, a former Bush administration official said Thursday. \"There are still innocent people there,\" Lawrence B. Wilkerson, a Republican who was chief of staff to then-Secretary of State Colin Powell, told The Associated Press. \"Some have been there six or seven years.\" Wilkerson, who first made the assertions in an Internet posting on Tuesday, told the AP he learned from briefings and by communicating with military commanders that the U.S. soon realized many Guantanamo detainees were innocent but nevertheless held them in hopes they could provide information for a \"mosaic\" of intelligence. \"It did not matter if a detainee were innocent. Indeed, because he lived in Afghanistan and was captured on or near the battle area, he must know something of importance,\" Wilkerson wrote in the blog. He said intelligence analysts hoped to gather \"sufficient information about a village, a region, or a group of individuals, that dots could be connected and terrorists or their plots could be identified.\" Wilkerson, a retired Army colonel, said vetting on the battlefield during the early stages of U.S. military operations in Afghanistan was incompetent with no meaningful attempt to discriminate \"who we were transporting to Cuba for detention and interrogation.\" >http://news.yahoo.com/s/ap/20090319/ap_on_re_la_am_ca/cb_guantanamo_wrongly_held<", 
        "intTime": 20090319, 
        "postID": 1, 
        "quote": "SAN JUAN, Puerto Rico – Many detainees locked up at Guantanamo were innocent men swept up by U.S. forces unable to distinguish enemies from noncombatants, a former Bush administration official said Thursday. \"There are still innocent people there,\" Lawrence B. Wilkerson, a Republican who was chief of staff to then-Secretary of State Colin Powell, told The Associated Press. \"Some have been there six or seven years.\" Wilkerson, who first made the assertions in an Internet posting on Tuesday, told the AP he learned from briefings and by communicating with military commanders that the U.S. soon realized many Guantanamo detainees were innocent but nevertheless held them in hopes they could provide information for a \"mosaic\" of intelligence. \"It did not matter if a detainee were innocent. Indeed, because he lived in Afghanistan and was captured on or near the battle area, he must know something of importance,\" Wilkerson wrote in the blog. He said intelligence analysts hoped to gather \"sufficient information about a village, a region, or a group of individuals, that dots could be connected and terrorists or their plots could be identified.\" Wilkerson, a retired Army colonel, said vetting on the battlefield during the early stages of U.S. military operations in Afghanistan was incompetent with no meaningful attempt to discriminate \"who we were transporting to Cuba for detention and interrogation.\" >http://news.yahoo.com/s/ap/20090319/ap_on_re_la_am_ca/cb_guantanamo_wrongly_held<", 
        "reply": "Comments from the Bush version of how to handle world terrorism crowd? I am certain that guilt or innocense has nothing to do in the holy war on Terror. I am left to wonder... just how many of those that were \"just caught up\" wound up being a terrorist following their stay with us? I suppose that you will still say that we are safer now than we were before and taht there are less terrorists in the world now because of George Bush... ", 
        "threadID": "672198221_7090033812001", 
        "time": "2009-03-19 15:18:00", 
        "title": "Only terrorists are kept at Guantanamo right?   Wrong!", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "You all really need to read the rest of this article... Disgusting leadership traits...", 
        "intTime": 20090319, 
        "postID": 2, 
        "quote": "", 
        "reply": "You all really need to read the rest of this article... Disgusting leadership traits...", 
        "threadID": "672198221_7090033812001", 
        "time": "2009-03-19 15:21:00", 
        "title": "Only terrorists are kept at Guantanamo right?   Wrong!", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Art, this is exactly why I have not and will never ever support such gestopo style tactics. He have a Constitution that was written by very smart men for a purpose. To try and skirt around it because they are not \"american citizens\" is and always will be BULL. We live, eat, drink and defend our constitution for a reason. Not for it to be distorted when the wind does not blow our way. Give me Liberty, Justice and Freedom or death. All of them should have had \"just\" cause to pick them up and they could have been placed on trial and convicted of that cause just like we do every single day in this country. No difference. The Bush Admin was WRONG and will always be Wrong on this issue. But I feel it was an honest mistake and a forgiveable over reaction considering what took place. Learn from our mistakes and move forward to not repeat them, like this and what we did to the Japaneese Americans in this country after Perl. If we do not defend justice in this world, eventually NO NATION will. Kill our enemies on the battlfield, execute them all if warranted but do it all in the name and way of justice.", 
        "intTime": 20090319, 
        "postID": 3, 
        "quote": "", 
        "reply": "Art, this is exactly why I have not and will never ever support such gestopo style tactics. He have a Constitution that was written by very smart men for a purpose. To try and skirt around it because they are not \"american citizens\" is and always will be BULL. We live, eat, drink and defend our constitution for a reason. Not for it to be distorted when the wind does not blow our way. Give me Liberty, Justice and Freedom or death. All of them should have had \"just\" cause to pick them up and they could have been placed on trial and convicted of that cause just like we do every single day in this country. No difference. The Bush Admin was WRONG and will always be Wrong on this issue. But I feel it was an honest mistake and a forgiveable over reaction considering what took place. Learn from our mistakes and move forward to not repeat them, like this and what we did to the Japaneese Americans in this country after Perl. If we do not defend justice in this world, eventually NO NATION will. Kill our enemies on the battlfield, execute them all if warranted but do it all in the name and way of justice.", 
        "threadID": "672198221_7090033812001", 
        "time": "2009-03-19 15:30:00", 
        "title": "Only terrorists are kept at Guantanamo right?   Wrong!", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "More interesting statements from Lawrence Wilkerson, Powell's Chief of Staff. quote: In his posting for The Washington Note blog, Wilkerson wrote that \"U.S. leadership became aware of this lack of proper vetting very early on and, thus, of the reality that many of the detainees were innocent of any substantial wrongdoing, had little intelligence value, and should be immediately released.\" Former Defense Secretary Donald Rumsfeld and Vice President Dick Cheney fought efforts to address the situation, Wilkerson said, because \"to have admitted this reality would have been a black mark on their leadership.\" So we kept them because Rummy and Cheney didn't want to be seen as incompetent! Have to love that reason, but was rather typical for the Bush White House. Couldn't dazzle us by their brilliance so they baffled us with B.S.", 
        "intTime": 20090319, 
        "postID": 4, 
        "quote": "In his posting for The Washington Note blog, Wilkerson wrote that \"U.S. leadership became aware of this lack of proper vetting very early on and, thus, of the reality that many of the detainees were innocent of any substantial wrongdoing, had little intelligence value, and should be immediately released.\" Former Defense Secretary Donald Rumsfeld and Vice President Dick Cheney fought efforts to address the situation, Wilkerson said, because \"to have admitted this reality would have been a black mark on their leadership.\"", 
        "reply": "More interesting statements from Lawrence Wilkerson, Powell's Chief of Staff.  So we kept them because Rummy and Cheney didn't want to be seen as incompetent! Have to love that reason, but was rather typical for the Bush White House. Couldn't dazzle us by their brilliance so they baffled us with B.S.", 
        "threadID": "672198221_7090033812001", 
        "time": "2009-03-19 17:00:00", 
        "title": "Only terrorists are kept at Guantanamo right?   Wrong!", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "Over 800 combatants (and non-combatants to make you happy) have been held at Gitmo, questioned and important intelligence gathered. Only about a quarter of them remain. The ones in questioned might have been long gone for all you are aware. Even in your story it states, \"All were taken from, or close to the field of battle\". This was only after he says they were innocent. I'm not sure how a State department employee has this knowledge I doubt Powell was aware of each prisoner, the crime or why he was being held. Any person in the field or related to the forces being fought in war time by our nation in any manner is obviously targeted for holding and extracting information. Why is this so hard for anyone to understand? You act like our guys were over there playing games................", 
        "intTime": 20090319, 
        "postID": 5, 
        "quote": "", 
        "reply": "Over 800 combatants (and non-combatants to make you happy) have been held at Gitmo, questioned and important intelligence gathered. Only about a quarter of them remain. The ones in questioned might have been long gone for all you are aware. Even in your story it states, \"All were taken from, or close to the field of battle\". This was only after he says they were innocent. I'm not sure how a State department employee has this knowledge I doubt Powell was aware of each prisoner, the crime or why he was being held. Any person in the field or related to the forces being fought in war time by our nation in any manner is obviously targeted for holding and extracting information. Why is this so hard for anyone to understand? You act like our guys were over there playing games................", 
        "threadID": "672198221_7090033812001", 
        "time": "2009-03-19 17:42:00", 
        "title": "Only terrorists are kept at Guantanamo right?   Wrong!", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: Over 800 combatants (and non-combatants to make you happy) have been held at Gitmo, questioned and important intelligence gathered. Only about a quarter of them remain. The ones in questioned might have been long gone for all you are aware. Even in your story it states, \"All were taken from, or close to the field of battle\". This was only after he says they were innocent. I'm not sure how a State department employee has this knowledge I doubt Powell was aware of each prisoner, the crime or why he was being held. Any person in the field or related to the forces being fought in war time by our nation in any manner is obviously targeted for holding and extracting information. Why is this so hard for anyone to understand? You act like our guys were over there playing games................ Collin Powell's Chief of Staff is a White House employee and would or could sit in on Presidential meetings. It is very possible and likely that he knows exactly what he is talking about. But since you are neither State Department or White House employed I guess we can easily doubt your statements as well. The games were being played in and around the Oval Office... and it was those in the field that pay the price... bad or good.", 
        "intTime": 20090319, 
        "postID": 6, 
        "quote": "Originally posted by rayevinsonsr: Over 800 combatants (and non-combatants to make you happy) have been held at Gitmo, questioned and important intelligence gathered. Only about a quarter of them remain. The ones in questioned might have been long gone for all you are aware. Even in your story it states, \"All were taken from, or close to the field of battle\". This was only after he says they were innocent. I'm not sure how a State department employee has this knowledge I doubt Powell was aware of each prisoner, the crime or why he was being held. Any person in the field or related to the forces being fought in war time by our nation in any manner is obviously targeted for holding and extracting information. Why is this so hard for anyone to understand? You act like our guys were over there playing games................", 
        "reply": " Collin Powell's Chief of Staff is a White House employee and would or could sit in on Presidential meetings. It is very possible and likely that he knows exactly what he is talking about. But since you are neither State Department or White House employed I guess we can easily doubt your statements as well. The games were being played in and around the Oval Office... and it was those in the field that pay the price... bad or good.", 
        "threadID": "672198221_7090033812001", 
        "time": "2009-03-19 18:19:00", 
        "title": "Only terrorists are kept at Guantanamo right?   Wrong!", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by rayevinsonsr: Over 800 combatants (and non-combatants to make you happy) have been held at Gitmo, questioned and important intelligence gathered. Only about a quarter of them remain. The ones in questioned might have been long gone for all you are aware. Even in your story it states, \"All were taken from, or close to the field of battle\". This was only after he says they were innocent. I'm not sure how a State department employee has this knowledge I doubt Powell was aware of each prisoner, the crime or why he was being held. Any person in the field or related to the forces being fought in war time by our nation in any manner is obviously targeted for holding and extracting information. Why is this so hard for anyone to understand? You act like our guys were over there playing games................ Collin Powell's Chief of Staff is a White House employee and would or could sit in on Presidential meetings. It is very possible and likely that he knows exactly what he is talking about. But since you are neither State Department or White House employed I guess we can easily doubt your statements as well. The games were being played in and around the Oval Office... and it was those in the field that pay the price... bad or good. This is the street address. The State Department mailing address is: 2201 C Street NW, Washington, DC 20520 I'm aware I am not the sharpest pencil in the box but the State department is not in the White House, nor does Powell's Chief of Staff's (Office manager) have reserved seating in the Presidents cabinet meeting. I doubt Powell was even in all meetings on military decisions, if any. NSC has had a running gun battle with the State Department for decades of pressuring them into situation. As far as I know, State in not an influence in security matters as you're discussing. I have not showed any disrespect to the Colonel, (he has his opinion) or to Secretary Powell, unlike some in describing the President.", 
        "intTime": 20090319, 
        "postID": 7, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by rayevinsonsr: Over 800 combatants (and non-combatants to make you happy) have been held at Gitmo, questioned and important intelligence gathered. Only about a quarter of them remain. The ones in questioned might have been long gone for all you are aware. Even in your story it states, \"All were taken from, or close to the field of battle\". This was only after he says they were innocent. I'm not sure how a State department employee has this knowledge I doubt Powell was aware of each prisoner, the crime or why he was being held. Any person in the field or related to the forces being fought in war time by our nation in any manner is obviously targeted for holding and extracting information. Why is this so hard for anyone to understand? You act like our guys were over there playing games................ Collin Powell's Chief of Staff is a White House employee and would or could sit in on Presidential meetings. It is very possible and likely that he knows exactly what he is talking about. But since you are neither State Department or White House employed I guess we can easily doubt your statements as well. The games were being played in and around the Oval Office... and it was those in the field that pay the price... bad or good.", 
        "reply": " This is the street address. The State Department mailing address is: 2201 C Street NW, Washington, DC 20520 I'm aware I am not the sharpest pencil in the box but the State department is not in the White House, nor does Powell's Chief of Staff's (Office manager) have reserved seating in the Presidents cabinet meeting. I doubt Powell was even in all meetings on military decisions, if any. NSC has had a running gun battle with the State Department for decades of pressuring them into situation. As far as I know, State in not an influence in security matters as you're discussing. I have not showed any disrespect to the Colonel, (he has his opinion) or to Secretary Powell, unlike some in describing the President.", 
        "threadID": "672198221_7090033812001", 
        "time": "2009-03-19 18:36:00", 
        "title": "Only terrorists are kept at Guantanamo right?   Wrong!", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "A little more words of wisdom... and a reason as to why Bush could never get a conviction while President. quote: Some 800 men have been held at Guantanamo since the prison opened in January 2002, and 240 remain. Wilkerson said two dozen are terrorists, including confessed Sept. 11 plotter Khalid Sheikh Mohammed, who was transferred to Guantanamo from CIA custody in September 2006. \"We need to put those people in a high-security prison like the one in Colorado, forget them and throw away the key,\" Wilkerson said. [b}\"We can't try them because we tortured them and didn't keep an evidence trail.\"[/b] But the rest of the detainees need to be released, he said. \"But your Honor! TRUST me! They are Terrorists!\" If they were not what we say they are... why would we have them locked up the way we do!\" How many times have we heard that since 2001? How many times? It has been a state secret but Wilkerson has said that only 10% of those remaining are actually terrorists. And only 3% of the original totals... Yes, I'd say we (USA, you, me, Bush et al.) created dozens more terrorists when we released those other 560 men. All in the name of potential intel.", 
        "intTime": 20090319, 
        "postID": 8, 
        "quote": "Some 800 men have been held at Guantanamo since the prison opened in January 2002, and 240 remain. Wilkerson said two dozen are terrorists, including confessed Sept. 11 plotter Khalid Sheikh Mohammed, who was transferred to Guantanamo from CIA custody in September 2006. \"We need to put those people in a high-security prison like the one in Colorado, forget them and throw away the key,\" Wilkerson said. [b}\"We can't try them because we tortured them and didn't keep an evidence trail.\"[/b] But the rest of the detainees need to be released, he said.", 
        "reply": "A little more words of wisdom... and a reason as to why Bush could never get a conviction while President.  \"But your Honor! TRUST me! They are Terrorists!\" If they were not what we say they are... why would we have them locked up the way we do!\" How many times have we heard that since 2001? How many times? It has been a state secret but Wilkerson has said that only 10% of those remaining are actually terrorists. And only 3% of the original totals... Yes, I'd say we (USA, you, me, Bush et al.) created dozens more terrorists when we released those other 560 men. All in the name of potential intel.", 
        "threadID": "672198221_7090033812001", 
        "time": "2009-03-19 18:42:00", 
        "title": "Only terrorists are kept at Guantanamo right?   Wrong!", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: Over 800 combatants (and non-combatants to make you happy) have been held at Gitmo, questioned and important intelligence gathered. Only about a quarter of them remain. The ones in questioned might have been long gone for all you are aware. Even in your story it states, \"All were taken from, or close to the field of battle\". This was only after he says they were innocent. I'm not sure how a State department employee has this knowledge I doubt Powell was aware of each prisoner, the crime or why he was being held. Any person in the field or related to the forces being fought in war time by our nation in any manner is obviously targeted for holding and extracting information. Why is this so hard for anyone to understand? You act like our guys were over there playing games................ Given their intelligence is now seven years along, one would have thought it would have paid-off by now. Or maybe that intelligence wasn't as \"important\" as it was cracked up to be. Or maybe it wasn't intelligence at all. I'm inclined to think the latter given the ignorance in which they were gathered. \"Our guys\" certainly weren't playing games, but it seems now they weren't playing smart either.", 
        "intTime": 20090320, 
        "postID": 9, 
        "quote": "Originally posted by rayevinsonsr: Over 800 combatants (and non-combatants to make you happy) have been held at Gitmo, questioned and important intelligence gathered. Only about a quarter of them remain. The ones in questioned might have been long gone for all you are aware. Even in your story it states, \"All were taken from, or close to the field of battle\". This was only after he says they were innocent. I'm not sure how a State department employee has this knowledge I doubt Powell was aware of each prisoner, the crime or why he was being held. Any person in the field or related to the forces being fought in war time by our nation in any manner is obviously targeted for holding and extracting information. Why is this so hard for anyone to understand? You act like our guys were over there playing games................", 
        "reply": " Given their intelligence is now seven years along, one would have thought it would have paid-off by now. Or maybe that intelligence wasn't as \"important\" as it was cracked up to be. Or maybe it wasn't intelligence at all. I'm inclined to think the latter given the ignorance in which they were gathered. \"Our guys\" certainly weren't playing games, but it seems now they weren't playing smart either.", 
        "threadID": "672198221_7090033812001", 
        "time": "2009-03-20 04:44:00", 
        "title": "Only terrorists are kept at Guantanamo right?   Wrong!", 
        "userID": "popsiq"
    }
]