[
    {
        "content": "quote: Auditors for General Motors today said there is \"substantial doubt\" that the struggling automaker will remain financially viable and able to continue operating, raising doubts about whether the company will have to declare bankruptcy or can continue to qualify for Treasury Department loans. C H A P T E R 1 1 NO MORE TAX-PAYERS MONEY...... +http://www.washingtonpost.com/wp-dyn/content/story/2009/03/05/ST2009030501398.html", 
        "intTime": 20090305, 
        "postID": 1, 
        "quote": "Auditors for General Motors today said there is \"substantial doubt\" that the struggling automaker will remain financially viable and able to continue operating, raising doubts about whether the company will have to declare bankruptcy or can continue to qualify for Treasury Department loans.", 
        "reply": " C H A P T E R 1 1 NO MORE TAX-PAYERS MONEY...... +http://www.washingtonpost.com/wp-dyn/content/story/2009/03/05/ST2009030501398.html", 
        "threadID": "672198221_6970089612001", 
        "time": "2009-03-05 09:01:00", 
        "title": "GM Auditors Wary About Auto Firm's Future", 
        "userID": "Knele"
    }, 
    {
        "content": "There is no other Manufacturing company that deserves it more on the face of this Earth OR that has had as many chances to avoid it. Oh and BTW, what kind of bonehead strategy is it to hang onto BUICK and PONTIAC? OR GMC Truck and Cheverolet Truck. A High School kid could run this company better.", 
        "intTime": 20090305, 
        "postID": 2, 
        "quote": "", 
        "reply": "There is no other Manufacturing company that deserves it more on the face of this Earth OR that has had as many chances to avoid it. Oh and BTW, what kind of bonehead strategy is it to hang onto BUICK and PONTIAC? OR GMC Truck and Cheverolet Truck. A High School kid could run this company better.", 
        "threadID": "672198221_6970089612001", 
        "time": "2009-03-05 10:28:00", 
        "title": "GM Auditors Wary About Auto Firm's Future", 
        "userID": "ErichG2"
    }, 
    {
        "content": "Reset to zip and start over. Bail out money would only be wasted.", 
        "intTime": 20090305, 
        "postID": 3, 
        "quote": "", 
        "reply": "Reset to zip and start over. Bail out money would only be wasted.", 
        "threadID": "672198221_6970089612001", 
        "time": "2009-03-05 13:22:00", 
        "title": "GM Auditors Wary About Auto Firm's Future", 
        "userID": "popsiq"
    }, 
    {
        "content": "I wish no money had ever went to any bail outs. Let them all die even the banks from here out.", 
        "intTime": 20090305, 
        "postID": 4, 
        "quote": "", 
        "reply": "I wish no money had ever went to any bail outs. Let them all die even the banks from here out.", 
        "threadID": "672198221_6970089612001", 
        "time": "2009-03-05 14:20:00", 
        "title": "GM Auditors Wary About Auto Firm's Future", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by ErichG2: There is no other Manufacturing company that deserves it more on the face of this Earth OR that has had as many chances to avoid it. Oh and BTW, what kind of bonehead strategy is it to hang onto BUICK and PONTIAC? OR GMC Truck and Cheverolet Truck. A High School kid could run this company better. It was just on national news last week that Pontiac is.....gone. If ya know where there is a junk GTO someplace, buy it now.", 
        "intTime": 20090305, 
        "postID": 5, 
        "quote": "Originally posted by ErichG2: There is no other Manufacturing company that deserves it more on the face of this Earth OR that has had as many chances to avoid it. Oh and BTW, what kind of bonehead strategy is it to hang onto BUICK and PONTIAC? OR GMC Truck and Cheverolet Truck. A High School kid could run this company better.", 
        "reply": " It was just on national news last week that Pontiac is.....gone. If ya know where there is a junk GTO someplace, buy it now.", 
        "threadID": "672198221_6970089612001", 
        "time": "2009-03-05 14:23:00", 
        "title": "GM Auditors Wary About Auto Firm's Future", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SignalSgtWilliams: It was just on national news last week that Pontiac is.....gone. If ya know where there is a junk GTO someplace, buy it now. Yeah, it's a curious thing to watch them try to spin off Saab, then Hummer, now Pontiac.....all too late. They are out of time, money and taxpayer patience. A lot of this was decisions that should have been made in 1995. Look at Saturn for example. Decision on the table in 1993....should they produce a mid-size Sedan next or a SUV (I was there). They did both.....WTF? How is that intelligent decision making or making tough choices with limited resources. Both models were a flop (Aura and Vue). Saturn was not about becomming another Chevrolet, they were about making small and high quailty cars. If they would have stayed in that niche they wouldn't be teetering along with the rest of GM. Instead they choose fast and quick money and jumped on the larger vehicle bandwagon.....big mistake. The UAW and it's fat pension isn't far behind. No way will taxpayers support a $1 for $1 bailout of that monster in this Economy. Retrain the ones that can work and cancel their former pension benefits. The ones that are too close to retirement I think should be bridged over.", 
        "intTime": 20090305, 
        "postID": 6, 
        "quote": "Originally posted by SignalSgtWilliams: It was just on national news last week that Pontiac is.....gone. If ya know where there is a junk GTO someplace, buy it now.", 
        "reply": " Yeah, it's a curious thing to watch them try to spin off Saab, then Hummer, now Pontiac.....all too late. They are out of time, money and taxpayer patience. A lot of this was decisions that should have been made in 1995. Look at Saturn for example. Decision on the table in 1993....should they produce a mid-size Sedan next or a SUV (I was there). They did both.....WTF? How is that intelligent decision making or making tough choices with limited resources. Both models were a flop (Aura and Vue). Saturn was not about becomming another Chevrolet, they were about making small and high quailty cars. If they would have stayed in that niche they wouldn't be teetering along with the rest of GM. Instead they choose fast and quick money and jumped on the larger vehicle bandwagon.....big mistake. The UAW and it's fat pension isn't far behind. No way will taxpayers support a $1 for $1 bailout of that monster in this Economy. Retrain the ones that can work and cancel their former pension benefits. The ones that are too close to retirement I think should be bridged over.", 
        "threadID": "672198221_6970089612001", 
        "time": "2009-03-05 16:42:00", 
        "title": "GM Auditors Wary About Auto Firm's Future", 
        "userID": "ErichG2"
    }, 
    {
        "content": "I would agree with Eric The heart of the problem with why GM can't survive is the pension plan that the UAW forced down there throats in the 70's They get benefits that NO ONE else gets, they are different in three ways. Since 1971, just in time for the post WWII generation to \"retire\" any UAW worker as soon as he had been with he company 30 years and was thus \"fully vested\" could retire and get full benefits, REGARDLESS of his actual age. So that brand knew 17 or 18 YO D minus high school grad or maybe GED holder who managed to get a job with GM, maybe because is dad or whoever worked there could spend 30 years bolting on wheels, driving cars off the end of the assembly line or something equally unskilled and at age 47 \"retire\" and keep getting a paycheck equal to 100% of his last paycheck, subject to COLA's and keep getting the same free healthcare for themselves and dependents for life. There are 100's of thousands, probably millions of GM \"retirees\" that are older than 48 but less than 62-67. Paying pensions and providing the free healthcare to all these people that if they were anywhere else would either still be working for GM or at the very least would not drawing benefits yet cost GM god knows how many BILLION per yer. In the hearings last DEC. Rick Wagoner stated the average age of GM worker when he retires is just 52. If your wife happened to work for GM you are talking a lower 50's couple raking in well in excess of 100 grand a year. More on the healthcare, almost anywhere else in America even for the employee whose company pays 100% of HIS premiums, having to pay some kind of deductible and co-pay is the norm. To get coverage for the spouse and additional dependents paying at least part if not all of the premium in addition to deductibles and co-pays is also the norm. UAW healtcare it is all free, while you work and after you retire it stays free where as almost every where else IF you can stay in your companies healthcare plan it is the norm that you pay more in premiums that when you were working there and deductibles and co-pays may also be more. If that is not enough of a gravy train, add this. If you are a white collar GM \"manager\" when you are old enough you are REQUIRED to sign up for medicare which makes your \"retiree healthcare\" far cheaper for the company. This is also the norm across America for companies that allow retirees to remain in the companies healthcare, even us military retirees are required to sign up for medicare UAW workers, there is no such requirement. This change alone would save GM untold millions if not billions per year. Is it any wonder that this company is going broke? At a minimum the 1971 30 years regardles of age rule has to go away for at the very least active workers. All the \"gray area\" retirees should be given the choice to either come back to work for GM, room being made for them by firing newer guys IE last hired first fired after all these are guys that if the retirees had not left they would have never been hired in the first place or if they are happy in the second careers most probably have they can stay in them and just quit getting benefits and resume getting them no earlier than age 62. which is how it is for any other \"fully vested employee\" who quits before 62-67. They can't simply wait for them to all \"cyle through\" There are far too many and they are way to young. It should come as no surprise that all these things as far as the UAW in concerned are 100% off the table. They would rather play chicken and risk GM going under.", 
        "intTime": 20090305, 
        "postID": 7, 
        "quote": "", 
        "reply": "I would agree with Eric The heart of the problem with why GM can't survive is the pension plan that the UAW forced down there throats in the 70's They get benefits that NO ONE else gets, they are different in three ways. Since 1971, just in time for the post WWII generation to \"retire\" any UAW worker as soon as he had been with he company 30 years and was thus \"fully vested\" could retire and get full benefits, REGARDLESS of his actual age. So that brand knew 17 or 18 YO D minus high school grad or maybe GED holder who managed to get a job with GM, maybe because is dad or whoever worked there could spend 30 years bolting on wheels, driving cars off the end of the assembly line or something equally unskilled and at age 47 \"retire\" and keep getting a paycheck equal to 100% of his last paycheck, subject to COLA's and keep getting the same free healthcare for themselves and dependents for life. There are 100's of thousands, probably millions of GM \"retirees\" that are older than 48 but less than 62-67. Paying pensions and providing the free healthcare to all these people that if they were anywhere else would either still be working for GM or at the very least would not drawing benefits yet cost GM god knows how many BILLION per yer. In the hearings last DEC. Rick Wagoner stated the average age of GM worker when he retires is just 52. If your wife happened to work for GM you are talking a lower 50's couple raking in well in excess of 100 grand a year. More on the healthcare, almost anywhere else in America even for the employee whose company pays 100% of HIS premiums, having to pay some kind of deductible and co-pay is the norm. To get coverage for the spouse and additional dependents paying at least part if not all of the premium in addition to deductibles and co-pays is also the norm. UAW healtcare it is all free, while you work and after you retire it stays free where as almost every where else IF you can stay in your companies healthcare plan it is the norm that you pay more in premiums that when you were working there and deductibles and co-pays may also be more. If that is not enough of a gravy train, add this. If you are a white collar GM \"manager\" when you are old enough you are REQUIRED to sign up for medicare which makes your \"retiree healthcare\" far cheaper for the company. This is also the norm across America for companies that allow retirees to remain in the companies healthcare, even us military retirees are required to sign up for medicare UAW workers, there is no such requirement. This change alone would save GM untold millions if not billions per year. Is it any wonder that this company is going broke? At a minimum the 1971 30 years regardles of age rule has to go away for at the very least active workers. All the \"gray area\" retirees should be given the choice to either come back to work for GM, room being made for them by firing newer guys IE last hired first fired after all these are guys that if the retirees had not left they would have never been hired in the first place or if they are happy in the second careers most probably have they can stay in them and just quit getting benefits and resume getting them no earlier than age 62. which is how it is for any other \"fully vested employee\" who quits before 62-67. They can't simply wait for them to all \"cyle through\" There are far too many and they are way to young. It should come as no surprise that all these things as far as the UAW in concerned are 100% off the table. They would rather play chicken and risk GM going under.", 
        "threadID": "672198221_6970089612001", 
        "time": "2009-03-05 22:14:00", 
        "title": "GM Auditors Wary About Auto Firm's Future", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Auditors for General Motors today said there is \"substantial doubt\" that the struggling automaker will remain financially viable and able to continue operating, raising doubts about whether the company will have to declare bankruptcy or can continue to qualify for Treasury Department loans. C H A P T E R 1 1 NO MORE TAX-PAYERS MONEY...... +http://www.washingtonpost.com/wp-dyn/content/story/2009/03/05/ST2009030501398.html More 'loans' to a failing entity makes no sense. Even Barney Frank with all his 'banking expertise' (tongue in cheek there) would have to realise that.", 
        "intTime": 20090307, 
        "postID": 8, 
        "quote": "Originally posted by Knele: quote: Auditors for General Motors today said there is \"substantial doubt\" that the struggling automaker will remain financially viable and able to continue operating, raising doubts about whether the company will have to declare bankruptcy or can continue to qualify for Treasury Department loans. C H A P T E R 1 1 NO MORE TAX-PAYERS MONEY...... +http://www.washingtonpost.com/wp-dyn/content/story/2009/03/05/ST2009030501398.html", 
        "reply": " More 'loans' to a failing entity makes no sense. Even Barney Frank with all his 'banking expertise' (tongue in cheek there) would have to realise that.", 
        "threadID": "672198221_6970089612001", 
        "time": "2009-03-07 16:56:00", 
        "title": "GM Auditors Wary About Auto Firm's Future", 
        "userID": "busnrete8"
    }, 
    {
        "content": "There's a FORD in your future", 
        "intTime": 20090307, 
        "postID": 9, 
        "quote": "", 
        "reply": "There's a FORD in your future", 
        "threadID": "672198221_6970089612001", 
        "time": "2009-03-07 17:14:00", 
        "title": "GM Auditors Wary About Auto Firm's Future", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: There's a FORD in your future I don't think that either one of us could afford the Ford in the picture. I'll have to admit that I've been a Chevy fan for a long time. I will also admit that my last 2 cars have been Mustang Convertibles--a 2002 and a 2007. A compliment to Ford and their foresight that they have avoided requiring any bailout funds or loans from obama--for now.", 
        "intTime": 20090307, 
        "postID": 10, 
        "quote": "Originally posted by EAG154: There's a FORD in your future", 
        "reply": " I don't think that either one of us could afford the Ford in the picture. I'll have to admit that I've been a Chevy fan for a long time. I will also admit that my last 2 cars have been Mustang Convertibles--a 2002 and a 2007. A compliment to Ford and their foresight that they have avoided requiring any bailout funds or loans from obama--for now.", 
        "threadID": "672198221_6970089612001", 
        "time": "2009-03-07 18:38:00", 
        "title": "GM Auditors Wary About Auto Firm's Future", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by ErichG2: There is no other Manufacturing company that deserves it more on the face of this Earth OR that has had as many chances to avoid it. Oh and BTW, what kind of bonehead strategy is it to hang onto BUICK and PONTIAC? OR GMC Truck and Cheverolet Truck. A High School kid could run this company better. Hey Chevy trucks are good, what do you have a rice burner?", 
        "intTime": 20090307, 
        "postID": 11, 
        "quote": "Originally posted by ErichG2: There is no other Manufacturing company that deserves it more on the face of this Earth OR that has had as many chances to avoid it. Oh and BTW, what kind of bonehead strategy is it to hang onto BUICK and PONTIAC? OR GMC Truck and Cheverolet Truck. A High School kid could run this company better.", 
        "reply": " Hey Chevy trucks are good, what do you have a rice burner?", 
        "threadID": "672198221_6970089612001", 
        "time": "2009-03-07 19:05:00", 
        "title": "GM Auditors Wary About Auto Firm's Future", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by EAG154: There's a FORD in your future If'n your offerin' I'm a' acceptin' Those were sure neat cars...", 
        "intTime": 20090307, 
        "postID": 12, 
        "quote": "Originally posted by EAG154: There's a FORD in your future", 
        "reply": " If'n your offerin' I'm a' acceptin' Those were sure neat cars...", 
        "threadID": "672198221_6970089612001", 
        "time": "2009-03-07 19:26:00", 
        "title": "GM Auditors Wary About Auto Firm's Future", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by EAG154: There's a FORD in your future If'n your offerin' I'm a' acceptin' Those were sure neat cars... ya I drove one simular, gravity flow gas tank, spark advance lever on the steering column, and great brakes", 
        "intTime": 20090308, 
        "postID": 13, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by EAG154: There's a FORD in your future If'n your offerin' I'm a' acceptin' Those were sure neat cars...", 
        "reply": " ya I drove one simular, gravity flow gas tank, spark advance lever on the steering column, and great brakes", 
        "threadID": "672198221_6970089612001", 
        "time": "2009-03-08 09:18:00", 
        "title": "GM Auditors Wary About Auto Firm's Future", 
        "userID": "EAG154"
    }
]