[
    {
        "content": "\"Scott Horton reports this morning that, in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" Spain not only has the right under the Geneva Conventions and the Convention Against Torture to prosecute foreign officials for torturing its citizens, but it -- like the U.S. -- has the affirmative obligation to do so. (Indeed, the Bush administration itself insisted just last year that the U.S. the right to criminally prosecute foreign officials for ordering acts of torture even in the absence of an accusation that any of the victims were American). As Hilzoy argues, however, the primary obligation for these prosecutions lies with the country whose officials authorized the war crimes -- the United States: It is a requirement of law, the law that the Constitution requires Obama, as President, to faithfully execute. He should not outsource his Constitutional obligations to Spain. That the U.S. has the legal obligation under the U.S. Constitution, our own laws and international treaties to commence criminal investigations is simply undeniable. That is just a fact. Yet it's hard to overstate how far away we are from fulfilling our legal obligations to impose accountability on our own torturers and war criminals. The barriers to these prosecutions are numerous, but one of the principal obstacles is that CIA Director Leon Panetta has been emphatically demanding that there be no investigations of any government officials whose conduct was declared legal by DOJ lawyers (i.e., the very individuals the Spanish are now investigating for war crimes). And it's not surprising that Panetta has taken this position given that at least two of his top deputies at the CIA are among those implicated, to one degree or another, in the torture regime, as John Sifton detailed earlier this month at The Daily Beast: The New York Times reported that Leon Panetta, the current CIA director, has taken the position that “no one who took actions based on legal guidance from the Department of Justice at the time should be investigated, let alone punished.” Yet a number of CIA officials implicated in the torture program not only remain at the highest levels of the agency, but are also advising Panetta. Panetta’s attempt to suppress the issue is making Bush’s policy into the Obama administration’s dirty laundry.\" From Glenn Greenwald's blog on Salon.com We are going to find out if we still have a country or not. Walt", 
        "intTime": 20090414, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"Scott Horton reports this morning that, in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" Spain not only has the right under the Geneva Conventions and the Convention Against Torture to prosecute foreign officials for torturing its citizens, but it -- like the U.S. -- has the affirmative obligation to do so. (Indeed, the Bush administration itself insisted just last year that the U.S. the right to criminally prosecute foreign officials for ordering acts of torture even in the absence of an accusation that any of the victims were American). As Hilzoy argues, however, the primary obligation for these prosecutions lies with the country whose officials authorized the war crimes -- the United States: It is a requirement of law, the law that the Constitution requires Obama, as President, to faithfully execute. He should not outsource his Constitutional obligations to Spain. That the U.S. has the legal obligation under the U.S. Constitution, our own laws and international treaties to commence criminal investigations is simply undeniable. That is just a fact. Yet it's hard to overstate how far away we are from fulfilling our legal obligations to impose accountability on our own torturers and war criminals. The barriers to these prosecutions are numerous, but one of the principal obstacles is that CIA Director Leon Panetta has been emphatically demanding that there be no investigations of any government officials whose conduct was declared legal by DOJ lawyers (i.e., the very individuals the Spanish are now investigating for war crimes). And it's not surprising that Panetta has taken this position given that at least two of his top deputies at the CIA are among those implicated, to one degree or another, in the torture regime, as John Sifton detailed earlier this month at The Daily Beast: The New York Times reported that Leon Panetta, the current CIA director, has taken the position that “no one who took actions based on legal guidance from the Department of Justice at the time should be investigated, let alone punished.” Yet a number of CIA officials implicated in the torture program not only remain at the highest levels of the agency, but are also advising Panetta. Panetta’s attempt to suppress the issue is making Bush’s policy into the Obama administration’s dirty laundry.\" From Glenn Greenwald's blog on Salon.com We are going to find out if we still have a country or not. Walt", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 08:46:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "intTime": 20090414, 
        "postID": 2, 
        "quote": "", 
        "reply": "To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 08:55:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave", 
        "intTime": 20090414, 
        "postID": 3, 
        "quote": "Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "reply": " Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:00:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth.", 
        "intTime": 20090414, 
        "postID": 4, 
        "quote": "Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "reply": " Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:21:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth. Yeah, but we're Americans! Are the Spanish Americans? International Law specifically states that it applies ONLY when WE say it does. (I would give you a link, but I'm busy brushing the dog - a job like no other) I rest my case. Dave", 
        "intTime": 20090414, 
        "postID": 5, 
        "quote": "Originally posted by jwr6: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth.", 
        "reply": " Yeah, but we're Americans! Are the Spanish Americans? International Law specifically states that it applies ONLY when WE say it does. (I would give you a link, but I'm busy brushing the dog - a job like no other) I rest my case. Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:24:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "And the Spanish lawyer that is bringing this was himself jailed for terrorism. This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation.", 
        "intTime": 20090414, 
        "postID": 6, 
        "quote": "", 
        "reply": "And the Spanish lawyer that is bringing this was himself jailed for terrorism. This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:55:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: And the Spanish lawyer that is bringing this was himself jailed for terrorism. You have a link for this? Or was he jailed because he opposed Franco? quote: Originally posted by GunnyRet03: This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation. Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave", 
        "intTime": 20090414, 
        "postID": 7, 
        "quote": "Originally posted by GunnyRet03: And the Spanish lawyer that is bringing this was himself jailed for terrorism.", 
        "reply": " You have a link for this? Or was he jailed because he opposed Franco? quote: Originally posted by GunnyRet03: This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation. Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:24:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "Where were these citizens of Spain captured? Were they in Afghanistan? Just curious.....", 
        "intTime": 20090414, 
        "postID": 8, 
        "quote": "", 
        "reply": "Where were these citizens of Spain captured? Were they in Afghanistan? Just curious.....", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:32:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course.", 
        "intTime": 20090414, 
        "postID": 9, 
        "quote": "Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave", 
        "reply": " Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:36:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: ...in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" war crimes --... ...We are going to find out if we still have a country or not... Yes, we will. If these gutless Spanish cowards succeed in their efforts it will be clear that US national sovereignty is truly dead.", 
        "intTime": 20090414, 
        "postID": 10, 
        "quote": "Originally posted by WhiskeyPapa: ...in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" war crimes --... ...We are going to find out if we still have a country or not...", 
        "reply": " Yes, we will. If these gutless Spanish cowards succeed in their efforts it will be clear that US national sovereignty is truly dead.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:40:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course. You might want to check the post just above yours. It appears that this Judge was jailed for opposing Franco, and is therefore a \"Terrorist.\" Now, as it happens I WILL Bring up slavery, or our treatment of Indians - WHEN IT\"S APPROPRIATE! But I sure wont tar anyone who opposes slavery or our treatment of Indians, when their defending Americans TODAY! What you're implying above is that if Al Qaeda beheads someone, there's going to be someone who reminds us that we killed Indians - So What's the big deal? You have a link to anyone making that comparson? It's STANDARD procedure for the US, to DEMAND that when a country imprisons one of us, they have access to our Council, and they have access to legal council and the means to defend themselves. For years we've been pretending that International Law is whatever we say it is - Sorry, no, Ratified and Signed treaties ARE American Law, and not to be tossed in the garbage because it's not convenient. Dave", 
        "intTime": 20090414, 
        "postID": 11, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course.", 
        "reply": " You might want to check the post just above yours. It appears that this Judge was jailed for opposing Franco, and is therefore a \"Terrorist.\" Now, as it happens I WILL Bring up slavery, or our treatment of Indians - WHEN IT\"S APPROPRIATE! But I sure wont tar anyone who opposes slavery or our treatment of Indians, when their defending Americans TODAY! What you're implying above is that if Al Qaeda beheads someone, there's going to be someone who reminds us that we killed Indians - So What's the big deal? You have a link to anyone making that comparson? It's STANDARD procedure for the US, to DEMAND that when a country imprisons one of us, they have access to our Council, and they have access to legal council and the means to defend themselves. For years we've been pretending that International Law is whatever we say it is - Sorry, no, Ratified and Signed treaties ARE American Law, and not to be tossed in the garbage because it's not convenient. Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:57:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore...", 
        "intTime": 20090414, 
        "postID": 12, 
        "quote": "", 
        "reply": "Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore...", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 14:02:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave Americans that commit crimes in other countries often are. Don't ever find yourself in a Mexican jail for example.", 
        "intTime": 20090414, 
        "postID": 13, 
        "quote": "Originally posted by Grachus: Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave", 
        "reply": " Americans that commit crimes in other countries often are. Don't ever find yourself in a Mexican jail for example.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 15:50:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "Good thing the US never signed onto the World Court idea. Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. So BrAAAP to the dons and their feelthy peccadilloes.", 
        "intTime": 20090414, 
        "postID": 14, 
        "quote": "", 
        "reply": "Good thing the US never signed onto the World Court idea. Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. So BrAAAP to the dons and their feelthy peccadilloes.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 15:51:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "intTime": 20090414, 
        "postID": 15, 
        "quote": "Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore...", 
        "reply": " No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:06:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them.", 
        "intTime": 20090414, 
        "postID": 16, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "reply": " Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:11:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Good thing the US never signed onto the World Court idea. ( One big sham to begin with. Nothing but a world wide kangeroo court.) Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. (They sure do want our tourist business though. Funny how many of those countries need us much more than we need them, yet they bark and hiss like they actually matter.) So BrAAAP to the dons and their feelthy peccadilloes.", 
        "intTime": 20090414, 
        "postID": 17, 
        "quote": "Originally posted by popsiq: Good thing the US never signed onto the World Court idea. ( One big sham to begin with. Nothing but a world wide kangeroo court.) Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. (They sure do want our tourist business though. Funny how many of those countries need us much more than we need them, yet they bark and hiss like they actually matter.) So BrAAAP to the dons and their feelthy peccadilloes.", 
        "reply": "", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:12:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. I wouldn't worry too much; Spain already claimed they won't pursue GW...sovereign immunity. Funny, I always thought because of our Constitution, “We the People” were the sovereign…not a president. On the other hand, to be fair and balanced, the current AG’s office has claimed the federal government can’t be sued based on “sovereign immunity”. You remember the “liberals” complaining about the “Republican” concept of unitary executive…guess the shoes on the other foot now…and I don’t like it any more now than I did then.", 
        "intTime": 20090414, 
        "postID": 18, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "reply": " I wouldn't worry too much; Spain already claimed they won't pursue GW...sovereign immunity. Funny, I always thought because of our Constitution, “We the People” were the sovereign…not a president. On the other hand, to be fair and balanced, the current AG’s office has claimed the federal government can’t be sued based on “sovereign immunity”. You remember the “liberals” complaining about the “Republican” concept of unitary executive…guess the shoes on the other foot now…and I don’t like it any more now than I did then.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:16:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them. Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers.", 
        "intTime": 20090414, 
        "postID": 19, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them.", 
        "reply": " Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:19:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them. Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers. I agree with you in terms of the precedents that could be set. I do not necessarily agree with you that the Bush doctrine regarding Iraq was the \"right thing\". Afghanistan...yes, Iraq, how was that the right thing? The only justification for going to war is \"clear and present danger\", which part of that did Iraq fill? Bare in mind...a clear and present danger to a nation that could wipe all life from the earth 40 times over.", 
        "intTime": 20090414, 
        "postID": 20, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them. Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers.", 
        "reply": " I agree with you in terms of the precedents that could be set. I do not necessarily agree with you that the Bush doctrine regarding Iraq was the \"right thing\". Afghanistan...yes, Iraq, how was that the right thing? The only justification for going to war is \"clear and present danger\", which part of that did Iraq fill? Bare in mind...a clear and present danger to a nation that could wipe all life from the earth 40 times over.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:25:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "\"Scott Horton reports this morning that, in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" Spain not only has the right under the Geneva Conventions and the Convention Against Torture to prosecute foreign officials for torturing its citizens, but it -- like the U.S. -- has the affirmative obligation to do so. (Indeed, the Bush administration itself insisted just last year that the U.S. the right to criminally prosecute foreign officials for ordering acts of torture even in the absence of an accusation that any of the victims were American). As Hilzoy argues, however, the primary obligation for these prosecutions lies with the country whose officials authorized the war crimes -- the United States: It is a requirement of law, the law that the Constitution requires Obama, as President, to faithfully execute. He should not outsource his Constitutional obligations to Spain. That the U.S. has the legal obligation under the U.S. Constitution, our own laws and international treaties to commence criminal investigations is simply undeniable. That is just a fact. Yet it's hard to overstate how far away we are from fulfilling our legal obligations to impose accountability on our own torturers and war criminals. The barriers to these prosecutions are numerous, but one of the principal obstacles is that CIA Director Leon Panetta has been emphatically demanding that there be no investigations of any government officials whose conduct was declared legal by DOJ lawyers (i.e., the very individuals the Spanish are now investigating for war crimes). And it's not surprising that Panetta has taken this position given that at least two of his top deputies at the CIA are among those implicated, to one degree or another, in the torture regime, as John Sifton detailed earlier this month at The Daily Beast: The New York Times reported that Leon Panetta, the current CIA director, has taken the position that “no one who took actions based on legal guidance from the Department of Justice at the time should be investigated, let alone punished.” Yet a number of CIA officials implicated in the torture program not only remain at the highest levels of the agency, but are also advising Panetta. Panetta’s attempt to suppress the issue is making Bush’s policy into the Obama administration’s dirty laundry.\" From Glenn Greenwald's blog on Salon.com We are going to find out if we still have a country or not. Walt", 
        "intTime": 20090414, 
        "postID": 21, 
        "quote": "", 
        "reply": "\"Scott Horton reports this morning that, in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" Spain not only has the right under the Geneva Conventions and the Convention Against Torture to prosecute foreign officials for torturing its citizens, but it -- like the U.S. -- has the affirmative obligation to do so. (Indeed, the Bush administration itself insisted just last year that the U.S. the right to criminally prosecute foreign officials for ordering acts of torture even in the absence of an accusation that any of the victims were American). As Hilzoy argues, however, the primary obligation for these prosecutions lies with the country whose officials authorized the war crimes -- the United States: It is a requirement of law, the law that the Constitution requires Obama, as President, to faithfully execute. He should not outsource his Constitutional obligations to Spain. That the U.S. has the legal obligation under the U.S. Constitution, our own laws and international treaties to commence criminal investigations is simply undeniable. That is just a fact. Yet it's hard to overstate how far away we are from fulfilling our legal obligations to impose accountability on our own torturers and war criminals. The barriers to these prosecutions are numerous, but one of the principal obstacles is that CIA Director Leon Panetta has been emphatically demanding that there be no investigations of any government officials whose conduct was declared legal by DOJ lawyers (i.e., the very individuals the Spanish are now investigating for war crimes). And it's not surprising that Panetta has taken this position given that at least two of his top deputies at the CIA are among those implicated, to one degree or another, in the torture regime, as John Sifton detailed earlier this month at The Daily Beast: The New York Times reported that Leon Panetta, the current CIA director, has taken the position that “no one who took actions based on legal guidance from the Department of Justice at the time should be investigated, let alone punished.” Yet a number of CIA officials implicated in the torture program not only remain at the highest levels of the agency, but are also advising Panetta. Panetta’s attempt to suppress the issue is making Bush’s policy into the Obama administration’s dirty laundry.\" From Glenn Greenwald's blog on Salon.com We are going to find out if we still have a country or not. Walt", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 08:46:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "intTime": 20090414, 
        "postID": 22, 
        "quote": "", 
        "reply": "To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 08:55:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave", 
        "intTime": 20090414, 
        "postID": 23, 
        "quote": "Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "reply": " Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:00:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth.", 
        "intTime": 20090414, 
        "postID": 24, 
        "quote": "Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "reply": " Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:21:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth. Yeah, but we're Americans! Are the Spanish Americans? International Law specifically states that it applies ONLY when WE say it does. (I would give you a link, but I'm busy brushing the dog - a job like no other) I rest my case. Dave", 
        "intTime": 20090414, 
        "postID": 25, 
        "quote": "Originally posted by jwr6: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth.", 
        "reply": " Yeah, but we're Americans! Are the Spanish Americans? International Law specifically states that it applies ONLY when WE say it does. (I would give you a link, but I'm busy brushing the dog - a job like no other) I rest my case. Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:24:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "And the Spanish lawyer that is bringing this was himself jailed for terrorism. This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation.", 
        "intTime": 20090414, 
        "postID": 26, 
        "quote": "", 
        "reply": "And the Spanish lawyer that is bringing this was himself jailed for terrorism. This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:55:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: And the Spanish lawyer that is bringing this was himself jailed for terrorism. You have a link for this? Or was he jailed because he opposed Franco? quote: Originally posted by GunnyRet03: This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation. Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave", 
        "intTime": 20090414, 
        "postID": 27, 
        "quote": "Originally posted by GunnyRet03: And the Spanish lawyer that is bringing this was himself jailed for terrorism.", 
        "reply": " You have a link for this? Or was he jailed because he opposed Franco? quote: Originally posted by GunnyRet03: This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation. Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:24:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "Where were these citizens of Spain captured? Were they in Afghanistan? Just curious.....", 
        "intTime": 20090414, 
        "postID": 28, 
        "quote": "", 
        "reply": "Where were these citizens of Spain captured? Were they in Afghanistan? Just curious.....", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:32:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course.", 
        "intTime": 20090414, 
        "postID": 29, 
        "quote": "Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave", 
        "reply": " Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:36:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: ...in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" war crimes --... ...We are going to find out if we still have a country or not... Yes, we will. If these gutless Spanish cowards succeed in their efforts it will be clear that US national sovereignty is truly dead.", 
        "intTime": 20090414, 
        "postID": 30, 
        "quote": "Originally posted by WhiskeyPapa: ...in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" war crimes --... ...We are going to find out if we still have a country or not...", 
        "reply": " Yes, we will. If these gutless Spanish cowards succeed in their efforts it will be clear that US national sovereignty is truly dead.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:40:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course. You might want to check the post just above yours. It appears that this Judge was jailed for opposing Franco, and is therefore a \"Terrorist.\" Now, as it happens I WILL Bring up slavery, or our treatment of Indians - WHEN IT\"S APPROPRIATE! But I sure wont tar anyone who opposes slavery or our treatment of Indians, when their defending Americans TODAY! What you're implying above is that if Al Qaeda beheads someone, there's going to be someone who reminds us that we killed Indians - So What's the big deal? You have a link to anyone making that comparson? It's STANDARD procedure for the US, to DEMAND that when a country imprisons one of us, they have access to our Council, and they have access to legal council and the means to defend themselves. For years we've been pretending that International Law is whatever we say it is - Sorry, no, Ratified and Signed treaties ARE American Law, and not to be tossed in the garbage because it's not convenient. Dave", 
        "intTime": 20090414, 
        "postID": 31, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course.", 
        "reply": " You might want to check the post just above yours. It appears that this Judge was jailed for opposing Franco, and is therefore a \"Terrorist.\" Now, as it happens I WILL Bring up slavery, or our treatment of Indians - WHEN IT\"S APPROPRIATE! But I sure wont tar anyone who opposes slavery or our treatment of Indians, when their defending Americans TODAY! What you're implying above is that if Al Qaeda beheads someone, there's going to be someone who reminds us that we killed Indians - So What's the big deal? You have a link to anyone making that comparson? It's STANDARD procedure for the US, to DEMAND that when a country imprisons one of us, they have access to our Council, and they have access to legal council and the means to defend themselves. For years we've been pretending that International Law is whatever we say it is - Sorry, no, Ratified and Signed treaties ARE American Law, and not to be tossed in the garbage because it's not convenient. Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:57:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore...", 
        "intTime": 20090414, 
        "postID": 32, 
        "quote": "", 
        "reply": "Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore...", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 14:02:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave Americans that commit crimes in other countries often are. Don't ever find yourself in a Mexican jail for example.", 
        "intTime": 20090414, 
        "postID": 33, 
        "quote": "Originally posted by Grachus: Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave", 
        "reply": " Americans that commit crimes in other countries often are. Don't ever find yourself in a Mexican jail for example.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 15:50:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "Good thing the US never signed onto the World Court idea. Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. So BrAAAP to the dons and their feelthy peccadilloes.", 
        "intTime": 20090414, 
        "postID": 34, 
        "quote": "", 
        "reply": "Good thing the US never signed onto the World Court idea. Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. So BrAAAP to the dons and their feelthy peccadilloes.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 15:51:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "intTime": 20090414, 
        "postID": 35, 
        "quote": "Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore...", 
        "reply": " No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:06:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them.", 
        "intTime": 20090414, 
        "postID": 36, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "reply": " Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:11:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Good thing the US never signed onto the World Court idea. ( One big sham to begin with. Nothing but a world wide kangeroo court.) Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. (They sure do want our tourist business though. Funny how many of those countries need us much more than we need them, yet they bark and hiss like they actually matter.) So BrAAAP to the dons and their feelthy peccadilloes.", 
        "intTime": 20090414, 
        "postID": 37, 
        "quote": "Originally posted by popsiq: Good thing the US never signed onto the World Court idea. ( One big sham to begin with. Nothing but a world wide kangeroo court.) Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. (They sure do want our tourist business though. Funny how many of those countries need us much more than we need them, yet they bark and hiss like they actually matter.) So BrAAAP to the dons and their feelthy peccadilloes.", 
        "reply": "", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:12:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. I wouldn't worry too much; Spain already claimed they won't pursue GW...sovereign immunity. Funny, I always thought because of our Constitution, “We the People” were the sovereign…not a president. On the other hand, to be fair and balanced, the current AG’s office has claimed the federal government can’t be sued based on “sovereign immunity”. You remember the “liberals” complaining about the “Republican” concept of unitary executive…guess the shoes on the other foot now…and I don’t like it any more now than I did then.", 
        "intTime": 20090414, 
        "postID": 38, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "reply": " I wouldn't worry too much; Spain already claimed they won't pursue GW...sovereign immunity. Funny, I always thought because of our Constitution, “We the People” were the sovereign…not a president. On the other hand, to be fair and balanced, the current AG’s office has claimed the federal government can’t be sued based on “sovereign immunity”. You remember the “liberals” complaining about the “Republican” concept of unitary executive…guess the shoes on the other foot now…and I don’t like it any more now than I did then.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:16:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them. Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers.", 
        "intTime": 20090414, 
        "postID": 39, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them.", 
        "reply": " Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:19:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them. Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers. I agree with you in terms of the precedents that could be set. I do not necessarily agree with you that the Bush doctrine regarding Iraq was the \"right thing\". Afghanistan...yes, Iraq, how was that the right thing? The only justification for going to war is \"clear and present danger\", which part of that did Iraq fill? Bare in mind...a clear and present danger to a nation that could wipe all life from the earth 40 times over.", 
        "intTime": 20090414, 
        "postID": 40, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them. Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers.", 
        "reply": " I agree with you in terms of the precedents that could be set. I do not necessarily agree with you that the Bush doctrine regarding Iraq was the \"right thing\". Afghanistan...yes, Iraq, how was that the right thing? The only justification for going to war is \"clear and present danger\", which part of that did Iraq fill? Bare in mind...a clear and present danger to a nation that could wipe all life from the earth 40 times over.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:25:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "\"Scott Horton reports this morning that, in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" Spain not only has the right under the Geneva Conventions and the Convention Against Torture to prosecute foreign officials for torturing its citizens, but it -- like the U.S. -- has the affirmative obligation to do so. (Indeed, the Bush administration itself insisted just last year that the U.S. the right to criminally prosecute foreign officials for ordering acts of torture even in the absence of an accusation that any of the victims were American). As Hilzoy argues, however, the primary obligation for these prosecutions lies with the country whose officials authorized the war crimes -- the United States: It is a requirement of law, the law that the Constitution requires Obama, as President, to faithfully execute. He should not outsource his Constitutional obligations to Spain. That the U.S. has the legal obligation under the U.S. Constitution, our own laws and international treaties to commence criminal investigations is simply undeniable. That is just a fact. Yet it's hard to overstate how far away we are from fulfilling our legal obligations to impose accountability on our own torturers and war criminals. The barriers to these prosecutions are numerous, but one of the principal obstacles is that CIA Director Leon Panetta has been emphatically demanding that there be no investigations of any government officials whose conduct was declared legal by DOJ lawyers (i.e., the very individuals the Spanish are now investigating for war crimes). And it's not surprising that Panetta has taken this position given that at least two of his top deputies at the CIA are among those implicated, to one degree or another, in the torture regime, as John Sifton detailed earlier this month at The Daily Beast: The New York Times reported that Leon Panetta, the current CIA director, has taken the position that “no one who took actions based on legal guidance from the Department of Justice at the time should be investigated, let alone punished.” Yet a number of CIA officials implicated in the torture program not only remain at the highest levels of the agency, but are also advising Panetta. Panetta’s attempt to suppress the issue is making Bush’s policy into the Obama administration’s dirty laundry.\" From Glenn Greenwald's blog on Salon.com We are going to find out if we still have a country or not. Walt", 
        "intTime": 20090414, 
        "postID": 41, 
        "quote": "", 
        "reply": "\"Scott Horton reports this morning that, in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" Spain not only has the right under the Geneva Conventions and the Convention Against Torture to prosecute foreign officials for torturing its citizens, but it -- like the U.S. -- has the affirmative obligation to do so. (Indeed, the Bush administration itself insisted just last year that the U.S. the right to criminally prosecute foreign officials for ordering acts of torture even in the absence of an accusation that any of the victims were American). As Hilzoy argues, however, the primary obligation for these prosecutions lies with the country whose officials authorized the war crimes -- the United States: It is a requirement of law, the law that the Constitution requires Obama, as President, to faithfully execute. He should not outsource his Constitutional obligations to Spain. That the U.S. has the legal obligation under the U.S. Constitution, our own laws and international treaties to commence criminal investigations is simply undeniable. That is just a fact. Yet it's hard to overstate how far away we are from fulfilling our legal obligations to impose accountability on our own torturers and war criminals. The barriers to these prosecutions are numerous, but one of the principal obstacles is that CIA Director Leon Panetta has been emphatically demanding that there be no investigations of any government officials whose conduct was declared legal by DOJ lawyers (i.e., the very individuals the Spanish are now investigating for war crimes). And it's not surprising that Panetta has taken this position given that at least two of his top deputies at the CIA are among those implicated, to one degree or another, in the torture regime, as John Sifton detailed earlier this month at The Daily Beast: The New York Times reported that Leon Panetta, the current CIA director, has taken the position that “no one who took actions based on legal guidance from the Department of Justice at the time should be investigated, let alone punished.” Yet a number of CIA officials implicated in the torture program not only remain at the highest levels of the agency, but are also advising Panetta. Panetta’s attempt to suppress the issue is making Bush’s policy into the Obama administration’s dirty laundry.\" From Glenn Greenwald's blog on Salon.com We are going to find out if we still have a country or not. Walt", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 08:46:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "intTime": 20090414, 
        "postID": 42, 
        "quote": "", 
        "reply": "To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 08:55:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave", 
        "intTime": 20090414, 
        "postID": 43, 
        "quote": "Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "reply": " Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:00:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth.", 
        "intTime": 20090414, 
        "postID": 44, 
        "quote": "Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "reply": " Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:21:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth. Yeah, but we're Americans! Are the Spanish Americans? International Law specifically states that it applies ONLY when WE say it does. (I would give you a link, but I'm busy brushing the dog - a job like no other) I rest my case. Dave", 
        "intTime": 20090414, 
        "postID": 45, 
        "quote": "Originally posted by jwr6: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth.", 
        "reply": " Yeah, but we're Americans! Are the Spanish Americans? International Law specifically states that it applies ONLY when WE say it does. (I would give you a link, but I'm busy brushing the dog - a job like no other) I rest my case. Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:24:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "And the Spanish lawyer that is bringing this was himself jailed for terrorism. This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation.", 
        "intTime": 20090414, 
        "postID": 46, 
        "quote": "", 
        "reply": "And the Spanish lawyer that is bringing this was himself jailed for terrorism. This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:55:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: And the Spanish lawyer that is bringing this was himself jailed for terrorism. You have a link for this? Or was he jailed because he opposed Franco? quote: Originally posted by GunnyRet03: This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation. Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave", 
        "intTime": 20090414, 
        "postID": 47, 
        "quote": "Originally posted by GunnyRet03: And the Spanish lawyer that is bringing this was himself jailed for terrorism.", 
        "reply": " You have a link for this? Or was he jailed because he opposed Franco? quote: Originally posted by GunnyRet03: This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation. Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:24:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "Where were these citizens of Spain captured? Were they in Afghanistan? Just curious.....", 
        "intTime": 20090414, 
        "postID": 48, 
        "quote": "", 
        "reply": "Where were these citizens of Spain captured? Were they in Afghanistan? Just curious.....", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:32:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course.", 
        "intTime": 20090414, 
        "postID": 49, 
        "quote": "Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave", 
        "reply": " Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:36:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: ...in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" war crimes --... ...We are going to find out if we still have a country or not... Yes, we will. If these gutless Spanish cowards succeed in their efforts it will be clear that US national sovereignty is truly dead.", 
        "intTime": 20090414, 
        "postID": 50, 
        "quote": "Originally posted by WhiskeyPapa: ...in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" war crimes --... ...We are going to find out if we still have a country or not...", 
        "reply": " Yes, we will. If these gutless Spanish cowards succeed in their efforts it will be clear that US national sovereignty is truly dead.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:40:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course. You might want to check the post just above yours. It appears that this Judge was jailed for opposing Franco, and is therefore a \"Terrorist.\" Now, as it happens I WILL Bring up slavery, or our treatment of Indians - WHEN IT\"S APPROPRIATE! But I sure wont tar anyone who opposes slavery or our treatment of Indians, when their defending Americans TODAY! What you're implying above is that if Al Qaeda beheads someone, there's going to be someone who reminds us that we killed Indians - So What's the big deal? You have a link to anyone making that comparson? It's STANDARD procedure for the US, to DEMAND that when a country imprisons one of us, they have access to our Council, and they have access to legal council and the means to defend themselves. For years we've been pretending that International Law is whatever we say it is - Sorry, no, Ratified and Signed treaties ARE American Law, and not to be tossed in the garbage because it's not convenient. Dave", 
        "intTime": 20090414, 
        "postID": 51, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course.", 
        "reply": " You might want to check the post just above yours. It appears that this Judge was jailed for opposing Franco, and is therefore a \"Terrorist.\" Now, as it happens I WILL Bring up slavery, or our treatment of Indians - WHEN IT\"S APPROPRIATE! But I sure wont tar anyone who opposes slavery or our treatment of Indians, when their defending Americans TODAY! What you're implying above is that if Al Qaeda beheads someone, there's going to be someone who reminds us that we killed Indians - So What's the big deal? You have a link to anyone making that comparson? It's STANDARD procedure for the US, to DEMAND that when a country imprisons one of us, they have access to our Council, and they have access to legal council and the means to defend themselves. For years we've been pretending that International Law is whatever we say it is - Sorry, no, Ratified and Signed treaties ARE American Law, and not to be tossed in the garbage because it's not convenient. Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:57:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore...", 
        "intTime": 20090414, 
        "postID": 52, 
        "quote": "", 
        "reply": "Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore...", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 14:02:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave Americans that commit crimes in other countries often are. Don't ever find yourself in a Mexican jail for example.", 
        "intTime": 20090414, 
        "postID": 53, 
        "quote": "Originally posted by Grachus: Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave", 
        "reply": " Americans that commit crimes in other countries often are. Don't ever find yourself in a Mexican jail for example.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 15:50:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "Good thing the US never signed onto the World Court idea. Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. So BrAAAP to the dons and their feelthy peccadilloes.", 
        "intTime": 20090414, 
        "postID": 54, 
        "quote": "", 
        "reply": "Good thing the US never signed onto the World Court idea. Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. So BrAAAP to the dons and their feelthy peccadilloes.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 15:51:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "intTime": 20090414, 
        "postID": 55, 
        "quote": "Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore...", 
        "reply": " No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:06:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them.", 
        "intTime": 20090414, 
        "postID": 56, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "reply": " Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:11:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Good thing the US never signed onto the World Court idea. ( One big sham to begin with. Nothing but a world wide kangeroo court.) Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. (They sure do want our tourist business though. Funny how many of those countries need us much more than we need them, yet they bark and hiss like they actually matter.) So BrAAAP to the dons and their feelthy peccadilloes.", 
        "intTime": 20090414, 
        "postID": 57, 
        "quote": "Originally posted by popsiq: Good thing the US never signed onto the World Court idea. ( One big sham to begin with. Nothing but a world wide kangeroo court.) Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. (They sure do want our tourist business though. Funny how many of those countries need us much more than we need them, yet they bark and hiss like they actually matter.) So BrAAAP to the dons and their feelthy peccadilloes.", 
        "reply": "", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:12:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. I wouldn't worry too much; Spain already claimed they won't pursue GW...sovereign immunity. Funny, I always thought because of our Constitution, “We the People” were the sovereign…not a president. On the other hand, to be fair and balanced, the current AG’s office has claimed the federal government can’t be sued based on “sovereign immunity”. You remember the “liberals” complaining about the “Republican” concept of unitary executive…guess the shoes on the other foot now…and I don’t like it any more now than I did then.", 
        "intTime": 20090414, 
        "postID": 58, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "reply": " I wouldn't worry too much; Spain already claimed they won't pursue GW...sovereign immunity. Funny, I always thought because of our Constitution, “We the People” were the sovereign…not a president. On the other hand, to be fair and balanced, the current AG’s office has claimed the federal government can’t be sued based on “sovereign immunity”. You remember the “liberals” complaining about the “Republican” concept of unitary executive…guess the shoes on the other foot now…and I don’t like it any more now than I did then.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:16:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them. Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers.", 
        "intTime": 20090414, 
        "postID": 59, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them.", 
        "reply": " Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:19:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them. Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers. I agree with you in terms of the precedents that could be set. I do not necessarily agree with you that the Bush doctrine regarding Iraq was the \"right thing\". Afghanistan...yes, Iraq, how was that the right thing? The only justification for going to war is \"clear and present danger\", which part of that did Iraq fill? Bare in mind...a clear and present danger to a nation that could wipe all life from the earth 40 times over.", 
        "intTime": 20090414, 
        "postID": 60, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them. Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers.", 
        "reply": " I agree with you in terms of the precedents that could be set. I do not necessarily agree with you that the Bush doctrine regarding Iraq was the \"right thing\". Afghanistan...yes, Iraq, how was that the right thing? The only justification for going to war is \"clear and present danger\", which part of that did Iraq fill? Bare in mind...a clear and present danger to a nation that could wipe all life from the earth 40 times over.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:25:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "\"Scott Horton reports this morning that, in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" Spain not only has the right under the Geneva Conventions and the Convention Against Torture to prosecute foreign officials for torturing its citizens, but it -- like the U.S. -- has the affirmative obligation to do so. (Indeed, the Bush administration itself insisted just last year that the U.S. the right to criminally prosecute foreign officials for ordering acts of torture even in the absence of an accusation that any of the victims were American). As Hilzoy argues, however, the primary obligation for these prosecutions lies with the country whose officials authorized the war crimes -- the United States: It is a requirement of law, the law that the Constitution requires Obama, as President, to faithfully execute. He should not outsource his Constitutional obligations to Spain. That the U.S. has the legal obligation under the U.S. Constitution, our own laws and international treaties to commence criminal investigations is simply undeniable. That is just a fact. Yet it's hard to overstate how far away we are from fulfilling our legal obligations to impose accountability on our own torturers and war criminals. The barriers to these prosecutions are numerous, but one of the principal obstacles is that CIA Director Leon Panetta has been emphatically demanding that there be no investigations of any government officials whose conduct was declared legal by DOJ lawyers (i.e., the very individuals the Spanish are now investigating for war crimes). And it's not surprising that Panetta has taken this position given that at least two of his top deputies at the CIA are among those implicated, to one degree or another, in the torture regime, as John Sifton detailed earlier this month at The Daily Beast: The New York Times reported that Leon Panetta, the current CIA director, has taken the position that “no one who took actions based on legal guidance from the Department of Justice at the time should be investigated, let alone punished.” Yet a number of CIA officials implicated in the torture program not only remain at the highest levels of the agency, but are also advising Panetta. Panetta’s attempt to suppress the issue is making Bush’s policy into the Obama administration’s dirty laundry.\" From Glenn Greenwald's blog on Salon.com We are going to find out if we still have a country or not. Walt", 
        "intTime": 20090414, 
        "postID": 61, 
        "quote": "", 
        "reply": "\"Scott Horton reports this morning that, in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" Spain not only has the right under the Geneva Conventions and the Convention Against Torture to prosecute foreign officials for torturing its citizens, but it -- like the U.S. -- has the affirmative obligation to do so. (Indeed, the Bush administration itself insisted just last year that the U.S. the right to criminally prosecute foreign officials for ordering acts of torture even in the absence of an accusation that any of the victims were American). As Hilzoy argues, however, the primary obligation for these prosecutions lies with the country whose officials authorized the war crimes -- the United States: It is a requirement of law, the law that the Constitution requires Obama, as President, to faithfully execute. He should not outsource his Constitutional obligations to Spain. That the U.S. has the legal obligation under the U.S. Constitution, our own laws and international treaties to commence criminal investigations is simply undeniable. That is just a fact. Yet it's hard to overstate how far away we are from fulfilling our legal obligations to impose accountability on our own torturers and war criminals. The barriers to these prosecutions are numerous, but one of the principal obstacles is that CIA Director Leon Panetta has been emphatically demanding that there be no investigations of any government officials whose conduct was declared legal by DOJ lawyers (i.e., the very individuals the Spanish are now investigating for war crimes). And it's not surprising that Panetta has taken this position given that at least two of his top deputies at the CIA are among those implicated, to one degree or another, in the torture regime, as John Sifton detailed earlier this month at The Daily Beast: The New York Times reported that Leon Panetta, the current CIA director, has taken the position that “no one who took actions based on legal guidance from the Department of Justice at the time should be investigated, let alone punished.” Yet a number of CIA officials implicated in the torture program not only remain at the highest levels of the agency, but are also advising Panetta. Panetta’s attempt to suppress the issue is making Bush’s policy into the Obama administration’s dirty laundry.\" From Glenn Greenwald's blog on Salon.com We are going to find out if we still have a country or not. Walt", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 08:46:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "intTime": 20090414, 
        "postID": 62, 
        "quote": "", 
        "reply": "To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 08:55:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave", 
        "intTime": 20090414, 
        "postID": 63, 
        "quote": "Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "reply": " Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:00:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth.", 
        "intTime": 20090414, 
        "postID": 64, 
        "quote": "Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "reply": " Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:21:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth. Yeah, but we're Americans! Are the Spanish Americans? International Law specifically states that it applies ONLY when WE say it does. (I would give you a link, but I'm busy brushing the dog - a job like no other) I rest my case. Dave", 
        "intTime": 20090414, 
        "postID": 65, 
        "quote": "Originally posted by jwr6: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth.", 
        "reply": " Yeah, but we're Americans! Are the Spanish Americans? International Law specifically states that it applies ONLY when WE say it does. (I would give you a link, but I'm busy brushing the dog - a job like no other) I rest my case. Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:24:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "And the Spanish lawyer that is bringing this was himself jailed for terrorism. This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation.", 
        "intTime": 20090414, 
        "postID": 66, 
        "quote": "", 
        "reply": "And the Spanish lawyer that is bringing this was himself jailed for terrorism. This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:55:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: And the Spanish lawyer that is bringing this was himself jailed for terrorism. You have a link for this? Or was he jailed because he opposed Franco? quote: Originally posted by GunnyRet03: This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation. Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave", 
        "intTime": 20090414, 
        "postID": 67, 
        "quote": "Originally posted by GunnyRet03: And the Spanish lawyer that is bringing this was himself jailed for terrorism.", 
        "reply": " You have a link for this? Or was he jailed because he opposed Franco? quote: Originally posted by GunnyRet03: This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation. Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:24:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "Where were these citizens of Spain captured? Were they in Afghanistan? Just curious.....", 
        "intTime": 20090414, 
        "postID": 68, 
        "quote": "", 
        "reply": "Where were these citizens of Spain captured? Were they in Afghanistan? Just curious.....", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:32:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course.", 
        "intTime": 20090414, 
        "postID": 69, 
        "quote": "Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave", 
        "reply": " Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:36:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: ...in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" war crimes --... ...We are going to find out if we still have a country or not... Yes, we will. If these gutless Spanish cowards succeed in their efforts it will be clear that US national sovereignty is truly dead.", 
        "intTime": 20090414, 
        "postID": 70, 
        "quote": "Originally posted by WhiskeyPapa: ...in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" war crimes --... ...We are going to find out if we still have a country or not...", 
        "reply": " Yes, we will. If these gutless Spanish cowards succeed in their efforts it will be clear that US national sovereignty is truly dead.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:40:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course. You might want to check the post just above yours. It appears that this Judge was jailed for opposing Franco, and is therefore a \"Terrorist.\" Now, as it happens I WILL Bring up slavery, or our treatment of Indians - WHEN IT\"S APPROPRIATE! But I sure wont tar anyone who opposes slavery or our treatment of Indians, when their defending Americans TODAY! What you're implying above is that if Al Qaeda beheads someone, there's going to be someone who reminds us that we killed Indians - So What's the big deal? You have a link to anyone making that comparson? It's STANDARD procedure for the US, to DEMAND that when a country imprisons one of us, they have access to our Council, and they have access to legal council and the means to defend themselves. For years we've been pretending that International Law is whatever we say it is - Sorry, no, Ratified and Signed treaties ARE American Law, and not to be tossed in the garbage because it's not convenient. Dave", 
        "intTime": 20090414, 
        "postID": 71, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course.", 
        "reply": " You might want to check the post just above yours. It appears that this Judge was jailed for opposing Franco, and is therefore a \"Terrorist.\" Now, as it happens I WILL Bring up slavery, or our treatment of Indians - WHEN IT\"S APPROPRIATE! But I sure wont tar anyone who opposes slavery or our treatment of Indians, when their defending Americans TODAY! What you're implying above is that if Al Qaeda beheads someone, there's going to be someone who reminds us that we killed Indians - So What's the big deal? You have a link to anyone making that comparson? It's STANDARD procedure for the US, to DEMAND that when a country imprisons one of us, they have access to our Council, and they have access to legal council and the means to defend themselves. For years we've been pretending that International Law is whatever we say it is - Sorry, no, Ratified and Signed treaties ARE American Law, and not to be tossed in the garbage because it's not convenient. Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:57:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore...", 
        "intTime": 20090414, 
        "postID": 72, 
        "quote": "", 
        "reply": "Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore...", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 14:02:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave Americans that commit crimes in other countries often are. Don't ever find yourself in a Mexican jail for example.", 
        "intTime": 20090414, 
        "postID": 73, 
        "quote": "Originally posted by Grachus: Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave", 
        "reply": " Americans that commit crimes in other countries often are. Don't ever find yourself in a Mexican jail for example.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 15:50:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "Good thing the US never signed onto the World Court idea. Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. So BrAAAP to the dons and their feelthy peccadilloes.", 
        "intTime": 20090414, 
        "postID": 74, 
        "quote": "", 
        "reply": "Good thing the US never signed onto the World Court idea. Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. So BrAAAP to the dons and their feelthy peccadilloes.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 15:51:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "intTime": 20090414, 
        "postID": 75, 
        "quote": "Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore...", 
        "reply": " No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:06:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them.", 
        "intTime": 20090414, 
        "postID": 76, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "reply": " Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:11:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Good thing the US never signed onto the World Court idea. ( One big sham to begin with. Nothing but a world wide kangeroo court.) Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. (They sure do want our tourist business though. Funny how many of those countries need us much more than we need them, yet they bark and hiss like they actually matter.) So BrAAAP to the dons and their feelthy peccadilloes.", 
        "intTime": 20090414, 
        "postID": 77, 
        "quote": "Originally posted by popsiq: Good thing the US never signed onto the World Court idea. ( One big sham to begin with. Nothing but a world wide kangeroo court.) Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. (They sure do want our tourist business though. Funny how many of those countries need us much more than we need them, yet they bark and hiss like they actually matter.) So BrAAAP to the dons and their feelthy peccadilloes.", 
        "reply": "", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:12:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. I wouldn't worry too much; Spain already claimed they won't pursue GW...sovereign immunity. Funny, I always thought because of our Constitution, “We the People” were the sovereign…not a president. On the other hand, to be fair and balanced, the current AG’s office has claimed the federal government can’t be sued based on “sovereign immunity”. You remember the “liberals” complaining about the “Republican” concept of unitary executive…guess the shoes on the other foot now…and I don’t like it any more now than I did then.", 
        "intTime": 20090414, 
        "postID": 78, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "reply": " I wouldn't worry too much; Spain already claimed they won't pursue GW...sovereign immunity. Funny, I always thought because of our Constitution, “We the People” were the sovereign…not a president. On the other hand, to be fair and balanced, the current AG’s office has claimed the federal government can’t be sued based on “sovereign immunity”. You remember the “liberals” complaining about the “Republican” concept of unitary executive…guess the shoes on the other foot now…and I don’t like it any more now than I did then.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:16:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them. Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers.", 
        "intTime": 20090414, 
        "postID": 79, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them.", 
        "reply": " Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:19:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them. Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers. I agree with you in terms of the precedents that could be set. I do not necessarily agree with you that the Bush doctrine regarding Iraq was the \"right thing\". Afghanistan...yes, Iraq, how was that the right thing? The only justification for going to war is \"clear and present danger\", which part of that did Iraq fill? Bare in mind...a clear and present danger to a nation that could wipe all life from the earth 40 times over.", 
        "intTime": 20090414, 
        "postID": 80, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them. Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers.", 
        "reply": " I agree with you in terms of the precedents that could be set. I do not necessarily agree with you that the Bush doctrine regarding Iraq was the \"right thing\". Afghanistan...yes, Iraq, how was that the right thing? The only justification for going to war is \"clear and present danger\", which part of that did Iraq fill? Bare in mind...a clear and present danger to a nation that could wipe all life from the earth 40 times over.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:25:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "\"Scott Horton reports this morning that, in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" Spain not only has the right under the Geneva Conventions and the Convention Against Torture to prosecute foreign officials for torturing its citizens, but it -- like the U.S. -- has the affirmative obligation to do so. (Indeed, the Bush administration itself insisted just last year that the U.S. the right to criminally prosecute foreign officials for ordering acts of torture even in the absence of an accusation that any of the victims were American). As Hilzoy argues, however, the primary obligation for these prosecutions lies with the country whose officials authorized the war crimes -- the United States: It is a requirement of law, the law that the Constitution requires Obama, as President, to faithfully execute. He should not outsource his Constitutional obligations to Spain. That the U.S. has the legal obligation under the U.S. Constitution, our own laws and international treaties to commence criminal investigations is simply undeniable. That is just a fact. Yet it's hard to overstate how far away we are from fulfilling our legal obligations to impose accountability on our own torturers and war criminals. The barriers to these prosecutions are numerous, but one of the principal obstacles is that CIA Director Leon Panetta has been emphatically demanding that there be no investigations of any government officials whose conduct was declared legal by DOJ lawyers (i.e., the very individuals the Spanish are now investigating for war crimes). And it's not surprising that Panetta has taken this position given that at least two of his top deputies at the CIA are among those implicated, to one degree or another, in the torture regime, as John Sifton detailed earlier this month at The Daily Beast: The New York Times reported that Leon Panetta, the current CIA director, has taken the position that “no one who took actions based on legal guidance from the Department of Justice at the time should be investigated, let alone punished.” Yet a number of CIA officials implicated in the torture program not only remain at the highest levels of the agency, but are also advising Panetta. Panetta’s attempt to suppress the issue is making Bush’s policy into the Obama administration’s dirty laundry.\" From Glenn Greenwald's blog on Salon.com We are going to find out if we still have a country or not. Walt", 
        "intTime": 20090414, 
        "postID": 81, 
        "quote": "", 
        "reply": "\"Scott Horton reports this morning that, in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" Spain not only has the right under the Geneva Conventions and the Convention Against Torture to prosecute foreign officials for torturing its citizens, but it -- like the U.S. -- has the affirmative obligation to do so. (Indeed, the Bush administration itself insisted just last year that the U.S. the right to criminally prosecute foreign officials for ordering acts of torture even in the absence of an accusation that any of the victims were American). As Hilzoy argues, however, the primary obligation for these prosecutions lies with the country whose officials authorized the war crimes -- the United States: It is a requirement of law, the law that the Constitution requires Obama, as President, to faithfully execute. He should not outsource his Constitutional obligations to Spain. That the U.S. has the legal obligation under the U.S. Constitution, our own laws and international treaties to commence criminal investigations is simply undeniable. That is just a fact. Yet it's hard to overstate how far away we are from fulfilling our legal obligations to impose accountability on our own torturers and war criminals. The barriers to these prosecutions are numerous, but one of the principal obstacles is that CIA Director Leon Panetta has been emphatically demanding that there be no investigations of any government officials whose conduct was declared legal by DOJ lawyers (i.e., the very individuals the Spanish are now investigating for war crimes). And it's not surprising that Panetta has taken this position given that at least two of his top deputies at the CIA are among those implicated, to one degree or another, in the torture regime, as John Sifton detailed earlier this month at The Daily Beast: The New York Times reported that Leon Panetta, the current CIA director, has taken the position that “no one who took actions based on legal guidance from the Department of Justice at the time should be investigated, let alone punished.” Yet a number of CIA officials implicated in the torture program not only remain at the highest levels of the agency, but are also advising Panetta. Panetta’s attempt to suppress the issue is making Bush’s policy into the Obama administration’s dirty laundry.\" From Glenn Greenwald's blog on Salon.com We are going to find out if we still have a country or not. Walt", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 08:46:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "WhiskeyPapa"
    }, 
    {
        "content": "To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "intTime": 20090414, 
        "postID": 82, 
        "quote": "", 
        "reply": "To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 08:55:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "donniejanuarysr"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave", 
        "intTime": 20090414, 
        "postID": 83, 
        "quote": "Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "reply": " Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:00:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth.", 
        "intTime": 20090414, 
        "postID": 84, 
        "quote": "Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J.", 
        "reply": " Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:21:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth. Yeah, but we're Americans! Are the Spanish Americans? International Law specifically states that it applies ONLY when WE say it does. (I would give you a link, but I'm busy brushing the dog - a job like no other) I rest my case. Dave", 
        "intTime": 20090414, 
        "postID": 85, 
        "quote": "Originally posted by jwr6: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Spain isn't doing anything that we wouldn't if they or any other 1st-world country captured or arrested 5 American citizens, slapped them in a detention center with no evidence, denied them any right to challenge their detention and then tortured them. Matter of fact, you would be screaming like a raped ape for us to drop paratroopers on thenir detention facility to rescue our citizens. You would be screaming about \"innocent until proven guilty\" and any country that approved the torture of our citizens deserved to be summarily nuked off the face of the earth.", 
        "reply": " Yeah, but we're Americans! Are the Spanish Americans? International Law specifically states that it applies ONLY when WE say it does. (I would give you a link, but I'm busy brushing the dog - a job like no other) I rest my case. Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:24:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "And the Spanish lawyer that is bringing this was himself jailed for terrorism. This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation.", 
        "intTime": 20090414, 
        "postID": 86, 
        "quote": "", 
        "reply": "And the Spanish lawyer that is bringing this was himself jailed for terrorism. This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 12:55:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "GunnyRet03"
    }, 
    {
        "content": "quote: Originally posted by GunnyRet03: And the Spanish lawyer that is bringing this was himself jailed for terrorism. You have a link for this? Or was he jailed because he opposed Franco? quote: Originally posted by GunnyRet03: This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation. Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave", 
        "intTime": 20090414, 
        "postID": 87, 
        "quote": "Originally posted by GunnyRet03: And the Spanish lawyer that is bringing this was himself jailed for terrorism.", 
        "reply": " You have a link for this? Or was he jailed because he opposed Franco? quote: Originally posted by GunnyRet03: This is moronic and anyone that sees this as ok, I guess cant figure out that this would set precedence. And Countries all over the world would be doing this everytime a President left office. Btw, I would oppose this even if PrezBo were in this situation. Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:24:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "Where were these citizens of Spain captured? Were they in Afghanistan? Just curious.....", 
        "intTime": 20090414, 
        "postID": 88, 
        "quote": "", 
        "reply": "Where were these citizens of Spain captured? Were they in Afghanistan? Just curious.....", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:32:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "sw614"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course.", 
        "intTime": 20090414, 
        "postID": 89, 
        "quote": "Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave", 
        "reply": " Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:36:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by WhiskeyPapa: ...in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" war crimes --... ...We are going to find out if we still have a country or not... Yes, we will. If these gutless Spanish cowards succeed in their efforts it will be clear that US national sovereignty is truly dead.", 
        "intTime": 20090414, 
        "postID": 90, 
        "quote": "Originally posted by WhiskeyPapa: ...in Spain, \"prosecutors have decided to press forward with a criminal investigation targeting former U.S. Attorney General Alberto Gonzales and five top associates [John Yoo, Jay Bybee, David Addington, Doug Feith and William Haynes] over their role in the torture of five Spanish citizens held at Guantánamo.\" war crimes --... ...We are going to find out if we still have a country or not...", 
        "reply": " Yes, we will. If these gutless Spanish cowards succeed in their efforts it will be clear that US national sovereignty is truly dead.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:40:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "shades_of_grey"
    }, 
    {
        "content": "quote: Originally posted by shades_of_grey: quote: Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course. You might want to check the post just above yours. It appears that this Judge was jailed for opposing Franco, and is therefore a \"Terrorist.\" Now, as it happens I WILL Bring up slavery, or our treatment of Indians - WHEN IT\"S APPROPRIATE! But I sure wont tar anyone who opposes slavery or our treatment of Indians, when their defending Americans TODAY! What you're implying above is that if Al Qaeda beheads someone, there's going to be someone who reminds us that we killed Indians - So What's the big deal? You have a link to anyone making that comparson? It's STANDARD procedure for the US, to DEMAND that when a country imprisons one of us, they have access to our Council, and they have access to legal council and the means to defend themselves. For years we've been pretending that International Law is whatever we say it is - Sorry, no, Ratified and Signed treaties ARE American Law, and not to be tossed in the garbage because it's not convenient. Dave", 
        "intTime": 20090414, 
        "postID": 91, 
        "quote": "Originally posted by shades_of_grey: quote: Originally posted by Grachus: quote: Originally posted by donniejanuarysr: To H-LL with spain and the horse it rode in on, Spain is a country that has probably commeted more war crimes in its history then can be counted. D.J. Yeah, old Cortez was a mass killer, and let's not forget the Dutch Rebellion. When did all these events occur? A couple of weeks ago? Dave Have we forgotten Francisco Franco, Spanish dictator and pal of Hitler, Dave? Besides which, if things that happened more than a couple weeks ago don't matter, can libs finally stop digging up the corpse of American slavery every time it suits them to do so? Of course they won't, cause that's something \"we\" did wrong, hundreds of years ago. The rest of the world gets carte blanche, of course.", 
        "reply": " You might want to check the post just above yours. It appears that this Judge was jailed for opposing Franco, and is therefore a \"Terrorist.\" Now, as it happens I WILL Bring up slavery, or our treatment of Indians - WHEN IT\"S APPROPRIATE! But I sure wont tar anyone who opposes slavery or our treatment of Indians, when their defending Americans TODAY! What you're implying above is that if Al Qaeda beheads someone, there's going to be someone who reminds us that we killed Indians - So What's the big deal? You have a link to anyone making that comparson? It's STANDARD procedure for the US, to DEMAND that when a country imprisons one of us, they have access to our Council, and they have access to legal council and the means to defend themselves. For years we've been pretending that International Law is whatever we say it is - Sorry, no, Ratified and Signed treaties ARE American Law, and not to be tossed in the garbage because it's not convenient. Dave", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 13:57:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Grachus"
    }, 
    {
        "content": "Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore...", 
        "intTime": 20090414, 
        "postID": 92, 
        "quote": "", 
        "reply": "Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore...", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 14:02:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave Americans that commit crimes in other countries often are. Don't ever find yourself in a Mexican jail for example.", 
        "intTime": 20090414, 
        "postID": 93, 
        "quote": "Originally posted by Grachus: Maybe, but if Americans were being held by another country, and denied access to council, we would be justifiably pizzed. Dave", 
        "reply": " Americans that commit crimes in other countries often are. Don't ever find yourself in a Mexican jail for example.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 15:50:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "Good thing the US never signed onto the World Court idea. Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. So BrAAAP to the dons and their feelthy peccadilloes.", 
        "intTime": 20090414, 
        "postID": 94, 
        "quote": "", 
        "reply": "Good thing the US never signed onto the World Court idea. Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. So BrAAAP to the dons and their feelthy peccadilloes.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 15:51:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "popsiq"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "intTime": 20090414, 
        "postID": 95, 
        "quote": "Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore...", 
        "reply": " No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:06:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them.", 
        "intTime": 20090414, 
        "postID": 96, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "reply": " Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:11:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by popsiq: Good thing the US never signed onto the World Court idea. ( One big sham to begin with. Nothing but a world wide kangeroo court.) Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. (They sure do want our tourist business though. Funny how many of those countries need us much more than we need them, yet they bark and hiss like they actually matter.) So BrAAAP to the dons and their feelthy peccadilloes.", 
        "intTime": 20090414, 
        "postID": 97, 
        "quote": "Originally posted by popsiq: Good thing the US never signed onto the World Court idea. ( One big sham to begin with. Nothing but a world wide kangeroo court.) Looking on the bright side, most Americans get by quite well without ever having to leave CONUS. (They sure do want our tourist business though. Funny how many of those countries need us much more than we need them, yet they bark and hiss like they actually matter.) So BrAAAP to the dons and their feelthy peccadilloes.", 
        "reply": "", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:12:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. I wouldn't worry too much; Spain already claimed they won't pursue GW...sovereign immunity. Funny, I always thought because of our Constitution, “We the People” were the sovereign…not a president. On the other hand, to be fair and balanced, the current AG’s office has claimed the federal government can’t be sued based on “sovereign immunity”. You remember the “liberals” complaining about the “Republican” concept of unitary executive…guess the shoes on the other foot now…and I don’t like it any more now than I did then.", 
        "intTime": 20090414, 
        "postID": 98, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you.", 
        "reply": " I wouldn't worry too much; Spain already claimed they won't pursue GW...sovereign immunity. Funny, I always thought because of our Constitution, “We the People” were the sovereign…not a president. On the other hand, to be fair and balanced, the current AG’s office has claimed the federal government can’t be sued based on “sovereign immunity”. You remember the “liberals” complaining about the “Republican” concept of unitary executive…guess the shoes on the other foot now…and I don’t like it any more now than I did then.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:16:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Ol_Doc"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them. Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers.", 
        "intTime": 20090414, 
        "postID": 99, 
        "quote": "Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them.", 
        "reply": " Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:19:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Raunchy"
    }, 
    {
        "content": "quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them. Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers. I agree with you in terms of the precedents that could be set. I do not necessarily agree with you that the Bush doctrine regarding Iraq was the \"right thing\". Afghanistan...yes, Iraq, how was that the right thing? The only justification for going to war is \"clear and present danger\", which part of that did Iraq fill? Bare in mind...a clear and present danger to a nation that could wipe all life from the earth 40 times over.", 
        "intTime": 20090414, 
        "postID": 100, 
        "quote": "Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: quote: Originally posted by Raunchy: quote: Originally posted by Irwin_R_Schyster: Looks like those Bushies won't be needing their passports anymore...I wouldn't set foot anywhere outside the country if I were them.. This isn't a game anymore... No, it's not a game. All the idiots that think this is cool have no idea what a precedent it could set. Every pizzant country on the globe could issue a warrant for past presidents on any BS issue. Spain can't even deal with the Muslim threats without waving the white flag and they want to mess with us? We will take care of our own without any help from a 4th rate power such as they are, thank you. Understood, however; they were one of only 2 relevant nations that supported the Bush doctrine, and boy did that prove to be a disastrous political move for them. Doing the right thing is not always politically expedient. A real leader does what he thinks is right without the need of polling groups or sticking a wet finger in the air. Sometimes when you are convinced you are right, you have to be willing to be the only one standing in a room full of naysayers.", 
        "reply": " I agree with you in terms of the precedents that could be set. I do not necessarily agree with you that the Bush doctrine regarding Iraq was the \"right thing\". Afghanistan...yes, Iraq, how was that the right thing? The only justification for going to war is \"clear and present danger\", which part of that did Iraq fill? Bare in mind...a clear and present danger to a nation that could wipe all life from the earth 40 times over.", 
        "threadID": "672198221_5280086022001", 
        "time": "2009-04-14 16:25:00", 
        "title": "Spain Will Prosecute Bush Admin Officials", 
        "userID": "Ol_Doc"
    }
]