[
    {
        "content": "So is Russia the only foreign country that recognizes these two breakaway regions of Georgia as independent? quote: South Ossetia to allow Russian bases for 99 years: report Agence France-Presse | 03/11/2009 11:43 PM TBILISI - Georgia's breakaway region of South Ossetia said Wednesday it was prepared to allow Russian forces to use its territory for military bases for up to 99 years, the Interfax news agency reported. South Ossetian leader Eduard Kokoity said his government had decided \"to concede territory to install Russian border guard bases in the republic for 99 years,\" Interfax reported. \"Territory for the creation of military bases will be conceded, I think, for the same time period,\" he added. Kokoity expressed hope that agreements on Russian bases will be signed \"as quickly as possible\" so they could then be ratified by the breakaway region's parliament. Georgian President Mikheil Saakashvili meanwhile said Wednesday that Georgia was reorganising its military strategy to focus more on national defence. \"Previously the Georgian armed forces were trained within the framework of international cooperation for peacekeeping purposes... now the Georgian army will be trained to ensure peace in Georgia, so that no one will try again to start a war,\" he told soldiers in remarks shown live on Rustavi-2 television. Georgian Defence Minister David Sikharulidze told AFP Friday that the country is planning to revamp its military to boost defence capabilities in order to better defend the country from invasion. Georgia and Russia remain deeply at odds after a brief war... (...)", 
        "intTime": 20090311, 
        "postID": 1, 
        "quote": "South Ossetia to allow Russian bases for 99 years: report Agence France-Presse | 03/11/2009 11:43 PM TBILISI - Georgia's breakaway region of South Ossetia said Wednesday it was prepared to allow Russian forces to use its territory for military bases for up to 99 years, the Interfax news agency reported. South Ossetian leader Eduard Kokoity said his government had decided \"to concede territory to install Russian border guard bases in the republic for 99 years,\" Interfax reported. \"Territory for the creation of military bases will be conceded, I think, for the same time period,\" he added. Kokoity expressed hope that agreements on Russian bases will be signed \"as quickly as possible\" so they could then be ratified by the breakaway region's parliament. Georgian President Mikheil Saakashvili meanwhile said Wednesday that Georgia was reorganising its military strategy to focus more on national defence. \"Previously the Georgian armed forces were trained within the framework of international cooperation for peacekeeping purposes... now the Georgian army will be trained to ensure peace in Georgia, so that no one will try again to start a war,\" he told soldiers in remarks shown live on Rustavi-2 television. Georgian Defence Minister David Sikharulidze told AFP Friday that the country is planning to revamp its military to boost defence capabilities in order to better defend the country from invasion. Georgia and Russia remain deeply at odds after a brief war... (...)", 
        "reply": "So is Russia the only foreign country that recognizes these two breakaway regions of Georgia as independent? ", 
        "threadID": "672198221_1790035712001", 
        "time": "2009-03-11 10:40:00", 
        "title": "South Ossetia region of Georgia to allow Russian bases for 99 years", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Russia doesn't even \"officially\" recognize them. They are giving it lip service, because SO is a thumb of land protruding into Georgia far enough to allow conventional forces to threaten the BTC pipeline at will. That's all this is about. Russia wants to be able to threaten the only pipeline supplying Europe that doesn't run through it's territory. Of course, fair is fair...Georgia should invite us to base a heavy BCT and a squadron each of Apaches and F16s between South Ossetia and Tbilisi.", 
        "intTime": 20090311, 
        "postID": 2, 
        "quote": "", 
        "reply": "Russia doesn't even \"officially\" recognize them. They are giving it lip service, because SO is a thumb of land protruding into Georgia far enough to allow conventional forces to threaten the BTC pipeline at will. That's all this is about. Russia wants to be able to threaten the only pipeline supplying Europe that doesn't run through it's territory. Of course, fair is fair...Georgia should invite us to base a heavy BCT and a squadron each of Apaches and F16s between South Ossetia and Tbilisi.", 
        "threadID": "672198221_1790035712001", 
        "time": "2009-03-11 10:57:00", 
        "title": "South Ossetia region of Georgia to allow Russian bases for 99 years", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: So is Russia the only foreign country that recognizes these two breakaway regions of Georgia as independent? Officialy only Russia & Nicaragua! quote: South Ossetia to allow Russian bases for 99 years: report Agence France-Presse | 03/11/2009 11:43 PM TBILISI - Georgia's breakaway region of South Ossetia said Wednesday it was prepared to allow Russian forces to use its territory for military bases for up to 99 years, the Interfax news agency reported. South Ossetian leader Eduard Kokoity said his government had decided \"to concede territory to install Russian border guard bases in the republic for 99 years,\" Interfax reported. \"Territory for the creation of military bases will be conceded, I think, for the same time period,\" he added. Kokoity expressed hope that agreements on Russian bases will be signed \"as quickly as possible\" so they could then be ratified by the breakaway region's parliament. Georgian President Mikheil Saakashvili meanwhile said Wednesday that Georgia was reorganising its military strategy to focus more on national defence. \"Previously the Georgian armed forces were trained within the framework of international cooperation for peacekeeping purposes... now the Georgian army will be trained to ensure peace in Georgia, so that no one will try again to start a war,\" he told soldiers in remarks shown live on Rustavi-2 television. “The issue is not about why Georgia started military action – we admit we started it. Mikheil Saakashvili - Congressional Hearing, Nov 2008 Georgian Defence Minister David Sikharulidze told AFP Friday that the country is planning to revamp its military to boost defence capabilities in order to better defend the country from invasion. Georgia and Russia remain deeply at odds after a brief war... (...)", 
        "intTime": 20090311, 
        "postID": 3, 
        "quote": "Originally posted by Canuck_Centaur: So is Russia the only foreign country that recognizes these two breakaway regions of Georgia as independent? Officialy only Russia & Nicaragua! quote: South Ossetia to allow Russian bases for 99 years: report Agence France-Presse | 03/11/2009 11:43 PM TBILISI - Georgia's breakaway region of South Ossetia said Wednesday it was prepared to allow Russian forces to use its territory for military bases for up to 99 years, the Interfax news agency reported. South Ossetian leader Eduard Kokoity said his government had decided \"to concede territory to install Russian border guard bases in the republic for 99 years,\" Interfax reported. \"Territory for the creation of military bases will be conceded, I think, for the same time period,\" he added. Kokoity expressed hope that agreements on Russian bases will be signed \"as quickly as possible\" so they could then be ratified by the breakaway region's parliament. Georgian President Mikheil Saakashvili meanwhile said Wednesday that Georgia was reorganising its military strategy to focus more on national defence. \"Previously the Georgian armed forces were trained within the framework of international cooperation for peacekeeping purposes... now the Georgian army will be trained to ensure peace in Georgia, so that no one will try again to start a war,\" he told soldiers in remarks shown live on Rustavi-2 television. “The issue is not about why Georgia started military action – we admit we started it. Mikheil Saakashvili - Congressional Hearing, Nov 2008 Georgian Defence Minister David Sikharulidze told AFP Friday that the country is planning to revamp its military to boost defence capabilities in order to better defend the country from invasion. Georgia and Russia remain deeply at odds after a brief war... (...)", 
        "reply": "", 
        "threadID": "672198221_1790035712001", 
        "time": "2009-03-11 11:32:00", 
        "title": "South Ossetia region of Georgia to allow Russian bases for 99 years", 
        "userID": "Knele"
    }, 
    {
        "content": "Well in terms of past Russian Military basing agreements......99 years is probably a lot less then that.....lol. Check back in 10 years.", 
        "intTime": 20090311, 
        "postID": 4, 
        "quote": "", 
        "reply": "Well in terms of past Russian Military basing agreements......99 years is probably a lot less then that.....lol. Check back in 10 years.", 
        "threadID": "672198221_1790035712001", 
        "time": "2009-03-11 18:16:00", 
        "title": "South Ossetia region of Georgia to allow Russian bases for 99 years", 
        "userID": "ErichG2"
    }, 
    {
        "content": "BUMP.", 
        "intTime": 20090314, 
        "postID": 5, 
        "quote": "", 
        "reply": "BUMP.", 
        "threadID": "672198221_1790035712001", 
        "time": "2009-03-14 21:31:00", 
        "title": "South Ossetia region of Georgia to allow Russian bases for 99 years", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "The world civilization will not last another 99 years..............", 
        "intTime": 20090315, 
        "postID": 6, 
        "quote": "", 
        "reply": "The world civilization will not last another 99 years..............", 
        "threadID": "672198221_1790035712001", 
        "time": "2009-03-15 05:49:00", 
        "title": "South Ossetia region of Georgia to allow Russian bases for 99 years", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: South Ossetian leader Eduard Kokoity said his government had decided \"to concede territory to install Russian border guard bases in the republic for 99 years,\" Interfax reported. This IS change we can believe in. Russia already thinks Obama is a pushover and thats why all the propaganda activity to confuse and push the ObamaNation into the direction Putin wants them to go", 
        "intTime": 20090315, 
        "postID": 7, 
        "quote": "South Ossetian leader Eduard Kokoity said his government had decided \"to concede territory to install Russian border guard bases in the republic for 99 years,\" Interfax reported.", 
        "reply": " This IS change we can believe in. Russia already thinks Obama is a pushover and thats why all the propaganda activity to confuse and push the ObamaNation into the direction Putin wants them to go", 
        "threadID": "672198221_1790035712001", 
        "time": "2009-03-15 10:54:00", 
        "title": "South Ossetia region of Georgia to allow Russian bases for 99 years", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by FlankerFlyer: quote: South Ossetian leader Eduard Kokoity said his government had decided \"to concede territory to install Russian border guard bases in the republic for 99 years,\" Interfax reported. This IS change we can believe in. Russia already thinks Obama is a pushover and thats why all the propaganda activity to confuse and push the ObamaNation into the direction Putin wants them to go Sheesh Flanker, why not post that this whole fiasco is all the fault of Obama? Without wishing to criticise Centaur, a more appropriate title would be \"Russia builds military base in occupied Georgia behind the facade of it own created Puppet regime.\" Now Flanker, why not tell us how the Freedom loving Ossetians have been forced into this action to defend themselves against the acts of Obama? Or perhaps you would like to engage in some last ditch BDS, and blame Mr. Bush for Putins actions? Dave", 
        "intTime": 20090315, 
        "postID": 8, 
        "quote": "Originally posted by FlankerFlyer: quote: South Ossetian leader Eduard Kokoity said his government had decided \"to concede territory to install Russian border guard bases in the republic for 99 years,\" Interfax reported. This IS change we can believe in. Russia already thinks Obama is a pushover and thats why all the propaganda activity to confuse and push the ObamaNation into the direction Putin wants them to go", 
        "reply": " Sheesh Flanker, why not post that this whole fiasco is all the fault of Obama? Without wishing to criticise Centaur, a more appropriate title would be \"Russia builds military base in occupied Georgia behind the facade of it own created Puppet regime.\" Now Flanker, why not tell us how the Freedom loving Ossetians have been forced into this action to defend themselves against the acts of Obama? Or perhaps you would like to engage in some last ditch BDS, and blame Mr. Bush for Putins actions? Dave", 
        "threadID": "672198221_1790035712001", 
        "time": "2009-03-15 11:06:00", 
        "title": "South Ossetia region of Georgia to allow Russian bases for 99 years", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: and blame Mr. Bush for Putins actions? Dave Didn’t Bush arm, train & egg on Saakashvili....", 
        "intTime": 20090315, 
        "postID": 9, 
        "quote": "Originally posted by Grachus: and blame Mr. Bush for Putins actions? Dave", 
        "reply": " Didn’t Bush arm, train & egg on Saakashvili....", 
        "threadID": "672198221_1790035712001", 
        "time": "2009-03-15 18:51:00", 
        "title": "South Ossetia region of Georgia to allow Russian bases for 99 years", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Knele: quote: Originally posted by Grachus: and blame Mr. Bush for Putins actions? Dave Didn’t Bush arm, train & egg on Saakashvili.... Actually, the US was trying to keep Georgia from doing something stupid like provoking the Russians. Georgia was a candidate for NATO membership. However, part of NATO membership is knowing that it's not a free pass to **** on the Russians. Now, there is a Russian base in what is internationally considered Georgian territory, and with that, so goes any hope of NATO membership. If Bush really wanted to egg on Shalikashvili there would've been a heavy brigade on the ground instead of a handful of light infantry, so Georgia could've proked the russkies to their heart's content.", 
        "intTime": 20090316, 
        "postID": 10, 
        "quote": "Originally posted by Knele: quote: Originally posted by Grachus: and blame Mr. Bush for Putins actions? Dave Didn’t Bush arm, train & egg on Saakashvili....", 
        "reply": " Actually, the US was trying to keep Georgia from doing something stupid like provoking the Russians. Georgia was a candidate for NATO membership. However, part of NATO membership is knowing that it's not a free pass to **** on the Russians. Now, there is a Russian base in what is internationally considered Georgian territory, and with that, so goes any hope of NATO membership. If Bush really wanted to egg on Shalikashvili there would've been a heavy brigade on the ground instead of a handful of light infantry, so Georgia could've proked the russkies to their heart's content.", 
        "threadID": "672198221_1790035712001", 
        "time": "2009-03-16 11:11:00", 
        "title": "South Ossetia region of Georgia to allow Russian bases for 99 years", 
        "userID": "jwr6"
    }, 
    {
        "content": "quote: Originally posted by jwr6: quote: Originally posted by Knele: quote: Originally posted by Grachus: and blame Mr. Bush for Putins actions? Dave Didn’t Bush arm, train & egg on Saakashvili.... Actually, the US was trying to keep Georgia from doing something stupid like provoking the Russians. Georgia was a candidate for NATO membership. However, part of NATO membership is knowing that it's not a free pass to **** on the Russians. Now, there is a Russian base in what is internationally considered Georgian territory, and with that, so goes any hope of NATO membership. If Bush really wanted to egg on Shalikashvili there would've been a heavy brigade on the ground instead of a handful of light infantry, so Georgia could've proked the russkies to their heart's content. It's one of the few times that I supported Mr. Bush 100 percent. And you are quite right in pointing out that Bush tried to hold the Georgians back. Dave", 
        "intTime": 20090316, 
        "postID": 11, 
        "quote": "Originally posted by jwr6: quote: Originally posted by Knele: quote: Originally posted by Grachus: and blame Mr. Bush for Putins actions? Dave Didn’t Bush arm, train & egg on Saakashvili.... Actually, the US was trying to keep Georgia from doing something stupid like provoking the Russians. Georgia was a candidate for NATO membership. However, part of NATO membership is knowing that it's not a free pass to **** on the Russians. Now, there is a Russian base in what is internationally considered Georgian territory, and with that, so goes any hope of NATO membership. If Bush really wanted to egg on Shalikashvili there would've been a heavy brigade on the ground instead of a handful of light infantry, so Georgia could've proked the russkies to their heart's content.", 
        "reply": " It's one of the few times that I supported Mr. Bush 100 percent. And you are quite right in pointing out that Bush tried to hold the Georgians back. Dave", 
        "threadID": "672198221_1790035712001", 
        "time": "2009-03-16 15:05:00", 
        "title": "South Ossetia region of Georgia to allow Russian bases for 99 years", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by FlankerFlyer: quote: South Ossetian leader Eduard Kokoity said his government had decided \"to concede territory to install Russian border guard bases in the republic for 99 years,\" Interfax reported. This IS change we can believe in. Russia already thinks Obama is a pushover and thats why all the propaganda activity to confuse and push the ObamaNation into the direction Putin wants them to go Sheesh Flanker, why not post that this whole fiasco is all the fault of Obama? Without wishing to criticise Centaur, a more appropriate title would be \"Russia builds military base in occupied Georgia behind the facade of it own created Puppet regime.\" Now Flanker, why not tell us how the Freedom loving Ossetians have been forced into this action to defend themselves against the acts of Obama? Or perhaps you would like to engage in some last ditch BDS, and blame Mr. Bush for Putins actions? Dave How did you get THAT from my post? Even Sakashvili admits he started it and he still cant believe the USA didnt coming running to his aid especially when US and Israeli \"trainers\" were leading the attack. Bush even told This nut that he could not expect any help if his plan failed and Bush even told him it was a bad idea to provoke Russia. Although Bush didnt get the cooperation he expected at the beginning of his term he at least showed Putin he wouldnt back down from his ideas even though it cost him dearly in matters of terrorism assistance and cooperation on major fronts. I still believe Bush is a decent man who had bad folks around him and his stubborness when confronted by mistakes hurt his presidency immensely. To me he made countless mistakes constantly. Obama, OTOH, doesnt have a clue and will get outflanked by Medvedev and Putin over and over again.", 
        "intTime": 20090316, 
        "postID": 12, 
        "quote": "Originally posted by Grachus: quote: Originally posted by FlankerFlyer: quote: South Ossetian leader Eduard Kokoity said his government had decided \"to concede territory to install Russian border guard bases in the republic for 99 years,\" Interfax reported. This IS change we can believe in. Russia already thinks Obama is a pushover and thats why all the propaganda activity to confuse and push the ObamaNation into the direction Putin wants them to go Sheesh Flanker, why not post that this whole fiasco is all the fault of Obama? Without wishing to criticise Centaur, a more appropriate title would be \"Russia builds military base in occupied Georgia behind the facade of it own created Puppet regime.\" Now Flanker, why not tell us how the Freedom loving Ossetians have been forced into this action to defend themselves against the acts of Obama? Or perhaps you would like to engage in some last ditch BDS, and blame Mr. Bush for Putins actions? Dave", 
        "reply": " How did you get THAT from my post? Even Sakashvili admits he started it and he still cant believe the USA didnt coming running to his aid especially when US and Israeli \"trainers\" were leading the attack. Bush even told This nut that he could not expect any help if his plan failed and Bush even told him it was a bad idea to provoke Russia. Although Bush didnt get the cooperation he expected at the beginning of his term he at least showed Putin he wouldnt back down from his ideas even though it cost him dearly in matters of terrorism assistance and cooperation on major fronts. I still believe Bush is a decent man who had bad folks around him and his stubborness when confronted by mistakes hurt his presidency immensely. To me he made countless mistakes constantly. Obama, OTOH, doesnt have a clue and will get outflanked by Medvedev and Putin over and over again.", 
        "threadID": "672198221_1790035712001", 
        "time": "2009-03-16 17:20:00", 
        "title": "South Ossetia region of Georgia to allow Russian bases for 99 years", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "And another thing, during the opening ceremonies of the Olympics Bush and Putin had a conversation in which Bush urged restraint and Putin replied that he was going to let things take their course.", 
        "intTime": 20090316, 
        "postID": 13, 
        "quote": "", 
        "reply": "And another thing, during the opening ceremonies of the Olympics Bush and Putin had a conversation in which Bush urged restraint and Putin replied that he was going to let things take their course.", 
        "threadID": "672198221_1790035712001", 
        "time": "2009-03-16 17:22:00", 
        "title": "South Ossetia region of Georgia to allow Russian bases for 99 years", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Sheesh Flanker, why not post that this whole fiasco is all the fault of Obama? Without wishing to criticise Centaur, a more appropriate title would be \"Russia builds military base in occupied Georgia behind the facade of it own created Puppet regime.\" Now Flanker, why not tell us how the Freedom loving Ossetians have been forced into this action to defend themselves against the acts of Obama? Or perhaps you would like to engage in some last ditch BDS, and blame Mr. Bush for Putins actions? Dave quote: Originally posted by FlankerFlyer: How did you get THAT from my post? Even Sakashvili admits he started it and he still cant believe the USA didnt coming running to his aid especially when US and Israeli \"trainers\" were leading the attack. Quite right, and one has to ask why Lincohn didn't stop and ask permission of England and France to put the Union back together. I'd be curious to know how Sakashvili atarted \"this?\" This started quite a while ago when Russia set up these \"Republics\" (sic) in the first place. quote: Originally posted by FlankerFlyer: Bush even told This nut that he could not expect any help if his plan failed and Bush even told him it was a bad idea to provoke Russia. And he did the right thing, even though Sakashvili was morally and legally right. Reality intrudes it's ugly head, and then and there was not the time to start a World War. (snip) quote: Originally posted by FlankerFlyer: Obama, OTOH, doesnt have a clue and will get outflanked by Medvedev and Putin over and over again. Oh, you mean he's already been outflanked on numerous occasions? I do recall President Bush in one of those statements he regretted telling the American People how he looked into Putins eyes and knew this was a guy he could trust. Right, yeah, sure... Dave", 
        "intTime": 20090316, 
        "postID": 14, 
        "quote": "Originally posted by Grachus: Sheesh Flanker, why not post that this whole fiasco is all the fault of Obama? Without wishing to criticise Centaur, a more appropriate title would be \"Russia builds military base in occupied Georgia behind the facade of it own created Puppet regime.\" Now Flanker, why not tell us how the Freedom loving Ossetians have been forced into this action to defend themselves against the acts of Obama? Or perhaps you would like to engage in some last ditch BDS, and blame Mr. Bush for Putins actions? Dave", 
        "reply": " quote: Originally posted by FlankerFlyer: How did you get THAT from my post? Even Sakashvili admits he started it and he still cant believe the USA didnt coming running to his aid especially when US and Israeli \"trainers\" were leading the attack. Quite right, and one has to ask why Lincohn didn't stop and ask permission of England and France to put the Union back together. I'd be curious to know how Sakashvili atarted \"this?\" This started quite a while ago when Russia set up these \"Republics\" (sic) in the first place. quote: Originally posted by FlankerFlyer: Bush even told This nut that he could not expect any help if his plan failed and Bush even told him it was a bad idea to provoke Russia. And he did the right thing, even though Sakashvili was morally and legally right. Reality intrudes it's ugly head, and then and there was not the time to start a World War. (snip) quote: Originally posted by FlankerFlyer: Obama, OTOH, doesnt have a clue and will get outflanked by Medvedev and Putin over and over again. Oh, you mean he's already been outflanked on numerous occasions? I do recall President Bush in one of those statements he regretted telling the American People how he looked into Putins eyes and knew this was a guy he could trust. Right, yeah, sure... Dave", 
        "threadID": "672198221_1790035712001", 
        "time": "2009-03-16 17:34:00", 
        "title": "South Ossetia region of Georgia to allow Russian bases for 99 years", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: How did you get THAT from my post? Even Sakashvili admits he started it and he still cant believe the USA didnt coming running to his aid especially when US and Israeli \"trainers\" were leading the attack. Bush even told This nut that he could not expect any help if his plan failed and Bush even told him it was a bad idea to provoke Russia. Although Bush didnt get the cooperation he expected at the beginning of his term he at least showed Putin he wouldnt back down from his ideas even though it cost him dearly in matters of terrorism assistance and cooperation on major fronts. I still believe Bush is a decent man who had bad folks around him and his stubborness when confronted by mistakes hurt his presidency immensely. To me he made countless mistakes constantly. Obama, OTOH, doesnt have a clue and will get outflanked by Medvedev and Putin over and over again. FF, you can't be serious. Saakashvilli is so Bush's baby, actually more like a pet project. They helped get this happy idiot in power, gave him a cute little army, blew his ego the size of big ballon, and told him he can't join Nato till he fixes his problem with breakaway problem. The man could have bought every Ossetian in South Ossetia, if the money went to that, vice dumping it in the military. What was that mentally unstable person, Georgians have to call a president, supposed to do? He started solving his internal problems the best he knew. American ears are seen like miles away in that little adventure, and it happened when Obama was not in the office. And don't worry about mr. Obama's being outflanked by Putin and Medvedev. They know what they are doing. It's time out time. Remember, most damage was done to Russia during Clinton's time. This time should be particular interesting, because we don't have Elcin on a watch, but rather paranoid pair, that know exactly what America's intentions are. And Americans know, that they know. It's going to be interesting to watch.", 
        "intTime": 20090316, 
        "postID": 15, 
        "quote": "How did you get THAT from my post? Even Sakashvili admits he started it and he still cant believe the USA didnt coming running to his aid especially when US and Israeli \"trainers\" were leading the attack. Bush even told This nut that he could not expect any help if his plan failed and Bush even told him it was a bad idea to provoke Russia. Although Bush didnt get the cooperation he expected at the beginning of his term he at least showed Putin he wouldnt back down from his ideas even though it cost him dearly in matters of terrorism assistance and cooperation on major fronts. I still believe Bush is a decent man who had bad folks around him and his stubborness when confronted by mistakes hurt his presidency immensely. To me he made countless mistakes constantly. Obama, OTOH, doesnt have a clue and will get outflanked by Medvedev and Putin over and over again.", 
        "reply": " FF, you can't be serious. Saakashvilli is so Bush's baby, actually more like a pet project. They helped get this happy idiot in power, gave him a cute little army, blew his ego the size of big ballon, and told him he can't join Nato till he fixes his problem with breakaway problem. The man could have bought every Ossetian in South Ossetia, if the money went to that, vice dumping it in the military. What was that mentally unstable person, Georgians have to call a president, supposed to do? He started solving his internal problems the best he knew. American ears are seen like miles away in that little adventure, and it happened when Obama was not in the office. And don't worry about mr. Obama's being outflanked by Putin and Medvedev. They know what they are doing. It's time out time. Remember, most damage was done to Russia during Clinton's time. This time should be particular interesting, because we don't have Elcin on a watch, but rather paranoid pair, that know exactly what America's intentions are. And Americans know, that they know. It's going to be interesting to watch.", 
        "threadID": "672198221_1790035712001", 
        "time": "2009-03-16 17:40:00", 
        "title": "South Ossetia region of Georgia to allow Russian bases for 99 years", 
        "userID": "TataH"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by Grachus: Sheesh Flanker, why not post that this whole fiasco is all the fault of Obama? Without wishing to criticise Centaur, a more appropriate title would be \"Russia builds military base in occupied Georgia behind the facade of it own created Puppet regime.\" Now Flanker, why not tell us how the Freedom loving Ossetians have been forced into this action to defend themselves against the acts of Obama? Or perhaps you would like to engage in some last ditch BDS, and blame Mr. Bush for Putins actions? Dave quote: Originally posted by FlankerFlyer: How did you get THAT from my post? Even Sakashvili admits he started it and he still cant believe the USA didnt coming running to his aid especially when US and Israeli \"trainers\" were leading the attack. Quite right, and one has to ask why Lincohn didn't stop and ask permission of England and France to put the Union back together. I'd be curious to know how Sakashvili atarted \"this?\" This started quite a while ago when Russia set up these \"Republics\" (sic) in the first place. There you go again not understanding history. S. Ossetia and Abkhazia both fought for and won independence after the breakup of the USSR. Georgia NEVER had control of either area despite trying their best and losing hundreds of lives quote: Originally posted by FlankerFlyer: Bush even told This nut that he could not expect any help if his plan failed and Bush even told him it was a bad idea to provoke Russia. And he did the right thing, even though Sakashvili was morally and legally right. Reality intrudes it's ugly head, and then and there was not the time to start a World War. How is attacking and killing civilians in a failed attempt to control people who dont want that Tyranny imposed upon them morally right? (snip) quote: Originally posted by FlankerFlyer: Obama, OTOH, doesnt have a clue and will get outflanked by Medvedev and Putin over and over again. Oh, you mean he's already been outflanked on numerous occasions? I do recall President Bush in one of those statements he regretted telling the American People how he looked into Putins eyes and knew this was a guy he could trust. Right, yeah, sure... Dave", 
        "intTime": 20090317, 
        "postID": 16, 
        "quote": "Originally posted by Grachus: quote: Originally posted by Grachus: Sheesh Flanker, why not post that this whole fiasco is all the fault of Obama? Without wishing to criticise Centaur, a more appropriate title would be \"Russia builds military base in occupied Georgia behind the facade of it own created Puppet regime.\" Now Flanker, why not tell us how the Freedom loving Ossetians have been forced into this action to defend themselves against the acts of Obama? Or perhaps you would like to engage in some last ditch BDS, and blame Mr. Bush for Putins actions? Dave quote: Originally posted by FlankerFlyer: How did you get THAT from my post? Even Sakashvili admits he started it and he still cant believe the USA didnt coming running to his aid especially when US and Israeli \"trainers\" were leading the attack. Quite right, and one has to ask why Lincohn didn't stop and ask permission of England and France to put the Union back together. I'd be curious to know how Sakashvili atarted \"this?\" This started quite a while ago when Russia set up these \"Republics\" (sic) in the first place. There you go again not understanding history. S. Ossetia and Abkhazia both fought for and won independence after the breakup of the USSR. Georgia NEVER had control of either area despite trying their best and losing hundreds of lives quote: Originally posted by FlankerFlyer: Bush even told This nut that he could not expect any help if his plan failed and Bush even told him it was a bad idea to provoke Russia. And he did the right thing, even though Sakashvili was morally and legally right. Reality intrudes it's ugly head, and then and there was not the time to start a World War. How is attacking and killing civilians in a failed attempt to control people who dont want that Tyranny imposed upon them morally right? (snip) quote: Originally posted by FlankerFlyer: Obama, OTOH, doesnt have a clue and will get outflanked by Medvedev and Putin over and over again. Oh, you mean he's already been outflanked on numerous occasions? I do recall President Bush in one of those statements he regretted telling the American People how he looked into Putins eyes and knew this was a guy he could trust. Right, yeah, sure... Dave", 
        "reply": "", 
        "threadID": "672198221_1790035712001", 
        "time": "2009-03-17 18:38:00", 
        "title": "South Ossetia region of Georgia to allow Russian bases for 99 years", 
        "userID": "FlankerFlyer"
    }
]