[
    {
        "content": "UPDATE: This thread was originally the thread titled \"USN warships deploy North Korean Satellite Launch\"....Please post all new updates at this thread to avoid duplicate threads! Please go to the latest post on the next page for the latest update. ++http://ca.news.yahoo.com/s/afp/090326/usa/nkorea_nuclear_missile_japan_us_military quote: US says warships deployed before NKorea launch 2 hours, 42 minutes ago TOKYO (AFP) - The US Navy said Thursday it had deployed two warships in waters off Japan ahead of North Korea's planned rocket launch early next month. Two destroyers fitted with Aegis technology to track and destroy missiles left port on Wednesday, US Navy public relations officer Charles Howard told AFP. \"I would say we are ready for any contingencies,\" he said. Pyongyang says it will launch a communications satellite between April 4 and 8. The United States and its Asian allies suspect the launch is a test of a long-range ballistic missile that could reach North America. Tensions have risen after US officials said overnight that North Korea had moved a Taepodong-2 missile to the Musudan-ri launch site on the country's northeast coast. The US Navy spokesman said two Aegis-equipped destroyers -- the USS McCain and USS Chafee -- left Sasebo port in southwestern Japan where a third, the USS Curtis Wilbur, remained docked. The USS Stethem, another Aegis-equipped destroyer, was set to leave northern Aomori port Thursday after a port call of several days, a US Navy spokeswoman said, without specifying its destination. The Japanese navy's two Aegis-equipped destroyers Kongo and Chokai are on stand-by at Sasebo, a defence ministry spokeswoman said. A South Korean Aegis-equipped warship is also likely to be deployed in waters near Japan, public broadcaster TBS reported, without citing sources. The North's missiles have alarmed Japan since a Taepodong-1 overflew its territory in 1998. The first test of a longer-range Taepodong-2 in 2006 failed after 40 seconds. Japan's security council will meet this week to prepare for the shooting down of any rocket or debris which threatens to strike its territory. General Ryoichi Oriki, chief of staff of the Japanese Self Defence Forces, told a media briefing: \"We will take all measures possible to ensure safety ... (...) This message has been edited. Last edited by: Canuck_Centaur, Sun 05 April 2009 09:10 AM", 
        "intTime": 20090326, 
        "postID": 1, 
        "quote": "US says warships deployed before NKorea launch 2 hours, 42 minutes ago TOKYO (AFP) - The US Navy said Thursday it had deployed two warships in waters off Japan ahead of North Korea's planned rocket launch early next month. Two destroyers fitted with Aegis technology to track and destroy missiles left port on Wednesday, US Navy public relations officer Charles Howard told AFP. \"I would say we are ready for any contingencies,\" he said. Pyongyang says it will launch a communications satellite between April 4 and 8. The United States and its Asian allies suspect the launch is a test of a long-range ballistic missile that could reach North America. Tensions have risen after US officials said overnight that North Korea had moved a Taepodong-2 missile to the Musudan-ri launch site on the country's northeast coast. The US Navy spokesman said two Aegis-equipped destroyers -- the USS McCain and USS Chafee -- left Sasebo port in southwestern Japan where a third, the USS Curtis Wilbur, remained docked. The USS Stethem, another Aegis-equipped destroyer, was set to leave northern Aomori port Thursday after a port call of several days, a US Navy spokeswoman said, without specifying its destination. The Japanese navy's two Aegis-equipped destroyers Kongo and Chokai are on stand-by at Sasebo, a defence ministry spokeswoman said. A South Korean Aegis-equipped warship is also likely to be deployed in waters near Japan, public broadcaster TBS reported, without citing sources. The North's missiles have alarmed Japan since a Taepodong-1 overflew its territory in 1998. The first test of a longer-range Taepodong-2 in 2006 failed after 40 seconds. Japan's security council will meet this week to prepare for the shooting down of any rocket or debris which threatens to strike its territory. General Ryoichi Oriki, chief of staff of the Japanese Self Defence Forces, told a media briefing: \"We will take all measures possible to ensure safety ... (...)", 
        "reply": "UPDATE: This thread was originally the thread titled \"USN warships deploy North Korean Satellite Launch\"....Please post all new updates at this thread to avoid duplicate threads! Please go to the latest post on the next page for the latest update. ++http://ca.news.yahoo.com/s/afp/090326/usa/nkorea_nuclear_missile_japan_us_military  This message has been edited. Last edited by: Canuck_Centaur, Sun 05 April 2009 09:10 AM", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 11:48:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "intTime": 20090326, 
        "postID": 2, 
        "quote": "", 
        "reply": "Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 12:07:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona?", 
        "intTime": 20090326, 
        "postID": 3, 
        "quote": "Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "reply": " Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona?", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 12:18:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: I wonder if the USS McCain is named after Senator McCain or his father or grandfather? Interesting answer ... it is named jointly for Admiral John S. McCain, Sr and Admiral John S. McCain, Jr ... Senator McCain's grandfather and father respectively. I don't know of any other jointly named ships in the Navy inventory ...", 
        "intTime": 20090326, 
        "postID": 4, 
        "quote": "I wonder if the USS McCain is named after Senator McCain or his father or grandfather?", 
        "reply": " Interesting answer ... it is named jointly for Admiral John S. McCain, Sr and Admiral John S. McCain, Jr ... Senator McCain's grandfather and father respectively. I don't know of any other jointly named ships in the Navy inventory ...", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 12:21:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Let the show begin. We best blow it away if they launch.", 
        "intTime": 20090326, 
        "postID": 5, 
        "quote": "", 
        "reply": "Let the show begin. We best blow it away if they launch.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 13:57:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona? Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Of those two men, only their melted Naval Academy rings were found, melted into ships structure, on the bridge of the U.S.S. Arizona... Respectfully, SUNLINER81", 
        "intTime": 20090326, 
        "postID": 6, 
        "quote": "Originally posted by Canuck_Centaur: quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona?", 
        "reply": " Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Of those two men, only their melted Naval Academy rings were found, melted into ships structure, on the bridge of the U.S.S. Arizona... Respectfully, SUNLINER81", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 14:06:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81", 
        "intTime": 20090326, 
        "postID": 7, 
        "quote": "Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch.", 
        "reply": " This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 14:09:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "On the other hand what if they are really launching a satelite?? Do we know for a fact that they are not? I am sure they have the ability to build a satelite, maybe a primitive \"sputnik\" type of thing but a satelite none the less. If they are, who are we to tell them that they can not?", 
        "intTime": 20090326, 
        "postID": 8, 
        "quote": "", 
        "reply": "On the other hand what if they are really launching a satelite?? Do we know for a fact that they are not? I am sure they have the ability to build a satelite, maybe a primitive \"sputnik\" type of thing but a satelite none the less. If they are, who are we to tell them that they can not?", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 15:32:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "They could be, and probably are launching a small satellite. A single communications satellite launched from North Korea wouldn't be very functional though. They certainly don't have the capabiity to go into geo orbit from their launch site. A Molniya orbit would be difficult and not likely at all. A polar orbit would require shooting over China so that isn't likely to happen either. A single comm satellite in LEO at 41 or 42 degrees inclination (which is the best they can probably do) has no practical application without being an entire constellation like Iridium. The booster failed the last time they launched it on July 4, 2006. That time it failed to achieve orbit, but if it does the biggest problem might be a failure in orbit and a resulting debris field.", 
        "intTime": 20090326, 
        "postID": 9, 
        "quote": "", 
        "reply": "They could be, and probably are launching a small satellite. A single communications satellite launched from North Korea wouldn't be very functional though. They certainly don't have the capabiity to go into geo orbit from their launch site. A Molniya orbit would be difficult and not likely at all. A polar orbit would require shooting over China so that isn't likely to happen either. A single comm satellite in LEO at 41 or 42 degrees inclination (which is the best they can probably do) has no practical application without being an entire constellation like Iridium. The booster failed the last time they launched it on July 4, 2006. That time it failed to achieve orbit, but if it does the biggest problem might be a failure in orbit and a resulting debris field.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 16:36:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "nspreitler"
    }, 
    {
        "content": "It would take a little more doing and require a more advance bird but once on orbit the orbit could be adjusted to a geo synch orbit. If it works out and with two more you have 24 hr world wide comm coverage. My point is who are we to tell them that they can not try to do it? To the point of threatening to shoot the thing down when it is in it's intitial boost phase.", 
        "intTime": 20090326, 
        "postID": 10, 
        "quote": "", 
        "reply": "It would take a little more doing and require a more advance bird but once on orbit the orbit could be adjusted to a geo synch orbit. If it works out and with two more you have 24 hr world wide comm coverage. My point is who are we to tell them that they can not try to do it? To the point of threatening to shoot the thing down when it is in it's intitial boost phase.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 17:13:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "You want to talk about nail biter... If the North Koreans are as paranoid as they sound this is going to be a tuff choice for the President... On one hand it could very well be a primitive satellite, on the other it could be a test of rocket technology to be used in the future for nuclear warheads... I wouldn't be worried about a conflict unless the North Koreans start moving troops to the DMZ to quickly respond to our actions...", 
        "intTime": 20090326, 
        "postID": 11, 
        "quote": "", 
        "reply": "You want to talk about nail biter... If the North Koreans are as paranoid as they sound this is going to be a tuff choice for the President... On one hand it could very well be a primitive satellite, on the other it could be a test of rocket technology to be used in the future for nuclear warheads... I wouldn't be worried about a conflict unless the North Koreans start moving troops to the DMZ to quickly respond to our actions...", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 17:58:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... SUNLINER81 Any relation to Captain Kidd, the pirate?", 
        "intTime": 20090326, 
        "postID": 12, 
        "quote": "Originally posted by SUNLINER81: Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... SUNLINER81", 
        "reply": " Any relation to Captain Kidd, the pirate?", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 19:08:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81 The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests.", 
        "intTime": 20090327, 
        "postID": 13, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81", 
        "reply": " The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-27 19:48:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "GeraldM"
    }, 
    {
        "content": "An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com", 
        "intTime": 20090328, 
        "postID": 14, 
        "quote": "", 
        "reply": "An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:26:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Respectfully, SUNLINER81 The Kidd Class Destroyer Don", 
        "intTime": 20090328, 
        "postID": 15, 
        "quote": "Originally posted by SUNLINER81: Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Respectfully, SUNLINER81", 
        "reply": " The Kidd Class Destroyer Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:39:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Hmmmm, well let's see now, George H.W. Bush left the US Navy as a LT. or maybe a LTjg didn't he? USS George H.W. Bush Don", 
        "intTime": 20090328, 
        "postID": 16, 
        "quote": "Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "reply": " Hmmmm, well let's see now, George H.W. Bush left the US Navy as a LT. or maybe a LTjg didn't he? USS George H.W. Bush Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:44:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by GeraldM: quote: Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81 The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests. Stable yes, united no! Why would they want another strong competitor in the region!", 
        "intTime": 20090328, 
        "postID": 17, 
        "quote": "Originally posted by GeraldM: quote: Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81 The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests.", 
        "reply": " Stable yes, united no! Why would they want another strong competitor in the region!", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:46:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com All those potential intercept missiles...someone ought to hit it. Don", 
        "intTime": 20090328, 
        "postID": 18, 
        "quote": "Originally posted by Canuck_Centaur: An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com", 
        "reply": " All those potential intercept missiles...someone ought to hit it. Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:47:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC.", 
        "intTime": 20090328, 
        "postID": 19, 
        "quote": "", 
        "reply": "Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:47:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC. I didn't know that. Wow, I've seen a few of them out at sea and thought they looked extremely impressive. Don", 
        "intTime": 20090328, 
        "postID": 20, 
        "quote": "Originally posted by Canuck_Centaur: Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC.", 
        "reply": " I didn't know that. Wow, I've seen a few of them out at sea and thought they looked extremely impressive. Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:50:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "UPDATE: This thread was originally the thread titled \"USN warships deploy North Korean Satellite Launch\"....Please post all new updates at this thread to avoid duplicate threads! Please go to the latest post on the next page for the latest update. ++http://ca.news.yahoo.com/s/afp/090326/usa/nkorea_nuclear_missile_japan_us_military quote: US says warships deployed before NKorea launch 2 hours, 42 minutes ago TOKYO (AFP) - The US Navy said Thursday it had deployed two warships in waters off Japan ahead of North Korea's planned rocket launch early next month. Two destroyers fitted with Aegis technology to track and destroy missiles left port on Wednesday, US Navy public relations officer Charles Howard told AFP. \"I would say we are ready for any contingencies,\" he said. Pyongyang says it will launch a communications satellite between April 4 and 8. The United States and its Asian allies suspect the launch is a test of a long-range ballistic missile that could reach North America. Tensions have risen after US officials said overnight that North Korea had moved a Taepodong-2 missile to the Musudan-ri launch site on the country's northeast coast. The US Navy spokesman said two Aegis-equipped destroyers -- the USS McCain and USS Chafee -- left Sasebo port in southwestern Japan where a third, the USS Curtis Wilbur, remained docked. The USS Stethem, another Aegis-equipped destroyer, was set to leave northern Aomori port Thursday after a port call of several days, a US Navy spokeswoman said, without specifying its destination. The Japanese navy's two Aegis-equipped destroyers Kongo and Chokai are on stand-by at Sasebo, a defence ministry spokeswoman said. A South Korean Aegis-equipped warship is also likely to be deployed in waters near Japan, public broadcaster TBS reported, without citing sources. The North's missiles have alarmed Japan since a Taepodong-1 overflew its territory in 1998. The first test of a longer-range Taepodong-2 in 2006 failed after 40 seconds. Japan's security council will meet this week to prepare for the shooting down of any rocket or debris which threatens to strike its territory. General Ryoichi Oriki, chief of staff of the Japanese Self Defence Forces, told a media briefing: \"We will take all measures possible to ensure safety ... (...) This message has been edited. Last edited by: Canuck_Centaur, Sun 05 April 2009 09:10 AM", 
        "intTime": 20090326, 
        "postID": 21, 
        "quote": "US says warships deployed before NKorea launch 2 hours, 42 minutes ago TOKYO (AFP) - The US Navy said Thursday it had deployed two warships in waters off Japan ahead of North Korea's planned rocket launch early next month. Two destroyers fitted with Aegis technology to track and destroy missiles left port on Wednesday, US Navy public relations officer Charles Howard told AFP. \"I would say we are ready for any contingencies,\" he said. Pyongyang says it will launch a communications satellite between April 4 and 8. The United States and its Asian allies suspect the launch is a test of a long-range ballistic missile that could reach North America. Tensions have risen after US officials said overnight that North Korea had moved a Taepodong-2 missile to the Musudan-ri launch site on the country's northeast coast. The US Navy spokesman said two Aegis-equipped destroyers -- the USS McCain and USS Chafee -- left Sasebo port in southwestern Japan where a third, the USS Curtis Wilbur, remained docked. The USS Stethem, another Aegis-equipped destroyer, was set to leave northern Aomori port Thursday after a port call of several days, a US Navy spokeswoman said, without specifying its destination. The Japanese navy's two Aegis-equipped destroyers Kongo and Chokai are on stand-by at Sasebo, a defence ministry spokeswoman said. A South Korean Aegis-equipped warship is also likely to be deployed in waters near Japan, public broadcaster TBS reported, without citing sources. The North's missiles have alarmed Japan since a Taepodong-1 overflew its territory in 1998. The first test of a longer-range Taepodong-2 in 2006 failed after 40 seconds. Japan's security council will meet this week to prepare for the shooting down of any rocket or debris which threatens to strike its territory. General Ryoichi Oriki, chief of staff of the Japanese Self Defence Forces, told a media briefing: \"We will take all measures possible to ensure safety ... (...)", 
        "reply": "UPDATE: This thread was originally the thread titled \"USN warships deploy North Korean Satellite Launch\"....Please post all new updates at this thread to avoid duplicate threads! Please go to the latest post on the next page for the latest update. ++http://ca.news.yahoo.com/s/afp/090326/usa/nkorea_nuclear_missile_japan_us_military  This message has been edited. Last edited by: Canuck_Centaur, Sun 05 April 2009 09:10 AM", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 11:48:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "intTime": 20090326, 
        "postID": 22, 
        "quote": "", 
        "reply": "Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 12:07:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona?", 
        "intTime": 20090326, 
        "postID": 23, 
        "quote": "Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "reply": " Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona?", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 12:18:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: I wonder if the USS McCain is named after Senator McCain or his father or grandfather? Interesting answer ... it is named jointly for Admiral John S. McCain, Sr and Admiral John S. McCain, Jr ... Senator McCain's grandfather and father respectively. I don't know of any other jointly named ships in the Navy inventory ...", 
        "intTime": 20090326, 
        "postID": 24, 
        "quote": "I wonder if the USS McCain is named after Senator McCain or his father or grandfather?", 
        "reply": " Interesting answer ... it is named jointly for Admiral John S. McCain, Sr and Admiral John S. McCain, Jr ... Senator McCain's grandfather and father respectively. I don't know of any other jointly named ships in the Navy inventory ...", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 12:21:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Let the show begin. We best blow it away if they launch.", 
        "intTime": 20090326, 
        "postID": 25, 
        "quote": "", 
        "reply": "Let the show begin. We best blow it away if they launch.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 13:57:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona? Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Of those two men, only their melted Naval Academy rings were found, melted into ships structure, on the bridge of the U.S.S. Arizona... Respectfully, SUNLINER81", 
        "intTime": 20090326, 
        "postID": 26, 
        "quote": "Originally posted by Canuck_Centaur: quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona?", 
        "reply": " Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Of those two men, only their melted Naval Academy rings were found, melted into ships structure, on the bridge of the U.S.S. Arizona... Respectfully, SUNLINER81", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 14:06:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81", 
        "intTime": 20090326, 
        "postID": 27, 
        "quote": "Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch.", 
        "reply": " This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 14:09:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "On the other hand what if they are really launching a satelite?? Do we know for a fact that they are not? I am sure they have the ability to build a satelite, maybe a primitive \"sputnik\" type of thing but a satelite none the less. If they are, who are we to tell them that they can not?", 
        "intTime": 20090326, 
        "postID": 28, 
        "quote": "", 
        "reply": "On the other hand what if they are really launching a satelite?? Do we know for a fact that they are not? I am sure they have the ability to build a satelite, maybe a primitive \"sputnik\" type of thing but a satelite none the less. If they are, who are we to tell them that they can not?", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 15:32:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "They could be, and probably are launching a small satellite. A single communications satellite launched from North Korea wouldn't be very functional though. They certainly don't have the capabiity to go into geo orbit from their launch site. A Molniya orbit would be difficult and not likely at all. A polar orbit would require shooting over China so that isn't likely to happen either. A single comm satellite in LEO at 41 or 42 degrees inclination (which is the best they can probably do) has no practical application without being an entire constellation like Iridium. The booster failed the last time they launched it on July 4, 2006. That time it failed to achieve orbit, but if it does the biggest problem might be a failure in orbit and a resulting debris field.", 
        "intTime": 20090326, 
        "postID": 29, 
        "quote": "", 
        "reply": "They could be, and probably are launching a small satellite. A single communications satellite launched from North Korea wouldn't be very functional though. They certainly don't have the capabiity to go into geo orbit from their launch site. A Molniya orbit would be difficult and not likely at all. A polar orbit would require shooting over China so that isn't likely to happen either. A single comm satellite in LEO at 41 or 42 degrees inclination (which is the best they can probably do) has no practical application without being an entire constellation like Iridium. The booster failed the last time they launched it on July 4, 2006. That time it failed to achieve orbit, but if it does the biggest problem might be a failure in orbit and a resulting debris field.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 16:36:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "nspreitler"
    }, 
    {
        "content": "It would take a little more doing and require a more advance bird but once on orbit the orbit could be adjusted to a geo synch orbit. If it works out and with two more you have 24 hr world wide comm coverage. My point is who are we to tell them that they can not try to do it? To the point of threatening to shoot the thing down when it is in it's intitial boost phase.", 
        "intTime": 20090326, 
        "postID": 30, 
        "quote": "", 
        "reply": "It would take a little more doing and require a more advance bird but once on orbit the orbit could be adjusted to a geo synch orbit. If it works out and with two more you have 24 hr world wide comm coverage. My point is who are we to tell them that they can not try to do it? To the point of threatening to shoot the thing down when it is in it's intitial boost phase.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 17:13:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "You want to talk about nail biter... If the North Koreans are as paranoid as they sound this is going to be a tuff choice for the President... On one hand it could very well be a primitive satellite, on the other it could be a test of rocket technology to be used in the future for nuclear warheads... I wouldn't be worried about a conflict unless the North Koreans start moving troops to the DMZ to quickly respond to our actions...", 
        "intTime": 20090326, 
        "postID": 31, 
        "quote": "", 
        "reply": "You want to talk about nail biter... If the North Koreans are as paranoid as they sound this is going to be a tuff choice for the President... On one hand it could very well be a primitive satellite, on the other it could be a test of rocket technology to be used in the future for nuclear warheads... I wouldn't be worried about a conflict unless the North Koreans start moving troops to the DMZ to quickly respond to our actions...", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 17:58:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... SUNLINER81 Any relation to Captain Kidd, the pirate?", 
        "intTime": 20090326, 
        "postID": 32, 
        "quote": "Originally posted by SUNLINER81: Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... SUNLINER81", 
        "reply": " Any relation to Captain Kidd, the pirate?", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 19:08:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81 The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests.", 
        "intTime": 20090327, 
        "postID": 33, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81", 
        "reply": " The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-27 19:48:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "GeraldM"
    }, 
    {
        "content": "An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com", 
        "intTime": 20090328, 
        "postID": 34, 
        "quote": "", 
        "reply": "An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:26:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Respectfully, SUNLINER81 The Kidd Class Destroyer Don", 
        "intTime": 20090328, 
        "postID": 35, 
        "quote": "Originally posted by SUNLINER81: Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Respectfully, SUNLINER81", 
        "reply": " The Kidd Class Destroyer Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:39:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Hmmmm, well let's see now, George H.W. Bush left the US Navy as a LT. or maybe a LTjg didn't he? USS George H.W. Bush Don", 
        "intTime": 20090328, 
        "postID": 36, 
        "quote": "Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "reply": " Hmmmm, well let's see now, George H.W. Bush left the US Navy as a LT. or maybe a LTjg didn't he? USS George H.W. Bush Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:44:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by GeraldM: quote: Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81 The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests. Stable yes, united no! Why would they want another strong competitor in the region!", 
        "intTime": 20090328, 
        "postID": 37, 
        "quote": "Originally posted by GeraldM: quote: Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81 The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests.", 
        "reply": " Stable yes, united no! Why would they want another strong competitor in the region!", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:46:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com All those potential intercept missiles...someone ought to hit it. Don", 
        "intTime": 20090328, 
        "postID": 38, 
        "quote": "Originally posted by Canuck_Centaur: An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com", 
        "reply": " All those potential intercept missiles...someone ought to hit it. Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:47:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC.", 
        "intTime": 20090328, 
        "postID": 39, 
        "quote": "", 
        "reply": "Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:47:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC. I didn't know that. Wow, I've seen a few of them out at sea and thought they looked extremely impressive. Don", 
        "intTime": 20090328, 
        "postID": 40, 
        "quote": "Originally posted by Canuck_Centaur: Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC.", 
        "reply": " I didn't know that. Wow, I've seen a few of them out at sea and thought they looked extremely impressive. Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:50:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "UPDATE: This thread was originally the thread titled \"USN warships deploy North Korean Satellite Launch\"....Please post all new updates at this thread to avoid duplicate threads! Please go to the latest post on the next page for the latest update. ++http://ca.news.yahoo.com/s/afp/090326/usa/nkorea_nuclear_missile_japan_us_military quote: US says warships deployed before NKorea launch 2 hours, 42 minutes ago TOKYO (AFP) - The US Navy said Thursday it had deployed two warships in waters off Japan ahead of North Korea's planned rocket launch early next month. Two destroyers fitted with Aegis technology to track and destroy missiles left port on Wednesday, US Navy public relations officer Charles Howard told AFP. \"I would say we are ready for any contingencies,\" he said. Pyongyang says it will launch a communications satellite between April 4 and 8. The United States and its Asian allies suspect the launch is a test of a long-range ballistic missile that could reach North America. Tensions have risen after US officials said overnight that North Korea had moved a Taepodong-2 missile to the Musudan-ri launch site on the country's northeast coast. The US Navy spokesman said two Aegis-equipped destroyers -- the USS McCain and USS Chafee -- left Sasebo port in southwestern Japan where a third, the USS Curtis Wilbur, remained docked. The USS Stethem, another Aegis-equipped destroyer, was set to leave northern Aomori port Thursday after a port call of several days, a US Navy spokeswoman said, without specifying its destination. The Japanese navy's two Aegis-equipped destroyers Kongo and Chokai are on stand-by at Sasebo, a defence ministry spokeswoman said. A South Korean Aegis-equipped warship is also likely to be deployed in waters near Japan, public broadcaster TBS reported, without citing sources. The North's missiles have alarmed Japan since a Taepodong-1 overflew its territory in 1998. The first test of a longer-range Taepodong-2 in 2006 failed after 40 seconds. Japan's security council will meet this week to prepare for the shooting down of any rocket or debris which threatens to strike its territory. General Ryoichi Oriki, chief of staff of the Japanese Self Defence Forces, told a media briefing: \"We will take all measures possible to ensure safety ... (...) This message has been edited. Last edited by: Canuck_Centaur, Sun 05 April 2009 09:10 AM", 
        "intTime": 20090326, 
        "postID": 41, 
        "quote": "US says warships deployed before NKorea launch 2 hours, 42 minutes ago TOKYO (AFP) - The US Navy said Thursday it had deployed two warships in waters off Japan ahead of North Korea's planned rocket launch early next month. Two destroyers fitted with Aegis technology to track and destroy missiles left port on Wednesday, US Navy public relations officer Charles Howard told AFP. \"I would say we are ready for any contingencies,\" he said. Pyongyang says it will launch a communications satellite between April 4 and 8. The United States and its Asian allies suspect the launch is a test of a long-range ballistic missile that could reach North America. Tensions have risen after US officials said overnight that North Korea had moved a Taepodong-2 missile to the Musudan-ri launch site on the country's northeast coast. The US Navy spokesman said two Aegis-equipped destroyers -- the USS McCain and USS Chafee -- left Sasebo port in southwestern Japan where a third, the USS Curtis Wilbur, remained docked. The USS Stethem, another Aegis-equipped destroyer, was set to leave northern Aomori port Thursday after a port call of several days, a US Navy spokeswoman said, without specifying its destination. The Japanese navy's two Aegis-equipped destroyers Kongo and Chokai are on stand-by at Sasebo, a defence ministry spokeswoman said. A South Korean Aegis-equipped warship is also likely to be deployed in waters near Japan, public broadcaster TBS reported, without citing sources. The North's missiles have alarmed Japan since a Taepodong-1 overflew its territory in 1998. The first test of a longer-range Taepodong-2 in 2006 failed after 40 seconds. Japan's security council will meet this week to prepare for the shooting down of any rocket or debris which threatens to strike its territory. General Ryoichi Oriki, chief of staff of the Japanese Self Defence Forces, told a media briefing: \"We will take all measures possible to ensure safety ... (...)", 
        "reply": "UPDATE: This thread was originally the thread titled \"USN warships deploy North Korean Satellite Launch\"....Please post all new updates at this thread to avoid duplicate threads! Please go to the latest post on the next page for the latest update. ++http://ca.news.yahoo.com/s/afp/090326/usa/nkorea_nuclear_missile_japan_us_military  This message has been edited. Last edited by: Canuck_Centaur, Sun 05 April 2009 09:10 AM", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 11:48:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "intTime": 20090326, 
        "postID": 42, 
        "quote": "", 
        "reply": "Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 12:07:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona?", 
        "intTime": 20090326, 
        "postID": 43, 
        "quote": "Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "reply": " Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona?", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 12:18:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: I wonder if the USS McCain is named after Senator McCain or his father or grandfather? Interesting answer ... it is named jointly for Admiral John S. McCain, Sr and Admiral John S. McCain, Jr ... Senator McCain's grandfather and father respectively. I don't know of any other jointly named ships in the Navy inventory ...", 
        "intTime": 20090326, 
        "postID": 44, 
        "quote": "I wonder if the USS McCain is named after Senator McCain or his father or grandfather?", 
        "reply": " Interesting answer ... it is named jointly for Admiral John S. McCain, Sr and Admiral John S. McCain, Jr ... Senator McCain's grandfather and father respectively. I don't know of any other jointly named ships in the Navy inventory ...", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 12:21:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Let the show begin. We best blow it away if they launch.", 
        "intTime": 20090326, 
        "postID": 45, 
        "quote": "", 
        "reply": "Let the show begin. We best blow it away if they launch.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 13:57:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona? Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Of those two men, only their melted Naval Academy rings were found, melted into ships structure, on the bridge of the U.S.S. Arizona... Respectfully, SUNLINER81", 
        "intTime": 20090326, 
        "postID": 46, 
        "quote": "Originally posted by Canuck_Centaur: quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona?", 
        "reply": " Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Of those two men, only their melted Naval Academy rings were found, melted into ships structure, on the bridge of the U.S.S. Arizona... Respectfully, SUNLINER81", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 14:06:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81", 
        "intTime": 20090326, 
        "postID": 47, 
        "quote": "Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch.", 
        "reply": " This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 14:09:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "On the other hand what if they are really launching a satelite?? Do we know for a fact that they are not? I am sure they have the ability to build a satelite, maybe a primitive \"sputnik\" type of thing but a satelite none the less. If they are, who are we to tell them that they can not?", 
        "intTime": 20090326, 
        "postID": 48, 
        "quote": "", 
        "reply": "On the other hand what if they are really launching a satelite?? Do we know for a fact that they are not? I am sure they have the ability to build a satelite, maybe a primitive \"sputnik\" type of thing but a satelite none the less. If they are, who are we to tell them that they can not?", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 15:32:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "They could be, and probably are launching a small satellite. A single communications satellite launched from North Korea wouldn't be very functional though. They certainly don't have the capabiity to go into geo orbit from their launch site. A Molniya orbit would be difficult and not likely at all. A polar orbit would require shooting over China so that isn't likely to happen either. A single comm satellite in LEO at 41 or 42 degrees inclination (which is the best they can probably do) has no practical application without being an entire constellation like Iridium. The booster failed the last time they launched it on July 4, 2006. That time it failed to achieve orbit, but if it does the biggest problem might be a failure in orbit and a resulting debris field.", 
        "intTime": 20090326, 
        "postID": 49, 
        "quote": "", 
        "reply": "They could be, and probably are launching a small satellite. A single communications satellite launched from North Korea wouldn't be very functional though. They certainly don't have the capabiity to go into geo orbit from their launch site. A Molniya orbit would be difficult and not likely at all. A polar orbit would require shooting over China so that isn't likely to happen either. A single comm satellite in LEO at 41 or 42 degrees inclination (which is the best they can probably do) has no practical application without being an entire constellation like Iridium. The booster failed the last time they launched it on July 4, 2006. That time it failed to achieve orbit, but if it does the biggest problem might be a failure in orbit and a resulting debris field.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 16:36:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "nspreitler"
    }, 
    {
        "content": "It would take a little more doing and require a more advance bird but once on orbit the orbit could be adjusted to a geo synch orbit. If it works out and with two more you have 24 hr world wide comm coverage. My point is who are we to tell them that they can not try to do it? To the point of threatening to shoot the thing down when it is in it's intitial boost phase.", 
        "intTime": 20090326, 
        "postID": 50, 
        "quote": "", 
        "reply": "It would take a little more doing and require a more advance bird but once on orbit the orbit could be adjusted to a geo synch orbit. If it works out and with two more you have 24 hr world wide comm coverage. My point is who are we to tell them that they can not try to do it? To the point of threatening to shoot the thing down when it is in it's intitial boost phase.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 17:13:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "You want to talk about nail biter... If the North Koreans are as paranoid as they sound this is going to be a tuff choice for the President... On one hand it could very well be a primitive satellite, on the other it could be a test of rocket technology to be used in the future for nuclear warheads... I wouldn't be worried about a conflict unless the North Koreans start moving troops to the DMZ to quickly respond to our actions...", 
        "intTime": 20090326, 
        "postID": 51, 
        "quote": "", 
        "reply": "You want to talk about nail biter... If the North Koreans are as paranoid as they sound this is going to be a tuff choice for the President... On one hand it could very well be a primitive satellite, on the other it could be a test of rocket technology to be used in the future for nuclear warheads... I wouldn't be worried about a conflict unless the North Koreans start moving troops to the DMZ to quickly respond to our actions...", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 17:58:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... SUNLINER81 Any relation to Captain Kidd, the pirate?", 
        "intTime": 20090326, 
        "postID": 52, 
        "quote": "Originally posted by SUNLINER81: Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... SUNLINER81", 
        "reply": " Any relation to Captain Kidd, the pirate?", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 19:08:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81 The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests.", 
        "intTime": 20090327, 
        "postID": 53, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81", 
        "reply": " The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-27 19:48:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "GeraldM"
    }, 
    {
        "content": "An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com", 
        "intTime": 20090328, 
        "postID": 54, 
        "quote": "", 
        "reply": "An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:26:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Respectfully, SUNLINER81 The Kidd Class Destroyer Don", 
        "intTime": 20090328, 
        "postID": 55, 
        "quote": "Originally posted by SUNLINER81: Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Respectfully, SUNLINER81", 
        "reply": " The Kidd Class Destroyer Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:39:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Hmmmm, well let's see now, George H.W. Bush left the US Navy as a LT. or maybe a LTjg didn't he? USS George H.W. Bush Don", 
        "intTime": 20090328, 
        "postID": 56, 
        "quote": "Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "reply": " Hmmmm, well let's see now, George H.W. Bush left the US Navy as a LT. or maybe a LTjg didn't he? USS George H.W. Bush Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:44:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by GeraldM: quote: Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81 The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests. Stable yes, united no! Why would they want another strong competitor in the region!", 
        "intTime": 20090328, 
        "postID": 57, 
        "quote": "Originally posted by GeraldM: quote: Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81 The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests.", 
        "reply": " Stable yes, united no! Why would they want another strong competitor in the region!", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:46:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com All those potential intercept missiles...someone ought to hit it. Don", 
        "intTime": 20090328, 
        "postID": 58, 
        "quote": "Originally posted by Canuck_Centaur: An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com", 
        "reply": " All those potential intercept missiles...someone ought to hit it. Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:47:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC.", 
        "intTime": 20090328, 
        "postID": 59, 
        "quote": "", 
        "reply": "Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:47:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC. I didn't know that. Wow, I've seen a few of them out at sea and thought they looked extremely impressive. Don", 
        "intTime": 20090328, 
        "postID": 60, 
        "quote": "Originally posted by Canuck_Centaur: Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC.", 
        "reply": " I didn't know that. Wow, I've seen a few of them out at sea and thought they looked extremely impressive. Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:50:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "UPDATE: This thread was originally the thread titled \"USN warships deploy North Korean Satellite Launch\"....Please post all new updates at this thread to avoid duplicate threads! Please go to the latest post on the next page for the latest update. ++http://ca.news.yahoo.com/s/afp/090326/usa/nkorea_nuclear_missile_japan_us_military quote: US says warships deployed before NKorea launch 2 hours, 42 minutes ago TOKYO (AFP) - The US Navy said Thursday it had deployed two warships in waters off Japan ahead of North Korea's planned rocket launch early next month. Two destroyers fitted with Aegis technology to track and destroy missiles left port on Wednesday, US Navy public relations officer Charles Howard told AFP. \"I would say we are ready for any contingencies,\" he said. Pyongyang says it will launch a communications satellite between April 4 and 8. The United States and its Asian allies suspect the launch is a test of a long-range ballistic missile that could reach North America. Tensions have risen after US officials said overnight that North Korea had moved a Taepodong-2 missile to the Musudan-ri launch site on the country's northeast coast. The US Navy spokesman said two Aegis-equipped destroyers -- the USS McCain and USS Chafee -- left Sasebo port in southwestern Japan where a third, the USS Curtis Wilbur, remained docked. The USS Stethem, another Aegis-equipped destroyer, was set to leave northern Aomori port Thursday after a port call of several days, a US Navy spokeswoman said, without specifying its destination. The Japanese navy's two Aegis-equipped destroyers Kongo and Chokai are on stand-by at Sasebo, a defence ministry spokeswoman said. A South Korean Aegis-equipped warship is also likely to be deployed in waters near Japan, public broadcaster TBS reported, without citing sources. The North's missiles have alarmed Japan since a Taepodong-1 overflew its territory in 1998. The first test of a longer-range Taepodong-2 in 2006 failed after 40 seconds. Japan's security council will meet this week to prepare for the shooting down of any rocket or debris which threatens to strike its territory. General Ryoichi Oriki, chief of staff of the Japanese Self Defence Forces, told a media briefing: \"We will take all measures possible to ensure safety ... (...) This message has been edited. Last edited by: Canuck_Centaur, Sun 05 April 2009 09:10 AM", 
        "intTime": 20090326, 
        "postID": 61, 
        "quote": "US says warships deployed before NKorea launch 2 hours, 42 minutes ago TOKYO (AFP) - The US Navy said Thursday it had deployed two warships in waters off Japan ahead of North Korea's planned rocket launch early next month. Two destroyers fitted with Aegis technology to track and destroy missiles left port on Wednesday, US Navy public relations officer Charles Howard told AFP. \"I would say we are ready for any contingencies,\" he said. Pyongyang says it will launch a communications satellite between April 4 and 8. The United States and its Asian allies suspect the launch is a test of a long-range ballistic missile that could reach North America. Tensions have risen after US officials said overnight that North Korea had moved a Taepodong-2 missile to the Musudan-ri launch site on the country's northeast coast. The US Navy spokesman said two Aegis-equipped destroyers -- the USS McCain and USS Chafee -- left Sasebo port in southwestern Japan where a third, the USS Curtis Wilbur, remained docked. The USS Stethem, another Aegis-equipped destroyer, was set to leave northern Aomori port Thursday after a port call of several days, a US Navy spokeswoman said, without specifying its destination. The Japanese navy's two Aegis-equipped destroyers Kongo and Chokai are on stand-by at Sasebo, a defence ministry spokeswoman said. A South Korean Aegis-equipped warship is also likely to be deployed in waters near Japan, public broadcaster TBS reported, without citing sources. The North's missiles have alarmed Japan since a Taepodong-1 overflew its territory in 1998. The first test of a longer-range Taepodong-2 in 2006 failed after 40 seconds. Japan's security council will meet this week to prepare for the shooting down of any rocket or debris which threatens to strike its territory. General Ryoichi Oriki, chief of staff of the Japanese Self Defence Forces, told a media briefing: \"We will take all measures possible to ensure safety ... (...)", 
        "reply": "UPDATE: This thread was originally the thread titled \"USN warships deploy North Korean Satellite Launch\"....Please post all new updates at this thread to avoid duplicate threads! Please go to the latest post on the next page for the latest update. ++http://ca.news.yahoo.com/s/afp/090326/usa/nkorea_nuclear_missile_japan_us_military  This message has been edited. Last edited by: Canuck_Centaur, Sun 05 April 2009 09:10 AM", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 11:48:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "intTime": 20090326, 
        "postID": 62, 
        "quote": "", 
        "reply": "Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 12:07:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona?", 
        "intTime": 20090326, 
        "postID": 63, 
        "quote": "Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "reply": " Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona?", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 12:18:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: I wonder if the USS McCain is named after Senator McCain or his father or grandfather? Interesting answer ... it is named jointly for Admiral John S. McCain, Sr and Admiral John S. McCain, Jr ... Senator McCain's grandfather and father respectively. I don't know of any other jointly named ships in the Navy inventory ...", 
        "intTime": 20090326, 
        "postID": 64, 
        "quote": "I wonder if the USS McCain is named after Senator McCain or his father or grandfather?", 
        "reply": " Interesting answer ... it is named jointly for Admiral John S. McCain, Sr and Admiral John S. McCain, Jr ... Senator McCain's grandfather and father respectively. I don't know of any other jointly named ships in the Navy inventory ...", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 12:21:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Let the show begin. We best blow it away if they launch.", 
        "intTime": 20090326, 
        "postID": 65, 
        "quote": "", 
        "reply": "Let the show begin. We best blow it away if they launch.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 13:57:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona? Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Of those two men, only their melted Naval Academy rings were found, melted into ships structure, on the bridge of the U.S.S. Arizona... Respectfully, SUNLINER81", 
        "intTime": 20090326, 
        "postID": 66, 
        "quote": "Originally posted by Canuck_Centaur: quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona?", 
        "reply": " Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Of those two men, only their melted Naval Academy rings were found, melted into ships structure, on the bridge of the U.S.S. Arizona... Respectfully, SUNLINER81", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 14:06:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81", 
        "intTime": 20090326, 
        "postID": 67, 
        "quote": "Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch.", 
        "reply": " This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 14:09:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "On the other hand what if they are really launching a satelite?? Do we know for a fact that they are not? I am sure they have the ability to build a satelite, maybe a primitive \"sputnik\" type of thing but a satelite none the less. If they are, who are we to tell them that they can not?", 
        "intTime": 20090326, 
        "postID": 68, 
        "quote": "", 
        "reply": "On the other hand what if they are really launching a satelite?? Do we know for a fact that they are not? I am sure they have the ability to build a satelite, maybe a primitive \"sputnik\" type of thing but a satelite none the less. If they are, who are we to tell them that they can not?", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 15:32:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "They could be, and probably are launching a small satellite. A single communications satellite launched from North Korea wouldn't be very functional though. They certainly don't have the capabiity to go into geo orbit from their launch site. A Molniya orbit would be difficult and not likely at all. A polar orbit would require shooting over China so that isn't likely to happen either. A single comm satellite in LEO at 41 or 42 degrees inclination (which is the best they can probably do) has no practical application without being an entire constellation like Iridium. The booster failed the last time they launched it on July 4, 2006. That time it failed to achieve orbit, but if it does the biggest problem might be a failure in orbit and a resulting debris field.", 
        "intTime": 20090326, 
        "postID": 69, 
        "quote": "", 
        "reply": "They could be, and probably are launching a small satellite. A single communications satellite launched from North Korea wouldn't be very functional though. They certainly don't have the capabiity to go into geo orbit from their launch site. A Molniya orbit would be difficult and not likely at all. A polar orbit would require shooting over China so that isn't likely to happen either. A single comm satellite in LEO at 41 or 42 degrees inclination (which is the best they can probably do) has no practical application without being an entire constellation like Iridium. The booster failed the last time they launched it on July 4, 2006. That time it failed to achieve orbit, but if it does the biggest problem might be a failure in orbit and a resulting debris field.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 16:36:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "nspreitler"
    }, 
    {
        "content": "It would take a little more doing and require a more advance bird but once on orbit the orbit could be adjusted to a geo synch orbit. If it works out and with two more you have 24 hr world wide comm coverage. My point is who are we to tell them that they can not try to do it? To the point of threatening to shoot the thing down when it is in it's intitial boost phase.", 
        "intTime": 20090326, 
        "postID": 70, 
        "quote": "", 
        "reply": "It would take a little more doing and require a more advance bird but once on orbit the orbit could be adjusted to a geo synch orbit. If it works out and with two more you have 24 hr world wide comm coverage. My point is who are we to tell them that they can not try to do it? To the point of threatening to shoot the thing down when it is in it's intitial boost phase.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 17:13:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "You want to talk about nail biter... If the North Koreans are as paranoid as they sound this is going to be a tuff choice for the President... On one hand it could very well be a primitive satellite, on the other it could be a test of rocket technology to be used in the future for nuclear warheads... I wouldn't be worried about a conflict unless the North Koreans start moving troops to the DMZ to quickly respond to our actions...", 
        "intTime": 20090326, 
        "postID": 71, 
        "quote": "", 
        "reply": "You want to talk about nail biter... If the North Koreans are as paranoid as they sound this is going to be a tuff choice for the President... On one hand it could very well be a primitive satellite, on the other it could be a test of rocket technology to be used in the future for nuclear warheads... I wouldn't be worried about a conflict unless the North Koreans start moving troops to the DMZ to quickly respond to our actions...", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 17:58:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... SUNLINER81 Any relation to Captain Kidd, the pirate?", 
        "intTime": 20090326, 
        "postID": 72, 
        "quote": "Originally posted by SUNLINER81: Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... SUNLINER81", 
        "reply": " Any relation to Captain Kidd, the pirate?", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 19:08:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81 The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests.", 
        "intTime": 20090327, 
        "postID": 73, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81", 
        "reply": " The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-27 19:48:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "GeraldM"
    }, 
    {
        "content": "An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com", 
        "intTime": 20090328, 
        "postID": 74, 
        "quote": "", 
        "reply": "An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:26:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Respectfully, SUNLINER81 The Kidd Class Destroyer Don", 
        "intTime": 20090328, 
        "postID": 75, 
        "quote": "Originally posted by SUNLINER81: Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Respectfully, SUNLINER81", 
        "reply": " The Kidd Class Destroyer Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:39:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Hmmmm, well let's see now, George H.W. Bush left the US Navy as a LT. or maybe a LTjg didn't he? USS George H.W. Bush Don", 
        "intTime": 20090328, 
        "postID": 76, 
        "quote": "Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "reply": " Hmmmm, well let's see now, George H.W. Bush left the US Navy as a LT. or maybe a LTjg didn't he? USS George H.W. Bush Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:44:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by GeraldM: quote: Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81 The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests. Stable yes, united no! Why would they want another strong competitor in the region!", 
        "intTime": 20090328, 
        "postID": 77, 
        "quote": "Originally posted by GeraldM: quote: Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81 The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests.", 
        "reply": " Stable yes, united no! Why would they want another strong competitor in the region!", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:46:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com All those potential intercept missiles...someone ought to hit it. Don", 
        "intTime": 20090328, 
        "postID": 78, 
        "quote": "Originally posted by Canuck_Centaur: An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com", 
        "reply": " All those potential intercept missiles...someone ought to hit it. Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:47:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC.", 
        "intTime": 20090328, 
        "postID": 79, 
        "quote": "", 
        "reply": "Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:47:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC. I didn't know that. Wow, I've seen a few of them out at sea and thought they looked extremely impressive. Don", 
        "intTime": 20090328, 
        "postID": 80, 
        "quote": "Originally posted by Canuck_Centaur: Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC.", 
        "reply": " I didn't know that. Wow, I've seen a few of them out at sea and thought they looked extremely impressive. Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:50:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "UPDATE: This thread was originally the thread titled \"USN warships deploy North Korean Satellite Launch\"....Please post all new updates at this thread to avoid duplicate threads! Please go to the latest post on the next page for the latest update. ++http://ca.news.yahoo.com/s/afp/090326/usa/nkorea_nuclear_missile_japan_us_military quote: US says warships deployed before NKorea launch 2 hours, 42 minutes ago TOKYO (AFP) - The US Navy said Thursday it had deployed two warships in waters off Japan ahead of North Korea's planned rocket launch early next month. Two destroyers fitted with Aegis technology to track and destroy missiles left port on Wednesday, US Navy public relations officer Charles Howard told AFP. \"I would say we are ready for any contingencies,\" he said. Pyongyang says it will launch a communications satellite between April 4 and 8. The United States and its Asian allies suspect the launch is a test of a long-range ballistic missile that could reach North America. Tensions have risen after US officials said overnight that North Korea had moved a Taepodong-2 missile to the Musudan-ri launch site on the country's northeast coast. The US Navy spokesman said two Aegis-equipped destroyers -- the USS McCain and USS Chafee -- left Sasebo port in southwestern Japan where a third, the USS Curtis Wilbur, remained docked. The USS Stethem, another Aegis-equipped destroyer, was set to leave northern Aomori port Thursday after a port call of several days, a US Navy spokeswoman said, without specifying its destination. The Japanese navy's two Aegis-equipped destroyers Kongo and Chokai are on stand-by at Sasebo, a defence ministry spokeswoman said. A South Korean Aegis-equipped warship is also likely to be deployed in waters near Japan, public broadcaster TBS reported, without citing sources. The North's missiles have alarmed Japan since a Taepodong-1 overflew its territory in 1998. The first test of a longer-range Taepodong-2 in 2006 failed after 40 seconds. Japan's security council will meet this week to prepare for the shooting down of any rocket or debris which threatens to strike its territory. General Ryoichi Oriki, chief of staff of the Japanese Self Defence Forces, told a media briefing: \"We will take all measures possible to ensure safety ... (...) This message has been edited. Last edited by: Canuck_Centaur, Sun 05 April 2009 09:10 AM", 
        "intTime": 20090326, 
        "postID": 81, 
        "quote": "US says warships deployed before NKorea launch 2 hours, 42 minutes ago TOKYO (AFP) - The US Navy said Thursday it had deployed two warships in waters off Japan ahead of North Korea's planned rocket launch early next month. Two destroyers fitted with Aegis technology to track and destroy missiles left port on Wednesday, US Navy public relations officer Charles Howard told AFP. \"I would say we are ready for any contingencies,\" he said. Pyongyang says it will launch a communications satellite between April 4 and 8. The United States and its Asian allies suspect the launch is a test of a long-range ballistic missile that could reach North America. Tensions have risen after US officials said overnight that North Korea had moved a Taepodong-2 missile to the Musudan-ri launch site on the country's northeast coast. The US Navy spokesman said two Aegis-equipped destroyers -- the USS McCain and USS Chafee -- left Sasebo port in southwestern Japan where a third, the USS Curtis Wilbur, remained docked. The USS Stethem, another Aegis-equipped destroyer, was set to leave northern Aomori port Thursday after a port call of several days, a US Navy spokeswoman said, without specifying its destination. The Japanese navy's two Aegis-equipped destroyers Kongo and Chokai are on stand-by at Sasebo, a defence ministry spokeswoman said. A South Korean Aegis-equipped warship is also likely to be deployed in waters near Japan, public broadcaster TBS reported, without citing sources. The North's missiles have alarmed Japan since a Taepodong-1 overflew its territory in 1998. The first test of a longer-range Taepodong-2 in 2006 failed after 40 seconds. Japan's security council will meet this week to prepare for the shooting down of any rocket or debris which threatens to strike its territory. General Ryoichi Oriki, chief of staff of the Japanese Self Defence Forces, told a media briefing: \"We will take all measures possible to ensure safety ... (...)", 
        "reply": "UPDATE: This thread was originally the thread titled \"USN warships deploy North Korean Satellite Launch\"....Please post all new updates at this thread to avoid duplicate threads! Please go to the latest post on the next page for the latest update. ++http://ca.news.yahoo.com/s/afp/090326/usa/nkorea_nuclear_missile_japan_us_military  This message has been edited. Last edited by: Canuck_Centaur, Sun 05 April 2009 09:10 AM", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 11:48:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "intTime": 20090326, 
        "postID": 82, 
        "quote": "", 
        "reply": "Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 12:07:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona?", 
        "intTime": 20090326, 
        "postID": 83, 
        "quote": "Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "reply": " Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona?", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 12:18:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: I wonder if the USS McCain is named after Senator McCain or his father or grandfather? Interesting answer ... it is named jointly for Admiral John S. McCain, Sr and Admiral John S. McCain, Jr ... Senator McCain's grandfather and father respectively. I don't know of any other jointly named ships in the Navy inventory ...", 
        "intTime": 20090326, 
        "postID": 84, 
        "quote": "I wonder if the USS McCain is named after Senator McCain or his father or grandfather?", 
        "reply": " Interesting answer ... it is named jointly for Admiral John S. McCain, Sr and Admiral John S. McCain, Jr ... Senator McCain's grandfather and father respectively. I don't know of any other jointly named ships in the Navy inventory ...", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 12:21:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "I_M_Qwerty"
    }, 
    {
        "content": "Let the show begin. We best blow it away if they launch.", 
        "intTime": 20090326, 
        "postID": 85, 
        "quote": "", 
        "reply": "Let the show begin. We best blow it away if they launch.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 13:57:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona? Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Of those two men, only their melted Naval Academy rings were found, melted into ships structure, on the bridge of the U.S.S. Arizona... Respectfully, SUNLINER81", 
        "intTime": 20090326, 
        "postID": 86, 
        "quote": "Originally posted by Canuck_Centaur: quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Oh come on, wasn't there a destroyer from WW2 called USS Van Valkenburgh that was named after the ill-fated captain of the USS Arizona?", 
        "reply": " Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Of those two men, only their melted Naval Academy rings were found, melted into ships structure, on the bridge of the U.S.S. Arizona... Respectfully, SUNLINER81", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 14:06:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81", 
        "intTime": 20090326, 
        "postID": 87, 
        "quote": "Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch.", 
        "reply": " This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 14:09:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "On the other hand what if they are really launching a satelite?? Do we know for a fact that they are not? I am sure they have the ability to build a satelite, maybe a primitive \"sputnik\" type of thing but a satelite none the less. If they are, who are we to tell them that they can not?", 
        "intTime": 20090326, 
        "postID": 88, 
        "quote": "", 
        "reply": "On the other hand what if they are really launching a satelite?? Do we know for a fact that they are not? I am sure they have the ability to build a satelite, maybe a primitive \"sputnik\" type of thing but a satelite none the less. If they are, who are we to tell them that they can not?", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 15:32:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "They could be, and probably are launching a small satellite. A single communications satellite launched from North Korea wouldn't be very functional though. They certainly don't have the capabiity to go into geo orbit from their launch site. A Molniya orbit would be difficult and not likely at all. A polar orbit would require shooting over China so that isn't likely to happen either. A single comm satellite in LEO at 41 or 42 degrees inclination (which is the best they can probably do) has no practical application without being an entire constellation like Iridium. The booster failed the last time they launched it on July 4, 2006. That time it failed to achieve orbit, but if it does the biggest problem might be a failure in orbit and a resulting debris field.", 
        "intTime": 20090326, 
        "postID": 89, 
        "quote": "", 
        "reply": "They could be, and probably are launching a small satellite. A single communications satellite launched from North Korea wouldn't be very functional though. They certainly don't have the capabiity to go into geo orbit from their launch site. A Molniya orbit would be difficult and not likely at all. A polar orbit would require shooting over China so that isn't likely to happen either. A single comm satellite in LEO at 41 or 42 degrees inclination (which is the best they can probably do) has no practical application without being an entire constellation like Iridium. The booster failed the last time they launched it on July 4, 2006. That time it failed to achieve orbit, but if it does the biggest problem might be a failure in orbit and a resulting debris field.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 16:36:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "nspreitler"
    }, 
    {
        "content": "It would take a little more doing and require a more advance bird but once on orbit the orbit could be adjusted to a geo synch orbit. If it works out and with two more you have 24 hr world wide comm coverage. My point is who are we to tell them that they can not try to do it? To the point of threatening to shoot the thing down when it is in it's intitial boost phase.", 
        "intTime": 20090326, 
        "postID": 90, 
        "quote": "", 
        "reply": "It would take a little more doing and require a more advance bird but once on orbit the orbit could be adjusted to a geo synch orbit. If it works out and with two more you have 24 hr world wide comm coverage. My point is who are we to tell them that they can not try to do it? To the point of threatening to shoot the thing down when it is in it's intitial boost phase.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 17:13:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "ETCPJ"
    }, 
    {
        "content": "You want to talk about nail biter... If the North Koreans are as paranoid as they sound this is going to be a tuff choice for the President... On one hand it could very well be a primitive satellite, on the other it could be a test of rocket technology to be used in the future for nuclear warheads... I wouldn't be worried about a conflict unless the North Koreans start moving troops to the DMZ to quickly respond to our actions...", 
        "intTime": 20090326, 
        "postID": 91, 
        "quote": "", 
        "reply": "You want to talk about nail biter... If the North Koreans are as paranoid as they sound this is going to be a tuff choice for the President... On one hand it could very well be a primitive satellite, on the other it could be a test of rocket technology to be used in the future for nuclear warheads... I wouldn't be worried about a conflict unless the North Koreans start moving troops to the DMZ to quickly respond to our actions...", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 17:58:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Irwin_R_Schyster"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... SUNLINER81 Any relation to Captain Kidd, the pirate?", 
        "intTime": 20090326, 
        "postID": 92, 
        "quote": "Originally posted by SUNLINER81: Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... SUNLINER81", 
        "reply": " Any relation to Captain Kidd, the pirate?", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-26 19:08:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81 The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests.", 
        "intTime": 20090327, 
        "postID": 93, 
        "quote": "Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81", 
        "reply": " The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-27 19:48:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "GeraldM"
    }, 
    {
        "content": "An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com", 
        "intTime": 20090328, 
        "postID": 94, 
        "quote": "", 
        "reply": "An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:26:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by SUNLINER81: Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Respectfully, SUNLINER81 The Kidd Class Destroyer Don", 
        "intTime": 20090328, 
        "postID": 95, 
        "quote": "Originally posted by SUNLINER81: Yes, there was AND both he and Rear Admiral Isaac C. Kidd, who died together on the bridge of the U.S.S. Arizona were both recipients of the Medal of Honor for their actions on that day... Admiral Kidd also had a Fletcher class destroyer named after him and it exists as a museum ship today... Respectfully, SUNLINER81", 
        "reply": " The Kidd Class Destroyer Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:39:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes: Hmmmm, well let's see now, George H.W. Bush left the US Navy as a LT. or maybe a LTjg didn't he? USS George H.W. Bush Don", 
        "intTime": 20090328, 
        "postID": 96, 
        "quote": "Originally posted by Irwin_R_Schyster: Lets see, Name a warship after a Captain or an Admiral?? \"rolleyes:", 
        "reply": " Hmmmm, well let's see now, George H.W. Bush left the US Navy as a LT. or maybe a LTjg didn't he? USS George H.W. Bush Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:44:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "quote: Originally posted by GeraldM: quote: Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81 The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests. Stable yes, united no! Why would they want another strong competitor in the region!", 
        "intTime": 20090328, 
        "postID": 97, 
        "quote": "Originally posted by GeraldM: quote: Originally posted by SUNLINER81: quote: Originally posted by crackerjacks61: Let the show begin. We best blow it away if they launch. This maybe the \"test\", that Biden spoke of... This may be a \"no win\" situation, no matter which course of action is taken... I would be sure that an American \"fast attack\" boat is making like a \"hole in the water\" near those ships, listening for a PRC AIP submarine... Respectfully, SUNLINER81 The PRC are on our side for this one. They want the region to be stable more than we do, and a United Korea is in their interests.", 
        "reply": " Stable yes, united no! Why would they want another strong competitor in the region!", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:46:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Knele"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com All those potential intercept missiles...someone ought to hit it. Don", 
        "intTime": 20090328, 
        "postID": 98, 
        "quote": "Originally posted by Canuck_Centaur: An update at the North Korea forum section of military.com: \"Japan okays shootdown of inbound North Korean rocket\" thread of military.com", 
        "reply": " All those potential intercept missiles...someone ought to hit it. Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:47:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }, 
    {
        "content": "Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC.", 
        "intTime": 20090328, 
        "postID": 99, 
        "quote": "", 
        "reply": "Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC.", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:47:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "quote: Originally posted by Canuck_Centaur: Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC. I didn't know that. Wow, I've seen a few of them out at sea and thought they looked extremely impressive. Don", 
        "intTime": 20090328, 
        "postID": 100, 
        "quote": "Originally posted by Canuck_Centaur: Don, All four of those KIDD Class Destroyers are now used by the Taiwan Navy/Republic of China Navy/ROCN; they were sold to them and most were delivered by 2005-2006, IIRC.", 
        "reply": " I didn't know that. Wow, I've seen a few of them out at sea and thought they looked extremely impressive. Don", 
        "threadID": "672198221_1670089812001", 
        "time": "2009-03-28 09:50:00", 
        "title": "update: North Korean ROCKET launch a failure (satellite never makes orbit!)", 
        "userID": "21yrsUSCGUSCS"
    }
]