[
    {
        "content": "\"http://www.washingtonpost.com/wp-dyn/content/article/2005/06/07/AR2005060702026.html\" i wonder if they will even try", 
        "intTime": 20090406, 
        "postID": 1, 
        "quote": "", 
        "reply": "\"http://www.washingtonpost.com/wp-dyn/content/article/2005/06/07/AR2005060702026.html\" i wonder if they will even try", 
        "threadID": "672198221_4690049912001", 
        "time": "2009-04-06 00:59:00", 
        "title": "not a global war on terrorism?", 
        "userID": "backtoiraq"
    }, 
    {
        "content": "There's gotta be SOME reason the Iraqis aren't able to realise all the good that's being done to them. Outside interference is as good as any. It's good for America too because it takes the mind off the flowers and cakewalks that never quite materialised and provides a reason to keep on keeping on.", 
        "intTime": 20090406, 
        "postID": 2, 
        "quote": "", 
        "reply": "There's gotta be SOME reason the Iraqis aren't able to realise all the good that's being done to them. Outside interference is as good as any. It's good for America too because it takes the mind off the flowers and cakewalks that never quite materialised and provides a reason to keep on keeping on.", 
        "threadID": "672198221_4690049912001", 
        "time": "2009-04-06 04:20:00", 
        "title": "not a global war on terrorism?", 
        "userID": "AliBubba"
    }, 
    {
        "content": "We're not going to win a war on an ideal, just like we didn't/won't win the wars on: Drugs Poverty Homelessness AIDS Oh, and as far as us winning the war on communism, we haven't completely won that one, either as communism is still alive and well all over the world.......over 50 years later.", 
        "intTime": 20090406, 
        "postID": 3, 
        "quote": "", 
        "reply": "We're not going to win a war on an ideal, just like we didn't/won't win the wars on: Drugs Poverty Homelessness AIDS Oh, and as far as us winning the war on communism, we haven't completely won that one, either as communism is still alive and well all over the world.......over 50 years later.", 
        "threadID": "672198221_4690049912001", 
        "time": "2009-04-06 07:46:00", 
        "title": "not a global war on terrorism?", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "If you were able to ask the Iraqis, \"Are you better off now than you were under Saddam Hussein?\" They would answer: \"No!\" He may have been a vicious dictator and they may have despised him but Iraq was peaceful. The Iraqis had electricity and food and a life. Now they have little or none of the advantages that they had under Saddam, SOB that he was. So, what good have we brought them?", 
        "intTime": 20090406, 
        "postID": 4, 
        "quote": "", 
        "reply": "If you were able to ask the Iraqis, \"Are you better off now than you were under Saddam Hussein?\" They would answer: \"No!\" He may have been a vicious dictator and they may have despised him but Iraq was peaceful. The Iraqis had electricity and food and a life. Now they have little or none of the advantages that they had under Saddam, SOB that he was. So, what good have we brought them?", 
        "threadID": "672198221_4690049912001", 
        "time": "2009-04-06 11:37:00", 
        "title": "not a global war on terrorism?", 
        "userID": "fnewt"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: We're not going to win a war on an ideal, just like we didn't/won't win the wars on: Drugs Poverty Homelessness AIDS Oh, and as far as us winning the war on communism, we haven't completely won that one, either as communism is still alive and well all over the world.......over 50 years later. Do we add the Economic war to that list as well? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090406, 
        "postID": 5, 
        "quote": "Originally posted by mrmixitup: We're not going to win a war on an ideal, just like we didn't/won't win the wars on: Drugs Poverty Homelessness AIDS Oh, and as far as us winning the war on communism, we haven't completely won that one, either as communism is still alive and well all over the world.......over 50 years later.", 
        "reply": " Do we add the Economic war to that list as well? Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4690049912001", 
        "time": "2009-04-06 12:00:00", 
        "title": "not a global war on terrorism?", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by fnewt: If you were able to ask the Iraqis, \"Are you better off now than you were under Saddam Hussein?\" They would answer: \"No!\" He may have been a vicious dictator and they may have despised him but Iraq was peaceful. The Iraqis had electricity and food and a life. Now they have little or none of the advantages that they had under Saddam, SOB that he was. So, what good have we brought them? Frank, I hate to throw this out there, but you haven't been to Iraq lately have you? Peaceful? You surely haven't seen the mass graves around the country or read on Haditha, the Kurds, or Peshmerga under Saddam have you? Little or none of the advantages like those under Saddam? You mean schools, cell phones, or books about anything other than Saddam himself. I suggest you backtrack and find your senses before you get in over your head in a debate you can't win. C.R. This message has been edited. Last edited by: CYCLIC_RUNAWAY, Mon 06 April 2009 02:07 PM", 
        "intTime": 20090406, 
        "postID": 6, 
        "quote": "Originally posted by fnewt: If you were able to ask the Iraqis, \"Are you better off now than you were under Saddam Hussein?\" They would answer: \"No!\" He may have been a vicious dictator and they may have despised him but Iraq was peaceful. The Iraqis had electricity and food and a life. Now they have little or none of the advantages that they had under Saddam, SOB that he was. So, what good have we brought them?", 
        "reply": " Frank, I hate to throw this out there, but you haven't been to Iraq lately have you? Peaceful? You surely haven't seen the mass graves around the country or read on Haditha, the Kurds, or Peshmerga under Saddam have you? Little or none of the advantages like those under Saddam? You mean schools, cell phones, or books about anything other than Saddam himself. I suggest you backtrack and find your senses before you get in over your head in a debate you can't win. C.R. This message has been edited. Last edited by: CYCLIC_RUNAWAY, Mon 06 April 2009 02:07 PM", 
        "threadID": "672198221_4690049912001", 
        "time": "2009-04-06 13:26:00", 
        "title": "not a global war on terrorism?", 
        "userID": "CYCLIC_RUNAWAY"
    }, 
    {
        "content": "quote: Originally posted by fnewt: If you were able to ask the Iraqis, \"Are you better off now than you were under Saddam Hussein?\" They would answer: \"No!\" He may have been a vicious dictator and they may have despised him but Iraq was peaceful. The Iraqis had electricity and food and a life. Now they have little or none of the advantages that they had under Saddam, SOB that he was. So, what good have we brought them? A lot more then you think of FOOL! I bet if you ask the Germans (especially the East Germans) the same question five years after WWII ended that were they better off when corrupt, soulless Hitler was in charge they might of said the same thing. But after twenty years went by and now the Germans are FAR BETTER OFF NOW then when they were with the Godless Soul Hitler they will say Now they are better off from Hitler. Given time when many years pass and they keep track to their version of democracy they too will say they are better off from the demonic Saddam.", 
        "intTime": 20090406, 
        "postID": 7, 
        "quote": "Originally posted by fnewt: If you were able to ask the Iraqis, \"Are you better off now than you were under Saddam Hussein?\" They would answer: \"No!\" He may have been a vicious dictator and they may have despised him but Iraq was peaceful. The Iraqis had electricity and food and a life. Now they have little or none of the advantages that they had under Saddam, SOB that he was. So, what good have we brought them?", 
        "reply": " A lot more then you think of FOOL! I bet if you ask the Germans (especially the East Germans) the same question five years after WWII ended that were they better off when corrupt, soulless Hitler was in charge they might of said the same thing. But after twenty years went by and now the Germans are FAR BETTER OFF NOW then when they were with the Godless Soul Hitler they will say Now they are better off from Hitler. Given time when many years pass and they keep track to their version of democracy they too will say they are better off from the demonic Saddam.", 
        "threadID": "672198221_4690049912001", 
        "time": "2009-04-06 14:02:00", 
        "title": "not a global war on terrorism?", 
        "userID": "SSGDuke53"
    }, 
    {
        "content": "Remember, Clinton, Kerry and Democrat party said that Iraq had WMD's, therefore leading us into Iraq....", 
        "intTime": 20090406, 
        "postID": 8, 
        "quote": "", 
        "reply": "Remember, Clinton, Kerry and Democrat party said that Iraq had WMD's, therefore leading us into Iraq....", 
        "threadID": "672198221_4690049912001", 
        "time": "2009-04-06 15:20:00", 
        "title": "not a global war on terrorism?", 
        "userID": "dman1948"
    }, 
    {
        "content": "quote: Originally posted by fnewt: If you were able to ask the Iraqis, \"Are you better off now than you were under Saddam Hussein?\" They would answer: \"No!\" He may have been a vicious dictator and they may have despised him but Iraq was peaceful. The Iraqis had electricity and food and a life. Now they have little or none of the advantages that they had under Saddam, SOB that he was. So, what good have we brought them? all i can say is you are ate up with left wing propaganda. get real and either go there or read a little something other than michael moores endeavors. 180,000 kurds alone dying in iraq under sadam does not meet the requirements of peaceful. the others are right you are ignorant to the 3rd degree.", 
        "intTime": 20090406, 
        "postID": 9, 
        "quote": "Originally posted by fnewt: If you were able to ask the Iraqis, \"Are you better off now than you were under Saddam Hussein?\" They would answer: \"No!\" He may have been a vicious dictator and they may have despised him but Iraq was peaceful. The Iraqis had electricity and food and a life. Now they have little or none of the advantages that they had under Saddam, SOB that he was. So, what good have we brought them?", 
        "reply": " all i can say is you are ate up with left wing propaganda. get real and either go there or read a little something other than michael moores endeavors. 180,000 kurds alone dying in iraq under sadam does not meet the requirements of peaceful. the others are right you are ignorant to the 3rd degree.", 
        "threadID": "672198221_4690049912001", 
        "time": "2009-04-06 16:34:00", 
        "title": "not a global war on terrorism?", 
        "userID": "backtoiraq"
    }, 
    {
        "content": "quote: Originally posted by SSGDuke53: quote: Originally posted by fnewt: If you were able to ask the Iraqis, \"Are you better off now than you were under Saddam Hussein?\" They would answer: \"No!\" He may have been a vicious dictator and they may have despised him but Iraq was peaceful. The Iraqis had electricity and food and a life. Now they have little or none of the advantages that they had under Saddam, SOB that he was. So, what good have we brought them? A lot more then you think of FOOL! I bet if you ask the Germans (especially the East Germans) the same question five years after WWII ended that were they better off when corrupt, soulless Hitler was in charge they might of said the same thing. But after twenty years went by and now the Germans are FAR BETTER OFF NOW then when they were with the Godless Soul Hitler they will say Now they are better off from Hitler. Given time when many years pass and they keep track to their version of democracy they too will say they are better off from the demonic Saddam. So? Are you putting your predictive ability on the line here and saying, \"In twenty years, Iraq will be a peaceful Democratic Society just like Germany is today?\" Ok, I'll take you up on that - But I hedge a bit. I'll make two predictions for twenty years from now. 1. In Twenty years Iraq will be rulled by a dictator more or less of the same stripe as Sadaam OR 2. There will be three seperate countries, one for the Shia, one for the Sunni, and one for the Kurds, all of them rulled by dictators of the same stripe as Sadaam. Dave", 
        "intTime": 20090406, 
        "postID": 10, 
        "quote": "Originally posted by SSGDuke53: quote: Originally posted by fnewt: If you were able to ask the Iraqis, \"Are you better off now than you were under Saddam Hussein?\" They would answer: \"No!\" He may have been a vicious dictator and they may have despised him but Iraq was peaceful. The Iraqis had electricity and food and a life. Now they have little or none of the advantages that they had under Saddam, SOB that he was. So, what good have we brought them? A lot more then you think of FOOL! I bet if you ask the Germans (especially the East Germans) the same question five years after WWII ended that were they better off when corrupt, soulless Hitler was in charge they might of said the same thing. But after twenty years went by and now the Germans are FAR BETTER OFF NOW then when they were with the Godless Soul Hitler they will say Now they are better off from Hitler. Given time when many years pass and they keep track to their version of democracy they too will say they are better off from the demonic Saddam.", 
        "reply": " So? Are you putting your predictive ability on the line here and saying, \"In twenty years, Iraq will be a peaceful Democratic Society just like Germany is today?\" Ok, I'll take you up on that - But I hedge a bit. I'll make two predictions for twenty years from now. 1. In Twenty years Iraq will be rulled by a dictator more or less of the same stripe as Sadaam OR 2. There will be three seperate countries, one for the Shia, one for the Sunni, and one for the Kurds, all of them rulled by dictators of the same stripe as Sadaam. Dave", 
        "threadID": "672198221_4690049912001", 
        "time": "2009-04-06 17:00:00", 
        "title": "not a global war on terrorism?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: We're not going to win a war on an ideal, just like we didn't/won't win the wars on: Drugs [Yet a bunch of fools want to leaglize and thereby further encourage the soul-killing addictions. We should apply Singapore's policies for drugs.] Poverty [Yup. Been pi**ing away tens of trillions on that one for 44 years; unwinnable, sicne the more people get handouts, the lower their motivation to improve; three generations of welfare suckers in some areas.] Homelessness [Increases drastically when a pachyderm takes the Presidency; decreases drastically when a jacakss is in office.] AIDS [Moral sexual behavior goes a long, long way to keeping this in line.] Oh, and as far as us winning the war on communism, we haven't completely won that one, either as communism is still alive and well all over the world.......over 50 years later. We won the Cold War. That was what was required, and we did it; thanks especially to Ronald Reagan, Margaret Thatcher, and the Pope. (Yeah, I know that idiots tell us it was Uncle Gorby who \"led the way.\" His butt was in a severe crack, thanks to US strategy and the systemic evils of an enforced collective economy. He did what he had to, to keep his empire from falling apart sooner.) As far as the evil of enforced collectivism is concerned (commies, nazis), they will be with us until the End of Days. So recognizing them and the paths to their evils and engaging and destroying such evils shall remain our duty, if we merit freedom. Noting when we are heading down the path to socialism is a prime means to be aware of when the evils of such collectivism are upon us.", 
        "intTime": 20090406, 
        "postID": 11, 
        "quote": "Originally posted by mrmixitup: We're not going to win a war on an ideal, just like we didn't/won't win the wars on: Drugs [Yet a bunch of fools want to leaglize and thereby further encourage the soul-killing addictions. We should apply Singapore's policies for drugs.] Poverty [Yup. Been pi**ing away tens of trillions on that one for 44 years; unwinnable, sicne the more people get handouts, the lower their motivation to improve; three generations of welfare suckers in some areas.] Homelessness [Increases drastically when a pachyderm takes the Presidency; decreases drastically when a jacakss is in office.] AIDS [Moral sexual behavior goes a long, long way to keeping this in line.] Oh, and as far as us winning the war on communism, we haven't completely won that one, either as communism is still alive and well all over the world.......over 50 years later.", 
        "reply": " We won the Cold War. That was what was required, and we did it; thanks especially to Ronald Reagan, Margaret Thatcher, and the Pope. (Yeah, I know that idiots tell us it was Uncle Gorby who \"led the way.\" His butt was in a severe crack, thanks to US strategy and the systemic evils of an enforced collective economy. He did what he had to, to keep his empire from falling apart sooner.) As far as the evil of enforced collectivism is concerned (commies, nazis), they will be with us until the End of Days. So recognizing them and the paths to their evils and engaging and destroying such evils shall remain our duty, if we merit freedom. Noting when we are heading down the path to socialism is a prime means to be aware of when the evils of such collectivism are upon us.", 
        "threadID": "672198221_4690049912001", 
        "time": "2009-04-06 17:49:00", 
        "title": "not a global war on terrorism?", 
        "userID": "RRR52"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by SSGDuke53: quote: Originally posted by fnewt: If you were able to ask the Iraqis, \"Are you better off now than you were under Saddam Hussein?\" They would answer: \"No!\" He may have been a vicious dictator and they may have despised him but Iraq was peaceful. The Iraqis had electricity and food and a life. Now they have little or none of the advantages that they had under Saddam, SOB that he was. So, what good have we brought them? A lot more then you think of FOOL! I bet if you ask the Germans (especially the East Germans) the same question five years after WWII ended that were they better off when corrupt, soulless Hitler was in charge they might of said the same thing. But after twenty years went by and now the Germans are FAR BETTER OFF NOW then when they were with the Godless Soul Hitler they will say Now they are better off from Hitler. Given time when many years pass and they keep track to their version of democracy they too will say they are better off from the demonic Saddam. So? Are you putting your predictive ability on the line here and saying, \"In twenty years, Iraq will be a peaceful Democratic Society just like Germany is today?\" Ok, I'll take you up on that - But I hedge a bit. I'll make two predictions for twenty years from now. 1. In Twenty years Iraq will be rulled by a dictator more or less of the same stripe as Sadaam OR 2. There will be three seperate countries, one for the Shia, one for the Sunni, and one for the Kurds, all of them rulled by dictators of the same stripe as Sadaam. Dave ill take that absurd bet....", 
        "intTime": 20090407, 
        "postID": 12, 
        "quote": "Originally posted by Grachus: quote: Originally posted by SSGDuke53: quote: Originally posted by fnewt: If you were able to ask the Iraqis, \"Are you better off now than you were under Saddam Hussein?\" They would answer: \"No!\" He may have been a vicious dictator and they may have despised him but Iraq was peaceful. The Iraqis had electricity and food and a life. Now they have little or none of the advantages that they had under Saddam, SOB that he was. So, what good have we brought them? A lot more then you think of FOOL! I bet if you ask the Germans (especially the East Germans) the same question five years after WWII ended that were they better off when corrupt, soulless Hitler was in charge they might of said the same thing. But after twenty years went by and now the Germans are FAR BETTER OFF NOW then when they were with the Godless Soul Hitler they will say Now they are better off from Hitler. Given time when many years pass and they keep track to their version of democracy they too will say they are better off from the demonic Saddam. So? Are you putting your predictive ability on the line here and saying, \"In twenty years, Iraq will be a peaceful Democratic Society just like Germany is today?\" Ok, I'll take you up on that - But I hedge a bit. I'll make two predictions for twenty years from now. 1. In Twenty years Iraq will be rulled by a dictator more or less of the same stripe as Sadaam OR 2. There will be three seperate countries, one for the Shia, one for the Sunni, and one for the Kurds, all of them rulled by dictators of the same stripe as Sadaam. Dave", 
        "reply": " ill take that absurd bet....", 
        "threadID": "672198221_4690049912001", 
        "time": "2009-04-07 23:46:00", 
        "title": "not a global war on terrorism?", 
        "userID": "backtoiraq"
    }
]