[
    {
        "content": "\"http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks\" Another Barack Obama myth debunked. What will be the NRA's response to this? How will they demonize him over his support of allowing citizens to carry loaded concealed weapons in National Parks? This wasn't even allowed under George W. Bush and Dick Cheney, both NRA darlings. lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090521,
        "postID": 1,
        "quote": "",
        "reply": "\"http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks\" Another Barack Obama myth debunked. What will be the NRA's response to this? How will they demonize him over his support of allowing citizens to carry loaded concealed weapons in National Parks? This wasn't even allowed under George W. Bush and Dick Cheney, both NRA darlings. lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:11:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks\" Another Barack Obama myth debunked. What will be the NRA's response to this? How will they demonize him over his support of allowing citizens to carry loaded concealed weapons in National Parks? This wasn't even allowed under George W. Bush and Dick Cheney, both NRA darlings. lol Just goes to show you that if you can stick legislation in a bill the President truly wants passed he will sign it regardless of how he thinks about the rest of it. Are you sure the President even read this bill? From the last bills he's signed one has to wonder.",
        "intTime": 20090521,
        "postID": 2,
        "quote": "Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks\" Another Barack Obama myth debunked. What will be the NRA's response to this? How will they demonize him over his support of allowing citizens to carry loaded concealed weapons in National Parks? This wasn't even allowed under George W. Bush and Dick Cheney, both NRA darlings. lol",
        "reply": " Just goes to show you that if you can stick legislation in a bill the President truly wants passed he will sign it regardless of how he thinks about the rest of it. Are you sure the President even read this bill? From the last bills he's signed one has to wonder.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:18:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "NickBrand"
    },
    {
        "content": "quote: Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks\" Another Barack Obama myth debunked. What will be the NRA's response to this? How will they demonize him over his support of allowing citizens to carry loaded concealed weapons in National Parks? This wasn't even allowed under George W. Bush and Dick Cheney, both NRA darlings. lol He didn't support nothing. It was tacked on by pro-2nd Ammendment congressional supportors. They gathered together enough support to legally tack the Bill onto what Barry wanted to sign, the Credit Card Bill.",
        "intTime": 20090521,
        "postID": 3,
        "quote": "Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks\" Another Barack Obama myth debunked. What will be the NRA's response to this? How will they demonize him over his support of allowing citizens to carry loaded concealed weapons in National Parks? This wasn't even allowed under George W. Bush and Dick Cheney, both NRA darlings. lol",
        "reply": " He didn't support nothing. It was tacked on by pro-2nd Ammendment congressional supportors. They gathered together enough support to legally tack the Bill onto what Barry wanted to sign, the Credit Card Bill.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:23:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "quote: http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks From your link: \"The Democratic-controlled Congress is moving to restore a Bush administration policy that allowed loaded guns in national parks.\" \"The Senate vote is a stark reversal from what many gun-control advocates expected when a federal judge blocked the Bush policy in March.\" Try reading your own link before you attack. Makes you look silly.",
        "intTime": 20090521,
        "postID": 4,
        "quote": "http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks",
        "reply": " From your link: \"The Democratic-controlled Congress is moving to restore a Bush administration policy that allowed loaded guns in national parks.\" \"The Senate vote is a stark reversal from what many gun-control advocates expected when a federal judge blocked the Bush policy in March.\" Try reading your own link before you attack. Makes you look silly.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:24:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "FIST101CAV"
    },
    {
        "content": "quote: Originally posted by FIST101CAV: quote: http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks From your link: \"The Democratic-controlled Congress is moving to restore a Bush administration policy that allowed loaded guns in national parks.\" \"The Senate vote is a stark reversal from what many gun-control advocates expected when a federal judge blocked the Bush policy in March.\" Try reading your own link before you attack. Makes you look silly.",
        "intTime": 20090521,
        "postID": 5,
        "quote": "Originally posted by FIST101CAV: quote: http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks From your link: \"The Democratic-controlled Congress is moving to restore a Bush administration policy that allowed loaded guns in national parks.\" \"The Senate vote is a stark reversal from what many gun-control advocates expected when a federal judge blocked the Bush policy in March.\" Try reading your own link before you attack. Makes you look silly.",
        "reply": "",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:26:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "NickBrand"
    },
    {
        "content": "so....A demcrat controlled congress allows a rider to go through even though they could easily have it removed due to their near fillibuster proof majority. Then Obama plans on signing it even though he could easily veto it and have it ran though again without the rider. ....well. that proves it. Obama is going to take my guns!",
        "intTime": 20090521,
        "postID": 6,
        "quote": "",
        "reply": "so....A demcrat controlled congress allows a rider to go through even though they could easily have it removed due to their near fillibuster proof majority. Then Obama plans on signing it even though he could easily veto it and have it ran though again without the rider. ....well. that proves it. Obama is going to take my guns!",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:47:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "karlhungusjr"
    },
    {
        "content": "quote: Originally posted by karlhungusjr: so....A demcrat controlled congress allows a rider to go through even though they could easily have it removed due to their near fillibuster proof majority. Then Obama plans on signing it even though he could easily veto it and have it ran though again without the rider. ....well. that proves it. Obama is going to take my guns! Read the article again. Congressional supportors of the 2nd ammendment tacked it on. They knew Barry wanted that CC Bill. He wants it, then he'll have to sign it. He has no choice and no possibility of controlling the 2nd Ammendment, not when there is congressional support for pro-gun rights, both Dem and Rep.",
        "intTime": 20090521,
        "postID": 7,
        "quote": "Originally posted by karlhungusjr: so....A demcrat controlled congress allows a rider to go through even though they could easily have it removed due to their near fillibuster proof majority. Then Obama plans on signing it even though he could easily veto it and have it ran though again without the rider. ....well. that proves it. Obama is going to take my guns!",
        "reply": " Read the article again. Congressional supportors of the 2nd ammendment tacked it on. They knew Barry wanted that CC Bill. He wants it, then he'll have to sign it. He has no choice and no possibility of controlling the 2nd Ammendment, not when there is congressional support for pro-gun rights, both Dem and Rep.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:52:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be.",
        "intTime": 20090521,
        "postID": 8,
        "quote": "Read the article again. Congressional supportors of the 2nd ammendment tacked it on.",
        "reply": " yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 07:17:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "karlhungusjr"
    },
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be. Not if they wanted Rep. suport for the bill.",
        "intTime": 20090521,
        "postID": 9,
        "quote": "Originally posted by karlhungusjr: quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be.",
        "reply": " Not if they wanted Rep. suport for the bill.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 07:45:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "FIST101CAV"
    },
    {
        "content": "quote: Not if they wanted Rep. suport for the bill. why would they? they passed the stimilus bill with only 3 republicans. why would this be so much more important that they need wide spread republican support?",
        "intTime": 20090521,
        "postID": 10,
        "quote": "Not if they wanted Rep. suport for the bill.",
        "reply": " why would they? they passed the stimilus bill with only 3 republicans. why would this be so much more important that they need wide spread republican support?",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 07:55:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "karlhungusjr"
    },
    {
        "content": "It's about time the Republicans learned how to play the new game in Congress. Add an unrelated amendment to a piece of legislation that the administration wants passed quickly. It forces the hand of the opposition to either keep their timeline with the amendment in place or take the time to rewrite or veto the bill. It is a tactic that the Dems have being using for years.",
        "intTime": 20090521,
        "postID": 11,
        "quote": "",
        "reply": "It's about time the Republicans learned how to play the new game in Congress. Add an unrelated amendment to a piece of legislation that the administration wants passed quickly. It forces the hand of the opposition to either keep their timeline with the amendment in place or take the time to rewrite or veto the bill. It is a tactic that the Dems have being using for years.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 08:16:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "stec74"
    },
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be. I EXPECTED this to be removed in conference (combin senate and house versions) since after conference only an up or down vote is taken requiring only a simple majority of votes to pass. The Demos could have easily removed the it and still passed the Credit card bill.",
        "intTime": 20090521,
        "postID": 12,
        "quote": "Originally posted by karlhungusjr: quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be.",
        "reply": " I EXPECTED this to be removed in conference (combin senate and house versions) since after conference only an up or down vote is taken requiring only a simple majority of votes to pass. The Demos could have easily removed the it and still passed the Credit card bill.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 08:18:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by stec74: It's about time the Republicans learned how to play the new game in Congress. Add an unrelated amendment to a piece of legislation that the administration wants passed quickly. It forces the hand of the opposition to either keep their timeline with the amendment in place or take the time to rewrite or veto the bill. It is a tactic that the Dems have being using for years. Actually there are to few Repubs in Congress for them to do this without significant Demo support since any such amendment can be removed in conference and the combined bill passed with a simple majority (ie no filibusters allowed at this point).",
        "intTime": 20090521,
        "postID": 13,
        "quote": "Originally posted by stec74: It's about time the Republicans learned how to play the new game in Congress. Add an unrelated amendment to a piece of legislation that the administration wants passed quickly. It forces the hand of the opposition to either keep their timeline with the amendment in place or take the time to rewrite or veto the bill. It is a tactic that the Dems have being using for years.",
        "reply": " Actually there are to few Repubs in Congress for them to do this without significant Demo support since any such amendment can be removed in conference and the combined bill passed with a simple majority (ie no filibusters allowed at this point).",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 08:20:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Not if they wanted Rep. suport for the bill. why would they? they passed the stimilus bill with only 3 republicans. why would this be so much more important that they need wide spread republican support? They may not have needed \"widespread\" republican support, but it's in there for a reason. Maybe to get it to pass sooner?",
        "intTime": 20090521,
        "postID": 14,
        "quote": "Originally posted by karlhungusjr: quote: Not if they wanted Rep. suport for the bill. why would they? they passed the stimilus bill with only 3 republicans. why would this be so much more important that they need wide spread republican support?",
        "reply": " They may not have needed \"widespread\" republican support, but it's in there for a reason. Maybe to get it to pass sooner?",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 08:20:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "FIST101CAV"
    },
    {
        "content": "quote: Originally posted by rayld2: The Demos could have easily removed the it and still passed the Credit card bill. No, because there was enough supporting signatures on the democratic side of the house to tack it on to the CC Bill and most all the democratic supportors were from southern states, where 2nd Ammendment gun rights has always been an issue. Now you takes the likes of democratic Chitown and their stance on the 2ns Ammendment, no one would have a firearm, only the criminals and homeies from Chitown would.",
        "intTime": 20090521,
        "postID": 15,
        "quote": "Originally posted by rayld2: The Demos could have easily removed the it and still passed the Credit card bill.",
        "reply": " No, because there was enough supporting signatures on the democratic side of the house to tack it on to the CC Bill and most all the democratic supportors were from southern states, where 2nd Ammendment gun rights has always been an issue. Now you takes the likes of democratic Chitown and their stance on the 2ns Ammendment, no one would have a firearm, only the criminals and homeies from Chitown would.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 08:27:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090521,
        "postID": 16,
        "quote": "",
        "reply": "Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 08:58:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by karlhungusjr: quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be. I EXPECTED this to be removed in conference (combin senate and house versions) since after conference only an up or down vote is taken requiring only a simple majority of votes to pass. The Demos could have easily removed the it and still passed the Credit card bill. quote: Democratic leaders decided not to remove the gun provision after Sen. Tom Coburn, R-Okla., was able to insert it into a popular bill imposing new restrictions on credit card companies. Lawmakers and aides said there was not enough time to send the bill to a House-Senate conference committee _ where it could be removed without a vote _ and still get it to President Barack Obama by Memorial Day as he has requested. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\"",
        "intTime": 20090521,
        "postID": 17,
        "quote": "Originally posted by rayld2: quote: Originally posted by karlhungusjr: quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be. I EXPECTED this to be removed in conference (combin senate and house versions) since after conference only an up or down vote is taken requiring only a simple majority of votes to pass. The Demos could have easily removed the it and still passed the Credit card bill.",
        "reply": " quote: Democratic leaders decided not to remove the gun provision after Sen. Tom Coburn, R-Okla., was able to insert it into a popular bill imposing new restrictions on credit card companies. Lawmakers and aides said there was not enough time to send the bill to a House-Senate conference committee _ where it could be removed without a vote _ and still get it to President Barack Obama by Memorial Day as he has requested. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\"",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 09:06:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "stec74"
    },
    {
        "content": "quote: Originally posted by jack_flats: Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol quote: In a stinging defeat for gun-control advocates, Congress has voted to allow people to carry loaded guns in national parks and wildlife refuges. The House approved the measure, 279-147, on Wednesday, one day after the Senate acted. A total of 105 Democrats in the House joined 174 Republicans in supporting the gun measure, which essentially restores a Bush administration policy that allowed loaded guns in national parks for two months earlier this year. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\"",
        "intTime": 20090521,
        "postID": 18,
        "quote": "Originally posted by jack_flats: Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol",
        "reply": " quote: In a stinging defeat for gun-control advocates, Congress has voted to allow people to carry loaded guns in national parks and wildlife refuges. The House approved the measure, 279-147, on Wednesday, one day after the Senate acted. A total of 105 Democrats in the House joined 174 Republicans in supporting the gun measure, which essentially restores a Bush administration policy that allowed loaded guns in national parks for two months earlier this year. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\"",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 09:09:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "stec74"
    },
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by jack_flats: Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol quote: In a stinging defeat for gun-control advocates, Congress has voted to allow people to carry loaded guns in national parks and wildlife refuges. The House approved the measure, 279-147, on Wednesday, one day after the Senate acted. A total of 105 Democrats in the House joined 174 Republicans in supporting the gun measure, which essentially restores a Bush administration policy that allowed loaded guns in national parks for two months earlier this year. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\" Why waste your time, Jack reads what he wants to read, whether in block print or bold letters.",
        "intTime": 20090521,
        "postID": 19,
        "quote": "Originally posted by stec74: quote: Originally posted by jack_flats: Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol quote: In a stinging defeat for gun-control advocates, Congress has voted to allow people to carry loaded guns in national parks and wildlife refuges. The House approved the measure, 279-147, on Wednesday, one day after the Senate acted. A total of 105 Democrats in the House joined 174 Republicans in supporting the gun measure, which essentially restores a Bush administration policy that allowed loaded guns in national parks for two months earlier this year. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\"",
        "reply": " Why waste your time, Jack reads what he wants to read, whether in block print or bold letters.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 09:12:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by stec74: quote: Originally posted by jack_flats: Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol quote: In a stinging defeat for gun-control advocates, Congress has voted to allow people to carry loaded guns in national parks and wildlife refuges. The House approved the measure, 279-147, on Wednesday, one day after the Senate acted. A total of 105 Democrats in the House joined 174 Republicans in supporting the gun measure, which essentially restores a Bush administration policy that allowed loaded guns in national parks for two months earlier this year. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\" Why waste your time, Jack reads what he wants to read, whether in block print or bold letters. “Truth is like the sun. You can shut it out for a time, but it ain't goin' away.” ~ Elvis Presley",
        "intTime": 20090521,
        "postID": 20,
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by stec74: quote: Originally posted by jack_flats: Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol quote: In a stinging defeat for gun-control advocates, Congress has voted to allow people to carry loaded guns in national parks and wildlife refuges. The House approved the measure, 279-147, on Wednesday, one day after the Senate acted. A total of 105 Democrats in the House joined 174 Republicans in supporting the gun measure, which essentially restores a Bush administration policy that allowed loaded guns in national parks for two months earlier this year. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\" Why waste your time, Jack reads what he wants to read, whether in block print or bold letters.",
        "reply": " “Truth is like the sun. You can shut it out for a time, but it ain't goin' away.” ~ Elvis Presley",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 09:18:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "stec74"
    },
    {
        "content": "\"http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks\" Another Barack Obama myth debunked. What will be the NRA's response to this? How will they demonize him over his support of allowing citizens to carry loaded concealed weapons in National Parks? This wasn't even allowed under George W. Bush and Dick Cheney, both NRA darlings. lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090521,
        "postID": 21,
        "quote": "",
        "reply": "\"http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks\" Another Barack Obama myth debunked. What will be the NRA's response to this? How will they demonize him over his support of allowing citizens to carry loaded concealed weapons in National Parks? This wasn't even allowed under George W. Bush and Dick Cheney, both NRA darlings. lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:11:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks\" Another Barack Obama myth debunked. What will be the NRA's response to this? How will they demonize him over his support of allowing citizens to carry loaded concealed weapons in National Parks? This wasn't even allowed under George W. Bush and Dick Cheney, both NRA darlings. lol Just goes to show you that if you can stick legislation in a bill the President truly wants passed he will sign it regardless of how he thinks about the rest of it. Are you sure the President even read this bill? From the last bills he's signed one has to wonder.",
        "intTime": 20090521,
        "postID": 22,
        "quote": "Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks\" Another Barack Obama myth debunked. What will be the NRA's response to this? How will they demonize him over his support of allowing citizens to carry loaded concealed weapons in National Parks? This wasn't even allowed under George W. Bush and Dick Cheney, both NRA darlings. lol",
        "reply": " Just goes to show you that if you can stick legislation in a bill the President truly wants passed he will sign it regardless of how he thinks about the rest of it. Are you sure the President even read this bill? From the last bills he's signed one has to wonder.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:18:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "NickBrand"
    },
    {
        "content": "quote: Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks\" Another Barack Obama myth debunked. What will be the NRA's response to this? How will they demonize him over his support of allowing citizens to carry loaded concealed weapons in National Parks? This wasn't even allowed under George W. Bush and Dick Cheney, both NRA darlings. lol He didn't support nothing. It was tacked on by pro-2nd Ammendment congressional supportors. They gathered together enough support to legally tack the Bill onto what Barry wanted to sign, the Credit Card Bill.",
        "intTime": 20090521,
        "postID": 23,
        "quote": "Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks\" Another Barack Obama myth debunked. What will be the NRA's response to this? How will they demonize him over his support of allowing citizens to carry loaded concealed weapons in National Parks? This wasn't even allowed under George W. Bush and Dick Cheney, both NRA darlings. lol",
        "reply": " He didn't support nothing. It was tacked on by pro-2nd Ammendment congressional supportors. They gathered together enough support to legally tack the Bill onto what Barry wanted to sign, the Credit Card Bill.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:23:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "quote: http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks From your link: \"The Democratic-controlled Congress is moving to restore a Bush administration policy that allowed loaded guns in national parks.\" \"The Senate vote is a stark reversal from what many gun-control advocates expected when a federal judge blocked the Bush policy in March.\" Try reading your own link before you attack. Makes you look silly.",
        "intTime": 20090521,
        "postID": 24,
        "quote": "http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks",
        "reply": " From your link: \"The Democratic-controlled Congress is moving to restore a Bush administration policy that allowed loaded guns in national parks.\" \"The Senate vote is a stark reversal from what many gun-control advocates expected when a federal judge blocked the Bush policy in March.\" Try reading your own link before you attack. Makes you look silly.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:24:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "FIST101CAV"
    },
    {
        "content": "quote: Originally posted by FIST101CAV: quote: http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks From your link: \"The Democratic-controlled Congress is moving to restore a Bush administration policy that allowed loaded guns in national parks.\" \"The Senate vote is a stark reversal from what many gun-control advocates expected when a federal judge blocked the Bush policy in March.\" Try reading your own link before you attack. Makes you look silly.",
        "intTime": 20090521,
        "postID": 25,
        "quote": "Originally posted by FIST101CAV: quote: http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks From your link: \"The Democratic-controlled Congress is moving to restore a Bush administration policy that allowed loaded guns in national parks.\" \"The Senate vote is a stark reversal from what many gun-control advocates expected when a federal judge blocked the Bush policy in March.\" Try reading your own link before you attack. Makes you look silly.",
        "reply": "",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:26:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "NickBrand"
    },
    {
        "content": "so....A demcrat controlled congress allows a rider to go through even though they could easily have it removed due to their near fillibuster proof majority. Then Obama plans on signing it even though he could easily veto it and have it ran though again without the rider. ....well. that proves it. Obama is going to take my guns!",
        "intTime": 20090521,
        "postID": 26,
        "quote": "",
        "reply": "so....A demcrat controlled congress allows a rider to go through even though they could easily have it removed due to their near fillibuster proof majority. Then Obama plans on signing it even though he could easily veto it and have it ran though again without the rider. ....well. that proves it. Obama is going to take my guns!",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:47:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "karlhungusjr"
    },
    {
        "content": "quote: Originally posted by karlhungusjr: so....A demcrat controlled congress allows a rider to go through even though they could easily have it removed due to their near fillibuster proof majority. Then Obama plans on signing it even though he could easily veto it and have it ran though again without the rider. ....well. that proves it. Obama is going to take my guns! Read the article again. Congressional supportors of the 2nd ammendment tacked it on. They knew Barry wanted that CC Bill. He wants it, then he'll have to sign it. He has no choice and no possibility of controlling the 2nd Ammendment, not when there is congressional support for pro-gun rights, both Dem and Rep.",
        "intTime": 20090521,
        "postID": 27,
        "quote": "Originally posted by karlhungusjr: so....A demcrat controlled congress allows a rider to go through even though they could easily have it removed due to their near fillibuster proof majority. Then Obama plans on signing it even though he could easily veto it and have it ran though again without the rider. ....well. that proves it. Obama is going to take my guns!",
        "reply": " Read the article again. Congressional supportors of the 2nd ammendment tacked it on. They knew Barry wanted that CC Bill. He wants it, then he'll have to sign it. He has no choice and no possibility of controlling the 2nd Ammendment, not when there is congressional support for pro-gun rights, both Dem and Rep.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:52:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be.",
        "intTime": 20090521,
        "postID": 28,
        "quote": "Read the article again. Congressional supportors of the 2nd ammendment tacked it on.",
        "reply": " yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 07:17:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "karlhungusjr"
    },
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be. Not if they wanted Rep. suport for the bill.",
        "intTime": 20090521,
        "postID": 29,
        "quote": "Originally posted by karlhungusjr: quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be.",
        "reply": " Not if they wanted Rep. suport for the bill.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 07:45:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "FIST101CAV"
    },
    {
        "content": "quote: Not if they wanted Rep. suport for the bill. why would they? they passed the stimilus bill with only 3 republicans. why would this be so much more important that they need wide spread republican support?",
        "intTime": 20090521,
        "postID": 30,
        "quote": "Not if they wanted Rep. suport for the bill.",
        "reply": " why would they? they passed the stimilus bill with only 3 republicans. why would this be so much more important that they need wide spread republican support?",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 07:55:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "karlhungusjr"
    },
    {
        "content": "It's about time the Republicans learned how to play the new game in Congress. Add an unrelated amendment to a piece of legislation that the administration wants passed quickly. It forces the hand of the opposition to either keep their timeline with the amendment in place or take the time to rewrite or veto the bill. It is a tactic that the Dems have being using for years.",
        "intTime": 20090521,
        "postID": 31,
        "quote": "",
        "reply": "It's about time the Republicans learned how to play the new game in Congress. Add an unrelated amendment to a piece of legislation that the administration wants passed quickly. It forces the hand of the opposition to either keep their timeline with the amendment in place or take the time to rewrite or veto the bill. It is a tactic that the Dems have being using for years.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 08:16:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "stec74"
    },
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be. I EXPECTED this to be removed in conference (combin senate and house versions) since after conference only an up or down vote is taken requiring only a simple majority of votes to pass. The Demos could have easily removed the it and still passed the Credit card bill.",
        "intTime": 20090521,
        "postID": 32,
        "quote": "Originally posted by karlhungusjr: quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be.",
        "reply": " I EXPECTED this to be removed in conference (combin senate and house versions) since after conference only an up or down vote is taken requiring only a simple majority of votes to pass. The Demos could have easily removed the it and still passed the Credit card bill.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 08:18:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by stec74: It's about time the Republicans learned how to play the new game in Congress. Add an unrelated amendment to a piece of legislation that the administration wants passed quickly. It forces the hand of the opposition to either keep their timeline with the amendment in place or take the time to rewrite or veto the bill. It is a tactic that the Dems have being using for years. Actually there are to few Repubs in Congress for them to do this without significant Demo support since any such amendment can be removed in conference and the combined bill passed with a simple majority (ie no filibusters allowed at this point).",
        "intTime": 20090521,
        "postID": 33,
        "quote": "Originally posted by stec74: It's about time the Republicans learned how to play the new game in Congress. Add an unrelated amendment to a piece of legislation that the administration wants passed quickly. It forces the hand of the opposition to either keep their timeline with the amendment in place or take the time to rewrite or veto the bill. It is a tactic that the Dems have being using for years.",
        "reply": " Actually there are to few Repubs in Congress for them to do this without significant Demo support since any such amendment can be removed in conference and the combined bill passed with a simple majority (ie no filibusters allowed at this point).",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 08:20:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Not if they wanted Rep. suport for the bill. why would they? they passed the stimilus bill with only 3 republicans. why would this be so much more important that they need wide spread republican support? They may not have needed \"widespread\" republican support, but it's in there for a reason. Maybe to get it to pass sooner?",
        "intTime": 20090521,
        "postID": 34,
        "quote": "Originally posted by karlhungusjr: quote: Not if they wanted Rep. suport for the bill. why would they? they passed the stimilus bill with only 3 republicans. why would this be so much more important that they need wide spread republican support?",
        "reply": " They may not have needed \"widespread\" republican support, but it's in there for a reason. Maybe to get it to pass sooner?",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 08:20:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "FIST101CAV"
    },
    {
        "content": "quote: Originally posted by rayld2: The Demos could have easily removed the it and still passed the Credit card bill. No, because there was enough supporting signatures on the democratic side of the house to tack it on to the CC Bill and most all the democratic supportors were from southern states, where 2nd Ammendment gun rights has always been an issue. Now you takes the likes of democratic Chitown and their stance on the 2ns Ammendment, no one would have a firearm, only the criminals and homeies from Chitown would.",
        "intTime": 20090521,
        "postID": 35,
        "quote": "Originally posted by rayld2: The Demos could have easily removed the it and still passed the Credit card bill.",
        "reply": " No, because there was enough supporting signatures on the democratic side of the house to tack it on to the CC Bill and most all the democratic supportors were from southern states, where 2nd Ammendment gun rights has always been an issue. Now you takes the likes of democratic Chitown and their stance on the 2ns Ammendment, no one would have a firearm, only the criminals and homeies from Chitown would.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 08:27:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090521,
        "postID": 36,
        "quote": "",
        "reply": "Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 08:58:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by karlhungusjr: quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be. I EXPECTED this to be removed in conference (combin senate and house versions) since after conference only an up or down vote is taken requiring only a simple majority of votes to pass. The Demos could have easily removed the it and still passed the Credit card bill. quote: Democratic leaders decided not to remove the gun provision after Sen. Tom Coburn, R-Okla., was able to insert it into a popular bill imposing new restrictions on credit card companies. Lawmakers and aides said there was not enough time to send the bill to a House-Senate conference committee _ where it could be removed without a vote _ and still get it to President Barack Obama by Memorial Day as he has requested. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\"",
        "intTime": 20090521,
        "postID": 37,
        "quote": "Originally posted by rayld2: quote: Originally posted by karlhungusjr: quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be. I EXPECTED this to be removed in conference (combin senate and house versions) since after conference only an up or down vote is taken requiring only a simple majority of votes to pass. The Demos could have easily removed the it and still passed the Credit card bill.",
        "reply": " quote: Democratic leaders decided not to remove the gun provision after Sen. Tom Coburn, R-Okla., was able to insert it into a popular bill imposing new restrictions on credit card companies. Lawmakers and aides said there was not enough time to send the bill to a House-Senate conference committee _ where it could be removed without a vote _ and still get it to President Barack Obama by Memorial Day as he has requested. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\"",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 09:06:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "stec74"
    },
    {
        "content": "quote: Originally posted by jack_flats: Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol quote: In a stinging defeat for gun-control advocates, Congress has voted to allow people to carry loaded guns in national parks and wildlife refuges. The House approved the measure, 279-147, on Wednesday, one day after the Senate acted. A total of 105 Democrats in the House joined 174 Republicans in supporting the gun measure, which essentially restores a Bush administration policy that allowed loaded guns in national parks for two months earlier this year. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\"",
        "intTime": 20090521,
        "postID": 38,
        "quote": "Originally posted by jack_flats: Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol",
        "reply": " quote: In a stinging defeat for gun-control advocates, Congress has voted to allow people to carry loaded guns in national parks and wildlife refuges. The House approved the measure, 279-147, on Wednesday, one day after the Senate acted. A total of 105 Democrats in the House joined 174 Republicans in supporting the gun measure, which essentially restores a Bush administration policy that allowed loaded guns in national parks for two months earlier this year. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\"",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 09:09:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "stec74"
    },
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by jack_flats: Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol quote: In a stinging defeat for gun-control advocates, Congress has voted to allow people to carry loaded guns in national parks and wildlife refuges. The House approved the measure, 279-147, on Wednesday, one day after the Senate acted. A total of 105 Democrats in the House joined 174 Republicans in supporting the gun measure, which essentially restores a Bush administration policy that allowed loaded guns in national parks for two months earlier this year. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\" Why waste your time, Jack reads what he wants to read, whether in block print or bold letters.",
        "intTime": 20090521,
        "postID": 39,
        "quote": "Originally posted by stec74: quote: Originally posted by jack_flats: Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol quote: In a stinging defeat for gun-control advocates, Congress has voted to allow people to carry loaded guns in national parks and wildlife refuges. The House approved the measure, 279-147, on Wednesday, one day after the Senate acted. A total of 105 Democrats in the House joined 174 Republicans in supporting the gun measure, which essentially restores a Bush administration policy that allowed loaded guns in national parks for two months earlier this year. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\"",
        "reply": " Why waste your time, Jack reads what he wants to read, whether in block print or bold letters.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 09:12:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by stec74: quote: Originally posted by jack_flats: Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol quote: In a stinging defeat for gun-control advocates, Congress has voted to allow people to carry loaded guns in national parks and wildlife refuges. The House approved the measure, 279-147, on Wednesday, one day after the Senate acted. A total of 105 Democrats in the House joined 174 Republicans in supporting the gun measure, which essentially restores a Bush administration policy that allowed loaded guns in national parks for two months earlier this year. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\" Why waste your time, Jack reads what he wants to read, whether in block print or bold letters. “Truth is like the sun. You can shut it out for a time, but it ain't goin' away.” ~ Elvis Presley",
        "intTime": 20090521,
        "postID": 40,
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by stec74: quote: Originally posted by jack_flats: Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol quote: In a stinging defeat for gun-control advocates, Congress has voted to allow people to carry loaded guns in national parks and wildlife refuges. The House approved the measure, 279-147, on Wednesday, one day after the Senate acted. A total of 105 Democrats in the House joined 174 Republicans in supporting the gun measure, which essentially restores a Bush administration policy that allowed loaded guns in national parks for two months earlier this year. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\" Why waste your time, Jack reads what he wants to read, whether in block print or bold letters.",
        "reply": " “Truth is like the sun. You can shut it out for a time, but it ain't goin' away.” ~ Elvis Presley",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 09:18:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "stec74"
    },
    {
        "content": "\"http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks\" Another Barack Obama myth debunked. What will be the NRA's response to this? How will they demonize him over his support of allowing citizens to carry loaded concealed weapons in National Parks? This wasn't even allowed under George W. Bush and Dick Cheney, both NRA darlings. lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090521,
        "postID": 41,
        "quote": "",
        "reply": "\"http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks\" Another Barack Obama myth debunked. What will be the NRA's response to this? How will they demonize him over his support of allowing citizens to carry loaded concealed weapons in National Parks? This wasn't even allowed under George W. Bush and Dick Cheney, both NRA darlings. lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:11:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks\" Another Barack Obama myth debunked. What will be the NRA's response to this? How will they demonize him over his support of allowing citizens to carry loaded concealed weapons in National Parks? This wasn't even allowed under George W. Bush and Dick Cheney, both NRA darlings. lol Just goes to show you that if you can stick legislation in a bill the President truly wants passed he will sign it regardless of how he thinks about the rest of it. Are you sure the President even read this bill? From the last bills he's signed one has to wonder.",
        "intTime": 20090521,
        "postID": 42,
        "quote": "Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks\" Another Barack Obama myth debunked. What will be the NRA's response to this? How will they demonize him over his support of allowing citizens to carry loaded concealed weapons in National Parks? This wasn't even allowed under George W. Bush and Dick Cheney, both NRA darlings. lol",
        "reply": " Just goes to show you that if you can stick legislation in a bill the President truly wants passed he will sign it regardless of how he thinks about the rest of it. Are you sure the President even read this bill? From the last bills he's signed one has to wonder.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:18:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "NickBrand"
    },
    {
        "content": "quote: Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks\" Another Barack Obama myth debunked. What will be the NRA's response to this? How will they demonize him over his support of allowing citizens to carry loaded concealed weapons in National Parks? This wasn't even allowed under George W. Bush and Dick Cheney, both NRA darlings. lol He didn't support nothing. It was tacked on by pro-2nd Ammendment congressional supportors. They gathered together enough support to legally tack the Bill onto what Barry wanted to sign, the Credit Card Bill.",
        "intTime": 20090521,
        "postID": 43,
        "quote": "Originally posted by jack_flats: \"http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks\" Another Barack Obama myth debunked. What will be the NRA's response to this? How will they demonize him over his support of allowing citizens to carry loaded concealed weapons in National Parks? This wasn't even allowed under George W. Bush and Dick Cheney, both NRA darlings. lol",
        "reply": " He didn't support nothing. It was tacked on by pro-2nd Ammendment congressional supportors. They gathered together enough support to legally tack the Bill onto what Barry wanted to sign, the Credit Card Bill.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:23:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "quote: http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks From your link: \"The Democratic-controlled Congress is moving to restore a Bush administration policy that allowed loaded guns in national parks.\" \"The Senate vote is a stark reversal from what many gun-control advocates expected when a federal judge blocked the Bush policy in March.\" Try reading your own link before you attack. Makes you look silly.",
        "intTime": 20090521,
        "postID": 44,
        "quote": "http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks",
        "reply": " From your link: \"The Democratic-controlled Congress is moving to restore a Bush administration policy that allowed loaded guns in national parks.\" \"The Senate vote is a stark reversal from what many gun-control advocates expected when a federal judge blocked the Bush policy in March.\" Try reading your own link before you attack. Makes you look silly.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:24:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "FIST101CAV"
    },
    {
        "content": "quote: Originally posted by FIST101CAV: quote: http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks From your link: \"The Democratic-controlled Congress is moving to restore a Bush administration policy that allowed loaded guns in national parks.\" \"The Senate vote is a stark reversal from what many gun-control advocates expected when a federal judge blocked the Bush policy in March.\" Try reading your own link before you attack. Makes you look silly.",
        "intTime": 20090521,
        "postID": 45,
        "quote": "Originally posted by FIST101CAV: quote: http://news.yahoo.com/s/ap/20090519/ap_on_go_co/us_guns_national_parks From your link: \"The Democratic-controlled Congress is moving to restore a Bush administration policy that allowed loaded guns in national parks.\" \"The Senate vote is a stark reversal from what many gun-control advocates expected when a federal judge blocked the Bush policy in March.\" Try reading your own link before you attack. Makes you look silly.",
        "reply": "",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:26:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "NickBrand"
    },
    {
        "content": "so....A demcrat controlled congress allows a rider to go through even though they could easily have it removed due to their near fillibuster proof majority. Then Obama plans on signing it even though he could easily veto it and have it ran though again without the rider. ....well. that proves it. Obama is going to take my guns!",
        "intTime": 20090521,
        "postID": 46,
        "quote": "",
        "reply": "so....A demcrat controlled congress allows a rider to go through even though they could easily have it removed due to their near fillibuster proof majority. Then Obama plans on signing it even though he could easily veto it and have it ran though again without the rider. ....well. that proves it. Obama is going to take my guns!",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:47:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "karlhungusjr"
    },
    {
        "content": "quote: Originally posted by karlhungusjr: so....A demcrat controlled congress allows a rider to go through even though they could easily have it removed due to their near fillibuster proof majority. Then Obama plans on signing it even though he could easily veto it and have it ran though again without the rider. ....well. that proves it. Obama is going to take my guns! Read the article again. Congressional supportors of the 2nd ammendment tacked it on. They knew Barry wanted that CC Bill. He wants it, then he'll have to sign it. He has no choice and no possibility of controlling the 2nd Ammendment, not when there is congressional support for pro-gun rights, both Dem and Rep.",
        "intTime": 20090521,
        "postID": 47,
        "quote": "Originally posted by karlhungusjr: so....A demcrat controlled congress allows a rider to go through even though they could easily have it removed due to their near fillibuster proof majority. Then Obama plans on signing it even though he could easily veto it and have it ran though again without the rider. ....well. that proves it. Obama is going to take my guns!",
        "reply": " Read the article again. Congressional supportors of the 2nd ammendment tacked it on. They knew Barry wanted that CC Bill. He wants it, then he'll have to sign it. He has no choice and no possibility of controlling the 2nd Ammendment, not when there is congressional support for pro-gun rights, both Dem and Rep.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 06:52:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be.",
        "intTime": 20090521,
        "postID": 48,
        "quote": "Read the article again. Congressional supportors of the 2nd ammendment tacked it on.",
        "reply": " yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 07:17:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "karlhungusjr"
    },
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be. Not if they wanted Rep. suport for the bill.",
        "intTime": 20090521,
        "postID": 49,
        "quote": "Originally posted by karlhungusjr: quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be.",
        "reply": " Not if they wanted Rep. suport for the bill.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 07:45:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "FIST101CAV"
    },
    {
        "content": "quote: Not if they wanted Rep. suport for the bill. why would they? they passed the stimilus bill with only 3 republicans. why would this be so much more important that they need wide spread republican support?",
        "intTime": 20090521,
        "postID": 50,
        "quote": "Not if they wanted Rep. suport for the bill.",
        "reply": " why would they? they passed the stimilus bill with only 3 republicans. why would this be so much more important that they need wide spread republican support?",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 07:55:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "karlhungusjr"
    },
    {
        "content": "It's about time the Republicans learned how to play the new game in Congress. Add an unrelated amendment to a piece of legislation that the administration wants passed quickly. It forces the hand of the opposition to either keep their timeline with the amendment in place or take the time to rewrite or veto the bill. It is a tactic that the Dems have being using for years.",
        "intTime": 20090521,
        "postID": 51,
        "quote": "",
        "reply": "It's about time the Republicans learned how to play the new game in Congress. Add an unrelated amendment to a piece of legislation that the administration wants passed quickly. It forces the hand of the opposition to either keep their timeline with the amendment in place or take the time to rewrite or veto the bill. It is a tactic that the Dems have being using for years.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 08:16:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "stec74"
    },
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be. I EXPECTED this to be removed in conference (combin senate and house versions) since after conference only an up or down vote is taken requiring only a simple majority of votes to pass. The Demos could have easily removed the it and still passed the Credit card bill.",
        "intTime": 20090521,
        "postID": 52,
        "quote": "Originally posted by karlhungusjr: quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be.",
        "reply": " I EXPECTED this to be removed in conference (combin senate and house versions) since after conference only an up or down vote is taken requiring only a simple majority of votes to pass. The Demos could have easily removed the it and still passed the Credit card bill.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 08:18:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by stec74: It's about time the Republicans learned how to play the new game in Congress. Add an unrelated amendment to a piece of legislation that the administration wants passed quickly. It forces the hand of the opposition to either keep their timeline with the amendment in place or take the time to rewrite or veto the bill. It is a tactic that the Dems have being using for years. Actually there are to few Repubs in Congress for them to do this without significant Demo support since any such amendment can be removed in conference and the combined bill passed with a simple majority (ie no filibusters allowed at this point).",
        "intTime": 20090521,
        "postID": 53,
        "quote": "Originally posted by stec74: It's about time the Republicans learned how to play the new game in Congress. Add an unrelated amendment to a piece of legislation that the administration wants passed quickly. It forces the hand of the opposition to either keep their timeline with the amendment in place or take the time to rewrite or veto the bill. It is a tactic that the Dems have being using for years.",
        "reply": " Actually there are to few Repubs in Congress for them to do this without significant Demo support since any such amendment can be removed in conference and the combined bill passed with a simple majority (ie no filibusters allowed at this point).",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 08:20:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "rayld2"
    },
    {
        "content": "quote: Originally posted by karlhungusjr: quote: Not if they wanted Rep. suport for the bill. why would they? they passed the stimilus bill with only 3 republicans. why would this be so much more important that they need wide spread republican support? They may not have needed \"widespread\" republican support, but it's in there for a reason. Maybe to get it to pass sooner?",
        "intTime": 20090521,
        "postID": 54,
        "quote": "Originally posted by karlhungusjr: quote: Not if they wanted Rep. suport for the bill. why would they? they passed the stimilus bill with only 3 republicans. why would this be so much more important that they need wide spread republican support?",
        "reply": " They may not have needed \"widespread\" republican support, but it's in there for a reason. Maybe to get it to pass sooner?",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 08:20:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "FIST101CAV"
    },
    {
        "content": "quote: Originally posted by rayld2: The Demos could have easily removed the it and still passed the Credit card bill. No, because there was enough supporting signatures on the democratic side of the house to tack it on to the CC Bill and most all the democratic supportors were from southern states, where 2nd Ammendment gun rights has always been an issue. Now you takes the likes of democratic Chitown and their stance on the 2ns Ammendment, no one would have a firearm, only the criminals and homeies from Chitown would.",
        "intTime": 20090521,
        "postID": 55,
        "quote": "Originally posted by rayld2: The Demos could have easily removed the it and still passed the Credit card bill.",
        "reply": " No, because there was enough supporting signatures on the democratic side of the house to tack it on to the CC Bill and most all the democratic supportors were from southern states, where 2nd Ammendment gun rights has always been an issue. Now you takes the likes of democratic Chitown and their stance on the 2ns Ammendment, no one would have a firearm, only the criminals and homeies from Chitown would.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 08:27:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "intTime": 20090521,
        "postID": 56,
        "quote": "",
        "reply": "Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol \"I believe that banking institutions are more dangerous to our liberties than standing armies.\" - T. Jefferson",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 08:58:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "jack_flats"
    },
    {
        "content": "quote: Originally posted by rayld2: quote: Originally posted by karlhungusjr: quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be. I EXPECTED this to be removed in conference (combin senate and house versions) since after conference only an up or down vote is taken requiring only a simple majority of votes to pass. The Demos could have easily removed the it and still passed the Credit card bill. quote: Democratic leaders decided not to remove the gun provision after Sen. Tom Coburn, R-Okla., was able to insert it into a popular bill imposing new restrictions on credit card companies. Lawmakers and aides said there was not enough time to send the bill to a House-Senate conference committee _ where it could be removed without a vote _ and still get it to President Barack Obama by Memorial Day as he has requested. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\"",
        "intTime": 20090521,
        "postID": 57,
        "quote": "Originally posted by rayld2: quote: Originally posted by karlhungusjr: quote: Read the article again. Congressional supportors of the 2nd ammendment tacked it on. yes. I understand that. I didn't think gun control advocates tacked it on. who put it in is unimportant. the fact is it easily could have been removed and it wasn't. It easily could have been vetoed and it won't. why? because the democrats aren't the evil gun grabbers the NRA makes them out to be. I EXPECTED this to be removed in conference (combin senate and house versions) since after conference only an up or down vote is taken requiring only a simple majority of votes to pass. The Demos could have easily removed the it and still passed the Credit card bill.",
        "reply": " quote: Democratic leaders decided not to remove the gun provision after Sen. Tom Coburn, R-Okla., was able to insert it into a popular bill imposing new restrictions on credit card companies. Lawmakers and aides said there was not enough time to send the bill to a House-Senate conference committee _ where it could be removed without a vote _ and still get it to President Barack Obama by Memorial Day as he has requested. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\"",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 09:06:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "stec74"
    },
    {
        "content": "quote: Originally posted by jack_flats: Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol quote: In a stinging defeat for gun-control advocates, Congress has voted to allow people to carry loaded guns in national parks and wildlife refuges. The House approved the measure, 279-147, on Wednesday, one day after the Senate acted. A total of 105 Democrats in the House joined 174 Republicans in supporting the gun measure, which essentially restores a Bush administration policy that allowed loaded guns in national parks for two months earlier this year. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\"",
        "intTime": 20090521,
        "postID": 58,
        "quote": "Originally posted by jack_flats: Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol",
        "reply": " quote: In a stinging defeat for gun-control advocates, Congress has voted to allow people to carry loaded guns in national parks and wildlife refuges. The House approved the measure, 279-147, on Wednesday, one day after the Senate acted. A total of 105 Democrats in the House joined 174 Republicans in supporting the gun measure, which essentially restores a Bush administration policy that allowed loaded guns in national parks for two months earlier this year. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\"",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 09:09:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "stec74"
    },
    {
        "content": "quote: Originally posted by stec74: quote: Originally posted by jack_flats: Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol quote: In a stinging defeat for gun-control advocates, Congress has voted to allow people to carry loaded guns in national parks and wildlife refuges. The House approved the measure, 279-147, on Wednesday, one day after the Senate acted. A total of 105 Democrats in the House joined 174 Republicans in supporting the gun measure, which essentially restores a Bush administration policy that allowed loaded guns in national parks for two months earlier this year. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\" Why waste your time, Jack reads what he wants to read, whether in block print or bold letters.",
        "intTime": 20090521,
        "postID": 59,
        "quote": "Originally posted by stec74: quote: Originally posted by jack_flats: Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol quote: In a stinging defeat for gun-control advocates, Congress has voted to allow people to carry loaded guns in national parks and wildlife refuges. The House approved the measure, 279-147, on Wednesday, one day after the Senate acted. A total of 105 Democrats in the House joined 174 Republicans in supporting the gun measure, which essentially restores a Bush administration policy that allowed loaded guns in national parks for two months earlier this year. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\"",
        "reply": " Why waste your time, Jack reads what he wants to read, whether in block print or bold letters.",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 09:12:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "SignalSgtWilliams"
    },
    {
        "content": "quote: Originally posted by SignalSgtWilliams: quote: Originally posted by stec74: quote: Originally posted by jack_flats: Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol quote: In a stinging defeat for gun-control advocates, Congress has voted to allow people to carry loaded guns in national parks and wildlife refuges. The House approved the measure, 279-147, on Wednesday, one day after the Senate acted. A total of 105 Democrats in the House joined 174 Republicans in supporting the gun measure, which essentially restores a Bush administration policy that allowed loaded guns in national parks for two months earlier this year. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\" Why waste your time, Jack reads what he wants to read, whether in block print or bold letters. “Truth is like the sun. You can shut it out for a time, but it ain't goin' away.” ~ Elvis Presley",
        "intTime": 20090521,
        "postID": 60,
        "quote": "Originally posted by SignalSgtWilliams: quote: Originally posted by stec74: quote: Originally posted by jack_flats: Again ... A law not even passed during a Republican Adminstration, you know, the NRA darlngs, Bush-Cheney???? Another radical right-wing myth debunked ... lol quote: In a stinging defeat for gun-control advocates, Congress has voted to allow people to carry loaded guns in national parks and wildlife refuges. The House approved the measure, 279-147, on Wednesday, one day after the Senate acted. A total of 105 Democrats in the House joined 174 Republicans in supporting the gun measure, which essentially restores a Bush administration policy that allowed loaded guns in national parks for two months earlier this year. \"http://www.newser.com/article/d98a78n00/congress-votes-to-restore-bush-policy-allowing-loaded-guns-in-national-parks-wildlife-refuges.html\" Why waste your time, Jack reads what he wants to read, whether in block print or bold letters.",
        "reply": " “Truth is like the sun. You can shut it out for a time, but it ain't goin' away.” ~ Elvis Presley",
        "threadID": "672198221_9860048322001",
        "time": "2009-05-21 09:18:00",
        "title": "Obama Signs Bill Allowing Loaded Concealed Guns in National Parks",
        "userID": "stec74"
    }
]