[
    {
        "content": "This is no April Fools. I hope us, japan or someone blast that thing to hells kitchen. \"http://www.cnn.com/2009/WORLD/asiapcf/04/01/north.korea.rocket/index.html\"", 
        "intTime": 20090401, 
        "postID": 1, 
        "quote": "", 
        "reply": "This is no April Fools. I hope us, japan or someone blast that thing to hells kitchen. \"http://www.cnn.com/2009/WORLD/asiapcf/04/01/north.korea.rocket/index.html\"", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-01 17:58:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Shooting it down is a really bad idea. we should let them launch it, odds are good it will do what the last one did. The last TD-2 blew up seconds after launch. The one launched July 4, 2006, I was on duty as an orbital analyst in Cheynenne Mountain. It made for an intersting day since the space shuttle went up right afterwards. It was the two big events we trained for and I got them both in the matter of an hour.", 
        "intTime": 20090401, 
        "postID": 2, 
        "quote": "", 
        "reply": "Shooting it down is a really bad idea. we should let them launch it, odds are good it will do what the last one did. The last TD-2 blew up seconds after launch. The one launched July 4, 2006, I was on duty as an orbital analyst in Cheynenne Mountain. It made for an intersting day since the space shuttle went up right afterwards. It was the two big events we trained for and I got them both in the matter of an hour.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-01 18:03:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "nspreitler"
    }, 
    {
        "content": "they will launch it Sunday if weather is good.", 
        "intTime": 20090401, 
        "postID": 3, 
        "quote": "", 
        "reply": "they will launch it Sunday if weather is good.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-01 21:39:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "it's never going to make it into space... something is going to happen to it... wonder if the lazer plane will be sniffing around. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090401, 
        "postID": 4, 
        "quote": "", 
        "reply": "it's never going to make it into space... something is going to happen to it... wonder if the lazer plane will be sniffing around. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-01 23:05:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: Shooting it down is a really bad idea. we should let them launch it, odds are good it will do what the last one did. The last TD-2 blew up seconds after launch. The one launched July 4, 2006, I was on duty as an orbital analyst in Cheynenne Mountain. It made for an intersting day since the space shuttle went up right afterwards. It was the two big events we trained for and I got them both in the matter of an hour. I agree, give it a chance to fail, if need be we can start shooting!", 
        "intTime": 20090402, 
        "postID": 5, 
        "quote": "Originally posted by nspreitler: Shooting it down is a really bad idea. we should let them launch it, odds are good it will do what the last one did. The last TD-2 blew up seconds after launch. The one launched July 4, 2006, I was on duty as an orbital analyst in Cheynenne Mountain. It made for an intersting day since the space shuttle went up right afterwards. It was the two big events we trained for and I got them both in the matter of an hour.", 
        "reply": " I agree, give it a chance to fail, if need be we can start shooting!", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 06:23:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "EAG154"
    }, 
    {
        "content": "That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing.", 
        "intTime": 20090402, 
        "postID": 6, 
        "quote": "", 
        "reply": "That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 09:57:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "alzuk"
    }, 
    {
        "content": "CNN is reporting that US military officials looking at satellite imagery believe that the rocket has a bulbous fairing on top. By our standards that would indicate a satellite for a payload, rather than a warhead.", 
        "intTime": 20090402, 
        "postID": 7, 
        "quote": "", 
        "reply": "CNN is reporting that US military officials looking at satellite imagery believe that the rocket has a bulbous fairing on top. By our standards that would indicate a satellite for a payload, rather than a warhead.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 12:00:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us.", 
        "intTime": 20090402, 
        "postID": 8, 
        "quote": "Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing.", 
        "reply": " That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 12:18:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. this instability is reason enough!", 
        "intTime": 20090402, 
        "postID": 9, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us.", 
        "reply": " this instability is reason enough!", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 13:26:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "EAG154"
    }, 
    {
        "content": "Is it? I don't agree. Let that region take care of the problem. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090402, 
        "postID": 10, 
        "quote": "", 
        "reply": "Is it? I don't agree. Let that region take care of the problem. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 13:28:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. I agree, it's about souvernty as well. Just as you stated, we would attack another country that shot down one of our rockets. We would be starting a new war if we did the same. N Korea knows that and is betting on our bluff to do nothing. They know we more then likely can not handle anothe big war with this economy the way it is. Especially after the major spending Bills congress passed recently. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090402, 
        "postID": 11, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us.", 
        "reply": " I agree, it's about souvernty as well. Just as you stated, we would attack another country that shot down one of our rockets. We would be starting a new war if we did the same. N Korea knows that and is betting on our bluff to do nothing. They know we more then likely can not handle anothe big war with this economy the way it is. Especially after the major spending Bills congress passed recently. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 13:30:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. I agree, it's about souvernty as well. Just as you stated, we would attack another country that shot down one of our rockets. We would be starting a new war if we did the same. N Korea knows that and is betting on our bluff to do nothing. They know we more then likely can not handle anothe big war with this economy the way it is. Especially after the major spending Bills congress passed recently. what big war would that be?", 
        "intTime": 20090402, 
        "postID": 12, 
        "quote": "Originally posted by L0A1: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. I agree, it's about souvernty as well. Just as you stated, we would attack another country that shot down one of our rockets. We would be starting a new war if we did the same. N Korea knows that and is betting on our bluff to do nothing. They know we more then likely can not handle anothe big war with this economy the way it is. Especially after the major spending Bills congress passed recently.", 
        "reply": " what big war would that be?", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 13:32:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. this instability is reason enough! So are you going to join back up to fight N Korea. Would you rather be in 2-9 Infantry or 4-7 Cav? They are going to be the speedbumps for a N Korean attack on the south.", 
        "intTime": 20090402, 
        "postID": 13, 
        "quote": "Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. this instability is reason enough!", 
        "reply": " So are you going to join back up to fight N Korea. Would you rather be in 2-9 Infantry or 4-7 Cav? They are going to be the speedbumps for a N Korean attack on the south.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 13:46:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. this instability is reason enough! So are you going to join back up to fight N Korea. Would you rather be in 2-9 Infantry or 4-7 Cav? They are going to be the speedbumps for a N Korean attack on the south. Fear is not generally a good plan!", 
        "intTime": 20090402, 
        "postID": 14, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. this instability is reason enough! So are you going to join back up to fight N Korea. Would you rather be in 2-9 Infantry or 4-7 Cav? They are going to be the speedbumps for a N Korean attack on the south.", 
        "reply": " Fear is not generally a good plan!", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 15:33:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. this instability is reason enough! So are you going to join back up to fight N Korea. Would you rather be in 2-9 Infantry or 4-7 Cav? They are going to be the speedbumps for a N Korean attack on the south. Fear is not generally a good plan! So how many lives is it worth to show N Korea we can shoot down their rockets.", 
        "intTime": 20090402, 
        "postID": 15, 
        "quote": "Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. this instability is reason enough! So are you going to join back up to fight N Korea. Would you rather be in 2-9 Infantry or 4-7 Cav? They are going to be the speedbumps for a N Korean attack on the south. Fear is not generally a good plan!", 
        "reply": " So how many lives is it worth to show N Korea we can shoot down their rockets.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 15:36:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. this instability is reason enough! So are you going to join back up to fight N Korea. Would you rather be in 2-9 Infantry or 4-7 Cav? They are going to be the speedbumps for a N Korean attack on the south. Fear is not generally a good plan! So how many lives is it worth to show N Korea we can shoot down their rockets. which lives are thoes?", 
        "intTime": 20090402, 
        "postID": 16, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. this instability is reason enough! So are you going to join back up to fight N Korea. Would you rather be in 2-9 Infantry or 4-7 Cav? They are going to be the speedbumps for a N Korean attack on the south. Fear is not generally a good plan! So how many lives is it worth to show N Korea we can shoot down their rockets.", 
        "reply": " which lives are thoes?", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 16:20:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "EAG154"
    }, 
    {
        "content": "Most of you are missing the point. This is a UN resolution, not just a US resolution. To allow it to fly, fail or no fail will allow the great leader to correct his mistakes and move foward. Shoot it down.", 
        "intTime": 20090402, 
        "postID": 17, 
        "quote": "", 
        "reply": "Most of you are missing the point. This is a UN resolution, not just a US resolution. To allow it to fly, fail or no fail will allow the great leader to correct his mistakes and move foward. Shoot it down.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 17:21:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Mr. Crackerjacks, I'm curious about what do you and the rest of the poster here think about the latest updates at the ff. thread? US and North Korea trade tough rhetoric before North Korean satellite launch\" thread of military.com Look up the articles there about Obama vowing a stern response to a North Korean launch as well as the North also vowing to strike Japan if they intercept the rocket.", 
        "intTime": 20090402, 
        "postID": 18, 
        "quote": "", 
        "reply": "Mr. Crackerjacks, I'm curious about what do you and the rest of the poster here think about the latest updates at the ff. thread? US and North Korea trade tough rhetoric before North Korean satellite launch\" thread of military.com Look up the articles there about Obama vowing a stern response to a North Korean launch as well as the North also vowing to strike Japan if they intercept the rocket.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 17:28:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "It will be interesting to see what happens. If it is shot down I expect North Korea will launch a barrage of No-Dong MRBMs at Japan and SCUDS at South Korea. Let's hope it doesn't happen because 2ID will be in a real mess if N Korea crosses that border.", 
        "intTime": 20090402, 
        "postID": 19, 
        "quote": "", 
        "reply": "It will be interesting to see what happens. If it is shot down I expect North Korea will launch a barrage of No-Dong MRBMs at Japan and SCUDS at South Korea. Let's hope it doesn't happen because 2ID will be in a real mess if N Korea crosses that border.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 17:49:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "nspreitler"
    }, 
    {
        "content": "N. Korea is playing with fire and will surely get burnt Been there, Done that and I have the shots to prove it.", 
        "intTime": 20090402, 
        "postID": 20, 
        "quote": "", 
        "reply": "N. Korea is playing with fire and will surely get burnt Been there, Done that and I have the shots to prove it.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 19:16:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "Tonio45"
    }, 
    {
        "content": "This is no April Fools. I hope us, japan or someone blast that thing to hells kitchen. \"http://www.cnn.com/2009/WORLD/asiapcf/04/01/north.korea.rocket/index.html\"", 
        "intTime": 20090401, 
        "postID": 21, 
        "quote": "", 
        "reply": "This is no April Fools. I hope us, japan or someone blast that thing to hells kitchen. \"http://www.cnn.com/2009/WORLD/asiapcf/04/01/north.korea.rocket/index.html\"", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-01 17:58:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Shooting it down is a really bad idea. we should let them launch it, odds are good it will do what the last one did. The last TD-2 blew up seconds after launch. The one launched July 4, 2006, I was on duty as an orbital analyst in Cheynenne Mountain. It made for an intersting day since the space shuttle went up right afterwards. It was the two big events we trained for and I got them both in the matter of an hour.", 
        "intTime": 20090401, 
        "postID": 22, 
        "quote": "", 
        "reply": "Shooting it down is a really bad idea. we should let them launch it, odds are good it will do what the last one did. The last TD-2 blew up seconds after launch. The one launched July 4, 2006, I was on duty as an orbital analyst in Cheynenne Mountain. It made for an intersting day since the space shuttle went up right afterwards. It was the two big events we trained for and I got them both in the matter of an hour.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-01 18:03:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "nspreitler"
    }, 
    {
        "content": "they will launch it Sunday if weather is good.", 
        "intTime": 20090401, 
        "postID": 23, 
        "quote": "", 
        "reply": "they will launch it Sunday if weather is good.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-01 21:39:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "it's never going to make it into space... something is going to happen to it... wonder if the lazer plane will be sniffing around. One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090401, 
        "postID": 24, 
        "quote": "", 
        "reply": "it's never going to make it into space... something is going to happen to it... wonder if the lazer plane will be sniffing around. One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-01 23:05:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: Shooting it down is a really bad idea. we should let them launch it, odds are good it will do what the last one did. The last TD-2 blew up seconds after launch. The one launched July 4, 2006, I was on duty as an orbital analyst in Cheynenne Mountain. It made for an intersting day since the space shuttle went up right afterwards. It was the two big events we trained for and I got them both in the matter of an hour. I agree, give it a chance to fail, if need be we can start shooting!", 
        "intTime": 20090402, 
        "postID": 25, 
        "quote": "Originally posted by nspreitler: Shooting it down is a really bad idea. we should let them launch it, odds are good it will do what the last one did. The last TD-2 blew up seconds after launch. The one launched July 4, 2006, I was on duty as an orbital analyst in Cheynenne Mountain. It made for an intersting day since the space shuttle went up right afterwards. It was the two big events we trained for and I got them both in the matter of an hour.", 
        "reply": " I agree, give it a chance to fail, if need be we can start shooting!", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 06:23:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "EAG154"
    }, 
    {
        "content": "That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing.", 
        "intTime": 20090402, 
        "postID": 26, 
        "quote": "", 
        "reply": "That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 09:57:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "alzuk"
    }, 
    {
        "content": "CNN is reporting that US military officials looking at satellite imagery believe that the rocket has a bulbous fairing on top. By our standards that would indicate a satellite for a payload, rather than a warhead.", 
        "intTime": 20090402, 
        "postID": 27, 
        "quote": "", 
        "reply": "CNN is reporting that US military officials looking at satellite imagery believe that the rocket has a bulbous fairing on top. By our standards that would indicate a satellite for a payload, rather than a warhead.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 12:00:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us.", 
        "intTime": 20090402, 
        "postID": 28, 
        "quote": "Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing.", 
        "reply": " That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 12:18:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. this instability is reason enough!", 
        "intTime": 20090402, 
        "postID": 29, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us.", 
        "reply": " this instability is reason enough!", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 13:26:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "EAG154"
    }, 
    {
        "content": "Is it? I don't agree. Let that region take care of the problem. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090402, 
        "postID": 30, 
        "quote": "", 
        "reply": "Is it? I don't agree. Let that region take care of the problem. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 13:28:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. I agree, it's about souvernty as well. Just as you stated, we would attack another country that shot down one of our rockets. We would be starting a new war if we did the same. N Korea knows that and is betting on our bluff to do nothing. They know we more then likely can not handle anothe big war with this economy the way it is. Especially after the major spending Bills congress passed recently. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090402, 
        "postID": 31, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us.", 
        "reply": " I agree, it's about souvernty as well. Just as you stated, we would attack another country that shot down one of our rockets. We would be starting a new war if we did the same. N Korea knows that and is betting on our bluff to do nothing. They know we more then likely can not handle anothe big war with this economy the way it is. Especially after the major spending Bills congress passed recently. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 13:30:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. I agree, it's about souvernty as well. Just as you stated, we would attack another country that shot down one of our rockets. We would be starting a new war if we did the same. N Korea knows that and is betting on our bluff to do nothing. They know we more then likely can not handle anothe big war with this economy the way it is. Especially after the major spending Bills congress passed recently. what big war would that be?", 
        "intTime": 20090402, 
        "postID": 32, 
        "quote": "Originally posted by L0A1: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. I agree, it's about souvernty as well. Just as you stated, we would attack another country that shot down one of our rockets. We would be starting a new war if we did the same. N Korea knows that and is betting on our bluff to do nothing. They know we more then likely can not handle anothe big war with this economy the way it is. Especially after the major spending Bills congress passed recently.", 
        "reply": " what big war would that be?", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 13:32:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. this instability is reason enough! So are you going to join back up to fight N Korea. Would you rather be in 2-9 Infantry or 4-7 Cav? They are going to be the speedbumps for a N Korean attack on the south.", 
        "intTime": 20090402, 
        "postID": 33, 
        "quote": "Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. this instability is reason enough!", 
        "reply": " So are you going to join back up to fight N Korea. Would you rather be in 2-9 Infantry or 4-7 Cav? They are going to be the speedbumps for a N Korean attack on the south.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 13:46:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. this instability is reason enough! So are you going to join back up to fight N Korea. Would you rather be in 2-9 Infantry or 4-7 Cav? They are going to be the speedbumps for a N Korean attack on the south. Fear is not generally a good plan!", 
        "intTime": 20090402, 
        "postID": 34, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. this instability is reason enough! So are you going to join back up to fight N Korea. Would you rather be in 2-9 Infantry or 4-7 Cav? They are going to be the speedbumps for a N Korean attack on the south.", 
        "reply": " Fear is not generally a good plan!", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 15:33:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. this instability is reason enough! So are you going to join back up to fight N Korea. Would you rather be in 2-9 Infantry or 4-7 Cav? They are going to be the speedbumps for a N Korean attack on the south. Fear is not generally a good plan! So how many lives is it worth to show N Korea we can shoot down their rockets.", 
        "intTime": 20090402, 
        "postID": 35, 
        "quote": "Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. this instability is reason enough! So are you going to join back up to fight N Korea. Would you rather be in 2-9 Infantry or 4-7 Cav? They are going to be the speedbumps for a N Korean attack on the south. Fear is not generally a good plan!", 
        "reply": " So how many lives is it worth to show N Korea we can shoot down their rockets.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 15:36:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "nspreitler"
    }, 
    {
        "content": "quote: Originally posted by nspreitler: quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. this instability is reason enough! So are you going to join back up to fight N Korea. Would you rather be in 2-9 Infantry or 4-7 Cav? They are going to be the speedbumps for a N Korean attack on the south. Fear is not generally a good plan! So how many lives is it worth to show N Korea we can shoot down their rockets. which lives are thoes?", 
        "intTime": 20090402, 
        "postID": 36, 
        "quote": "Originally posted by nspreitler: quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by EAG154: quote: Originally posted by nspreitler: quote: Originally posted by alzuk: That thing needs to be shot down. If it makes a sucessful launch then we will be seeing them in Iran and any other country with some cash. I think that this is a sales pitch for the North Koreans. If they launch it they can say see we have a long range missle who wants one? But if someone shoots it down and shows how easy it is to do so then there may not be a line of buyers....just my thought on the whole thing. That is easy for you to say, you wouldn't be thrown into an all out war with N Korea. Shooting down a rocket launch is an act of war. What response would you think would be warranted if one of our satellite launches was shot down? N Korea is unstable, but we have no justification to shoot down their rockets unless they are targeted at us. this instability is reason enough! So are you going to join back up to fight N Korea. Would you rather be in 2-9 Infantry or 4-7 Cav? They are going to be the speedbumps for a N Korean attack on the south. Fear is not generally a good plan! So how many lives is it worth to show N Korea we can shoot down their rockets.", 
        "reply": " which lives are thoes?", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 16:20:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "EAG154"
    }, 
    {
        "content": "Most of you are missing the point. This is a UN resolution, not just a US resolution. To allow it to fly, fail or no fail will allow the great leader to correct his mistakes and move foward. Shoot it down.", 
        "intTime": 20090402, 
        "postID": 37, 
        "quote": "", 
        "reply": "Most of you are missing the point. This is a UN resolution, not just a US resolution. To allow it to fly, fail or no fail will allow the great leader to correct his mistakes and move foward. Shoot it down.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 17:21:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "Mr. Crackerjacks, I'm curious about what do you and the rest of the poster here think about the latest updates at the ff. thread? US and North Korea trade tough rhetoric before North Korean satellite launch\" thread of military.com Look up the articles there about Obama vowing a stern response to a North Korean launch as well as the North also vowing to strike Japan if they intercept the rocket.", 
        "intTime": 20090402, 
        "postID": 38, 
        "quote": "", 
        "reply": "Mr. Crackerjacks, I'm curious about what do you and the rest of the poster here think about the latest updates at the ff. thread? US and North Korea trade tough rhetoric before North Korean satellite launch\" thread of military.com Look up the articles there about Obama vowing a stern response to a North Korean launch as well as the North also vowing to strike Japan if they intercept the rocket.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 17:28:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "It will be interesting to see what happens. If it is shot down I expect North Korea will launch a barrage of No-Dong MRBMs at Japan and SCUDS at South Korea. Let's hope it doesn't happen because 2ID will be in a real mess if N Korea crosses that border.", 
        "intTime": 20090402, 
        "postID": 39, 
        "quote": "", 
        "reply": "It will be interesting to see what happens. If it is shot down I expect North Korea will launch a barrage of No-Dong MRBMs at Japan and SCUDS at South Korea. Let's hope it doesn't happen because 2ID will be in a real mess if N Korea crosses that border.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 17:49:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "nspreitler"
    }, 
    {
        "content": "N. Korea is playing with fire and will surely get burnt Been there, Done that and I have the shots to prove it.", 
        "intTime": 20090402, 
        "postID": 40, 
        "quote": "", 
        "reply": "N. Korea is playing with fire and will surely get burnt Been there, Done that and I have the shots to prove it.", 
        "threadID": "672198221_3530085912001", 
        "time": "2009-04-02 19:16:00", 
        "title": "North Korea is fueling rocket, U.S. military says", 
        "userID": "Tonio45"
    }
]