[
    {
        "content": "This doesnt surprise me. I just wish those sanctomonious people would chill with their holier then thou attitudes. ABC News Porn in the USA: Conservatives Are Biggest Consumers 8 of Top 10 Porn-Consuming States Voted Republican in 2008 Presidential Election By EWEN CALLAWAY Feb. 28, 2009— Americans may paint themselves in increasingly bright shades of red and blue, but new research finds one thing that varies little across the nation: the liking for online pornography. A new nationwide study (pdf) of anonymised credit-card receipts from a major online adult entertainment provider finds little variation in consumption between states. \"When it comes to adult entertainment, it seems people are more the same than different,\" says Benjamin Edelman at Harvard Business School. However, there are some trends to be seen in the data. Those states that do consume the most porn tend to be more conservative and religious than states with lower levels of consumption, the study finds. \"Some of the people who are most outraged turn out to be consumers of the very things they claimed to be outraged by,\" Edelman says. Political Divide Edelman spends part of his time helping companies such as Microsoft and AOL detect advertising fraud. Another consulting client runs dozens of adult websites, though he says he is not at liberty to identify the firm. That company did, however, provide Edelman with roughly two years of credit card data from 2006 to 2008 that included a purchase date and each customer's postal code. After controlling for differences in broadband internet access between states online porn tends to be a bandwidth hog and adjusting for population, he found a relatively small difference between states with the most adult purchases and those with the fewest. The biggest consumer, Utah, averaged 5.47 adult content subscriptions per 1000 home broadband users; Montana bought the least with 1.92 per 1000. \"The differences here are not so stark,\" Edelman says. Number 10 on the list was West Virginia at 2.94 subscriptions per 1000, while number 41, Michigan, averaged 2.32. Eight of the top 10 pornography consuming states gave their electoral votes to John McCain in last year's presidential election Florida and Hawaii were the exceptions. While six out of the lowest 10 favoured Barack Obama. Old-Fashioned Values Church-goers bought less online porn on Sundays a 1% increase in a postal code's religious attendance was associated with a 0.1% drop in subscriptions that day. However, expenditures on other days of the week brought them in line with the rest of the country, Edelman finds. Residents of 27 states that passed laws banning gay marriages boasted 11% more porn subscribers than states that don't explicitly restrict gay marriage. To get a better handle on other associations between social attitudes and pornography consumption, Edelman melded his data with a previous study on public attitudes toward religion. States where a majority of residents agreed with the statement \"I have old-fashioned values about family and marriage,\" bought 3.6 more subscriptions per thousand people than states where a majority disagreed. A similar difference emerged for the statement \"AIDS might be God's punishment for immoral sexual behaviour.\" \"One natural hypothesis is something like repression: if you're told you can't have this, then you want it more,\" Edelman says. Copyright © 2009 ABC News Internet Ventures", 
        "intTime": 20090302, 
        "postID": 1, 
        "quote": "", 
        "reply": "This doesnt surprise me. I just wish those sanctomonious people would chill with their holier then thou attitudes. ABC News Porn in the USA: Conservatives Are Biggest Consumers 8 of Top 10 Porn-Consuming States Voted Republican in 2008 Presidential Election By EWEN CALLAWAY Feb. 28, 2009— Americans may paint themselves in increasingly bright shades of red and blue, but new research finds one thing that varies little across the nation: the liking for online pornography. A new nationwide study (pdf) of anonymised credit-card receipts from a major online adult entertainment provider finds little variation in consumption between states. \"When it comes to adult entertainment, it seems people are more the same than different,\" says Benjamin Edelman at Harvard Business School. However, there are some trends to be seen in the data. Those states that do consume the most porn tend to be more conservative and religious than states with lower levels of consumption, the study finds. \"Some of the people who are most outraged turn out to be consumers of the very things they claimed to be outraged by,\" Edelman says. Political Divide Edelman spends part of his time helping companies such as Microsoft and AOL detect advertising fraud. Another consulting client runs dozens of adult websites, though he says he is not at liberty to identify the firm. That company did, however, provide Edelman with roughly two years of credit card data from 2006 to 2008 that included a purchase date and each customer's postal code. After controlling for differences in broadband internet access between states online porn tends to be a bandwidth hog and adjusting for population, he found a relatively small difference between states with the most adult purchases and those with the fewest. The biggest consumer, Utah, averaged 5.47 adult content subscriptions per 1000 home broadband users; Montana bought the least with 1.92 per 1000. \"The differences here are not so stark,\" Edelman says. Number 10 on the list was West Virginia at 2.94 subscriptions per 1000, while number 41, Michigan, averaged 2.32. Eight of the top 10 pornography consuming states gave their electoral votes to John McCain in last year's presidential election Florida and Hawaii were the exceptions. While six out of the lowest 10 favoured Barack Obama. Old-Fashioned Values Church-goers bought less online porn on Sundays a 1% increase in a postal code's religious attendance was associated with a 0.1% drop in subscriptions that day. However, expenditures on other days of the week brought them in line with the rest of the country, Edelman finds. Residents of 27 states that passed laws banning gay marriages boasted 11% more porn subscribers than states that don't explicitly restrict gay marriage. To get a better handle on other associations between social attitudes and pornography consumption, Edelman melded his data with a previous study on public attitudes toward religion. States where a majority of residents agreed with the statement \"I have old-fashioned values about family and marriage,\" bought 3.6 more subscriptions per thousand people than states where a majority disagreed. A similar difference emerged for the statement \"AIDS might be God's punishment for immoral sexual behaviour.\" \"One natural hypothesis is something like repression: if you're told you can't have this, then you want it more,\" Edelman says. Copyright © 2009 ABC News Internet Ventures", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 10:36:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "spanner69"
    }, 
    {
        "content": "In a related topic, Ted Haggard continues to have lots of gay sex while claiming he is not gay and that being gay is wrong.", 
        "intTime": 20090302, 
        "postID": 2, 
        "quote": "", 
        "reply": "In a related topic, Ted Haggard continues to have lots of gay sex while claiming he is not gay and that being gay is wrong.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 10:45:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: In a related topic, Ted Haggard continues to have lots of gay sex while claiming he is not gay and that being gay is wrong. Hey its Ted Haggard a conservative so its ok for him to have gay sex while preaching against homosexuality. His actions were taken out of context.", 
        "intTime": 20090302, 
        "postID": 3, 
        "quote": "Originally posted by mrmixitup: In a related topic, Ted Haggard continues to have lots of gay sex while claiming he is not gay and that being gay is wrong.", 
        "reply": " Hey its Ted Haggard a conservative so its ok for him to have gay sex while preaching against homosexuality. His actions were taken out of context.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 10:54:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "spanner69"
    }, 
    {
        "content": "spanner69, don't you know better than to post a full copyright article? With 1942 post you should know better.", 
        "intTime": 20090302, 
        "postID": 4, 
        "quote": "", 
        "reply": "spanner69, don't you know better than to post a full copyright article? With 1942 post you should know better.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 11:08:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Not surprising. They used credit card transactions to conduct this study. That means the people they talk about in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free? This message has been edited. Last edited by: stec74, Mon 02 March 2009 12:17 PM", 
        "intTime": 20090302, 
        "postID": 5, 
        "quote": "", 
        "reply": "Not surprising. They used credit card transactions to conduct this study. That means the people they talk about in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free? This message has been edited. Last edited by: stec74, Mon 02 March 2009 12:17 PM", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 11:23:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: spanner69, don't you know better than to post a full copyright article? With 1942 post you should know better. Rather just post the link but didint Mil.com put a bann on links to outside website. A ridiculous ban if you ask me", 
        "intTime": 20090302, 
        "postID": 6, 
        "quote": "Originally posted by IHAWKER: spanner69, don't you know better than to post a full copyright article? With 1942 post you should know better.", 
        "reply": " Rather just post the link but didint Mil.com put a bann on links to outside website. A ridiculous ban if you ask me", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 12:15:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free. And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy.", 
        "intTime": 20090302, 
        "postID": 7, 
        "quote": "Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free.", 
        "reply": " And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 12:18:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people they talk about in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free? Exactly what I was going to say.", 
        "intTime": 20090302, 
        "postID": 8, 
        "quote": "Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people they talk about in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free?", 
        "reply": " Exactly what I was going to say.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 12:41:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free. And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy. You can't possibly believe your own accusation in the title of this rather idiotic post? Denial....the dems favorite response.", 
        "intTime": 20090302, 
        "postID": 9, 
        "quote": "Originally posted by spanner69: quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free. And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy.", 
        "reply": " You can't possibly believe your own accusation in the title of this rather idiotic post? Denial....the dems favorite response.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 12:44:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free. And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy. My reply was meant to be \"tongue in cheek\". But judging by the results of this survey maybe I meant it to be \"tongue in something else\" instead.", 
        "intTime": 20090302, 
        "postID": 10, 
        "quote": "Originally posted by spanner69: quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free. And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy.", 
        "reply": " My reply was meant to be \"tongue in cheek\". But judging by the results of this survey maybe I meant it to be \"tongue in something else\" instead.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 13:00:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by spanner69: This doesnt surprise me. I just wish those sanctomonious people would chill with their holier then thou attitudes. ABC News Porn in the USA: Conservatives Are Biggest Consumers 8 of Top 10 Porn-Consuming States Voted Republican in 2008 Presidential Election By EWEN CALLAWAY Feb. 28, 2009— Americans may paint themselves in increasingly bright shades of red and blue, but new research finds one thing that varies little across the nation: the liking for online pornography. A new nationwide study (pdf) of anonymised credit-card receipts from a major online adult entertainment provider finds little variation in consumption between states. \"When it comes to adult entertainment, it seems people are more the same than different,\" says Benjamin Edelman at Harvard Business School. However, there are some trends to be seen in the data. Those states that do consume the most porn tend to be more conservative and religious than states with lower levels of consumption, the study finds. \"Some of the people who are most outraged turn out to be consumers of the very things they claimed to be outraged by,\" Edelman says. Political Divide Edelman spends part of his time helping companies such as Microsoft and AOL detect advertising fraud. Another consulting client runs dozens of adult websites, though he says he is not at liberty to identify the firm. That company did, however, provide Edelman with roughly two years of credit card data from 2006 to 2008 that included a purchase date and each customer's postal code. They were Democrats, not everyone in those states is Republican, just as not everyone in New York is Democrat Your supposition is fail", 
        "intTime": 20090302, 
        "postID": 11, 
        "quote": "Originally posted by spanner69: This doesnt surprise me. I just wish those sanctomonious people would chill with their holier then thou attitudes. ABC News Porn in the USA: Conservatives Are Biggest Consumers 8 of Top 10 Porn-Consuming States Voted Republican in 2008 Presidential Election By EWEN CALLAWAY Feb. 28, 2009— Americans may paint themselves in increasingly bright shades of red and blue, but new research finds one thing that varies little across the nation: the liking for online pornography. A new nationwide study (pdf) of anonymised credit-card receipts from a major online adult entertainment provider finds little variation in consumption between states. \"When it comes to adult entertainment, it seems people are more the same than different,\" says Benjamin Edelman at Harvard Business School. However, there are some trends to be seen in the data. Those states that do consume the most porn tend to be more conservative and religious than states with lower levels of consumption, the study finds. \"Some of the people who are most outraged turn out to be consumers of the very things they claimed to be outraged by,\" Edelman says. Political Divide Edelman spends part of his time helping companies such as Microsoft and AOL detect advertising fraud. Another consulting client runs dozens of adult websites, though he says he is not at liberty to identify the firm. That company did, however, provide Edelman with roughly two years of credit card data from 2006 to 2008 that included a purchase date and each customer's postal code.", 
        "reply": " They were Democrats, not everyone in those states is Republican, just as not everyone in New York is Democrat Your supposition is fail", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 13:18:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "I'm sure it has nothing to do with there being a porn store on every block in LA or San Francisco. Online porn probably sells pretty poorly in such an area.", 
        "intTime": 20090302, 
        "postID": 12, 
        "quote": "", 
        "reply": "I'm sure it has nothing to do with there being a porn store on every block in LA or San Francisco. Online porn probably sells pretty poorly in such an area.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 14:14:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "People are frikkin' horny. It ain't a crime. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090302, 
        "postID": 13, 
        "quote": "", 
        "reply": "People are frikkin' horny. It ain't a crime. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 14:20:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "rm444"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: I'm sure it has nothing to do with there being a porn store on every block in LA or San Francisco. Online porn probably sells pretty poorly in such an area. Buy online porn? Did you get hit on the head? The stuff is free and it's EVERYWHERE. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090302, 
        "postID": 14, 
        "quote": "Originally posted by Thrust_0311: I'm sure it has nothing to do with there being a porn store on every block in LA or San Francisco. Online porn probably sells pretty poorly in such an area.", 
        "reply": " Buy online porn? Did you get hit on the head? The stuff is free and it's EVERYWHERE. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 14:21:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "rm444"
    }, 
    {
        "content": "Just remember they are cleared because they can invoke the Republican Bill Of Exec Laws... Behind the secret doors and Executive privledge.", 
        "intTime": 20090302, 
        "postID": 15, 
        "quote": "", 
        "reply": "Just remember they are cleared because they can invoke the Republican Bill Of Exec Laws... Behind the secret doors and Executive privledge.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 14:39:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by spanner69: quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free. And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy. You can't possibly believe your own accusation in the title of this rather idiotic post? Denial....the dems favorite response. Title of the thread is the title of the Article genius.", 
        "intTime": 20090302, 
        "postID": 16, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by spanner69: quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free. And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy. You can't possibly believe your own accusation in the title of this rather idiotic post? Denial....the dems favorite response.", 
        "reply": " Title of the thread is the title of the Article genius.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 15:16:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by spanner69: This doesnt surprise me. I just wish those sanctomonious people would chill with their holier then thou attitudes. ABC News Porn in the USA: Conservatives Are Biggest Consumers 8 of Top 10 Porn-Consuming States Voted Republican in 2008 Presidential Election By EWEN CALLAWAY Feb. 28, 2009— Americans may paint themselves in increasingly bright shades of red and blue, but new research finds one thing that varies little across the nation: the liking for online pornography. A new nationwide study (pdf) of anonymised credit-card receipts from a major online adult entertainment provider finds little variation in consumption between states. \"When it comes to adult entertainment, it seems people are more the same than different,\" says Benjamin Edelman at Harvard Business School. However, there are some trends to be seen in the data. Those states that do consume the most porn tend to be more conservative and religious than states with lower levels of consumption, the study finds. \"Some of the people who are most outraged turn out to be consumers of the very things they claimed to be outraged by,\" Edelman says. Political Divide Edelman spends part of his time helping companies such as Microsoft and AOL detect advertising fraud. Another consulting client runs dozens of adult websites, though he says he is not at liberty to identify the firm. That company did, however, provide Edelman with roughly two years of credit card data from 2006 to 2008 that included a purchase date and each customer's postal code. They were Democrats, not everyone in those states is Republican, just as not everyone in New York is Democrat Your supposition is fail Right only Democrats buy porn. Why dont you stick your supposition where the sun dont shine bud.", 
        "intTime": 20090302, 
        "postID": 17, 
        "quote": "Originally posted by LineDoggie: quote: Originally posted by spanner69: This doesnt surprise me. I just wish those sanctomonious people would chill with their holier then thou attitudes. ABC News Porn in the USA: Conservatives Are Biggest Consumers 8 of Top 10 Porn-Consuming States Voted Republican in 2008 Presidential Election By EWEN CALLAWAY Feb. 28, 2009— Americans may paint themselves in increasingly bright shades of red and blue, but new research finds one thing that varies little across the nation: the liking for online pornography. A new nationwide study (pdf) of anonymised credit-card receipts from a major online adult entertainment provider finds little variation in consumption between states. \"When it comes to adult entertainment, it seems people are more the same than different,\" says Benjamin Edelman at Harvard Business School. However, there are some trends to be seen in the data. Those states that do consume the most porn tend to be more conservative and religious than states with lower levels of consumption, the study finds. \"Some of the people who are most outraged turn out to be consumers of the very things they claimed to be outraged by,\" Edelman says. Political Divide Edelman spends part of his time helping companies such as Microsoft and AOL detect advertising fraud. Another consulting client runs dozens of adult websites, though he says he is not at liberty to identify the firm. That company did, however, provide Edelman with roughly two years of credit card data from 2006 to 2008 that included a purchase date and each customer's postal code. They were Democrats, not everyone in those states is Republican, just as not everyone in New York is Democrat Your supposition is fail", 
        "reply": " Right only Democrats buy porn. Why dont you stick your supposition where the sun dont shine bud.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 15:18:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by rm444: People are frikkin' horny. It ain't a crime. Exactly. Just like people in Red States and blues states. Holy rollers are just as horny as as kids im NYC. They are no better then anyone eles.", 
        "intTime": 20090302, 
        "postID": 18, 
        "quote": "Originally posted by rm444: People are frikkin' horny. It ain't a crime.", 
        "reply": " Exactly. Just like people in Red States and blues states. Holy rollers are just as horny as as kids im NYC. They are no better then anyone eles.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 15:19:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by rm444: quote: Originally posted by Thrust_0311: I'm sure it has nothing to do with there being a porn store on every block in LA or San Francisco. Online porn probably sells pretty poorly in such an area. Buy online porn? Did you get hit on the head? The stuff is free and it's EVERYWHERE. Hell yeah I got hit in the head, lots of times! I'm a ****in Marine. What'd you expect?", 
        "intTime": 20090302, 
        "postID": 19, 
        "quote": "Originally posted by rm444: quote: Originally posted by Thrust_0311: I'm sure it has nothing to do with there being a porn store on every block in LA or San Francisco. Online porn probably sells pretty poorly in such an area. Buy online porn? Did you get hit on the head? The stuff is free and it's EVERYWHERE.", 
        "reply": " Hell yeah I got hit in the head, lots of times! I'm a ****in Marine. What'd you expect?", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 15:31:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by AngelHeart: quote: Originally posted by spanner69: quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free. And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy. You can't possibly believe your own accusation in the title of this rather idiotic post? Denial....the dems favorite response. Title of the thread is the title of the Article genius. Yes I know. Quite the brainwave aren't you? That should have given you a clue about the source and the article in the first place..but I see it didn't.", 
        "intTime": 20090302, 
        "postID": 20, 
        "quote": "Originally posted by spanner69: quote: Originally posted by AngelHeart: quote: Originally posted by spanner69: quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free. And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy. You can't possibly believe your own accusation in the title of this rather idiotic post? Denial....the dems favorite response. Title of the thread is the title of the Article genius.", 
        "reply": " Yes I know. Quite the brainwave aren't you? That should have given you a clue about the source and the article in the first place..but I see it didn't.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 16:00:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "This doesnt surprise me. I just wish those sanctomonious people would chill with their holier then thou attitudes. ABC News Porn in the USA: Conservatives Are Biggest Consumers 8 of Top 10 Porn-Consuming States Voted Republican in 2008 Presidential Election By EWEN CALLAWAY Feb. 28, 2009— Americans may paint themselves in increasingly bright shades of red and blue, but new research finds one thing that varies little across the nation: the liking for online pornography. A new nationwide study (pdf) of anonymised credit-card receipts from a major online adult entertainment provider finds little variation in consumption between states. \"When it comes to adult entertainment, it seems people are more the same than different,\" says Benjamin Edelman at Harvard Business School. However, there are some trends to be seen in the data. Those states that do consume the most porn tend to be more conservative and religious than states with lower levels of consumption, the study finds. \"Some of the people who are most outraged turn out to be consumers of the very things they claimed to be outraged by,\" Edelman says. Political Divide Edelman spends part of his time helping companies such as Microsoft and AOL detect advertising fraud. Another consulting client runs dozens of adult websites, though he says he is not at liberty to identify the firm. That company did, however, provide Edelman with roughly two years of credit card data from 2006 to 2008 that included a purchase date and each customer's postal code. After controlling for differences in broadband internet access between states online porn tends to be a bandwidth hog and adjusting for population, he found a relatively small difference between states with the most adult purchases and those with the fewest. The biggest consumer, Utah, averaged 5.47 adult content subscriptions per 1000 home broadband users; Montana bought the least with 1.92 per 1000. \"The differences here are not so stark,\" Edelman says. Number 10 on the list was West Virginia at 2.94 subscriptions per 1000, while number 41, Michigan, averaged 2.32. Eight of the top 10 pornography consuming states gave their electoral votes to John McCain in last year's presidential election Florida and Hawaii were the exceptions. While six out of the lowest 10 favoured Barack Obama. Old-Fashioned Values Church-goers bought less online porn on Sundays a 1% increase in a postal code's religious attendance was associated with a 0.1% drop in subscriptions that day. However, expenditures on other days of the week brought them in line with the rest of the country, Edelman finds. Residents of 27 states that passed laws banning gay marriages boasted 11% more porn subscribers than states that don't explicitly restrict gay marriage. To get a better handle on other associations between social attitudes and pornography consumption, Edelman melded his data with a previous study on public attitudes toward religion. States where a majority of residents agreed with the statement \"I have old-fashioned values about family and marriage,\" bought 3.6 more subscriptions per thousand people than states where a majority disagreed. A similar difference emerged for the statement \"AIDS might be God's punishment for immoral sexual behaviour.\" \"One natural hypothesis is something like repression: if you're told you can't have this, then you want it more,\" Edelman says. Copyright © 2009 ABC News Internet Ventures", 
        "intTime": 20090302, 
        "postID": 21, 
        "quote": "", 
        "reply": "This doesnt surprise me. I just wish those sanctomonious people would chill with their holier then thou attitudes. ABC News Porn in the USA: Conservatives Are Biggest Consumers 8 of Top 10 Porn-Consuming States Voted Republican in 2008 Presidential Election By EWEN CALLAWAY Feb. 28, 2009— Americans may paint themselves in increasingly bright shades of red and blue, but new research finds one thing that varies little across the nation: the liking for online pornography. A new nationwide study (pdf) of anonymised credit-card receipts from a major online adult entertainment provider finds little variation in consumption between states. \"When it comes to adult entertainment, it seems people are more the same than different,\" says Benjamin Edelman at Harvard Business School. However, there are some trends to be seen in the data. Those states that do consume the most porn tend to be more conservative and religious than states with lower levels of consumption, the study finds. \"Some of the people who are most outraged turn out to be consumers of the very things they claimed to be outraged by,\" Edelman says. Political Divide Edelman spends part of his time helping companies such as Microsoft and AOL detect advertising fraud. Another consulting client runs dozens of adult websites, though he says he is not at liberty to identify the firm. That company did, however, provide Edelman with roughly two years of credit card data from 2006 to 2008 that included a purchase date and each customer's postal code. After controlling for differences in broadband internet access between states online porn tends to be a bandwidth hog and adjusting for population, he found a relatively small difference between states with the most adult purchases and those with the fewest. The biggest consumer, Utah, averaged 5.47 adult content subscriptions per 1000 home broadband users; Montana bought the least with 1.92 per 1000. \"The differences here are not so stark,\" Edelman says. Number 10 on the list was West Virginia at 2.94 subscriptions per 1000, while number 41, Michigan, averaged 2.32. Eight of the top 10 pornography consuming states gave their electoral votes to John McCain in last year's presidential election Florida and Hawaii were the exceptions. While six out of the lowest 10 favoured Barack Obama. Old-Fashioned Values Church-goers bought less online porn on Sundays a 1% increase in a postal code's religious attendance was associated with a 0.1% drop in subscriptions that day. However, expenditures on other days of the week brought them in line with the rest of the country, Edelman finds. Residents of 27 states that passed laws banning gay marriages boasted 11% more porn subscribers than states that don't explicitly restrict gay marriage. To get a better handle on other associations between social attitudes and pornography consumption, Edelman melded his data with a previous study on public attitudes toward religion. States where a majority of residents agreed with the statement \"I have old-fashioned values about family and marriage,\" bought 3.6 more subscriptions per thousand people than states where a majority disagreed. A similar difference emerged for the statement \"AIDS might be God's punishment for immoral sexual behaviour.\" \"One natural hypothesis is something like repression: if you're told you can't have this, then you want it more,\" Edelman says. Copyright © 2009 ABC News Internet Ventures", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 10:36:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "spanner69"
    }, 
    {
        "content": "In a related topic, Ted Haggard continues to have lots of gay sex while claiming he is not gay and that being gay is wrong.", 
        "intTime": 20090302, 
        "postID": 22, 
        "quote": "", 
        "reply": "In a related topic, Ted Haggard continues to have lots of gay sex while claiming he is not gay and that being gay is wrong.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 10:45:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: In a related topic, Ted Haggard continues to have lots of gay sex while claiming he is not gay and that being gay is wrong. Hey its Ted Haggard a conservative so its ok for him to have gay sex while preaching against homosexuality. His actions were taken out of context.", 
        "intTime": 20090302, 
        "postID": 23, 
        "quote": "Originally posted by mrmixitup: In a related topic, Ted Haggard continues to have lots of gay sex while claiming he is not gay and that being gay is wrong.", 
        "reply": " Hey its Ted Haggard a conservative so its ok for him to have gay sex while preaching against homosexuality. His actions were taken out of context.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 10:54:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "spanner69"
    }, 
    {
        "content": "spanner69, don't you know better than to post a full copyright article? With 1942 post you should know better.", 
        "intTime": 20090302, 
        "postID": 24, 
        "quote": "", 
        "reply": "spanner69, don't you know better than to post a full copyright article? With 1942 post you should know better.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 11:08:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Not surprising. They used credit card transactions to conduct this study. That means the people they talk about in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free? This message has been edited. Last edited by: stec74, Mon 02 March 2009 12:17 PM", 
        "intTime": 20090302, 
        "postID": 25, 
        "quote": "", 
        "reply": "Not surprising. They used credit card transactions to conduct this study. That means the people they talk about in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free? This message has been edited. Last edited by: stec74, Mon 02 March 2009 12:17 PM", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 11:23:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by IHAWKER: spanner69, don't you know better than to post a full copyright article? With 1942 post you should know better. Rather just post the link but didint Mil.com put a bann on links to outside website. A ridiculous ban if you ask me", 
        "intTime": 20090302, 
        "postID": 26, 
        "quote": "Originally posted by IHAWKER: spanner69, don't you know better than to post a full copyright article? With 1942 post you should know better.", 
        "reply": " Rather just post the link but didint Mil.com put a bann on links to outside website. A ridiculous ban if you ask me", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 12:15:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free. And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy.", 
        "intTime": 20090302, 
        "postID": 27, 
        "quote": "Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free.", 
        "reply": " And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 12:18:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people they talk about in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free? Exactly what I was going to say.", 
        "intTime": 20090302, 
        "postID": 28, 
        "quote": "Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people they talk about in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free?", 
        "reply": " Exactly what I was going to say.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 12:41:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free. And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy. You can't possibly believe your own accusation in the title of this rather idiotic post? Denial....the dems favorite response.", 
        "intTime": 20090302, 
        "postID": 29, 
        "quote": "Originally posted by spanner69: quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free. And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy.", 
        "reply": " You can't possibly believe your own accusation in the title of this rather idiotic post? Denial....the dems favorite response.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 12:44:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "AngelHeart"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free. And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy. My reply was meant to be \"tongue in cheek\". But judging by the results of this survey maybe I meant it to be \"tongue in something else\" instead.", 
        "intTime": 20090302, 
        "postID": 30, 
        "quote": "Originally posted by spanner69: quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free. And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy.", 
        "reply": " My reply was meant to be \"tongue in cheek\". But judging by the results of this survey maybe I meant it to be \"tongue in something else\" instead.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 13:00:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by spanner69: This doesnt surprise me. I just wish those sanctomonious people would chill with their holier then thou attitudes. ABC News Porn in the USA: Conservatives Are Biggest Consumers 8 of Top 10 Porn-Consuming States Voted Republican in 2008 Presidential Election By EWEN CALLAWAY Feb. 28, 2009— Americans may paint themselves in increasingly bright shades of red and blue, but new research finds one thing that varies little across the nation: the liking for online pornography. A new nationwide study (pdf) of anonymised credit-card receipts from a major online adult entertainment provider finds little variation in consumption between states. \"When it comes to adult entertainment, it seems people are more the same than different,\" says Benjamin Edelman at Harvard Business School. However, there are some trends to be seen in the data. Those states that do consume the most porn tend to be more conservative and religious than states with lower levels of consumption, the study finds. \"Some of the people who are most outraged turn out to be consumers of the very things they claimed to be outraged by,\" Edelman says. Political Divide Edelman spends part of his time helping companies such as Microsoft and AOL detect advertising fraud. Another consulting client runs dozens of adult websites, though he says he is not at liberty to identify the firm. That company did, however, provide Edelman with roughly two years of credit card data from 2006 to 2008 that included a purchase date and each customer's postal code. They were Democrats, not everyone in those states is Republican, just as not everyone in New York is Democrat Your supposition is fail", 
        "intTime": 20090302, 
        "postID": 31, 
        "quote": "Originally posted by spanner69: This doesnt surprise me. I just wish those sanctomonious people would chill with their holier then thou attitudes. ABC News Porn in the USA: Conservatives Are Biggest Consumers 8 of Top 10 Porn-Consuming States Voted Republican in 2008 Presidential Election By EWEN CALLAWAY Feb. 28, 2009— Americans may paint themselves in increasingly bright shades of red and blue, but new research finds one thing that varies little across the nation: the liking for online pornography. A new nationwide study (pdf) of anonymised credit-card receipts from a major online adult entertainment provider finds little variation in consumption between states. \"When it comes to adult entertainment, it seems people are more the same than different,\" says Benjamin Edelman at Harvard Business School. However, there are some trends to be seen in the data. Those states that do consume the most porn tend to be more conservative and religious than states with lower levels of consumption, the study finds. \"Some of the people who are most outraged turn out to be consumers of the very things they claimed to be outraged by,\" Edelman says. Political Divide Edelman spends part of his time helping companies such as Microsoft and AOL detect advertising fraud. Another consulting client runs dozens of adult websites, though he says he is not at liberty to identify the firm. That company did, however, provide Edelman with roughly two years of credit card data from 2006 to 2008 that included a purchase date and each customer's postal code.", 
        "reply": " They were Democrats, not everyone in those states is Republican, just as not everyone in New York is Democrat Your supposition is fail", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 13:18:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "I'm sure it has nothing to do with there being a porn store on every block in LA or San Francisco. Online porn probably sells pretty poorly in such an area.", 
        "intTime": 20090302, 
        "postID": 32, 
        "quote": "", 
        "reply": "I'm sure it has nothing to do with there being a porn store on every block in LA or San Francisco. Online porn probably sells pretty poorly in such an area.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 14:14:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "People are frikkin' horny. It ain't a crime. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090302, 
        "postID": 33, 
        "quote": "", 
        "reply": "People are frikkin' horny. It ain't a crime. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 14:20:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "rm444"
    }, 
    {
        "content": "quote: Originally posted by Thrust_0311: I'm sure it has nothing to do with there being a porn store on every block in LA or San Francisco. Online porn probably sells pretty poorly in such an area. Buy online porn? Did you get hit on the head? The stuff is free and it's EVERYWHERE. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "intTime": 20090302, 
        "postID": 34, 
        "quote": "Originally posted by Thrust_0311: I'm sure it has nothing to do with there being a porn store on every block in LA or San Francisco. Online porn probably sells pretty poorly in such an area.", 
        "reply": " Buy online porn? Did you get hit on the head? The stuff is free and it's EVERYWHERE. \"Thank you, for your support.\" - Bartles & Jaymes", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 14:21:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "rm444"
    }, 
    {
        "content": "Just remember they are cleared because they can invoke the Republican Bill Of Exec Laws... Behind the secret doors and Executive privledge.", 
        "intTime": 20090302, 
        "postID": 35, 
        "quote": "", 
        "reply": "Just remember they are cleared because they can invoke the Republican Bill Of Exec Laws... Behind the secret doors and Executive privledge.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 14:39:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by AngelHeart: quote: Originally posted by spanner69: quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free. And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy. You can't possibly believe your own accusation in the title of this rather idiotic post? Denial....the dems favorite response. Title of the thread is the title of the Article genius.", 
        "intTime": 20090302, 
        "postID": 36, 
        "quote": "Originally posted by AngelHeart: quote: Originally posted by spanner69: quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free. And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy. You can't possibly believe your own accusation in the title of this rather idiotic post? Denial....the dems favorite response.", 
        "reply": " Title of the thread is the title of the Article genius.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 15:16:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by LineDoggie: quote: Originally posted by spanner69: This doesnt surprise me. I just wish those sanctomonious people would chill with their holier then thou attitudes. ABC News Porn in the USA: Conservatives Are Biggest Consumers 8 of Top 10 Porn-Consuming States Voted Republican in 2008 Presidential Election By EWEN CALLAWAY Feb. 28, 2009— Americans may paint themselves in increasingly bright shades of red and blue, but new research finds one thing that varies little across the nation: the liking for online pornography. A new nationwide study (pdf) of anonymised credit-card receipts from a major online adult entertainment provider finds little variation in consumption between states. \"When it comes to adult entertainment, it seems people are more the same than different,\" says Benjamin Edelman at Harvard Business School. However, there are some trends to be seen in the data. Those states that do consume the most porn tend to be more conservative and religious than states with lower levels of consumption, the study finds. \"Some of the people who are most outraged turn out to be consumers of the very things they claimed to be outraged by,\" Edelman says. Political Divide Edelman spends part of his time helping companies such as Microsoft and AOL detect advertising fraud. Another consulting client runs dozens of adult websites, though he says he is not at liberty to identify the firm. That company did, however, provide Edelman with roughly two years of credit card data from 2006 to 2008 that included a purchase date and each customer's postal code. They were Democrats, not everyone in those states is Republican, just as not everyone in New York is Democrat Your supposition is fail Right only Democrats buy porn. Why dont you stick your supposition where the sun dont shine bud.", 
        "intTime": 20090302, 
        "postID": 37, 
        "quote": "Originally posted by LineDoggie: quote: Originally posted by spanner69: This doesnt surprise me. I just wish those sanctomonious people would chill with their holier then thou attitudes. ABC News Porn in the USA: Conservatives Are Biggest Consumers 8 of Top 10 Porn-Consuming States Voted Republican in 2008 Presidential Election By EWEN CALLAWAY Feb. 28, 2009— Americans may paint themselves in increasingly bright shades of red and blue, but new research finds one thing that varies little across the nation: the liking for online pornography. A new nationwide study (pdf) of anonymised credit-card receipts from a major online adult entertainment provider finds little variation in consumption between states. \"When it comes to adult entertainment, it seems people are more the same than different,\" says Benjamin Edelman at Harvard Business School. However, there are some trends to be seen in the data. Those states that do consume the most porn tend to be more conservative and religious than states with lower levels of consumption, the study finds. \"Some of the people who are most outraged turn out to be consumers of the very things they claimed to be outraged by,\" Edelman says. Political Divide Edelman spends part of his time helping companies such as Microsoft and AOL detect advertising fraud. Another consulting client runs dozens of adult websites, though he says he is not at liberty to identify the firm. That company did, however, provide Edelman with roughly two years of credit card data from 2006 to 2008 that included a purchase date and each customer's postal code. They were Democrats, not everyone in those states is Republican, just as not everyone in New York is Democrat Your supposition is fail", 
        "reply": " Right only Democrats buy porn. Why dont you stick your supposition where the sun dont shine bud.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 15:18:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by rm444: People are frikkin' horny. It ain't a crime. Exactly. Just like people in Red States and blues states. Holy rollers are just as horny as as kids im NYC. They are no better then anyone eles.", 
        "intTime": 20090302, 
        "postID": 38, 
        "quote": "Originally posted by rm444: People are frikkin' horny. It ain't a crime.", 
        "reply": " Exactly. Just like people in Red States and blues states. Holy rollers are just as horny as as kids im NYC. They are no better then anyone eles.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 15:19:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "spanner69"
    }, 
    {
        "content": "quote: Originally posted by rm444: quote: Originally posted by Thrust_0311: I'm sure it has nothing to do with there being a porn store on every block in LA or San Francisco. Online porn probably sells pretty poorly in such an area. Buy online porn? Did you get hit on the head? The stuff is free and it's EVERYWHERE. Hell yeah I got hit in the head, lots of times! I'm a ****in Marine. What'd you expect?", 
        "intTime": 20090302, 
        "postID": 39, 
        "quote": "Originally posted by rm444: quote: Originally posted by Thrust_0311: I'm sure it has nothing to do with there being a porn store on every block in LA or San Francisco. Online porn probably sells pretty poorly in such an area. Buy online porn? Did you get hit on the head? The stuff is free and it's EVERYWHERE.", 
        "reply": " Hell yeah I got hit in the head, lots of times! I'm a ****in Marine. What'd you expect?", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 15:31:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "Thrust_0311"
    }, 
    {
        "content": "quote: Originally posted by spanner69: quote: Originally posted by AngelHeart: quote: Originally posted by spanner69: quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free. And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy. You can't possibly believe your own accusation in the title of this rather idiotic post? Denial....the dems favorite response. Title of the thread is the title of the Article genius. Yes I know. Quite the brainwave aren't you? That should have given you a clue about the source and the article in the first place..but I see it didn't.", 
        "intTime": 20090302, 
        "postID": 40, 
        "quote": "Originally posted by spanner69: quote: Originally posted by AngelHeart: quote: Originally posted by spanner69: quote: Originally posted by stec74: Not surprising. They used credit card transactions to conduct this study. That means the people in this study actually paid for the porn. Liberals simply steal their porn from file sharing sites. Why pay for something when you can take it from someone else for free. And if you believe stec I have a bridge in Brooklyn to sell you. I know many a person here who buys hi sporn just like his counter part in Red States accept my porn buying buddies dont talk about the evils of buying porn while my Red state Brethern does. Reminds me of teachings of Christ about hypocracy. You can't possibly believe your own accusation in the title of this rather idiotic post? Denial....the dems favorite response. Title of the thread is the title of the Article genius.", 
        "reply": " Yes I know. Quite the brainwave aren't you? That should have given you a clue about the source and the article in the first place..but I see it didn't.", 
        "threadID": "672198221_8280086612001", 
        "time": "2009-03-02 16:00:00", 
        "title": "Porn in the USA: Conservatives Are Biggest Consumers", 
        "userID": "AngelHeart"
    }
]