[
    {
        "content": "\"http://www.michaelyon-online.com/\" Excerpt from article: quote: Fallen brothers found - and lost As with so much in life and in death, there was news this week that was joyous and sad and bittersweet all at once for the small community of the Vietnam War’s band of brothers of the Ia Drang Valley. Early in the morning of December 28, 1965, a U.S. Army Huey helicopter, tail number 63-08808, lifted off from the huge grassy airfield at the 1st Cavalry Division (Airmobile) base at An Khe in the Central Highlands of South Vietnam. Two experienced pilots, CWO Jesse Phelps of Boise, Idaho, and CWO Kenneth Stancil of Chattanooga, Tenn., were at the controls. Behind them in the doors were crew chief Donald Grella of Laurel, Neb., and door gunner Thomas Rice Jr. of Spartanburg, S.C. All four were already veterans of the fiercest air assault battle of the war, fought the previous month in the Ia Drang. Huey 808 was one of 10 birds in a platoon of A Company, 229th Assault Helicopter Battalion, led by Capt. Ed (Too Tall to Fly) Freeman. It was bound on a short, routine flight down Route 19 to an infantry field position just over the high pass between An Khe and the port city of Qui Nhon. It was what Army aviators called an \"ash and trash mission,\" hauling cases of C-rations, ammunition and other essential supplies to a company of grunts preparing for an air assault mission.",
        "intTime": 20090411,
        "postID": 1,
        "quote": "Fallen brothers found - and lost As with so much in life and in death, there was news this week that was joyous and sad and bittersweet all at once for the small community of the Vietnam War’s band of brothers of the Ia Drang Valley. Early in the morning of December 28, 1965, a U.S. Army Huey helicopter, tail number 63-08808, lifted off from the huge grassy airfield at the 1st Cavalry Division (Airmobile) base at An Khe in the Central Highlands of South Vietnam. Two experienced pilots, CWO Jesse Phelps of Boise, Idaho, and CWO Kenneth Stancil of Chattanooga, Tenn., were at the controls. Behind them in the doors were crew chief Donald Grella of Laurel, Neb., and door gunner Thomas Rice Jr. of Spartanburg, S.C. All four were already veterans of the fiercest air assault battle of the war, fought the previous month in the Ia Drang. Huey 808 was one of 10 birds in a platoon of A Company, 229th Assault Helicopter Battalion, led by Capt. Ed (Too Tall to Fly) Freeman. It was bound on a short, routine flight down Route 19 to an infantry field position just over the high pass between An Khe and the port city of Qui Nhon. It was what Army aviators called an \"ash and trash mission,\" hauling cases of C-rations, ammunition and other essential supplies to a company of grunts preparing for an air assault mission.",
        "reply": "\"http://www.michaelyon-online.com/\" Excerpt from article: ",
        "threadID": "672198221_9330044022001",
        "time": "2009-04-11 09:39:00",
        "title": "Vanished Soldiers: American Heroes Come Home",
        "userID": "AngelHeart"
    }
]