[
    {
        "content": "For those of you who say the Republicans have no solutions to the country's problems except to vote \"no\" to the Democratic proposals, this Act was introduced in the House and Senate yesterday. quote: Congressman John Fleming and two other members of the House of Representatives, Congressman John Shadegg and Congressman Rob Bishop, introduced the No Cost Stimulus Act of 2009 Wednesday, March 11, as a foundation plan to stabilize our economy and grow the energy sector in the United States, according to a news release. Simultaneously, Senator David Vitter, along with Senators Tom Coburn and James Inhofe, introduced the legislation to the Senate. “The No Cost Stimulus Act of 2009 is a real, long-term solution to put Americans back to work without jeopardizing future generations with massive debt,” said Fleming. “Continuing to explore and develop our resources in the Outer Continental Shelf is pertinent to our economic stability as is opening up ANWR. We haven’t come close to realizing ANWR’s full potential. This bill also addresses calls for the distribution of federal revenues to be the source to fund renewable energies instead of putting the cost on the backs of taxpayers and their hard earned dollars. I am confident this bill will create jobs with longevity and good salaries, offset rising energy costs, lessen our dependence on foreign oil and decrease the threat to our national security. The No Cost Stimulus Act of 2009 supports what we in Louisiana have known for decades – Energy Equals Jobs.” The No Cost Stimulus Act of 2009 would help ensure our economy flourishes and that the laws that have crippled businesses are scaled back to their original intent. 1. Saves or creates more than 2 million long-term, sustainable and well paying jobs. 2. Dramatically increases GDP that could well exceed $10 trillion over the next 30 years. 3. Reduces the cost of energy to manufacturers, all U.S. businesses and low-income families. On top of helping businesses compete internationally it reduces the cost of a key input so that resources may be used on other purchases or employee hiring. 4. Will have a significant positive impact on low-income families, as this is the equivalent of receiving a stimulus check. As the price of energy decreases a family may direct the extra money towards other needs. 5. Achieves these goals while not incurring huge amounts of debt payable to foreign governments and leveraged against our own children’s future. 6. Has a direct and significant impact on reducing our dependence on foreign oil. The No Cost Stimulus Act of 2009 is supported by U.S. Chamber of Commerce, the National Black Chamber of Commerce, the National Association of Manufacturers, the Alliance for Worker Freedom, the National Taxpayers Union and the Americans for Tax Reform. \"http://www.thetowntalk.com/article/20090311/NEWS01/90311010\"",
        "intTime": 20090312,
        "postID": 1,
        "quote": "Congressman John Fleming and two other members of the House of Representatives, Congressman John Shadegg and Congressman Rob Bishop, introduced the No Cost Stimulus Act of 2009 Wednesday, March 11, as a foundation plan to stabilize our economy and grow the energy sector in the United States, according to a news release. Simultaneously, Senator David Vitter, along with Senators Tom Coburn and James Inhofe, introduced the legislation to the Senate. “The No Cost Stimulus Act of 2009 is a real, long-term solution to put Americans back to work without jeopardizing future generations with massive debt,” said Fleming. “Continuing to explore and develop our resources in the Outer Continental Shelf is pertinent to our economic stability as is opening up ANWR. We haven’t come close to realizing ANWR’s full potential. This bill also addresses calls for the distribution of federal revenues to be the source to fund renewable energies instead of putting the cost on the backs of taxpayers and their hard earned dollars. I am confident this bill will create jobs with longevity and good salaries, offset rising energy costs, lessen our dependence on foreign oil and decrease the threat to our national security. The No Cost Stimulus Act of 2009 supports what we in Louisiana have known for decades – Energy Equals Jobs.” The No Cost Stimulus Act of 2009 would help ensure our economy flourishes and that the laws that have crippled businesses are scaled back to their original intent. 1. Saves or creates more than 2 million long-term, sustainable and well paying jobs. 2. Dramatically increases GDP that could well exceed $10 trillion over the next 30 years. 3. Reduces the cost of energy to manufacturers, all U.S. businesses and low-income families. On top of helping businesses compete internationally it reduces the cost of a key input so that resources may be used on other purchases or employee hiring. 4. Will have a significant positive impact on low-income families, as this is the equivalent of receiving a stimulus check. As the price of energy decreases a family may direct the extra money towards other needs. 5. Achieves these goals while not incurring huge amounts of debt payable to foreign governments and leveraged against our own children’s future. 6. Has a direct and significant impact on reducing our dependence on foreign oil. The No Cost Stimulus Act of 2009 is supported by U.S. Chamber of Commerce, the National Black Chamber of Commerce, the National Association of Manufacturers, the Alliance for Worker Freedom, the National Taxpayers Union and the Americans for Tax Reform.",
        "reply": "For those of you who say the Republicans have no solutions to the country's problems except to vote \"no\" to the Democratic proposals, this Act was introduced in the House and Senate yesterday.  \"http://www.thetowntalk.com/article/20090311/NEWS01/90311010\"",
        "threadID": "672198221_9110066712001",
        "time": "2009-03-12 10:36:00",
        "title": "No Cost Stimulus",
        "userID": "stec74"
    },
    {
        "content": "quote: Originally posted by stec74: The No Cost Stimulus Act of 2009 is supported by U.S. Chamber of Commerce, the National Black Chamber of Commerce, the National Association of Manufacturers, the Alliance for Worker Freedom, the National Taxpayers Union and the Americans for Tax Reform. Chief, everyone in favor (BTW I'd support it) but the tree huggers; moose and elk liberals; PETA; ACLU; obama, reid and pelosi. Don't forget the possibility of 17 of the 18 viewers of this post up til now, who didn't have anything to say? \"http://www.thetowntalk.com/article/20090311/NEWS01/90311010\"[/QUOTE]",
        "intTime": 20090313,
        "postID": 2,
        "quote": "Originally posted by stec74: The No Cost Stimulus Act of 2009 is supported by U.S. Chamber of Commerce, the National Black Chamber of Commerce, the National Association of Manufacturers, the Alliance for Worker Freedom, the National Taxpayers Union and the Americans for Tax Reform.",
        "reply": " Chief, everyone in favor (BTW I'd support it) but the tree huggers; moose and elk liberals; PETA; ACLU; obama, reid and pelosi. Don't forget the possibility of 17 of the 18 viewers of this post up til now, who didn't have anything to say? \"http://www.thetowntalk.com/article/20090311/NEWS01/90311010\"[/QUOTE]",
        "threadID": "672198221_9110066712001",
        "time": "2009-03-13 03:40:00",
        "title": "No Cost Stimulus",
        "userID": "busnrete8"
    },
    {
        "content": "I am behind it too. Problem is, it makes sense. We all know that the Feds rarely do things that makes sense, instead they listen to the tree huggers and such.",
        "intTime": 20090313,
        "postID": 3,
        "quote": "",
        "reply": "I am behind it too. Problem is, it makes sense. We all know that the Feds rarely do things that makes sense, instead they listen to the tree huggers and such.",
        "threadID": "672198221_9110066712001",
        "time": "2009-03-13 06:40:00",
        "title": "No Cost Stimulus",
        "userID": "Woody_in_La"
    }
]