[
    {
        "content": "From the New York Daily News “Sanity prevails as Justice Department staffers reportedly are recommending against prosecution of Bush administration officials who articulated the legal framework for tough interrogations of terror suspects. “President Obama has ruled out prosecuting the CIA agents who conducted the interrogations, and no one is talking about hauling top decision makers, such as President Bush and former Attorney General Alberto Gonzales, into the dock.” While there may be some Congressional investigations of how the law was tortured to allow torture, no one will go to jail over that decision. Under the law, as long as everyone, from the CinC on down was following the Office of Legal Counsel’s interpretation of the law, no law was broken. These interpretations were later found by the courts to be wrong, but until those court decisions, they were not illegal. Comment: I agree with President Obama that this dark chapter of American history is best passed by, the sooner the better. Prosecutions and open hearings will distract from what needs to be done and accomplish nothing that has not already been accomplished. The policies of torture and secret prisons instituted by the Bush Administration have been repudiated. It would be almost impossible for future presidents to bring them back. Let’s move on.",
        "intTime": 20090508,
        "postID": 1,
        "quote": "",
        "reply": "From the New York Daily News “Sanity prevails as Justice Department staffers reportedly are recommending against prosecution of Bush administration officials who articulated the legal framework for tough interrogations of terror suspects. “President Obama has ruled out prosecuting the CIA agents who conducted the interrogations, and no one is talking about hauling top decision makers, such as President Bush and former Attorney General Alberto Gonzales, into the dock.” While there may be some Congressional investigations of how the law was tortured to allow torture, no one will go to jail over that decision. Under the law, as long as everyone, from the CinC on down was following the Office of Legal Counsel’s interpretation of the law, no law was broken. These interpretations were later found by the courts to be wrong, but until those court decisions, they were not illegal. Comment: I agree with President Obama that this dark chapter of American history is best passed by, the sooner the better. Prosecutions and open hearings will distract from what needs to be done and accomplish nothing that has not already been accomplished. The policies of torture and secret prisons instituted by the Bush Administration have been repudiated. It would be almost impossible for future presidents to bring them back. Let’s move on.",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 11:50:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "xerello"
    },
    {
        "content": "This is sad. I was hoping they would go all the way. Just to prove the innocence. But slander is the name of the game. Political hacking",
        "intTime": 20090508,
        "postID": 2,
        "quote": "",
        "reply": "This is sad. I was hoping they would go all the way. Just to prove the innocence. But slander is the name of the game. Political hacking",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 14:26:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "ACR26"
    },
    {
        "content": "quote: Originally posted by xerello: The policies of torture and secret prisons instituted by the Bush Administration have been repudiated. It would be almost impossible for future presidents to bring them back. Let’s move on. While I agree that prosecutions are a poor idea, a Truth Commision modeled on South Africa's would have been the best solution. I disagree that it would be \"almost impossible\" to do this again. Only public scrutiny, that such a commision could provide, would once and for all bring this into the open. Dave",
        "intTime": 20090508,
        "postID": 3,
        "quote": "Originally posted by xerello: The policies of torture and secret prisons instituted by the Bush Administration have been repudiated. It would be almost impossible for future presidents to bring them back. Let’s move on.",
        "reply": " While I agree that prosecutions are a poor idea, a Truth Commision modeled on South Africa's would have been the best solution. I disagree that it would be \"almost impossible\" to do this again. Only public scrutiny, that such a commision could provide, would once and for all bring this into the open. Dave",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 14:31:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by klassylady25: Now let's see if they'll take the next step and NOT release the pictures. There is a Appeals Court order to release the pictures. No the Obama Administration cannot appeal to the Supreme Court because there is no basis for appeal. What would you have them do - decree that they are not going to release the photos?",
        "intTime": 20090508,
        "postID": 4,
        "quote": "Originally posted by klassylady25: Now let's see if they'll take the next step and NOT release the pictures.",
        "reply": " There is a Appeals Court order to release the pictures. No the Obama Administration cannot appeal to the Supreme Court because there is no basis for appeal. What would you have them do - decree that they are not going to release the photos?",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 14:45:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "xerello"
    },
    {
        "content": "By Executive Order he could stop the release of the images, he does have that authority as President.",
        "intTime": 20090508,
        "postID": 5,
        "quote": "",
        "reply": "By Executive Order he could stop the release of the images, he does have that authority as President.",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 15:30:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "LineDoggie"
    },
    {
        "content": "quote: Originally posted by LineDoggie: By Executive Order he could stop the release of the images, he does have that authority as President. but, what if the press demands their rights under the Freedom of Information Act? this is going to get uglyer before it gets any better. someone needs to be scapegoated. who will it be? rummy? Gonzo? Condi? Georgie? bet it is not Dicky boy... he is safe in the Caymans...",
        "intTime": 20090508,
        "postID": 6,
        "quote": "Originally posted by LineDoggie: By Executive Order he could stop the release of the images, he does have that authority as President.",
        "reply": " but, what if the press demands their rights under the Freedom of Information Act? this is going to get uglyer before it gets any better. someone needs to be scapegoated. who will it be? rummy? Gonzo? Condi? Georgie? bet it is not Dicky boy... he is safe in the Caymans...",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 15:35:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "Elesso"
    },
    {
        "content": "quote: Originally posted by LineDoggie: By Executive Order he could stop the release of the images, he does have that authority as President. President Bush tried that. He did not mind ruling by decree - or Executive Order. But the court case has been going on since 2004. The Bush Administration lost every appeal and delayed as much as they could. It would be illegal not to release the photos. I do realize that those facts will not stop bushies from saying that the Obama Administration released the photos because they want to destroy America.",
        "intTime": 20090508,
        "postID": 7,
        "quote": "Originally posted by LineDoggie: By Executive Order he could stop the release of the images, he does have that authority as President.",
        "reply": " President Bush tried that. He did not mind ruling by decree - or Executive Order. But the court case has been going on since 2004. The Bush Administration lost every appeal and delayed as much as they could. It would be illegal not to release the photos. I do realize that those facts will not stop bushies from saying that the Obama Administration released the photos because they want to destroy America.",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 15:43:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "xerello"
    },
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by LineDoggie: By Executive Order he could stop the release of the images, he does have that authority as President. President Bush tried that. He did not mind ruling by decree - or Executive Order. But the court case has been going on since 2004. The Bush Administration lost every appeal and delayed as much as they could. It would be illegal not to release the photos. I do realize that those facts will not stop bushies from saying that the Obama Administration released the photos because they want to destroy America. Yeah, they tried to run that \"Executive Order\" crap through the Courts and lost on every appeal. Now all of a sudden they want Obama to be a damned dictator while screaming bloody murder that he IS a dictator. Dave",
        "intTime": 20090508,
        "postID": 8,
        "quote": "Originally posted by xerello: quote: Originally posted by LineDoggie: By Executive Order he could stop the release of the images, he does have that authority as President. President Bush tried that. He did not mind ruling by decree - or Executive Order. But the court case has been going on since 2004. The Bush Administration lost every appeal and delayed as much as they could. It would be illegal not to release the photos. I do realize that those facts will not stop bushies from saying that the Obama Administration released the photos because they want to destroy America.",
        "reply": " Yeah, they tried to run that \"Executive Order\" crap through the Courts and lost on every appeal. Now all of a sudden they want Obama to be a damned dictator while screaming bloody murder that he IS a dictator. Dave",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 16:35:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by xerello: The policies of torture and secret prisons instituted by the Bush Administration have been repudiated. It would be almost impossible for future presidents to bring them back. Let’s move on. While I agree that prosecutions are a poor idea, a Truth Commision modeled on South Africa's would have been the best solution. I disagree that it would be \"almost impossible\" to do this again. Only public scrutiny, that such a commision could provide, would once and for all bring this into the open. Dave Maybe in time there could be a truth commission. But in my opinion such a commission at this time would only help to divide the country further, when there needs to be reconciliation and President Obama already has at least two full plates to deal with. Look at what the bushies do to the smallest decision that President Obama makes. The President fired a guy that should be fired – they say he is being political. Then there are the lies that are made up by bushies – “President Obama apologized to the Europeans for America’s past behavior.” President Obama is going to take our guns.” And then there are still quite a few people who swear that President Obama is a Muslim planted by the enemy to destroy the country. Just think what bushies could exaggerate or make up during truth commissions. Washing our dirty laundry right now would not do anything except satisfy the far left and further inflame the bushies – it would not be good for the country.",
        "intTime": 20090508,
        "postID": 9,
        "quote": "Originally posted by Grachus: quote: Originally posted by xerello: The policies of torture and secret prisons instituted by the Bush Administration have been repudiated. It would be almost impossible for future presidents to bring them back. Let’s move on. While I agree that prosecutions are a poor idea, a Truth Commision modeled on South Africa's would have been the best solution. I disagree that it would be \"almost impossible\" to do this again. Only public scrutiny, that such a commision could provide, would once and for all bring this into the open. Dave",
        "reply": " Maybe in time there could be a truth commission. But in my opinion such a commission at this time would only help to divide the country further, when there needs to be reconciliation and President Obama already has at least two full plates to deal with. Look at what the bushies do to the smallest decision that President Obama makes. The President fired a guy that should be fired – they say he is being political. Then there are the lies that are made up by bushies – “President Obama apologized to the Europeans for America’s past behavior.” President Obama is going to take our guns.” And then there are still quite a few people who swear that President Obama is a Muslim planted by the enemy to destroy the country. Just think what bushies could exaggerate or make up during truth commissions. Washing our dirty laundry right now would not do anything except satisfy the far left and further inflame the bushies – it would not be good for the country.",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 17:41:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "xerello"
    },
    {
        "content": "Don't have a clue on Executive Order but some have been label national security reasons and still hold. Ask the Attorney General Holder. The shoes on the other foot now. Personally, I love to see it go to the precinct marshalls court all the way to the Supreme Court. Then, on my 100th birthday, 27 years in the future, Nancy with her Botox facial can raise her right hand and swear to tell the truth. Probably have a heart attack. Extreme events demand extreme actions. Something you probably haven't thought about because of your high moral BS keeps you from the dirty little world. The agents of God comes in many forms. I'm grateful that the CIA got the information before the terrorist killed more Americans. Dave, don't take offense. This happened over six years ago and I know how much you've enjoyed demoralizing the country, but I hope I never hear of it again. Most of the court proceedings the government was involved was created by defense lawyers raising questions on military procedures and habeas. A alot of stuff like, change of venue was frivolous. Now, the cross to bear, is on the new President. As the old one, he probably rather they just go away, I think 70 are Yemeni, sending them back to Yemen would be like recruiting for Al Qaeda. How do you advertise these guys. Slightly used mass murderers, good for another three or four thousand deaths?",
        "intTime": 20090508,
        "postID": 10,
        "quote": "",
        "reply": "Don't have a clue on Executive Order but some have been label national security reasons and still hold. Ask the Attorney General Holder. The shoes on the other foot now. Personally, I love to see it go to the precinct marshalls court all the way to the Supreme Court. Then, on my 100th birthday, 27 years in the future, Nancy with her Botox facial can raise her right hand and swear to tell the truth. Probably have a heart attack. Extreme events demand extreme actions. Something you probably haven't thought about because of your high moral BS keeps you from the dirty little world. The agents of God comes in many forms. I'm grateful that the CIA got the information before the terrorist killed more Americans. Dave, don't take offense. This happened over six years ago and I know how much you've enjoyed demoralizing the country, but I hope I never hear of it again. Most of the court proceedings the government was involved was created by defense lawyers raising questions on military procedures and habeas. A alot of stuff like, change of venue was frivolous. Now, the cross to bear, is on the new President. As the old one, he probably rather they just go away, I think 70 are Yemeni, sending them back to Yemen would be like recruiting for Al Qaeda. How do you advertise these guys. Slightly used mass murderers, good for another three or four thousand deaths?",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 17:46:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "rayevinsonsr"
    },
    {
        "content": "quote: Originally posted by xerello: Maybe in time there could be a truth commission. But in my opinion such a commission at this time would only help to divide the country further, when there needs to be reconciliation and President Obama already has at least two full plates to deal with. Look at what the bushies do to the smallest decision that President Obama makes. The President fired a guy that should be fired – they say he is being political. Then there are the lies that are made up by bushies – “President Obama apologized to the Europeans for America’s past behavior.” President Obama is going to take our guns.” And then there are still quite a few people who swear that President Obama is a Muslim planted by the enemy to destroy the country. Just think what bushies could exaggerate or make up during truth commissions. Washing our dirty laundry right now would not do anything except satisfy the far left and further inflame the bushies – it would not be good for the country. Hey, wait a cotton picking minute, I AM the far left and wanted them all to be wearing orange jump suits. But I've changed my mind for the very reasons you give. On the other hand a Truth Commision doesn't carry jail time with it. Certain questions if not finally and fully resolved are defacto precedents. Certain questions have to be answred so that I don't hear ten years down the road, that \"enhanced interogation\" just consisted of making men wear bra's around their heads. No matter WHAT Obama does, he's going to get unfair flack. Take Judge Bybee. This guys ready to admit that he did wrong. Look, there are things that happen that need more than sweeping under the rug. Until there is an admittance of guilt, there will be a large portion of Americans who will not acknowledge a damn thing. Having the perpetrators admit they were wrong, will cut this minority down to a fringe. Obama is wrong to try to curry favor with these people, and they will regard it (as they ALREADY are regarding it) as an admission that it was the right thing to do. Dave",
        "intTime": 20090508,
        "postID": 11,
        "quote": "Originally posted by xerello: Maybe in time there could be a truth commission. But in my opinion such a commission at this time would only help to divide the country further, when there needs to be reconciliation and President Obama already has at least two full plates to deal with. Look at what the bushies do to the smallest decision that President Obama makes. The President fired a guy that should be fired – they say he is being political. Then there are the lies that are made up by bushies – “President Obama apologized to the Europeans for America’s past behavior.” President Obama is going to take our guns.” And then there are still quite a few people who swear that President Obama is a Muslim planted by the enemy to destroy the country. Just think what bushies could exaggerate or make up during truth commissions. Washing our dirty laundry right now would not do anything except satisfy the far left and further inflame the bushies – it would not be good for the country.",
        "reply": " Hey, wait a cotton picking minute, I AM the far left and wanted them all to be wearing orange jump suits. But I've changed my mind for the very reasons you give. On the other hand a Truth Commision doesn't carry jail time with it. Certain questions if not finally and fully resolved are defacto precedents. Certain questions have to be answred so that I don't hear ten years down the road, that \"enhanced interogation\" just consisted of making men wear bra's around their heads. No matter WHAT Obama does, he's going to get unfair flack. Take Judge Bybee. This guys ready to admit that he did wrong. Look, there are things that happen that need more than sweeping under the rug. Until there is an admittance of guilt, there will be a large portion of Americans who will not acknowledge a damn thing. Having the perpetrators admit they were wrong, will cut this minority down to a fringe. Obama is wrong to try to curry favor with these people, and they will regard it (as they ALREADY are regarding it) as an admission that it was the right thing to do. Dave",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 17:50:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by rayevinsonsr: Don't have a clue on Executive Order but some have been label national security reasons and still hold. Ask the Attorney General Holder. The shoes on the other foot now. Personally, I love to see it go to the precinct marshalls court all the way to the Supreme Court. Then, on my 100th birthday, 27 years in the future, Nancy with her Botox facial can raise her right hand and swear to tell the truth. Probably have a heart attack. Extreme events demand extreme actions. Something you probably haven't thought about because of your high moral BS keeps you from the dirty little world. The agents of God comes in many forms. I'm grateful that the CIA got the information before the terrorist killed more Americans. Dave, don't take offense. This happened over six years ago and I know how much you've enjoyed demoralizing the country, but I hope I never hear of it again. Most of the court proceedings the government was involved was created by defense lawyers raising questions on military procedures and habeas. A alot of stuff like, change of venue was frivolous. Now, the cross to bear, is on the new President. As the old one, he probably rather they just go away, I think 70 are Yemeni, sending them back to Yemen would be like recruiting for Al Qaeda. How do you advertise these guys. Slightly used mass murderers, good for another three or four thousand deaths? Already past the future",
        "intTime": 20090508,
        "postID": 12,
        "quote": "Originally posted by rayevinsonsr: Don't have a clue on Executive Order but some have been label national security reasons and still hold. Ask the Attorney General Holder. The shoes on the other foot now. Personally, I love to see it go to the precinct marshalls court all the way to the Supreme Court. Then, on my 100th birthday, 27 years in the future, Nancy with her Botox facial can raise her right hand and swear to tell the truth. Probably have a heart attack. Extreme events demand extreme actions. Something you probably haven't thought about because of your high moral BS keeps you from the dirty little world. The agents of God comes in many forms. I'm grateful that the CIA got the information before the terrorist killed more Americans. Dave, don't take offense. This happened over six years ago and I know how much you've enjoyed demoralizing the country, but I hope I never hear of it again. Most of the court proceedings the government was involved was created by defense lawyers raising questions on military procedures and habeas. A alot of stuff like, change of venue was frivolous. Now, the cross to bear, is on the new President. As the old one, he probably rather they just go away, I think 70 are Yemeni, sending them back to Yemen would be like recruiting for Al Qaeda. How do you advertise these guys. Slightly used mass murderers, good for another three or four thousand deaths?",
        "reply": " Already past the future",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 19:30:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "6486143"
    },
    {
        "content": "This has been a sad moment in this great nation's history... Move on, yes... May it never happen again, let's hope... Respectfully, SUNLINER81",
        "intTime": 20090508,
        "postID": 13,
        "quote": "",
        "reply": "This has been a sad moment in this great nation's history... Move on, yes... May it never happen again, let's hope... Respectfully, SUNLINER81",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 19:47:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "SUNLINER81"
    },
    {
        "content": "quote: Originally posted by Grachus: Certain questions have to be answred so that I don't hear ten years down the road, that \"enhanced interogation\" just consisted of making men wear bra's around their heads. No matter WHAT Obama does, he's going to get unfair flack. Take Judge Bybee. This guys ready to admit that he did wrong. Look, there are things that happen that need more than sweeping under the rug. Until there is an admittance of guilt, there will be a large portion of Americans who will not acknowledge a damn thing. Having the perpetrators admit they were wrong, will cut this minority down to a fringe. Obama is wrong to try to curry favor with these people, and they will regard it (as they ALREADY are regarding it) as an admission that it was the right thing to do. Dave President Bush admitted that there no WMDs were ever found in Iraq. Right before leaving office, President Bush said: “You know, not having weapons of mass destruction [in Iraq] was a significant disappointment.” Jan 12, 2009 Commander in Chief Bush admitted that there were no weapons of mass destruction in Iraq. But more than 20 percent of adults in American believe that there were. Almost as many believe that the WMDs were sent to Syria, with no more evidence than that Rush told them so. A truth commission would not change the mind of someone like GlassOnion who recently posted on another thread: “As far as I’m concerned they could cut their freaking fingers, hands, toes, and feet, off – one at a time until they bled to death. They should have run closed circuit TVs into each cell with the volume up loud while their buddies were getting their new customized manicures… Personally, I think that would have curtailed many from joining up – but apparently giving them unemployment checks and food stamps with green cards is what Obama thinks will work… I hope he keeps them at HIS HOUSE – or maybe Pelosi could let them rent her place for a while…” A truth commission would allow some to twist the truth some more. President Bush has often said that history will be his judge. It will. He will forever be known as the President who allowed torture on his watch.",
        "intTime": 20090508,
        "postID": 14,
        "quote": "Originally posted by Grachus: Certain questions have to be answred so that I don't hear ten years down the road, that \"enhanced interogation\" just consisted of making men wear bra's around their heads. No matter WHAT Obama does, he's going to get unfair flack. Take Judge Bybee. This guys ready to admit that he did wrong. Look, there are things that happen that need more than sweeping under the rug. Until there is an admittance of guilt, there will be a large portion of Americans who will not acknowledge a damn thing. Having the perpetrators admit they were wrong, will cut this minority down to a fringe. Obama is wrong to try to curry favor with these people, and they will regard it (as they ALREADY are regarding it) as an admission that it was the right thing to do. Dave",
        "reply": " President Bush admitted that there no WMDs were ever found in Iraq. Right before leaving office, President Bush said: “You know, not having weapons of mass destruction [in Iraq] was a significant disappointment.” Jan 12, 2009 Commander in Chief Bush admitted that there were no weapons of mass destruction in Iraq. But more than 20 percent of adults in American believe that there were. Almost as many believe that the WMDs were sent to Syria, with no more evidence than that Rush told them so. A truth commission would not change the mind of someone like GlassOnion who recently posted on another thread: “As far as I’m concerned they could cut their freaking fingers, hands, toes, and feet, off – one at a time until they bled to death. They should have run closed circuit TVs into each cell with the volume up loud while their buddies were getting their new customized manicures… Personally, I think that would have curtailed many from joining up – but apparently giving them unemployment checks and food stamps with green cards is what Obama thinks will work… I hope he keeps them at HIS HOUSE – or maybe Pelosi could let them rent her place for a while…” A truth commission would allow some to twist the truth some more. President Bush has often said that history will be his judge. It will. He will forever be known as the President who allowed torture on his watch.",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 23:26:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "xerello"
    },
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by Grachus: Certain questions have to be answred so that I don't hear ten years down the road, that \"enhanced interogation\" just consisted of making men wear bra's around their heads. No matter WHAT Obama does, he's going to get unfair flack. Take Judge Bybee. This guys ready to admit that he did wrong. Look, there are things that happen that need more than sweeping under the rug. Until there is an admittance of guilt, there will be a large portion of Americans who will not acknowledge a damn thing. Having the perpetrators admit they were wrong, will cut this minority down to a fringe. Obama is wrong to try to curry favor with these people, and they will regard it (as they ALREADY are regarding it) as an admission that it was the right thing to do. Dave President Bush admitted that there no WMDs were ever found in Iraq. Right before leaving office, President Bush said: “You know, not having weapons of mass destruction [in Iraq] was a significant disappointment.” Jan 12, 2009 Commander in Chief Bush admitted that there were no weapons of mass destruction in Iraq. But more than 20 percent of adults in American believe that there were. Almost as many believe that the WMDs were sent to Syria, with no more evidence than that Rush told them so. A truth commission would not change the mind of someone like GlassOnion who recently posted on another thread: “As far as I’m concerned they could cut their freaking fingers, hands, toes, and feet, off – one at a time until they bled to death. They should have run closed circuit TVs into each cell with the volume up loud while their buddies were getting their new customized manicures… Personally, I think that would have curtailed many from joining up – but apparently giving them unemployment checks and food stamps with green cards is what Obama thinks will work… I hope he keeps them at HIS HOUSE – or maybe Pelosi could let them rent her place for a while…” A truth commission would allow some to twist the truth some more. President Bush has often said that history will be his judge. It will. He will forever be known as the President who allowed torture on his watch. Naw, I think President Bush will be known for keeping America safe and the only reason this witch hunt stopped is because of our illustrious SOTH Pelosi. She doesn't want to answer any questions on what she knew.",
        "intTime": 20090509,
        "postID": 15,
        "quote": "Originally posted by xerello: quote: Originally posted by Grachus: Certain questions have to be answred so that I don't hear ten years down the road, that \"enhanced interogation\" just consisted of making men wear bra's around their heads. No matter WHAT Obama does, he's going to get unfair flack. Take Judge Bybee. This guys ready to admit that he did wrong. Look, there are things that happen that need more than sweeping under the rug. Until there is an admittance of guilt, there will be a large portion of Americans who will not acknowledge a damn thing. Having the perpetrators admit they were wrong, will cut this minority down to a fringe. Obama is wrong to try to curry favor with these people, and they will regard it (as they ALREADY are regarding it) as an admission that it was the right thing to do. Dave President Bush admitted that there no WMDs were ever found in Iraq. Right before leaving office, President Bush said: “You know, not having weapons of mass destruction [in Iraq] was a significant disappointment.” Jan 12, 2009 Commander in Chief Bush admitted that there were no weapons of mass destruction in Iraq. But more than 20 percent of adults in American believe that there were. Almost as many believe that the WMDs were sent to Syria, with no more evidence than that Rush told them so. A truth commission would not change the mind of someone like GlassOnion who recently posted on another thread: “As far as I’m concerned they could cut their freaking fingers, hands, toes, and feet, off – one at a time until they bled to death. They should have run closed circuit TVs into each cell with the volume up loud while their buddies were getting their new customized manicures… Personally, I think that would have curtailed many from joining up – but apparently giving them unemployment checks and food stamps with green cards is what Obama thinks will work… I hope he keeps them at HIS HOUSE – or maybe Pelosi could let them rent her place for a while…” A truth commission would allow some to twist the truth some more. President Bush has often said that history will be his judge. It will. He will forever be known as the President who allowed torture on his watch.",
        "reply": " Naw, I think President Bush will be known for keeping America safe and the only reason this witch hunt stopped is because of our illustrious SOTH Pelosi. She doesn't want to answer any questions on what she knew.",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-09 03:02:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "dhd123"
    },
    {
        "content": "quote: Originally posted by dhd123: quote: Originally posted by xerello: quote: Originally posted by Grachus: Certain questions have to be answred so that I don't hear ten years down the road, that \"enhanced interogation\" just consisted of making men wear bra's around their heads. No matter WHAT Obama does, he's going to get unfair flack. Take Judge Bybee. This guys ready to admit that he did wrong. Look, there are things that happen that need more than sweeping under the rug. Until there is an admittance of guilt, there will be a large portion of Americans who will not acknowledge a damn thing. Having the perpetrators admit they were wrong, will cut this minority down to a fringe. Obama is wrong to try to curry favor with these people, and they will regard it (as they ALREADY are regarding it) as an admission that it was the right thing to do. Dave President Bush admitted that there no WMDs were ever found in Iraq. Right before leaving office, President Bush said: “You know, not having weapons of mass destruction [in Iraq] was a significant disappointment.” Jan 12, 2009 Commander in Chief Bush admitted that there were no weapons of mass destruction in Iraq. But more than 20 percent of adults in American believe that there were. Almost as many believe that the WMDs were sent to Syria, with no more evidence than that Rush told them so. A truth commission would not change the mind of someone like GlassOnion who recently posted on another thread: “As far as I’m concerned they could cut their freaking fingers, hands, toes, and feet, off – one at a time until they bled to death. They should have run closed circuit TVs into each cell with the volume up loud while their buddies were getting their new customized manicures… Personally, I think that would have curtailed many from joining up – but apparently giving them unemployment checks and food stamps with green cards is what Obama thinks will work… I hope he keeps them at HIS HOUSE – or maybe Pelosi could let them rent her place for a while…” A truth commission would allow some to twist the truth some more. President Bush has often said that history will be his judge. It will. He will forever be known as the President who allowed torture on his watch. Naw, I think President Bush will be known for keeping America safe and the only reason this witch hunt stopped is because of our illustrious SOTH Pelosi. She doesn't want to answer any questions on what she knew. Already past the future",
        "intTime": 20090509,
        "postID": 16,
        "quote": "Originally posted by dhd123: quote: Originally posted by xerello: quote: Originally posted by Grachus: Certain questions have to be answred so that I don't hear ten years down the road, that \"enhanced interogation\" just consisted of making men wear bra's around their heads. No matter WHAT Obama does, he's going to get unfair flack. Take Judge Bybee. This guys ready to admit that he did wrong. Look, there are things that happen that need more than sweeping under the rug. Until there is an admittance of guilt, there will be a large portion of Americans who will not acknowledge a damn thing. Having the perpetrators admit they were wrong, will cut this minority down to a fringe. Obama is wrong to try to curry favor with these people, and they will regard it (as they ALREADY are regarding it) as an admission that it was the right thing to do. Dave President Bush admitted that there no WMDs were ever found in Iraq. Right before leaving office, President Bush said: “You know, not having weapons of mass destruction [in Iraq] was a significant disappointment.” Jan 12, 2009 Commander in Chief Bush admitted that there were no weapons of mass destruction in Iraq. But more than 20 percent of adults in American believe that there were. Almost as many believe that the WMDs were sent to Syria, with no more evidence than that Rush told them so. A truth commission would not change the mind of someone like GlassOnion who recently posted on another thread: “As far as I’m concerned they could cut their freaking fingers, hands, toes, and feet, off – one at a time until they bled to death. They should have run closed circuit TVs into each cell with the volume up loud while their buddies were getting their new customized manicures… Personally, I think that would have curtailed many from joining up – but apparently giving them unemployment checks and food stamps with green cards is what Obama thinks will work… I hope he keeps them at HIS HOUSE – or maybe Pelosi could let them rent her place for a while…” A truth commission would allow some to twist the truth some more. President Bush has often said that history will be his judge. It will. He will forever be known as the President who allowed torture on his watch. Naw, I think President Bush will be known for keeping America safe and the only reason this witch hunt stopped is because of our illustrious SOTH Pelosi. She doesn't want to answer any questions on what she knew.",
        "reply": " Already past the future",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-09 03:05:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "6486143"
    },
    {
        "content": "Sorry, but I don't get this \"It's in the past, let's move on\" garbage. All crimes happen in the past...",
        "intTime": 20090509,
        "postID": 17,
        "quote": "",
        "reply": "Sorry, but I don't get this \"It's in the past, let's move on\" garbage. All crimes happen in the past...",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-09 05:30:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "SeaWitch1220"
    },
    {
        "content": "quote: Originally posted by xerello: President Bush admitted that there no WMDs were ever found in Iraq. Right before leaving office, President Bush said: “You know, not having weapons of mass destruction [in Iraq] was a significant disappointment.” Jan 12, 2009 Commander in Chief Bush admitted that there were no weapons of mass destruction in Iraq. But more than 20 percent of adults in American believe that there were. Almost as many believe that the WMDs were sent to Syria, with no more evidence than that Rush told them so. A truth commission would not change the mind of someone like GlassOnion who recently posted on another thread: “As far as I’m concerned they could cut their freaking fingers, hands, toes, and feet, off – one at a time until they bled to death. They should have run closed circuit TVs into each cell with the volume up loud while their buddies were getting their new customized manicures… Personally, I think that would have curtailed many from joining up – but apparently giving them unemployment checks and food stamps with green cards is what Obama thinks will work… I hope he keeps them at HIS HOUSE – or maybe Pelosi could let them rent her place for a while…” A truth commission would allow some to twist the truth some more. President Bush has often said that history will be his judge. It will. He will forever be known as the President who allowed torture on his watch. Well, you know the famous Lincoln aphorsim about fooling the people - Some of them can be fooled, \"all of the time.\" But the only way you can fool \"all of the people\" is by making believe it never happened. Dave",
        "intTime": 20090509,
        "postID": 18,
        "quote": "Originally posted by xerello: President Bush admitted that there no WMDs were ever found in Iraq. Right before leaving office, President Bush said: “You know, not having weapons of mass destruction [in Iraq] was a significant disappointment.” Jan 12, 2009 Commander in Chief Bush admitted that there were no weapons of mass destruction in Iraq. But more than 20 percent of adults in American believe that there were. Almost as many believe that the WMDs were sent to Syria, with no more evidence than that Rush told them so. A truth commission would not change the mind of someone like GlassOnion who recently posted on another thread: “As far as I’m concerned they could cut their freaking fingers, hands, toes, and feet, off – one at a time until they bled to death. They should have run closed circuit TVs into each cell with the volume up loud while their buddies were getting their new customized manicures… Personally, I think that would have curtailed many from joining up – but apparently giving them unemployment checks and food stamps with green cards is what Obama thinks will work… I hope he keeps them at HIS HOUSE – or maybe Pelosi could let them rent her place for a while…” A truth commission would allow some to twist the truth some more. President Bush has often said that history will be his judge. It will. He will forever be known as the President who allowed torture on his watch.",
        "reply": " Well, you know the famous Lincoln aphorsim about fooling the people - Some of them can be fooled, \"all of the time.\" But the only way you can fool \"all of the people\" is by making believe it never happened. Dave",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-09 09:10:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Elesso: quote: Originally posted by LineDoggie: By Executive Order he could stop the release of the images, he does have that authority as President. but, what if the press demands their rights under the Freedom of Information Act? this is going to get uglyer before it gets any better. someone needs to be scapegoated. who will it be? rummy? Gonzo? Condi? Georgie? bet it is not Dicky boy... he is safe in the Caymans... They were requested under the FIA, and yes President Obama does have the right to stop them from being made public. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090509,
        "postID": 19,
        "quote": "Originally posted by Elesso: quote: Originally posted by LineDoggie: By Executive Order he could stop the release of the images, he does have that authority as President. but, what if the press demands their rights under the Freedom of Information Act? this is going to get uglyer before it gets any better. someone needs to be scapegoated. who will it be? rummy? Gonzo? Condi? Georgie? bet it is not Dicky boy... he is safe in the Caymans...",
        "reply": " They were requested under the FIA, and yes President Obama does have the right to stop them from being made public. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-09 09:14:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "L0A1"
    },
    {
        "content": "From the New York Daily News “Sanity prevails as Justice Department staffers reportedly are recommending against prosecution of Bush administration officials who articulated the legal framework for tough interrogations of terror suspects. “President Obama has ruled out prosecuting the CIA agents who conducted the interrogations, and no one is talking about hauling top decision makers, such as President Bush and former Attorney General Alberto Gonzales, into the dock.” While there may be some Congressional investigations of how the law was tortured to allow torture, no one will go to jail over that decision. Under the law, as long as everyone, from the CinC on down was following the Office of Legal Counsel’s interpretation of the law, no law was broken. These interpretations were later found by the courts to be wrong, but until those court decisions, they were not illegal. Comment: I agree with President Obama that this dark chapter of American history is best passed by, the sooner the better. Prosecutions and open hearings will distract from what needs to be done and accomplish nothing that has not already been accomplished. The policies of torture and secret prisons instituted by the Bush Administration have been repudiated. It would be almost impossible for future presidents to bring them back. Let’s move on.",
        "intTime": 20090508,
        "postID": 20,
        "quote": "",
        "reply": "From the New York Daily News “Sanity prevails as Justice Department staffers reportedly are recommending against prosecution of Bush administration officials who articulated the legal framework for tough interrogations of terror suspects. “President Obama has ruled out prosecuting the CIA agents who conducted the interrogations, and no one is talking about hauling top decision makers, such as President Bush and former Attorney General Alberto Gonzales, into the dock.” While there may be some Congressional investigations of how the law was tortured to allow torture, no one will go to jail over that decision. Under the law, as long as everyone, from the CinC on down was following the Office of Legal Counsel’s interpretation of the law, no law was broken. These interpretations were later found by the courts to be wrong, but until those court decisions, they were not illegal. Comment: I agree with President Obama that this dark chapter of American history is best passed by, the sooner the better. Prosecutions and open hearings will distract from what needs to be done and accomplish nothing that has not already been accomplished. The policies of torture and secret prisons instituted by the Bush Administration have been repudiated. It would be almost impossible for future presidents to bring them back. Let’s move on.",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 11:50:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "xerello"
    },
    {
        "content": "This is sad. I was hoping they would go all the way. Just to prove the innocence. But slander is the name of the game. Political hacking",
        "intTime": 20090508,
        "postID": 21,
        "quote": "",
        "reply": "This is sad. I was hoping they would go all the way. Just to prove the innocence. But slander is the name of the game. Political hacking",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 14:26:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "ACR26"
    },
    {
        "content": "quote: Originally posted by xerello: The policies of torture and secret prisons instituted by the Bush Administration have been repudiated. It would be almost impossible for future presidents to bring them back. Let’s move on. While I agree that prosecutions are a poor idea, a Truth Commision modeled on South Africa's would have been the best solution. I disagree that it would be \"almost impossible\" to do this again. Only public scrutiny, that such a commision could provide, would once and for all bring this into the open. Dave",
        "intTime": 20090508,
        "postID": 22,
        "quote": "Originally posted by xerello: The policies of torture and secret prisons instituted by the Bush Administration have been repudiated. It would be almost impossible for future presidents to bring them back. Let’s move on.",
        "reply": " While I agree that prosecutions are a poor idea, a Truth Commision modeled on South Africa's would have been the best solution. I disagree that it would be \"almost impossible\" to do this again. Only public scrutiny, that such a commision could provide, would once and for all bring this into the open. Dave",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 14:31:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by klassylady25: Now let's see if they'll take the next step and NOT release the pictures. There is a Appeals Court order to release the pictures. No the Obama Administration cannot appeal to the Supreme Court because there is no basis for appeal. What would you have them do - decree that they are not going to release the photos?",
        "intTime": 20090508,
        "postID": 23,
        "quote": "Originally posted by klassylady25: Now let's see if they'll take the next step and NOT release the pictures.",
        "reply": " There is a Appeals Court order to release the pictures. No the Obama Administration cannot appeal to the Supreme Court because there is no basis for appeal. What would you have them do - decree that they are not going to release the photos?",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 14:45:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "xerello"
    },
    {
        "content": "By Executive Order he could stop the release of the images, he does have that authority as President.",
        "intTime": 20090508,
        "postID": 24,
        "quote": "",
        "reply": "By Executive Order he could stop the release of the images, he does have that authority as President.",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 15:30:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "LineDoggie"
    },
    {
        "content": "quote: Originally posted by LineDoggie: By Executive Order he could stop the release of the images, he does have that authority as President. but, what if the press demands their rights under the Freedom of Information Act? this is going to get uglyer before it gets any better. someone needs to be scapegoated. who will it be? rummy? Gonzo? Condi? Georgie? bet it is not Dicky boy... he is safe in the Caymans...",
        "intTime": 20090508,
        "postID": 25,
        "quote": "Originally posted by LineDoggie: By Executive Order he could stop the release of the images, he does have that authority as President.",
        "reply": " but, what if the press demands their rights under the Freedom of Information Act? this is going to get uglyer before it gets any better. someone needs to be scapegoated. who will it be? rummy? Gonzo? Condi? Georgie? bet it is not Dicky boy... he is safe in the Caymans...",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 15:35:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "Elesso"
    },
    {
        "content": "quote: Originally posted by LineDoggie: By Executive Order he could stop the release of the images, he does have that authority as President. President Bush tried that. He did not mind ruling by decree - or Executive Order. But the court case has been going on since 2004. The Bush Administration lost every appeal and delayed as much as they could. It would be illegal not to release the photos. I do realize that those facts will not stop bushies from saying that the Obama Administration released the photos because they want to destroy America.",
        "intTime": 20090508,
        "postID": 26,
        "quote": "Originally posted by LineDoggie: By Executive Order he could stop the release of the images, he does have that authority as President.",
        "reply": " President Bush tried that. He did not mind ruling by decree - or Executive Order. But the court case has been going on since 2004. The Bush Administration lost every appeal and delayed as much as they could. It would be illegal not to release the photos. I do realize that those facts will not stop bushies from saying that the Obama Administration released the photos because they want to destroy America.",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 15:43:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "xerello"
    },
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by LineDoggie: By Executive Order he could stop the release of the images, he does have that authority as President. President Bush tried that. He did not mind ruling by decree - or Executive Order. But the court case has been going on since 2004. The Bush Administration lost every appeal and delayed as much as they could. It would be illegal not to release the photos. I do realize that those facts will not stop bushies from saying that the Obama Administration released the photos because they want to destroy America. Yeah, they tried to run that \"Executive Order\" crap through the Courts and lost on every appeal. Now all of a sudden they want Obama to be a damned dictator while screaming bloody murder that he IS a dictator. Dave",
        "intTime": 20090508,
        "postID": 27,
        "quote": "Originally posted by xerello: quote: Originally posted by LineDoggie: By Executive Order he could stop the release of the images, he does have that authority as President. President Bush tried that. He did not mind ruling by decree - or Executive Order. But the court case has been going on since 2004. The Bush Administration lost every appeal and delayed as much as they could. It would be illegal not to release the photos. I do realize that those facts will not stop bushies from saying that the Obama Administration released the photos because they want to destroy America.",
        "reply": " Yeah, they tried to run that \"Executive Order\" crap through the Courts and lost on every appeal. Now all of a sudden they want Obama to be a damned dictator while screaming bloody murder that he IS a dictator. Dave",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 16:35:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by xerello: The policies of torture and secret prisons instituted by the Bush Administration have been repudiated. It would be almost impossible for future presidents to bring them back. Let’s move on. While I agree that prosecutions are a poor idea, a Truth Commision modeled on South Africa's would have been the best solution. I disagree that it would be \"almost impossible\" to do this again. Only public scrutiny, that such a commision could provide, would once and for all bring this into the open. Dave Maybe in time there could be a truth commission. But in my opinion such a commission at this time would only help to divide the country further, when there needs to be reconciliation and President Obama already has at least two full plates to deal with. Look at what the bushies do to the smallest decision that President Obama makes. The President fired a guy that should be fired – they say he is being political. Then there are the lies that are made up by bushies – “President Obama apologized to the Europeans for America’s past behavior.” President Obama is going to take our guns.” And then there are still quite a few people who swear that President Obama is a Muslim planted by the enemy to destroy the country. Just think what bushies could exaggerate or make up during truth commissions. Washing our dirty laundry right now would not do anything except satisfy the far left and further inflame the bushies – it would not be good for the country.",
        "intTime": 20090508,
        "postID": 28,
        "quote": "Originally posted by Grachus: quote: Originally posted by xerello: The policies of torture and secret prisons instituted by the Bush Administration have been repudiated. It would be almost impossible for future presidents to bring them back. Let’s move on. While I agree that prosecutions are a poor idea, a Truth Commision modeled on South Africa's would have been the best solution. I disagree that it would be \"almost impossible\" to do this again. Only public scrutiny, that such a commision could provide, would once and for all bring this into the open. Dave",
        "reply": " Maybe in time there could be a truth commission. But in my opinion such a commission at this time would only help to divide the country further, when there needs to be reconciliation and President Obama already has at least two full plates to deal with. Look at what the bushies do to the smallest decision that President Obama makes. The President fired a guy that should be fired – they say he is being political. Then there are the lies that are made up by bushies – “President Obama apologized to the Europeans for America’s past behavior.” President Obama is going to take our guns.” And then there are still quite a few people who swear that President Obama is a Muslim planted by the enemy to destroy the country. Just think what bushies could exaggerate or make up during truth commissions. Washing our dirty laundry right now would not do anything except satisfy the far left and further inflame the bushies – it would not be good for the country.",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 17:41:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "xerello"
    },
    {
        "content": "Don't have a clue on Executive Order but some have been label national security reasons and still hold. Ask the Attorney General Holder. The shoes on the other foot now. Personally, I love to see it go to the precinct marshalls court all the way to the Supreme Court. Then, on my 100th birthday, 27 years in the future, Nancy with her Botox facial can raise her right hand and swear to tell the truth. Probably have a heart attack. Extreme events demand extreme actions. Something you probably haven't thought about because of your high moral BS keeps you from the dirty little world. The agents of God comes in many forms. I'm grateful that the CIA got the information before the terrorist killed more Americans. Dave, don't take offense. This happened over six years ago and I know how much you've enjoyed demoralizing the country, but I hope I never hear of it again. Most of the court proceedings the government was involved was created by defense lawyers raising questions on military procedures and habeas. A alot of stuff like, change of venue was frivolous. Now, the cross to bear, is on the new President. As the old one, he probably rather they just go away, I think 70 are Yemeni, sending them back to Yemen would be like recruiting for Al Qaeda. How do you advertise these guys. Slightly used mass murderers, good for another three or four thousand deaths?",
        "intTime": 20090508,
        "postID": 29,
        "quote": "",
        "reply": "Don't have a clue on Executive Order but some have been label national security reasons and still hold. Ask the Attorney General Holder. The shoes on the other foot now. Personally, I love to see it go to the precinct marshalls court all the way to the Supreme Court. Then, on my 100th birthday, 27 years in the future, Nancy with her Botox facial can raise her right hand and swear to tell the truth. Probably have a heart attack. Extreme events demand extreme actions. Something you probably haven't thought about because of your high moral BS keeps you from the dirty little world. The agents of God comes in many forms. I'm grateful that the CIA got the information before the terrorist killed more Americans. Dave, don't take offense. This happened over six years ago and I know how much you've enjoyed demoralizing the country, but I hope I never hear of it again. Most of the court proceedings the government was involved was created by defense lawyers raising questions on military procedures and habeas. A alot of stuff like, change of venue was frivolous. Now, the cross to bear, is on the new President. As the old one, he probably rather they just go away, I think 70 are Yemeni, sending them back to Yemen would be like recruiting for Al Qaeda. How do you advertise these guys. Slightly used mass murderers, good for another three or four thousand deaths?",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 17:46:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "rayevinsonsr"
    },
    {
        "content": "quote: Originally posted by xerello: Maybe in time there could be a truth commission. But in my opinion such a commission at this time would only help to divide the country further, when there needs to be reconciliation and President Obama already has at least two full plates to deal with. Look at what the bushies do to the smallest decision that President Obama makes. The President fired a guy that should be fired – they say he is being political. Then there are the lies that are made up by bushies – “President Obama apologized to the Europeans for America’s past behavior.” President Obama is going to take our guns.” And then there are still quite a few people who swear that President Obama is a Muslim planted by the enemy to destroy the country. Just think what bushies could exaggerate or make up during truth commissions. Washing our dirty laundry right now would not do anything except satisfy the far left and further inflame the bushies – it would not be good for the country. Hey, wait a cotton picking minute, I AM the far left and wanted them all to be wearing orange jump suits. But I've changed my mind for the very reasons you give. On the other hand a Truth Commision doesn't carry jail time with it. Certain questions if not finally and fully resolved are defacto precedents. Certain questions have to be answred so that I don't hear ten years down the road, that \"enhanced interogation\" just consisted of making men wear bra's around their heads. No matter WHAT Obama does, he's going to get unfair flack. Take Judge Bybee. This guys ready to admit that he did wrong. Look, there are things that happen that need more than sweeping under the rug. Until there is an admittance of guilt, there will be a large portion of Americans who will not acknowledge a damn thing. Having the perpetrators admit they were wrong, will cut this minority down to a fringe. Obama is wrong to try to curry favor with these people, and they will regard it (as they ALREADY are regarding it) as an admission that it was the right thing to do. Dave",
        "intTime": 20090508,
        "postID": 30,
        "quote": "Originally posted by xerello: Maybe in time there could be a truth commission. But in my opinion such a commission at this time would only help to divide the country further, when there needs to be reconciliation and President Obama already has at least two full plates to deal with. Look at what the bushies do to the smallest decision that President Obama makes. The President fired a guy that should be fired – they say he is being political. Then there are the lies that are made up by bushies – “President Obama apologized to the Europeans for America’s past behavior.” President Obama is going to take our guns.” And then there are still quite a few people who swear that President Obama is a Muslim planted by the enemy to destroy the country. Just think what bushies could exaggerate or make up during truth commissions. Washing our dirty laundry right now would not do anything except satisfy the far left and further inflame the bushies – it would not be good for the country.",
        "reply": " Hey, wait a cotton picking minute, I AM the far left and wanted them all to be wearing orange jump suits. But I've changed my mind for the very reasons you give. On the other hand a Truth Commision doesn't carry jail time with it. Certain questions if not finally and fully resolved are defacto precedents. Certain questions have to be answred so that I don't hear ten years down the road, that \"enhanced interogation\" just consisted of making men wear bra's around their heads. No matter WHAT Obama does, he's going to get unfair flack. Take Judge Bybee. This guys ready to admit that he did wrong. Look, there are things that happen that need more than sweeping under the rug. Until there is an admittance of guilt, there will be a large portion of Americans who will not acknowledge a damn thing. Having the perpetrators admit they were wrong, will cut this minority down to a fringe. Obama is wrong to try to curry favor with these people, and they will regard it (as they ALREADY are regarding it) as an admission that it was the right thing to do. Dave",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 17:50:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by rayevinsonsr: Don't have a clue on Executive Order but some have been label national security reasons and still hold. Ask the Attorney General Holder. The shoes on the other foot now. Personally, I love to see it go to the precinct marshalls court all the way to the Supreme Court. Then, on my 100th birthday, 27 years in the future, Nancy with her Botox facial can raise her right hand and swear to tell the truth. Probably have a heart attack. Extreme events demand extreme actions. Something you probably haven't thought about because of your high moral BS keeps you from the dirty little world. The agents of God comes in many forms. I'm grateful that the CIA got the information before the terrorist killed more Americans. Dave, don't take offense. This happened over six years ago and I know how much you've enjoyed demoralizing the country, but I hope I never hear of it again. Most of the court proceedings the government was involved was created by defense lawyers raising questions on military procedures and habeas. A alot of stuff like, change of venue was frivolous. Now, the cross to bear, is on the new President. As the old one, he probably rather they just go away, I think 70 are Yemeni, sending them back to Yemen would be like recruiting for Al Qaeda. How do you advertise these guys. Slightly used mass murderers, good for another three or four thousand deaths? Already past the future",
        "intTime": 20090508,
        "postID": 31,
        "quote": "Originally posted by rayevinsonsr: Don't have a clue on Executive Order but some have been label national security reasons and still hold. Ask the Attorney General Holder. The shoes on the other foot now. Personally, I love to see it go to the precinct marshalls court all the way to the Supreme Court. Then, on my 100th birthday, 27 years in the future, Nancy with her Botox facial can raise her right hand and swear to tell the truth. Probably have a heart attack. Extreme events demand extreme actions. Something you probably haven't thought about because of your high moral BS keeps you from the dirty little world. The agents of God comes in many forms. I'm grateful that the CIA got the information before the terrorist killed more Americans. Dave, don't take offense. This happened over six years ago and I know how much you've enjoyed demoralizing the country, but I hope I never hear of it again. Most of the court proceedings the government was involved was created by defense lawyers raising questions on military procedures and habeas. A alot of stuff like, change of venue was frivolous. Now, the cross to bear, is on the new President. As the old one, he probably rather they just go away, I think 70 are Yemeni, sending them back to Yemen would be like recruiting for Al Qaeda. How do you advertise these guys. Slightly used mass murderers, good for another three or four thousand deaths?",
        "reply": " Already past the future",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 19:30:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "6486143"
    },
    {
        "content": "This has been a sad moment in this great nation's history... Move on, yes... May it never happen again, let's hope... Respectfully, SUNLINER81",
        "intTime": 20090508,
        "postID": 32,
        "quote": "",
        "reply": "This has been a sad moment in this great nation's history... Move on, yes... May it never happen again, let's hope... Respectfully, SUNLINER81",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 19:47:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "SUNLINER81"
    },
    {
        "content": "quote: Originally posted by Grachus: Certain questions have to be answred so that I don't hear ten years down the road, that \"enhanced interogation\" just consisted of making men wear bra's around their heads. No matter WHAT Obama does, he's going to get unfair flack. Take Judge Bybee. This guys ready to admit that he did wrong. Look, there are things that happen that need more than sweeping under the rug. Until there is an admittance of guilt, there will be a large portion of Americans who will not acknowledge a damn thing. Having the perpetrators admit they were wrong, will cut this minority down to a fringe. Obama is wrong to try to curry favor with these people, and they will regard it (as they ALREADY are regarding it) as an admission that it was the right thing to do. Dave President Bush admitted that there no WMDs were ever found in Iraq. Right before leaving office, President Bush said: “You know, not having weapons of mass destruction [in Iraq] was a significant disappointment.” Jan 12, 2009 Commander in Chief Bush admitted that there were no weapons of mass destruction in Iraq. But more than 20 percent of adults in American believe that there were. Almost as many believe that the WMDs were sent to Syria, with no more evidence than that Rush told them so. A truth commission would not change the mind of someone like GlassOnion who recently posted on another thread: “As far as I’m concerned they could cut their freaking fingers, hands, toes, and feet, off – one at a time until they bled to death. They should have run closed circuit TVs into each cell with the volume up loud while their buddies were getting their new customized manicures… Personally, I think that would have curtailed many from joining up – but apparently giving them unemployment checks and food stamps with green cards is what Obama thinks will work… I hope he keeps them at HIS HOUSE – or maybe Pelosi could let them rent her place for a while…” A truth commission would allow some to twist the truth some more. President Bush has often said that history will be his judge. It will. He will forever be known as the President who allowed torture on his watch.",
        "intTime": 20090508,
        "postID": 33,
        "quote": "Originally posted by Grachus: Certain questions have to be answred so that I don't hear ten years down the road, that \"enhanced interogation\" just consisted of making men wear bra's around their heads. No matter WHAT Obama does, he's going to get unfair flack. Take Judge Bybee. This guys ready to admit that he did wrong. Look, there are things that happen that need more than sweeping under the rug. Until there is an admittance of guilt, there will be a large portion of Americans who will not acknowledge a damn thing. Having the perpetrators admit they were wrong, will cut this minority down to a fringe. Obama is wrong to try to curry favor with these people, and they will regard it (as they ALREADY are regarding it) as an admission that it was the right thing to do. Dave",
        "reply": " President Bush admitted that there no WMDs were ever found in Iraq. Right before leaving office, President Bush said: “You know, not having weapons of mass destruction [in Iraq] was a significant disappointment.” Jan 12, 2009 Commander in Chief Bush admitted that there were no weapons of mass destruction in Iraq. But more than 20 percent of adults in American believe that there were. Almost as many believe that the WMDs were sent to Syria, with no more evidence than that Rush told them so. A truth commission would not change the mind of someone like GlassOnion who recently posted on another thread: “As far as I’m concerned they could cut their freaking fingers, hands, toes, and feet, off – one at a time until they bled to death. They should have run closed circuit TVs into each cell with the volume up loud while their buddies were getting their new customized manicures… Personally, I think that would have curtailed many from joining up – but apparently giving them unemployment checks and food stamps with green cards is what Obama thinks will work… I hope he keeps them at HIS HOUSE – or maybe Pelosi could let them rent her place for a while…” A truth commission would allow some to twist the truth some more. President Bush has often said that history will be his judge. It will. He will forever be known as the President who allowed torture on his watch.",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-08 23:26:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "xerello"
    },
    {
        "content": "quote: Originally posted by xerello: quote: Originally posted by Grachus: Certain questions have to be answred so that I don't hear ten years down the road, that \"enhanced interogation\" just consisted of making men wear bra's around their heads. No matter WHAT Obama does, he's going to get unfair flack. Take Judge Bybee. This guys ready to admit that he did wrong. Look, there are things that happen that need more than sweeping under the rug. Until there is an admittance of guilt, there will be a large portion of Americans who will not acknowledge a damn thing. Having the perpetrators admit they were wrong, will cut this minority down to a fringe. Obama is wrong to try to curry favor with these people, and they will regard it (as they ALREADY are regarding it) as an admission that it was the right thing to do. Dave President Bush admitted that there no WMDs were ever found in Iraq. Right before leaving office, President Bush said: “You know, not having weapons of mass destruction [in Iraq] was a significant disappointment.” Jan 12, 2009 Commander in Chief Bush admitted that there were no weapons of mass destruction in Iraq. But more than 20 percent of adults in American believe that there were. Almost as many believe that the WMDs were sent to Syria, with no more evidence than that Rush told them so. A truth commission would not change the mind of someone like GlassOnion who recently posted on another thread: “As far as I’m concerned they could cut their freaking fingers, hands, toes, and feet, off – one at a time until they bled to death. They should have run closed circuit TVs into each cell with the volume up loud while their buddies were getting their new customized manicures… Personally, I think that would have curtailed many from joining up – but apparently giving them unemployment checks and food stamps with green cards is what Obama thinks will work… I hope he keeps them at HIS HOUSE – or maybe Pelosi could let them rent her place for a while…” A truth commission would allow some to twist the truth some more. President Bush has often said that history will be his judge. It will. He will forever be known as the President who allowed torture on his watch. Naw, I think President Bush will be known for keeping America safe and the only reason this witch hunt stopped is because of our illustrious SOTH Pelosi. She doesn't want to answer any questions on what she knew.",
        "intTime": 20090509,
        "postID": 34,
        "quote": "Originally posted by xerello: quote: Originally posted by Grachus: Certain questions have to be answred so that I don't hear ten years down the road, that \"enhanced interogation\" just consisted of making men wear bra's around their heads. No matter WHAT Obama does, he's going to get unfair flack. Take Judge Bybee. This guys ready to admit that he did wrong. Look, there are things that happen that need more than sweeping under the rug. Until there is an admittance of guilt, there will be a large portion of Americans who will not acknowledge a damn thing. Having the perpetrators admit they were wrong, will cut this minority down to a fringe. Obama is wrong to try to curry favor with these people, and they will regard it (as they ALREADY are regarding it) as an admission that it was the right thing to do. Dave President Bush admitted that there no WMDs were ever found in Iraq. Right before leaving office, President Bush said: “You know, not having weapons of mass destruction [in Iraq] was a significant disappointment.” Jan 12, 2009 Commander in Chief Bush admitted that there were no weapons of mass destruction in Iraq. But more than 20 percent of adults in American believe that there were. Almost as many believe that the WMDs were sent to Syria, with no more evidence than that Rush told them so. A truth commission would not change the mind of someone like GlassOnion who recently posted on another thread: “As far as I’m concerned they could cut their freaking fingers, hands, toes, and feet, off – one at a time until they bled to death. They should have run closed circuit TVs into each cell with the volume up loud while their buddies were getting their new customized manicures… Personally, I think that would have curtailed many from joining up – but apparently giving them unemployment checks and food stamps with green cards is what Obama thinks will work… I hope he keeps them at HIS HOUSE – or maybe Pelosi could let them rent her place for a while…” A truth commission would allow some to twist the truth some more. President Bush has often said that history will be his judge. It will. He will forever be known as the President who allowed torture on his watch.",
        "reply": " Naw, I think President Bush will be known for keeping America safe and the only reason this witch hunt stopped is because of our illustrious SOTH Pelosi. She doesn't want to answer any questions on what she knew.",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-09 03:02:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "dhd123"
    },
    {
        "content": "quote: Originally posted by dhd123: quote: Originally posted by xerello: quote: Originally posted by Grachus: Certain questions have to be answred so that I don't hear ten years down the road, that \"enhanced interogation\" just consisted of making men wear bra's around their heads. No matter WHAT Obama does, he's going to get unfair flack. Take Judge Bybee. This guys ready to admit that he did wrong. Look, there are things that happen that need more than sweeping under the rug. Until there is an admittance of guilt, there will be a large portion of Americans who will not acknowledge a damn thing. Having the perpetrators admit they were wrong, will cut this minority down to a fringe. Obama is wrong to try to curry favor with these people, and they will regard it (as they ALREADY are regarding it) as an admission that it was the right thing to do. Dave President Bush admitted that there no WMDs were ever found in Iraq. Right before leaving office, President Bush said: “You know, not having weapons of mass destruction [in Iraq] was a significant disappointment.” Jan 12, 2009 Commander in Chief Bush admitted that there were no weapons of mass destruction in Iraq. But more than 20 percent of adults in American believe that there were. Almost as many believe that the WMDs were sent to Syria, with no more evidence than that Rush told them so. A truth commission would not change the mind of someone like GlassOnion who recently posted on another thread: “As far as I’m concerned they could cut their freaking fingers, hands, toes, and feet, off – one at a time until they bled to death. They should have run closed circuit TVs into each cell with the volume up loud while their buddies were getting their new customized manicures… Personally, I think that would have curtailed many from joining up – but apparently giving them unemployment checks and food stamps with green cards is what Obama thinks will work… I hope he keeps them at HIS HOUSE – or maybe Pelosi could let them rent her place for a while…” A truth commission would allow some to twist the truth some more. President Bush has often said that history will be his judge. It will. He will forever be known as the President who allowed torture on his watch. Naw, I think President Bush will be known for keeping America safe and the only reason this witch hunt stopped is because of our illustrious SOTH Pelosi. She doesn't want to answer any questions on what she knew. Already past the future",
        "intTime": 20090509,
        "postID": 35,
        "quote": "Originally posted by dhd123: quote: Originally posted by xerello: quote: Originally posted by Grachus: Certain questions have to be answred so that I don't hear ten years down the road, that \"enhanced interogation\" just consisted of making men wear bra's around their heads. No matter WHAT Obama does, he's going to get unfair flack. Take Judge Bybee. This guys ready to admit that he did wrong. Look, there are things that happen that need more than sweeping under the rug. Until there is an admittance of guilt, there will be a large portion of Americans who will not acknowledge a damn thing. Having the perpetrators admit they were wrong, will cut this minority down to a fringe. Obama is wrong to try to curry favor with these people, and they will regard it (as they ALREADY are regarding it) as an admission that it was the right thing to do. Dave President Bush admitted that there no WMDs were ever found in Iraq. Right before leaving office, President Bush said: “You know, not having weapons of mass destruction [in Iraq] was a significant disappointment.” Jan 12, 2009 Commander in Chief Bush admitted that there were no weapons of mass destruction in Iraq. But more than 20 percent of adults in American believe that there were. Almost as many believe that the WMDs were sent to Syria, with no more evidence than that Rush told them so. A truth commission would not change the mind of someone like GlassOnion who recently posted on another thread: “As far as I’m concerned they could cut their freaking fingers, hands, toes, and feet, off – one at a time until they bled to death. They should have run closed circuit TVs into each cell with the volume up loud while their buddies were getting their new customized manicures… Personally, I think that would have curtailed many from joining up – but apparently giving them unemployment checks and food stamps with green cards is what Obama thinks will work… I hope he keeps them at HIS HOUSE – or maybe Pelosi could let them rent her place for a while…” A truth commission would allow some to twist the truth some more. President Bush has often said that history will be his judge. It will. He will forever be known as the President who allowed torture on his watch. Naw, I think President Bush will be known for keeping America safe and the only reason this witch hunt stopped is because of our illustrious SOTH Pelosi. She doesn't want to answer any questions on what she knew.",
        "reply": " Already past the future",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-09 03:05:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "6486143"
    },
    {
        "content": "Sorry, but I don't get this \"It's in the past, let's move on\" garbage. All crimes happen in the past...",
        "intTime": 20090509,
        "postID": 36,
        "quote": "",
        "reply": "Sorry, but I don't get this \"It's in the past, let's move on\" garbage. All crimes happen in the past...",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-09 05:30:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "SeaWitch1220"
    },
    {
        "content": "quote: Originally posted by xerello: President Bush admitted that there no WMDs were ever found in Iraq. Right before leaving office, President Bush said: “You know, not having weapons of mass destruction [in Iraq] was a significant disappointment.” Jan 12, 2009 Commander in Chief Bush admitted that there were no weapons of mass destruction in Iraq. But more than 20 percent of adults in American believe that there were. Almost as many believe that the WMDs were sent to Syria, with no more evidence than that Rush told them so. A truth commission would not change the mind of someone like GlassOnion who recently posted on another thread: “As far as I’m concerned they could cut their freaking fingers, hands, toes, and feet, off – one at a time until they bled to death. They should have run closed circuit TVs into each cell with the volume up loud while their buddies were getting their new customized manicures… Personally, I think that would have curtailed many from joining up – but apparently giving them unemployment checks and food stamps with green cards is what Obama thinks will work… I hope he keeps them at HIS HOUSE – or maybe Pelosi could let them rent her place for a while…” A truth commission would allow some to twist the truth some more. President Bush has often said that history will be his judge. It will. He will forever be known as the President who allowed torture on his watch. Well, you know the famous Lincoln aphorsim about fooling the people - Some of them can be fooled, \"all of the time.\" But the only way you can fool \"all of the people\" is by making believe it never happened. Dave",
        "intTime": 20090509,
        "postID": 37,
        "quote": "Originally posted by xerello: President Bush admitted that there no WMDs were ever found in Iraq. Right before leaving office, President Bush said: “You know, not having weapons of mass destruction [in Iraq] was a significant disappointment.” Jan 12, 2009 Commander in Chief Bush admitted that there were no weapons of mass destruction in Iraq. But more than 20 percent of adults in American believe that there were. Almost as many believe that the WMDs were sent to Syria, with no more evidence than that Rush told them so. A truth commission would not change the mind of someone like GlassOnion who recently posted on another thread: “As far as I’m concerned they could cut their freaking fingers, hands, toes, and feet, off – one at a time until they bled to death. They should have run closed circuit TVs into each cell with the volume up loud while their buddies were getting their new customized manicures… Personally, I think that would have curtailed many from joining up – but apparently giving them unemployment checks and food stamps with green cards is what Obama thinks will work… I hope he keeps them at HIS HOUSE – or maybe Pelosi could let them rent her place for a while…” A truth commission would allow some to twist the truth some more. President Bush has often said that history will be his judge. It will. He will forever be known as the President who allowed torture on his watch.",
        "reply": " Well, you know the famous Lincoln aphorsim about fooling the people - Some of them can be fooled, \"all of the time.\" But the only way you can fool \"all of the people\" is by making believe it never happened. Dave",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-09 09:10:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "Grachus"
    },
    {
        "content": "quote: Originally posted by Elesso: quote: Originally posted by LineDoggie: By Executive Order he could stop the release of the images, he does have that authority as President. but, what if the press demands their rights under the Freedom of Information Act? this is going to get uglyer before it gets any better. someone needs to be scapegoated. who will it be? rummy? Gonzo? Condi? Georgie? bet it is not Dicky boy... he is safe in the Caymans... They were requested under the FIA, and yes President Obama does have the right to stop them from being made public. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090509,
        "postID": 38,
        "quote": "Originally posted by Elesso: quote: Originally posted by LineDoggie: By Executive Order he could stop the release of the images, he does have that authority as President. but, what if the press demands their rights under the Freedom of Information Act? this is going to get uglyer before it gets any better. someone needs to be scapegoated. who will it be? rummy? Gonzo? Condi? Georgie? bet it is not Dicky boy... he is safe in the Caymans...",
        "reply": " They were requested under the FIA, and yes President Obama does have the right to stop them from being made public. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9850028222001",
        "time": "2009-05-09 09:14:00",
        "title": "Case closed: DOJ says no to prosecutions over torture memos",
        "userID": "L0A1"
    }
]