[
    {
        "content": "\"http://www.youtube.com/watch?v=AWm2zGTZBM0\" quote: \"The bill was named after a very unfortunate incident that happened, where a young man was killed, but we know that that young man was killed in the commitment of robbery. It wasn't because he was gay. The bill was named for him, the hate crimes bill was named for him, but it's, it's really a hoax, that that continues to be used as an excuse for passing these bills.\" And the two white guys who dragged a black man to death behind their pick-up truck in Texas didn't do it because the guy was black - they were merely conducting a scientific experiment to see how fast you needed to drive before his arm ripped off... It wasn't a hate crime - merely a science experiment gone bad... The Congresswoman didn't bother to read the newspapers or watch anything other than FOX-News, all of which reported that the two men who killed Matthew Shepard confessed that they targeted him as their robbery victim, specifically because he was a gay man... We may or may not need term limits for Congressmen and Congresswomen - but maybe IQ tests should be mandatory...",
        "intTime": 20090501,
        "postID": 1,
        "quote": "\"The bill was named after a very unfortunate incident that happened, where a young man was killed, but we know that that young man was killed in the commitment of robbery. It wasn't because he was gay. The bill was named for him, the hate crimes bill was named for him, but it's, it's really a hoax, that that continues to be used as an excuse for passing these bills.\"",
        "reply": "\"http://www.youtube.com/watch?v=AWm2zGTZBM0\"  And the two white guys who dragged a black man to death behind their pick-up truck in Texas didn't do it because the guy was black - they were merely conducting a scientific experiment to see how fast you needed to drive before his arm ripped off... It wasn't a hate crime - merely a science experiment gone bad... The Congresswoman didn't bother to read the newspapers or watch anything other than FOX-News, all of which reported that the two men who killed Matthew Shepard confessed that they targeted him as their robbery victim, specifically because he was a gay man... We may or may not need term limits for Congressmen and Congresswomen - but maybe IQ tests should be mandatory...",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 08:28:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "Fightdirector"
    },
    {
        "content": "\"http://www.firstamendmentcenter.org/news.aspx?id=21537\" quote: Gay victims of violence would gain new federal protections under a revived and expanded hate-crimes bill passed by the House yesterday over conservatives' objections. Hate crimes — as defined by the bill — are those motivated by prejudice and based someone's race, color, religion, national origin, gender, sexual orientation, gender identity or disability. The bill, which passed 249-175, could provide a financial bonanza to state and local authorities, with grants for investigation and prosecution of hate crimes. The federal government could step in and prosecute if states requested it or declined to exercise their authority... Current law only permits federal prosecutions against crimes based on race, religion, color or national origin — and only when the victims are engaged in federally protected activity such as voting. The bill aroused the ire of conservative religious groups and pastors. Several Republicans argued those leaders could face criminal charges for speaking out against homosexuality or, at the very least, would be reluctant to state their views. Supporters pointed to a section of the bill that protects any activities protected by the Constitution, and countered that nothing would prevent the religious leaders from speaking out. Under the new House bill, you can say or preach or write that you hate gays - and you have not broken the law and cannot be punished under this law. But if you beat someone up because you know or believe them to be gay, or if you kill them because you know or believe them to be gay, you can be prosecuted under federal law. Sounds reasonable to me...",
        "intTime": 20090501,
        "postID": 2,
        "quote": "Gay victims of violence would gain new federal protections under a revived and expanded hate-crimes bill passed by the House yesterday over conservatives' objections. Hate crimes — as defined by the bill — are those motivated by prejudice and based someone's race, color, religion, national origin, gender, sexual orientation, gender identity or disability. The bill, which passed 249-175, could provide a financial bonanza to state and local authorities, with grants for investigation and prosecution of hate crimes. The federal government could step in and prosecute if states requested it or declined to exercise their authority... Current law only permits federal prosecutions against crimes based on race, religion, color or national origin — and only when the victims are engaged in federally protected activity such as voting. The bill aroused the ire of conservative religious groups and pastors. Several Republicans argued those leaders could face criminal charges for speaking out against homosexuality or, at the very least, would be reluctant to state their views. Supporters pointed to a section of the bill that protects any activities protected by the Constitution, and countered that nothing would prevent the religious leaders from speaking out.",
        "reply": "\"http://www.firstamendmentcenter.org/news.aspx?id=21537\"  Under the new House bill, you can say or preach or write that you hate gays - and you have not broken the law and cannot be punished under this law. But if you beat someone up because you know or believe them to be gay, or if you kill them because you know or believe them to be gay, you can be prosecuted under federal law. Sounds reasonable to me...",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 08:37:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "Fightdirector"
    },
    {
        "content": "Foxx Backtracks on Shepard \"Hoax\" Comment Now Foxx is backtracking, saying she was just referring to a 2004 news report on ABC's 20/20 that questioned whether Shepard's death was truly a hate crime. “It has come to my attention that some people have been led to believe that I think the terrible crimes that led to Matthew Shepard’s death in 1998 were a hoax,” Foxx said. “The term 'hoax' was a poor choice of words used in the discussion of the hate-crimes bill. Mr. Shepard’s death was nothing less than a tragedy, and those responsible for his death certainly deserved the punishment they received. “The larger context of my remarks is important. I was referring to a 2004 ABC 20/20 report on Mr. Shepard’s death. The 20/20 report questioned the motivation of those responsible for Mr. Shepard’s death. Referencing this media account may have been a mistake, but if so it was a mistake based on what I believed were reliable accounts.” Full article here... >>>http://www.advocate.com/news_detail_ektid81445.asp I'm not sure checking their I.Q. would help much.",
        "intTime": 20090501,
        "postID": 3,
        "quote": "",
        "reply": "Foxx Backtracks on Shepard \"Hoax\" Comment Now Foxx is backtracking, saying she was just referring to a 2004 news report on ABC's 20/20 that questioned whether Shepard's death was truly a hate crime. “It has come to my attention that some people have been led to believe that I think the terrible crimes that led to Matthew Shepard’s death in 1998 were a hoax,” Foxx said. “The term 'hoax' was a poor choice of words used in the discussion of the hate-crimes bill. Mr. Shepard’s death was nothing less than a tragedy, and those responsible for his death certainly deserved the punishment they received. “The larger context of my remarks is important. I was referring to a 2004 ABC 20/20 report on Mr. Shepard’s death. The 20/20 report questioned the motivation of those responsible for Mr. Shepard’s death. Referencing this media account may have been a mistake, but if so it was a mistake based on what I believed were reliable accounts.” Full article here... >>>http://www.advocate.com/news_detail_ektid81445.asp I'm not sure checking their I.Q. would help much.",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 08:39:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "IHAWKER"
    },
    {
        "content": "Fightdirector: Actually, this has been proven to be a lie, he was not targeted BECAUSE he was homosexual, he was targeted because they wanted money to by meth, and he was sitting in the bar in fancy clothes and they assumed he had money... \"http://abcnews.go.com/2020/Story?id=277685&page=1\"",
        "intTime": 20090501,
        "postID": 4,
        "quote": "",
        "reply": "Fightdirector: Actually, this has been proven to be a lie, he was not targeted BECAUSE he was homosexual, he was targeted because they wanted money to by meth, and he was sitting in the bar in fancy clothes and they assumed he had money... \"http://abcnews.go.com/2020/Story?id=277685&page=1\"",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 09:02:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "3678131"
    },
    {
        "content": "quote: Originally posted by IHAWKER: Now Foxx is backtracking, saying she was just referring to a 2004 news report on ABC's 20/20 that questioned whether Shepard's death was truly a hate crime. I'll buy that. Still a poor choice of words on her part.",
        "intTime": 20090501,
        "postID": 5,
        "quote": "Originally posted by IHAWKER: Now Foxx is backtracking, saying she was just referring to a 2004 news report on ABC's 20/20 that questioned whether Shepard's death was truly a hate crime.",
        "reply": " I'll buy that. Still a poor choice of words on her part.",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 09:10:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "mrmixitup"
    },
    {
        "content": "Hey the democrats do it all the time, so whats new?",
        "intTime": 20090501,
        "postID": 6,
        "quote": "",
        "reply": "Hey the democrats do it all the time, so whats new?",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 09:22:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "dman1948"
    },
    {
        "content": "I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate.",
        "intTime": 20090501,
        "postID": 7,
        "quote": "",
        "reply": "I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate.",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 09:50:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "Motive25"
    },
    {
        "content": "quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. Agreed. But this is what happens when Politicians are involved. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090501,
        "postID": 8,
        "quote": "Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate.",
        "reply": " Agreed. But this is what happens when Politicians are involved. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 09:55:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "L0A1"
    },
    {
        "content": "quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. Very true, how many \"love crimes\" have you heard of?!?",
        "intTime": 20090501,
        "postID": 9,
        "quote": "Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate.",
        "reply": " Very true, how many \"love crimes\" have you heard of?!?",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 10:25:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "67NOV"
    },
    {
        "content": "quote: Originally posted by Fightdirector: We may or may not need term limits for Congressmen and Congresswomen - but maybe IQ tests should be mandatory... We probably won't see any term limits or IQ tests. However, since she's from NC maybe Clay Aiken will run for her seat. It seems as though celebrities have been moving into politics for the last 20 years (or more if you count Ronnie). Why not Clay?",
        "intTime": 20090501,
        "postID": 10,
        "quote": "Originally posted by Fightdirector: We may or may not need term limits for Congressmen and Congresswomen - but maybe IQ tests should be mandatory...",
        "reply": " We probably won't see any term limits or IQ tests. However, since she's from NC maybe Clay Aiken will run for her seat. It seems as though celebrities have been moving into politics for the last 20 years (or more if you count Ronnie). Why not Clay?",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 10:46:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "Flygirl62"
    },
    {
        "content": "quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way.",
        "intTime": 20090501,
        "postID": 11,
        "quote": "Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate.",
        "reply": " What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way.",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 10:49:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "Flygirl62"
    },
    {
        "content": "quote: Originally posted by Flygirl62: quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way. Murder is Murder. Killing someone because you don't like him is no less of a crime then killing someone because of their religion, race. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090501,
        "postID": 12,
        "quote": "Originally posted by Flygirl62: quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way.",
        "reply": " Murder is Murder. Killing someone because you don't like him is no less of a crime then killing someone because of their religion, race. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 10:52:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "L0A1"
    },
    {
        "content": "quote: Originally posted by Flygirl62: quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way. And just as dead.",
        "intTime": 20090501,
        "postID": 13,
        "quote": "Originally posted by Flygirl62: quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way.",
        "reply": " And just as dead.",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 10:57:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "Motive25"
    },
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Flygirl62: quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way. Murder is Murder. Killing someone because you don't like him is no less of a crime then killing someone because of their religion, race. I agree with you that murder is murder. Either way he is dead. However, he was not randomly selected for robbery while walking down the street. Those two went into a g@y bar with the intent to pick up and rob a g@y man. Not random. Is it the same? Don't think so. Again....intent.",
        "intTime": 20090501,
        "postID": 14,
        "quote": "Originally posted by L0A1: quote: Originally posted by Flygirl62: quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way. Murder is Murder. Killing someone because you don't like him is no less of a crime then killing someone because of their religion, race.",
        "reply": " I agree with you that murder is murder. Either way he is dead. However, he was not randomly selected for robbery while walking down the street. Those two went into a g@y bar with the intent to pick up and rob a g@y man. Not random. Is it the same? Don't think so. Again....intent.",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 11:01:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "Flygirl62"
    },
    {
        "content": "quote: Originally posted by Flygirl62: quote: Originally posted by L0A1: quote: Originally posted by Flygirl62: quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way. Murder is Murder. Killing someone because you don't like him is no less of a crime then killing someone because of their religion, race. I agree with you that murder is murder. Either way he is dead. However, he was not randomly selected for robbery while walking down the street. Those two went into a g@y bar with the intent to pick up and rob a g@y man. Not random. Is it the same? Don't think so. Again....intent. Oh I agree with that, I was just saying calling it a hate crime is political only. Like I was saying in my above post. If I were to kill someone because I didn't like them, no matter what race or sex they were, it's still intent, yet not classified as a hate crime and doesn't have the same sentences. That's wrong, plain and simple. Enforce the laws on all murders equal. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090501,
        "postID": 15,
        "quote": "Originally posted by Flygirl62: quote: Originally posted by L0A1: quote: Originally posted by Flygirl62: quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way. Murder is Murder. Killing someone because you don't like him is no less of a crime then killing someone because of their religion, race. I agree with you that murder is murder. Either way he is dead. However, he was not randomly selected for robbery while walking down the street. Those two went into a g@y bar with the intent to pick up and rob a g@y man. Not random. Is it the same? Don't think so. Again....intent.",
        "reply": " Oh I agree with that, I was just saying calling it a hate crime is political only. Like I was saying in my above post. If I were to kill someone because I didn't like them, no matter what race or sex they were, it's still intent, yet not classified as a hate crime and doesn't have the same sentences. That's wrong, plain and simple. Enforce the laws on all murders equal. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 11:04:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "L0A1"
    },
    {
        "content": "We must recieve equal treatment, not special treatment for special people.",
        "intTime": 20090501,
        "postID": 16,
        "quote": "",
        "reply": "We must recieve equal treatment, not special treatment for special people.",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 12:08:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "peter3_1"
    },
    {
        "content": "quote: Originally posted by Fightdirector: \"http://www.firstamendmentcenter.org/news.aspx?id=21537\" quote: Gay victims of violence would gain new federal protections under a revived and expanded hate-crimes bill passed by the House yesterday over conservatives' objections. Hate crimes — as defined by the bill — are those motivated by prejudice and based someone's race, color, religion, national origin, gender, sexual orientation, gender identity or disability. The bill, which passed 249-175, could provide a financial bonanza to state and local authorities, with grants for investigation and prosecution of hate crimes. The federal government could step in and prosecute if states requested it or declined to exercise their authority... Current law only permits federal prosecutions against crimes based on race, religion, color or national origin — and only when the victims are engaged in federally protected activity such as voting. The bill aroused the ire of conservative religious groups and pastors. Several Republicans argued those leaders could face criminal charges for speaking out against homosexuality or, at the very least, would be reluctant to state their views. Supporters pointed to a section of the bill that protects any activities protected by the Constitution, and countered that nothing would prevent the religious leaders from speaking out. Under the new House bill, you can say or preach or write that you hate gays - and you have not broken the law and cannot be punished under this law. But if you beat someone up because you know or believe them to be gay, or if you kill them because you know or believe them to be gay, you can be prosecuted under federal law. Sounds reasonable to me... What some of the preachers and talking heads are concerned about is that if you encourage hate or violence towards a group then you ARE subject to the hate crime provisions in addition to the normal conspiracy, aiding and abetting a crime, etc. laws.",
        "intTime": 20090501,
        "postID": 17,
        "quote": "Originally posted by Fightdirector: \"http://www.firstamendmentcenter.org/news.aspx?id=21537\" quote: Gay victims of violence would gain new federal protections under a revived and expanded hate-crimes bill passed by the House yesterday over conservatives' objections. Hate crimes — as defined by the bill — are those motivated by prejudice and based someone's race, color, religion, national origin, gender, sexual orientation, gender identity or disability. The bill, which passed 249-175, could provide a financial bonanza to state and local authorities, with grants for investigation and prosecution of hate crimes. The federal government could step in and prosecute if states requested it or declined to exercise their authority... Current law only permits federal prosecutions against crimes based on race, religion, color or national origin — and only when the victims are engaged in federally protected activity such as voting. The bill aroused the ire of conservative religious groups and pastors. Several Republicans argued those leaders could face criminal charges for speaking out against homosexuality or, at the very least, would be reluctant to state their views. Supporters pointed to a section of the bill that protects any activities protected by the Constitution, and countered that nothing would prevent the religious leaders from speaking out. Under the new House bill, you can say or preach or write that you hate gays - and you have not broken the law and cannot be punished under this law. But if you beat someone up because you know or believe them to be gay, or if you kill them because you know or believe them to be gay, you can be prosecuted under federal law. Sounds reasonable to me...",
        "reply": " What some of the preachers and talking heads are concerned about is that if you encourage hate or violence towards a group then you ARE subject to the hate crime provisions in addition to the normal conspiracy, aiding and abetting a crime, etc. laws.",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 12:09:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "rayld2"
    },
    {
        "content": "Office of House Majority Leader Steny H. Hoyer Hoyer Statement on the Hate Crimes Prevention Act WASHINGTON, DC - House Majority Leader Steny H. Hoyer (MD) spoke on the House Floor today in support of the Hate Crimes Prevention Act. Below are his remarks as prepared for delivery: “This legislation—The Local Law Enforcement Hate Crimes Prevention Act—is a powerful statement of some of our most important American values: tolerance, respect for differences, and accountability for those who are driven to violence by hate. “This bill allows us to bring the existing Federal hate crimes law, which was enacted nearly 40 years ago, into the 21st century. Under existing law, Federal jurisdiction over hate crimes is limited to those acts directed at individuals on the basis of race, religion, color or national origin, and only when the victim is targeted because he or she is engaged in a Federally protected activity, such as voting. This legislation broadens this provision to cover all violent crimes motivated by race, religion, or national origin, when the defendant causes bodily injury or attempts to cause bodily injury. “It also expands current law to prohibit the same conduct when motivated on the basis of the victim’s gender, sexual orientation, gender identity, or disability. The principle is the same: hate crimes sow fear and division in our communities, no matter what group is targeted. Expanding the protections of the law responds to the reality in America today; for instance, hate crimes motivated by sexual orientation are almost equally common as hate crimes motivated by religion. “This bill would also allow the Federal Government to provide assistance to State and local law enforcement officials to investigate and prosecute hate crimes, and would clarify the conditions under which such crimes could be federally investigated and prosecuted. “Why is this legislation necessary? Because hate crimes motivated by race, religion, national origin, gender, sexual orientation, and identity or disability not only injure individual victims, but also terrorize entire segments of our population and tear at our Nation’s social fabric. “This legislation does not affect free speech, or punish beliefs or thoughts. It only seeks to punish violent acts. Enacting these important additions to current law will send a very powerful message: crimes committed against any American—just because of who he or she is—are a threat to all Americans and will be dealt with as such. “I urge my colleagues to support this legislation because it embodies the essential American value of tolerance.”",
        "intTime": 20090501,
        "postID": 18,
        "quote": "",
        "reply": "Office of House Majority Leader Steny H. Hoyer Hoyer Statement on the Hate Crimes Prevention Act WASHINGTON, DC - House Majority Leader Steny H. Hoyer (MD) spoke on the House Floor today in support of the Hate Crimes Prevention Act. Below are his remarks as prepared for delivery: “This legislation—The Local Law Enforcement Hate Crimes Prevention Act—is a powerful statement of some of our most important American values: tolerance, respect for differences, and accountability for those who are driven to violence by hate. “This bill allows us to bring the existing Federal hate crimes law, which was enacted nearly 40 years ago, into the 21st century. Under existing law, Federal jurisdiction over hate crimes is limited to those acts directed at individuals on the basis of race, religion, color or national origin, and only when the victim is targeted because he or she is engaged in a Federally protected activity, such as voting. This legislation broadens this provision to cover all violent crimes motivated by race, religion, or national origin, when the defendant causes bodily injury or attempts to cause bodily injury. “It also expands current law to prohibit the same conduct when motivated on the basis of the victim’s gender, sexual orientation, gender identity, or disability. The principle is the same: hate crimes sow fear and division in our communities, no matter what group is targeted. Expanding the protections of the law responds to the reality in America today; for instance, hate crimes motivated by sexual orientation are almost equally common as hate crimes motivated by religion. “This bill would also allow the Federal Government to provide assistance to State and local law enforcement officials to investigate and prosecute hate crimes, and would clarify the conditions under which such crimes could be federally investigated and prosecuted. “Why is this legislation necessary? Because hate crimes motivated by race, religion, national origin, gender, sexual orientation, and identity or disability not only injure individual victims, but also terrorize entire segments of our population and tear at our Nation’s social fabric. “This legislation does not affect free speech, or punish beliefs or thoughts. It only seeks to punish violent acts. Enacting these important additions to current law will send a very powerful message: crimes committed against any American—just because of who he or she is—are a threat to all Americans and will be dealt with as such. “I urge my colleagues to support this legislation because it embodies the essential American value of tolerance.”",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 12:26:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "IHAWKER"
    },
    {
        "content": "quote: Originally posted by peter3_1: We must recieve equal treatment, not special treatment for special people. Since the earliest days of the United States, white, male, Protestant Caucasians have received special preferential treatment under the law. Women could not own property in the 13 original states, Blacks could not own property (in fact, in the earliest days, they WERE property), Jews were not allowed to vote in most of the 13 original states - and, slowly but surely the laws were changed, treating women, Blacks, Catholics, Jews, the same as white, male, Protestant Caucasians - and white, male, Protestant Caucasians automatically whine about women, Blacks, Catholics and Jews being given \"special treatment for special people\". Rights are not finite. If I, a Christian, have the right to buy a house, for example, and the law is changed to allow a Jew to buy a house in the same neighborhood, I did not have one of my \"rights\" taken away from me and I have no legitimate right to complain that Jews are being given \"special treatment for special people\".",
        "intTime": 20090501,
        "postID": 19,
        "quote": "Originally posted by peter3_1: We must recieve equal treatment, not special treatment for special people.",
        "reply": " Since the earliest days of the United States, white, male, Protestant Caucasians have received special preferential treatment under the law. Women could not own property in the 13 original states, Blacks could not own property (in fact, in the earliest days, they WERE property), Jews were not allowed to vote in most of the 13 original states - and, slowly but surely the laws were changed, treating women, Blacks, Catholics, Jews, the same as white, male, Protestant Caucasians - and white, male, Protestant Caucasians automatically whine about women, Blacks, Catholics and Jews being given \"special treatment for special people\". Rights are not finite. If I, a Christian, have the right to buy a house, for example, and the law is changed to allow a Jew to buy a house in the same neighborhood, I did not have one of my \"rights\" taken away from me and I have no legitimate right to complain that Jews are being given \"special treatment for special people\".",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 12:58:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "Fightdirector"
    },
    {
        "content": "quote: Originally posted by rayld2: What some of the preachers and talking heads are concerned about is that if you encourage hate or violence towards a group then you ARE subject to the hate crime provisions in addition to the normal conspiracy, aiding and abetting a crime, etc. laws. If a priest, minister, rabbi, imam or televangelist tells one of the members of his church, mosque or temple that it is God's will that they rob the local liquor store and the member will be condemned to eternal damnation if he doesn't rob the local liquor store, it is reasonable to consider charging that religious leader for incitement to commit the crime of robbery. Why should it be any different if that same religious leader tells a member of his church, mosque or temple that it is God's will that they kill a known or suspected gay person and the member will be condemned to eternal damnation if he doesn't kill a known or suspected gay person? That's incitement to commit murder, and religious belief is never a legitimate defense for murder.",
        "intTime": 20090501,
        "postID": 20,
        "quote": "Originally posted by rayld2: What some of the preachers and talking heads are concerned about is that if you encourage hate or violence towards a group then you ARE subject to the hate crime provisions in addition to the normal conspiracy, aiding and abetting a crime, etc. laws.",
        "reply": " If a priest, minister, rabbi, imam or televangelist tells one of the members of his church, mosque or temple that it is God's will that they rob the local liquor store and the member will be condemned to eternal damnation if he doesn't rob the local liquor store, it is reasonable to consider charging that religious leader for incitement to commit the crime of robbery. Why should it be any different if that same religious leader tells a member of his church, mosque or temple that it is God's will that they kill a known or suspected gay person and the member will be condemned to eternal damnation if he doesn't kill a known or suspected gay person? That's incitement to commit murder, and religious belief is never a legitimate defense for murder.",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 13:06:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "Fightdirector"
    },
    {
        "content": "\"http://www.youtube.com/watch?v=AWm2zGTZBM0\" quote: \"The bill was named after a very unfortunate incident that happened, where a young man was killed, but we know that that young man was killed in the commitment of robbery. It wasn't because he was gay. The bill was named for him, the hate crimes bill was named for him, but it's, it's really a hoax, that that continues to be used as an excuse for passing these bills.\" And the two white guys who dragged a black man to death behind their pick-up truck in Texas didn't do it because the guy was black - they were merely conducting a scientific experiment to see how fast you needed to drive before his arm ripped off... It wasn't a hate crime - merely a science experiment gone bad... The Congresswoman didn't bother to read the newspapers or watch anything other than FOX-News, all of which reported that the two men who killed Matthew Shepard confessed that they targeted him as their robbery victim, specifically because he was a gay man... We may or may not need term limits for Congressmen and Congresswomen - but maybe IQ tests should be mandatory...",
        "intTime": 20090501,
        "postID": 21,
        "quote": "\"The bill was named after a very unfortunate incident that happened, where a young man was killed, but we know that that young man was killed in the commitment of robbery. It wasn't because he was gay. The bill was named for him, the hate crimes bill was named for him, but it's, it's really a hoax, that that continues to be used as an excuse for passing these bills.\"",
        "reply": "\"http://www.youtube.com/watch?v=AWm2zGTZBM0\"  And the two white guys who dragged a black man to death behind their pick-up truck in Texas didn't do it because the guy was black - they were merely conducting a scientific experiment to see how fast you needed to drive before his arm ripped off... It wasn't a hate crime - merely a science experiment gone bad... The Congresswoman didn't bother to read the newspapers or watch anything other than FOX-News, all of which reported that the two men who killed Matthew Shepard confessed that they targeted him as their robbery victim, specifically because he was a gay man... We may or may not need term limits for Congressmen and Congresswomen - but maybe IQ tests should be mandatory...",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 08:28:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "Fightdirector"
    },
    {
        "content": "\"http://www.firstamendmentcenter.org/news.aspx?id=21537\" quote: Gay victims of violence would gain new federal protections under a revived and expanded hate-crimes bill passed by the House yesterday over conservatives' objections. Hate crimes — as defined by the bill — are those motivated by prejudice and based someone's race, color, religion, national origin, gender, sexual orientation, gender identity or disability. The bill, which passed 249-175, could provide a financial bonanza to state and local authorities, with grants for investigation and prosecution of hate crimes. The federal government could step in and prosecute if states requested it or declined to exercise their authority... Current law only permits federal prosecutions against crimes based on race, religion, color or national origin — and only when the victims are engaged in federally protected activity such as voting. The bill aroused the ire of conservative religious groups and pastors. Several Republicans argued those leaders could face criminal charges for speaking out against homosexuality or, at the very least, would be reluctant to state their views. Supporters pointed to a section of the bill that protects any activities protected by the Constitution, and countered that nothing would prevent the religious leaders from speaking out. Under the new House bill, you can say or preach or write that you hate gays - and you have not broken the law and cannot be punished under this law. But if you beat someone up because you know or believe them to be gay, or if you kill them because you know or believe them to be gay, you can be prosecuted under federal law. Sounds reasonable to me...",
        "intTime": 20090501,
        "postID": 22,
        "quote": "Gay victims of violence would gain new federal protections under a revived and expanded hate-crimes bill passed by the House yesterday over conservatives' objections. Hate crimes — as defined by the bill — are those motivated by prejudice and based someone's race, color, religion, national origin, gender, sexual orientation, gender identity or disability. The bill, which passed 249-175, could provide a financial bonanza to state and local authorities, with grants for investigation and prosecution of hate crimes. The federal government could step in and prosecute if states requested it or declined to exercise their authority... Current law only permits federal prosecutions against crimes based on race, religion, color or national origin — and only when the victims are engaged in federally protected activity such as voting. The bill aroused the ire of conservative religious groups and pastors. Several Republicans argued those leaders could face criminal charges for speaking out against homosexuality or, at the very least, would be reluctant to state their views. Supporters pointed to a section of the bill that protects any activities protected by the Constitution, and countered that nothing would prevent the religious leaders from speaking out.",
        "reply": "\"http://www.firstamendmentcenter.org/news.aspx?id=21537\"  Under the new House bill, you can say or preach or write that you hate gays - and you have not broken the law and cannot be punished under this law. But if you beat someone up because you know or believe them to be gay, or if you kill them because you know or believe them to be gay, you can be prosecuted under federal law. Sounds reasonable to me...",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 08:37:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "Fightdirector"
    },
    {
        "content": "Foxx Backtracks on Shepard \"Hoax\" Comment Now Foxx is backtracking, saying she was just referring to a 2004 news report on ABC's 20/20 that questioned whether Shepard's death was truly a hate crime. “It has come to my attention that some people have been led to believe that I think the terrible crimes that led to Matthew Shepard’s death in 1998 were a hoax,” Foxx said. “The term 'hoax' was a poor choice of words used in the discussion of the hate-crimes bill. Mr. Shepard’s death was nothing less than a tragedy, and those responsible for his death certainly deserved the punishment they received. “The larger context of my remarks is important. I was referring to a 2004 ABC 20/20 report on Mr. Shepard’s death. The 20/20 report questioned the motivation of those responsible for Mr. Shepard’s death. Referencing this media account may have been a mistake, but if so it was a mistake based on what I believed were reliable accounts.” Full article here... >>>http://www.advocate.com/news_detail_ektid81445.asp I'm not sure checking their I.Q. would help much.",
        "intTime": 20090501,
        "postID": 23,
        "quote": "",
        "reply": "Foxx Backtracks on Shepard \"Hoax\" Comment Now Foxx is backtracking, saying she was just referring to a 2004 news report on ABC's 20/20 that questioned whether Shepard's death was truly a hate crime. “It has come to my attention that some people have been led to believe that I think the terrible crimes that led to Matthew Shepard’s death in 1998 were a hoax,” Foxx said. “The term 'hoax' was a poor choice of words used in the discussion of the hate-crimes bill. Mr. Shepard’s death was nothing less than a tragedy, and those responsible for his death certainly deserved the punishment they received. “The larger context of my remarks is important. I was referring to a 2004 ABC 20/20 report on Mr. Shepard’s death. The 20/20 report questioned the motivation of those responsible for Mr. Shepard’s death. Referencing this media account may have been a mistake, but if so it was a mistake based on what I believed were reliable accounts.” Full article here... >>>http://www.advocate.com/news_detail_ektid81445.asp I'm not sure checking their I.Q. would help much.",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 08:39:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "IHAWKER"
    },
    {
        "content": "Fightdirector: Actually, this has been proven to be a lie, he was not targeted BECAUSE he was homosexual, he was targeted because they wanted money to by meth, and he was sitting in the bar in fancy clothes and they assumed he had money... \"http://abcnews.go.com/2020/Story?id=277685&page=1\"",
        "intTime": 20090501,
        "postID": 24,
        "quote": "",
        "reply": "Fightdirector: Actually, this has been proven to be a lie, he was not targeted BECAUSE he was homosexual, he was targeted because they wanted money to by meth, and he was sitting in the bar in fancy clothes and they assumed he had money... \"http://abcnews.go.com/2020/Story?id=277685&page=1\"",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 09:02:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "3678131"
    },
    {
        "content": "quote: Originally posted by IHAWKER: Now Foxx is backtracking, saying she was just referring to a 2004 news report on ABC's 20/20 that questioned whether Shepard's death was truly a hate crime. I'll buy that. Still a poor choice of words on her part.",
        "intTime": 20090501,
        "postID": 25,
        "quote": "Originally posted by IHAWKER: Now Foxx is backtracking, saying she was just referring to a 2004 news report on ABC's 20/20 that questioned whether Shepard's death was truly a hate crime.",
        "reply": " I'll buy that. Still a poor choice of words on her part.",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 09:10:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "mrmixitup"
    },
    {
        "content": "Hey the democrats do it all the time, so whats new?",
        "intTime": 20090501,
        "postID": 26,
        "quote": "",
        "reply": "Hey the democrats do it all the time, so whats new?",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 09:22:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "dman1948"
    },
    {
        "content": "I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate.",
        "intTime": 20090501,
        "postID": 27,
        "quote": "",
        "reply": "I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate.",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 09:50:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "Motive25"
    },
    {
        "content": "quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. Agreed. But this is what happens when Politicians are involved. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090501,
        "postID": 28,
        "quote": "Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate.",
        "reply": " Agreed. But this is what happens when Politicians are involved. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 09:55:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "L0A1"
    },
    {
        "content": "quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. Very true, how many \"love crimes\" have you heard of?!?",
        "intTime": 20090501,
        "postID": 29,
        "quote": "Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate.",
        "reply": " Very true, how many \"love crimes\" have you heard of?!?",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 10:25:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "67NOV"
    },
    {
        "content": "quote: Originally posted by Fightdirector: We may or may not need term limits for Congressmen and Congresswomen - but maybe IQ tests should be mandatory... We probably won't see any term limits or IQ tests. However, since she's from NC maybe Clay Aiken will run for her seat. It seems as though celebrities have been moving into politics for the last 20 years (or more if you count Ronnie). Why not Clay?",
        "intTime": 20090501,
        "postID": 30,
        "quote": "Originally posted by Fightdirector: We may or may not need term limits for Congressmen and Congresswomen - but maybe IQ tests should be mandatory...",
        "reply": " We probably won't see any term limits or IQ tests. However, since she's from NC maybe Clay Aiken will run for her seat. It seems as though celebrities have been moving into politics for the last 20 years (or more if you count Ronnie). Why not Clay?",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 10:46:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "Flygirl62"
    },
    {
        "content": "quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way.",
        "intTime": 20090501,
        "postID": 31,
        "quote": "Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate.",
        "reply": " What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way.",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 10:49:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "Flygirl62"
    },
    {
        "content": "quote: Originally posted by Flygirl62: quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way. Murder is Murder. Killing someone because you don't like him is no less of a crime then killing someone because of their religion, race. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090501,
        "postID": 32,
        "quote": "Originally posted by Flygirl62: quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way.",
        "reply": " Murder is Murder. Killing someone because you don't like him is no less of a crime then killing someone because of their religion, race. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 10:52:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "L0A1"
    },
    {
        "content": "quote: Originally posted by Flygirl62: quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way. And just as dead.",
        "intTime": 20090501,
        "postID": 33,
        "quote": "Originally posted by Flygirl62: quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way.",
        "reply": " And just as dead.",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 10:57:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "Motive25"
    },
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by Flygirl62: quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way. Murder is Murder. Killing someone because you don't like him is no less of a crime then killing someone because of their religion, race. I agree with you that murder is murder. Either way he is dead. However, he was not randomly selected for robbery while walking down the street. Those two went into a g@y bar with the intent to pick up and rob a g@y man. Not random. Is it the same? Don't think so. Again....intent.",
        "intTime": 20090501,
        "postID": 34,
        "quote": "Originally posted by L0A1: quote: Originally posted by Flygirl62: quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way. Murder is Murder. Killing someone because you don't like him is no less of a crime then killing someone because of their religion, race.",
        "reply": " I agree with you that murder is murder. Either way he is dead. However, he was not randomly selected for robbery while walking down the street. Those two went into a g@y bar with the intent to pick up and rob a g@y man. Not random. Is it the same? Don't think so. Again....intent.",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 11:01:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "Flygirl62"
    },
    {
        "content": "quote: Originally posted by Flygirl62: quote: Originally posted by L0A1: quote: Originally posted by Flygirl62: quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way. Murder is Murder. Killing someone because you don't like him is no less of a crime then killing someone because of their religion, race. I agree with you that murder is murder. Either way he is dead. However, he was not randomly selected for robbery while walking down the street. Those two went into a g@y bar with the intent to pick up and rob a g@y man. Not random. Is it the same? Don't think so. Again....intent. Oh I agree with that, I was just saying calling it a hate crime is political only. Like I was saying in my above post. If I were to kill someone because I didn't like them, no matter what race or sex they were, it's still intent, yet not classified as a hate crime and doesn't have the same sentences. That's wrong, plain and simple. Enforce the laws on all murders equal. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "intTime": 20090501,
        "postID": 35,
        "quote": "Originally posted by Flygirl62: quote: Originally posted by L0A1: quote: Originally posted by Flygirl62: quote: Originally posted by Motive25: I've never understood the term \"hate crime\", especially when it comes to murder. To me, murder is by definition an ultimate expression of hate. What was the difference between Nazis killing Polish people versus killing Jewish Pols? Intent. Nazis targeted Jews. The others were just in the way. Murder is Murder. Killing someone because you don't like him is no less of a crime then killing someone because of their religion, race. I agree with you that murder is murder. Either way he is dead. However, he was not randomly selected for robbery while walking down the street. Those two went into a g@y bar with the intent to pick up and rob a g@y man. Not random. Is it the same? Don't think so. Again....intent.",
        "reply": " Oh I agree with that, I was just saying calling it a hate crime is political only. Like I was saying in my above post. If I were to kill someone because I didn't like them, no matter what race or sex they were, it's still intent, yet not classified as a hate crime and doesn't have the same sentences. That's wrong, plain and simple. Enforce the laws on all murders equal. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 11:04:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "L0A1"
    },
    {
        "content": "We must recieve equal treatment, not special treatment for special people.",
        "intTime": 20090501,
        "postID": 36,
        "quote": "",
        "reply": "We must recieve equal treatment, not special treatment for special people.",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 12:08:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "peter3_1"
    },
    {
        "content": "quote: Originally posted by Fightdirector: \"http://www.firstamendmentcenter.org/news.aspx?id=21537\" quote: Gay victims of violence would gain new federal protections under a revived and expanded hate-crimes bill passed by the House yesterday over conservatives' objections. Hate crimes — as defined by the bill — are those motivated by prejudice and based someone's race, color, religion, national origin, gender, sexual orientation, gender identity or disability. The bill, which passed 249-175, could provide a financial bonanza to state and local authorities, with grants for investigation and prosecution of hate crimes. The federal government could step in and prosecute if states requested it or declined to exercise their authority... Current law only permits federal prosecutions against crimes based on race, religion, color or national origin — and only when the victims are engaged in federally protected activity such as voting. The bill aroused the ire of conservative religious groups and pastors. Several Republicans argued those leaders could face criminal charges for speaking out against homosexuality or, at the very least, would be reluctant to state their views. Supporters pointed to a section of the bill that protects any activities protected by the Constitution, and countered that nothing would prevent the religious leaders from speaking out. Under the new House bill, you can say or preach or write that you hate gays - and you have not broken the law and cannot be punished under this law. But if you beat someone up because you know or believe them to be gay, or if you kill them because you know or believe them to be gay, you can be prosecuted under federal law. Sounds reasonable to me... What some of the preachers and talking heads are concerned about is that if you encourage hate or violence towards a group then you ARE subject to the hate crime provisions in addition to the normal conspiracy, aiding and abetting a crime, etc. laws.",
        "intTime": 20090501,
        "postID": 37,
        "quote": "Originally posted by Fightdirector: \"http://www.firstamendmentcenter.org/news.aspx?id=21537\" quote: Gay victims of violence would gain new federal protections under a revived and expanded hate-crimes bill passed by the House yesterday over conservatives' objections. Hate crimes — as defined by the bill — are those motivated by prejudice and based someone's race, color, religion, national origin, gender, sexual orientation, gender identity or disability. The bill, which passed 249-175, could provide a financial bonanza to state and local authorities, with grants for investigation and prosecution of hate crimes. The federal government could step in and prosecute if states requested it or declined to exercise their authority... Current law only permits federal prosecutions against crimes based on race, religion, color or national origin — and only when the victims are engaged in federally protected activity such as voting. The bill aroused the ire of conservative religious groups and pastors. Several Republicans argued those leaders could face criminal charges for speaking out against homosexuality or, at the very least, would be reluctant to state their views. Supporters pointed to a section of the bill that protects any activities protected by the Constitution, and countered that nothing would prevent the religious leaders from speaking out. Under the new House bill, you can say or preach or write that you hate gays - and you have not broken the law and cannot be punished under this law. But if you beat someone up because you know or believe them to be gay, or if you kill them because you know or believe them to be gay, you can be prosecuted under federal law. Sounds reasonable to me...",
        "reply": " What some of the preachers and talking heads are concerned about is that if you encourage hate or violence towards a group then you ARE subject to the hate crime provisions in addition to the normal conspiracy, aiding and abetting a crime, etc. laws.",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 12:09:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "rayld2"
    },
    {
        "content": "Office of House Majority Leader Steny H. Hoyer Hoyer Statement on the Hate Crimes Prevention Act WASHINGTON, DC - House Majority Leader Steny H. Hoyer (MD) spoke on the House Floor today in support of the Hate Crimes Prevention Act. Below are his remarks as prepared for delivery: “This legislation—The Local Law Enforcement Hate Crimes Prevention Act—is a powerful statement of some of our most important American values: tolerance, respect for differences, and accountability for those who are driven to violence by hate. “This bill allows us to bring the existing Federal hate crimes law, which was enacted nearly 40 years ago, into the 21st century. Under existing law, Federal jurisdiction over hate crimes is limited to those acts directed at individuals on the basis of race, religion, color or national origin, and only when the victim is targeted because he or she is engaged in a Federally protected activity, such as voting. This legislation broadens this provision to cover all violent crimes motivated by race, religion, or national origin, when the defendant causes bodily injury or attempts to cause bodily injury. “It also expands current law to prohibit the same conduct when motivated on the basis of the victim’s gender, sexual orientation, gender identity, or disability. The principle is the same: hate crimes sow fear and division in our communities, no matter what group is targeted. Expanding the protections of the law responds to the reality in America today; for instance, hate crimes motivated by sexual orientation are almost equally common as hate crimes motivated by religion. “This bill would also allow the Federal Government to provide assistance to State and local law enforcement officials to investigate and prosecute hate crimes, and would clarify the conditions under which such crimes could be federally investigated and prosecuted. “Why is this legislation necessary? Because hate crimes motivated by race, religion, national origin, gender, sexual orientation, and identity or disability not only injure individual victims, but also terrorize entire segments of our population and tear at our Nation’s social fabric. “This legislation does not affect free speech, or punish beliefs or thoughts. It only seeks to punish violent acts. Enacting these important additions to current law will send a very powerful message: crimes committed against any American—just because of who he or she is—are a threat to all Americans and will be dealt with as such. “I urge my colleagues to support this legislation because it embodies the essential American value of tolerance.”",
        "intTime": 20090501,
        "postID": 38,
        "quote": "",
        "reply": "Office of House Majority Leader Steny H. Hoyer Hoyer Statement on the Hate Crimes Prevention Act WASHINGTON, DC - House Majority Leader Steny H. Hoyer (MD) spoke on the House Floor today in support of the Hate Crimes Prevention Act. Below are his remarks as prepared for delivery: “This legislation—The Local Law Enforcement Hate Crimes Prevention Act—is a powerful statement of some of our most important American values: tolerance, respect for differences, and accountability for those who are driven to violence by hate. “This bill allows us to bring the existing Federal hate crimes law, which was enacted nearly 40 years ago, into the 21st century. Under existing law, Federal jurisdiction over hate crimes is limited to those acts directed at individuals on the basis of race, religion, color or national origin, and only when the victim is targeted because he or she is engaged in a Federally protected activity, such as voting. This legislation broadens this provision to cover all violent crimes motivated by race, religion, or national origin, when the defendant causes bodily injury or attempts to cause bodily injury. “It also expands current law to prohibit the same conduct when motivated on the basis of the victim’s gender, sexual orientation, gender identity, or disability. The principle is the same: hate crimes sow fear and division in our communities, no matter what group is targeted. Expanding the protections of the law responds to the reality in America today; for instance, hate crimes motivated by sexual orientation are almost equally common as hate crimes motivated by religion. “This bill would also allow the Federal Government to provide assistance to State and local law enforcement officials to investigate and prosecute hate crimes, and would clarify the conditions under which such crimes could be federally investigated and prosecuted. “Why is this legislation necessary? Because hate crimes motivated by race, religion, national origin, gender, sexual orientation, and identity or disability not only injure individual victims, but also terrorize entire segments of our population and tear at our Nation’s social fabric. “This legislation does not affect free speech, or punish beliefs or thoughts. It only seeks to punish violent acts. Enacting these important additions to current law will send a very powerful message: crimes committed against any American—just because of who he or she is—are a threat to all Americans and will be dealt with as such. “I urge my colleagues to support this legislation because it embodies the essential American value of tolerance.”",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 12:26:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "IHAWKER"
    },
    {
        "content": "quote: Originally posted by peter3_1: We must recieve equal treatment, not special treatment for special people. Since the earliest days of the United States, white, male, Protestant Caucasians have received special preferential treatment under the law. Women could not own property in the 13 original states, Blacks could not own property (in fact, in the earliest days, they WERE property), Jews were not allowed to vote in most of the 13 original states - and, slowly but surely the laws were changed, treating women, Blacks, Catholics, Jews, the same as white, male, Protestant Caucasians - and white, male, Protestant Caucasians automatically whine about women, Blacks, Catholics and Jews being given \"special treatment for special people\". Rights are not finite. If I, a Christian, have the right to buy a house, for example, and the law is changed to allow a Jew to buy a house in the same neighborhood, I did not have one of my \"rights\" taken away from me and I have no legitimate right to complain that Jews are being given \"special treatment for special people\".",
        "intTime": 20090501,
        "postID": 39,
        "quote": "Originally posted by peter3_1: We must recieve equal treatment, not special treatment for special people.",
        "reply": " Since the earliest days of the United States, white, male, Protestant Caucasians have received special preferential treatment under the law. Women could not own property in the 13 original states, Blacks could not own property (in fact, in the earliest days, they WERE property), Jews were not allowed to vote in most of the 13 original states - and, slowly but surely the laws were changed, treating women, Blacks, Catholics, Jews, the same as white, male, Protestant Caucasians - and white, male, Protestant Caucasians automatically whine about women, Blacks, Catholics and Jews being given \"special treatment for special people\". Rights are not finite. If I, a Christian, have the right to buy a house, for example, and the law is changed to allow a Jew to buy a house in the same neighborhood, I did not have one of my \"rights\" taken away from me and I have no legitimate right to complain that Jews are being given \"special treatment for special people\".",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 12:58:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "Fightdirector"
    },
    {
        "content": "quote: Originally posted by rayld2: What some of the preachers and talking heads are concerned about is that if you encourage hate or violence towards a group then you ARE subject to the hate crime provisions in addition to the normal conspiracy, aiding and abetting a crime, etc. laws. If a priest, minister, rabbi, imam or televangelist tells one of the members of his church, mosque or temple that it is God's will that they rob the local liquor store and the member will be condemned to eternal damnation if he doesn't rob the local liquor store, it is reasonable to consider charging that religious leader for incitement to commit the crime of robbery. Why should it be any different if that same religious leader tells a member of his church, mosque or temple that it is God's will that they kill a known or suspected gay person and the member will be condemned to eternal damnation if he doesn't kill a known or suspected gay person? That's incitement to commit murder, and religious belief is never a legitimate defense for murder.",
        "intTime": 20090501,
        "postID": 40,
        "quote": "Originally posted by rayld2: What some of the preachers and talking heads are concerned about is that if you encourage hate or violence towards a group then you ARE subject to the hate crime provisions in addition to the normal conspiracy, aiding and abetting a crime, etc. laws.",
        "reply": " If a priest, minister, rabbi, imam or televangelist tells one of the members of his church, mosque or temple that it is God's will that they rob the local liquor store and the member will be condemned to eternal damnation if he doesn't rob the local liquor store, it is reasonable to consider charging that religious leader for incitement to commit the crime of robbery. Why should it be any different if that same religious leader tells a member of his church, mosque or temple that it is God's will that they kill a known or suspected gay person and the member will be condemned to eternal damnation if he doesn't kill a known or suspected gay person? That's incitement to commit murder, and religious belief is never a legitimate defense for murder.",
        "threadID": "672198221_9350042222001",
        "time": "2009-05-01 13:06:00",
        "title": "GOP Congresswoman calls Matthew Shepard's murder a \"Hoax\" during House debate",
        "userID": "Fightdirector"
    }
]