[
    {
        "content": "Sen. Roland Burris insisted Wednesday that he had no involvement in a \"pay to play\" scheme with ousted Illinois Gov. Rod Blagojevich, a day after the FBI released a transcript in which Burris says he will \"personally do something\" to help the governor's campaign. \"I know I could give him a check,\" Burris is quoted as saying in a Nov. 13 phone conversation with Rob Blagojevich, the governor's brother. \"Anything I give would be out of my personal funds,\" Burris said, while stating his wish to fill President Obama's vacated U.S. Senate seat. Burris' comments in the transcript released late Tuesday are a stark contrast to his Jan. 8 testimony before the Illinois impeachment committee during which he failed to mention that Blagojevich's brother solicited him for donations to the governor's campaign. Burris later filed an affidavit with the panel Feb. 5 noting that Rob Blagojevich did ask him to help the campaign, but that he did not promise to pay Blagojevich any money. But the FBI transcript shows a different story. \"If you guys can just write checks that'd be fine,\" Rob Blagojevich said to Burris, to which the senator replied, \"Okay, okay, well we, we, I, I will personally do something, okay.\" When questioned about his comment Wednesday, Burris said he realized after he hung up the phone that he could not contribute any personal funds. \"After I hung up the phone, I said I can't even do that,\" Burris told reporters. The transcript also reveals that Burris agonized over wanting to help the governor while remaining a serious contender for the Senate seat. \"I'm trying to figure out how to deal with this and still be in the consideration for the appointment,\" Burris said, adding that he and Blagojevich will both \"catch hell\" if it looked like he \"bought\" the seat. Burris ends the conversation by saying, \"Tell Rod to keep me in mind for that seat, would ya?\" \"This is a story full of inconsistencies from day one,\" Illinois House Minority Leader Tom Cross told FOXNews.com on Wednesday, noting the discrepancies between Burris' testimony and the wiretap. \"All this does is further support for the need for him to step down.\" Cross, who is calling for the Senate Ethics Committee to conduct a full investigation, said Burris had \"ample opportunity\" to clarify the facts during his testimony and in his affidavit. \"It's the highest office in this country -- and there's only 100 of them -- and to mislead people speaks volumes about the type of guy he is,\" said Cross, a Republican. \"Getting a senate seat and inquiries into when and who you spoke to about it, that's something you remember,\" former prosecutor Joey Jackson told FOX News. \"You don't go before the Illinois house and testify and you say nothing about anything regarding a conversation with his brother until you find out 'hey, listen, maybe there is wiretaps out there. Maybe they caught the conversation'\" Jackson said. \"He's changing his story.\" Still, defense attorneys argue, Burris did not engage in any illegal transaction. \"Show me the smoking gun. If you don't have the smoking gun, let's move forward,\" said criminal defense attorney Tamara Holder. \"http://www.foxnews.com/politics/2009/05/27/burris-maintains-innocence-defends-statements-fbi-wiretap-transcript/\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090527, 
        "postID": 1, 
        "quote": "", 
        "reply": "Sen. Roland Burris insisted Wednesday that he had no involvement in a \"pay to play\" scheme with ousted Illinois Gov. Rod Blagojevich, a day after the FBI released a transcript in which Burris says he will \"personally do something\" to help the governor's campaign. \"I know I could give him a check,\" Burris is quoted as saying in a Nov. 13 phone conversation with Rob Blagojevich, the governor's brother. \"Anything I give would be out of my personal funds,\" Burris said, while stating his wish to fill President Obama's vacated U.S. Senate seat. Burris' comments in the transcript released late Tuesday are a stark contrast to his Jan. 8 testimony before the Illinois impeachment committee during which he failed to mention that Blagojevich's brother solicited him for donations to the governor's campaign. Burris later filed an affidavit with the panel Feb. 5 noting that Rob Blagojevich did ask him to help the campaign, but that he did not promise to pay Blagojevich any money. But the FBI transcript shows a different story. \"If you guys can just write checks that'd be fine,\" Rob Blagojevich said to Burris, to which the senator replied, \"Okay, okay, well we, we, I, I will personally do something, okay.\" When questioned about his comment Wednesday, Burris said he realized after he hung up the phone that he could not contribute any personal funds. \"After I hung up the phone, I said I can't even do that,\" Burris told reporters. The transcript also reveals that Burris agonized over wanting to help the governor while remaining a serious contender for the Senate seat. \"I'm trying to figure out how to deal with this and still be in the consideration for the appointment,\" Burris said, adding that he and Blagojevich will both \"catch hell\" if it looked like he \"bought\" the seat. Burris ends the conversation by saying, \"Tell Rod to keep me in mind for that seat, would ya?\" \"This is a story full of inconsistencies from day one,\" Illinois House Minority Leader Tom Cross told FOXNews.com on Wednesday, noting the discrepancies between Burris' testimony and the wiretap. \"All this does is further support for the need for him to step down.\" Cross, who is calling for the Senate Ethics Committee to conduct a full investigation, said Burris had \"ample opportunity\" to clarify the facts during his testimony and in his affidavit. \"It's the highest office in this country -- and there's only 100 of them -- and to mislead people speaks volumes about the type of guy he is,\" said Cross, a Republican. \"Getting a senate seat and inquiries into when and who you spoke to about it, that's something you remember,\" former prosecutor Joey Jackson told FOX News. \"You don't go before the Illinois house and testify and you say nothing about anything regarding a conversation with his brother until you find out 'hey, listen, maybe there is wiretaps out there. Maybe they caught the conversation'\" Jackson said. \"He's changing his story.\" Still, defense attorneys argue, Burris did not engage in any illegal transaction. \"Show me the smoking gun. If you don't have the smoking gun, let's move forward,\" said criminal defense attorney Tamara Holder. \"http://www.foxnews.com/politics/2009/05/27/burris-maintains-innocence-defends-statements-fbi-wiretap-transcript/\" \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_7390014422001", 
        "time": "2009-05-27 12:34:00", 
        "title": "Burris digs hole deeper after FBI Wiretap Transcript is released", 
        "userID": "Anbar7"
    }, 
    {
        "content": "He admitted to a lot of these things, not in the details the wiretaps prove, but he did say he was in more contact then he originally admitted. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090527, 
        "postID": 2, 
        "quote": "", 
        "reply": "He admitted to a lot of these things, not in the details the wiretaps prove, but he did say he was in more contact then he originally admitted. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7390014422001", 
        "time": "2009-05-27 13:28:00", 
        "title": "Burris digs hole deeper after FBI Wiretap Transcript is released", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: He admitted to a lot of these things, not in the details the wiretaps prove, but he did say he was in more contact then he originally admitted. One of the great disgraces of the Democratic Party was allowing this guy to be seated. Dave", 
        "intTime": 20090527, 
        "postID": 3, 
        "quote": "Originally posted by L0A1: He admitted to a lot of these things, not in the details the wiretaps prove, but he did say he was in more contact then he originally admitted.", 
        "reply": " One of the great disgraces of the Democratic Party was allowing this guy to be seated. Dave", 
        "threadID": "672198221_7390014422001", 
        "time": "2009-05-27 14:55:00", 
        "title": "Burris digs hole deeper after FBI Wiretap Transcript is released", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by L0A1: He admitted to a lot of these things, not in the details the wiretaps prove, but he did say he was in more contact then he originally admitted. One of the great disgraces of the Democratic Party was allowing this guy to be seated. Dave At the time, I don't think they could stop it could they? I mean the Gov hadn't been indicted yet so it was \"technically\" a legal appointment. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090527, 
        "postID": 4, 
        "quote": "Originally posted by Grachus: quote: Originally posted by L0A1: He admitted to a lot of these things, not in the details the wiretaps prove, but he did say he was in more contact then he originally admitted. One of the great disgraces of the Democratic Party was allowing this guy to be seated. Dave", 
        "reply": " At the time, I don't think they could stop it could they? I mean the Gov hadn't been indicted yet so it was \"technically\" a legal appointment. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7390014422001", 
        "time": "2009-05-27 15:39:00", 
        "title": "Burris digs hole deeper after FBI Wiretap Transcript is released", 
        "userID": "L0A1"
    }, 
    {
        "content": "The dems swore up and down that they wouldn't accept ANYONE that Blagojevich appointed. Then Burris gets the appointment and they all say, Oh good, Blagojevich appointed someone we like, let's accept him. Who cares what we said we would do?", 
        "intTime": 20090527, 
        "postID": 5, 
        "quote": "", 
        "reply": "The dems swore up and down that they wouldn't accept ANYONE that Blagojevich appointed. Then Burris gets the appointment and they all say, Oh good, Blagojevich appointed someone we like, let's accept him. Who cares what we said we would do?", 
        "threadID": "672198221_7390014422001", 
        "time": "2009-05-27 15:56:00", 
        "title": "Burris digs hole deeper after FBI Wiretap Transcript is released", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "That guy is about as crooked as they come. Why don't Il just hold a special election and take him out?", 
        "intTime": 20090527, 
        "postID": 6, 
        "quote": "", 
        "reply": "That guy is about as crooked as they come. Why don't Il just hold a special election and take him out?", 
        "threadID": "672198221_7390014422001", 
        "time": "2009-05-27 15:58:00", 
        "title": "Burris digs hole deeper after FBI Wiretap Transcript is released", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: That guy is about as crooked as they come. Why don't Il just hold a special election and take him out? They are affraid of losing their 60 man vote. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090527, 
        "postID": 7, 
        "quote": "Originally posted by crackerjacks61: That guy is about as crooked as they come. Why don't Il just hold a special election and take him out?", 
        "reply": " They are affraid of losing their 60 man vote. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7390014422001", 
        "time": "2009-05-27 16:00:00", 
        "title": "Burris digs hole deeper after FBI Wiretap Transcript is released", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by iamgonzo: The dems swore up and down that they wouldn't accept ANYONE that Blagojevich appointed. Then Burris gets the appointment and they all say, Oh good, Blagojevich appointed someone we like, let's accept him. Who cares what we said we would do? At the time they had no legal right to stop it. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090527, 
        "postID": 8, 
        "quote": "Originally posted by iamgonzo: The dems swore up and down that they wouldn't accept ANYONE that Blagojevich appointed. Then Burris gets the appointment and they all say, Oh good, Blagojevich appointed someone we like, let's accept him. Who cares what we said we would do?", 
        "reply": " At the time they had no legal right to stop it. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_7390014422001", 
        "time": "2009-05-27 16:00:00", 
        "title": "Burris digs hole deeper after FBI Wiretap Transcript is released", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by iamgonzo: The dems swore up and down that they wouldn't accept ANYONE that Blagojevich appointed. Then Burris gets the appointment and they all say, Oh good, Blagojevich appointed someone we like, let's accept him. Who cares what we said we would do? At the time they had no legal right to stop it. The Senate is allowed to make it's own rules. The successor to Blagovitch IS a Democrat, and could would and could appoint another Democrat. Personally I believe they were afrid of being called racists. Burris is superficially clean. My point here is not the merits of Burris, but rather who appointed him. Blogo was impeached within days of his appointment of Burris. Anything coming from him should have been flagged as a matter or principle. But even if I am wrong about what the Senate can and cannot do, The Democrats should have opposed him, and if need be, let the Courts install him. Dave Dave", 
        "intTime": 20090527, 
        "postID": 9, 
        "quote": "Originally posted by L0A1: quote: Originally posted by iamgonzo: The dems swore up and down that they wouldn't accept ANYONE that Blagojevich appointed. Then Burris gets the appointment and they all say, Oh good, Blagojevich appointed someone we like, let's accept him. Who cares what we said we would do? At the time they had no legal right to stop it.", 
        "reply": " The Senate is allowed to make it's own rules. The successor to Blagovitch IS a Democrat, and could would and could appoint another Democrat. Personally I believe they were afrid of being called racists. Burris is superficially clean. My point here is not the merits of Burris, but rather who appointed him. Blogo was impeached within days of his appointment of Burris. Anything coming from him should have been flagged as a matter or principle. But even if I am wrong about what the Senate can and cannot do, The Democrats should have opposed him, and if need be, let the Courts install him. Dave Dave", 
        "threadID": "672198221_7390014422001", 
        "time": "2009-05-27 16:15:00", 
        "title": "Burris digs hole deeper after FBI Wiretap Transcript is released", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by L0A1: He admitted to a lot of these things, not in the details the wiretaps prove, but he did say he was in more contact then he originally admitted. One of the great disgraces of the Democratic Party was allowing this guy to be seated. Dave Agreed. He's mutually hated by both parties. Such a shady appointment and selection process. I hope he causes the Democrats to lose the seat to a Republican in the near future.", 
        "intTime": 20090527, 
        "postID": 10, 
        "quote": "Originally posted by Grachus: quote: Originally posted by L0A1: He admitted to a lot of these things, not in the details the wiretaps prove, but he did say he was in more contact then he originally admitted. One of the great disgraces of the Democratic Party was allowing this guy to be seated. Dave", 
        "reply": " Agreed. He's mutually hated by both parties. Such a shady appointment and selection process. I hope he causes the Democrats to lose the seat to a Republican in the near future.", 
        "threadID": "672198221_7390014422001", 
        "time": "2009-05-27 16:23:00", 
        "title": "Burris digs hole deeper after FBI Wiretap Transcript is released", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "I can't understand why so many are a bit upset about Burris and him being crooked. It's common knowledge here in Illinois that Chitown politicians are the most crooked in the land. One guy is even an ex-Black Panther. He's the one that always puts anti-gun rights Bills up for vote. Yip!!!! Chitown politicians........", 
        "intTime": 20090527, 
        "postID": 11, 
        "quote": "", 
        "reply": "I can't understand why so many are a bit upset about Burris and him being crooked. It's common knowledge here in Illinois that Chitown politicians are the most crooked in the land. One guy is even an ex-Black Panther. He's the one that always puts anti-gun rights Bills up for vote. Yip!!!! Chitown politicians........", 
        "threadID": "672198221_7390014422001", 
        "time": "2009-05-27 17:03:00", 
        "title": "Burris digs hole deeper after FBI Wiretap Transcript is released", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "Now, the Senate MAY throw Burris out as his ethics att least , ate bad. But they won't, they need him for a while yet to support the current legislation. Once he's no longer useful, out with the trash he goes....unless he's already in the slam.", 
        "intTime": 20090527, 
        "postID": 12, 
        "quote": "", 
        "reply": "Now, the Senate MAY throw Burris out as his ethics att least , ate bad. But they won't, they need him for a while yet to support the current legislation. Once he's no longer useful, out with the trash he goes....unless he's already in the slam.", 
        "threadID": "672198221_7390014422001", 
        "time": "2009-05-27 19:40:00", 
        "title": "Burris digs hole deeper after FBI Wiretap Transcript is released", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by iamgonzo: The dems swore up and down that they wouldn't accept ANYONE that Blagojevich appointed. Then Burris gets the appointment and they all say, Oh good, Blagojevich appointed someone we like, let's accept him. Who cares what we said we would do? At the time they had no legal right to stop it. When has not having the legal right to do something stopped the senate from trying? If they didn't have the right why did they say they would block him? Do politicians ever keep their word? Is it better to sound tough and then back down, or just keep your mouth shut? Where does the white go when the snow melts? The answers to these, and many other questions on the next episode of dopes.", 
        "intTime": 20090527, 
        "postID": 13, 
        "quote": "Originally posted by L0A1: quote: Originally posted by iamgonzo: The dems swore up and down that they wouldn't accept ANYONE that Blagojevich appointed. Then Burris gets the appointment and they all say, Oh good, Blagojevich appointed someone we like, let's accept him. Who cares what we said we would do? At the time they had no legal right to stop it.", 
        "reply": " When has not having the legal right to do something stopped the senate from trying? If they didn't have the right why did they say they would block him? Do politicians ever keep their word? Is it better to sound tough and then back down, or just keep your mouth shut? Where does the white go when the snow melts? The answers to these, and many other questions on the next episode of dopes.", 
        "threadID": "672198221_7390014422001", 
        "time": "2009-05-27 20:48:00", 
        "title": "Burris digs hole deeper after FBI Wiretap Transcript is released", 
        "userID": "iamgonzo"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Now, the Senate MAY throw Burris out as his ethics att least , ate bad. But they won't, they need him for a while yet to support the current legislation. Once he's no longer useful, out with the trash he goes....unless he's already in the slam. Well, that's the odd part here. The present govenor, also a Democrat can replace him, and would of course choose a Democrat. The process would take days. They really DON'T need him. Dave", 
        "intTime": 20090528, 
        "postID": 14, 
        "quote": "Originally posted by peter3_1: Now, the Senate MAY throw Burris out as his ethics att least , ate bad. But they won't, they need him for a while yet to support the current legislation. Once he's no longer useful, out with the trash he goes....unless he's already in the slam.", 
        "reply": " Well, that's the odd part here. The present govenor, also a Democrat can replace him, and would of course choose a Democrat. The process would take days. They really DON'T need him. Dave", 
        "threadID": "672198221_7390014422001", 
        "time": "2009-05-28 09:46:00", 
        "title": "Burris digs hole deeper after FBI Wiretap Transcript is released", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: That guy is about as crooked as they come. Why don't Il just hold a special election and take him out? Because the guy most likely to win a special election is Congressman Mark Kirk. (He's a Republican from Chicagoland's northshore)", 
        "intTime": 20090528, 
        "postID": 15, 
        "quote": "Originally posted by crackerjacks61: That guy is about as crooked as they come. Why don't Il just hold a special election and take him out?", 
        "reply": " Because the guy most likely to win a special election is Congressman Mark Kirk. (He's a Republican from Chicagoland's northshore)", 
        "threadID": "672198221_7390014422001", 
        "time": "2009-05-28 12:02:00", 
        "title": "Burris digs hole deeper after FBI Wiretap Transcript is released", 
        "userID": "shuman14"
    }, 
    {
        "content": "quote: Originally posted by shuman14: quote: Originally posted by crackerjacks61: That guy is about as crooked as they come. Why don't Il just hold a special election and take him out? Because the guy most likely to win a special election is Congressman Mark Kirk. (He's a Republican from Chicagoland's northshore) Already past the future", 
        "intTime": 20090528, 
        "postID": 16, 
        "quote": "Originally posted by shuman14: quote: Originally posted by crackerjacks61: That guy is about as crooked as they come. Why don't Il just hold a special election and take him out? Because the guy most likely to win a special election is Congressman Mark Kirk. (He's a Republican from Chicagoland's northshore)", 
        "reply": " Already past the future", 
        "threadID": "672198221_7390014422001", 
        "time": "2009-05-28 12:05:00", 
        "title": "Burris digs hole deeper after FBI Wiretap Transcript is released", 
        "userID": "6486143"
    }, 
    {
        "content": "The only reason this guy was appointed was because he was a black man stirring the race-card pot...", 
        "intTime": 20090528, 
        "postID": 17, 
        "quote": "", 
        "reply": "The only reason this guy was appointed was because he was a black man stirring the race-card pot...", 
        "threadID": "672198221_7390014422001", 
        "time": "2009-05-28 12:54:00", 
        "title": "Burris digs hole deeper after FBI Wiretap Transcript is released", 
        "userID": "Irwin_R_Schyster"
    }
]