[
    {
        "content": "quote: CHILLING testimony by Israeli soldiers substantiates charges that Israel’s Gaza Strip assault entailed grave violations of international law. The emergence of a predominantly right-wing, nationalist government in Israel suggests that there may be more violations to come. Hamas’s indiscriminate rocket attacks on Israeli civilians also constituted war crimes, but do not excuse Israel’s transgressions. While Israel disputes some of the soldiers’ accounts, the evidence suggests that Israel committed the following six offenses: • Violating its duty to protect the civilian population of the Gaza Strip. Despite Israel’s 2005 “disengagement” from Gaza, the territory remains occupied. Israel unleashed military firepower against a people it is legally bound to protect. • Imposing collective punishment in the form of a blockade, in violation of Article 33 of the Fourth Geneva Convention. In June 2007, after Hamas took power in the Gaza Strip, Israel imposed suffocating restrictions on trade and movement. The blockade — an act of war in customary international law — has helped plunge families into poverty, children into malnutrition, and patients denied access to medical treatment into their graves. People in Gaza thus faced Israel’s winter onslaught in particularly weakened conditions. • Deliberately attacking civilian targets. The laws of war permit attacking a civilian object only when it is making an effective contribution to military action and a definite military advantage is gained by its destruction. Yet an Israeli general, Dan Harel, said, “We are hitting not only terrorists and launchers, but also the whole Hamas government and all its wings.” An Israeli military spokeswoman, Maj. Avital Leibovich, avowed that “anything affiliated with Hamas is a legitimate target.” Israeli fire destroyed or damaged mosques, hospitals, factories, schools, a key sewage plant, institutions like the parliament, the main ministries, the central prison and police stations, and thousands of houses. • Willfully killing civilians without military justification. When civilian institutions are struck, civilians — persons who are not members of the armed forces of a warring party, and are not taking direct part in hostilities — are killed. International law authorizes killings of civilians if the objective of the attack is military, and the means are proportional to the advantage gained. Yet proportionality is irrelevant if the targets of attack were not military to begin with. Gaza government employees — traffic policemen, court clerks, secretaries and others — are not combatants merely because Israel considers Hamas, the governing party, a terrorist organization. Many countries do not regard violence against foreign military occupation as terrorism. Of 1,434 Palestinians killed in the Gaza invasion, 960 were civilians, including 121 women and 288 children, according to a United Nations special rapporteur, Richard Falk. Israeli military lawyers instructed army commanders that Palestinians who remained in a targeted building after having been warned to leave were “voluntary human shields,” and thus combatants. Israeli gunners “knocked on roofs” — that is, fired first at corners of buildings, before hitting more vulnerable points — to “warn” Palestinian residents to flee. With nearly all exits from the densely populated Gaza Strip blocked by Israel, and chaos reigning within it, this was a particularly cruel flaunting of international law. Willful killings of civilians that are not required by military necessity are grave breaches of the Geneva Conventions, and are considered war crimes under the Nuremberg principles. • Deliberately employing disproportionate force. Last year, Gen. Gadi Eisenkot, head of Israel’s northern command, speaking on possible future conflicts with neighbors, stated, “We will wield disproportionate power against every village from which shots are fired on Israel, and cause immense damage and destruction.” Such a frank admission of illegal intent can constitute evidence in a criminal prosecution. • Illegal use of weapons, including white phosphorus. Israel was finally forced to admit, after initial denials, that it employed white phosphorous in the Gaza Strip, though Israel defended its use as legal. White phosphorous may be legally used as an obscurant, not as a weapon, as it burns deeply and is extremely difficult to extinguish. Israeli political and military personnel who planned, ordered or executed these possible offenses should face criminal prosecution. The appointment of Richard Goldstone, the former war crimes prosecutor from South Africa, to head a fact-finding team into possible war crimes by both parties to the Gaza conflict is an important step in the right direction. The stature of international law is diminished when a nation violates it with impunity. (....) +http://www.nytimes.com/2009/04/04/opinion/04bisharat.html?em \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090404, 
        "postID": 1, 
        "quote": "CHILLING testimony by Israeli soldiers substantiates charges that Israel’s Gaza Strip assault entailed grave violations of international law. The emergence of a predominantly right-wing, nationalist government in Israel suggests that there may be more violations to come. Hamas’s indiscriminate rocket attacks on Israeli civilians also constituted war crimes, but do not excuse Israel’s transgressions. While Israel disputes some of the soldiers’ accounts, the evidence suggests that Israel committed the following six offenses: • Violating its duty to protect the civilian population of the Gaza Strip. Despite Israel’s 2005 “disengagement” from Gaza, the territory remains occupied. Israel unleashed military firepower against a people it is legally bound to protect. • Imposing collective punishment in the form of a blockade, in violation of Article 33 of the Fourth Geneva Convention. In June 2007, after Hamas took power in the Gaza Strip, Israel imposed suffocating restrictions on trade and movement. The blockade — an act of war in customary international law — has helped plunge families into poverty, children into malnutrition, and patients denied access to medical treatment into their graves. People in Gaza thus faced Israel’s winter onslaught in particularly weakened conditions. • Deliberately attacking civilian targets. The laws of war permit attacking a civilian object only when it is making an effective contribution to military action and a definite military advantage is gained by its destruction. Yet an Israeli general, Dan Harel, said, “We are hitting not only terrorists and launchers, but also the whole Hamas government and all its wings.” An Israeli military spokeswoman, Maj. Avital Leibovich, avowed that “anything affiliated with Hamas is a legitimate target.” Israeli fire destroyed or damaged mosques, hospitals, factories, schools, a key sewage plant, institutions like the parliament, the main ministries, the central prison and police stations, and thousands of houses. • Willfully killing civilians without military justification. When civilian institutions are struck, civilians — persons who are not members of the armed forces of a warring party, and are not taking direct part in hostilities — are killed. International law authorizes killings of civilians if the objective of the attack is military, and the means are proportional to the advantage gained. Yet proportionality is irrelevant if the targets of attack were not military to begin with. Gaza government employees — traffic policemen, court clerks, secretaries and others — are not combatants merely because Israel considers Hamas, the governing party, a terrorist organization. Many countries do not regard violence against foreign military occupation as terrorism. Of 1,434 Palestinians killed in the Gaza invasion, 960 were civilians, including 121 women and 288 children, according to a United Nations special rapporteur, Richard Falk. Israeli military lawyers instructed army commanders that Palestinians who remained in a targeted building after having been warned to leave were “voluntary human shields,” and thus combatants. Israeli gunners “knocked on roofs” — that is, fired first at corners of buildings, before hitting more vulnerable points — to “warn” Palestinian residents to flee. With nearly all exits from the densely populated Gaza Strip blocked by Israel, and chaos reigning within it, this was a particularly cruel flaunting of international law. Willful killings of civilians that are not required by military necessity are grave breaches of the Geneva Conventions, and are considered war crimes under the Nuremberg principles. • Deliberately employing disproportionate force. Last year, Gen. Gadi Eisenkot, head of Israel’s northern command, speaking on possible future conflicts with neighbors, stated, “We will wield disproportionate power against every village from which shots are fired on Israel, and cause immense damage and destruction.” Such a frank admission of illegal intent can constitute evidence in a criminal prosecution. • Illegal use of weapons, including white phosphorus. Israel was finally forced to admit, after initial denials, that it employed white phosphorous in the Gaza Strip, though Israel defended its use as legal. White phosphorous may be legally used as an obscurant, not as a weapon, as it burns deeply and is extremely difficult to extinguish. Israeli political and military personnel who planned, ordered or executed these possible offenses should face criminal prosecution. The appointment of Richard Goldstone, the former war crimes prosecutor from South Africa, to head a fact-finding team into possible war crimes by both parties to the Gaza conflict is an important step in the right direction. The stature of international law is diminished when a nation violates it with impunity. (....)", 
        "reply": " +http://www.nytimes.com/2009/04/04/opinion/04bisharat.html?em \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 09:08:00", 
        "title": "Israel on Trial", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: predominantly right- The IDF did it's best not to harm civilians. Any other army (yes, including US) would cause much greater casuallties. In wars, the are innocents who get killed. It's terrible, but that's life. The ones to blame are HAMAS- who hide behing children and women that are put to the line. IDF has the highest possible moral code. check my blog at \"israelisoldier.blogspot.com\" for more of my thoughts. Yoav, welcome to the Discussions. Please review the Terms Of Service for this website, hot links/direct links are not allowed here. In the future, just type in any links similar to how I changed the one you posted above. Gypsysnipe Moderator This message has been edited. Last edited by: gypsysnipe, Sat 04 April 2009 11:35 AM", 
        "intTime": 20090404, 
        "postID": 2, 
        "quote": "predominantly right-", 
        "reply": " The IDF did it's best not to harm civilians. Any other army (yes, including US) would cause much greater casuallties. In wars, the are innocents who get killed. It's terrible, but that's life. The ones to blame are HAMAS- who hide behing children and women that are put to the line. IDF has the highest possible moral code. check my blog at \"israelisoldier.blogspot.com\" for more of my thoughts. Yoav, welcome to the Discussions. Please review the Terms Of Service for this website, hot links/direct links are not allowed here. In the future, just type in any links similar to how I changed the one you posted above. Gypsysnipe Moderator This message has been edited. Last edited by: gypsysnipe, Sat 04 April 2009 11:35 AM", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 10:47:00", 
        "title": "Israel on Trial", 
        "userID": "yoavb_idf"
    }, 
    {
        "content": "I'm so sick of the whole Israel/Gaza mess. This war will never, ever, ever, ever end. So much finger pointing......... They are both wrong. Hate on both sides.", 
        "intTime": 20090404, 
        "postID": 3, 
        "quote": "", 
        "reply": "I'm so sick of the whole Israel/Gaza mess. This war will never, ever, ever, ever end. So much finger pointing......... They are both wrong. Hate on both sides.", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 10:55:00", 
        "title": "Israel on Trial", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Tell you the truth? I'm sick of it probably much more than you... Problem is- we can't just take out legs and leave, you know. It's not like they gonna stop firing those rockets at us. War is ****, that's a known fact. Won't argue about it...", 
        "intTime": 20090404, 
        "postID": 4, 
        "quote": "", 
        "reply": "Tell you the truth? I'm sick of it probably much more than you... Problem is- we can't just take out legs and leave, you know. It's not like they gonna stop firing those rockets at us. War is ****, that's a known fact. Won't argue about it...", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 11:01:00", 
        "title": "Israel on Trial", 
        "userID": "yoavb_idf"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: I'm so sick of the whole Israel/Gaza mess. This war will never, ever, ever, ever end. So much finger pointing......... They are both wrong. Hate on both sides. Why would you think it would end considering these people have been fighting each other over the same chunk of land for over a thousand years? Man we are so nieve .", 
        "intTime": 20090404, 
        "postID": 5, 
        "quote": "Originally posted by mrmixitup: I'm so sick of the whole Israel/Gaza mess. This war will never, ever, ever, ever end. So much finger pointing......... They are both wrong. Hate on both sides.", 
        "reply": " Why would you think it would end considering these people have been fighting each other over the same chunk of land for over a thousand years? Man we are so nieve .", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 13:26:00", 
        "title": "Israel on Trial", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "It might prove interesting for you to read the timeline of Israel beginning 79 AD through 1960. The first recording of a Palestinian reference on an attack of Jewish population of Hebron citizens was 1929. This Palestinian reference to the area, not a government or a people, or a bloodline. From the time of the Romans to present most attacks on both Muslim and Hebrew cultures were from predominately Christian background Europeans. As you know tens of millions were slaughter by various means including the Crusades, Inquisitions and Wars. I'm Not argueing the that it seems forever that they been at each others throats but at one time the Arab and Jews were allied against the European and Christians. \"http://timelines.ws/countries/ISRAEL1960.HTML", 
        "intTime": 20090404, 
        "postID": 6, 
        "quote": "", 
        "reply": "It might prove interesting for you to read the timeline of Israel beginning 79 AD through 1960. The first recording of a Palestinian reference on an attack of Jewish population of Hebron citizens was 1929. This Palestinian reference to the area, not a government or a people, or a bloodline. From the time of the Romans to present most attacks on both Muslim and Hebrew cultures were from predominately Christian background Europeans. As you know tens of millions were slaughter by various means including the Crusades, Inquisitions and Wars. I'm Not argueing the that it seems forever that they been at each others throats but at one time the Arab and Jews were allied against the European and Christians. \"http://timelines.ws/countries/ISRAEL1960.HTML", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 16:12:00", 
        "title": "Israel on Trial", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "- Duty to protect the civilian population - that's one I hadn't previously considered. It might be different if Gaza was 'another country', like Lebanon. But as the author notes, Israel has a duty not to harm civilians that it is legally bound to protect. -", 
        "intTime": 20090404, 
        "postID": 7, 
        "quote": "", 
        "reply": "- Duty to protect the civilian population - that's one I hadn't previously considered. It might be different if Gaza was 'another country', like Lebanon. But as the author notes, Israel has a duty not to harm civilians that it is legally bound to protect. -", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 20:24:00", 
        "title": "Israel on Trial", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "Ah, it is good to see another IDF member on the board. Shalom Yoav. To the topic: NSNN, i have addressed the issue of \"CHILLING testimony by Israeli soldiers\". It have been proved as crap. Both of them admit that they have not seen anything, and all they have is hearsay. link We are not legally bound to protect anyone in Gaza. To all purposes it is almost another nation. It has its flag, its government, and much more of \"state's attributes\". If we wre bound to protect it, we should have been its government, because it is a task of the government to protect its populace. Gazans are not ours, we have made it clear in 2006. We are bound to minimize civilian losses, and that what we have done there. Do you realize that if we have NOT exercised restraint, Gaza would have been hole in the ground after 1 hour? If by \"civilian targets\" you mean \"Hamas political government\", i must disappoint you. They are legal targets, much like Reichstag in ww2. Killing Hania during the fighting would have been legal act, much like killing Hitler. Mr. Falk is not a unbiased source, so qouting him will not accomplish much. IDF has other numbers. Out of 1300 dead, 900 or so (As far as i remember) were terrorists. \"Deliberately employing disproportionate force.\" Gee, explain to me what is a proportionate one. Should we have shot at them with our quassams? We have used WP rounds as an obscurant. You have yet to prove that we have used it DELIBERATELY on \"civilian population\". Should i tell you what really happened in Gaza from my personal experiences? You know, pillow kids, 10 year's old with RPG and so on. Mr. Falk and NY times fail to mention it. Now about article 33 of Geneva convention that you have chosen to quote. If you will look in Wikipedia you will see what it actually says-\"By collective punishment, the drafters of the Geneva Conventions had in mind the reprisal killings of World Wars I and II\". In case you did not know, it is very important what the drafters meant, because you have to interpret the convention in that way. Since blockade is an acceptable tool of warfare (blockade as is in \"no trading\") We can ignore protocol 2 as well. What we are required is to provide access to the goods to Gaza, and even that we can ignore, if these goods fall to the hands of the enemy (Hamas). Since that has already happened, we can starve them all, in a completely legal way. This message has been edited. Last edited by: PanzerMeister, Sun 05 April 2009 07:14 AM", 
        "intTime": 20090405, 
        "postID": 8, 
        "quote": "", 
        "reply": "Ah, it is good to see another IDF member on the board. Shalom Yoav. To the topic: NSNN, i have addressed the issue of \"CHILLING testimony by Israeli soldiers\". It have been proved as crap. Both of them admit that they have not seen anything, and all they have is hearsay. link We are not legally bound to protect anyone in Gaza. To all purposes it is almost another nation. It has its flag, its government, and much more of \"state's attributes\". If we wre bound to protect it, we should have been its government, because it is a task of the government to protect its populace. Gazans are not ours, we have made it clear in 2006. We are bound to minimize civilian losses, and that what we have done there. Do you realize that if we have NOT exercised restraint, Gaza would have been hole in the ground after 1 hour? If by \"civilian targets\" you mean \"Hamas political government\", i must disappoint you. They are legal targets, much like Reichstag in ww2. Killing Hania during the fighting would have been legal act, much like killing Hitler. Mr. Falk is not a unbiased source, so qouting him will not accomplish much. IDF has other numbers. Out of 1300 dead, 900 or so (As far as i remember) were terrorists. \"Deliberately employing disproportionate force.\" Gee, explain to me what is a proportionate one. Should we have shot at them with our quassams? We have used WP rounds as an obscurant. You have yet to prove that we have used it DELIBERATELY on \"civilian population\". Should i tell you what really happened in Gaza from my personal experiences? You know, pillow kids, 10 year's old with RPG and so on. Mr. Falk and NY times fail to mention it. Now about article 33 of Geneva convention that you have chosen to quote. If you will look in Wikipedia you will see what it actually says-\"By collective punishment, the drafters of the Geneva Conventions had in mind the reprisal killings of World Wars I and II\". In case you did not know, it is very important what the drafters meant, because you have to interpret the convention in that way. Since blockade is an acceptable tool of warfare (blockade as is in \"no trading\") We can ignore protocol 2 as well. What we are required is to provide access to the goods to Gaza, and even that we can ignore, if these goods fall to the hands of the enemy (Hamas). Since that has already happened, we can starve them all, in a completely legal way. This message has been edited. Last edited by: PanzerMeister, Sun 05 April 2009 07:14 AM", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 06:54:00", 
        "title": "Israel on Trial", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: Ah, it is good to see another IDF member on the board. Shalom Yoav. To the topic: NSNN, i have addressed the issue of \"CHILLING testimony by Israeli soldiers\". It have been proved as crap. Both of them admit that they have not seen anything, and all they have is hearsay. link Now that's really adorable. You link to a previous post of YOURS saying this is all BS, and using your own words as a source. Gosh - How original! Dave", 
        "intTime": 20090405, 
        "postID": 9, 
        "quote": "Originally posted by PanzerMeister: Ah, it is good to see another IDF member on the board. Shalom Yoav. To the topic: NSNN, i have addressed the issue of \"CHILLING testimony by Israeli soldiers\". It have been proved as crap. Both of them admit that they have not seen anything, and all they have is hearsay. link", 
        "reply": " Now that's really adorable. You link to a previous post of YOURS saying this is all BS, and using your own words as a source. Gosh - How original! Dave", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 08:14:00", 
        "title": "Israel on Trial", 
        "userID": "Grachus"
    }, 
    {
        "content": "Do bother to read the link AT FULL please. Last my 2 posts to be precise. There is a link there. The link is in Hebrew, BUT, as i have already said NY has used Haarez in the first place as their source. I seriously doubt that NY has talked to the soldiers in the first place. And since Walla is Haarez site, we can safely deduct the following- Step 1)NY used Haarez=walla as its source for accusation of IDF. Step 2)Haarez backs off. Step 3)Hmmm...What does it say about NY accusations and NSNN claims? And, what does it say about NY reporter professionalism and honesty (I bet that they have not published an apology for the caricature OR a follow up on the story)? We all know what it says about NSNN, but it was obvious well before NY cries of \"foul\". The caricature done by brave and honest NY: Posting such crap before even BASIC investigation, is EXTREMELY unprofessional and represents journalism at its worst.", 
        "intTime": 20090405, 
        "postID": 10, 
        "quote": "", 
        "reply": "Do bother to read the link AT FULL please. Last my 2 posts to be precise. There is a link there. The link is in Hebrew, BUT, as i have already said NY has used Haarez in the first place as their source. I seriously doubt that NY has talked to the soldiers in the first place. And since Walla is Haarez site, we can safely deduct the following- Step 1)NY used Haarez=walla as its source for accusation of IDF. Step 2)Haarez backs off. Step 3)Hmmm...What does it say about NY accusations and NSNN claims? And, what does it say about NY reporter professionalism and honesty (I bet that they have not published an apology for the caricature OR a follow up on the story)? We all know what it says about NSNN, but it was obvious well before NY cries of \"foul\". The caricature done by brave and honest NY: Posting such crap before even BASIC investigation, is EXTREMELY unprofessional and represents journalism at its worst.", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 08:27:00", 
        "title": "Israel on Trial", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: Do bother to read the link AT FULL please. Last my 2 posts to be precise. There is a link there. The link is in Hebrew, BUT, as i have already said NY has used Haarez in the first place as their source. I seriously doubt that NY has talked to the soldiers in the first place. And since Walla is Haarez site, we can safely deduct the following- Step 1)NY used Haarez=walla as its source for accusation of IDF. Step 2)Haarez backs off. Step 3)Hmmm...What does it say about NY accusations and NSNN claims? And, what does it say about NY reporter professionalism and honesty (I bet that they have not published an apology for the caricature OR a follow up on the story)? We all know what it says about NSNN, but it was obvious well before NY cries of \"foul\". What?!?! Are you trying to confuse us into considering you personally as a valid source! BTW, I looked at the other thread (you linked), and it seems that the first & last link are from BBC!?! Also, I HAVEN’T PERSONALY CLAIMED anything…..I only posted a very valid & interesting OP-ED by George Bisharat! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090405, 
        "postID": 11, 
        "quote": "Originally posted by PanzerMeister: Do bother to read the link AT FULL please. Last my 2 posts to be precise. There is a link there. The link is in Hebrew, BUT, as i have already said NY has used Haarez in the first place as their source. I seriously doubt that NY has talked to the soldiers in the first place. And since Walla is Haarez site, we can safely deduct the following- Step 1)NY used Haarez=walla as its source for accusation of IDF. Step 2)Haarez backs off. Step 3)Hmmm...What does it say about NY accusations and NSNN claims? And, what does it say about NY reporter professionalism and honesty (I bet that they have not published an apology for the caricature OR a follow up on the story)? We all know what it says about NSNN, but it was obvious well before NY cries of \"foul\".", 
        "reply": " What?!?! Are you trying to confuse us into considering you personally as a valid source! BTW, I looked at the other thread (you linked), and it seems that the first & last link are from BBC!?! Also, I HAVEN’T PERSONALY CLAIMED anything…..I only posted a very valid & interesting OP-ED by George Bisharat! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 08:53:00", 
        "title": "Israel on Trial", 
        "userID": "NSNN"
    }, 
    {
        "content": "\"http://news.walla.co.il/?w=/1/1460854\" The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter.", 
        "intTime": 20090405, 
        "postID": 12, 
        "quote": "", 
        "reply": "\"http://news.walla.co.il/?w=/1/1460854\" The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter.", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 09:05:00", 
        "title": "Israel on Trial", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/1/1460854\" It’s in Hebrew! The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter. What report? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090405, 
        "postID": 13, 
        "quote": "Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/1/1460854\" It’s in Hebrew! The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter. What report?", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 09:25:00", 
        "title": "Israel on Trial", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/1/1460854\" It’s in Hebrew! The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter. What report? I've looked at dozens of article that site the Harratz report, in which \"dozens\" of Israeli soldiers talk about the atrocities they watched. They're all liars? Dave", 
        "intTime": 20090405, 
        "postID": 14, 
        "quote": "Originally posted by NSNN: quote: Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/1/1460854\" It’s in Hebrew! The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter. What report?", 
        "reply": " I've looked at dozens of article that site the Harratz report, in which \"dozens\" of Israeli soldiers talk about the atrocities they watched. They're all liars? Dave", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 09:28:00", 
        "title": "Israel on Trial", 
        "userID": "Grachus"
    }, 
    {
        "content": "and yet nothing about what hamas and other Palestinian terror groups do.... nothing... like what they do is now accepted....but yet Israel isnt allowed to protect themselves from a hostile intruder... go and do whatever you have to do Israel hell kill them all if you have to...", 
        "intTime": 20090405, 
        "postID": 15, 
        "quote": "", 
        "reply": "and yet nothing about what hamas and other Palestinian terror groups do.... nothing... like what they do is now accepted....but yet Israel isnt allowed to protect themselves from a hostile intruder... go and do whatever you have to do Israel hell kill them all if you have to...", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 09:34:00", 
        "title": "Israel on Trial", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Dave-There were no \"Dozens\". Just 2 idiots. That what happens when you write something with agenda. You twist facts. 2 idiots turned 12. Like all rumors go, this \"rumor/news article\" grew bigger of its initial source. And yes, these \"Sources\" that you mention, are just one source really. It is Haarez article translated to English with different wording. Unless your \"Sources\" have done independent work (like interviewing the soldiers), they all count as one. It all has started with 2 idiots saying that \"Idf had done this and that\". NY and some other news hungry newspapers decided to capitalize on the event, and quoted Haarez, which published these 2 idiots words in the first place. During the \"Objective investigation\" done by NY and their ilk, the idiots were multiplied. NSNN-This is Israel News. Of course that it is in Hebrew. If foreign newspapers were not up to the task of publishing up-to date information, it is not my fault. As a matter of fact it is the fault of NY newspaper, because it does not give a follow up on the story, after publishing such an information. What US citizens that DO NOT know Hebrew are to understand? That IDF soldiers are headless Nazi Brutes? The only thing that i have found is here \"http://www.jewlicious.com/2009/03/idfs-military-advocate-general-closes-criminal-investigation-into-allegations-made-by-soldiers-about-gaza-offensive/\". It is NOT official news site, but it saves me the trouble to translate word for word the Hebrew article. Of course if you will find that NY HAS done a follow up, i will take my words back. Meanwhile, all i have to say, is that NY conduct is a classical case of unprofessional work, that can be only classified as a malpractice. You claim that \"i have not claimed such a thing\". Given your history of pointless Israel bashing, I do not and will not believe you. Edit: I have found one Newspaper that did have a follow up. \"http://www.boston.com/news/world/middleeast/articles/2009/03/31/israeli_investigation_dismisses_charges_of_misconduct_in_gaza_war/\" Still, i wonder if Ny has done the same. \"http://en.wikinews.org/wiki/IDF_soldiers%27_account_of_Gaza_incursion_sparks_new_war_crimes_investigations\" As is seen from this link, there were only 2 idiots. How 2 turned out to be 12? Hmm.... Of course, Haarez is not without blame, but blind subsequent publishing is, in my opinion, even worse. This message has been edited. Last edited by: PanzerMeister, Sun 05 April 2009 11:21 AM", 
        "intTime": 20090405, 
        "postID": 16, 
        "quote": "", 
        "reply": "Dave-There were no \"Dozens\". Just 2 idiots. That what happens when you write something with agenda. You twist facts. 2 idiots turned 12. Like all rumors go, this \"rumor/news article\" grew bigger of its initial source. And yes, these \"Sources\" that you mention, are just one source really. It is Haarez article translated to English with different wording. Unless your \"Sources\" have done independent work (like interviewing the soldiers), they all count as one. It all has started with 2 idiots saying that \"Idf had done this and that\". NY and some other news hungry newspapers decided to capitalize on the event, and quoted Haarez, which published these 2 idiots words in the first place. During the \"Objective investigation\" done by NY and their ilk, the idiots were multiplied. NSNN-This is Israel News. Of course that it is in Hebrew. If foreign newspapers were not up to the task of publishing up-to date information, it is not my fault. As a matter of fact it is the fault of NY newspaper, because it does not give a follow up on the story, after publishing such an information. What US citizens that DO NOT know Hebrew are to understand? That IDF soldiers are headless Nazi Brutes? The only thing that i have found is here \"http://www.jewlicious.com/2009/03/idfs-military-advocate-general-closes-criminal-investigation-into-allegations-made-by-soldiers-about-gaza-offensive/\". It is NOT official news site, but it saves me the trouble to translate word for word the Hebrew article. Of course if you will find that NY HAS done a follow up, i will take my words back. Meanwhile, all i have to say, is that NY conduct is a classical case of unprofessional work, that can be only classified as a malpractice. You claim that \"i have not claimed such a thing\". Given your history of pointless Israel bashing, I do not and will not believe you. Edit: I have found one Newspaper that did have a follow up. \"http://www.boston.com/news/world/middleeast/articles/2009/03/31/israeli_investigation_dismisses_charges_of_misconduct_in_gaza_war/\" Still, i wonder if Ny has done the same. \"http://en.wikinews.org/wiki/IDF_soldiers%27_account_of_Gaza_incursion_sparks_new_war_crimes_investigations\" As is seen from this link, there were only 2 idiots. How 2 turned out to be 12? Hmm.... Of course, Haarez is not without blame, but blind subsequent publishing is, in my opinion, even worse. This message has been edited. Last edited by: PanzerMeister, Sun 05 April 2009 11:21 AM", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 11:00:00", 
        "title": "Israel on Trial", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: and yet nothing about what hamas and other Palestinian terror groups do.... nothing... like what they do is now accepted....but yet Israel isnt allowed to protect themselves from a hostile intruder... go and do whatever you have to do Israel hell kill them all if you have to... some hate Israel for whatever reason", 
        "intTime": 20090405, 
        "postID": 17, 
        "quote": "Originally posted by outlaws93: and yet nothing about what hamas and other Palestinian terror groups do.... nothing... like what they do is now accepted....but yet Israel isnt allowed to protect themselves from a hostile intruder... go and do whatever you have to do Israel hell kill them all if you have to...", 
        "reply": " some hate Israel for whatever reason", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 12:01:00", 
        "title": "Israel on Trial", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/1/1460854\" It’s in Hebrew! The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter. What report? I've looked at dozens of article that site the Harratz report, in which \"dozens\" of Israeli soldiers talk about the atrocities they watched. They're all liars? Dave I guess.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090405, 
        "postID": 18, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/1/1460854\" It’s in Hebrew! The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter. What report? I've looked at dozens of article that site the Harratz report, in which \"dozens\" of Israeli soldiers talk about the atrocities they watched. They're all liars? Dave", 
        "reply": " I guess.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 12:23:00", 
        "title": "Israel on Trial", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by EAG154: CHILLING testimony by Israeli soldiers substantiates charges that Israel’s Gaza Strip assault entailed grave violations of international law. The emergence of a predominantly right-wing, nationalist government in Israel suggests that there may be more violations to come. Hamas’s indiscriminate rocket attacks on Israeli civilians also constituted war crimes, but do not excuse Israel’s transgressions. While Israel disputes some of the soldiers’ accounts, the evidence suggests that Israel committed the following six offenses: quote: Originally posted by PanzerMeister NSNN-This is Israel News. Of course that it is in Hebrew. If foreign newspapers were not up to the task of publishing up-to date information, it is not my fault. That settles it then! We’ll rely solely on you & sources you find fit to paint us a complete and accurate picture of Gaza conflict! I’m sorry but although some say it tastes quite good, I don’t drink Kool Aid! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090405, 
        "postID": 19, 
        "quote": "Originally posted by EAG154:", 
        "reply": " CHILLING testimony by Israeli soldiers substantiates charges that Israel’s Gaza Strip assault entailed grave violations of international law. The emergence of a predominantly right-wing, nationalist government in Israel suggests that there may be more violations to come. Hamas’s indiscriminate rocket attacks on Israeli civilians also constituted war crimes, but do not excuse Israel’s transgressions. While Israel disputes some of the soldiers’ accounts, the evidence suggests that Israel committed the following six offenses: quote: Originally posted by PanzerMeister NSNN-This is Israel News. Of course that it is in Hebrew. If foreign newspapers were not up to the task of publishing up-to date information, it is not my fault. That settles it then! We’ll rely solely on you & sources you find fit to paint us a complete and accurate picture of Gaza conflict! I’m sorry but although some say it tastes quite good, I don’t drink Kool Aid! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 12:24:00", 
        "title": "Israel on Trial", 
        "userID": "NSNN"
    }, 
    {
        "content": "And yet you were quick to accuse Israel using the SAME source. Pathetic. Edit-in case you have not noticed, there were only 2 idiots, so your \"i guess\" does not amount for much.", 
        "intTime": 20090405, 
        "postID": 20, 
        "quote": "", 
        "reply": "And yet you were quick to accuse Israel using the SAME source. Pathetic. Edit-in case you have not noticed, there were only 2 idiots, so your \"i guess\" does not amount for much.", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 13:04:00", 
        "title": "Israel on Trial", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: CHILLING testimony by Israeli soldiers substantiates charges that Israel’s Gaza Strip assault entailed grave violations of international law. The emergence of a predominantly right-wing, nationalist government in Israel suggests that there may be more violations to come. Hamas’s indiscriminate rocket attacks on Israeli civilians also constituted war crimes, but do not excuse Israel’s transgressions. While Israel disputes some of the soldiers’ accounts, the evidence suggests that Israel committed the following six offenses: • Violating its duty to protect the civilian population of the Gaza Strip. Despite Israel’s 2005 “disengagement” from Gaza, the territory remains occupied. Israel unleashed military firepower against a people it is legally bound to protect. • Imposing collective punishment in the form of a blockade, in violation of Article 33 of the Fourth Geneva Convention. In June 2007, after Hamas took power in the Gaza Strip, Israel imposed suffocating restrictions on trade and movement. The blockade — an act of war in customary international law — has helped plunge families into poverty, children into malnutrition, and patients denied access to medical treatment into their graves. People in Gaza thus faced Israel’s winter onslaught in particularly weakened conditions. • Deliberately attacking civilian targets. The laws of war permit attacking a civilian object only when it is making an effective contribution to military action and a definite military advantage is gained by its destruction. Yet an Israeli general, Dan Harel, said, “We are hitting not only terrorists and launchers, but also the whole Hamas government and all its wings.” An Israeli military spokeswoman, Maj. Avital Leibovich, avowed that “anything affiliated with Hamas is a legitimate target.” Israeli fire destroyed or damaged mosques, hospitals, factories, schools, a key sewage plant, institutions like the parliament, the main ministries, the central prison and police stations, and thousands of houses. • Willfully killing civilians without military justification. When civilian institutions are struck, civilians — persons who are not members of the armed forces of a warring party, and are not taking direct part in hostilities — are killed. International law authorizes killings of civilians if the objective of the attack is military, and the means are proportional to the advantage gained. Yet proportionality is irrelevant if the targets of attack were not military to begin with. Gaza government employees — traffic policemen, court clerks, secretaries and others — are not combatants merely because Israel considers Hamas, the governing party, a terrorist organization. Many countries do not regard violence against foreign military occupation as terrorism. Of 1,434 Palestinians killed in the Gaza invasion, 960 were civilians, including 121 women and 288 children, according to a United Nations special rapporteur, Richard Falk. Israeli military lawyers instructed army commanders that Palestinians who remained in a targeted building after having been warned to leave were “voluntary human shields,” and thus combatants. Israeli gunners “knocked on roofs” — that is, fired first at corners of buildings, before hitting more vulnerable points — to “warn” Palestinian residents to flee. With nearly all exits from the densely populated Gaza Strip blocked by Israel, and chaos reigning within it, this was a particularly cruel flaunting of international law. Willful killings of civilians that are not required by military necessity are grave breaches of the Geneva Conventions, and are considered war crimes under the Nuremberg principles. • Deliberately employing disproportionate force. Last year, Gen. Gadi Eisenkot, head of Israel’s northern command, speaking on possible future conflicts with neighbors, stated, “We will wield disproportionate power against every village from which shots are fired on Israel, and cause immense damage and destruction.” Such a frank admission of illegal intent can constitute evidence in a criminal prosecution. • Illegal use of weapons, including white phosphorus. Israel was finally forced to admit, after initial denials, that it employed white phosphorous in the Gaza Strip, though Israel defended its use as legal. White phosphorous may be legally used as an obscurant, not as a weapon, as it burns deeply and is extremely difficult to extinguish. Israeli political and military personnel who planned, ordered or executed these possible offenses should face criminal prosecution. The appointment of Richard Goldstone, the former war crimes prosecutor from South Africa, to head a fact-finding team into possible war crimes by both parties to the Gaza conflict is an important step in the right direction. The stature of international law is diminished when a nation violates it with impunity. (....) +http://www.nytimes.com/2009/04/04/opinion/04bisharat.html?em \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090404, 
        "postID": 21, 
        "quote": "CHILLING testimony by Israeli soldiers substantiates charges that Israel’s Gaza Strip assault entailed grave violations of international law. The emergence of a predominantly right-wing, nationalist government in Israel suggests that there may be more violations to come. Hamas’s indiscriminate rocket attacks on Israeli civilians also constituted war crimes, but do not excuse Israel’s transgressions. While Israel disputes some of the soldiers’ accounts, the evidence suggests that Israel committed the following six offenses: • Violating its duty to protect the civilian population of the Gaza Strip. Despite Israel’s 2005 “disengagement” from Gaza, the territory remains occupied. Israel unleashed military firepower against a people it is legally bound to protect. • Imposing collective punishment in the form of a blockade, in violation of Article 33 of the Fourth Geneva Convention. In June 2007, after Hamas took power in the Gaza Strip, Israel imposed suffocating restrictions on trade and movement. The blockade — an act of war in customary international law — has helped plunge families into poverty, children into malnutrition, and patients denied access to medical treatment into their graves. People in Gaza thus faced Israel’s winter onslaught in particularly weakened conditions. • Deliberately attacking civilian targets. The laws of war permit attacking a civilian object only when it is making an effective contribution to military action and a definite military advantage is gained by its destruction. Yet an Israeli general, Dan Harel, said, “We are hitting not only terrorists and launchers, but also the whole Hamas government and all its wings.” An Israeli military spokeswoman, Maj. Avital Leibovich, avowed that “anything affiliated with Hamas is a legitimate target.” Israeli fire destroyed or damaged mosques, hospitals, factories, schools, a key sewage plant, institutions like the parliament, the main ministries, the central prison and police stations, and thousands of houses. • Willfully killing civilians without military justification. When civilian institutions are struck, civilians — persons who are not members of the armed forces of a warring party, and are not taking direct part in hostilities — are killed. International law authorizes killings of civilians if the objective of the attack is military, and the means are proportional to the advantage gained. Yet proportionality is irrelevant if the targets of attack were not military to begin with. Gaza government employees — traffic policemen, court clerks, secretaries and others — are not combatants merely because Israel considers Hamas, the governing party, a terrorist organization. Many countries do not regard violence against foreign military occupation as terrorism. Of 1,434 Palestinians killed in the Gaza invasion, 960 were civilians, including 121 women and 288 children, according to a United Nations special rapporteur, Richard Falk. Israeli military lawyers instructed army commanders that Palestinians who remained in a targeted building after having been warned to leave were “voluntary human shields,” and thus combatants. Israeli gunners “knocked on roofs” — that is, fired first at corners of buildings, before hitting more vulnerable points — to “warn” Palestinian residents to flee. With nearly all exits from the densely populated Gaza Strip blocked by Israel, and chaos reigning within it, this was a particularly cruel flaunting of international law. Willful killings of civilians that are not required by military necessity are grave breaches of the Geneva Conventions, and are considered war crimes under the Nuremberg principles. • Deliberately employing disproportionate force. Last year, Gen. Gadi Eisenkot, head of Israel’s northern command, speaking on possible future conflicts with neighbors, stated, “We will wield disproportionate power against every village from which shots are fired on Israel, and cause immense damage and destruction.” Such a frank admission of illegal intent can constitute evidence in a criminal prosecution. • Illegal use of weapons, including white phosphorus. Israel was finally forced to admit, after initial denials, that it employed white phosphorous in the Gaza Strip, though Israel defended its use as legal. White phosphorous may be legally used as an obscurant, not as a weapon, as it burns deeply and is extremely difficult to extinguish. Israeli political and military personnel who planned, ordered or executed these possible offenses should face criminal prosecution. The appointment of Richard Goldstone, the former war crimes prosecutor from South Africa, to head a fact-finding team into possible war crimes by both parties to the Gaza conflict is an important step in the right direction. The stature of international law is diminished when a nation violates it with impunity. (....)", 
        "reply": " +http://www.nytimes.com/2009/04/04/opinion/04bisharat.html?em \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 09:08:00", 
        "title": "Israel on Trial", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: predominantly right- The IDF did it's best not to harm civilians. Any other army (yes, including US) would cause much greater casuallties. In wars, the are innocents who get killed. It's terrible, but that's life. The ones to blame are HAMAS- who hide behing children and women that are put to the line. IDF has the highest possible moral code. check my blog at \"israelisoldier.blogspot.com\" for more of my thoughts. Yoav, welcome to the Discussions. Please review the Terms Of Service for this website, hot links/direct links are not allowed here. In the future, just type in any links similar to how I changed the one you posted above. Gypsysnipe Moderator This message has been edited. Last edited by: gypsysnipe, Sat 04 April 2009 11:35 AM", 
        "intTime": 20090404, 
        "postID": 22, 
        "quote": "predominantly right-", 
        "reply": " The IDF did it's best not to harm civilians. Any other army (yes, including US) would cause much greater casuallties. In wars, the are innocents who get killed. It's terrible, but that's life. The ones to blame are HAMAS- who hide behing children and women that are put to the line. IDF has the highest possible moral code. check my blog at \"israelisoldier.blogspot.com\" for more of my thoughts. Yoav, welcome to the Discussions. Please review the Terms Of Service for this website, hot links/direct links are not allowed here. In the future, just type in any links similar to how I changed the one you posted above. Gypsysnipe Moderator This message has been edited. Last edited by: gypsysnipe, Sat 04 April 2009 11:35 AM", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 10:47:00", 
        "title": "Israel on Trial", 
        "userID": "yoavb_idf"
    }, 
    {
        "content": "I'm so sick of the whole Israel/Gaza mess. This war will never, ever, ever, ever end. So much finger pointing......... They are both wrong. Hate on both sides.", 
        "intTime": 20090404, 
        "postID": 23, 
        "quote": "", 
        "reply": "I'm so sick of the whole Israel/Gaza mess. This war will never, ever, ever, ever end. So much finger pointing......... They are both wrong. Hate on both sides.", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 10:55:00", 
        "title": "Israel on Trial", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Tell you the truth? I'm sick of it probably much more than you... Problem is- we can't just take out legs and leave, you know. It's not like they gonna stop firing those rockets at us. War is ****, that's a known fact. Won't argue about it...", 
        "intTime": 20090404, 
        "postID": 24, 
        "quote": "", 
        "reply": "Tell you the truth? I'm sick of it probably much more than you... Problem is- we can't just take out legs and leave, you know. It's not like they gonna stop firing those rockets at us. War is ****, that's a known fact. Won't argue about it...", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 11:01:00", 
        "title": "Israel on Trial", 
        "userID": "yoavb_idf"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: I'm so sick of the whole Israel/Gaza mess. This war will never, ever, ever, ever end. So much finger pointing......... They are both wrong. Hate on both sides. Why would you think it would end considering these people have been fighting each other over the same chunk of land for over a thousand years? Man we are so nieve .", 
        "intTime": 20090404, 
        "postID": 25, 
        "quote": "Originally posted by mrmixitup: I'm so sick of the whole Israel/Gaza mess. This war will never, ever, ever, ever end. So much finger pointing......... They are both wrong. Hate on both sides.", 
        "reply": " Why would you think it would end considering these people have been fighting each other over the same chunk of land for over a thousand years? Man we are so nieve .", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 13:26:00", 
        "title": "Israel on Trial", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "It might prove interesting for you to read the timeline of Israel beginning 79 AD through 1960. The first recording of a Palestinian reference on an attack of Jewish population of Hebron citizens was 1929. This Palestinian reference to the area, not a government or a people, or a bloodline. From the time of the Romans to present most attacks on both Muslim and Hebrew cultures were from predominately Christian background Europeans. As you know tens of millions were slaughter by various means including the Crusades, Inquisitions and Wars. I'm Not argueing the that it seems forever that they been at each others throats but at one time the Arab and Jews were allied against the European and Christians. \"http://timelines.ws/countries/ISRAEL1960.HTML", 
        "intTime": 20090404, 
        "postID": 26, 
        "quote": "", 
        "reply": "It might prove interesting for you to read the timeline of Israel beginning 79 AD through 1960. The first recording of a Palestinian reference on an attack of Jewish population of Hebron citizens was 1929. This Palestinian reference to the area, not a government or a people, or a bloodline. From the time of the Romans to present most attacks on both Muslim and Hebrew cultures were from predominately Christian background Europeans. As you know tens of millions were slaughter by various means including the Crusades, Inquisitions and Wars. I'm Not argueing the that it seems forever that they been at each others throats but at one time the Arab and Jews were allied against the European and Christians. \"http://timelines.ws/countries/ISRAEL1960.HTML", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 16:12:00", 
        "title": "Israel on Trial", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "- Duty to protect the civilian population - that's one I hadn't previously considered. It might be different if Gaza was 'another country', like Lebanon. But as the author notes, Israel has a duty not to harm civilians that it is legally bound to protect. -", 
        "intTime": 20090404, 
        "postID": 27, 
        "quote": "", 
        "reply": "- Duty to protect the civilian population - that's one I hadn't previously considered. It might be different if Gaza was 'another country', like Lebanon. But as the author notes, Israel has a duty not to harm civilians that it is legally bound to protect. -", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 20:24:00", 
        "title": "Israel on Trial", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "Ah, it is good to see another IDF member on the board. Shalom Yoav. To the topic: NSNN, i have addressed the issue of \"CHILLING testimony by Israeli soldiers\". It have been proved as crap. Both of them admit that they have not seen anything, and all they have is hearsay. link We are not legally bound to protect anyone in Gaza. To all purposes it is almost another nation. It has its flag, its government, and much more of \"state's attributes\". If we wre bound to protect it, we should have been its government, because it is a task of the government to protect its populace. Gazans are not ours, we have made it clear in 2006. We are bound to minimize civilian losses, and that what we have done there. Do you realize that if we have NOT exercised restraint, Gaza would have been hole in the ground after 1 hour? If by \"civilian targets\" you mean \"Hamas political government\", i must disappoint you. They are legal targets, much like Reichstag in ww2. Killing Hania during the fighting would have been legal act, much like killing Hitler. Mr. Falk is not a unbiased source, so qouting him will not accomplish much. IDF has other numbers. Out of 1300 dead, 900 or so (As far as i remember) were terrorists. \"Deliberately employing disproportionate force.\" Gee, explain to me what is a proportionate one. Should we have shot at them with our quassams? We have used WP rounds as an obscurant. You have yet to prove that we have used it DELIBERATELY on \"civilian population\". Should i tell you what really happened in Gaza from my personal experiences? You know, pillow kids, 10 year's old with RPG and so on. Mr. Falk and NY times fail to mention it. Now about article 33 of Geneva convention that you have chosen to quote. If you will look in Wikipedia you will see what it actually says-\"By collective punishment, the drafters of the Geneva Conventions had in mind the reprisal killings of World Wars I and II\". In case you did not know, it is very important what the drafters meant, because you have to interpret the convention in that way. Since blockade is an acceptable tool of warfare (blockade as is in \"no trading\") We can ignore protocol 2 as well. What we are required is to provide access to the goods to Gaza, and even that we can ignore, if these goods fall to the hands of the enemy (Hamas). Since that has already happened, we can starve them all, in a completely legal way. This message has been edited. Last edited by: PanzerMeister, Sun 05 April 2009 07:14 AM", 
        "intTime": 20090405, 
        "postID": 28, 
        "quote": "", 
        "reply": "Ah, it is good to see another IDF member on the board. Shalom Yoav. To the topic: NSNN, i have addressed the issue of \"CHILLING testimony by Israeli soldiers\". It have been proved as crap. Both of them admit that they have not seen anything, and all they have is hearsay. link We are not legally bound to protect anyone in Gaza. To all purposes it is almost another nation. It has its flag, its government, and much more of \"state's attributes\". If we wre bound to protect it, we should have been its government, because it is a task of the government to protect its populace. Gazans are not ours, we have made it clear in 2006. We are bound to minimize civilian losses, and that what we have done there. Do you realize that if we have NOT exercised restraint, Gaza would have been hole in the ground after 1 hour? If by \"civilian targets\" you mean \"Hamas political government\", i must disappoint you. They are legal targets, much like Reichstag in ww2. Killing Hania during the fighting would have been legal act, much like killing Hitler. Mr. Falk is not a unbiased source, so qouting him will not accomplish much. IDF has other numbers. Out of 1300 dead, 900 or so (As far as i remember) were terrorists. \"Deliberately employing disproportionate force.\" Gee, explain to me what is a proportionate one. Should we have shot at them with our quassams? We have used WP rounds as an obscurant. You have yet to prove that we have used it DELIBERATELY on \"civilian population\". Should i tell you what really happened in Gaza from my personal experiences? You know, pillow kids, 10 year's old with RPG and so on. Mr. Falk and NY times fail to mention it. Now about article 33 of Geneva convention that you have chosen to quote. If you will look in Wikipedia you will see what it actually says-\"By collective punishment, the drafters of the Geneva Conventions had in mind the reprisal killings of World Wars I and II\". In case you did not know, it is very important what the drafters meant, because you have to interpret the convention in that way. Since blockade is an acceptable tool of warfare (blockade as is in \"no trading\") We can ignore protocol 2 as well. What we are required is to provide access to the goods to Gaza, and even that we can ignore, if these goods fall to the hands of the enemy (Hamas). Since that has already happened, we can starve them all, in a completely legal way. This message has been edited. Last edited by: PanzerMeister, Sun 05 April 2009 07:14 AM", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 06:54:00", 
        "title": "Israel on Trial", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: Ah, it is good to see another IDF member on the board. Shalom Yoav. To the topic: NSNN, i have addressed the issue of \"CHILLING testimony by Israeli soldiers\". It have been proved as crap. Both of them admit that they have not seen anything, and all they have is hearsay. link Now that's really adorable. You link to a previous post of YOURS saying this is all BS, and using your own words as a source. Gosh - How original! Dave", 
        "intTime": 20090405, 
        "postID": 29, 
        "quote": "Originally posted by PanzerMeister: Ah, it is good to see another IDF member on the board. Shalom Yoav. To the topic: NSNN, i have addressed the issue of \"CHILLING testimony by Israeli soldiers\". It have been proved as crap. Both of them admit that they have not seen anything, and all they have is hearsay. link", 
        "reply": " Now that's really adorable. You link to a previous post of YOURS saying this is all BS, and using your own words as a source. Gosh - How original! Dave", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 08:14:00", 
        "title": "Israel on Trial", 
        "userID": "Grachus"
    }, 
    {
        "content": "Do bother to read the link AT FULL please. Last my 2 posts to be precise. There is a link there. The link is in Hebrew, BUT, as i have already said NY has used Haarez in the first place as their source. I seriously doubt that NY has talked to the soldiers in the first place. And since Walla is Haarez site, we can safely deduct the following- Step 1)NY used Haarez=walla as its source for accusation of IDF. Step 2)Haarez backs off. Step 3)Hmmm...What does it say about NY accusations and NSNN claims? And, what does it say about NY reporter professionalism and honesty (I bet that they have not published an apology for the caricature OR a follow up on the story)? We all know what it says about NSNN, but it was obvious well before NY cries of \"foul\". The caricature done by brave and honest NY: Posting such crap before even BASIC investigation, is EXTREMELY unprofessional and represents journalism at its worst.", 
        "intTime": 20090405, 
        "postID": 30, 
        "quote": "", 
        "reply": "Do bother to read the link AT FULL please. Last my 2 posts to be precise. There is a link there. The link is in Hebrew, BUT, as i have already said NY has used Haarez in the first place as their source. I seriously doubt that NY has talked to the soldiers in the first place. And since Walla is Haarez site, we can safely deduct the following- Step 1)NY used Haarez=walla as its source for accusation of IDF. Step 2)Haarez backs off. Step 3)Hmmm...What does it say about NY accusations and NSNN claims? And, what does it say about NY reporter professionalism and honesty (I bet that they have not published an apology for the caricature OR a follow up on the story)? We all know what it says about NSNN, but it was obvious well before NY cries of \"foul\". The caricature done by brave and honest NY: Posting such crap before even BASIC investigation, is EXTREMELY unprofessional and represents journalism at its worst.", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 08:27:00", 
        "title": "Israel on Trial", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: Do bother to read the link AT FULL please. Last my 2 posts to be precise. There is a link there. The link is in Hebrew, BUT, as i have already said NY has used Haarez in the first place as their source. I seriously doubt that NY has talked to the soldiers in the first place. And since Walla is Haarez site, we can safely deduct the following- Step 1)NY used Haarez=walla as its source for accusation of IDF. Step 2)Haarez backs off. Step 3)Hmmm...What does it say about NY accusations and NSNN claims? And, what does it say about NY reporter professionalism and honesty (I bet that they have not published an apology for the caricature OR a follow up on the story)? We all know what it says about NSNN, but it was obvious well before NY cries of \"foul\". What?!?! Are you trying to confuse us into considering you personally as a valid source! BTW, I looked at the other thread (you linked), and it seems that the first & last link are from BBC!?! Also, I HAVEN’T PERSONALY CLAIMED anything…..I only posted a very valid & interesting OP-ED by George Bisharat! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090405, 
        "postID": 31, 
        "quote": "Originally posted by PanzerMeister: Do bother to read the link AT FULL please. Last my 2 posts to be precise. There is a link there. The link is in Hebrew, BUT, as i have already said NY has used Haarez in the first place as their source. I seriously doubt that NY has talked to the soldiers in the first place. And since Walla is Haarez site, we can safely deduct the following- Step 1)NY used Haarez=walla as its source for accusation of IDF. Step 2)Haarez backs off. Step 3)Hmmm...What does it say about NY accusations and NSNN claims? And, what does it say about NY reporter professionalism and honesty (I bet that they have not published an apology for the caricature OR a follow up on the story)? We all know what it says about NSNN, but it was obvious well before NY cries of \"foul\".", 
        "reply": " What?!?! Are you trying to confuse us into considering you personally as a valid source! BTW, I looked at the other thread (you linked), and it seems that the first & last link are from BBC!?! Also, I HAVEN’T PERSONALY CLAIMED anything…..I only posted a very valid & interesting OP-ED by George Bisharat! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 08:53:00", 
        "title": "Israel on Trial", 
        "userID": "NSNN"
    }, 
    {
        "content": "\"http://news.walla.co.il/?w=/1/1460854\" The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter.", 
        "intTime": 20090405, 
        "postID": 32, 
        "quote": "", 
        "reply": "\"http://news.walla.co.il/?w=/1/1460854\" The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter.", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 09:05:00", 
        "title": "Israel on Trial", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/1/1460854\" It’s in Hebrew! The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter. What report? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090405, 
        "postID": 33, 
        "quote": "Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/1/1460854\" It’s in Hebrew! The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter. What report?", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 09:25:00", 
        "title": "Israel on Trial", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/1/1460854\" It’s in Hebrew! The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter. What report? I've looked at dozens of article that site the Harratz report, in which \"dozens\" of Israeli soldiers talk about the atrocities they watched. They're all liars? Dave", 
        "intTime": 20090405, 
        "postID": 34, 
        "quote": "Originally posted by NSNN: quote: Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/1/1460854\" It’s in Hebrew! The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter. What report?", 
        "reply": " I've looked at dozens of article that site the Harratz report, in which \"dozens\" of Israeli soldiers talk about the atrocities they watched. They're all liars? Dave", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 09:28:00", 
        "title": "Israel on Trial", 
        "userID": "Grachus"
    }, 
    {
        "content": "and yet nothing about what hamas and other Palestinian terror groups do.... nothing... like what they do is now accepted....but yet Israel isnt allowed to protect themselves from a hostile intruder... go and do whatever you have to do Israel hell kill them all if you have to...", 
        "intTime": 20090405, 
        "postID": 35, 
        "quote": "", 
        "reply": "and yet nothing about what hamas and other Palestinian terror groups do.... nothing... like what they do is now accepted....but yet Israel isnt allowed to protect themselves from a hostile intruder... go and do whatever you have to do Israel hell kill them all if you have to...", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 09:34:00", 
        "title": "Israel on Trial", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Dave-There were no \"Dozens\". Just 2 idiots. That what happens when you write something with agenda. You twist facts. 2 idiots turned 12. Like all rumors go, this \"rumor/news article\" grew bigger of its initial source. And yes, these \"Sources\" that you mention, are just one source really. It is Haarez article translated to English with different wording. Unless your \"Sources\" have done independent work (like interviewing the soldiers), they all count as one. It all has started with 2 idiots saying that \"Idf had done this and that\". NY and some other news hungry newspapers decided to capitalize on the event, and quoted Haarez, which published these 2 idiots words in the first place. During the \"Objective investigation\" done by NY and their ilk, the idiots were multiplied. NSNN-This is Israel News. Of course that it is in Hebrew. If foreign newspapers were not up to the task of publishing up-to date information, it is not my fault. As a matter of fact it is the fault of NY newspaper, because it does not give a follow up on the story, after publishing such an information. What US citizens that DO NOT know Hebrew are to understand? That IDF soldiers are headless Nazi Brutes? The only thing that i have found is here \"http://www.jewlicious.com/2009/03/idfs-military-advocate-general-closes-criminal-investigation-into-allegations-made-by-soldiers-about-gaza-offensive/\". It is NOT official news site, but it saves me the trouble to translate word for word the Hebrew article. Of course if you will find that NY HAS done a follow up, i will take my words back. Meanwhile, all i have to say, is that NY conduct is a classical case of unprofessional work, that can be only classified as a malpractice. You claim that \"i have not claimed such a thing\". Given your history of pointless Israel bashing, I do not and will not believe you. Edit: I have found one Newspaper that did have a follow up. \"http://www.boston.com/news/world/middleeast/articles/2009/03/31/israeli_investigation_dismisses_charges_of_misconduct_in_gaza_war/\" Still, i wonder if Ny has done the same. \"http://en.wikinews.org/wiki/IDF_soldiers%27_account_of_Gaza_incursion_sparks_new_war_crimes_investigations\" As is seen from this link, there were only 2 idiots. How 2 turned out to be 12? Hmm.... Of course, Haarez is not without blame, but blind subsequent publishing is, in my opinion, even worse. This message has been edited. Last edited by: PanzerMeister, Sun 05 April 2009 11:21 AM", 
        "intTime": 20090405, 
        "postID": 36, 
        "quote": "", 
        "reply": "Dave-There were no \"Dozens\". Just 2 idiots. That what happens when you write something with agenda. You twist facts. 2 idiots turned 12. Like all rumors go, this \"rumor/news article\" grew bigger of its initial source. And yes, these \"Sources\" that you mention, are just one source really. It is Haarez article translated to English with different wording. Unless your \"Sources\" have done independent work (like interviewing the soldiers), they all count as one. It all has started with 2 idiots saying that \"Idf had done this and that\". NY and some other news hungry newspapers decided to capitalize on the event, and quoted Haarez, which published these 2 idiots words in the first place. During the \"Objective investigation\" done by NY and their ilk, the idiots were multiplied. NSNN-This is Israel News. Of course that it is in Hebrew. If foreign newspapers were not up to the task of publishing up-to date information, it is not my fault. As a matter of fact it is the fault of NY newspaper, because it does not give a follow up on the story, after publishing such an information. What US citizens that DO NOT know Hebrew are to understand? That IDF soldiers are headless Nazi Brutes? The only thing that i have found is here \"http://www.jewlicious.com/2009/03/idfs-military-advocate-general-closes-criminal-investigation-into-allegations-made-by-soldiers-about-gaza-offensive/\". It is NOT official news site, but it saves me the trouble to translate word for word the Hebrew article. Of course if you will find that NY HAS done a follow up, i will take my words back. Meanwhile, all i have to say, is that NY conduct is a classical case of unprofessional work, that can be only classified as a malpractice. You claim that \"i have not claimed such a thing\". Given your history of pointless Israel bashing, I do not and will not believe you. Edit: I have found one Newspaper that did have a follow up. \"http://www.boston.com/news/world/middleeast/articles/2009/03/31/israeli_investigation_dismisses_charges_of_misconduct_in_gaza_war/\" Still, i wonder if Ny has done the same. \"http://en.wikinews.org/wiki/IDF_soldiers%27_account_of_Gaza_incursion_sparks_new_war_crimes_investigations\" As is seen from this link, there were only 2 idiots. How 2 turned out to be 12? Hmm.... Of course, Haarez is not without blame, but blind subsequent publishing is, in my opinion, even worse. This message has been edited. Last edited by: PanzerMeister, Sun 05 April 2009 11:21 AM", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 11:00:00", 
        "title": "Israel on Trial", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: and yet nothing about what hamas and other Palestinian terror groups do.... nothing... like what they do is now accepted....but yet Israel isnt allowed to protect themselves from a hostile intruder... go and do whatever you have to do Israel hell kill them all if you have to... some hate Israel for whatever reason", 
        "intTime": 20090405, 
        "postID": 37, 
        "quote": "Originally posted by outlaws93: and yet nothing about what hamas and other Palestinian terror groups do.... nothing... like what they do is now accepted....but yet Israel isnt allowed to protect themselves from a hostile intruder... go and do whatever you have to do Israel hell kill them all if you have to...", 
        "reply": " some hate Israel for whatever reason", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 12:01:00", 
        "title": "Israel on Trial", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/1/1460854\" It’s in Hebrew! The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter. What report? I've looked at dozens of article that site the Harratz report, in which \"dozens\" of Israeli soldiers talk about the atrocities they watched. They're all liars? Dave I guess.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090405, 
        "postID": 38, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/1/1460854\" It’s in Hebrew! The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter. What report? I've looked at dozens of article that site the Harratz report, in which \"dozens\" of Israeli soldiers talk about the atrocities they watched. They're all liars? Dave", 
        "reply": " I guess.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 12:23:00", 
        "title": "Israel on Trial", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by EAG154: CHILLING testimony by Israeli soldiers substantiates charges that Israel’s Gaza Strip assault entailed grave violations of international law. The emergence of a predominantly right-wing, nationalist government in Israel suggests that there may be more violations to come. Hamas’s indiscriminate rocket attacks on Israeli civilians also constituted war crimes, but do not excuse Israel’s transgressions. While Israel disputes some of the soldiers’ accounts, the evidence suggests that Israel committed the following six offenses: quote: Originally posted by PanzerMeister NSNN-This is Israel News. Of course that it is in Hebrew. If foreign newspapers were not up to the task of publishing up-to date information, it is not my fault. That settles it then! We’ll rely solely on you & sources you find fit to paint us a complete and accurate picture of Gaza conflict! I’m sorry but although some say it tastes quite good, I don’t drink Kool Aid! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090405, 
        "postID": 39, 
        "quote": "Originally posted by EAG154:", 
        "reply": " CHILLING testimony by Israeli soldiers substantiates charges that Israel’s Gaza Strip assault entailed grave violations of international law. The emergence of a predominantly right-wing, nationalist government in Israel suggests that there may be more violations to come. Hamas’s indiscriminate rocket attacks on Israeli civilians also constituted war crimes, but do not excuse Israel’s transgressions. While Israel disputes some of the soldiers’ accounts, the evidence suggests that Israel committed the following six offenses: quote: Originally posted by PanzerMeister NSNN-This is Israel News. Of course that it is in Hebrew. If foreign newspapers were not up to the task of publishing up-to date information, it is not my fault. That settles it then! We’ll rely solely on you & sources you find fit to paint us a complete and accurate picture of Gaza conflict! I’m sorry but although some say it tastes quite good, I don’t drink Kool Aid! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 12:24:00", 
        "title": "Israel on Trial", 
        "userID": "NSNN"
    }, 
    {
        "content": "And yet you were quick to accuse Israel using the SAME source. Pathetic. Edit-in case you have not noticed, there were only 2 idiots, so your \"i guess\" does not amount for much.", 
        "intTime": 20090405, 
        "postID": 40, 
        "quote": "", 
        "reply": "And yet you were quick to accuse Israel using the SAME source. Pathetic. Edit-in case you have not noticed, there were only 2 idiots, so your \"i guess\" does not amount for much.", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 13:04:00", 
        "title": "Israel on Trial", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: CHILLING testimony by Israeli soldiers substantiates charges that Israel’s Gaza Strip assault entailed grave violations of international law. The emergence of a predominantly right-wing, nationalist government in Israel suggests that there may be more violations to come. Hamas’s indiscriminate rocket attacks on Israeli civilians also constituted war crimes, but do not excuse Israel’s transgressions. While Israel disputes some of the soldiers’ accounts, the evidence suggests that Israel committed the following six offenses: • Violating its duty to protect the civilian population of the Gaza Strip. Despite Israel’s 2005 “disengagement” from Gaza, the territory remains occupied. Israel unleashed military firepower against a people it is legally bound to protect. • Imposing collective punishment in the form of a blockade, in violation of Article 33 of the Fourth Geneva Convention. In June 2007, after Hamas took power in the Gaza Strip, Israel imposed suffocating restrictions on trade and movement. The blockade — an act of war in customary international law — has helped plunge families into poverty, children into malnutrition, and patients denied access to medical treatment into their graves. People in Gaza thus faced Israel’s winter onslaught in particularly weakened conditions. • Deliberately attacking civilian targets. The laws of war permit attacking a civilian object only when it is making an effective contribution to military action and a definite military advantage is gained by its destruction. Yet an Israeli general, Dan Harel, said, “We are hitting not only terrorists and launchers, but also the whole Hamas government and all its wings.” An Israeli military spokeswoman, Maj. Avital Leibovich, avowed that “anything affiliated with Hamas is a legitimate target.” Israeli fire destroyed or damaged mosques, hospitals, factories, schools, a key sewage plant, institutions like the parliament, the main ministries, the central prison and police stations, and thousands of houses. • Willfully killing civilians without military justification. When civilian institutions are struck, civilians — persons who are not members of the armed forces of a warring party, and are not taking direct part in hostilities — are killed. International law authorizes killings of civilians if the objective of the attack is military, and the means are proportional to the advantage gained. Yet proportionality is irrelevant if the targets of attack were not military to begin with. Gaza government employees — traffic policemen, court clerks, secretaries and others — are not combatants merely because Israel considers Hamas, the governing party, a terrorist organization. Many countries do not regard violence against foreign military occupation as terrorism. Of 1,434 Palestinians killed in the Gaza invasion, 960 were civilians, including 121 women and 288 children, according to a United Nations special rapporteur, Richard Falk. Israeli military lawyers instructed army commanders that Palestinians who remained in a targeted building after having been warned to leave were “voluntary human shields,” and thus combatants. Israeli gunners “knocked on roofs” — that is, fired first at corners of buildings, before hitting more vulnerable points — to “warn” Palestinian residents to flee. With nearly all exits from the densely populated Gaza Strip blocked by Israel, and chaos reigning within it, this was a particularly cruel flaunting of international law. Willful killings of civilians that are not required by military necessity are grave breaches of the Geneva Conventions, and are considered war crimes under the Nuremberg principles. • Deliberately employing disproportionate force. Last year, Gen. Gadi Eisenkot, head of Israel’s northern command, speaking on possible future conflicts with neighbors, stated, “We will wield disproportionate power against every village from which shots are fired on Israel, and cause immense damage and destruction.” Such a frank admission of illegal intent can constitute evidence in a criminal prosecution. • Illegal use of weapons, including white phosphorus. Israel was finally forced to admit, after initial denials, that it employed white phosphorous in the Gaza Strip, though Israel defended its use as legal. White phosphorous may be legally used as an obscurant, not as a weapon, as it burns deeply and is extremely difficult to extinguish. Israeli political and military personnel who planned, ordered or executed these possible offenses should face criminal prosecution. The appointment of Richard Goldstone, the former war crimes prosecutor from South Africa, to head a fact-finding team into possible war crimes by both parties to the Gaza conflict is an important step in the right direction. The stature of international law is diminished when a nation violates it with impunity. (....) +http://www.nytimes.com/2009/04/04/opinion/04bisharat.html?em \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090404, 
        "postID": 41, 
        "quote": "CHILLING testimony by Israeli soldiers substantiates charges that Israel’s Gaza Strip assault entailed grave violations of international law. The emergence of a predominantly right-wing, nationalist government in Israel suggests that there may be more violations to come. Hamas’s indiscriminate rocket attacks on Israeli civilians also constituted war crimes, but do not excuse Israel’s transgressions. While Israel disputes some of the soldiers’ accounts, the evidence suggests that Israel committed the following six offenses: • Violating its duty to protect the civilian population of the Gaza Strip. Despite Israel’s 2005 “disengagement” from Gaza, the territory remains occupied. Israel unleashed military firepower against a people it is legally bound to protect. • Imposing collective punishment in the form of a blockade, in violation of Article 33 of the Fourth Geneva Convention. In June 2007, after Hamas took power in the Gaza Strip, Israel imposed suffocating restrictions on trade and movement. The blockade — an act of war in customary international law — has helped plunge families into poverty, children into malnutrition, and patients denied access to medical treatment into their graves. People in Gaza thus faced Israel’s winter onslaught in particularly weakened conditions. • Deliberately attacking civilian targets. The laws of war permit attacking a civilian object only when it is making an effective contribution to military action and a definite military advantage is gained by its destruction. Yet an Israeli general, Dan Harel, said, “We are hitting not only terrorists and launchers, but also the whole Hamas government and all its wings.” An Israeli military spokeswoman, Maj. Avital Leibovich, avowed that “anything affiliated with Hamas is a legitimate target.” Israeli fire destroyed or damaged mosques, hospitals, factories, schools, a key sewage plant, institutions like the parliament, the main ministries, the central prison and police stations, and thousands of houses. • Willfully killing civilians without military justification. When civilian institutions are struck, civilians — persons who are not members of the armed forces of a warring party, and are not taking direct part in hostilities — are killed. International law authorizes killings of civilians if the objective of the attack is military, and the means are proportional to the advantage gained. Yet proportionality is irrelevant if the targets of attack were not military to begin with. Gaza government employees — traffic policemen, court clerks, secretaries and others — are not combatants merely because Israel considers Hamas, the governing party, a terrorist organization. Many countries do not regard violence against foreign military occupation as terrorism. Of 1,434 Palestinians killed in the Gaza invasion, 960 were civilians, including 121 women and 288 children, according to a United Nations special rapporteur, Richard Falk. Israeli military lawyers instructed army commanders that Palestinians who remained in a targeted building after having been warned to leave were “voluntary human shields,” and thus combatants. Israeli gunners “knocked on roofs” — that is, fired first at corners of buildings, before hitting more vulnerable points — to “warn” Palestinian residents to flee. With nearly all exits from the densely populated Gaza Strip blocked by Israel, and chaos reigning within it, this was a particularly cruel flaunting of international law. Willful killings of civilians that are not required by military necessity are grave breaches of the Geneva Conventions, and are considered war crimes under the Nuremberg principles. • Deliberately employing disproportionate force. Last year, Gen. Gadi Eisenkot, head of Israel’s northern command, speaking on possible future conflicts with neighbors, stated, “We will wield disproportionate power against every village from which shots are fired on Israel, and cause immense damage and destruction.” Such a frank admission of illegal intent can constitute evidence in a criminal prosecution. • Illegal use of weapons, including white phosphorus. Israel was finally forced to admit, after initial denials, that it employed white phosphorous in the Gaza Strip, though Israel defended its use as legal. White phosphorous may be legally used as an obscurant, not as a weapon, as it burns deeply and is extremely difficult to extinguish. Israeli political and military personnel who planned, ordered or executed these possible offenses should face criminal prosecution. The appointment of Richard Goldstone, the former war crimes prosecutor from South Africa, to head a fact-finding team into possible war crimes by both parties to the Gaza conflict is an important step in the right direction. The stature of international law is diminished when a nation violates it with impunity. (....)", 
        "reply": " +http://www.nytimes.com/2009/04/04/opinion/04bisharat.html?em \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 09:08:00", 
        "title": "Israel on Trial", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: predominantly right- The IDF did it's best not to harm civilians. Any other army (yes, including US) would cause much greater casuallties. In wars, the are innocents who get killed. It's terrible, but that's life. The ones to blame are HAMAS- who hide behing children and women that are put to the line. IDF has the highest possible moral code. check my blog at \"israelisoldier.blogspot.com\" for more of my thoughts. Yoav, welcome to the Discussions. Please review the Terms Of Service for this website, hot links/direct links are not allowed here. In the future, just type in any links similar to how I changed the one you posted above. Gypsysnipe Moderator This message has been edited. Last edited by: gypsysnipe, Sat 04 April 2009 11:35 AM", 
        "intTime": 20090404, 
        "postID": 42, 
        "quote": "predominantly right-", 
        "reply": " The IDF did it's best not to harm civilians. Any other army (yes, including US) would cause much greater casuallties. In wars, the are innocents who get killed. It's terrible, but that's life. The ones to blame are HAMAS- who hide behing children and women that are put to the line. IDF has the highest possible moral code. check my blog at \"israelisoldier.blogspot.com\" for more of my thoughts. Yoav, welcome to the Discussions. Please review the Terms Of Service for this website, hot links/direct links are not allowed here. In the future, just type in any links similar to how I changed the one you posted above. Gypsysnipe Moderator This message has been edited. Last edited by: gypsysnipe, Sat 04 April 2009 11:35 AM", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 10:47:00", 
        "title": "Israel on Trial", 
        "userID": "yoavb_idf"
    }, 
    {
        "content": "I'm so sick of the whole Israel/Gaza mess. This war will never, ever, ever, ever end. So much finger pointing......... They are both wrong. Hate on both sides.", 
        "intTime": 20090404, 
        "postID": 43, 
        "quote": "", 
        "reply": "I'm so sick of the whole Israel/Gaza mess. This war will never, ever, ever, ever end. So much finger pointing......... They are both wrong. Hate on both sides.", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 10:55:00", 
        "title": "Israel on Trial", 
        "userID": "mrmixitup"
    }, 
    {
        "content": "Tell you the truth? I'm sick of it probably much more than you... Problem is- we can't just take out legs and leave, you know. It's not like they gonna stop firing those rockets at us. War is ****, that's a known fact. Won't argue about it...", 
        "intTime": 20090404, 
        "postID": 44, 
        "quote": "", 
        "reply": "Tell you the truth? I'm sick of it probably much more than you... Problem is- we can't just take out legs and leave, you know. It's not like they gonna stop firing those rockets at us. War is ****, that's a known fact. Won't argue about it...", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 11:01:00", 
        "title": "Israel on Trial", 
        "userID": "yoavb_idf"
    }, 
    {
        "content": "quote: Originally posted by mrmixitup: I'm so sick of the whole Israel/Gaza mess. This war will never, ever, ever, ever end. So much finger pointing......... They are both wrong. Hate on both sides. Why would you think it would end considering these people have been fighting each other over the same chunk of land for over a thousand years? Man we are so nieve .", 
        "intTime": 20090404, 
        "postID": 45, 
        "quote": "Originally posted by mrmixitup: I'm so sick of the whole Israel/Gaza mess. This war will never, ever, ever, ever end. So much finger pointing......... They are both wrong. Hate on both sides.", 
        "reply": " Why would you think it would end considering these people have been fighting each other over the same chunk of land for over a thousand years? Man we are so nieve .", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 13:26:00", 
        "title": "Israel on Trial", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "It might prove interesting for you to read the timeline of Israel beginning 79 AD through 1960. The first recording of a Palestinian reference on an attack of Jewish population of Hebron citizens was 1929. This Palestinian reference to the area, not a government or a people, or a bloodline. From the time of the Romans to present most attacks on both Muslim and Hebrew cultures were from predominately Christian background Europeans. As you know tens of millions were slaughter by various means including the Crusades, Inquisitions and Wars. I'm Not argueing the that it seems forever that they been at each others throats but at one time the Arab and Jews were allied against the European and Christians. \"http://timelines.ws/countries/ISRAEL1960.HTML", 
        "intTime": 20090404, 
        "postID": 46, 
        "quote": "", 
        "reply": "It might prove interesting for you to read the timeline of Israel beginning 79 AD through 1960. The first recording of a Palestinian reference on an attack of Jewish population of Hebron citizens was 1929. This Palestinian reference to the area, not a government or a people, or a bloodline. From the time of the Romans to present most attacks on both Muslim and Hebrew cultures were from predominately Christian background Europeans. As you know tens of millions were slaughter by various means including the Crusades, Inquisitions and Wars. I'm Not argueing the that it seems forever that they been at each others throats but at one time the Arab and Jews were allied against the European and Christians. \"http://timelines.ws/countries/ISRAEL1960.HTML", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 16:12:00", 
        "title": "Israel on Trial", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "- Duty to protect the civilian population - that's one I hadn't previously considered. It might be different if Gaza was 'another country', like Lebanon. But as the author notes, Israel has a duty not to harm civilians that it is legally bound to protect. -", 
        "intTime": 20090404, 
        "postID": 47, 
        "quote": "", 
        "reply": "- Duty to protect the civilian population - that's one I hadn't previously considered. It might be different if Gaza was 'another country', like Lebanon. But as the author notes, Israel has a duty not to harm civilians that it is legally bound to protect. -", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-04 20:24:00", 
        "title": "Israel on Trial", 
        "userID": "ANZACbiscuit"
    }, 
    {
        "content": "Ah, it is good to see another IDF member on the board. Shalom Yoav. To the topic: NSNN, i have addressed the issue of \"CHILLING testimony by Israeli soldiers\". It have been proved as crap. Both of them admit that they have not seen anything, and all they have is hearsay. link We are not legally bound to protect anyone in Gaza. To all purposes it is almost another nation. It has its flag, its government, and much more of \"state's attributes\". If we wre bound to protect it, we should have been its government, because it is a task of the government to protect its populace. Gazans are not ours, we have made it clear in 2006. We are bound to minimize civilian losses, and that what we have done there. Do you realize that if we have NOT exercised restraint, Gaza would have been hole in the ground after 1 hour? If by \"civilian targets\" you mean \"Hamas political government\", i must disappoint you. They are legal targets, much like Reichstag in ww2. Killing Hania during the fighting would have been legal act, much like killing Hitler. Mr. Falk is not a unbiased source, so qouting him will not accomplish much. IDF has other numbers. Out of 1300 dead, 900 or so (As far as i remember) were terrorists. \"Deliberately employing disproportionate force.\" Gee, explain to me what is a proportionate one. Should we have shot at them with our quassams? We have used WP rounds as an obscurant. You have yet to prove that we have used it DELIBERATELY on \"civilian population\". Should i tell you what really happened in Gaza from my personal experiences? You know, pillow kids, 10 year's old with RPG and so on. Mr. Falk and NY times fail to mention it. Now about article 33 of Geneva convention that you have chosen to quote. If you will look in Wikipedia you will see what it actually says-\"By collective punishment, the drafters of the Geneva Conventions had in mind the reprisal killings of World Wars I and II\". In case you did not know, it is very important what the drafters meant, because you have to interpret the convention in that way. Since blockade is an acceptable tool of warfare (blockade as is in \"no trading\") We can ignore protocol 2 as well. What we are required is to provide access to the goods to Gaza, and even that we can ignore, if these goods fall to the hands of the enemy (Hamas). Since that has already happened, we can starve them all, in a completely legal way. This message has been edited. Last edited by: PanzerMeister, Sun 05 April 2009 07:14 AM", 
        "intTime": 20090405, 
        "postID": 48, 
        "quote": "", 
        "reply": "Ah, it is good to see another IDF member on the board. Shalom Yoav. To the topic: NSNN, i have addressed the issue of \"CHILLING testimony by Israeli soldiers\". It have been proved as crap. Both of them admit that they have not seen anything, and all they have is hearsay. link We are not legally bound to protect anyone in Gaza. To all purposes it is almost another nation. It has its flag, its government, and much more of \"state's attributes\". If we wre bound to protect it, we should have been its government, because it is a task of the government to protect its populace. Gazans are not ours, we have made it clear in 2006. We are bound to minimize civilian losses, and that what we have done there. Do you realize that if we have NOT exercised restraint, Gaza would have been hole in the ground after 1 hour? If by \"civilian targets\" you mean \"Hamas political government\", i must disappoint you. They are legal targets, much like Reichstag in ww2. Killing Hania during the fighting would have been legal act, much like killing Hitler. Mr. Falk is not a unbiased source, so qouting him will not accomplish much. IDF has other numbers. Out of 1300 dead, 900 or so (As far as i remember) were terrorists. \"Deliberately employing disproportionate force.\" Gee, explain to me what is a proportionate one. Should we have shot at them with our quassams? We have used WP rounds as an obscurant. You have yet to prove that we have used it DELIBERATELY on \"civilian population\". Should i tell you what really happened in Gaza from my personal experiences? You know, pillow kids, 10 year's old with RPG and so on. Mr. Falk and NY times fail to mention it. Now about article 33 of Geneva convention that you have chosen to quote. If you will look in Wikipedia you will see what it actually says-\"By collective punishment, the drafters of the Geneva Conventions had in mind the reprisal killings of World Wars I and II\". In case you did not know, it is very important what the drafters meant, because you have to interpret the convention in that way. Since blockade is an acceptable tool of warfare (blockade as is in \"no trading\") We can ignore protocol 2 as well. What we are required is to provide access to the goods to Gaza, and even that we can ignore, if these goods fall to the hands of the enemy (Hamas). Since that has already happened, we can starve them all, in a completely legal way. This message has been edited. Last edited by: PanzerMeister, Sun 05 April 2009 07:14 AM", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 06:54:00", 
        "title": "Israel on Trial", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: Ah, it is good to see another IDF member on the board. Shalom Yoav. To the topic: NSNN, i have addressed the issue of \"CHILLING testimony by Israeli soldiers\". It have been proved as crap. Both of them admit that they have not seen anything, and all they have is hearsay. link Now that's really adorable. You link to a previous post of YOURS saying this is all BS, and using your own words as a source. Gosh - How original! Dave", 
        "intTime": 20090405, 
        "postID": 49, 
        "quote": "Originally posted by PanzerMeister: Ah, it is good to see another IDF member on the board. Shalom Yoav. To the topic: NSNN, i have addressed the issue of \"CHILLING testimony by Israeli soldiers\". It have been proved as crap. Both of them admit that they have not seen anything, and all they have is hearsay. link", 
        "reply": " Now that's really adorable. You link to a previous post of YOURS saying this is all BS, and using your own words as a source. Gosh - How original! Dave", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 08:14:00", 
        "title": "Israel on Trial", 
        "userID": "Grachus"
    }, 
    {
        "content": "Do bother to read the link AT FULL please. Last my 2 posts to be precise. There is a link there. The link is in Hebrew, BUT, as i have already said NY has used Haarez in the first place as their source. I seriously doubt that NY has talked to the soldiers in the first place. And since Walla is Haarez site, we can safely deduct the following- Step 1)NY used Haarez=walla as its source for accusation of IDF. Step 2)Haarez backs off. Step 3)Hmmm...What does it say about NY accusations and NSNN claims? And, what does it say about NY reporter professionalism and honesty (I bet that they have not published an apology for the caricature OR a follow up on the story)? We all know what it says about NSNN, but it was obvious well before NY cries of \"foul\". The caricature done by brave and honest NY: Posting such crap before even BASIC investigation, is EXTREMELY unprofessional and represents journalism at its worst.", 
        "intTime": 20090405, 
        "postID": 50, 
        "quote": "", 
        "reply": "Do bother to read the link AT FULL please. Last my 2 posts to be precise. There is a link there. The link is in Hebrew, BUT, as i have already said NY has used Haarez in the first place as their source. I seriously doubt that NY has talked to the soldiers in the first place. And since Walla is Haarez site, we can safely deduct the following- Step 1)NY used Haarez=walla as its source for accusation of IDF. Step 2)Haarez backs off. Step 3)Hmmm...What does it say about NY accusations and NSNN claims? And, what does it say about NY reporter professionalism and honesty (I bet that they have not published an apology for the caricature OR a follow up on the story)? We all know what it says about NSNN, but it was obvious well before NY cries of \"foul\". The caricature done by brave and honest NY: Posting such crap before even BASIC investigation, is EXTREMELY unprofessional and represents journalism at its worst.", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 08:27:00", 
        "title": "Israel on Trial", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: Do bother to read the link AT FULL please. Last my 2 posts to be precise. There is a link there. The link is in Hebrew, BUT, as i have already said NY has used Haarez in the first place as their source. I seriously doubt that NY has talked to the soldiers in the first place. And since Walla is Haarez site, we can safely deduct the following- Step 1)NY used Haarez=walla as its source for accusation of IDF. Step 2)Haarez backs off. Step 3)Hmmm...What does it say about NY accusations and NSNN claims? And, what does it say about NY reporter professionalism and honesty (I bet that they have not published an apology for the caricature OR a follow up on the story)? We all know what it says about NSNN, but it was obvious well before NY cries of \"foul\". What?!?! Are you trying to confuse us into considering you personally as a valid source! BTW, I looked at the other thread (you linked), and it seems that the first & last link are from BBC!?! Also, I HAVEN’T PERSONALY CLAIMED anything…..I only posted a very valid & interesting OP-ED by George Bisharat! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090405, 
        "postID": 51, 
        "quote": "Originally posted by PanzerMeister: Do bother to read the link AT FULL please. Last my 2 posts to be precise. There is a link there. The link is in Hebrew, BUT, as i have already said NY has used Haarez in the first place as their source. I seriously doubt that NY has talked to the soldiers in the first place. And since Walla is Haarez site, we can safely deduct the following- Step 1)NY used Haarez=walla as its source for accusation of IDF. Step 2)Haarez backs off. Step 3)Hmmm...What does it say about NY accusations and NSNN claims? And, what does it say about NY reporter professionalism and honesty (I bet that they have not published an apology for the caricature OR a follow up on the story)? We all know what it says about NSNN, but it was obvious well before NY cries of \"foul\".", 
        "reply": " What?!?! Are you trying to confuse us into considering you personally as a valid source! BTW, I looked at the other thread (you linked), and it seems that the first & last link are from BBC!?! Also, I HAVEN’T PERSONALY CLAIMED anything…..I only posted a very valid & interesting OP-ED by George Bisharat! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 08:53:00", 
        "title": "Israel on Trial", 
        "userID": "NSNN"
    }, 
    {
        "content": "\"http://news.walla.co.il/?w=/1/1460854\" The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter.", 
        "intTime": 20090405, 
        "postID": 52, 
        "quote": "", 
        "reply": "\"http://news.walla.co.il/?w=/1/1460854\" The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter.", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 09:05:00", 
        "title": "Israel on Trial", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/1/1460854\" It’s in Hebrew! The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter. What report? \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090405, 
        "postID": 53, 
        "quote": "Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/1/1460854\" It’s in Hebrew! The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter. What report?", 
        "reply": " \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 09:25:00", 
        "title": "Israel on Trial", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by NSNN: quote: Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/1/1460854\" It’s in Hebrew! The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter. What report? I've looked at dozens of article that site the Harratz report, in which \"dozens\" of Israeli soldiers talk about the atrocities they watched. They're all liars? Dave", 
        "intTime": 20090405, 
        "postID": 54, 
        "quote": "Originally posted by NSNN: quote: Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/1/1460854\" It’s in Hebrew! The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter. What report?", 
        "reply": " I've looked at dozens of article that site the Harratz report, in which \"dozens\" of Israeli soldiers talk about the atrocities they watched. They're all liars? Dave", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 09:28:00", 
        "title": "Israel on Trial", 
        "userID": "Grachus"
    }, 
    {
        "content": "and yet nothing about what hamas and other Palestinian terror groups do.... nothing... like what they do is now accepted....but yet Israel isnt allowed to protect themselves from a hostile intruder... go and do whatever you have to do Israel hell kill them all if you have to...", 
        "intTime": 20090405, 
        "postID": 55, 
        "quote": "", 
        "reply": "and yet nothing about what hamas and other Palestinian terror groups do.... nothing... like what they do is now accepted....but yet Israel isnt allowed to protect themselves from a hostile intruder... go and do whatever you have to do Israel hell kill them all if you have to...", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 09:34:00", 
        "title": "Israel on Trial", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Dave-There were no \"Dozens\". Just 2 idiots. That what happens when you write something with agenda. You twist facts. 2 idiots turned 12. Like all rumors go, this \"rumor/news article\" grew bigger of its initial source. And yes, these \"Sources\" that you mention, are just one source really. It is Haarez article translated to English with different wording. Unless your \"Sources\" have done independent work (like interviewing the soldiers), they all count as one. It all has started with 2 idiots saying that \"Idf had done this and that\". NY and some other news hungry newspapers decided to capitalize on the event, and quoted Haarez, which published these 2 idiots words in the first place. During the \"Objective investigation\" done by NY and their ilk, the idiots were multiplied. NSNN-This is Israel News. Of course that it is in Hebrew. If foreign newspapers were not up to the task of publishing up-to date information, it is not my fault. As a matter of fact it is the fault of NY newspaper, because it does not give a follow up on the story, after publishing such an information. What US citizens that DO NOT know Hebrew are to understand? That IDF soldiers are headless Nazi Brutes? The only thing that i have found is here \"http://www.jewlicious.com/2009/03/idfs-military-advocate-general-closes-criminal-investigation-into-allegations-made-by-soldiers-about-gaza-offensive/\". It is NOT official news site, but it saves me the trouble to translate word for word the Hebrew article. Of course if you will find that NY HAS done a follow up, i will take my words back. Meanwhile, all i have to say, is that NY conduct is a classical case of unprofessional work, that can be only classified as a malpractice. You claim that \"i have not claimed such a thing\". Given your history of pointless Israel bashing, I do not and will not believe you. Edit: I have found one Newspaper that did have a follow up. \"http://www.boston.com/news/world/middleeast/articles/2009/03/31/israeli_investigation_dismisses_charges_of_misconduct_in_gaza_war/\" Still, i wonder if Ny has done the same. \"http://en.wikinews.org/wiki/IDF_soldiers%27_account_of_Gaza_incursion_sparks_new_war_crimes_investigations\" As is seen from this link, there were only 2 idiots. How 2 turned out to be 12? Hmm.... Of course, Haarez is not without blame, but blind subsequent publishing is, in my opinion, even worse. This message has been edited. Last edited by: PanzerMeister, Sun 05 April 2009 11:21 AM", 
        "intTime": 20090405, 
        "postID": 56, 
        "quote": "", 
        "reply": "Dave-There were no \"Dozens\". Just 2 idiots. That what happens when you write something with agenda. You twist facts. 2 idiots turned 12. Like all rumors go, this \"rumor/news article\" grew bigger of its initial source. And yes, these \"Sources\" that you mention, are just one source really. It is Haarez article translated to English with different wording. Unless your \"Sources\" have done independent work (like interviewing the soldiers), they all count as one. It all has started with 2 idiots saying that \"Idf had done this and that\". NY and some other news hungry newspapers decided to capitalize on the event, and quoted Haarez, which published these 2 idiots words in the first place. During the \"Objective investigation\" done by NY and their ilk, the idiots were multiplied. NSNN-This is Israel News. Of course that it is in Hebrew. If foreign newspapers were not up to the task of publishing up-to date information, it is not my fault. As a matter of fact it is the fault of NY newspaper, because it does not give a follow up on the story, after publishing such an information. What US citizens that DO NOT know Hebrew are to understand? That IDF soldiers are headless Nazi Brutes? The only thing that i have found is here \"http://www.jewlicious.com/2009/03/idfs-military-advocate-general-closes-criminal-investigation-into-allegations-made-by-soldiers-about-gaza-offensive/\". It is NOT official news site, but it saves me the trouble to translate word for word the Hebrew article. Of course if you will find that NY HAS done a follow up, i will take my words back. Meanwhile, all i have to say, is that NY conduct is a classical case of unprofessional work, that can be only classified as a malpractice. You claim that \"i have not claimed such a thing\". Given your history of pointless Israel bashing, I do not and will not believe you. Edit: I have found one Newspaper that did have a follow up. \"http://www.boston.com/news/world/middleeast/articles/2009/03/31/israeli_investigation_dismisses_charges_of_misconduct_in_gaza_war/\" Still, i wonder if Ny has done the same. \"http://en.wikinews.org/wiki/IDF_soldiers%27_account_of_Gaza_incursion_sparks_new_war_crimes_investigations\" As is seen from this link, there were only 2 idiots. How 2 turned out to be 12? Hmm.... Of course, Haarez is not without blame, but blind subsequent publishing is, in my opinion, even worse. This message has been edited. Last edited by: PanzerMeister, Sun 05 April 2009 11:21 AM", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 11:00:00", 
        "title": "Israel on Trial", 
        "userID": "PanzerMeister"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: and yet nothing about what hamas and other Palestinian terror groups do.... nothing... like what they do is now accepted....but yet Israel isnt allowed to protect themselves from a hostile intruder... go and do whatever you have to do Israel hell kill them all if you have to... some hate Israel for whatever reason", 
        "intTime": 20090405, 
        "postID": 57, 
        "quote": "Originally posted by outlaws93: and yet nothing about what hamas and other Palestinian terror groups do.... nothing... like what they do is now accepted....but yet Israel isnt allowed to protect themselves from a hostile intruder... go and do whatever you have to do Israel hell kill them all if you have to...", 
        "reply": " some hate Israel for whatever reason", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 12:01:00", 
        "title": "Israel on Trial", 
        "userID": "EAG154"
    }, 
    {
        "content": "quote: Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/1/1460854\" It’s in Hebrew! The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter. What report? I've looked at dozens of article that site the Harratz report, in which \"dozens\" of Israeli soldiers talk about the atrocities they watched. They're all liars? Dave I guess.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090405, 
        "postID": 58, 
        "quote": "Originally posted by Grachus: quote: Originally posted by NSNN: quote: Originally posted by PanzerMeister: \"http://news.walla.co.il/?w=/1/1460854\" It’s in Hebrew! The link is located in my second post from below in the hotlink provided in my first post on this page. In case you have not noted, I use run by Haarez site-walla, in order to prove that NY report is crap, from the first letter. What report? I've looked at dozens of article that site the Harratz report, in which \"dozens\" of Israeli soldiers talk about the atrocities they watched. They're all liars? Dave", 
        "reply": " I guess.... \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 12:23:00", 
        "title": "Israel on Trial", 
        "userID": "NSNN"
    }, 
    {
        "content": "quote: Originally posted by EAG154: CHILLING testimony by Israeli soldiers substantiates charges that Israel’s Gaza Strip assault entailed grave violations of international law. The emergence of a predominantly right-wing, nationalist government in Israel suggests that there may be more violations to come. Hamas’s indiscriminate rocket attacks on Israeli civilians also constituted war crimes, but do not excuse Israel’s transgressions. While Israel disputes some of the soldiers’ accounts, the evidence suggests that Israel committed the following six offenses: quote: Originally posted by PanzerMeister NSNN-This is Israel News. Of course that it is in Hebrew. If foreign newspapers were not up to the task of publishing up-to date information, it is not my fault. That settles it then! We’ll rely solely on you & sources you find fit to paint us a complete and accurate picture of Gaza conflict! I’m sorry but although some say it tastes quite good, I don’t drink Kool Aid! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090405, 
        "postID": 59, 
        "quote": "Originally posted by EAG154:", 
        "reply": " CHILLING testimony by Israeli soldiers substantiates charges that Israel’s Gaza Strip assault entailed grave violations of international law. The emergence of a predominantly right-wing, nationalist government in Israel suggests that there may be more violations to come. Hamas’s indiscriminate rocket attacks on Israeli civilians also constituted war crimes, but do not excuse Israel’s transgressions. While Israel disputes some of the soldiers’ accounts, the evidence suggests that Israel committed the following six offenses: quote: Originally posted by PanzerMeister NSNN-This is Israel News. Of course that it is in Hebrew. If foreign newspapers were not up to the task of publishing up-to date information, it is not my fault. That settles it then! We’ll rely solely on you & sources you find fit to paint us a complete and accurate picture of Gaza conflict! I’m sorry but although some say it tastes quite good, I don’t drink Kool Aid! \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 12:24:00", 
        "title": "Israel on Trial", 
        "userID": "NSNN"
    }, 
    {
        "content": "And yet you were quick to accuse Israel using the SAME source. Pathetic. Edit-in case you have not noticed, there were only 2 idiots, so your \"i guess\" does not amount for much.", 
        "intTime": 20090405, 
        "postID": 60, 
        "quote": "", 
        "reply": "And yet you were quick to accuse Israel using the SAME source. Pathetic. Edit-in case you have not noticed, there were only 2 idiots, so your \"i guess\" does not amount for much.", 
        "threadID": "672198221_3660028912001", 
        "time": "2009-04-05 13:04:00", 
        "title": "Israel on Trial", 
        "userID": "PanzerMeister"
    }
]