[
    {
        "content": "What are U.S. goals in Afghanistan? WASHINGTON -- President Barack Obama is making a big mistake in escalating U.S. troop strength in Afghanistan where he already has acknowledged he doesn't believe victory is possible. We should ask: What are we doing there seven years after the 9/11 attacks by the al-Qaida network? Historically, the country has lacked a strong central government and has been governed by locally strong tribal leaders and warlords. Al-Qaida was able to take advantage of this loose structure and turn Afghanistan into the plotting ground for the terrorists who struck the Pentagon and the World Trade Center in New York. But what are our goals there in 2009? Read the full article here > >http://seattlepi.nwsource.com/printer2/index.asp?ploc=t&refer=http://seattlepi.nwsource.com/opinion/403461_thomas13.html Helen Thomas has some very good points.", 
        "intTime": 20090314, 
        "postID": 1, 
        "quote": "", 
        "reply": "What are U.S. goals in Afghanistan? WASHINGTON -- President Barack Obama is making a big mistake in escalating U.S. troop strength in Afghanistan where he already has acknowledged he doesn't believe victory is possible. We should ask: What are we doing there seven years after the 9/11 attacks by the al-Qaida network? Historically, the country has lacked a strong central government and has been governed by locally strong tribal leaders and warlords. Al-Qaida was able to take advantage of this loose structure and turn Afghanistan into the plotting ground for the terrorists who struck the Pentagon and the World Trade Center in New York. But what are our goals there in 2009? Read the full article here > >http://seattlepi.nwsource.com/printer2/index.asp?ploc=t&refer=http://seattlepi.nwsource.com/opinion/403461_thomas13.html Helen Thomas has some very good points.", 
        "threadID": "672198221_4930058712001", 
        "time": "2009-03-14 10:29:00", 
        "title": "What are U.S. goals in Afghanistan?", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "I've tried to get to the web address that you indicate but could not. So, I did not read the article. That being said, I can only think of one good reason for the US remaining in Afghanistan: Pakistan's nuclear capability. If the Talaban and/alQaeda should get access to an atomic weapon, it would present a serious threat to all, including the US. Our presence in the region may prevent that.", 
        "intTime": 20090314, 
        "postID": 2, 
        "quote": "", 
        "reply": "I've tried to get to the web address that you indicate but could not. So, I did not read the article. That being said, I can only think of one good reason for the US remaining in Afghanistan: Pakistan's nuclear capability. If the Talaban and/alQaeda should get access to an atomic weapon, it would present a serious threat to all, including the US. Our presence in the region may prevent that.", 
        "threadID": "672198221_4930058712001", 
        "time": "2009-03-14 17:34:00", 
        "title": "What are U.S. goals in Afghanistan?", 
        "userID": "fnewt"
    }, 
    {
        "content": "Try this ++http://seattlepi.nwsource.com/opinion/403461_thomas13.html", 
        "intTime": 20090315, 
        "postID": 3, 
        "quote": "", 
        "reply": "Try this ++http://seattlepi.nwsource.com/opinion/403461_thomas13.html", 
        "threadID": "672198221_4930058712001", 
        "time": "2009-03-15 10:41:00", 
        "title": "What are U.S. goals in Afghanistan?", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Thanks. That web address is good except for the ++ at the beginning. I have now read Helen Thomas' article. I agree with her. I had no quarrel with \"W's\" Afghan incursion. If it had been pursued, the US would have eliminated bin Laden and alQaida and, having completed a successful mission, gotten out. Instead, we diverted our forces into Iraq and got into a quagmire there. Consequently, we have lost out in both Afghanistan and Iraq, seriously depleted our military capability as well, and have alienated much of the world.", 
        "intTime": 20090315, 
        "postID": 4, 
        "quote": "", 
        "reply": "Thanks. That web address is good except for the ++ at the beginning. I have now read Helen Thomas' article. I agree with her. I had no quarrel with \"W's\" Afghan incursion. If it had been pursued, the US would have eliminated bin Laden and alQaida and, having completed a successful mission, gotten out. Instead, we diverted our forces into Iraq and got into a quagmire there. Consequently, we have lost out in both Afghanistan and Iraq, seriously depleted our military capability as well, and have alienated much of the world.", 
        "threadID": "672198221_4930058712001", 
        "time": "2009-03-15 11:11:00", 
        "title": "What are U.S. goals in Afghanistan?", 
        "userID": "fnewt"
    }, 
    {
        "content": "quote: Originally posted by fnewt: Thanks. That web address is good except for the ++ at the beginning. I have now read Helen Thomas' article. I agree with her. I had no quarrel with \"W's\" Afghan incursion. If it had been pursued, the US would have eliminated bin Laden and alQaida and, having completed a successful mission, gotten out. Instead, we diverted our forces into Iraq and got into a quagmire there. Consequently, we have lost out in both Afghanistan and Iraq, seriously depleted our military capability as well, and have alienated much of the world. Our mistake in Afghanistan, as in so many neocolonial wars, has been to align ourselves with those whose motivations are personal greed. Why haven't \"we\" cleaned up in Afghanistan? For the same question that many often ask - Why aren't our supporters ready to fight, while the enemy fights so hard? Could it be that we choose the wrong people to support? That we will be there forever because these \"tame\" Fundamentalists, and dope dealers are only motivated by money? There are people in Afghanistan who are just as motivated to fight the Taliban as we are or even more - And those are the forces of Secularism. From right wing Monarchists to left wing Communists (and everyone in between) these people have motivation to fight their enemy who happens to be our enemy. Get rid of this rediculous Karzai and his dope dealing buddies, and recruit and appeal to those who while they might not be our friends, have plenty of reason to fight the Taliban and NO REASON to actually attack us. When the smoke clears, I couldn't care less if they are our allies - As long as they're not our enemies - It's all peachy with me. Dave", 
        "intTime": 20090315, 
        "postID": 5, 
        "quote": "Originally posted by fnewt: Thanks. That web address is good except for the ++ at the beginning. I have now read Helen Thomas' article. I agree with her. I had no quarrel with \"W's\" Afghan incursion. If it had been pursued, the US would have eliminated bin Laden and alQaida and, having completed a successful mission, gotten out. Instead, we diverted our forces into Iraq and got into a quagmire there. Consequently, we have lost out in both Afghanistan and Iraq, seriously depleted our military capability as well, and have alienated much of the world.", 
        "reply": " Our mistake in Afghanistan, as in so many neocolonial wars, has been to align ourselves with those whose motivations are personal greed. Why haven't \"we\" cleaned up in Afghanistan? For the same question that many often ask - Why aren't our supporters ready to fight, while the enemy fights so hard? Could it be that we choose the wrong people to support? That we will be there forever because these \"tame\" Fundamentalists, and dope dealers are only motivated by money? There are people in Afghanistan who are just as motivated to fight the Taliban as we are or even more - And those are the forces of Secularism. From right wing Monarchists to left wing Communists (and everyone in between) these people have motivation to fight their enemy who happens to be our enemy. Get rid of this rediculous Karzai and his dope dealing buddies, and recruit and appeal to those who while they might not be our friends, have plenty of reason to fight the Taliban and NO REASON to actually attack us. When the smoke clears, I couldn't care less if they are our allies - As long as they're not our enemies - It's all peachy with me. Dave", 
        "threadID": "672198221_4930058712001", 
        "time": "2009-03-15 11:24:00", 
        "title": "What are U.S. goals in Afghanistan?", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by fnewt: Thanks. That web address is good except for the ++ at the beginning. Perhaps you are not aware that posting a \"hot link\" is not allowed on mil.com hence the ++. When you add that it becomes a \"cold link\" and you have to delete the ++ and copy the link into your browser.", 
        "intTime": 20090315, 
        "postID": 6, 
        "quote": "Originally posted by fnewt: Thanks. That web address is good except for the ++ at the beginning.", 
        "reply": " Perhaps you are not aware that posting a \"hot link\" is not allowed on mil.com hence the ++. When you add that it becomes a \"cold link\" and you have to delete the ++ and copy the link into your browser.", 
        "threadID": "672198221_4930058712001", 
        "time": "2009-03-15 11:46:00", 
        "title": "What are U.S. goals in Afghanistan?", 
        "userID": "IHAWKER"
    }, 
    {
        "content": "Hawker, the only trouble with the link is that I did get it. The soul purpose of a very short diatribe was Bush bashing and a historical recount of events the author knows less about in our history than Afghanistan. To answer your question on the US goals would have to follow some kind of intelligent remark or story to the subject matter. Nothing appears worth rebuttal.", 
        "intTime": 20090315, 
        "postID": 7, 
        "quote": "", 
        "reply": "Hawker, the only trouble with the link is that I did get it. The soul purpose of a very short diatribe was Bush bashing and a historical recount of events the author knows less about in our history than Afghanistan. To answer your question on the US goals would have to follow some kind of intelligent remark or story to the subject matter. Nothing appears worth rebuttal.", 
        "threadID": "672198221_4930058712001", 
        "time": "2009-03-15 15:07:00", 
        "title": "What are U.S. goals in Afghanistan?", 
        "userID": "rayevinsonsr"
    }
]