[
    {
        "content": "RE: http://www.military.com/features/0,15240,187998,00.html It can demage the retna.", 
        "intTime": 20090401, 
        "postID": 1, 
        "quote": "", 
        "reply": "RE: http://www.military.com/features/0,15240,187998,00.html It can demage the retna.", 
        "threadID": "672198221_4630015912001", 
        "time": "2009-04-01 05:39:00", 
        "title": "GIs in Iraq Hit by Laser Friendly Fire", 
        "userID": "9644985"
    }, 
    {
        "content": "Wasn't the military at one time looking at individual eye protection for this very reason? I know the Army experimented with a laser weapon that was intended \"dazzle\" enemy optics over a wide area of the battlefield, but cancelled it at least partly because of concerns that it violate the Geneva/Hague Conventions (could permanently blind people).", 
        "intTime": 20090401, 
        "postID": 2, 
        "quote": "", 
        "reply": "Wasn't the military at one time looking at individual eye protection for this very reason? I know the Army experimented with a laser weapon that was intended \"dazzle\" enemy optics over a wide area of the battlefield, but cancelled it at least partly because of concerns that it violate the Geneva/Hague Conventions (could permanently blind people).", 
        "threadID": "672198221_4630015912001", 
        "time": "2009-04-01 06:00:00", 
        "title": "GIs in Iraq Hit by Laser Friendly Fire", 
        "userID": "Motive25"
    }, 
    {
        "content": "quote: Originally posted by Motive25: Wasn't the military at one time looking at individual eye protection for this very reason? I know the Army experimented with a laser weapon that was intended \"dazzle\" enemy optics over a wide area of the battlefield, but cancelled it at least partly because of concerns that it violate the Geneva/Hague Conventions (could permanently blind people). We do wear eye protection as well as everyother protection out there. Wouldn't think the laser would go through sun glasses and blind you, but maybe it does. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090401, 
        "postID": 3, 
        "quote": "Originally posted by Motive25: Wasn't the military at one time looking at individual eye protection for this very reason? I know the Army experimented with a laser weapon that was intended \"dazzle\" enemy optics over a wide area of the battlefield, but cancelled it at least partly because of concerns that it violate the Geneva/Hague Conventions (could permanently blind people).", 
        "reply": " We do wear eye protection as well as everyother protection out there. Wouldn't think the laser would go through sun glasses and blind you, but maybe it does. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4630015912001", 
        "time": "2009-04-01 12:02:00", 
        "title": "GIs in Iraq Hit by Laser Friendly Fire", 
        "userID": "Anbar7"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Motive25: Wasn't the military at one time looking at individual eye protection for this very reason? I know the Army experimented with a laser weapon that was intended \"dazzle\" enemy optics over a wide area of the battlefield, but cancelled it at least partly because of concerns that it violate the Geneva/Hague Conventions (could permanently blind people). We do wear eye protection as well as everyother protection out there. Wouldn't think the laser would go through sun glasses and blind you, but maybe it does. We have ballistic / laser protective shields.", 
        "intTime": 20090401, 
        "postID": 4, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Motive25: Wasn't the military at one time looking at individual eye protection for this very reason? I know the Army experimented with a laser weapon that was intended \"dazzle\" enemy optics over a wide area of the battlefield, but cancelled it at least partly because of concerns that it violate the Geneva/Hague Conventions (could permanently blind people). We do wear eye protection as well as everyother protection out there. Wouldn't think the laser would go through sun glasses and blind you, but maybe it does.", 
        "reply": " We have ballistic / laser protective shields.", 
        "threadID": "672198221_4630015912001", 
        "time": "2009-04-01 14:48:00", 
        "title": "GIs in Iraq Hit by Laser Friendly Fire", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by Anbar7: quote: Originally posted by Motive25: Wasn't the military at one time looking at individual eye protection for this very reason? I know the Army experimented with a laser weapon that was intended \"dazzle\" enemy optics over a wide area of the battlefield, but cancelled it at least partly because of concerns that it violate the Geneva/Hague Conventions (could permanently blind people). We do wear eye protection as well as everyother protection out there. Wouldn't think the laser would go through sun glasses and blind you, but maybe it does. It does go through ordinary sun glasses. those kind of glasses are no protection at all. I was Facility Chief at Ft. Rucker's aerial gunnery range complex and that was always a point of contention with the tower controllers… The cobras and Apaches continuously forgot to turn their laser systems off while in the traffic pattern and would often times lase the towers. With two controllers inside. The Army said it was too expensive to retrofit the towers. I have no idea if they ever corrected the problem or not.", 
        "intTime": 20090401, 
        "postID": 5, 
        "quote": "Originally posted by Anbar7: quote: Originally posted by Motive25: Wasn't the military at one time looking at individual eye protection for this very reason? I know the Army experimented with a laser weapon that was intended \"dazzle\" enemy optics over a wide area of the battlefield, but cancelled it at least partly because of concerns that it violate the Geneva/Hague Conventions (could permanently blind people). We do wear eye protection as well as everyother protection out there. Wouldn't think the laser would go through sun glasses and blind you, but maybe it does.", 
        "reply": " It does go through ordinary sun glasses. those kind of glasses are no protection at all. I was Facility Chief at Ft. Rucker's aerial gunnery range complex and that was always a point of contention with the tower controllers… The cobras and Apaches continuously forgot to turn their laser systems off while in the traffic pattern and would often times lase the towers. With two controllers inside. The Army said it was too expensive to retrofit the towers. I have no idea if they ever corrected the problem or not.", 
        "threadID": "672198221_4630015912001", 
        "time": "2009-04-01 15:10:00", 
        "title": "GIs in Iraq Hit by Laser Friendly Fire", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by ArtMarsh: quote: Originally posted by Anbar7: quote: Originally posted by Motive25: Wasn't the military at one time looking at individual eye protection for this very reason? I know the Army experimented with a laser weapon that was intended \"dazzle\" enemy optics over a wide area of the battlefield, but cancelled it at least partly because of concerns that it violate the Geneva/Hague Conventions (could permanently blind people). We do wear eye protection as well as everyother protection out there. Wouldn't think the laser would go through sun glasses and blind you, but maybe it does. It does go through ordinary sun glasses. those kind of glasses are no protection at all. I was Facility Chief at Ft. Rucker's aerial gunnery range complex and that was always a point of contention with the tower controllers… The cobras and Apaches continuously forgot to turn their laser systems off while in the traffic pattern and would often times lase the towers. With two controllers inside. The Army said it was too expensive to retrofit the towers. I have no idea if they ever corrected the problem or not. Yep, a few soldiers got hit by M1's during the 90's, tore up their retina's. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090401, 
        "postID": 6, 
        "quote": "Originally posted by ArtMarsh: quote: Originally posted by Anbar7: quote: Originally posted by Motive25: Wasn't the military at one time looking at individual eye protection for this very reason? I know the Army experimented with a laser weapon that was intended \"dazzle\" enemy optics over a wide area of the battlefield, but cancelled it at least partly because of concerns that it violate the Geneva/Hague Conventions (could permanently blind people). We do wear eye protection as well as everyother protection out there. Wouldn't think the laser would go through sun glasses and blind you, but maybe it does. It does go through ordinary sun glasses. those kind of glasses are no protection at all. I was Facility Chief at Ft. Rucker's aerial gunnery range complex and that was always a point of contention with the tower controllers… The cobras and Apaches continuously forgot to turn their laser systems off while in the traffic pattern and would often times lase the towers. With two controllers inside. The Army said it was too expensive to retrofit the towers. I have no idea if they ever corrected the problem or not.", 
        "reply": " Yep, a few soldiers got hit by M1's during the 90's, tore up their retina's. Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4630015912001", 
        "time": "2009-04-01 15:22:00", 
        "title": "GIs in Iraq Hit by Laser Friendly Fire", 
        "userID": "L0A1"
    }, 
    {
        "content": "The laser safety training we got on F14s was simple: Don't look in the laser...", 
        "intTime": 20090401, 
        "postID": 7, 
        "quote": "", 
        "reply": "The laser safety training we got on F14s was simple: Don't look in the laser...", 
        "threadID": "672198221_4630015912001", 
        "time": "2009-04-01 15:30:00", 
        "title": "GIs in Iraq Hit by Laser Friendly Fire", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: The laser safety training we got on F14s was simple: Don't look in the laser... LOL, good one. I am talking about Calfex (War games Combine Logistic fire excerises) when it was accidental. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "intTime": 20090401, 
        "postID": 8, 
        "quote": "Originally posted by crackerjacks61: The laser safety training we got on F14s was simple: Don't look in the laser...", 
        "reply": " LOL, good one. I am talking about Calfex (War games Combine Logistic fire excerises) when it was accidental. LOL Todays politics remind me of an old saying. - \"Ideas are more powerful than guns. We would not let our enemies have guns, why should we let them have ideas?\" - Joseph Stalin", 
        "threadID": "672198221_4630015912001", 
        "time": "2009-04-01 15:59:00", 
        "title": "GIs in Iraq Hit by Laser Friendly Fire", 
        "userID": "L0A1"
    }, 
    {
        "content": "quote: Originally posted by L0A1: quote: Originally posted by crackerjacks61: The laser safety training we got on F14s was simple: Don't look in the laser... LOL, good one. I am talking about Calfex (War games Combine Logistic fire excerises) when it was accidental. LOL And I am talking about the daily exposure 6 days a week and 50 weeks out of the year and the mandatory requirement that Air Controllers visually observe the aircraft they are controlling on the range. The traffic patterns are about 12 miles long... plenty of time to accidentally lase a tower... and the personnel inside.", 
        "intTime": 20090402, 
        "postID": 9, 
        "quote": "Originally posted by L0A1: quote: Originally posted by crackerjacks61: The laser safety training we got on F14s was simple: Don't look in the laser... LOL, good one. I am talking about Calfex (War games Combine Logistic fire excerises) when it was accidental. LOL", 
        "reply": " And I am talking about the daily exposure 6 days a week and 50 weeks out of the year and the mandatory requirement that Air Controllers visually observe the aircraft they are controlling on the range. The traffic patterns are about 12 miles long... plenty of time to accidentally lase a tower... and the personnel inside.", 
        "threadID": "672198221_4630015912001", 
        "time": "2009-04-02 10:37:00", 
        "title": "GIs in Iraq Hit by Laser Friendly Fire", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by Anbar7: quote: Originally posted by Motive25: Wasn't the military at one time looking at individual eye protection for this very reason? I know the Army experimented with a laser weapon that was intended \"dazzle\" enemy optics over a wide area of the battlefield, but cancelled it at least partly because of concerns that it violate the Geneva/Hague Conventions (could permanently blind people). We do wear eye protection as well as everyother protection out there. Wouldn't think the laser would go through sun glasses and blind you, but maybe it does. We have ballistic / laser protective shields. BC's? We have ballistic too, but we have Black, Orange, Yellow, and Clear. I just figured that one of em would prevent laser damage, but guess not. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "intTime": 20090402, 
        "postID": 10, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by Anbar7: quote: Originally posted by Motive25: Wasn't the military at one time looking at individual eye protection for this very reason? I know the Army experimented with a laser weapon that was intended \"dazzle\" enemy optics over a wide area of the battlefield, but cancelled it at least partly because of concerns that it violate the Geneva/Hague Conventions (could permanently blind people). We do wear eye protection as well as everyother protection out there. Wouldn't think the laser would go through sun glasses and blind you, but maybe it does. We have ballistic / laser protective shields.", 
        "reply": " BC's? We have ballistic too, but we have Black, Orange, Yellow, and Clear. I just figured that one of em would prevent laser damage, but guess not. \"A government big enough to give you everything you want, is strong enough to take everything you have.\" ~ Gerald Ford", 
        "threadID": "672198221_4630015912001", 
        "time": "2009-04-02 11:01:00", 
        "title": "GIs in Iraq Hit by Laser Friendly Fire", 
        "userID": "Anbar7"
    }
]