[
    {
        "content": "quote: Originally posted by Grachus: But today, with a collapsing infrastructure and a rail system that looks like a Lionel table top set, doing what's necessary is called \"Pork.\" I call it the meat and potatoes of a modern country. Dave Dave, I had to create another thread. Your comment about the rail industry is the main inspiration, but that alone has much to do with what is going on. This is \"News\" due to misinformation on the part of the rail industry, and throwing blame away from where it should go. On to my post. The rail system is quite the opposite of a Lionel table top set. Freight by rail is totally the opposite of what you perceive, and what you are trying to tell others. The railway companies employ around 200,000 People. The average salary is $70,000 per annum. They moved 2,000,000,000 + tons of freight in 2008. Not bad for a so called \"Lionel table top set\". In 2008 the revenue for the rail companies was over 50 Billion dollars. There are 9 companies that account for 90 percent of revenue. These include BNSF, Union Pacific, Norfolk Southern, CSX Transportation and CNR. Those five are the largest. You then have KCS and others. There has been a total decline of 14.7 percent in rail shipments. OTOH, Shipments classified as \"other\" has seen a rise compared to 2008. All in all, the railroads have been prosperous, and have many people employed. Nearly all of the 140,000 miles of track are privately owned and maintained. So to say, that an investment right now is such a great idea, really isn't. Your solution of throwing money at something the government thinks will work, without research mind you, is dangerous and simply unwarranted. Take a look at AMTRAK. It is a GOC. GOC = Government owned corporation. AMTRAK has been a failure, and I hope you don't propose we throw more money at it. Amtrak has contributed zilch to taxes since it was taken over and became a GOC. It has cost taxpayers substantially. Do you think they would sit the successful companies like Union Pacific, Norfolk southern and others, down and inquire about success and what would be needed in order to succeed? No, they just keep throwing good money after bad without research and accountability. Hey, that is just like they have been doing with all of these spending and bailout packages. So, in your reference to the \"Lionel Table top set\", that should be used in reference to that failure of a GOC Amtrak, not in reference to the highly successful aforementioned companies. If Amtrak can teach you a lesson, it is that throwing good money after bad, simply does not work. Another lesson it teaches, is the socialization of risk, as well as companies through GOC's, simply does not work. So to fix a company like Amtrak, one needs to look to private industry. They have been successful, and you can't deny that. The bankruptcies that plagued the late 50's, 60's and 70's, and what was thought to be the end of the rail industry should be a lesson learned. Many of you seem to think deregulation is a bad thing (which it is in other instances). It was quite the opposite in the case of the rail industry. If it wasn't for the deregulation of the 80's, which therefore forced a bunch of mergers, and in turn brought the industry back to its feet, it could have quite well been the end of an industry. This success happened through the free market. It did not happen due to socialism and Government Owned Corporations. Amtrak is not the meat and potato's of a modern country. It is a lesson to be learned from (which they have not). A modern country will not fare well, if you keep wasting tax payer money, socializing risk, empowering the fiscally irresponsible, while punishing the successful. All this talk of accountability, line by line review, holding states accountable for abusing the spendulus bill, is BS. There has been none of the above happening. The Government IS abusing taxpayer money, the state and local governments ARE abusing the money already allocated to them, and collected through taxation. Before wasting any more money, these are the area's that should be dealt with in full force. By taking a company that has been doing bad business, and rewarding them with a bailout, does not teach a lesson. It does not empower those who were irresponsible, to become responsible in any way. There is no risk anymore, because risk and irresponsibility has been socialized through taxpayer money. The same goes for someone who bought a house where they knew they couldn't afford it. They bear no risk, as the risk will be socialized as well as their irresponsible actions. The same goes for the states. If they are abusing the budget, what incentive is there for them to reform their budget? What incentive is there to ensure every avenue of the budget is responsible and representative of the people who fund it? By throwing more and more money at fiscal irresponsibility, and abusiveness? Hell no. So we all are talking about roads and bridges. Again, states waste money in this area as well. There is no incentive to save money, as they want to ensure the same budget is received for the next year, if not more. All while roads are paved twice, while others have not received attention at all. \"Oh, but look at these roads that need to be paved, we need more money\". BS! Our tax money is being abused, and they have nerve to ask for more of it without reform. For those that think the socialization of risk, as well as companies is the best thing since sliced bread, you are in for a wild ride, and will ultimately be taught a hard lesson. More and more talk is going on about Cap and Trade. I can't believe that some even support these scams. That will be another kick in the jewels of our Economy, and will result in more money being taken out of the taxpayers pockets. Then there is carbon taxes, and the GWPRA. When will it end. People talk about irresponsible companies, and irresponsible people taking money away from us? How about irresponsible politicians taking away our money through these bogus scams? Take care. This message has been edited. Last edited by: Boilerman_01, Sun 01 March 2009 10:47 AM", 
        "intTime": 20090301, 
        "postID": 1, 
        "quote": "Originally posted by Grachus: But today, with a collapsing infrastructure and a rail system that looks like a Lionel table top set, doing what's necessary is called \"Pork.\" I call it the meat and potatoes of a modern country. Dave", 
        "reply": " Dave, I had to create another thread. Your comment about the rail industry is the main inspiration, but that alone has much to do with what is going on. This is \"News\" due to misinformation on the part of the rail industry, and throwing blame away from where it should go. On to my post. The rail system is quite the opposite of a Lionel table top set. Freight by rail is totally the opposite of what you perceive, and what you are trying to tell others. The railway companies employ around 200,000 People. The average salary is $70,000 per annum. They moved 2,000,000,000 + tons of freight in 2008. Not bad for a so called \"Lionel table top set\". In 2008 the revenue for the rail companies was over 50 Billion dollars. There are 9 companies that account for 90 percent of revenue. These include BNSF, Union Pacific, Norfolk Southern, CSX Transportation and CNR. Those five are the largest. You then have KCS and others. There has been a total decline of 14.7 percent in rail shipments. OTOH, Shipments classified as \"other\" has seen a rise compared to 2008. All in all, the railroads have been prosperous, and have many people employed. Nearly all of the 140,000 miles of track are privately owned and maintained. So to say, that an investment right now is such a great idea, really isn't. Your solution of throwing money at something the government thinks will work, without research mind you, is dangerous and simply unwarranted. Take a look at AMTRAK. It is a GOC. GOC = Government owned corporation. AMTRAK has been a failure, and I hope you don't propose we throw more money at it. Amtrak has contributed zilch to taxes since it was taken over and became a GOC. It has cost taxpayers substantially. Do you think they would sit the successful companies like Union Pacific, Norfolk southern and others, down and inquire about success and what would be needed in order to succeed? No, they just keep throwing good money after bad without research and accountability. Hey, that is just like they have been doing with all of these spending and bailout packages. So, in your reference to the \"Lionel Table top set\", that should be used in reference to that failure of a GOC Amtrak, not in reference to the highly successful aforementioned companies. If Amtrak can teach you a lesson, it is that throwing good money after bad, simply does not work. Another lesson it teaches, is the socialization of risk, as well as companies through GOC's, simply does not work. So to fix a company like Amtrak, one needs to look to private industry. They have been successful, and you can't deny that. The bankruptcies that plagued the late 50's, 60's and 70's, and what was thought to be the end of the rail industry should be a lesson learned. Many of you seem to think deregulation is a bad thing (which it is in other instances). It was quite the opposite in the case of the rail industry. If it wasn't for the deregulation of the 80's, which therefore forced a bunch of mergers, and in turn brought the industry back to its feet, it could have quite well been the end of an industry. This success happened through the free market. It did not happen due to socialism and Government Owned Corporations. Amtrak is not the meat and potato's of a modern country. It is a lesson to be learned from (which they have not). A modern country will not fare well, if you keep wasting tax payer money, socializing risk, empowering the fiscally irresponsible, while punishing the successful. All this talk of accountability, line by line review, holding states accountable for abusing the spendulus bill, is BS. There has been none of the above happening. The Government IS abusing taxpayer money, the state and local governments ARE abusing the money already allocated to them, and collected through taxation. Before wasting any more money, these are the area's that should be dealt with in full force. By taking a company that has been doing bad business, and rewarding them with a bailout, does not teach a lesson. It does not empower those who were irresponsible, to become responsible in any way. There is no risk anymore, because risk and irresponsibility has been socialized through taxpayer money. The same goes for someone who bought a house where they knew they couldn't afford it. They bear no risk, as the risk will be socialized as well as their irresponsible actions. The same goes for the states. If they are abusing the budget, what incentive is there for them to reform their budget? What incentive is there to ensure every avenue of the budget is responsible and representative of the people who fund it? By throwing more and more money at fiscal irresponsibility, and abusiveness? Hell no. So we all are talking about roads and bridges. Again, states waste money in this area as well. There is no incentive to save money, as they want to ensure the same budget is received for the next year, if not more. All while roads are paved twice, while others have not received attention at all. \"Oh, but look at these roads that need to be paved, we need more money\". BS! Our tax money is being abused, and they have nerve to ask for more of it without reform. For those that think the socialization of risk, as well as companies is the best thing since sliced bread, you are in for a wild ride, and will ultimately be taught a hard lesson. More and more talk is going on about Cap and Trade. I can't believe that some even support these scams. That will be another kick in the jewels of our Economy, and will result in more money being taken out of the taxpayers pockets. Then there is carbon taxes, and the GWPRA. When will it end. People talk about irresponsible companies, and irresponsible people taking money away from us? How about irresponsible politicians taking away our money through these bogus scams? Take care. This message has been edited. Last edited by: Boilerman_01, Sun 01 March 2009 10:47 AM", 
        "threadID": "672198221_1400095612001", 
        "time": "2009-03-01 09:35:00", 
        "title": "Throwing our money away", 
        "userID": "Boilerman_01"
    }, 
    {
        "content": "Had to shorten the title of the thread, it was rather long. I have to add. How can people say that 95 percent of Americans will receive a tax cut? That is a blatant lie. The Cap and trade scam will be a back door increase for 100% of Americans. Don't forget, they plan on forcing carbon taxes and GWPRA down our throats as well. More and more money taken from 100% of Americans, all while accomplishing nothing.", 
        "intTime": 20090301, 
        "postID": 2, 
        "quote": "", 
        "reply": "Had to shorten the title of the thread, it was rather long. I have to add. How can people say that 95 percent of Americans will receive a tax cut? That is a blatant lie. The Cap and trade scam will be a back door increase for 100% of Americans. Don't forget, they plan on forcing carbon taxes and GWPRA down our throats as well. More and more money taken from 100% of Americans, all while accomplishing nothing.", 
        "threadID": "672198221_1400095612001", 
        "time": "2009-03-01 10:53:00", 
        "title": "Throwing our money away", 
        "userID": "Boilerman_01"
    }, 
    {
        "content": "quote: Originally posted by Boilerman_01: Had to shorten the title of the thread, it was rather long. I have to add. How can people say that 95 percent of Americans will receive a tax cut? That is a blatant lie. The Cap and trade scam will be a back door increase for 100% of Americans. Don't forget, they plan on forcing carbon taxes and GWPRA down our throats as well. More and more money taken from 100% of Americans, all while accomplishing nothing. Well put. What is being completely ignored are the pass down taxes that no one is looking at too. BTW, Grachus isn't interested a bit in your point. All he can think about is Lionel Trains!", 
        "intTime": 20090301, 
        "postID": 3, 
        "quote": "Originally posted by Boilerman_01: Had to shorten the title of the thread, it was rather long. I have to add. How can people say that 95 percent of Americans will receive a tax cut? That is a blatant lie. The Cap and trade scam will be a back door increase for 100% of Americans. Don't forget, they plan on forcing carbon taxes and GWPRA down our throats as well. More and more money taken from 100% of Americans, all while accomplishing nothing.", 
        "reply": " Well put. What is being completely ignored are the pass down taxes that no one is looking at too. BTW, Grachus isn't interested a bit in your point. All he can think about is Lionel Trains!", 
        "threadID": "672198221_1400095612001", 
        "time": "2009-03-01 16:08:00", 
        "title": "Throwing our money away", 
        "userID": "busnrete8"
    }, 
    {
        "content": "Thanks Bus. Where there is crisis there is opportunity. How can Obama say that Credit is the lifeblood of our economy? We have to save to create credit. You can not just pull credit from thin air. Have we not learned from the mortgage crisis? To perpetuate credit over capital is simply irresponsible, dangerous, and will only create another bubble. To encourage anyone to go out and go into debt in order to buy something like a car.....that isn't responsible. If you can't pay for it with your salary, why do you need to pay for it through credit? People seem to think credit is capital, when it is clearly nothing of the sort. The heavy reliance on credit needs to be a habit that should be broken. That is not the case when you have someone saying how credit is the lifeblood of our economy, and that we need to get it flowing again so that people can once again, buy things they could not afford. People should live within their means, not way beyond through credit. Gee, don't you think the government should go by those same principals? Our own government can't live within their means, so how can they possibly tell others to do the same?....wait, they are voicing support of irresponsibility through credit. It seems that Government is cheer leading another spending spree, which has led us to disaster. Credit is not all bad. Companies making capital investments, folks getting a home loan..I'm talking about those who have done the research and can afford it, or those buying a car. People that can afford it, by all means. People that think they are entitled to it, and know they can't afford it, the time for irresponsibility is over.....so we think. It will be rewarded through bailouts and spending. All of this government intervention is not working, and will only create more bubbles that we will have to deal with yet again down the road. Back to the back door taxes. As I have said, the Cap and Trade scam will create a futures market on a grander scale. You thought oil futures were bad, just wait. I can't believe people are yelling about jobs going over seas. And then they go on to say how they support the Cap and Trade, Carbon Tax, and GWPRA scams. The government has shown how successful it can be at running something, look at Amtrak .", 
        "intTime": 20090301, 
        "postID": 4, 
        "quote": "", 
        "reply": "Thanks Bus. Where there is crisis there is opportunity. How can Obama say that Credit is the lifeblood of our economy? We have to save to create credit. You can not just pull credit from thin air. Have we not learned from the mortgage crisis? To perpetuate credit over capital is simply irresponsible, dangerous, and will only create another bubble. To encourage anyone to go out and go into debt in order to buy something like a car.....that isn't responsible. If you can't pay for it with your salary, why do you need to pay for it through credit? People seem to think credit is capital, when it is clearly nothing of the sort. The heavy reliance on credit needs to be a habit that should be broken. That is not the case when you have someone saying how credit is the lifeblood of our economy, and that we need to get it flowing again so that people can once again, buy things they could not afford. People should live within their means, not way beyond through credit. Gee, don't you think the government should go by those same principals? Our own government can't live within their means, so how can they possibly tell others to do the same?....wait, they are voicing support of irresponsibility through credit. It seems that Government is cheer leading another spending spree, which has led us to disaster. Credit is not all bad. Companies making capital investments, folks getting a home loan..I'm talking about those who have done the research and can afford it, or those buying a car. People that can afford it, by all means. People that think they are entitled to it, and know they can't afford it, the time for irresponsibility is over.....so we think. It will be rewarded through bailouts and spending. All of this government intervention is not working, and will only create more bubbles that we will have to deal with yet again down the road. Back to the back door taxes. As I have said, the Cap and Trade scam will create a futures market on a grander scale. You thought oil futures were bad, just wait. I can't believe people are yelling about jobs going over seas. And then they go on to say how they support the Cap and Trade, Carbon Tax, and GWPRA scams. The government has shown how successful it can be at running something, look at Amtrak .", 
        "threadID": "672198221_1400095612001", 
        "time": "2009-03-01 18:54:00", 
        "title": "Throwing our money away", 
        "userID": "Boilerman_01"
    }, 
    {
        "content": "Wasn't AMTRAK created to provide paassenger service that railroads saw as unprofitable and were divesting? Didn't AMTRAK assume pension payments for a large number of railroad employees who might not otherwise have been entitled? AMTRAK runs on freight lines owned by other companies. Do they get 'right of way' free? AMATRAK is still underutilized. For most travellers it doesn't compete with air, or automobile. But considering government expenditure on highway and airport construction and maintenance, those other areas get their share of the 'pork' too. In geographically large countries, train is an excellent mode of transportation. High speed train has been well-tested and could be viable on some US routes. High-priced fuels caused the first blip in the trucking industry, the economic slow-down might just kill it (diesel is at all-time highs, competition for fewer runs is driving freight rates down). Investing in rail infrastructure isn't necessarily short sighted. Mexico is reaping the benefit of a high speed system they started building 15 years ago.", 
        "intTime": 20090302, 
        "postID": 5, 
        "quote": "", 
        "reply": "Wasn't AMTRAK created to provide paassenger service that railroads saw as unprofitable and were divesting? Didn't AMTRAK assume pension payments for a large number of railroad employees who might not otherwise have been entitled? AMTRAK runs on freight lines owned by other companies. Do they get 'right of way' free? AMATRAK is still underutilized. For most travellers it doesn't compete with air, or automobile. But considering government expenditure on highway and airport construction and maintenance, those other areas get their share of the 'pork' too. In geographically large countries, train is an excellent mode of transportation. High speed train has been well-tested and could be viable on some US routes. High-priced fuels caused the first blip in the trucking industry, the economic slow-down might just kill it (diesel is at all-time highs, competition for fewer runs is driving freight rates down). Investing in rail infrastructure isn't necessarily short sighted. Mexico is reaping the benefit of a high speed system they started building 15 years ago.", 
        "threadID": "672198221_1400095612001", 
        "time": "2009-03-02 08:06:00", 
        "title": "Throwing our money away", 
        "userID": "popsiq"
    }, 
    {
        "content": "Please don't make Amtrak more than it is. Investing in rail infrastructure has been successfully done by previous mentioned companies. What is short sighted is that government should fund, and run any high speed rail project. It should be done through the free market, which has so clearly demonstrated its success. You explained it yourself \"AMATRAK is still underutilized. For most travellers it doesn't compete with air, or automobile.\" So why do we need to throw more and more money at something that offers no competition, and is a drain, more than a profit? It should be left to the free market. The government can offer incentives to companies, like it does in other cases that know how to turn a profit. If it is done through the free market, we will not have to pay for anything but incentives, which in turn will be paid back in tax revenue. If it is government run, we the people will have to fund every aspect of the project. Comparing Amtrak, which is a GOC, to private industry, you would have to be blind as to see which has been successful, and which has been a flop. By the way....how is Mexico reaping any benefits from a high speed rail system they do not have? This message has been edited. Last edited by: Boilerman_01, Mon 02 March 2009 01:04 PM", 
        "intTime": 20090302, 
        "postID": 6, 
        "quote": "", 
        "reply": "Please don't make Amtrak more than it is. Investing in rail infrastructure has been successfully done by previous mentioned companies. What is short sighted is that government should fund, and run any high speed rail project. It should be done through the free market, which has so clearly demonstrated its success. You explained it yourself \"AMATRAK is still underutilized. For most travellers it doesn't compete with air, or automobile.\" So why do we need to throw more and more money at something that offers no competition, and is a drain, more than a profit? It should be left to the free market. The government can offer incentives to companies, like it does in other cases that know how to turn a profit. If it is done through the free market, we will not have to pay for anything but incentives, which in turn will be paid back in tax revenue. If it is government run, we the people will have to fund every aspect of the project. Comparing Amtrak, which is a GOC, to private industry, you would have to be blind as to see which has been successful, and which has been a flop. By the way....how is Mexico reaping any benefits from a high speed rail system they do not have? This message has been edited. Last edited by: Boilerman_01, Mon 02 March 2009 01:04 PM", 
        "threadID": "672198221_1400095612001", 
        "time": "2009-03-02 12:30:00", 
        "title": "Throwing our money away", 
        "userID": "Boilerman_01"
    }, 
    {
        "content": "Another 410 Billion, loaded with pork. 8,500 pork projects . Whomever voted yes should be ashamed of themselves. That is in no way representative of the people. More and more bailouts....it isn't working, so let's just throw more good money after bad . Change, accountability, line by line review, no more of the same. Yeah...just words. So, people are still bringing up the spending of the Bush administration (already have shared quite a few of my disagreements in ref. to Bush admin), but now that Obama is throwing taxpayer dollars away faster then you can say oh $h*T, it is OK. On top of all this, there is Universal Health care. What else....oh, now everyone should get a handout to go to college? What ever happened to earning it? Our Military has earned money for college. Folks who worked hard and made it through college on their own merit.....guess what, they earned it. They didn't sit around waiting for a handout and think they were entitled to it, just because someone else has it. They busted @$$ and earned it. The people that lambasted McCain for saying \"the fundamentals of our economy are strong\" were damn silent when the CIC said \"credit is the lifeblood of our economy\".", 
        "intTime": 20090303, 
        "postID": 7, 
        "quote": "", 
        "reply": "Another 410 Billion, loaded with pork. 8,500 pork projects . Whomever voted yes should be ashamed of themselves. That is in no way representative of the people. More and more bailouts....it isn't working, so let's just throw more good money after bad . Change, accountability, line by line review, no more of the same. Yeah...just words. So, people are still bringing up the spending of the Bush administration (already have shared quite a few of my disagreements in ref. to Bush admin), but now that Obama is throwing taxpayer dollars away faster then you can say oh $h*T, it is OK. On top of all this, there is Universal Health care. What else....oh, now everyone should get a handout to go to college? What ever happened to earning it? Our Military has earned money for college. Folks who worked hard and made it through college on their own merit.....guess what, they earned it. They didn't sit around waiting for a handout and think they were entitled to it, just because someone else has it. They busted @$$ and earned it. The people that lambasted McCain for saying \"the fundamentals of our economy are strong\" were damn silent when the CIC said \"credit is the lifeblood of our economy\".", 
        "threadID": "672198221_1400095612001", 
        "time": "2009-03-03 17:47:00", 
        "title": "Throwing our money away", 
        "userID": "Boilerman_01"
    }
]