[
    {
        "content": "\"http://www.newsadvance.com/lna/news/local/article/lu_pulls_plug_on_democratic_club/16172/\" quote: Liberty University has revoked its recognition of the campus Democratic Party club, saying “we are unable to lend support to a club whose parent organization stands against the moral principles held by” the university. “It kind of happened out of nowhere,” said Brian Diaz, president of LU’s student Democratic Party organization, which LU formally recognized in October. Diaz said he was notified of the school’s decision May 15 in an e-mail from Mark Hine, vice president of student affairs. According to the e-mail, the club must stop using the university’s name, holding meetings on campus, or advertising events. Hine said late Thursday that the university could not sanction an official club that supported Democratic candidates. “We are in no way attempting to stifle free speech.” Hine said the university had recently completed a policy that would govern clubs and organizations on campus. “We looked at each club and organization to determine where it stood and unfortunately this one kind of got in the sights of policy, if you will,” he said. Hine’s e-mail mentioned that he had expressed a concern to Diaz about the national Democratic Party’s platform during a meeting earlier in the semester. Last fall, Diaz said, Hine had complimented the club for being a faith-based organization working within the Democratic Party. Jan Dervish, secretary of the club, and Maria Childress, its staff adviser, said they met with Hine after the revocation and asked for a further explanation. “He said it wasn’t us. It was the national Democratic Party,” which the campus club’s constitution supports, Dervish said. The campus club also opposes abortion and supports the traditional view of marriage, Dervish said. “His bottom line was, ‘You can’t be a Democrat and be a Christian and be a university representative,’” Childress said. Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats?", 
        "intTime": 20090522, 
        "postID": 1, 
        "quote": "Liberty University has revoked its recognition of the campus Democratic Party club, saying “we are unable to lend support to a club whose parent organization stands against the moral principles held by” the university. “It kind of happened out of nowhere,” said Brian Diaz, president of LU’s student Democratic Party organization, which LU formally recognized in October. Diaz said he was notified of the school’s decision May 15 in an e-mail from Mark Hine, vice president of student affairs. According to the e-mail, the club must stop using the university’s name, holding meetings on campus, or advertising events. Hine said late Thursday that the university could not sanction an official club that supported Democratic candidates. “We are in no way attempting to stifle free speech.” Hine said the university had recently completed a policy that would govern clubs and organizations on campus. “We looked at each club and organization to determine where it stood and unfortunately this one kind of got in the sights of policy, if you will,” he said. Hine’s e-mail mentioned that he had expressed a concern to Diaz about the national Democratic Party’s platform during a meeting earlier in the semester. Last fall, Diaz said, Hine had complimented the club for being a faith-based organization working within the Democratic Party. Jan Dervish, secretary of the club, and Maria Childress, its staff adviser, said they met with Hine after the revocation and asked for a further explanation. “He said it wasn’t us. It was the national Democratic Party,” which the campus club’s constitution supports, Dervish said. The campus club also opposes abortion and supports the traditional view of marriage, Dervish said. “His bottom line was, ‘You can’t be a Democrat and be a Christian and be a university representative,’” Childress said.", 
        "reply": "\"http://www.newsadvance.com/lna/news/local/article/lu_pulls_plug_on_democratic_club/16172/\"  Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats?", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 09:15:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: \"http://www.newsadvance.com/lna/news/local/article/lu_pulls_plug_on_democratic_club/16172/\" quote: Liberty University has revoked its recognition of the campus Democratic Party club, saying “we are unable to lend support to a club whose parent organization stands against the moral principles held by” the university. “It kind of happened out of nowhere,” said Brian Diaz, president of LU’s student Democratic Party organization, which LU formally recognized in October. Diaz said he was notified of the school’s decision May 15 in an e-mail from Mark Hine, vice president of student affairs. According to the e-mail, the club must stop using the university’s name, holding meetings on campus, or advertising events. Hine said late Thursday that the university could not sanction an official club that supported Democratic candidates. “We are in no way attempting to stifle free speech.” Hine said the university had recently completed a policy that would govern clubs and organizations on campus. “We looked at each club and organization to determine where it stood and unfortunately this one kind of got in the sights of policy, if you will,” he said. Hine’s e-mail mentioned that he had expressed a concern to Diaz about the national Democratic Party’s platform during a meeting earlier in the semester. Last fall, Diaz said, Hine had complimented the club for being a faith-based organization working within the Democratic Party. Jan Dervish, secretary of the club, and Maria Childress, its staff adviser, said they met with Hine after the revocation and asked for a further explanation. “He said it wasn’t us. It was the national Democratic Party,” which the campus club’s constitution supports, Dervish said. The campus club also opposes abortion and supports the traditional view of marriage, Dervish said. “His bottom line was, ‘You can’t be a Democrat and be a Christian and be a university representative,’” Childress said. Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats? Of course. There's a price to pay for Freedom, and banning opposition groups is the only way to preserve free debate!!! Heck, I'm a Socialist, I have no use for Democrats! No sweat! Ban em! Dave", 
        "intTime": 20090522, 
        "postID": 2, 
        "quote": "Originally posted by Fightdirector: \"http://www.newsadvance.com/lna/news/local/article/lu_pulls_plug_on_democratic_club/16172/\" quote: Liberty University has revoked its recognition of the campus Democratic Party club, saying “we are unable to lend support to a club whose parent organization stands against the moral principles held by” the university. “It kind of happened out of nowhere,” said Brian Diaz, president of LU’s student Democratic Party organization, which LU formally recognized in October. Diaz said he was notified of the school’s decision May 15 in an e-mail from Mark Hine, vice president of student affairs. According to the e-mail, the club must stop using the university’s name, holding meetings on campus, or advertising events. Hine said late Thursday that the university could not sanction an official club that supported Democratic candidates. “We are in no way attempting to stifle free speech.” Hine said the university had recently completed a policy that would govern clubs and organizations on campus. “We looked at each club and organization to determine where it stood and unfortunately this one kind of got in the sights of policy, if you will,” he said. Hine’s e-mail mentioned that he had expressed a concern to Diaz about the national Democratic Party’s platform during a meeting earlier in the semester. Last fall, Diaz said, Hine had complimented the club for being a faith-based organization working within the Democratic Party. Jan Dervish, secretary of the club, and Maria Childress, its staff adviser, said they met with Hine after the revocation and asked for a further explanation. “He said it wasn’t us. It was the national Democratic Party,” which the campus club’s constitution supports, Dervish said. The campus club also opposes abortion and supports the traditional view of marriage, Dervish said. “His bottom line was, ‘You can’t be a Democrat and be a Christian and be a university representative,’” Childress said. Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats?", 
        "reply": " Of course. There's a price to pay for Freedom, and banning opposition groups is the only way to preserve free debate!!! Heck, I'm a Socialist, I have no use for Democrats! No sweat! Ban em! Dave", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 09:24:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "Grachus"
    }, 
    {
        "content": "As a self-proclaimed \"Evil Republican\" , this is wrong on so many levels. College should be a place to look at life, ect. from different view points, challenge folks' way of thinking. Liberty University? Lack thereof.", 
        "intTime": 20090522, 
        "postID": 3, 
        "quote": "", 
        "reply": "As a self-proclaimed \"Evil Republican\" , this is wrong on so many levels. College should be a place to look at life, ect. from different view points, challenge folks' way of thinking. Liberty University? Lack thereof.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 09:27:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "67NOV"
    }, 
    {
        "content": "Liberty University in Linchburg, VA is a private university. It was founded by Jerry Falwell in 1971. It's the largest private university in Virginia, offering more than 60 accredited programs of study. It is their option as to what is allowed on campus.", 
        "intTime": 20090522, 
        "postID": 4, 
        "quote": "", 
        "reply": "Liberty University in Linchburg, VA is a private university. It was founded by Jerry Falwell in 1971. It's the largest private university in Virginia, offering more than 60 accredited programs of study. It is their option as to what is allowed on campus.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 09:29:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "dmahler"
    }, 
    {
        "content": "I think this is the wrong thing to do. However, as a Private University it is completly within their rights to do so.", 
        "intTime": 20090522, 
        "postID": 5, 
        "quote": "", 
        "reply": "I think this is the wrong thing to do. However, as a Private University it is completly within their rights to do so.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 09:36:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: -snip-Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats? Should they NO, IMO this is PURE Politics and spite. Can they ONLY if it is a private college getting NO Government money. If they get Government money then IMO they should be given a choice and we would see how strongly they hold their beliefs. I wonder what would happen if losing Government money caused them to have to raise their price say by 10-20%? Would the people who made this decision take a pay cut? Raising prices MORE than other similar schools starts a downward spiral of losing students forcing increaes in price which causes the loss of more students.", 
        "intTime": 20090522, 
        "postID": 6, 
        "quote": "Originally posted by Fightdirector: -snip-Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats?", 
        "reply": " Should they NO, IMO this is PURE Politics and spite. Can they ONLY if it is a private college getting NO Government money. If they get Government money then IMO they should be given a choice and we would see how strongly they hold their beliefs. I wonder what would happen if losing Government money caused them to have to raise their price say by 10-20%? Would the people who made this decision take a pay cut? Raising prices MORE than other similar schools starts a downward spiral of losing students forcing increaes in price which causes the loss of more students.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 11:17:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "rayld2"
    }, 
    {
        "content": "I say BAN SOCIALIST AND LEAVE THE DEMOCRATS ALONE. Not worthy of a private or public school and especially a Christian school. Jerry Falwell wouldn't have done it because the fellowship of Christians are made up of every class, political party and ten percent tithers in Virginia. Once the donations drop the heirarchy might have a change of mind. The Humble shall inherit the earth, not the political.", 
        "intTime": 20090522, 
        "postID": 7, 
        "quote": "", 
        "reply": "I say BAN SOCIALIST AND LEAVE THE DEMOCRATS ALONE. Not worthy of a private or public school and especially a Christian school. Jerry Falwell wouldn't have done it because the fellowship of Christians are made up of every class, political party and ten percent tithers in Virginia. Once the donations drop the heirarchy might have a change of mind. The Humble shall inherit the earth, not the political.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 11:33:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: Jerry Falwell wouldn't have done it... Most will agree that Jerry Falwell, Senior, was a smart politician, whether or not you agreed with his views on religious or morality. Jerry Falwell, Junior, who now runs Liberty University, is not.", 
        "intTime": 20090522, 
        "postID": 8, 
        "quote": "Originally posted by rayevinsonsr: Jerry Falwell wouldn't have done it...", 
        "reply": " Most will agree that Jerry Falwell, Senior, was a smart politician, whether or not you agreed with his views on religious or morality. Jerry Falwell, Junior, who now runs Liberty University, is not.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 11:41:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Heck, I'm a Socialist, I have no use for Democrats! No sweat! Ban em! Dave Heck, I'm a Heathen, I have no use for politics/politicians, period. Ban em all.", 
        "intTime": 20090522, 
        "postID": 9, 
        "quote": "Originally posted by Grachus: Heck, I'm a Socialist, I have no use for Democrats! No sweat! Ban em! Dave", 
        "reply": " Heck, I'm a Heathen, I have no use for politics/politicians, period. Ban em all.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 11:43:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by rayld2: Should they NO, IMO this is PURE Politics and spite. Can they ONLY if it is a private college getting NO Government money. If they get Government money then IMO they should be given a choice and we would see how strongly they hold their beliefs. I wonder what would happen if losing Government money caused them to have to raise their price say by 10-20%? Would the people who made this decision take a pay cut? There is the Bob Jones University case. During the Ronald Reagan administration, they lost their tax-exempt status by continuing racial discrimination on campus. So there is precedent - from a Republican Administration.", 
        "intTime": 20090522, 
        "postID": 10, 
        "quote": "Originally posted by rayld2: Should they NO, IMO this is PURE Politics and spite. Can they ONLY if it is a private college getting NO Government money. If they get Government money then IMO they should be given a choice and we would see how strongly they hold their beliefs. I wonder what would happen if losing Government money caused them to have to raise their price say by 10-20%? Would the people who made this decision take a pay cut?", 
        "reply": " There is the Bob Jones University case. During the Ronald Reagan administration, they lost their tax-exempt status by continuing racial discrimination on campus. So there is precedent - from a Republican Administration.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 11:45:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by stec74: I think this is the wrong thing to do. However, as a Private University it is completly within their rights to do so. I agree whole heartedly and completely with your statement... What do you learn, if there is no debate?... I am a republican and at first I thought, yeah, they got a little of what they dish out, how does it feel?... You are however right... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Fri 22 May 2009 12:53 PM", 
        "intTime": 20090522, 
        "postID": 11, 
        "quote": "Originally posted by stec74: I think this is the wrong thing to do. However, as a Private University it is completly within their rights to do so.", 
        "reply": " I agree whole heartedly and completely with your statement... What do you learn, if there is no debate?... I am a republican and at first I thought, yeah, they got a little of what they dish out, how does it feel?... You are however right... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Fri 22 May 2009 12:53 PM", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 11:46:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "This as a college shouldn't have done it. You can't have a healthy debate when there no one to debate anymore.This will also push it in to a underground group and you know how they grow.", 
        "intTime": 20090522, 
        "postID": 12, 
        "quote": "", 
        "reply": "This as a college shouldn't have done it. You can't have a healthy debate when there no one to debate anymore.This will also push it in to a underground group and you know how they grow.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 12:14:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "world_king377"
    }, 
    {
        "content": "It's a private school that wants to turn out carbon copy clones... Pathetic. On the other hand, no one is forcing anyone to attend, they get no government money. Interesting to read about - Interesting to talk about None of my business. Dave", 
        "intTime": 20090522, 
        "postID": 13, 
        "quote": "", 
        "reply": "It's a private school that wants to turn out carbon copy clones... Pathetic. On the other hand, no one is forcing anyone to attend, they get no government money. Interesting to read about - Interesting to talk about None of my business. Dave", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 12:17:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: I say BAN SOCIALIST AND LEAVE THE DEMOCRATS ALONE. Not worthy of a private or public school and especially a Christian school. Jerry Falwell wouldn't have done it because the fellowship of Christians are made up of every class, political party and ten percent tithers in Virginia. Once the donations drop the heirarchy might have a change of mind. The Humble shall inherit the earth, not the political. Already past the future", 
        "intTime": 20090522, 
        "postID": 14, 
        "quote": "Originally posted by rayevinsonsr: I say BAN SOCIALIST AND LEAVE THE DEMOCRATS ALONE. Not worthy of a private or public school and especially a Christian school. Jerry Falwell wouldn't have done it because the fellowship of Christians are made up of every class, political party and ten percent tithers in Virginia. Once the donations drop the heirarchy might have a change of mind. The Humble shall inherit the earth, not the political.", 
        "reply": " Already past the future", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 12:26:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by Grachus: It's a private school that wants to turn out carbon copy clones... Pathetic. On the other hand, no one is forcing anyone to attend, they get no government money. Interesting to read about - Interesting to talk about None of my business. Dave In at least two ways they get a LOT of government money. 1) Student grants, etc. 2) They have tax exempt status therefore they don't pay TAXES, including local city, county and state taxes but do get services. IF this causes them to lose their tax exempt status, and it might based on prior cases, then it will be interested if they still believe it is an important principle once it costs them a lot of money or if they will change their rules. Just to let everyone know people fron the area have stated that the school has played fast and loose with the laws regarding political actions by tax except orgs in the past so even if this action by it's self might not have been enough a PATTERN of actions might convince a court.", 
        "intTime": 20090522, 
        "postID": 15, 
        "quote": "Originally posted by Grachus: It's a private school that wants to turn out carbon copy clones... Pathetic. On the other hand, no one is forcing anyone to attend, they get no government money. Interesting to read about - Interesting to talk about None of my business. Dave", 
        "reply": " In at least two ways they get a LOT of government money. 1) Student grants, etc. 2) They have tax exempt status therefore they don't pay TAXES, including local city, county and state taxes but do get services. IF this causes them to lose their tax exempt status, and it might based on prior cases, then it will be interested if they still believe it is an important principle once it costs them a lot of money or if they will change their rules. Just to let everyone know people fron the area have stated that the school has played fast and loose with the laws regarding political actions by tax except orgs in the past so even if this action by it's self might not have been enough a PATTERN of actions might convince a court.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 12:27:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: “His bottom line was, ‘You can’t be a Democrat and be a Christian and be a university representative,’” Childress said. Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats?[/QUOTE] If it is a Private, Religious University, it has the right to set its own rules. If it receives any federal funds for any reason, that creates a question - - Wandering and Wondering", 
        "intTime": 20090522, 
        "postID": 16, 
        "quote": "Originally posted by Fightdirector: “His bottom line was, ‘You can’t be a Democrat and be a Christian and be a university representative,’” Childress said.", 
        "reply": " Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats?[/QUOTE] If it is a Private, Religious University, it has the right to set its own rules. If it receives any federal funds for any reason, that creates a question - - Wandering and Wondering", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 12:51:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by rayld2: In at least two ways they get a LOT of government money. 1) Student grants, etc. DISAGREE. IT'S THE STUDENT THAT RECEIVES THE GRANTS BASED SOLEY ON FINANCIAL ELIGIBILITY! 2) They have tax exempt status therefore they don't pay TAXES, including local city, county and state taxes but do get services. IF this causes them to lose their tax exempt status, and it might based on prior cases, then it will be interested if they still believe it is an important principle once it costs them a lot of money or if they will change their rules. Just to let everyone know people fron the area have stated that the school has played fast and loose with the laws regarding political actions by tax except orgs in the past so even if this action by it's self might not have been enough a PATTERN of actions might convince a court. DOES THE TAX EXEMPT STATUS (IF THIS IS ACCURATE) COME FROM EXISTING ON PRIVATE LAND AND A PRIVATE INSTITUTION? OR IS IT BECAUSE SCHOOLS AUTOMATICALLY GET TAX EXEMPT STATUS?", 
        "intTime": 20090522, 
        "postID": 17, 
        "quote": "Originally posted by rayld2: In at least two ways they get a LOT of government money. 1) Student grants, etc. DISAGREE. IT'S THE STUDENT THAT RECEIVES THE GRANTS BASED SOLEY ON FINANCIAL ELIGIBILITY! 2) They have tax exempt status therefore they don't pay TAXES, including local city, county and state taxes but do get services. IF this causes them to lose their tax exempt status, and it might based on prior cases, then it will be interested if they still believe it is an important principle once it costs them a lot of money or if they will change their rules. Just to let everyone know people fron the area have stated that the school has played fast and loose with the laws regarding political actions by tax except orgs in the past so even if this action by it's self might not have been enough a PATTERN of actions might convince a court.", 
        "reply": " DOES THE TAX EXEMPT STATUS (IF THIS IS ACCURATE) COME FROM EXISTING ON PRIVATE LAND AND A PRIVATE INSTITUTION? OR IS IT BECAUSE SCHOOLS AUTOMATICALLY GET TAX EXEMPT STATUS?", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 13:03:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: DOES THE TAX EXEMPT STATUS (IF THIS IS ACCURATE) COME FROM EXISTING ON PRIVATE LAND AND A PRIVATE INSTITUTION? OR IS IT BECAUSE SCHOOLS AUTOMATICALLY GET TAX EXEMPT STATUS? Physical property owned by colleges, universities and educational institutions (buildings, athletic fields, dorms, student centers, etc.), generally speaking, are tax-exempt from local property taxes. One problem in the nearby city of Cambridge, Massachusetts, for example, is that the city cannot collect property taxes on over 65% of the land within the city limits, the land belonging to either Harvard University or the Massachusetts Institute Of Technology.", 
        "intTime": 20090522, 
        "postID": 18, 
        "quote": "Originally posted by busnrete8: DOES THE TAX EXEMPT STATUS (IF THIS IS ACCURATE) COME FROM EXISTING ON PRIVATE LAND AND A PRIVATE INSTITUTION? OR IS IT BECAUSE SCHOOLS AUTOMATICALLY GET TAX EXEMPT STATUS?", 
        "reply": " Physical property owned by colleges, universities and educational institutions (buildings, athletic fields, dorms, student centers, etc.), generally speaking, are tax-exempt from local property taxes. One problem in the nearby city of Cambridge, Massachusetts, for example, is that the city cannot collect property taxes on over 65% of the land within the city limits, the land belonging to either Harvard University or the Massachusetts Institute Of Technology.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 13:14:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: quote: Originally posted by rayld2: In at least two ways they get a LOT of government money. 1) Student grants, etc. DISAGREE. IT'S THE STUDENT THAT RECEIVES THE GRANTS BASED SOLEY ON FINANCIAL ELIGIBILITY! 2) They have tax exempt status therefore they don't pay TAXES, including local city, county and state taxes but do get services. IF this causes them to lose their tax exempt status, and it might based on prior cases, then it will be interested if they still believe it is an important principle once it costs them a lot of money or if they will change their rules. Just to let everyone know people fron the area have stated that the school has played fast and loose with the laws regarding political actions by tax except orgs in the past so even if this action by it's self might not have been enough a PATTERN of actions might convince a court. DOES THE TAX EXEMPT STATUS (IF THIS IS ACCURATE) COME FROM EXISTING ON PRIVATE LAND AND A PRIVATE INSTITUTION? OR IS IT BECAUSE SCHOOLS AUTOMATICALLY GET TAX EXEMPT STATUS? I notice you left out the fact I was responding to Grachus's claim they get NO Government money. They get their tax exempt status under laws that REQUIRE they act in certain ways to retain that status. IF they do NOT follow those rules, which includes rules against many POLITICAL activities, then they can and should lose their tax exempt status.", 
        "intTime": 20090522, 
        "postID": 19, 
        "quote": "Originally posted by busnrete8: quote: Originally posted by rayld2: In at least two ways they get a LOT of government money. 1) Student grants, etc. DISAGREE. IT'S THE STUDENT THAT RECEIVES THE GRANTS BASED SOLEY ON FINANCIAL ELIGIBILITY! 2) They have tax exempt status therefore they don't pay TAXES, including local city, county and state taxes but do get services. IF this causes them to lose their tax exempt status, and it might based on prior cases, then it will be interested if they still believe it is an important principle once it costs them a lot of money or if they will change their rules. Just to let everyone know people fron the area have stated that the school has played fast and loose with the laws regarding political actions by tax except orgs in the past so even if this action by it's self might not have been enough a PATTERN of actions might convince a court. DOES THE TAX EXEMPT STATUS (IF THIS IS ACCURATE) COME FROM EXISTING ON PRIVATE LAND AND A PRIVATE INSTITUTION? OR IS IT BECAUSE SCHOOLS AUTOMATICALLY GET TAX EXEMPT STATUS?", 
        "reply": " I notice you left out the fact I was responding to Grachus's claim they get NO Government money. They get their tax exempt status under laws that REQUIRE they act in certain ways to retain that status. IF they do NOT follow those rules, which includes rules against many POLITICAL activities, then they can and should lose their tax exempt status.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 13:18:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by stec74: I think this is the wrong thing to do. However, as a Private University it is completly within their rights to do so. I concur.", 
        "intTime": 20090522, 
        "postID": 20, 
        "quote": "Originally posted by stec74: I think this is the wrong thing to do. However, as a Private University it is completly within their rights to do so.", 
        "reply": " I concur.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 13:45:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "shuman14"
    }, 
    {
        "content": "\"http://www.newsadvance.com/lna/news/local/article/lu_pulls_plug_on_democratic_club/16172/\" quote: Liberty University has revoked its recognition of the campus Democratic Party club, saying “we are unable to lend support to a club whose parent organization stands against the moral principles held by” the university. “It kind of happened out of nowhere,” said Brian Diaz, president of LU’s student Democratic Party organization, which LU formally recognized in October. Diaz said he was notified of the school’s decision May 15 in an e-mail from Mark Hine, vice president of student affairs. According to the e-mail, the club must stop using the university’s name, holding meetings on campus, or advertising events. Hine said late Thursday that the university could not sanction an official club that supported Democratic candidates. “We are in no way attempting to stifle free speech.” Hine said the university had recently completed a policy that would govern clubs and organizations on campus. “We looked at each club and organization to determine where it stood and unfortunately this one kind of got in the sights of policy, if you will,” he said. Hine’s e-mail mentioned that he had expressed a concern to Diaz about the national Democratic Party’s platform during a meeting earlier in the semester. Last fall, Diaz said, Hine had complimented the club for being a faith-based organization working within the Democratic Party. Jan Dervish, secretary of the club, and Maria Childress, its staff adviser, said they met with Hine after the revocation and asked for a further explanation. “He said it wasn’t us. It was the national Democratic Party,” which the campus club’s constitution supports, Dervish said. The campus club also opposes abortion and supports the traditional view of marriage, Dervish said. “His bottom line was, ‘You can’t be a Democrat and be a Christian and be a university representative,’” Childress said. Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats?", 
        "intTime": 20090522, 
        "postID": 21, 
        "quote": "Liberty University has revoked its recognition of the campus Democratic Party club, saying “we are unable to lend support to a club whose parent organization stands against the moral principles held by” the university. “It kind of happened out of nowhere,” said Brian Diaz, president of LU’s student Democratic Party organization, which LU formally recognized in October. Diaz said he was notified of the school’s decision May 15 in an e-mail from Mark Hine, vice president of student affairs. According to the e-mail, the club must stop using the university’s name, holding meetings on campus, or advertising events. Hine said late Thursday that the university could not sanction an official club that supported Democratic candidates. “We are in no way attempting to stifle free speech.” Hine said the university had recently completed a policy that would govern clubs and organizations on campus. “We looked at each club and organization to determine where it stood and unfortunately this one kind of got in the sights of policy, if you will,” he said. Hine’s e-mail mentioned that he had expressed a concern to Diaz about the national Democratic Party’s platform during a meeting earlier in the semester. Last fall, Diaz said, Hine had complimented the club for being a faith-based organization working within the Democratic Party. Jan Dervish, secretary of the club, and Maria Childress, its staff adviser, said they met with Hine after the revocation and asked for a further explanation. “He said it wasn’t us. It was the national Democratic Party,” which the campus club’s constitution supports, Dervish said. The campus club also opposes abortion and supports the traditional view of marriage, Dervish said. “His bottom line was, ‘You can’t be a Democrat and be a Christian and be a university representative,’” Childress said.", 
        "reply": "\"http://www.newsadvance.com/lna/news/local/article/lu_pulls_plug_on_democratic_club/16172/\"  Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats?", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 09:15:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: \"http://www.newsadvance.com/lna/news/local/article/lu_pulls_plug_on_democratic_club/16172/\" quote: Liberty University has revoked its recognition of the campus Democratic Party club, saying “we are unable to lend support to a club whose parent organization stands against the moral principles held by” the university. “It kind of happened out of nowhere,” said Brian Diaz, president of LU’s student Democratic Party organization, which LU formally recognized in October. Diaz said he was notified of the school’s decision May 15 in an e-mail from Mark Hine, vice president of student affairs. According to the e-mail, the club must stop using the university’s name, holding meetings on campus, or advertising events. Hine said late Thursday that the university could not sanction an official club that supported Democratic candidates. “We are in no way attempting to stifle free speech.” Hine said the university had recently completed a policy that would govern clubs and organizations on campus. “We looked at each club and organization to determine where it stood and unfortunately this one kind of got in the sights of policy, if you will,” he said. Hine’s e-mail mentioned that he had expressed a concern to Diaz about the national Democratic Party’s platform during a meeting earlier in the semester. Last fall, Diaz said, Hine had complimented the club for being a faith-based organization working within the Democratic Party. Jan Dervish, secretary of the club, and Maria Childress, its staff adviser, said they met with Hine after the revocation and asked for a further explanation. “He said it wasn’t us. It was the national Democratic Party,” which the campus club’s constitution supports, Dervish said. The campus club also opposes abortion and supports the traditional view of marriage, Dervish said. “His bottom line was, ‘You can’t be a Democrat and be a Christian and be a university representative,’” Childress said. Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats? Of course. There's a price to pay for Freedom, and banning opposition groups is the only way to preserve free debate!!! Heck, I'm a Socialist, I have no use for Democrats! No sweat! Ban em! Dave", 
        "intTime": 20090522, 
        "postID": 22, 
        "quote": "Originally posted by Fightdirector: \"http://www.newsadvance.com/lna/news/local/article/lu_pulls_plug_on_democratic_club/16172/\" quote: Liberty University has revoked its recognition of the campus Democratic Party club, saying “we are unable to lend support to a club whose parent organization stands against the moral principles held by” the university. “It kind of happened out of nowhere,” said Brian Diaz, president of LU’s student Democratic Party organization, which LU formally recognized in October. Diaz said he was notified of the school’s decision May 15 in an e-mail from Mark Hine, vice president of student affairs. According to the e-mail, the club must stop using the university’s name, holding meetings on campus, or advertising events. Hine said late Thursday that the university could not sanction an official club that supported Democratic candidates. “We are in no way attempting to stifle free speech.” Hine said the university had recently completed a policy that would govern clubs and organizations on campus. “We looked at each club and organization to determine where it stood and unfortunately this one kind of got in the sights of policy, if you will,” he said. Hine’s e-mail mentioned that he had expressed a concern to Diaz about the national Democratic Party’s platform during a meeting earlier in the semester. Last fall, Diaz said, Hine had complimented the club for being a faith-based organization working within the Democratic Party. Jan Dervish, secretary of the club, and Maria Childress, its staff adviser, said they met with Hine after the revocation and asked for a further explanation. “He said it wasn’t us. It was the national Democratic Party,” which the campus club’s constitution supports, Dervish said. The campus club also opposes abortion and supports the traditional view of marriage, Dervish said. “His bottom line was, ‘You can’t be a Democrat and be a Christian and be a university representative,’” Childress said. Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats?", 
        "reply": " Of course. There's a price to pay for Freedom, and banning opposition groups is the only way to preserve free debate!!! Heck, I'm a Socialist, I have no use for Democrats! No sweat! Ban em! Dave", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 09:24:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "Grachus"
    }, 
    {
        "content": "As a self-proclaimed \"Evil Republican\" , this is wrong on so many levels. College should be a place to look at life, ect. from different view points, challenge folks' way of thinking. Liberty University? Lack thereof.", 
        "intTime": 20090522, 
        "postID": 23, 
        "quote": "", 
        "reply": "As a self-proclaimed \"Evil Republican\" , this is wrong on so many levels. College should be a place to look at life, ect. from different view points, challenge folks' way of thinking. Liberty University? Lack thereof.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 09:27:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "67NOV"
    }, 
    {
        "content": "Liberty University in Linchburg, VA is a private university. It was founded by Jerry Falwell in 1971. It's the largest private university in Virginia, offering more than 60 accredited programs of study. It is their option as to what is allowed on campus.", 
        "intTime": 20090522, 
        "postID": 24, 
        "quote": "", 
        "reply": "Liberty University in Linchburg, VA is a private university. It was founded by Jerry Falwell in 1971. It's the largest private university in Virginia, offering more than 60 accredited programs of study. It is their option as to what is allowed on campus.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 09:29:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "dmahler"
    }, 
    {
        "content": "I think this is the wrong thing to do. However, as a Private University it is completly within their rights to do so.", 
        "intTime": 20090522, 
        "postID": 25, 
        "quote": "", 
        "reply": "I think this is the wrong thing to do. However, as a Private University it is completly within their rights to do so.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 09:36:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: -snip-Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats? Should they NO, IMO this is PURE Politics and spite. Can they ONLY if it is a private college getting NO Government money. If they get Government money then IMO they should be given a choice and we would see how strongly they hold their beliefs. I wonder what would happen if losing Government money caused them to have to raise their price say by 10-20%? Would the people who made this decision take a pay cut? Raising prices MORE than other similar schools starts a downward spiral of losing students forcing increaes in price which causes the loss of more students.", 
        "intTime": 20090522, 
        "postID": 26, 
        "quote": "Originally posted by Fightdirector: -snip-Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats?", 
        "reply": " Should they NO, IMO this is PURE Politics and spite. Can they ONLY if it is a private college getting NO Government money. If they get Government money then IMO they should be given a choice and we would see how strongly they hold their beliefs. I wonder what would happen if losing Government money caused them to have to raise their price say by 10-20%? Would the people who made this decision take a pay cut? Raising prices MORE than other similar schools starts a downward spiral of losing students forcing increaes in price which causes the loss of more students.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 11:17:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "rayld2"
    }, 
    {
        "content": "I say BAN SOCIALIST AND LEAVE THE DEMOCRATS ALONE. Not worthy of a private or public school and especially a Christian school. Jerry Falwell wouldn't have done it because the fellowship of Christians are made up of every class, political party and ten percent tithers in Virginia. Once the donations drop the heirarchy might have a change of mind. The Humble shall inherit the earth, not the political.", 
        "intTime": 20090522, 
        "postID": 27, 
        "quote": "", 
        "reply": "I say BAN SOCIALIST AND LEAVE THE DEMOCRATS ALONE. Not worthy of a private or public school and especially a Christian school. Jerry Falwell wouldn't have done it because the fellowship of Christians are made up of every class, political party and ten percent tithers in Virginia. Once the donations drop the heirarchy might have a change of mind. The Humble shall inherit the earth, not the political.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 11:33:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: Jerry Falwell wouldn't have done it... Most will agree that Jerry Falwell, Senior, was a smart politician, whether or not you agreed with his views on religious or morality. Jerry Falwell, Junior, who now runs Liberty University, is not.", 
        "intTime": 20090522, 
        "postID": 28, 
        "quote": "Originally posted by rayevinsonsr: Jerry Falwell wouldn't have done it...", 
        "reply": " Most will agree that Jerry Falwell, Senior, was a smart politician, whether or not you agreed with his views on religious or morality. Jerry Falwell, Junior, who now runs Liberty University, is not.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 11:41:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Heck, I'm a Socialist, I have no use for Democrats! No sweat! Ban em! Dave Heck, I'm a Heathen, I have no use for politics/politicians, period. Ban em all.", 
        "intTime": 20090522, 
        "postID": 29, 
        "quote": "Originally posted by Grachus: Heck, I'm a Socialist, I have no use for Democrats! No sweat! Ban em! Dave", 
        "reply": " Heck, I'm a Heathen, I have no use for politics/politicians, period. Ban em all.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 11:43:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by rayld2: Should they NO, IMO this is PURE Politics and spite. Can they ONLY if it is a private college getting NO Government money. If they get Government money then IMO they should be given a choice and we would see how strongly they hold their beliefs. I wonder what would happen if losing Government money caused them to have to raise their price say by 10-20%? Would the people who made this decision take a pay cut? There is the Bob Jones University case. During the Ronald Reagan administration, they lost their tax-exempt status by continuing racial discrimination on campus. So there is precedent - from a Republican Administration.", 
        "intTime": 20090522, 
        "postID": 30, 
        "quote": "Originally posted by rayld2: Should they NO, IMO this is PURE Politics and spite. Can they ONLY if it is a private college getting NO Government money. If they get Government money then IMO they should be given a choice and we would see how strongly they hold their beliefs. I wonder what would happen if losing Government money caused them to have to raise their price say by 10-20%? Would the people who made this decision take a pay cut?", 
        "reply": " There is the Bob Jones University case. During the Ronald Reagan administration, they lost their tax-exempt status by continuing racial discrimination on campus. So there is precedent - from a Republican Administration.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 11:45:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by stec74: I think this is the wrong thing to do. However, as a Private University it is completly within their rights to do so. I agree whole heartedly and completely with your statement... What do you learn, if there is no debate?... I am a republican and at first I thought, yeah, they got a little of what they dish out, how does it feel?... You are however right... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Fri 22 May 2009 12:53 PM", 
        "intTime": 20090522, 
        "postID": 31, 
        "quote": "Originally posted by stec74: I think this is the wrong thing to do. However, as a Private University it is completly within their rights to do so.", 
        "reply": " I agree whole heartedly and completely with your statement... What do you learn, if there is no debate?... I am a republican and at first I thought, yeah, they got a little of what they dish out, how does it feel?... You are however right... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Fri 22 May 2009 12:53 PM", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 11:46:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "This as a college shouldn't have done it. You can't have a healthy debate when there no one to debate anymore.This will also push it in to a underground group and you know how they grow.", 
        "intTime": 20090522, 
        "postID": 32, 
        "quote": "", 
        "reply": "This as a college shouldn't have done it. You can't have a healthy debate when there no one to debate anymore.This will also push it in to a underground group and you know how they grow.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 12:14:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "world_king377"
    }, 
    {
        "content": "It's a private school that wants to turn out carbon copy clones... Pathetic. On the other hand, no one is forcing anyone to attend, they get no government money. Interesting to read about - Interesting to talk about None of my business. Dave", 
        "intTime": 20090522, 
        "postID": 33, 
        "quote": "", 
        "reply": "It's a private school that wants to turn out carbon copy clones... Pathetic. On the other hand, no one is forcing anyone to attend, they get no government money. Interesting to read about - Interesting to talk about None of my business. Dave", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 12:17:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: I say BAN SOCIALIST AND LEAVE THE DEMOCRATS ALONE. Not worthy of a private or public school and especially a Christian school. Jerry Falwell wouldn't have done it because the fellowship of Christians are made up of every class, political party and ten percent tithers in Virginia. Once the donations drop the heirarchy might have a change of mind. The Humble shall inherit the earth, not the political. Already past the future", 
        "intTime": 20090522, 
        "postID": 34, 
        "quote": "Originally posted by rayevinsonsr: I say BAN SOCIALIST AND LEAVE THE DEMOCRATS ALONE. Not worthy of a private or public school and especially a Christian school. Jerry Falwell wouldn't have done it because the fellowship of Christians are made up of every class, political party and ten percent tithers in Virginia. Once the donations drop the heirarchy might have a change of mind. The Humble shall inherit the earth, not the political.", 
        "reply": " Already past the future", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 12:26:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by Grachus: It's a private school that wants to turn out carbon copy clones... Pathetic. On the other hand, no one is forcing anyone to attend, they get no government money. Interesting to read about - Interesting to talk about None of my business. Dave In at least two ways they get a LOT of government money. 1) Student grants, etc. 2) They have tax exempt status therefore they don't pay TAXES, including local city, county and state taxes but do get services. IF this causes them to lose their tax exempt status, and it might based on prior cases, then it will be interested if they still believe it is an important principle once it costs them a lot of money or if they will change their rules. Just to let everyone know people fron the area have stated that the school has played fast and loose with the laws regarding political actions by tax except orgs in the past so even if this action by it's self might not have been enough a PATTERN of actions might convince a court.", 
        "intTime": 20090522, 
        "postID": 35, 
        "quote": "Originally posted by Grachus: It's a private school that wants to turn out carbon copy clones... Pathetic. On the other hand, no one is forcing anyone to attend, they get no government money. Interesting to read about - Interesting to talk about None of my business. Dave", 
        "reply": " In at least two ways they get a LOT of government money. 1) Student grants, etc. 2) They have tax exempt status therefore they don't pay TAXES, including local city, county and state taxes but do get services. IF this causes them to lose their tax exempt status, and it might based on prior cases, then it will be interested if they still believe it is an important principle once it costs them a lot of money or if they will change their rules. Just to let everyone know people fron the area have stated that the school has played fast and loose with the laws regarding political actions by tax except orgs in the past so even if this action by it's self might not have been enough a PATTERN of actions might convince a court.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 12:27:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: “His bottom line was, ‘You can’t be a Democrat and be a Christian and be a university representative,’” Childress said. Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats?[/QUOTE] If it is a Private, Religious University, it has the right to set its own rules. If it receives any federal funds for any reason, that creates a question - - Wandering and Wondering", 
        "intTime": 20090522, 
        "postID": 36, 
        "quote": "Originally posted by Fightdirector: “His bottom line was, ‘You can’t be a Democrat and be a Christian and be a university representative,’” Childress said.", 
        "reply": " Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats?[/QUOTE] If it is a Private, Religious University, it has the right to set its own rules. If it receives any federal funds for any reason, that creates a question - - Wandering and Wondering", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 12:51:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by rayld2: In at least two ways they get a LOT of government money. 1) Student grants, etc. DISAGREE. IT'S THE STUDENT THAT RECEIVES THE GRANTS BASED SOLEY ON FINANCIAL ELIGIBILITY! 2) They have tax exempt status therefore they don't pay TAXES, including local city, county and state taxes but do get services. IF this causes them to lose their tax exempt status, and it might based on prior cases, then it will be interested if they still believe it is an important principle once it costs them a lot of money or if they will change their rules. Just to let everyone know people fron the area have stated that the school has played fast and loose with the laws regarding political actions by tax except orgs in the past so even if this action by it's self might not have been enough a PATTERN of actions might convince a court. DOES THE TAX EXEMPT STATUS (IF THIS IS ACCURATE) COME FROM EXISTING ON PRIVATE LAND AND A PRIVATE INSTITUTION? OR IS IT BECAUSE SCHOOLS AUTOMATICALLY GET TAX EXEMPT STATUS?", 
        "intTime": 20090522, 
        "postID": 37, 
        "quote": "Originally posted by rayld2: In at least two ways they get a LOT of government money. 1) Student grants, etc. DISAGREE. IT'S THE STUDENT THAT RECEIVES THE GRANTS BASED SOLEY ON FINANCIAL ELIGIBILITY! 2) They have tax exempt status therefore they don't pay TAXES, including local city, county and state taxes but do get services. IF this causes them to lose their tax exempt status, and it might based on prior cases, then it will be interested if they still believe it is an important principle once it costs them a lot of money or if they will change their rules. Just to let everyone know people fron the area have stated that the school has played fast and loose with the laws regarding political actions by tax except orgs in the past so even if this action by it's self might not have been enough a PATTERN of actions might convince a court.", 
        "reply": " DOES THE TAX EXEMPT STATUS (IF THIS IS ACCURATE) COME FROM EXISTING ON PRIVATE LAND AND A PRIVATE INSTITUTION? OR IS IT BECAUSE SCHOOLS AUTOMATICALLY GET TAX EXEMPT STATUS?", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 13:03:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: DOES THE TAX EXEMPT STATUS (IF THIS IS ACCURATE) COME FROM EXISTING ON PRIVATE LAND AND A PRIVATE INSTITUTION? OR IS IT BECAUSE SCHOOLS AUTOMATICALLY GET TAX EXEMPT STATUS? Physical property owned by colleges, universities and educational institutions (buildings, athletic fields, dorms, student centers, etc.), generally speaking, are tax-exempt from local property taxes. One problem in the nearby city of Cambridge, Massachusetts, for example, is that the city cannot collect property taxes on over 65% of the land within the city limits, the land belonging to either Harvard University or the Massachusetts Institute Of Technology.", 
        "intTime": 20090522, 
        "postID": 38, 
        "quote": "Originally posted by busnrete8: DOES THE TAX EXEMPT STATUS (IF THIS IS ACCURATE) COME FROM EXISTING ON PRIVATE LAND AND A PRIVATE INSTITUTION? OR IS IT BECAUSE SCHOOLS AUTOMATICALLY GET TAX EXEMPT STATUS?", 
        "reply": " Physical property owned by colleges, universities and educational institutions (buildings, athletic fields, dorms, student centers, etc.), generally speaking, are tax-exempt from local property taxes. One problem in the nearby city of Cambridge, Massachusetts, for example, is that the city cannot collect property taxes on over 65% of the land within the city limits, the land belonging to either Harvard University or the Massachusetts Institute Of Technology.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 13:14:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: quote: Originally posted by rayld2: In at least two ways they get a LOT of government money. 1) Student grants, etc. DISAGREE. IT'S THE STUDENT THAT RECEIVES THE GRANTS BASED SOLEY ON FINANCIAL ELIGIBILITY! 2) They have tax exempt status therefore they don't pay TAXES, including local city, county and state taxes but do get services. IF this causes them to lose their tax exempt status, and it might based on prior cases, then it will be interested if they still believe it is an important principle once it costs them a lot of money or if they will change their rules. Just to let everyone know people fron the area have stated that the school has played fast and loose with the laws regarding political actions by tax except orgs in the past so even if this action by it's self might not have been enough a PATTERN of actions might convince a court. DOES THE TAX EXEMPT STATUS (IF THIS IS ACCURATE) COME FROM EXISTING ON PRIVATE LAND AND A PRIVATE INSTITUTION? OR IS IT BECAUSE SCHOOLS AUTOMATICALLY GET TAX EXEMPT STATUS? I notice you left out the fact I was responding to Grachus's claim they get NO Government money. They get their tax exempt status under laws that REQUIRE they act in certain ways to retain that status. IF they do NOT follow those rules, which includes rules against many POLITICAL activities, then they can and should lose their tax exempt status.", 
        "intTime": 20090522, 
        "postID": 39, 
        "quote": "Originally posted by busnrete8: quote: Originally posted by rayld2: In at least two ways they get a LOT of government money. 1) Student grants, etc. DISAGREE. IT'S THE STUDENT THAT RECEIVES THE GRANTS BASED SOLEY ON FINANCIAL ELIGIBILITY! 2) They have tax exempt status therefore they don't pay TAXES, including local city, county and state taxes but do get services. IF this causes them to lose their tax exempt status, and it might based on prior cases, then it will be interested if they still believe it is an important principle once it costs them a lot of money or if they will change their rules. Just to let everyone know people fron the area have stated that the school has played fast and loose with the laws regarding political actions by tax except orgs in the past so even if this action by it's self might not have been enough a PATTERN of actions might convince a court. DOES THE TAX EXEMPT STATUS (IF THIS IS ACCURATE) COME FROM EXISTING ON PRIVATE LAND AND A PRIVATE INSTITUTION? OR IS IT BECAUSE SCHOOLS AUTOMATICALLY GET TAX EXEMPT STATUS?", 
        "reply": " I notice you left out the fact I was responding to Grachus's claim they get NO Government money. They get their tax exempt status under laws that REQUIRE they act in certain ways to retain that status. IF they do NOT follow those rules, which includes rules against many POLITICAL activities, then they can and should lose their tax exempt status.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 13:18:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by stec74: I think this is the wrong thing to do. However, as a Private University it is completly within their rights to do so. I concur.", 
        "intTime": 20090522, 
        "postID": 40, 
        "quote": "Originally posted by stec74: I think this is the wrong thing to do. However, as a Private University it is completly within their rights to do so.", 
        "reply": " I concur.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 13:45:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "shuman14"
    }, 
    {
        "content": "\"http://www.newsadvance.com/lna/news/local/article/lu_pulls_plug_on_democratic_club/16172/\" quote: Liberty University has revoked its recognition of the campus Democratic Party club, saying “we are unable to lend support to a club whose parent organization stands against the moral principles held by” the university. “It kind of happened out of nowhere,” said Brian Diaz, president of LU’s student Democratic Party organization, which LU formally recognized in October. Diaz said he was notified of the school’s decision May 15 in an e-mail from Mark Hine, vice president of student affairs. According to the e-mail, the club must stop using the university’s name, holding meetings on campus, or advertising events. Hine said late Thursday that the university could not sanction an official club that supported Democratic candidates. “We are in no way attempting to stifle free speech.” Hine said the university had recently completed a policy that would govern clubs and organizations on campus. “We looked at each club and organization to determine where it stood and unfortunately this one kind of got in the sights of policy, if you will,” he said. Hine’s e-mail mentioned that he had expressed a concern to Diaz about the national Democratic Party’s platform during a meeting earlier in the semester. Last fall, Diaz said, Hine had complimented the club for being a faith-based organization working within the Democratic Party. Jan Dervish, secretary of the club, and Maria Childress, its staff adviser, said they met with Hine after the revocation and asked for a further explanation. “He said it wasn’t us. It was the national Democratic Party,” which the campus club’s constitution supports, Dervish said. The campus club also opposes abortion and supports the traditional view of marriage, Dervish said. “His bottom line was, ‘You can’t be a Democrat and be a Christian and be a university representative,’” Childress said. Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats?", 
        "intTime": 20090522, 
        "postID": 41, 
        "quote": "Liberty University has revoked its recognition of the campus Democratic Party club, saying “we are unable to lend support to a club whose parent organization stands against the moral principles held by” the university. “It kind of happened out of nowhere,” said Brian Diaz, president of LU’s student Democratic Party organization, which LU formally recognized in October. Diaz said he was notified of the school’s decision May 15 in an e-mail from Mark Hine, vice president of student affairs. According to the e-mail, the club must stop using the university’s name, holding meetings on campus, or advertising events. Hine said late Thursday that the university could not sanction an official club that supported Democratic candidates. “We are in no way attempting to stifle free speech.” Hine said the university had recently completed a policy that would govern clubs and organizations on campus. “We looked at each club and organization to determine where it stood and unfortunately this one kind of got in the sights of policy, if you will,” he said. Hine’s e-mail mentioned that he had expressed a concern to Diaz about the national Democratic Party’s platform during a meeting earlier in the semester. Last fall, Diaz said, Hine had complimented the club for being a faith-based organization working within the Democratic Party. Jan Dervish, secretary of the club, and Maria Childress, its staff adviser, said they met with Hine after the revocation and asked for a further explanation. “He said it wasn’t us. It was the national Democratic Party,” which the campus club’s constitution supports, Dervish said. The campus club also opposes abortion and supports the traditional view of marriage, Dervish said. “His bottom line was, ‘You can’t be a Democrat and be a Christian and be a university representative,’” Childress said.", 
        "reply": "\"http://www.newsadvance.com/lna/news/local/article/lu_pulls_plug_on_democratic_club/16172/\"  Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats?", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 09:15:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: \"http://www.newsadvance.com/lna/news/local/article/lu_pulls_plug_on_democratic_club/16172/\" quote: Liberty University has revoked its recognition of the campus Democratic Party club, saying “we are unable to lend support to a club whose parent organization stands against the moral principles held by” the university. “It kind of happened out of nowhere,” said Brian Diaz, president of LU’s student Democratic Party organization, which LU formally recognized in October. Diaz said he was notified of the school’s decision May 15 in an e-mail from Mark Hine, vice president of student affairs. According to the e-mail, the club must stop using the university’s name, holding meetings on campus, or advertising events. Hine said late Thursday that the university could not sanction an official club that supported Democratic candidates. “We are in no way attempting to stifle free speech.” Hine said the university had recently completed a policy that would govern clubs and organizations on campus. “We looked at each club and organization to determine where it stood and unfortunately this one kind of got in the sights of policy, if you will,” he said. Hine’s e-mail mentioned that he had expressed a concern to Diaz about the national Democratic Party’s platform during a meeting earlier in the semester. Last fall, Diaz said, Hine had complimented the club for being a faith-based organization working within the Democratic Party. Jan Dervish, secretary of the club, and Maria Childress, its staff adviser, said they met with Hine after the revocation and asked for a further explanation. “He said it wasn’t us. It was the national Democratic Party,” which the campus club’s constitution supports, Dervish said. The campus club also opposes abortion and supports the traditional view of marriage, Dervish said. “His bottom line was, ‘You can’t be a Democrat and be a Christian and be a university representative,’” Childress said. Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats? Of course. There's a price to pay for Freedom, and banning opposition groups is the only way to preserve free debate!!! Heck, I'm a Socialist, I have no use for Democrats! No sweat! Ban em! Dave", 
        "intTime": 20090522, 
        "postID": 42, 
        "quote": "Originally posted by Fightdirector: \"http://www.newsadvance.com/lna/news/local/article/lu_pulls_plug_on_democratic_club/16172/\" quote: Liberty University has revoked its recognition of the campus Democratic Party club, saying “we are unable to lend support to a club whose parent organization stands against the moral principles held by” the university. “It kind of happened out of nowhere,” said Brian Diaz, president of LU’s student Democratic Party organization, which LU formally recognized in October. Diaz said he was notified of the school’s decision May 15 in an e-mail from Mark Hine, vice president of student affairs. According to the e-mail, the club must stop using the university’s name, holding meetings on campus, or advertising events. Hine said late Thursday that the university could not sanction an official club that supported Democratic candidates. “We are in no way attempting to stifle free speech.” Hine said the university had recently completed a policy that would govern clubs and organizations on campus. “We looked at each club and organization to determine where it stood and unfortunately this one kind of got in the sights of policy, if you will,” he said. Hine’s e-mail mentioned that he had expressed a concern to Diaz about the national Democratic Party’s platform during a meeting earlier in the semester. Last fall, Diaz said, Hine had complimented the club for being a faith-based organization working within the Democratic Party. Jan Dervish, secretary of the club, and Maria Childress, its staff adviser, said they met with Hine after the revocation and asked for a further explanation. “He said it wasn’t us. It was the national Democratic Party,” which the campus club’s constitution supports, Dervish said. The campus club also opposes abortion and supports the traditional view of marriage, Dervish said. “His bottom line was, ‘You can’t be a Democrat and be a Christian and be a university representative,’” Childress said. Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats?", 
        "reply": " Of course. There's a price to pay for Freedom, and banning opposition groups is the only way to preserve free debate!!! Heck, I'm a Socialist, I have no use for Democrats! No sweat! Ban em! Dave", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 09:24:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "Grachus"
    }, 
    {
        "content": "As a self-proclaimed \"Evil Republican\" , this is wrong on so many levels. College should be a place to look at life, ect. from different view points, challenge folks' way of thinking. Liberty University? Lack thereof.", 
        "intTime": 20090522, 
        "postID": 43, 
        "quote": "", 
        "reply": "As a self-proclaimed \"Evil Republican\" , this is wrong on so many levels. College should be a place to look at life, ect. from different view points, challenge folks' way of thinking. Liberty University? Lack thereof.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 09:27:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "67NOV"
    }, 
    {
        "content": "Liberty University in Linchburg, VA is a private university. It was founded by Jerry Falwell in 1971. It's the largest private university in Virginia, offering more than 60 accredited programs of study. It is their option as to what is allowed on campus.", 
        "intTime": 20090522, 
        "postID": 44, 
        "quote": "", 
        "reply": "Liberty University in Linchburg, VA is a private university. It was founded by Jerry Falwell in 1971. It's the largest private university in Virginia, offering more than 60 accredited programs of study. It is their option as to what is allowed on campus.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 09:29:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "dmahler"
    }, 
    {
        "content": "I think this is the wrong thing to do. However, as a Private University it is completly within their rights to do so.", 
        "intTime": 20090522, 
        "postID": 45, 
        "quote": "", 
        "reply": "I think this is the wrong thing to do. However, as a Private University it is completly within their rights to do so.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 09:36:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "stec74"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: -snip-Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats? Should they NO, IMO this is PURE Politics and spite. Can they ONLY if it is a private college getting NO Government money. If they get Government money then IMO they should be given a choice and we would see how strongly they hold their beliefs. I wonder what would happen if losing Government money caused them to have to raise their price say by 10-20%? Would the people who made this decision take a pay cut? Raising prices MORE than other similar schools starts a downward spiral of losing students forcing increaes in price which causes the loss of more students.", 
        "intTime": 20090522, 
        "postID": 46, 
        "quote": "Originally posted by Fightdirector: -snip-Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats?", 
        "reply": " Should they NO, IMO this is PURE Politics and spite. Can they ONLY if it is a private college getting NO Government money. If they get Government money then IMO they should be given a choice and we would see how strongly they hold their beliefs. I wonder what would happen if losing Government money caused them to have to raise their price say by 10-20%? Would the people who made this decision take a pay cut? Raising prices MORE than other similar schools starts a downward spiral of losing students forcing increaes in price which causes the loss of more students.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 11:17:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "rayld2"
    }, 
    {
        "content": "I say BAN SOCIALIST AND LEAVE THE DEMOCRATS ALONE. Not worthy of a private or public school and especially a Christian school. Jerry Falwell wouldn't have done it because the fellowship of Christians are made up of every class, political party and ten percent tithers in Virginia. Once the donations drop the heirarchy might have a change of mind. The Humble shall inherit the earth, not the political.", 
        "intTime": 20090522, 
        "postID": 47, 
        "quote": "", 
        "reply": "I say BAN SOCIALIST AND LEAVE THE DEMOCRATS ALONE. Not worthy of a private or public school and especially a Christian school. Jerry Falwell wouldn't have done it because the fellowship of Christians are made up of every class, political party and ten percent tithers in Virginia. Once the donations drop the heirarchy might have a change of mind. The Humble shall inherit the earth, not the political.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 11:33:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "rayevinsonsr"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: Jerry Falwell wouldn't have done it... Most will agree that Jerry Falwell, Senior, was a smart politician, whether or not you agreed with his views on religious or morality. Jerry Falwell, Junior, who now runs Liberty University, is not.", 
        "intTime": 20090522, 
        "postID": 48, 
        "quote": "Originally posted by rayevinsonsr: Jerry Falwell wouldn't have done it...", 
        "reply": " Most will agree that Jerry Falwell, Senior, was a smart politician, whether or not you agreed with his views on religious or morality. Jerry Falwell, Junior, who now runs Liberty University, is not.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 11:41:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by Grachus: Heck, I'm a Socialist, I have no use for Democrats! No sweat! Ban em! Dave Heck, I'm a Heathen, I have no use for politics/politicians, period. Ban em all.", 
        "intTime": 20090522, 
        "postID": 49, 
        "quote": "Originally posted by Grachus: Heck, I'm a Socialist, I have no use for Democrats! No sweat! Ban em! Dave", 
        "reply": " Heck, I'm a Heathen, I have no use for politics/politicians, period. Ban em all.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 11:43:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "SignalSgtWilliams"
    }, 
    {
        "content": "quote: Originally posted by rayld2: Should they NO, IMO this is PURE Politics and spite. Can they ONLY if it is a private college getting NO Government money. If they get Government money then IMO they should be given a choice and we would see how strongly they hold their beliefs. I wonder what would happen if losing Government money caused them to have to raise their price say by 10-20%? Would the people who made this decision take a pay cut? There is the Bob Jones University case. During the Ronald Reagan administration, they lost their tax-exempt status by continuing racial discrimination on campus. So there is precedent - from a Republican Administration.", 
        "intTime": 20090522, 
        "postID": 50, 
        "quote": "Originally posted by rayld2: Should they NO, IMO this is PURE Politics and spite. Can they ONLY if it is a private college getting NO Government money. If they get Government money then IMO they should be given a choice and we would see how strongly they hold their beliefs. I wonder what would happen if losing Government money caused them to have to raise their price say by 10-20%? Would the people who made this decision take a pay cut?", 
        "reply": " There is the Bob Jones University case. During the Ronald Reagan administration, they lost their tax-exempt status by continuing racial discrimination on campus. So there is precedent - from a Republican Administration.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 11:45:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by stec74: I think this is the wrong thing to do. However, as a Private University it is completly within their rights to do so. I agree whole heartedly and completely with your statement... What do you learn, if there is no debate?... I am a republican and at first I thought, yeah, they got a little of what they dish out, how does it feel?... You are however right... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Fri 22 May 2009 12:53 PM", 
        "intTime": 20090522, 
        "postID": 51, 
        "quote": "Originally posted by stec74: I think this is the wrong thing to do. However, as a Private University it is completly within their rights to do so.", 
        "reply": " I agree whole heartedly and completely with your statement... What do you learn, if there is no debate?... I am a republican and at first I thought, yeah, they got a little of what they dish out, how does it feel?... You are however right... Respectfully, SUNLINER81 This message has been edited. Last edited by: SUNLINER81, Fri 22 May 2009 12:53 PM", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 11:46:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "SUNLINER81"
    }, 
    {
        "content": "This as a college shouldn't have done it. You can't have a healthy debate when there no one to debate anymore.This will also push it in to a underground group and you know how they grow.", 
        "intTime": 20090522, 
        "postID": 52, 
        "quote": "", 
        "reply": "This as a college shouldn't have done it. You can't have a healthy debate when there no one to debate anymore.This will also push it in to a underground group and you know how they grow.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 12:14:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "world_king377"
    }, 
    {
        "content": "It's a private school that wants to turn out carbon copy clones... Pathetic. On the other hand, no one is forcing anyone to attend, they get no government money. Interesting to read about - Interesting to talk about None of my business. Dave", 
        "intTime": 20090522, 
        "postID": 53, 
        "quote": "", 
        "reply": "It's a private school that wants to turn out carbon copy clones... Pathetic. On the other hand, no one is forcing anyone to attend, they get no government money. Interesting to read about - Interesting to talk about None of my business. Dave", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 12:17:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "Grachus"
    }, 
    {
        "content": "quote: Originally posted by rayevinsonsr: I say BAN SOCIALIST AND LEAVE THE DEMOCRATS ALONE. Not worthy of a private or public school and especially a Christian school. Jerry Falwell wouldn't have done it because the fellowship of Christians are made up of every class, political party and ten percent tithers in Virginia. Once the donations drop the heirarchy might have a change of mind. The Humble shall inherit the earth, not the political. Already past the future", 
        "intTime": 20090522, 
        "postID": 54, 
        "quote": "Originally posted by rayevinsonsr: I say BAN SOCIALIST AND LEAVE THE DEMOCRATS ALONE. Not worthy of a private or public school and especially a Christian school. Jerry Falwell wouldn't have done it because the fellowship of Christians are made up of every class, political party and ten percent tithers in Virginia. Once the donations drop the heirarchy might have a change of mind. The Humble shall inherit the earth, not the political.", 
        "reply": " Already past the future", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 12:26:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "6486143"
    }, 
    {
        "content": "quote: Originally posted by Grachus: It's a private school that wants to turn out carbon copy clones... Pathetic. On the other hand, no one is forcing anyone to attend, they get no government money. Interesting to read about - Interesting to talk about None of my business. Dave In at least two ways they get a LOT of government money. 1) Student grants, etc. 2) They have tax exempt status therefore they don't pay TAXES, including local city, county and state taxes but do get services. IF this causes them to lose their tax exempt status, and it might based on prior cases, then it will be interested if they still believe it is an important principle once it costs them a lot of money or if they will change their rules. Just to let everyone know people fron the area have stated that the school has played fast and loose with the laws regarding political actions by tax except orgs in the past so even if this action by it's self might not have been enough a PATTERN of actions might convince a court.", 
        "intTime": 20090522, 
        "postID": 55, 
        "quote": "Originally posted by Grachus: It's a private school that wants to turn out carbon copy clones... Pathetic. On the other hand, no one is forcing anyone to attend, they get no government money. Interesting to read about - Interesting to talk about None of my business. Dave", 
        "reply": " In at least two ways they get a LOT of government money. 1) Student grants, etc. 2) They have tax exempt status therefore they don't pay TAXES, including local city, county and state taxes but do get services. IF this causes them to lose their tax exempt status, and it might based on prior cases, then it will be interested if they still believe it is an important principle once it costs them a lot of money or if they will change their rules. Just to let everyone know people fron the area have stated that the school has played fast and loose with the laws regarding political actions by tax except orgs in the past so even if this action by it's self might not have been enough a PATTERN of actions might convince a court.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 12:27:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by Fightdirector: “His bottom line was, ‘You can’t be a Democrat and be a Christian and be a university representative,’” Childress said. Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats?[/QUOTE] If it is a Private, Religious University, it has the right to set its own rules. If it receives any federal funds for any reason, that creates a question - - Wandering and Wondering", 
        "intTime": 20090522, 
        "postID": 56, 
        "quote": "Originally posted by Fightdirector: “His bottom line was, ‘You can’t be a Democrat and be a Christian and be a university representative,’” Childress said.", 
        "reply": " Should more colleges and universities nationwide follow Liberty University's example and ban Democrats? Should websites such as Military.com follow Liberty University's example and ban Democrats?[/QUOTE] If it is a Private, Religious University, it has the right to set its own rules. If it receives any federal funds for any reason, that creates a question - - Wandering and Wondering", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 12:51:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "greywolfghost"
    }, 
    {
        "content": "quote: Originally posted by rayld2: In at least two ways they get a LOT of government money. 1) Student grants, etc. DISAGREE. IT'S THE STUDENT THAT RECEIVES THE GRANTS BASED SOLEY ON FINANCIAL ELIGIBILITY! 2) They have tax exempt status therefore they don't pay TAXES, including local city, county and state taxes but do get services. IF this causes them to lose their tax exempt status, and it might based on prior cases, then it will be interested if they still believe it is an important principle once it costs them a lot of money or if they will change their rules. Just to let everyone know people fron the area have stated that the school has played fast and loose with the laws regarding political actions by tax except orgs in the past so even if this action by it's self might not have been enough a PATTERN of actions might convince a court. DOES THE TAX EXEMPT STATUS (IF THIS IS ACCURATE) COME FROM EXISTING ON PRIVATE LAND AND A PRIVATE INSTITUTION? OR IS IT BECAUSE SCHOOLS AUTOMATICALLY GET TAX EXEMPT STATUS?", 
        "intTime": 20090522, 
        "postID": 57, 
        "quote": "Originally posted by rayld2: In at least two ways they get a LOT of government money. 1) Student grants, etc. DISAGREE. IT'S THE STUDENT THAT RECEIVES THE GRANTS BASED SOLEY ON FINANCIAL ELIGIBILITY! 2) They have tax exempt status therefore they don't pay TAXES, including local city, county and state taxes but do get services. IF this causes them to lose their tax exempt status, and it might based on prior cases, then it will be interested if they still believe it is an important principle once it costs them a lot of money or if they will change their rules. Just to let everyone know people fron the area have stated that the school has played fast and loose with the laws regarding political actions by tax except orgs in the past so even if this action by it's self might not have been enough a PATTERN of actions might convince a court.", 
        "reply": " DOES THE TAX EXEMPT STATUS (IF THIS IS ACCURATE) COME FROM EXISTING ON PRIVATE LAND AND A PRIVATE INSTITUTION? OR IS IT BECAUSE SCHOOLS AUTOMATICALLY GET TAX EXEMPT STATUS?", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 13:03:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "busnrete8"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: DOES THE TAX EXEMPT STATUS (IF THIS IS ACCURATE) COME FROM EXISTING ON PRIVATE LAND AND A PRIVATE INSTITUTION? OR IS IT BECAUSE SCHOOLS AUTOMATICALLY GET TAX EXEMPT STATUS? Physical property owned by colleges, universities and educational institutions (buildings, athletic fields, dorms, student centers, etc.), generally speaking, are tax-exempt from local property taxes. One problem in the nearby city of Cambridge, Massachusetts, for example, is that the city cannot collect property taxes on over 65% of the land within the city limits, the land belonging to either Harvard University or the Massachusetts Institute Of Technology.", 
        "intTime": 20090522, 
        "postID": 58, 
        "quote": "Originally posted by busnrete8: DOES THE TAX EXEMPT STATUS (IF THIS IS ACCURATE) COME FROM EXISTING ON PRIVATE LAND AND A PRIVATE INSTITUTION? OR IS IT BECAUSE SCHOOLS AUTOMATICALLY GET TAX EXEMPT STATUS?", 
        "reply": " Physical property owned by colleges, universities and educational institutions (buildings, athletic fields, dorms, student centers, etc.), generally speaking, are tax-exempt from local property taxes. One problem in the nearby city of Cambridge, Massachusetts, for example, is that the city cannot collect property taxes on over 65% of the land within the city limits, the land belonging to either Harvard University or the Massachusetts Institute Of Technology.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 13:14:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "Fightdirector"
    }, 
    {
        "content": "quote: Originally posted by busnrete8: quote: Originally posted by rayld2: In at least two ways they get a LOT of government money. 1) Student grants, etc. DISAGREE. IT'S THE STUDENT THAT RECEIVES THE GRANTS BASED SOLEY ON FINANCIAL ELIGIBILITY! 2) They have tax exempt status therefore they don't pay TAXES, including local city, county and state taxes but do get services. IF this causes them to lose their tax exempt status, and it might based on prior cases, then it will be interested if they still believe it is an important principle once it costs them a lot of money or if they will change their rules. Just to let everyone know people fron the area have stated that the school has played fast and loose with the laws regarding political actions by tax except orgs in the past so even if this action by it's self might not have been enough a PATTERN of actions might convince a court. DOES THE TAX EXEMPT STATUS (IF THIS IS ACCURATE) COME FROM EXISTING ON PRIVATE LAND AND A PRIVATE INSTITUTION? OR IS IT BECAUSE SCHOOLS AUTOMATICALLY GET TAX EXEMPT STATUS? I notice you left out the fact I was responding to Grachus's claim they get NO Government money. They get their tax exempt status under laws that REQUIRE they act in certain ways to retain that status. IF they do NOT follow those rules, which includes rules against many POLITICAL activities, then they can and should lose their tax exempt status.", 
        "intTime": 20090522, 
        "postID": 59, 
        "quote": "Originally posted by busnrete8: quote: Originally posted by rayld2: In at least two ways they get a LOT of government money. 1) Student grants, etc. DISAGREE. IT'S THE STUDENT THAT RECEIVES THE GRANTS BASED SOLEY ON FINANCIAL ELIGIBILITY! 2) They have tax exempt status therefore they don't pay TAXES, including local city, county and state taxes but do get services. IF this causes them to lose their tax exempt status, and it might based on prior cases, then it will be interested if they still believe it is an important principle once it costs them a lot of money or if they will change their rules. Just to let everyone know people fron the area have stated that the school has played fast and loose with the laws regarding political actions by tax except orgs in the past so even if this action by it's self might not have been enough a PATTERN of actions might convince a court. DOES THE TAX EXEMPT STATUS (IF THIS IS ACCURATE) COME FROM EXISTING ON PRIVATE LAND AND A PRIVATE INSTITUTION? OR IS IT BECAUSE SCHOOLS AUTOMATICALLY GET TAX EXEMPT STATUS?", 
        "reply": " I notice you left out the fact I was responding to Grachus's claim they get NO Government money. They get their tax exempt status under laws that REQUIRE they act in certain ways to retain that status. IF they do NOT follow those rules, which includes rules against many POLITICAL activities, then they can and should lose their tax exempt status.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 13:18:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "rayld2"
    }, 
    {
        "content": "quote: Originally posted by stec74: I think this is the wrong thing to do. However, as a Private University it is completly within their rights to do so. I concur.", 
        "intTime": 20090522, 
        "postID": 60, 
        "quote": "Originally posted by stec74: I think this is the wrong thing to do. However, as a Private University it is completly within their rights to do so.", 
        "reply": " I concur.", 
        "threadID": "672198221_4700099322001", 
        "time": "2009-05-22 13:45:00", 
        "title": "Virginia college bans Democrat student club", 
        "userID": "shuman14"
    }
]