[
    {
        "content": "quote: President Nicolas Sarkozy has formally opened a French military base in the United Arab Emirates, France's first permanent base in the Gulf. The flags of France and the UAE were raised at a ceremony at the so-called \"Peace Camp\" in the Abu Dhabi emirate. France is a leading military supplier to the Gulf state, and signed a nuclear co-operation agreement last year. Its new base will host up to 500 French troops and include a navy base, air base, and training camp. The BBC's Stephanie Hancock in Abu Dhabi says the new military base, France's first outside its own territory for many years, comes on the back of strengthening diplomatic and military ties between France and the United Arab Emirates. (....) +http://news.bbc.co.uk/2/hi/middle_east/8067600.stm \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "intTime": 20090526,
        "postID": 1,
        "quote": "President Nicolas Sarkozy has formally opened a French military base in the United Arab Emirates, France's first permanent base in the Gulf. The flags of France and the UAE were raised at a ceremony at the so-called \"Peace Camp\" in the Abu Dhabi emirate. France is a leading military supplier to the Gulf state, and signed a nuclear co-operation agreement last year. Its new base will host up to 500 French troops and include a navy base, air base, and training camp. The BBC's Stephanie Hancock in Abu Dhabi says the new military base, France's first outside its own territory for many years, comes on the back of strengthening diplomatic and military ties between France and the United Arab Emirates. (....)",
        "reply": " +http://news.bbc.co.uk/2/hi/middle_east/8067600.stm \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe",
        "threadID": "672198221_9940082422001",
        "time": "2009-05-26 06:02:00",
        "title": "France opens military base in UAE",
        "userID": "NSNN"
    },
    {
        "content": "- Rather the French than the Ruskies or Chinese though, right?! -",
        "intTime": 20090526,
        "postID": 2,
        "quote": "",
        "reply": "- Rather the French than the Ruskies or Chinese though, right?! -",
        "threadID": "672198221_9940082422001",
        "time": "2009-05-26 21:04:00",
        "title": "France opens military base in UAE",
        "userID": "ANZACbiscuit"
    },
    {
        "content": "quote: Originally posted by ANZACbiscuit: - Rather the French than the Ruskies or Chinese though, right?! - Ya got that right..........",
        "intTime": 20090526,
        "postID": 3,
        "quote": "Originally posted by ANZACbiscuit: - Rather the French than the Ruskies or Chinese though, right?! -",
        "reply": " Ya got that right..........",
        "threadID": "672198221_9940082422001",
        "time": "2009-05-26 21:32:00",
        "title": "France opens military base in UAE",
        "userID": "SignalSgtWilliams"
    }
]