[
    {
        "content": "Envisat’s Advanced Synthetic Aperture Radar (ASAR) captured the early stage of the disruption of the ice bridge that connects the Wilkins Ice Shelf to Charcot and Latady Islands on 2 April 2009 at 05:18 UTC. The new rifts that developed along the length axis of the ice bridge are visible. The first detachment along these new rifts occurred about seven hours later. quote: OSLO (Reuters) — An ice bridge holding a vast Antarctic ice shelf in place has shattered and may herald a wider collapse caused by global warming, a scientist said Saturday. “It’s amazing how the ice has ruptured,” said David Vaughan, a glaciologist with the British Antarctic Survey. “Two days ago it was intact,” he said, referring to a satellite image of the Wilkins ice shelf. The satellite picture, by the European Space Agency, showed that a strip of ice about 25 miles long that is believed to pin the ice shelf in place had snapped. The loss of the ice bridge could mean a wider breakup of the ice shelf, which is about the size of Connecticut. +http://www.nytimes.com/2009/04/05/science/earth/05antarctica.html \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090405, 
        "postID": 1, 
        "quote": "OSLO (Reuters) — An ice bridge holding a vast Antarctic ice shelf in place has shattered and may herald a wider collapse caused by global warming, a scientist said Saturday. “It’s amazing how the ice has ruptured,” said David Vaughan, a glaciologist with the British Antarctic Survey. “Two days ago it was intact,” he said, referring to a satellite image of the Wilkins ice shelf. The satellite picture, by the European Space Agency, showed that a strip of ice about 25 miles long that is believed to pin the ice shelf in place had snapped. The loss of the ice bridge could mean a wider breakup of the ice shelf, which is about the size of Connecticut.", 
        "reply": "Envisat’s Advanced Synthetic Aperture Radar (ASAR) captured the early stage of the disruption of the ice bridge that connects the Wilkins Ice Shelf to Charcot and Latady Islands on 2 April 2009 at 05:18 UTC. The new rifts that developed along the length axis of the ice bridge are visible. The first detachment along these new rifts occurred about seven hours later.  +http://www.nytimes.com/2009/04/05/science/earth/05antarctica.html \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 13:17:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "NSNN"
    }, 
    {
        "content": "oh no the end is near...", 
        "intTime": 20090405, 
        "postID": 2, 
        "quote": "", 
        "reply": "oh no the end is near...", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 13:33:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "outlaws93"
    }, 
    {
        "content": "if that puppy keeps melting they're going to actually SEE Atlantis... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090405, 
        "postID": 3, 
        "quote": "", 
        "reply": "if that puppy keeps melting they're going to actually SEE Atlantis... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 14:15:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Thanks to the non-GW believers. THANKS REPS! for flooding our nation.", 
        "intTime": 20090405, 
        "postID": 4, 
        "quote": "", 
        "reply": "Thanks to the non-GW believers. THANKS REPS! for flooding our nation.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 14:43:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made.", 
        "intTime": 20090405, 
        "postID": 5, 
        "quote": "Originally posted by outlaws93: oh no the end is near...", 
        "reply": " I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 14:46:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: if that puppy keeps melting they're going to actually SEE Atlantis... The 9th wonder of the world will be revealed under the ice.", 
        "intTime": 20090405, 
        "postID": 6, 
        "quote": "Originally posted by m551sheridan: if that puppy keeps melting they're going to actually SEE Atlantis...", 
        "reply": " The 9th wonder of the world will be revealed under the ice.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 14:47:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "A Scientist Cool. Maybe if more then one says something it might be less of a joke.", 
        "intTime": 20090405, 
        "postID": 7, 
        "quote": "", 
        "reply": "A Scientist Cool. Maybe if more then one says something it might be less of a joke.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 16:20:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Grimbo"
    }, 
    {
        "content": "Well, there ARE underwater volcanos in the Antartic, you know. \"\"http://www.usatoday.com/news/science/2004-05-20-new-volcano_x.htm \"\"http://www.environmentalgraffiti.com/featured/incredible-underwater-volcanoes/7827 \"\"http://www.livescience.com/environment/060524_underwater_volcano.html I wonder if the effects of these are in the climate models, if we've even found them all, and if rock a couple thousand degrees farenheit will warm water any?", 
        "intTime": 20090405, 
        "postID": 8, 
        "quote": "", 
        "reply": "Well, there ARE underwater volcanos in the Antartic, you know. \"\"http://www.usatoday.com/news/science/2004-05-20-new-volcano_x.htm \"\"http://www.environmentalgraffiti.com/featured/incredible-underwater-volcanoes/7827 \"\"http://www.livescience.com/environment/060524_underwater_volcano.html I wonder if the effects of these are in the climate models, if we've even found them all, and if rock a couple thousand degrees farenheit will warm water any?", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 16:44:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made. You're being sarcastic, right? as the hero leaves the global warming conference to dash in to the rescue ... in a PRIUS!.. anyway, the ice shelf didn't shatter, it relocated to North Dakota.", 
        "intTime": 20090405, 
        "postID": 9, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made.", 
        "reply": " You're being sarcastic, right? as the hero leaves the global warming conference to dash in to the rescue ... in a PRIUS!.. anyway, the ice shelf didn't shatter, it relocated to North Dakota.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 16:59:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "godawgz"
    }, 
    {
        "content": "", 
        "intTime": 20090405, 
        "postID": 10, 
        "quote": "", 
        "reply": "", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:07:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Well, there ARE underwater volcanos in the Antartic, you know. \"\"http://www.usatoday.com/news/science/2004-05-20-new-volcano_x.htm \"\"http://www.environmentalgraffiti.com/featured/incredible-underwater-volcanoes/7827 \"\"http://www.livescience.com/environment/060524_underwater_volcano.html I wonder if the effects of these are in the climate models, if we've even found them all, and if rock a couple thousand degrees farenheit will warm water any? That was my first thought when I saw the story. No one has said anything about seismic readings or volcanic activity that could have easily caused this as it has many times in the past. Of course if they ever admit thats what caused this to happen it would destroy their whole \"global warming is killing us\" charade even though its actually cooled globally the last three years. But hey, dont let a simple thing like facts get in the way of a good global warming hoax", 
        "intTime": 20090405, 
        "postID": 11, 
        "quote": "Originally posted by peter3_1: Well, there ARE underwater volcanos in the Antartic, you know. \"\"http://www.usatoday.com/news/science/2004-05-20-new-volcano_x.htm \"\"http://www.environmentalgraffiti.com/featured/incredible-underwater-volcanoes/7827 \"\"http://www.livescience.com/environment/060524_underwater_volcano.html I wonder if the effects of these are in the climate models, if we've even found them all, and if rock a couple thousand degrees farenheit will warm water any?", 
        "reply": " That was my first thought when I saw the story. No one has said anything about seismic readings or volcanic activity that could have easily caused this as it has many times in the past. Of course if they ever admit thats what caused this to happen it would destroy their whole \"global warming is killing us\" charade even though its actually cooled globally the last three years. But hey, dont let a simple thing like facts get in the way of a good global warming hoax", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:13:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Well I am willing to bet that ICE was not holding the thing in place.... Just how damn dumb do they take the world populace? Ice holding a shifting plate? BS! That would have to be some mighty strong and sticky ice...... But I regress, they think Gore preaches the gospel.", 
        "intTime": 20090405, 
        "postID": 12, 
        "quote": "", 
        "reply": "Well I am willing to bet that ICE was not holding the thing in place.... Just how damn dumb do they take the world populace? Ice holding a shifting plate? BS! That would have to be some mighty strong and sticky ice...... But I regress, they think Gore preaches the gospel.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:22:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Thanks to the non-GW believers. THANKS REPS! for flooding our nation. Cause I know your sitting in the dark and walk or bike everywhere. And only eat sun dried foods grown in your own garden. Right?", 
        "intTime": 20090405, 
        "postID": 13, 
        "quote": "Originally posted by crackerjacks61: Thanks to the non-GW believers. THANKS REPS! for flooding our nation.", 
        "reply": " Cause I know your sitting in the dark and walk or bike everywhere. And only eat sun dried foods grown in your own garden. Right?", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:26:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "carsleyt"
    }, 
    {
        "content": "quote: No one has said anything about seismic readings or volcanic activity that could have easily caused this as it has many times in the past. Well you can bet that \"IF\" the ice was holding it, and it shattered, there would be plenty of readings. Then they would have to prove which happened first. Ice shattering or seismic activity of plates moving.", 
        "intTime": 20090405, 
        "postID": 14, 
        "quote": "No one has said anything about seismic readings or volcanic activity that could have easily caused this as it has many times in the past.", 
        "reply": " Well you can bet that \"IF\" the ice was holding it, and it shattered, there would be plenty of readings. Then they would have to prove which happened first. Ice shattering or seismic activity of plates moving.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:29:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone?", 
        "intTime": 20090405, 
        "postID": 15, 
        "quote": "", 
        "reply": "Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone?", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 19:27:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: Well I am willing to bet that ICE was not holding the thing in place.... Just how damn dumb do they take the world populace? Ice holding a shifting plate? BS! That would have to be some mighty strong and sticky ice...... But I regress, they think Gore preaches the gospel. LOL...a shifting plate? Maybe you should look up the difference between a tectonic plate and an ice shelf.", 
        "intTime": 20090405, 
        "postID": 16, 
        "quote": "Originally posted by Woody_in_La: Well I am willing to bet that ICE was not holding the thing in place.... Just how damn dumb do they take the world populace? Ice holding a shifting plate? BS! That would have to be some mighty strong and sticky ice...... But I regress, they think Gore preaches the gospel.", 
        "reply": " LOL...a shifting plate? Maybe you should look up the difference between a tectonic plate and an ice shelf.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 19:41:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone? The loss of ice shelves does not affect sea levels -- floating ice contracts as it melts and so does not raise ocean levels. But their loss can allow glaciers on land to slide more rapidly toward the sea, adding water to the oceans. \"http://www.sciam.com/article.cfm?id=ice-bridge-holding-antarc\"", 
        "intTime": 20090405, 
        "postID": 17, 
        "quote": "Originally posted by peter3_1: Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone?", 
        "reply": " The loss of ice shelves does not affect sea levels -- floating ice contracts as it melts and so does not raise ocean levels. But their loss can allow glaciers on land to slide more rapidly toward the sea, adding water to the oceans. \"http://www.sciam.com/article.cfm?id=ice-bridge-holding-antarc\"", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 19:56:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Esample1"
    }, 
    {
        "content": "I think the fact that ice that is already displacing water does make water rise is about 3rd grade level science. We did it with ice cubes in a glass. When it melts, the water does not rise. As for glaciers, how many of them are near enough to an ocean to actually find their way into the ocean. Most will fill the nearest void near to them. And, if it is indeed getting warmer, then water would evaporate at an accelerated level. So, I would imagine that you cannot use static evaporation data and say what level the ocean would rise to. The simple fact is that we have already been in the warming period for some time (which was expected, it just came a little early), but we are going to be going back into a cooling cycle (which is also expected). The reality is that there is a ton of money to be made off of GW, so people will continue to talk about it, even if there were irrefutable evidence to the contrary. While there is no irrefutable evidence that GW doesn't exist, there is also no irrefutable evidence that it does exist. The only scientists that have been saying that it does are primarily those that work for the governments of the US and a few European countries. The one thing that is a fact is that the cycles of the sun have more of an impact on the warming and cooling of the earth than any activity actually originating on the earth. So, you better find a way to reduce solar flares, because it will get hot again... But, then again, it will also get cold again. Climate change, it's been around long before people decided to make it a buzz word in order to profit from it. It is almost as ingenious as the guy that duped everybody into buying bottled water. Almost...", 
        "intTime": 20090405, 
        "postID": 18, 
        "quote": "", 
        "reply": "I think the fact that ice that is already displacing water does make water rise is about 3rd grade level science. We did it with ice cubes in a glass. When it melts, the water does not rise. As for glaciers, how many of them are near enough to an ocean to actually find their way into the ocean. Most will fill the nearest void near to them. And, if it is indeed getting warmer, then water would evaporate at an accelerated level. So, I would imagine that you cannot use static evaporation data and say what level the ocean would rise to. The simple fact is that we have already been in the warming period for some time (which was expected, it just came a little early), but we are going to be going back into a cooling cycle (which is also expected). The reality is that there is a ton of money to be made off of GW, so people will continue to talk about it, even if there were irrefutable evidence to the contrary. While there is no irrefutable evidence that GW doesn't exist, there is also no irrefutable evidence that it does exist. The only scientists that have been saying that it does are primarily those that work for the governments of the US and a few European countries. The one thing that is a fact is that the cycles of the sun have more of an impact on the warming and cooling of the earth than any activity actually originating on the earth. So, you better find a way to reduce solar flares, because it will get hot again... But, then again, it will also get cold again. Climate change, it's been around long before people decided to make it a buzz word in order to profit from it. It is almost as ingenious as the guy that duped everybody into buying bottled water. Almost...", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 20:37:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. True... but is that the ONLY problem down there??? Just a few Ice Shelves disappearing? If that is so then no one needs to worry at all correct? No mean sea level rises are occuring, nor will they ever rise due to global warming... correct? Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone? Please post your source(s) Peter. Here is my source... care to impeach it? quote: Global sea level and the Earth's climate are closely linked. The Earth's climate has warmed about 1°C (1.8°F) during the last 100 years. As the climate has warmed following the end of a recent cold period known as the \"Little Ice Age\" in the 19th century, sea level has been rising about 1 to 2 millimeters per year due to the reduction in volume of ice caps, ice fields, and mountain glaciers in addition to the thermal expansion of ocean water. If present trends continue, including an increase in global temperatures caused by increased greenhouse-gas emissions, many of the world's mountain glaciers will disappear. For example, at the current rate of melting, all glaciers will be gone from Glacier National Park, Montana, by the middle of the next century (fig. 1). In Iceland, about 11 percent of the island is covered by glaciers (mostly ice caps). If warming continues, Iceland's glaciers will decrease by 40 percent by 2100 and virtually disappear by 2200. Most of the current global land ice mass is located in the Antarctic and Greenland ice sheets (table 1). Complete melting of these ice sheets could lead to a sea-level rise of about 80 meters (that is about 222 feet of rise) , whereas melting of all other glaciers could lead to a sea-level rise of only one-half meter Reduction of the West Antarctic and Greenland ice sheets similar to past reductions would cause sea level to rise 10 or more meters. A sea-level rise of 10 meters would flood about 25 percent of the U.S. population, with the major impact being mostly on the people and infrastructures in the Gulf and East Coast States (fig. 3)", 
        "intTime": 20090405, 
        "postID": 19, 
        "quote": "Originally posted by peter3_1: Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. True... but is that the ONLY problem down there??? Just a few Ice Shelves disappearing? If that is so then no one needs to worry at all correct? No mean sea level rises are occuring, nor will they ever rise due to global warming... correct? Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone?", 
        "reply": " Please post your source(s) Peter. Here is my source... care to impeach it? quote: Global sea level and the Earth's climate are closely linked. The Earth's climate has warmed about 1°C (1.8°F) during the last 100 years. As the climate has warmed following the end of a recent cold period known as the \"Little Ice Age\" in the 19th century, sea level has been rising about 1 to 2 millimeters per year due to the reduction in volume of ice caps, ice fields, and mountain glaciers in addition to the thermal expansion of ocean water. If present trends continue, including an increase in global temperatures caused by increased greenhouse-gas emissions, many of the world's mountain glaciers will disappear. For example, at the current rate of melting, all glaciers will be gone from Glacier National Park, Montana, by the middle of the next century (fig. 1). In Iceland, about 11 percent of the island is covered by glaciers (mostly ice caps). If warming continues, Iceland's glaciers will decrease by 40 percent by 2100 and virtually disappear by 2200. Most of the current global land ice mass is located in the Antarctic and Greenland ice sheets (table 1). Complete melting of these ice sheets could lead to a sea-level rise of about 80 meters (that is about 222 feet of rise) , whereas melting of all other glaciers could lead to a sea-level rise of only one-half meter Reduction of the West Antarctic and Greenland ice sheets similar to past reductions would cause sea level to rise 10 or more meters. A sea-level rise of 10 meters would flood about 25 percent of the U.S. population, with the major impact being mostly on the people and infrastructures in the Gulf and East Coast States (fig. 3)", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 21:53:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made. you know that was a movie and not reality right??? a m o v i e", 
        "intTime": 20090405, 
        "postID": 20, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made.", 
        "reply": " you know that was a movie and not reality right??? a m o v i e", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 21:56:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Envisat’s Advanced Synthetic Aperture Radar (ASAR) captured the early stage of the disruption of the ice bridge that connects the Wilkins Ice Shelf to Charcot and Latady Islands on 2 April 2009 at 05:18 UTC. The new rifts that developed along the length axis of the ice bridge are visible. The first detachment along these new rifts occurred about seven hours later. quote: OSLO (Reuters) — An ice bridge holding a vast Antarctic ice shelf in place has shattered and may herald a wider collapse caused by global warming, a scientist said Saturday. “It’s amazing how the ice has ruptured,” said David Vaughan, a glaciologist with the British Antarctic Survey. “Two days ago it was intact,” he said, referring to a satellite image of the Wilkins ice shelf. The satellite picture, by the European Space Agency, showed that a strip of ice about 25 miles long that is believed to pin the ice shelf in place had snapped. The loss of the ice bridge could mean a wider breakup of the ice shelf, which is about the size of Connecticut. +http://www.nytimes.com/2009/04/05/science/earth/05antarctica.html \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090405, 
        "postID": 21, 
        "quote": "OSLO (Reuters) — An ice bridge holding a vast Antarctic ice shelf in place has shattered and may herald a wider collapse caused by global warming, a scientist said Saturday. “It’s amazing how the ice has ruptured,” said David Vaughan, a glaciologist with the British Antarctic Survey. “Two days ago it was intact,” he said, referring to a satellite image of the Wilkins ice shelf. The satellite picture, by the European Space Agency, showed that a strip of ice about 25 miles long that is believed to pin the ice shelf in place had snapped. The loss of the ice bridge could mean a wider breakup of the ice shelf, which is about the size of Connecticut.", 
        "reply": "Envisat’s Advanced Synthetic Aperture Radar (ASAR) captured the early stage of the disruption of the ice bridge that connects the Wilkins Ice Shelf to Charcot and Latady Islands on 2 April 2009 at 05:18 UTC. The new rifts that developed along the length axis of the ice bridge are visible. The first detachment along these new rifts occurred about seven hours later.  +http://www.nytimes.com/2009/04/05/science/earth/05antarctica.html \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 13:17:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "NSNN"
    }, 
    {
        "content": "oh no the end is near...", 
        "intTime": 20090405, 
        "postID": 22, 
        "quote": "", 
        "reply": "oh no the end is near...", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 13:33:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "outlaws93"
    }, 
    {
        "content": "if that puppy keeps melting they're going to actually SEE Atlantis... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090405, 
        "postID": 23, 
        "quote": "", 
        "reply": "if that puppy keeps melting they're going to actually SEE Atlantis... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 14:15:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Thanks to the non-GW believers. THANKS REPS! for flooding our nation.", 
        "intTime": 20090405, 
        "postID": 24, 
        "quote": "", 
        "reply": "Thanks to the non-GW believers. THANKS REPS! for flooding our nation.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 14:43:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made.", 
        "intTime": 20090405, 
        "postID": 25, 
        "quote": "Originally posted by outlaws93: oh no the end is near...", 
        "reply": " I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 14:46:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: if that puppy keeps melting they're going to actually SEE Atlantis... The 9th wonder of the world will be revealed under the ice.", 
        "intTime": 20090405, 
        "postID": 26, 
        "quote": "Originally posted by m551sheridan: if that puppy keeps melting they're going to actually SEE Atlantis...", 
        "reply": " The 9th wonder of the world will be revealed under the ice.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 14:47:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "A Scientist Cool. Maybe if more then one says something it might be less of a joke.", 
        "intTime": 20090405, 
        "postID": 27, 
        "quote": "", 
        "reply": "A Scientist Cool. Maybe if more then one says something it might be less of a joke.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 16:20:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Grimbo"
    }, 
    {
        "content": "Well, there ARE underwater volcanos in the Antartic, you know. \"\"http://www.usatoday.com/news/science/2004-05-20-new-volcano_x.htm \"\"http://www.environmentalgraffiti.com/featured/incredible-underwater-volcanoes/7827 \"\"http://www.livescience.com/environment/060524_underwater_volcano.html I wonder if the effects of these are in the climate models, if we've even found them all, and if rock a couple thousand degrees farenheit will warm water any?", 
        "intTime": 20090405, 
        "postID": 28, 
        "quote": "", 
        "reply": "Well, there ARE underwater volcanos in the Antartic, you know. \"\"http://www.usatoday.com/news/science/2004-05-20-new-volcano_x.htm \"\"http://www.environmentalgraffiti.com/featured/incredible-underwater-volcanoes/7827 \"\"http://www.livescience.com/environment/060524_underwater_volcano.html I wonder if the effects of these are in the climate models, if we've even found them all, and if rock a couple thousand degrees farenheit will warm water any?", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 16:44:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made. You're being sarcastic, right? as the hero leaves the global warming conference to dash in to the rescue ... in a PRIUS!.. anyway, the ice shelf didn't shatter, it relocated to North Dakota.", 
        "intTime": 20090405, 
        "postID": 29, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made.", 
        "reply": " You're being sarcastic, right? as the hero leaves the global warming conference to dash in to the rescue ... in a PRIUS!.. anyway, the ice shelf didn't shatter, it relocated to North Dakota.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 16:59:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "godawgz"
    }, 
    {
        "content": "", 
        "intTime": 20090405, 
        "postID": 30, 
        "quote": "", 
        "reply": "", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:07:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Well, there ARE underwater volcanos in the Antartic, you know. \"\"http://www.usatoday.com/news/science/2004-05-20-new-volcano_x.htm \"\"http://www.environmentalgraffiti.com/featured/incredible-underwater-volcanoes/7827 \"\"http://www.livescience.com/environment/060524_underwater_volcano.html I wonder if the effects of these are in the climate models, if we've even found them all, and if rock a couple thousand degrees farenheit will warm water any? That was my first thought when I saw the story. No one has said anything about seismic readings or volcanic activity that could have easily caused this as it has many times in the past. Of course if they ever admit thats what caused this to happen it would destroy their whole \"global warming is killing us\" charade even though its actually cooled globally the last three years. But hey, dont let a simple thing like facts get in the way of a good global warming hoax", 
        "intTime": 20090405, 
        "postID": 31, 
        "quote": "Originally posted by peter3_1: Well, there ARE underwater volcanos in the Antartic, you know. \"\"http://www.usatoday.com/news/science/2004-05-20-new-volcano_x.htm \"\"http://www.environmentalgraffiti.com/featured/incredible-underwater-volcanoes/7827 \"\"http://www.livescience.com/environment/060524_underwater_volcano.html I wonder if the effects of these are in the climate models, if we've even found them all, and if rock a couple thousand degrees farenheit will warm water any?", 
        "reply": " That was my first thought when I saw the story. No one has said anything about seismic readings or volcanic activity that could have easily caused this as it has many times in the past. Of course if they ever admit thats what caused this to happen it would destroy their whole \"global warming is killing us\" charade even though its actually cooled globally the last three years. But hey, dont let a simple thing like facts get in the way of a good global warming hoax", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:13:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Well I am willing to bet that ICE was not holding the thing in place.... Just how damn dumb do they take the world populace? Ice holding a shifting plate? BS! That would have to be some mighty strong and sticky ice...... But I regress, they think Gore preaches the gospel.", 
        "intTime": 20090405, 
        "postID": 32, 
        "quote": "", 
        "reply": "Well I am willing to bet that ICE was not holding the thing in place.... Just how damn dumb do they take the world populace? Ice holding a shifting plate? BS! That would have to be some mighty strong and sticky ice...... But I regress, they think Gore preaches the gospel.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:22:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Thanks to the non-GW believers. THANKS REPS! for flooding our nation. Cause I know your sitting in the dark and walk or bike everywhere. And only eat sun dried foods grown in your own garden. Right?", 
        "intTime": 20090405, 
        "postID": 33, 
        "quote": "Originally posted by crackerjacks61: Thanks to the non-GW believers. THANKS REPS! for flooding our nation.", 
        "reply": " Cause I know your sitting in the dark and walk or bike everywhere. And only eat sun dried foods grown in your own garden. Right?", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:26:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "carsleyt"
    }, 
    {
        "content": "quote: No one has said anything about seismic readings or volcanic activity that could have easily caused this as it has many times in the past. Well you can bet that \"IF\" the ice was holding it, and it shattered, there would be plenty of readings. Then they would have to prove which happened first. Ice shattering or seismic activity of plates moving.", 
        "intTime": 20090405, 
        "postID": 34, 
        "quote": "No one has said anything about seismic readings or volcanic activity that could have easily caused this as it has many times in the past.", 
        "reply": " Well you can bet that \"IF\" the ice was holding it, and it shattered, there would be plenty of readings. Then they would have to prove which happened first. Ice shattering or seismic activity of plates moving.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:29:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone?", 
        "intTime": 20090405, 
        "postID": 35, 
        "quote": "", 
        "reply": "Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone?", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 19:27:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: Well I am willing to bet that ICE was not holding the thing in place.... Just how damn dumb do they take the world populace? Ice holding a shifting plate? BS! That would have to be some mighty strong and sticky ice...... But I regress, they think Gore preaches the gospel. LOL...a shifting plate? Maybe you should look up the difference between a tectonic plate and an ice shelf.", 
        "intTime": 20090405, 
        "postID": 36, 
        "quote": "Originally posted by Woody_in_La: Well I am willing to bet that ICE was not holding the thing in place.... Just how damn dumb do they take the world populace? Ice holding a shifting plate? BS! That would have to be some mighty strong and sticky ice...... But I regress, they think Gore preaches the gospel.", 
        "reply": " LOL...a shifting plate? Maybe you should look up the difference between a tectonic plate and an ice shelf.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 19:41:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone? The loss of ice shelves does not affect sea levels -- floating ice contracts as it melts and so does not raise ocean levels. But their loss can allow glaciers on land to slide more rapidly toward the sea, adding water to the oceans. \"http://www.sciam.com/article.cfm?id=ice-bridge-holding-antarc\"", 
        "intTime": 20090405, 
        "postID": 37, 
        "quote": "Originally posted by peter3_1: Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone?", 
        "reply": " The loss of ice shelves does not affect sea levels -- floating ice contracts as it melts and so does not raise ocean levels. But their loss can allow glaciers on land to slide more rapidly toward the sea, adding water to the oceans. \"http://www.sciam.com/article.cfm?id=ice-bridge-holding-antarc\"", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 19:56:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Esample1"
    }, 
    {
        "content": "I think the fact that ice that is already displacing water does make water rise is about 3rd grade level science. We did it with ice cubes in a glass. When it melts, the water does not rise. As for glaciers, how many of them are near enough to an ocean to actually find their way into the ocean. Most will fill the nearest void near to them. And, if it is indeed getting warmer, then water would evaporate at an accelerated level. So, I would imagine that you cannot use static evaporation data and say what level the ocean would rise to. The simple fact is that we have already been in the warming period for some time (which was expected, it just came a little early), but we are going to be going back into a cooling cycle (which is also expected). The reality is that there is a ton of money to be made off of GW, so people will continue to talk about it, even if there were irrefutable evidence to the contrary. While there is no irrefutable evidence that GW doesn't exist, there is also no irrefutable evidence that it does exist. The only scientists that have been saying that it does are primarily those that work for the governments of the US and a few European countries. The one thing that is a fact is that the cycles of the sun have more of an impact on the warming and cooling of the earth than any activity actually originating on the earth. So, you better find a way to reduce solar flares, because it will get hot again... But, then again, it will also get cold again. Climate change, it's been around long before people decided to make it a buzz word in order to profit from it. It is almost as ingenious as the guy that duped everybody into buying bottled water. Almost...", 
        "intTime": 20090405, 
        "postID": 38, 
        "quote": "", 
        "reply": "I think the fact that ice that is already displacing water does make water rise is about 3rd grade level science. We did it with ice cubes in a glass. When it melts, the water does not rise. As for glaciers, how many of them are near enough to an ocean to actually find their way into the ocean. Most will fill the nearest void near to them. And, if it is indeed getting warmer, then water would evaporate at an accelerated level. So, I would imagine that you cannot use static evaporation data and say what level the ocean would rise to. The simple fact is that we have already been in the warming period for some time (which was expected, it just came a little early), but we are going to be going back into a cooling cycle (which is also expected). The reality is that there is a ton of money to be made off of GW, so people will continue to talk about it, even if there were irrefutable evidence to the contrary. While there is no irrefutable evidence that GW doesn't exist, there is also no irrefutable evidence that it does exist. The only scientists that have been saying that it does are primarily those that work for the governments of the US and a few European countries. The one thing that is a fact is that the cycles of the sun have more of an impact on the warming and cooling of the earth than any activity actually originating on the earth. So, you better find a way to reduce solar flares, because it will get hot again... But, then again, it will also get cold again. Climate change, it's been around long before people decided to make it a buzz word in order to profit from it. It is almost as ingenious as the guy that duped everybody into buying bottled water. Almost...", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 20:37:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. True... but is that the ONLY problem down there??? Just a few Ice Shelves disappearing? If that is so then no one needs to worry at all correct? No mean sea level rises are occuring, nor will they ever rise due to global warming... correct? Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone? Please post your source(s) Peter. Here is my source... care to impeach it? quote: Global sea level and the Earth's climate are closely linked. The Earth's climate has warmed about 1°C (1.8°F) during the last 100 years. As the climate has warmed following the end of a recent cold period known as the \"Little Ice Age\" in the 19th century, sea level has been rising about 1 to 2 millimeters per year due to the reduction in volume of ice caps, ice fields, and mountain glaciers in addition to the thermal expansion of ocean water. If present trends continue, including an increase in global temperatures caused by increased greenhouse-gas emissions, many of the world's mountain glaciers will disappear. For example, at the current rate of melting, all glaciers will be gone from Glacier National Park, Montana, by the middle of the next century (fig. 1). In Iceland, about 11 percent of the island is covered by glaciers (mostly ice caps). If warming continues, Iceland's glaciers will decrease by 40 percent by 2100 and virtually disappear by 2200. Most of the current global land ice mass is located in the Antarctic and Greenland ice sheets (table 1). Complete melting of these ice sheets could lead to a sea-level rise of about 80 meters (that is about 222 feet of rise) , whereas melting of all other glaciers could lead to a sea-level rise of only one-half meter Reduction of the West Antarctic and Greenland ice sheets similar to past reductions would cause sea level to rise 10 or more meters. A sea-level rise of 10 meters would flood about 25 percent of the U.S. population, with the major impact being mostly on the people and infrastructures in the Gulf and East Coast States (fig. 3)", 
        "intTime": 20090405, 
        "postID": 39, 
        "quote": "Originally posted by peter3_1: Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. True... but is that the ONLY problem down there??? Just a few Ice Shelves disappearing? If that is so then no one needs to worry at all correct? No mean sea level rises are occuring, nor will they ever rise due to global warming... correct? Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone?", 
        "reply": " Please post your source(s) Peter. Here is my source... care to impeach it? quote: Global sea level and the Earth's climate are closely linked. The Earth's climate has warmed about 1°C (1.8°F) during the last 100 years. As the climate has warmed following the end of a recent cold period known as the \"Little Ice Age\" in the 19th century, sea level has been rising about 1 to 2 millimeters per year due to the reduction in volume of ice caps, ice fields, and mountain glaciers in addition to the thermal expansion of ocean water. If present trends continue, including an increase in global temperatures caused by increased greenhouse-gas emissions, many of the world's mountain glaciers will disappear. For example, at the current rate of melting, all glaciers will be gone from Glacier National Park, Montana, by the middle of the next century (fig. 1). In Iceland, about 11 percent of the island is covered by glaciers (mostly ice caps). If warming continues, Iceland's glaciers will decrease by 40 percent by 2100 and virtually disappear by 2200. Most of the current global land ice mass is located in the Antarctic and Greenland ice sheets (table 1). Complete melting of these ice sheets could lead to a sea-level rise of about 80 meters (that is about 222 feet of rise) , whereas melting of all other glaciers could lead to a sea-level rise of only one-half meter Reduction of the West Antarctic and Greenland ice sheets similar to past reductions would cause sea level to rise 10 or more meters. A sea-level rise of 10 meters would flood about 25 percent of the U.S. population, with the major impact being mostly on the people and infrastructures in the Gulf and East Coast States (fig. 3)", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 21:53:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made. you know that was a movie and not reality right??? a m o v i e", 
        "intTime": 20090405, 
        "postID": 40, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made.", 
        "reply": " you know that was a movie and not reality right??? a m o v i e", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 21:56:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Envisat’s Advanced Synthetic Aperture Radar (ASAR) captured the early stage of the disruption of the ice bridge that connects the Wilkins Ice Shelf to Charcot and Latady Islands on 2 April 2009 at 05:18 UTC. The new rifts that developed along the length axis of the ice bridge are visible. The first detachment along these new rifts occurred about seven hours later. quote: OSLO (Reuters) — An ice bridge holding a vast Antarctic ice shelf in place has shattered and may herald a wider collapse caused by global warming, a scientist said Saturday. “It’s amazing how the ice has ruptured,” said David Vaughan, a glaciologist with the British Antarctic Survey. “Two days ago it was intact,” he said, referring to a satellite image of the Wilkins ice shelf. The satellite picture, by the European Space Agency, showed that a strip of ice about 25 miles long that is believed to pin the ice shelf in place had snapped. The loss of the ice bridge could mean a wider breakup of the ice shelf, which is about the size of Connecticut. +http://www.nytimes.com/2009/04/05/science/earth/05antarctica.html \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090405, 
        "postID": 41, 
        "quote": "OSLO (Reuters) — An ice bridge holding a vast Antarctic ice shelf in place has shattered and may herald a wider collapse caused by global warming, a scientist said Saturday. “It’s amazing how the ice has ruptured,” said David Vaughan, a glaciologist with the British Antarctic Survey. “Two days ago it was intact,” he said, referring to a satellite image of the Wilkins ice shelf. The satellite picture, by the European Space Agency, showed that a strip of ice about 25 miles long that is believed to pin the ice shelf in place had snapped. The loss of the ice bridge could mean a wider breakup of the ice shelf, which is about the size of Connecticut.", 
        "reply": "Envisat’s Advanced Synthetic Aperture Radar (ASAR) captured the early stage of the disruption of the ice bridge that connects the Wilkins Ice Shelf to Charcot and Latady Islands on 2 April 2009 at 05:18 UTC. The new rifts that developed along the length axis of the ice bridge are visible. The first detachment along these new rifts occurred about seven hours later.  +http://www.nytimes.com/2009/04/05/science/earth/05antarctica.html \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 13:17:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "NSNN"
    }, 
    {
        "content": "oh no the end is near...", 
        "intTime": 20090405, 
        "postID": 42, 
        "quote": "", 
        "reply": "oh no the end is near...", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 13:33:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "outlaws93"
    }, 
    {
        "content": "if that puppy keeps melting they're going to actually SEE Atlantis... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090405, 
        "postID": 43, 
        "quote": "", 
        "reply": "if that puppy keeps melting they're going to actually SEE Atlantis... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 14:15:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Thanks to the non-GW believers. THANKS REPS! for flooding our nation.", 
        "intTime": 20090405, 
        "postID": 44, 
        "quote": "", 
        "reply": "Thanks to the non-GW believers. THANKS REPS! for flooding our nation.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 14:43:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made.", 
        "intTime": 20090405, 
        "postID": 45, 
        "quote": "Originally posted by outlaws93: oh no the end is near...", 
        "reply": " I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 14:46:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: if that puppy keeps melting they're going to actually SEE Atlantis... The 9th wonder of the world will be revealed under the ice.", 
        "intTime": 20090405, 
        "postID": 46, 
        "quote": "Originally posted by m551sheridan: if that puppy keeps melting they're going to actually SEE Atlantis...", 
        "reply": " The 9th wonder of the world will be revealed under the ice.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 14:47:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "A Scientist Cool. Maybe if more then one says something it might be less of a joke.", 
        "intTime": 20090405, 
        "postID": 47, 
        "quote": "", 
        "reply": "A Scientist Cool. Maybe if more then one says something it might be less of a joke.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 16:20:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Grimbo"
    }, 
    {
        "content": "Well, there ARE underwater volcanos in the Antartic, you know. \"\"http://www.usatoday.com/news/science/2004-05-20-new-volcano_x.htm \"\"http://www.environmentalgraffiti.com/featured/incredible-underwater-volcanoes/7827 \"\"http://www.livescience.com/environment/060524_underwater_volcano.html I wonder if the effects of these are in the climate models, if we've even found them all, and if rock a couple thousand degrees farenheit will warm water any?", 
        "intTime": 20090405, 
        "postID": 48, 
        "quote": "", 
        "reply": "Well, there ARE underwater volcanos in the Antartic, you know. \"\"http://www.usatoday.com/news/science/2004-05-20-new-volcano_x.htm \"\"http://www.environmentalgraffiti.com/featured/incredible-underwater-volcanoes/7827 \"\"http://www.livescience.com/environment/060524_underwater_volcano.html I wonder if the effects of these are in the climate models, if we've even found them all, and if rock a couple thousand degrees farenheit will warm water any?", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 16:44:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made. You're being sarcastic, right? as the hero leaves the global warming conference to dash in to the rescue ... in a PRIUS!.. anyway, the ice shelf didn't shatter, it relocated to North Dakota.", 
        "intTime": 20090405, 
        "postID": 49, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made.", 
        "reply": " You're being sarcastic, right? as the hero leaves the global warming conference to dash in to the rescue ... in a PRIUS!.. anyway, the ice shelf didn't shatter, it relocated to North Dakota.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 16:59:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "godawgz"
    }, 
    {
        "content": "", 
        "intTime": 20090405, 
        "postID": 50, 
        "quote": "", 
        "reply": "", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:07:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Well, there ARE underwater volcanos in the Antartic, you know. \"\"http://www.usatoday.com/news/science/2004-05-20-new-volcano_x.htm \"\"http://www.environmentalgraffiti.com/featured/incredible-underwater-volcanoes/7827 \"\"http://www.livescience.com/environment/060524_underwater_volcano.html I wonder if the effects of these are in the climate models, if we've even found them all, and if rock a couple thousand degrees farenheit will warm water any? That was my first thought when I saw the story. No one has said anything about seismic readings or volcanic activity that could have easily caused this as it has many times in the past. Of course if they ever admit thats what caused this to happen it would destroy their whole \"global warming is killing us\" charade even though its actually cooled globally the last three years. But hey, dont let a simple thing like facts get in the way of a good global warming hoax", 
        "intTime": 20090405, 
        "postID": 51, 
        "quote": "Originally posted by peter3_1: Well, there ARE underwater volcanos in the Antartic, you know. \"\"http://www.usatoday.com/news/science/2004-05-20-new-volcano_x.htm \"\"http://www.environmentalgraffiti.com/featured/incredible-underwater-volcanoes/7827 \"\"http://www.livescience.com/environment/060524_underwater_volcano.html I wonder if the effects of these are in the climate models, if we've even found them all, and if rock a couple thousand degrees farenheit will warm water any?", 
        "reply": " That was my first thought when I saw the story. No one has said anything about seismic readings or volcanic activity that could have easily caused this as it has many times in the past. Of course if they ever admit thats what caused this to happen it would destroy their whole \"global warming is killing us\" charade even though its actually cooled globally the last three years. But hey, dont let a simple thing like facts get in the way of a good global warming hoax", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:13:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Well I am willing to bet that ICE was not holding the thing in place.... Just how damn dumb do they take the world populace? Ice holding a shifting plate? BS! That would have to be some mighty strong and sticky ice...... But I regress, they think Gore preaches the gospel.", 
        "intTime": 20090405, 
        "postID": 52, 
        "quote": "", 
        "reply": "Well I am willing to bet that ICE was not holding the thing in place.... Just how damn dumb do they take the world populace? Ice holding a shifting plate? BS! That would have to be some mighty strong and sticky ice...... But I regress, they think Gore preaches the gospel.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:22:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Thanks to the non-GW believers. THANKS REPS! for flooding our nation. Cause I know your sitting in the dark and walk or bike everywhere. And only eat sun dried foods grown in your own garden. Right?", 
        "intTime": 20090405, 
        "postID": 53, 
        "quote": "Originally posted by crackerjacks61: Thanks to the non-GW believers. THANKS REPS! for flooding our nation.", 
        "reply": " Cause I know your sitting in the dark and walk or bike everywhere. And only eat sun dried foods grown in your own garden. Right?", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:26:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "carsleyt"
    }, 
    {
        "content": "quote: No one has said anything about seismic readings or volcanic activity that could have easily caused this as it has many times in the past. Well you can bet that \"IF\" the ice was holding it, and it shattered, there would be plenty of readings. Then they would have to prove which happened first. Ice shattering or seismic activity of plates moving.", 
        "intTime": 20090405, 
        "postID": 54, 
        "quote": "No one has said anything about seismic readings or volcanic activity that could have easily caused this as it has many times in the past.", 
        "reply": " Well you can bet that \"IF\" the ice was holding it, and it shattered, there would be plenty of readings. Then they would have to prove which happened first. Ice shattering or seismic activity of plates moving.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:29:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone?", 
        "intTime": 20090405, 
        "postID": 55, 
        "quote": "", 
        "reply": "Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone?", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 19:27:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: Well I am willing to bet that ICE was not holding the thing in place.... Just how damn dumb do they take the world populace? Ice holding a shifting plate? BS! That would have to be some mighty strong and sticky ice...... But I regress, they think Gore preaches the gospel. LOL...a shifting plate? Maybe you should look up the difference between a tectonic plate and an ice shelf.", 
        "intTime": 20090405, 
        "postID": 56, 
        "quote": "Originally posted by Woody_in_La: Well I am willing to bet that ICE was not holding the thing in place.... Just how damn dumb do they take the world populace? Ice holding a shifting plate? BS! That would have to be some mighty strong and sticky ice...... But I regress, they think Gore preaches the gospel.", 
        "reply": " LOL...a shifting plate? Maybe you should look up the difference between a tectonic plate and an ice shelf.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 19:41:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone? The loss of ice shelves does not affect sea levels -- floating ice contracts as it melts and so does not raise ocean levels. But their loss can allow glaciers on land to slide more rapidly toward the sea, adding water to the oceans. \"http://www.sciam.com/article.cfm?id=ice-bridge-holding-antarc\"", 
        "intTime": 20090405, 
        "postID": 57, 
        "quote": "Originally posted by peter3_1: Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone?", 
        "reply": " The loss of ice shelves does not affect sea levels -- floating ice contracts as it melts and so does not raise ocean levels. But their loss can allow glaciers on land to slide more rapidly toward the sea, adding water to the oceans. \"http://www.sciam.com/article.cfm?id=ice-bridge-holding-antarc\"", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 19:56:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Esample1"
    }, 
    {
        "content": "I think the fact that ice that is already displacing water does make water rise is about 3rd grade level science. We did it with ice cubes in a glass. When it melts, the water does not rise. As for glaciers, how many of them are near enough to an ocean to actually find their way into the ocean. Most will fill the nearest void near to them. And, if it is indeed getting warmer, then water would evaporate at an accelerated level. So, I would imagine that you cannot use static evaporation data and say what level the ocean would rise to. The simple fact is that we have already been in the warming period for some time (which was expected, it just came a little early), but we are going to be going back into a cooling cycle (which is also expected). The reality is that there is a ton of money to be made off of GW, so people will continue to talk about it, even if there were irrefutable evidence to the contrary. While there is no irrefutable evidence that GW doesn't exist, there is also no irrefutable evidence that it does exist. The only scientists that have been saying that it does are primarily those that work for the governments of the US and a few European countries. The one thing that is a fact is that the cycles of the sun have more of an impact on the warming and cooling of the earth than any activity actually originating on the earth. So, you better find a way to reduce solar flares, because it will get hot again... But, then again, it will also get cold again. Climate change, it's been around long before people decided to make it a buzz word in order to profit from it. It is almost as ingenious as the guy that duped everybody into buying bottled water. Almost...", 
        "intTime": 20090405, 
        "postID": 58, 
        "quote": "", 
        "reply": "I think the fact that ice that is already displacing water does make water rise is about 3rd grade level science. We did it with ice cubes in a glass. When it melts, the water does not rise. As for glaciers, how many of them are near enough to an ocean to actually find their way into the ocean. Most will fill the nearest void near to them. And, if it is indeed getting warmer, then water would evaporate at an accelerated level. So, I would imagine that you cannot use static evaporation data and say what level the ocean would rise to. The simple fact is that we have already been in the warming period for some time (which was expected, it just came a little early), but we are going to be going back into a cooling cycle (which is also expected). The reality is that there is a ton of money to be made off of GW, so people will continue to talk about it, even if there were irrefutable evidence to the contrary. While there is no irrefutable evidence that GW doesn't exist, there is also no irrefutable evidence that it does exist. The only scientists that have been saying that it does are primarily those that work for the governments of the US and a few European countries. The one thing that is a fact is that the cycles of the sun have more of an impact on the warming and cooling of the earth than any activity actually originating on the earth. So, you better find a way to reduce solar flares, because it will get hot again... But, then again, it will also get cold again. Climate change, it's been around long before people decided to make it a buzz word in order to profit from it. It is almost as ingenious as the guy that duped everybody into buying bottled water. Almost...", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 20:37:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. True... but is that the ONLY problem down there??? Just a few Ice Shelves disappearing? If that is so then no one needs to worry at all correct? No mean sea level rises are occuring, nor will they ever rise due to global warming... correct? Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone? Please post your source(s) Peter. Here is my source... care to impeach it? quote: Global sea level and the Earth's climate are closely linked. The Earth's climate has warmed about 1°C (1.8°F) during the last 100 years. As the climate has warmed following the end of a recent cold period known as the \"Little Ice Age\" in the 19th century, sea level has been rising about 1 to 2 millimeters per year due to the reduction in volume of ice caps, ice fields, and mountain glaciers in addition to the thermal expansion of ocean water. If present trends continue, including an increase in global temperatures caused by increased greenhouse-gas emissions, many of the world's mountain glaciers will disappear. For example, at the current rate of melting, all glaciers will be gone from Glacier National Park, Montana, by the middle of the next century (fig. 1). In Iceland, about 11 percent of the island is covered by glaciers (mostly ice caps). If warming continues, Iceland's glaciers will decrease by 40 percent by 2100 and virtually disappear by 2200. Most of the current global land ice mass is located in the Antarctic and Greenland ice sheets (table 1). Complete melting of these ice sheets could lead to a sea-level rise of about 80 meters (that is about 222 feet of rise) , whereas melting of all other glaciers could lead to a sea-level rise of only one-half meter Reduction of the West Antarctic and Greenland ice sheets similar to past reductions would cause sea level to rise 10 or more meters. A sea-level rise of 10 meters would flood about 25 percent of the U.S. population, with the major impact being mostly on the people and infrastructures in the Gulf and East Coast States (fig. 3)", 
        "intTime": 20090405, 
        "postID": 59, 
        "quote": "Originally posted by peter3_1: Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. True... but is that the ONLY problem down there??? Just a few Ice Shelves disappearing? If that is so then no one needs to worry at all correct? No mean sea level rises are occuring, nor will they ever rise due to global warming... correct? Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone?", 
        "reply": " Please post your source(s) Peter. Here is my source... care to impeach it? quote: Global sea level and the Earth's climate are closely linked. The Earth's climate has warmed about 1°C (1.8°F) during the last 100 years. As the climate has warmed following the end of a recent cold period known as the \"Little Ice Age\" in the 19th century, sea level has been rising about 1 to 2 millimeters per year due to the reduction in volume of ice caps, ice fields, and mountain glaciers in addition to the thermal expansion of ocean water. If present trends continue, including an increase in global temperatures caused by increased greenhouse-gas emissions, many of the world's mountain glaciers will disappear. For example, at the current rate of melting, all glaciers will be gone from Glacier National Park, Montana, by the middle of the next century (fig. 1). In Iceland, about 11 percent of the island is covered by glaciers (mostly ice caps). If warming continues, Iceland's glaciers will decrease by 40 percent by 2100 and virtually disappear by 2200. Most of the current global land ice mass is located in the Antarctic and Greenland ice sheets (table 1). Complete melting of these ice sheets could lead to a sea-level rise of about 80 meters (that is about 222 feet of rise) , whereas melting of all other glaciers could lead to a sea-level rise of only one-half meter Reduction of the West Antarctic and Greenland ice sheets similar to past reductions would cause sea level to rise 10 or more meters. A sea-level rise of 10 meters would flood about 25 percent of the U.S. population, with the major impact being mostly on the people and infrastructures in the Gulf and East Coast States (fig. 3)", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 21:53:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made. you know that was a movie and not reality right??? a m o v i e", 
        "intTime": 20090405, 
        "postID": 60, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made.", 
        "reply": " you know that was a movie and not reality right??? a m o v i e", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 21:56:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "outlaws93"
    }, 
    {
        "content": "Envisat’s Advanced Synthetic Aperture Radar (ASAR) captured the early stage of the disruption of the ice bridge that connects the Wilkins Ice Shelf to Charcot and Latady Islands on 2 April 2009 at 05:18 UTC. The new rifts that developed along the length axis of the ice bridge are visible. The first detachment along these new rifts occurred about seven hours later. quote: OSLO (Reuters) — An ice bridge holding a vast Antarctic ice shelf in place has shattered and may herald a wider collapse caused by global warming, a scientist said Saturday. “It’s amazing how the ice has ruptured,” said David Vaughan, a glaciologist with the British Antarctic Survey. “Two days ago it was intact,” he said, referring to a satellite image of the Wilkins ice shelf. The satellite picture, by the European Space Agency, showed that a strip of ice about 25 miles long that is believed to pin the ice shelf in place had snapped. The loss of the ice bridge could mean a wider breakup of the ice shelf, which is about the size of Connecticut. +http://www.nytimes.com/2009/04/05/science/earth/05antarctica.html \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "intTime": 20090405, 
        "postID": 61, 
        "quote": "OSLO (Reuters) — An ice bridge holding a vast Antarctic ice shelf in place has shattered and may herald a wider collapse caused by global warming, a scientist said Saturday. “It’s amazing how the ice has ruptured,” said David Vaughan, a glaciologist with the British Antarctic Survey. “Two days ago it was intact,” he said, referring to a satellite image of the Wilkins ice shelf. The satellite picture, by the European Space Agency, showed that a strip of ice about 25 miles long that is believed to pin the ice shelf in place had snapped. The loss of the ice bridge could mean a wider breakup of the ice shelf, which is about the size of Connecticut.", 
        "reply": "Envisat’s Advanced Synthetic Aperture Radar (ASAR) captured the early stage of the disruption of the ice bridge that connects the Wilkins Ice Shelf to Charcot and Latady Islands on 2 April 2009 at 05:18 UTC. The new rifts that developed along the length axis of the ice bridge are visible. The first detachment along these new rifts occurred about seven hours later.  +http://www.nytimes.com/2009/04/05/science/earth/05antarctica.html \"None are more hopelessly enslaved than those who falsely believe they are free.\" -Johann Wolfgang von Goethe", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 13:17:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "NSNN"
    }, 
    {
        "content": "oh no the end is near...", 
        "intTime": 20090405, 
        "postID": 62, 
        "quote": "", 
        "reply": "oh no the end is near...", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 13:33:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "outlaws93"
    }, 
    {
        "content": "if that puppy keeps melting they're going to actually SEE Atlantis... One Flag......One Heart......One Nation............EVERMORE", 
        "intTime": 20090405, 
        "postID": 63, 
        "quote": "", 
        "reply": "if that puppy keeps melting they're going to actually SEE Atlantis... One Flag......One Heart......One Nation............EVERMORE", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 14:15:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "m551sheridan"
    }, 
    {
        "content": "Thanks to the non-GW believers. THANKS REPS! for flooding our nation.", 
        "intTime": 20090405, 
        "postID": 64, 
        "quote": "", 
        "reply": "Thanks to the non-GW believers. THANKS REPS! for flooding our nation.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 14:43:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made.", 
        "intTime": 20090405, 
        "postID": 65, 
        "quote": "Originally posted by outlaws93: oh no the end is near...", 
        "reply": " I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 14:46:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by m551sheridan: if that puppy keeps melting they're going to actually SEE Atlantis... The 9th wonder of the world will be revealed under the ice.", 
        "intTime": 20090405, 
        "postID": 66, 
        "quote": "Originally posted by m551sheridan: if that puppy keeps melting they're going to actually SEE Atlantis...", 
        "reply": " The 9th wonder of the world will be revealed under the ice.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 14:47:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "A Scientist Cool. Maybe if more then one says something it might be less of a joke.", 
        "intTime": 20090405, 
        "postID": 67, 
        "quote": "", 
        "reply": "A Scientist Cool. Maybe if more then one says something it might be less of a joke.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 16:20:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Grimbo"
    }, 
    {
        "content": "Well, there ARE underwater volcanos in the Antartic, you know. \"\"http://www.usatoday.com/news/science/2004-05-20-new-volcano_x.htm \"\"http://www.environmentalgraffiti.com/featured/incredible-underwater-volcanoes/7827 \"\"http://www.livescience.com/environment/060524_underwater_volcano.html I wonder if the effects of these are in the climate models, if we've even found them all, and if rock a couple thousand degrees farenheit will warm water any?", 
        "intTime": 20090405, 
        "postID": 68, 
        "quote": "", 
        "reply": "Well, there ARE underwater volcanos in the Antartic, you know. \"\"http://www.usatoday.com/news/science/2004-05-20-new-volcano_x.htm \"\"http://www.environmentalgraffiti.com/featured/incredible-underwater-volcanoes/7827 \"\"http://www.livescience.com/environment/060524_underwater_volcano.html I wonder if the effects of these are in the climate models, if we've even found them all, and if rock a couple thousand degrees farenheit will warm water any?", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 16:44:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made. You're being sarcastic, right? as the hero leaves the global warming conference to dash in to the rescue ... in a PRIUS!.. anyway, the ice shelf didn't shatter, it relocated to North Dakota.", 
        "intTime": 20090405, 
        "postID": 69, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made.", 
        "reply": " You're being sarcastic, right? as the hero leaves the global warming conference to dash in to the rescue ... in a PRIUS!.. anyway, the ice shelf didn't shatter, it relocated to North Dakota.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 16:59:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "godawgz"
    }, 
    {
        "content": "", 
        "intTime": 20090405, 
        "postID": 70, 
        "quote": "", 
        "reply": "", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:07:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "crackerjacks61"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Well, there ARE underwater volcanos in the Antartic, you know. \"\"http://www.usatoday.com/news/science/2004-05-20-new-volcano_x.htm \"\"http://www.environmentalgraffiti.com/featured/incredible-underwater-volcanoes/7827 \"\"http://www.livescience.com/environment/060524_underwater_volcano.html I wonder if the effects of these are in the climate models, if we've even found them all, and if rock a couple thousand degrees farenheit will warm water any? That was my first thought when I saw the story. No one has said anything about seismic readings or volcanic activity that could have easily caused this as it has many times in the past. Of course if they ever admit thats what caused this to happen it would destroy their whole \"global warming is killing us\" charade even though its actually cooled globally the last three years. But hey, dont let a simple thing like facts get in the way of a good global warming hoax", 
        "intTime": 20090405, 
        "postID": 71, 
        "quote": "Originally posted by peter3_1: Well, there ARE underwater volcanos in the Antartic, you know. \"\"http://www.usatoday.com/news/science/2004-05-20-new-volcano_x.htm \"\"http://www.environmentalgraffiti.com/featured/incredible-underwater-volcanoes/7827 \"\"http://www.livescience.com/environment/060524_underwater_volcano.html I wonder if the effects of these are in the climate models, if we've even found them all, and if rock a couple thousand degrees farenheit will warm water any?", 
        "reply": " That was my first thought when I saw the story. No one has said anything about seismic readings or volcanic activity that could have easily caused this as it has many times in the past. Of course if they ever admit thats what caused this to happen it would destroy their whole \"global warming is killing us\" charade even though its actually cooled globally the last three years. But hey, dont let a simple thing like facts get in the way of a good global warming hoax", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:13:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "FlankerFlyer"
    }, 
    {
        "content": "Well I am willing to bet that ICE was not holding the thing in place.... Just how damn dumb do they take the world populace? Ice holding a shifting plate? BS! That would have to be some mighty strong and sticky ice...... But I regress, they think Gore preaches the gospel.", 
        "intTime": 20090405, 
        "postID": 72, 
        "quote": "", 
        "reply": "Well I am willing to bet that ICE was not holding the thing in place.... Just how damn dumb do they take the world populace? Ice holding a shifting plate? BS! That would have to be some mighty strong and sticky ice...... But I regress, they think Gore preaches the gospel.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:22:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: Thanks to the non-GW believers. THANKS REPS! for flooding our nation. Cause I know your sitting in the dark and walk or bike everywhere. And only eat sun dried foods grown in your own garden. Right?", 
        "intTime": 20090405, 
        "postID": 73, 
        "quote": "Originally posted by crackerjacks61: Thanks to the non-GW believers. THANKS REPS! for flooding our nation.", 
        "reply": " Cause I know your sitting in the dark and walk or bike everywhere. And only eat sun dried foods grown in your own garden. Right?", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:26:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "carsleyt"
    }, 
    {
        "content": "quote: No one has said anything about seismic readings or volcanic activity that could have easily caused this as it has many times in the past. Well you can bet that \"IF\" the ice was holding it, and it shattered, there would be plenty of readings. Then they would have to prove which happened first. Ice shattering or seismic activity of plates moving.", 
        "intTime": 20090405, 
        "postID": 74, 
        "quote": "No one has said anything about seismic readings or volcanic activity that could have easily caused this as it has many times in the past.", 
        "reply": " Well you can bet that \"IF\" the ice was holding it, and it shattered, there would be plenty of readings. Then they would have to prove which happened first. Ice shattering or seismic activity of plates moving.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 18:29:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Woody_in_La"
    }, 
    {
        "content": "Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone?", 
        "intTime": 20090405, 
        "postID": 75, 
        "quote": "", 
        "reply": "Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone?", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 19:27:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "peter3_1"
    }, 
    {
        "content": "quote: Originally posted by Woody_in_La: Well I am willing to bet that ICE was not holding the thing in place.... Just how damn dumb do they take the world populace? Ice holding a shifting plate? BS! That would have to be some mighty strong and sticky ice...... But I regress, they think Gore preaches the gospel. LOL...a shifting plate? Maybe you should look up the difference between a tectonic plate and an ice shelf.", 
        "intTime": 20090405, 
        "postID": 76, 
        "quote": "Originally posted by Woody_in_La: Well I am willing to bet that ICE was not holding the thing in place.... Just how damn dumb do they take the world populace? Ice holding a shifting plate? BS! That would have to be some mighty strong and sticky ice...... But I regress, they think Gore preaches the gospel.", 
        "reply": " LOL...a shifting plate? Maybe you should look up the difference between a tectonic plate and an ice shelf.", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 19:41:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Esample1"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone? The loss of ice shelves does not affect sea levels -- floating ice contracts as it melts and so does not raise ocean levels. But their loss can allow glaciers on land to slide more rapidly toward the sea, adding water to the oceans. \"http://www.sciam.com/article.cfm?id=ice-bridge-holding-antarc\"", 
        "intTime": 20090405, 
        "postID": 77, 
        "quote": "Originally posted by peter3_1: Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone?", 
        "reply": " The loss of ice shelves does not affect sea levels -- floating ice contracts as it melts and so does not raise ocean levels. But their loss can allow glaciers on land to slide more rapidly toward the sea, adding water to the oceans. \"http://www.sciam.com/article.cfm?id=ice-bridge-holding-antarc\"", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 19:56:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "Esample1"
    }, 
    {
        "content": "I think the fact that ice that is already displacing water does make water rise is about 3rd grade level science. We did it with ice cubes in a glass. When it melts, the water does not rise. As for glaciers, how many of them are near enough to an ocean to actually find their way into the ocean. Most will fill the nearest void near to them. And, if it is indeed getting warmer, then water would evaporate at an accelerated level. So, I would imagine that you cannot use static evaporation data and say what level the ocean would rise to. The simple fact is that we have already been in the warming period for some time (which was expected, it just came a little early), but we are going to be going back into a cooling cycle (which is also expected). The reality is that there is a ton of money to be made off of GW, so people will continue to talk about it, even if there were irrefutable evidence to the contrary. While there is no irrefutable evidence that GW doesn't exist, there is also no irrefutable evidence that it does exist. The only scientists that have been saying that it does are primarily those that work for the governments of the US and a few European countries. The one thing that is a fact is that the cycles of the sun have more of an impact on the warming and cooling of the earth than any activity actually originating on the earth. So, you better find a way to reduce solar flares, because it will get hot again... But, then again, it will also get cold again. Climate change, it's been around long before people decided to make it a buzz word in order to profit from it. It is almost as ingenious as the guy that duped everybody into buying bottled water. Almost...", 
        "intTime": 20090405, 
        "postID": 78, 
        "quote": "", 
        "reply": "I think the fact that ice that is already displacing water does make water rise is about 3rd grade level science. We did it with ice cubes in a glass. When it melts, the water does not rise. As for glaciers, how many of them are near enough to an ocean to actually find their way into the ocean. Most will fill the nearest void near to them. And, if it is indeed getting warmer, then water would evaporate at an accelerated level. So, I would imagine that you cannot use static evaporation data and say what level the ocean would rise to. The simple fact is that we have already been in the warming period for some time (which was expected, it just came a little early), but we are going to be going back into a cooling cycle (which is also expected). The reality is that there is a ton of money to be made off of GW, so people will continue to talk about it, even if there were irrefutable evidence to the contrary. While there is no irrefutable evidence that GW doesn't exist, there is also no irrefutable evidence that it does exist. The only scientists that have been saying that it does are primarily those that work for the governments of the US and a few European countries. The one thing that is a fact is that the cycles of the sun have more of an impact on the warming and cooling of the earth than any activity actually originating on the earth. So, you better find a way to reduce solar flares, because it will get hot again... But, then again, it will also get cold again. Climate change, it's been around long before people decided to make it a buzz word in order to profit from it. It is almost as ingenious as the guy that duped everybody into buying bottled water. Almost...", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 20:37:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "10Tenths"
    }, 
    {
        "content": "quote: Originally posted by peter3_1: Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. True... but is that the ONLY problem down there??? Just a few Ice Shelves disappearing? If that is so then no one needs to worry at all correct? No mean sea level rises are occuring, nor will they ever rise due to global warming... correct? Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone? Please post your source(s) Peter. Here is my source... care to impeach it? quote: Global sea level and the Earth's climate are closely linked. The Earth's climate has warmed about 1°C (1.8°F) during the last 100 years. As the climate has warmed following the end of a recent cold period known as the \"Little Ice Age\" in the 19th century, sea level has been rising about 1 to 2 millimeters per year due to the reduction in volume of ice caps, ice fields, and mountain glaciers in addition to the thermal expansion of ocean water. If present trends continue, including an increase in global temperatures caused by increased greenhouse-gas emissions, many of the world's mountain glaciers will disappear. For example, at the current rate of melting, all glaciers will be gone from Glacier National Park, Montana, by the middle of the next century (fig. 1). In Iceland, about 11 percent of the island is covered by glaciers (mostly ice caps). If warming continues, Iceland's glaciers will decrease by 40 percent by 2100 and virtually disappear by 2200. Most of the current global land ice mass is located in the Antarctic and Greenland ice sheets (table 1). Complete melting of these ice sheets could lead to a sea-level rise of about 80 meters (that is about 222 feet of rise) , whereas melting of all other glaciers could lead to a sea-level rise of only one-half meter Reduction of the West Antarctic and Greenland ice sheets similar to past reductions would cause sea level to rise 10 or more meters. A sea-level rise of 10 meters would flood about 25 percent of the U.S. population, with the major impact being mostly on the people and infrastructures in the Gulf and East Coast States (fig. 3)", 
        "intTime": 20090405, 
        "postID": 79, 
        "quote": "Originally posted by peter3_1: Oh, it is floating ice. Even if it melts, it does not affect the sea levels in any way. True... but is that the ONLY problem down there??? Just a few Ice Shelves disappearing? If that is so then no one needs to worry at all correct? No mean sea level rises are occuring, nor will they ever rise due to global warming... correct? Anyone out there, when consulting the Vostok Ice Core DATA, able to pick a time on the graph where the climate is better than now? Anyone? Care to describe a better \"climate\", anyone, Bueller,....anyone?", 
        "reply": " Please post your source(s) Peter. Here is my source... care to impeach it? quote: Global sea level and the Earth's climate are closely linked. The Earth's climate has warmed about 1°C (1.8°F) during the last 100 years. As the climate has warmed following the end of a recent cold period known as the \"Little Ice Age\" in the 19th century, sea level has been rising about 1 to 2 millimeters per year due to the reduction in volume of ice caps, ice fields, and mountain glaciers in addition to the thermal expansion of ocean water. If present trends continue, including an increase in global temperatures caused by increased greenhouse-gas emissions, many of the world's mountain glaciers will disappear. For example, at the current rate of melting, all glaciers will be gone from Glacier National Park, Montana, by the middle of the next century (fig. 1). In Iceland, about 11 percent of the island is covered by glaciers (mostly ice caps). If warming continues, Iceland's glaciers will decrease by 40 percent by 2100 and virtually disappear by 2200. Most of the current global land ice mass is located in the Antarctic and Greenland ice sheets (table 1). Complete melting of these ice sheets could lead to a sea-level rise of about 80 meters (that is about 222 feet of rise) , whereas melting of all other glaciers could lead to a sea-level rise of only one-half meter Reduction of the West Antarctic and Greenland ice sheets similar to past reductions would cause sea level to rise 10 or more meters. A sea-level rise of 10 meters would flood about 25 percent of the U.S. population, with the major impact being mostly on the people and infrastructures in the Gulf and East Coast States (fig. 3)", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 21:53:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "ArtMarsh"
    }, 
    {
        "content": "quote: Originally posted by crackerjacks61: quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made. you know that was a movie and not reality right??? a m o v i e", 
        "intTime": 20090405, 
        "postID": 80, 
        "quote": "Originally posted by crackerjacks61: quote: Originally posted by outlaws93: oh no the end is near... I watched that movie the day after for the first time, how ridiculous..they made it sound like a natural event instead of man made.", 
        "reply": " you know that was a movie and not reality right??? a m o v i e", 
        "threadID": "672198221_6600029912001", 
        "time": "2009-04-05 21:56:00", 
        "title": "Ice Bridge Holding Antarctic Shelf in Place Shatters", 
        "userID": "outlaws93"
    }
]