[
    {
        "content": "Looks like the Argies really can't get over losing the Falklands the first time. quote: PM slams Falkland talks By STAFF REPORTER Published: 28 Mar 2009 GORDON Brown today dismissed Argentina’s calls for talks over ownership of the Falklands. The Prime Minister ruled out negotiations over the disputed territory during a 15 minute discussion with President Cristina Kirchner. The bilateral meeting between the leaders took place at a summit in Chile where the groundwork is being laid for next week’s crunch G20 meeting in London. A British official said: “The Prime Minister set out the British Government’s long standing position on sovereignty in very clear terms. He emphasised the importance of self-determination. “Both sides agreed that they have differences of opinion.” \"http://www.thesun.co.uk/sol/homepage/news/article2347504.ece\"", 
        "intTime": 20090330, 
        "postID": 1, 
        "quote": "PM slams Falkland talks By STAFF REPORTER Published: 28 Mar 2009 GORDON Brown today dismissed Argentina’s calls for talks over ownership of the Falklands. The Prime Minister ruled out negotiations over the disputed territory during a 15 minute discussion with President Cristina Kirchner. The bilateral meeting between the leaders took place at a summit in Chile where the groundwork is being laid for next week’s crunch G20 meeting in London. A British official said: “The Prime Minister set out the British Government’s long standing position on sovereignty in very clear terms. He emphasised the importance of self-determination. “Both sides agreed that they have differences of opinion.” \"http://www.thesun.co.uk/sol/homepage/news/article2347504.ece\"", 
        "reply": "Looks like the Argies really can't get over losing the Falklands the first time. ", 
        "threadID": "672198221_8150053912001", 
        "time": "2009-03-30 13:02:00", 
        "title": "British PM Brown slams talks with Argentina over Falklands", 
        "userID": "Canuck_Centaur"
    }, 
    {
        "content": "should have invested in the bust and not the full mr prez.", 
        "intTime": 20090330, 
        "postID": 2, 
        "quote": "", 
        "reply": "should have invested in the bust and not the full mr prez.", 
        "threadID": "672198221_8150053912001", 
        "time": "2009-03-30 13:07:00", 
        "title": "British PM Brown slams talks with Argentina over Falklands", 
        "userID": "world_king377"
    }, 
    {
        "content": "They may have a difference of opinion, but the British back their opinion with the bayonet... Needless to say the Falklands will stay British.", 
        "intTime": 20090330, 
        "postID": 3, 
        "quote": "", 
        "reply": "They may have a difference of opinion, but the British back their opinion with the bayonet... Needless to say the Falklands will stay British.", 
        "threadID": "672198221_8150053912001", 
        "time": "2009-03-30 13:13:00", 
        "title": "British PM Brown slams talks with Argentina over Falklands", 
        "userID": "GeraldM"
    }, 
    {
        "content": "how strange that the war decided by the type of rifle they used. both had the same but the Brits had the bust and the other the full.", 
        "intTime": 20090330, 
        "postID": 4, 
        "quote": "", 
        "reply": "how strange that the war decided by the type of rifle they used. both had the same but the Brits had the bust and the other the full.", 
        "threadID": "672198221_8150053912001", 
        "time": "2009-03-30 13:52:00", 
        "title": "British PM Brown slams talks with Argentina over Falklands", 
        "userID": "world_king377"
    }, 
    {
        "content": "The Falklands are British The Inhabitants call themselves British The British Government considers them British Argentinas claim is based upon Pope Alexander VI's 1493 Papal bull, the Inter Caetera which divided the New world Between Spain & Portugal. It didnt impress the world then either. And considering Argentina was even a Colony of Spain until 1580, they have no case. Britain has had a prescence there since 1812 at least with settlements. Another Argentine invasion will just make the South Atlantic run red with Argentine Blood. And the British would likely take the war to the Argentine Mainland this time. The Islands are now much better defended than in 1982.", 
        "intTime": 20090330, 
        "postID": 5, 
        "quote": "", 
        "reply": "The Falklands are British The Inhabitants call themselves British The British Government considers them British Argentinas claim is based upon Pope Alexander VI's 1493 Papal bull, the Inter Caetera which divided the New world Between Spain & Portugal. It didnt impress the world then either. And considering Argentina was even a Colony of Spain until 1580, they have no case. Britain has had a prescence there since 1812 at least with settlements. Another Argentine invasion will just make the South Atlantic run red with Argentine Blood. And the British would likely take the war to the Argentine Mainland this time. The Islands are now much better defended than in 1982.", 
        "threadID": "672198221_8150053912001", 
        "time": "2009-03-30 14:16:00", 
        "title": "British PM Brown slams talks with Argentina over Falklands", 
        "userID": "LineDoggie"
    }, 
    {
        "content": "The Falklands are British and will remain so, for the foreseeable future... The British have paid the price to make them British, HMS SHEFFIELD, HMS ANTELOPE, HMS SIR GALAHAD, HMS SIR TRISTRAM, just to name a few... IMHO... Respectfully, SUNLINER81", 
        "intTime": 20090330, 
        "postID": 6, 
        "quote": "", 
        "reply": "The Falklands are British and will remain so, for the foreseeable future... The British have paid the price to make them British, HMS SHEFFIELD, HMS ANTELOPE, HMS SIR GALAHAD, HMS SIR TRISTRAM, just to name a few... IMHO... Respectfully, SUNLINER81", 
        "threadID": "672198221_8150053912001", 
        "time": "2009-03-30 14:57:00", 
        "title": "British PM Brown slams talks with Argentina over Falklands", 
        "userID": "SUNLINER81"
    }
]